{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":0.8,"end":65.45,"speaker":"Steven Cristoforo","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":72.17,"end":136.36,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the Lord of Spirits podcast. I am Father Andrew Stephen Damick and if you're listening to us live, you can call in at 855 AF radio, which is 855-237-2346. And we are going to get to your calls in roughly the second half of today's show. So this is our very, very first episode. So today we're going to be discussing angels and demons as a way to introduce the program to you and lay some foundations and let you know what it's all about. So some of you are probably familiar with the work that I've done with Ancient Faith Radio, and I'm sure that many of you are familiar with my co host, Father Stephen DeYoung's podcast and blog, which are both titled the Whole Counsel of God. But especially for those of you who are totally new, I thought we'd begin by each telling a little bit about ourselves and especially why we're doing this new show. So, Father Stephen, why don't you introduce yourself to our listeners and tell them what you hope to accomplish with this program? Sure."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":136.92,"end":176.26,"speaker":"Fr Stephen De Young","text":"My name, as you said, is Father Stephen DeYoung, and I'm the pastor at Archangel Gabriel Orthodox Church in Lafayette, Louisiana. Beyond that, my origins are mostly shrouded in mystery. And I think the main thing I want to do here is disambiguate the two of us, right? Father Andrew Stephen Damick is one human person and Father Steven DeYoung is a different human person. Although my first name is his middle name and we both have a last name starting with a capital D. We are different humans."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":176.66,"end":182.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, so you're saying your middle name is not, Duh, Steven D. Young?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":183.3,"end":190.66,"speaker":"Fr Stephen De Young","text":"No, it's actually James, but I don't use it because apparently that confuses people, as you've discovered. As I discovered."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":190.98,"end":191.38,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":191.38,"end":228.61,"speaker":"Fr Stephen De Young","text":"And in terms of what we're here to accomplish, if anyone knows anything about me, you know, I'm a Bible guy and I do Bible stuff. And I think what I really want to do is do a little part of the work of helping English speaking American Orthodox Christians kind of appropriate more of the fullness of the Orthodox faith, particularly as it pertains to our spiritual sensibility, our sense of the spiritual world, and the way that can and should infuse our whole lives."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":229.33,"end":395.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Well. And as I said earlier, I'm Father Andrew Stephen Damick, and I work full time for Ancient Faith Ministries as their chief content officer, a position I started just from five, six weeks ago, actually. I did serve in parish ministry for 13 years, including 11 as a pastor. And one of the kind of fun things that Father Stephen and I share is that we actually have both had the same job, although I had it for just two years and he had it for eight. But we are both the former assistant pastor of St. George Orthodox Cathedral in Charleston, West Virginia. So hello to any of you Charleston people out there who are currently listening to two of your former assistant pastors. But I'm super interested in this show because I think that there's so much about spiritual life that it's easy for us not just to miss, but to have kind of endless struggles with that we don't necessarily have to have. And we're going to talk about this a lot as we go, and of course not just in this episode, but it's going to be perennial issue. The sense that we have that, that the 3D world that we experience is kind of all we feel like we can access most of the time. Right. But as Christians, we want to access something beyond this. And it's very frustrating when you maybe reach out for God or the saints and you're like, well, where are you? What's going on? Right? And serving as a pastor for 11 years, this is a perennial issue. And I think, you know, any pastors that are out there listening to this, I'm sure you've had the same experience. But even just Christians, you know that we all have this difficulty because we're modern people living in a way of thinking and looking at the world that makes it difficult to access spiritual reality. And so my interest is pastoral. I mean, it's also just like, I like to geek out about this kind of stuff. But I think one of the important kind of disambiguations, to use your term, Father Stephen, to make here at the beginning, is that just to define one of the differences between the two of us is that you are an actual biblical scholar and maybe make you list off the languages that you read at some point. And I'm not. So I'm not. It's not like, you know, and now we have a panel of two experts in biblical scholarship ready to answer your question. That's not what this show is. So if you've read Father Stephen's blog, the Whole Counsel of God, you listen to his podcast, you know that he's studied this stuff very, very closely and has a lot of really in depth knowledge. He actually has a doctorate. Is it Biblical studies or New Testament? I'm trying to remember which."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":396.02,"end":396.98,"speaker":"Fr Stephen De Young","text":"Biblical studies."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":396.98,"end":423.57,"speaker":"Fr Andrew Stephen Damick","text":"Biblical studies. Okay. This is my PhD. Yeah, yeah. He actually has a PhD in this stuff. I super don't. Right. But you know, when we were first talking about this show, I said to Father Steven, I said, so like, how are we gonna make sure that this show isn't just you telling about the things, you know, and me sitting there saying, that's awesome, dude, you're awesome. And your response was something like, well, you're way more practical than I am. Right. You know, so."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":423.73,"end":451.15,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, my original pitch was that you would read newspaper headlines and then I would explain how that relates to End Times prophecy, but you nixed that. And then, yeah, you are more practical and also much more of a professional broadcaster. So without you, this would just be the semi unending ramblings of a crazed nerd."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":452.19,"end":699.01,"speaker":"Fr Andrew Stephen Damick","text":"Right. But I'll also say, so I think one of the things that you're going to hear as we go on this show is I want to be learning. Right. I've learned a lot from my friendship with Father Stephen and I'm trying to learn from a lot of other sources as well. I mean, Father Stephen sends me stuff all the time and it's great. And part of that is what we want to accomplish with this is that we're going to be in a learning process together and that being an orthodox Christian isn't about mastering a specific set of data. And now you've got it down and you're catechized and you're good to go. You know, when you get to the gates of heaven, they're going to check and make sure that you can answer all the catechetical Questions like, that's not the way that being a Christian actually works. And, you know, in the past few years, a lot of things have really kind of opened my eyes to whole parts of orthodox tradition that are there and often are staring us in the face, but that we're often not paying attention to. And I'll just give one example. Okay? So you're probably gonna hear us talk a lot about what we're gonna call spiritual geography, right? So where is paradise? Where is the underworld? You know, the mountain of God, Hades? Like, all this kind of stuff. Okay. And one of the things that. One of the teachings that's actually preserved in the Orthodox Church and has been handed down for many, many, many centuries, but that I. I've been an Orthodox Christian for over 20 years now that I never actually paid attention to. So if you had come up to me and said, does the church teach this? I would be like, I've never heard that. And one of those things is this teaching that St. John the Forerunner, John the Baptist, went to Hades to preach the coming of Christ. Now, you're not going to see that in the Bible, but it is a belief that is actually in orthodox tradition. And so I actually noticed this for the first time just a few years ago. And the funny thing is, it's actually kind of staring you in the face. It's referenced in lots of places, especially in our liturgical tradition. So, for instance, a couple weeks ago on the new calendar, we just celebrated the beheading of John the Baptist, that feast. And I had noticed that in the Apolitikian, which is kind of one of the main hymns for the feast, that it actually mentions that he goes to Hades to preach there. And I. I'd sung it for years, but I had never just taken notice of that particular phrase. It's in the Apolitikan. And so I started looking at other texts. And you know what? It's in the Kentuckian, too, the other main hymn for the day. And then I started looking at more and more, especially throughout the Manaen, which is the main set of festal texts for the feast. And it's everywhere. It's mentioned over and over that he goes to the underworld to preach to those in Hades. And so that's just one example of something that's right there in our tradition and kind of stick staring you in the face. But unless you're oriented towards paying attention to it, you're probably just going to kind of skip over it, not really even know that it's there. And so if I had to, if someone were to say to me, you know, say in a nutshell, what is this show about? It's about talking especially about those things that are right there in the Bible, right there in the church services, right there in the church fathers. But, but that maybe we've never noticed or we didn't know what to do with it so we just kind of skipped over it. Or maybe it was hidden behind a translation issue and we just didn't know because we don't read the original languages. And sometimes these are really kind of important issues, right. It's not just obscure little things like, oh, that's neat, you know, it's really important issues for your spiritual life. So I don't know, that's a much longer way of saying what my motivation is for doing this. So. But I think it's important for us to lay this stuff out at the beginning so that people get the idea. This is not a couple of professors teaching the class in demonology or angelology or any of that kind of stuff. That's not what's going on. But obviously we're going to be touching on a lot of those kinds of topics. Is there anything else that Father you wanted to add in terms of laying out what it is we're trying to accomplish with this particular show?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":700.18,"end":728.01,"speaker":"Fr Stephen De Young","text":"Well, just going along with what you were just saying that. And one of the questions that we will probably end up getting asked relatively frequently is sort of why people haven't heard this stuff before. Right. And you know, I get that at least when I go dredging up some Ugaritic legend or something and saying, oh, see, this explains this icon, you know."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":728.73,"end":734.49,"speaker":"Fr Andrew Stephen Damick","text":"And by the way, wait, what is Ugaritic? Is one one of the obscure languages that Father Steve knows how to read."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":735.05,"end":794.99,"speaker":"Fr Stephen De Young","text":"It's, it's super helpful if we ever get a time machine. And I can go back to like 1500 B.C. but you know, and it's important to recognize that the, the one of the things, as you just mentioned, once some, you read something or someone tips you off to these things, you start seeing them in iconography, you start hearing them in the hymns of the church, like they're everywhere. It's just we haven't been taught to sort of think in that way and think in that direction. So our orthodox tradition has sort of preserved all of these data points, has preserved all of this information and all of this context for us. It's just we haven't necessarily, as English speaking orthodox Christians in the west, sort of fully appropriated how to connect those dots and how it all fits together and what the connective tissue is between these different things, between this biblical passage and this icon and this hymn."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":795.55,"end":964.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that, you know, as people living in the west, we tend to value education a great deal. And so this is one of the places where a godly education. Right. An appropriately spiritually formed education, can really be helpful to us. Right. So we're not talking about academia in all the negative ways that people tend to use that term. Right. It's not about ripping apart the tradition or destroying what people believe or anything like that, but actually using all kinds of great tools of study that show us, as you said, the connective tissue between things that are right there in our tradition. So the question is not should this be in our tradition, but why is it there and how does it connect with all this other stuff? You know, So I think people are going to be delighted and really excited and interested in a lot of the stuff that we're going to be talking about. And in many ways, you're never going to be able to see the Bible in the same way again. Like, I remember the time you told me that the book of Joshua was about giants. I was like, wait, what? What. What about giants? You know, And I was just really excited to hear that, you know, and that's one of the books that a lot of people never want, don't want to read because they feel like it's a book about genocide, you know, and we're not going to talk, you know, this is not the giants episode, but there is going to be a giants episode. So, yeah, giants and dragons and all these things are in the scripture and in our tradition. And so the question is, what do we do with that and how do we understand what it means, and then how do we best live in that reality? You know, you don't want to open up boxes that you shouldn't open. But there's also just a reality of spirit, a spiritual reality that's. That's there. So, anyway, so I, you know, we want to start our discussion today. As I said, this is. This is an episode about laying the foundations for the rest of what this show is going to be. And we're going to. By the way, we're going to be on twice a month. So the second and fourth Thursday of the month. It's not exactly fortnightly, because occasionally there's going to be five Thursdays in a month. Right. So. But it's going to be the second and fourth Thursdays of the month. And, you know, that's when you're going to be able to tune in live. And it will be available as a podcast for those of you who can't tune in live for whatever reason. You're in a time zone that's halfway across the world or you have something going on. Right. But I wanted to start with this discussion of the question of materialism. Okay. I think in Christian circles we tend to use the word materialism as a kind of synonym for greed. Right. You know, that person is very materialistic, they want to buy a lot of stuff, they're obsessed with their stuff. But that's not what we mean by materialism in what we're talking about. So if you had to give a nutshell definition of materialism, Father, what would you say?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":966.26,"end":976.43,"speaker":"Fr Stephen De Young","text":"It's basically the belief that matter and energy and their co relationships and interactions are all that exists."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":977.71,"end":981.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there's no demons out there, no fairies, Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":981.11,"end":985.95,"speaker":"Fr Stephen De Young","text":"There's no demons, no God. No God, no miracles."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":986.19,"end":987.47,"speaker":"Fr Andrew Stephen Damick","text":"Just you don't have a soul."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":988.35,"end":990.75,"speaker":"Fr Stephen De Young","text":"Mathematics and science can explain everything."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":993.07,"end":1305.91,"speaker":"Fr Andrew Stephen Damick","text":"And yeah, it's just atoms bouncing off each other and that's all there is, right? Yeah. So it's sort of the ultimate, in some ways, it's kind of the ultimate deterministic universe where everything that you think and feel and do and say was actually determined from the moment of, say, a big bang, which got all the atoms bouncing off of each other and now they've bounced and they made you for this one little blip in time. And if that sounds ultimately kind of meaningless, that's because it is. But we don't believe that. We're not materialists. We believe that there's an immaterial character to reality. But here's the thing, right? Modern Christians, I think, are materialists. And here's why I would say that it's not because most Christians don't believe that there's an immaterial element of reality, that they don't believe they have a soul, that they don't believe there's angels, that they don't believe that God is real. Right. Christians will say, I mean, I've never met a Christian that that doesn't believe in an immaterial reality. Maybe they're out there, I don't know. It doesn't look like Christianity to me. But I would say that modern Christians are materialists, not on purpose, but by habit. Right. That on a day to day basis, the way we mostly live our lives is as though the 3D world of the senses is all that there is. Right. The example I Often give is, you know, one time I ate a lot of pizza and some spicy hot wings. And you know, I'm getting to be middle aged. In fact, Father Steven and I are almost the same age. He is a little older by just a few months, if I remember correctly. You know, you know, get middle aged, you eat hot wings and pizza and stuff, and your innards are going to let you know later in the day, maybe immediately that that was not the best thing to do. Right? So what do we do when we have, you know, acid indigestion? You take antacids, chew up those, those little, those little pills, I like the mint flavored ones, and you feel better. And that's all there is to it. You had a problem, so you took a medicine and boom, you're better, right? There's nothing wrong with that. But like, what point along that, that continuum of experience and response did I include anything having to do with God or the saints? I mean, if the idea of having acid indigestion sounds like it's too trivial to involve God in, then that means that you are a materialist by habit, right? And I am, right? I think everybody listening to this probably is. Now it's possible that there's some very spiritual people listening to this who aren't. And if you are, please pray for us. Right? But I think most of us are materialists by habit. The other example I give is like if someone, you know, I experienced this many times as a pastor. Someone gets sick, they go to the hospital. After they're at the hospital, they call the priest. It's interesting, the order, right? First let's go get the medicine and then after that we'll add some prayer, right? There's nothing wrong with the medicine. There's nothing wrong with going to the hospital. There's nothing wrong with the doctor. I mean, those are all things God provides. But we tend to think of prayer as kind of a frosting on the cake, you know, or like, well, make sure you pray. You know, that's the way that we function. We're sort of materialists by habit. By habit. And so this presents a problem to us, especially when we're actually then experienced something in life where we realize that our material habits actually don't address our problem, that don't address my. And it's not just the problems of like everyday aches and pains or things to solve in your life, but the problem of being a sinful person in this world and trying to be faithful to Christ. That's the problem. Right? And if you're a materialist by habit, then that makes that problem a lot harder. A lot harder. Because you feel like you don't really have access to God very much. Like, oh, yeah, I pray all the time. And some people say, oh, I feel that God is with me. But, like, do you know, I mean, do you have a sense he's actually there? Right. And one of the things you probably notice if you read the Bible enough or if you read other kinds of ancient sources, is that a lot of people in those texts are not like that. They have a sense that God is with them and that spirits are there. Right. So there is a difference between us and them, and I think it's mainly a difference of habit. Right. And we're going to get into that as to what. What can you do about that? But, but that's one of the things that we want to try to address with this show is, is how to. And this is where kind of the more some of the practical side of this comes in. It's like how to you to alter your habits so that you are more human, actually, and more in tune with all of reality and not just the 3D world of the senses. Right. So, I mean, you have anything you wanted to add to that, Father?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1306.47,"end":1326,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I think the way it pragmatically works out for most Christians in America and in the west is you have essentially two incompatible ideas. You have basically an atheist worldview and a Christian worldview that you're kind of switching back and forth between."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1326.56,"end":1328.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Atheists most of the time."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1329.52,"end":1387.21,"speaker":"Fr Stephen De Young","text":"And. Yeah, and that works. You know, the analogy I use, I guess it's an analogy is that we sort of have this set of brackets where we sort of bracket off certain things. Right. So, like the miraculous stuff that happened in the scriptures. Okay, well, I got to believe that that's real, and I believe in God. So we put the brackets around God and the miracles in scripture, and then depending on what sort of Christian group you're in, those brackets may be very wide or very narrow, but they're always sort of there. There's always a point where you go outside those brackets and where we start becoming sort of naturalists again. So if someone, you know, if a Buddhist comes to you and claims there was a miracle, the first thought of most American Christians is not, well, this is demonic activity. The first thought of most American Christians is bull."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1387.21,"end":1387.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1387.57,"end":1389.77,"speaker":"Fr Stephen De Young","text":"You're making that up. That never happened."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1390.01,"end":1416.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or your elderly aunt comes to you and says, your grandmother talked to me last night. Your dead grandma. She came to Me, you're like, is that. Well, I'm gonna. You know, that's nice. Right? Like, we tend to function that way. We don't give credence to it. Now the problem is, I think that we have this fear that if you start to give credence to it, then you become gullible. Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1416.82,"end":1417.86,"speaker":"Fr Stephen De Young","text":"Which we don't want to be."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1418.26,"end":1426.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. You don't want to be superstitious. That's not the same. Like, we're not teaching people how to be superstitious as well. That's not what we're doing."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1426.9,"end":1440.03,"speaker":"Fr Stephen De Young","text":"You know, but atheists will make hay of that. They say, hey, I'm just saying the same thing about your miracles that you say about everybody else's. I'm just saying the same thing about your God that you say about everybody else's."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1440.11,"end":1445.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I just believe in one fewer God than you do. I've heard that a bunch of times."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1445.63,"end":1454.69,"speaker":"Fr Stephen De Young","text":"Yeah. And they kind of have a point in that. All too often, we are basically looking at most of the world the same way they do."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1455.64,"end":1455.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1455.88,"end":1462.56,"speaker":"Fr Stephen De Young","text":"And then being inconsistent in these areas, you know, that we've got bracketed off. And you can't."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1462.56,"end":1470.6,"speaker":"Fr Andrew Stephen Damick","text":"You can't just like, flip a switch and decide, okay, I'm gonna be. I'm not gonna be a materialist anymore. Today I will believe in spirits."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1470.68,"end":1499.91,"speaker":"Fr Stephen De Young","text":"You know, like, well, this I'm gonna be. I'm gonna court a low grade controversy by saying the rubber met the road with this recently with a lot of people, even in our Orthodox circles where when the pandemic started and people were saying, okay, we need to take reasonable precautions, we need to be in obedience to our bishops and the civil government. But we also need prayer, incense. You know, in Orthodox countries, people are going out with holy water in the streets."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1500.23,"end":1500.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1500.79,"end":1519.57,"speaker":"Fr Stephen De Young","text":"And a lot of our Christian brothers and sisters in the United States were like, okay, guys, this is serious. This is a disease. This is real. In response, yeah, all that stuff's fun on Sunday morning, but this is a serious situation. People are dying."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1519.89,"end":1524.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, don't call a priest for this. We need epidemiologists."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1527.65,"end":1559.33,"speaker":"Fr Stephen De Young","text":"And it's not that we're saying your local Orthodox priest is a witch doctor and don't take medicine. Right. That's the other opposite extreme. That the world is composed of both the physical world that's described by science and the spiritual world that we come to experience through Christ. And those two have to be kept together. And the problem is we're at one extreme. The answer is not to go to the opposite Extreme."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1559.57,"end":1586.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. I mean, that's one of the reasons that. Why in, like, the description for the show, I wanted to especially use that phrase, the union of the seen and the unseen. Right. You know, we're not just talking about, like, this is not a show about ghosts. Right. It's not like, you know, here's how you deal with your haunted house. Although I'm sure I hope we do get at least one caller that calls in and says that their house is haunted. And what do you do about that? Because there is something to do, actually. Yes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1586.34,"end":1591.66,"speaker":"Fr Stephen De Young","text":"And I have done it. I've done an exorcist. I've done an exorcism on a house to tease everyone."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1591.98,"end":1646.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go. All right, everybody. Yeah, so that's the problem of materialism. Right. And so in a few minutes, we're going to go for our first break, but before we get to that, let's just talk for just a very few minutes about the title of this podcast which you and I talked about this. We went back and forth for weeks to try to figure out exactly the right. The right thing. And I'm not gonna. Unfortunately, I've forgotten most of the bad suggestions that we had. But we finally settled on Lord of Spirits. Lord of Spirits, which. Which one person with. With ancient faith radio kept calling Lord of the Spirits. I was like, oh, maybe we'll get a few Lord of the Rings fans. That wouldn't make me unhappy at all. But no, it's Lord of. Lord of Spirits. Although you could say Lord of the Spirits. That works, too. Lord of Spirits. So it's not a phrase, you see, I don't think it's in the Bible, is it? Is it in the Bible?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1647.77,"end":1650.49,"speaker":"Fr Stephen De Young","text":"Well, it depends on your Bible. Are you Ethiopian?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1650.89,"end":1659.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, there you go. Yeah. Okay. So, yes, open that up for us a little bit. Where does this phrase Lord of Spirits come from and why did we pick it?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1660.01,"end":1746.53,"speaker":"Fr Stephen De Young","text":"So, Lord of Spirits is one of several titles that's ascribed to God in the Enochic literature, which is the various books of Enoch, as well as other books like the Apocalypse of Abraham and the Book of Jubilees and a few other texts in the Dead Sea Scrolls. Lord of Spirits is mostly used in the second portion of first Enoch or the Book of Enoch, which is called the Book of Parables. And the reason it's used there is that it's a title for God that describes his relationship with the other spiritual beings whom he created. And so it's a way of referring to God in relationship to the heavenly host, the Divine Council, some of these other concepts that we're going to be talking about a lot, not only in this episode, but in a bunch of episodes, and I'm sure in People's Questions, the parallel title that you find more commonly in the Hebrew Bible is Yahweh Sabaoth, which is usually translated Lord Sabaoth. And a lot of people in the liturgy, we transliterate rather than translate."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1748.77,"end":1749.17,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1749.33,"end":1754.77,"speaker":"Fr Stephen De Young","text":"And so because of the way it looks in English, the way it's spelled in English, people think it refers to the Sabbath."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1755.01,"end":1755.89,"speaker":"Fr Andrew Stephen Damick","text":"Sabbath, right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1756.77,"end":1761.17,"speaker":"Fr Stephen De Young","text":"And when I say people, I have a recording of Bart Ehrman saying that."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1761.41,"end":1762.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh, boy."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1762.13,"end":1764.89,"speaker":"Fr Stephen De Young","text":"So his Hebrew isn't really up to snuff. Yes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1764.89,"end":1768.33,"speaker":"Fr Andrew Stephen Damick","text":"Yikes. I mean, I don't read Hebrew, but I. I know that that's not the."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1768.33,"end":1793.98,"speaker":"Fr Stephen De Young","text":"Same word, but tsava. OT is the OT ending is a feminine plural ending in Hebrew. Tzava means to be many, to team, to be many. And so that in a nominal form, in the plural means like big groups or hosts. Lord of hosts is how the King James Old Testament."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1795.1,"end":1881.35,"speaker":"Fr Andrew Stephen Damick","text":"So we sing, right? In the anaphora of the Divine Liturgy, we sing, you know, what in Latin is called the Sanctus, right? Holy, holy, holy Lord of Sabaoth Heaven and earth are full of thy glory. Right? So this is one of those things like. So we're talking about it here. Now, this is one of those things that's right there, core piece of our liturgical tradition. I mean, it is right there at the heart of the Divine Liturgy we call God the Lord, Sabaoth, the Lord of Hosts, right? And so it's there. And you. It doesn't just mean that he's got a lot of angels available to him, and we're going to be talking about all of that. But, you know, he is Lord of Hosts. And it's interesting. And it also comes in, if you've ever gone to great compline, which we especially serve during, at least in our tradition, during great Lent. But it shows up, of course, at other times of the liturgical year. There is a. There is a hymn in there called Lord of Hosts. O Lord of Hosts, be with us for we have no other help but in times of sorrow but thee. Right? Which is, in the Byzantine tradition, is just a wonderful, big, throaty, kind of manly hymn. But what's interesting is that in Greek, it's Kyrie thynameon, Lord of powers. But it means the same thing, right? I mean, that's just simply the. Isn't that just the Septuagint translation of, you know, Lord Sabaoth, Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1881.67,"end":1903.03,"speaker":"Fr Stephen De Young","text":"Yeah, it gets complicated because the Septuagints in different ways. But yeah, it's the same kind of idea. God of the powers, the hymn, the Trisaghian, the Holy, holy, holy Lord Sabaoth is being sung by the angels. And it's a way of the angels expressing and worshiping him as their God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1903.43,"end":1903.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1904.4,"end":1921.28,"speaker":"Fr Stephen De Young","text":"That's a way we don't always think about it. And that's why there's a similar phrase also in our memorial prayers, which is actually taken directly from the Book of Jubilees. A different piece of Enochic literature where the prayer begins, O God of spirits and of all flesh."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1921.76,"end":1976.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. Another piece that probably just rattles by most of us, like I prayed it for years as a priest, oh, God of spirits and of all flesh, you know, But I never paused and thought, wait, wait, who are the spirits that we're saying he's the God of? Exactly. Well, this is what we're talking about, right? That's what this is. So. All right. Well, we're going to take a break now, but when we come back from the break, we're going to start talking about the many different ways that the word gods is used in the Bible. So, you know, we want you to call in. We're going to take calls in the second half of the show. You can call at 855-AFradio, that is 855-237-2346. And I have to admit, I'm always tempted to say 855 Afraidio, but then I think people might put the letter I in there somewhere where it shouldn't be. But anyways. All right, well, let's take a break and we will be right back in just a few minutes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":1976.46,"end":2072.95,"speaker":"Steven Cristoforo","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds minds tell them otherwise. Please join me in exploring the three legged stool of orthodox spiritual practice, Prayer, fasting and almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless. We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2078.55,"end":2156.78,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we are back. And before we get to our discussion about the way the word gods is used in the Bible, I just wanted to thank the man whose voice you just heard, and that is our good friend Steven Cristoforo who's provided the voiceover work for this podcast. I think he just nailed it. So if you know Steve, tell him that he did a fine job. Thank you, Steve. I hope that you're listening. So, yeah, so let's talk about the word gods as it's used in the Bible because that I think is going to be one of the ways that people are going to hear stuff that we're going to say on this show and it's going to sound weird to them and they're going to want wonder if we're actually Christians because we're saying, well, I believe in lots of gods actually, you know, but so let's talk about why as a Christian, you can and should believe in many gods if that doesn't weird you out too much. So let's begin by talking about how the word gods is actually used in the Bible. And this is one of the ways that sometimes translation is hiding something from us. Right. So we have an English translation that might use other kinds of words, but lurking underneath is a Hebrew word or a Greek word that actually is saying gods, but it doesn't get translated as gods in English. So what are some examples of that?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2156.78,"end":2164.9,"speaker":"Fr Stephen De Young","text":"Father yeah. Before we freak everybody out, let me give one more proviso in terms of why we're freaking everybody out."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2165.06,"end":2165.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2166.74,"end":2245.41,"speaker":"Fr Stephen De Young","text":"One might wonder why you would do this to people. The reality is that there are certain things that are just in the scriptures, whether we as sort of modern Christians with a materialist bent kind of are comfortable with that or not. And they have a way of speaking. And from the Victorian era through until probably the 1950s or so in America, there was sort of a gentleman's agreement that we would all sort of pick paper over these things in our English translations and not push on them too. Not push on them too hard so that we could all be comfortable. And the problem is that if we want to continue to do that as Orthodox Christians, we're setting ourselves up for a problem with future generations. Because while I may not want to get into, say, a passage in the Old Testament that talks about human sacrifice, the atheist roommate of my son or daughter, the atheist professor of my son or daughter is going to have no such qualms about bringing up all of these things."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2245.65,"end":2247.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Uncomfortable stuff in the Bible."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2248.37,"end":2273.37,"speaker":"Fr Stephen De Young","text":"And when that happens, if we have tried to paper over it and not talked about it and not explained it to our people, not only are they going to fall for whatever narrative they're told, but we're not going to have any credibility to come back with a response because we've already proven that we're trying to keep things from them."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2273.77,"end":2276.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're embarrassed by our own central text."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2277.45,"end":2289.94,"speaker":"Fr Stephen De Young","text":"Yeah. So that's why we're going to talk about these kind of things. It's not because we're trying to shake anybody up or be firebrands or cause controversy or."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2289.94,"end":2411.69,"speaker":"Fr Andrew Stephen Damick","text":"No, no. I mean, you and I. I mean, you and I are both dedicated to being solid, normal, mainstream orthodox Christians. Right. You know, that hopefully the only thing extreme about us is our repentance. And I'm. I'm just learning that, you know, you know, these are not like. This is not about pitching crackpot theories, folks. It's not. It's about looking very closely at our Bible, at our church fathers, at our church services, and saying, what do they really say and what are they taking seriously that maybe we're not. Right. So, you know, one of the examples, and, you know, Father Steven has very helpfully provided a lot of the research for this. One of the examples that we have in our notes that I thought is a great place to start, and it's kind of a shocking passage, just if you just simply read it and actually pay a little bit of attention to it, is from the very beginning of Psalm 82. So, you know, get out your Bibles, ladies and gentlemen. Psalm 82, if you're looking at like a King James Bible or another Bible that's using the Hebrew numbering of the Psalms, but it's Psalm 81 if you're looking at the Greek Septuagint numbering. And I just wanted to read the first couple. The first, really the first verse, actually. And just to show that what we're talking about is not something that we're making up. Right. So here's Psalm 81 or 82, depending on which version you're reading verse one. And I'm reading it out of the orthodox study Bible. God stood in the assembly of gods. He judges in the midst of God's saying. And then it goes on to say what he says, God stands in the assembly of gods. It doesn't say God stood in the assembly of so called gods. Right. It just simply says God stood in the assembly of gods. And if you read, you keep reading the psalm, it never says anywhere in it, those beings that he's standing in the midst of are not gods. Right, so what's going on there? Like, what's the deal? I thought we believed in only one God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2415.78,"end":2418.22,"speaker":"Fr Stephen De Young","text":"So do, do you want some more examples first or do you want to."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2418.22,"end":2421.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, sure, let's. Yeah, let's roll on with some more. Yeah, let's just leave that question hanging."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2421.98,"end":2422.66,"speaker":"Fr Stephen De Young","text":"Pile them up."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2422.74,"end":2427.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's. Yeah, right, because it's everywhere. Right, okay. Yeah, give us another one, Father Steve."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2427.66,"end":2474.47,"speaker":"Fr Stephen De Young","text":"Right, so Psalm 89, 88, in the Greek numbering and beginning around verse 5. Let the heavens praise your wonders, O Yahweh, your faithfulness in the assembly of the holy ones. For who in the skies can be compared to Yahweh? Who among the sons of God is like Yahweh, a God greatly to be feared in the council of the holy ones and awesome above all who are around him. So this is talking about the relationship between God and heavenly sons of God. It says who in the skies. So that's kind of hard to make be, you know, humans of any kind."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2474.47,"end":2481.15,"speaker":"Fr Andrew Stephen Damick","text":"It's not about people. Right, right. You can't just read this as being about sort of theoses because it's in the heavens."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2481.71,"end":2484.91,"speaker":"Fr Stephen De Young","text":"Yeah. And I'll just, I'll just keep rolling."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2485.79,"end":2502.23,"speaker":"Fr Andrew Stephen Damick","text":"And let me just say, actually, I just noticed the very next verse, right after what you read, verse nine, I'm looking at the orthodox study Bible, O Lord, God of hosts, who is like you. Right, so the next line is describing this relationship that we're discussing. Okay, go on."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2502.23,"end":2512.87,"speaker":"Fr Stephen De Young","text":"What's the next. Well, and to even add to that, it goes on in verse 10 to talk about God crushing a sea monster and throwing its carcass to the earth."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2513.19,"end":2520.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we have to do a whole episode on monsters or on specific monsters. Like we could do one on Leviathan, one on Behemoth."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2520.63,"end":2521.73,"speaker":"Fr Stephen De Young","text":"Behemoth. Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2521.73,"end":2522.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2523.53,"end":2539.29,"speaker":"Fr Stephen De Young","text":"But so then Exodus 15:11, you know, who is like you? Oh, Yahweh among the gods. Who is like you, majestic in holiness, awesome and glorious deeds, doing wonders. This isn't comparing God, the God of Israel to imaginary characters."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2540.33,"end":2540.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2540.73,"end":2544.97,"speaker":"Fr Stephen De Young","text":"That, that wouldn't be a big praise. Like, who in the Marvel Cinematic Universe is like God?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2546.81,"end":2547.21,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2547.29,"end":2563.27,"speaker":"Fr Stephen De Young","text":"Like, I mean, okay, but what does that prove? Right? Exodus 18:11, three chapters later. Now I know that Yahweh is greater than all gods because of this affair. They dealt arrogantly with the people. The."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2563.27,"end":2567.19,"speaker":"Fr Andrew Stephen Damick","text":"They is the gods, the Egyptian gods in this case."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2567.19,"end":2572.95,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. And imaginary characters can't deal arrogantly with people."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2573.03,"end":2579.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And where is, isn't it later in Exodus where. Where God says that he's judged to the gods of Egypt?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2580.16,"end":2581.44,"speaker":"Fr Stephen De Young","text":"It's earlier. That's what he."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2581.44,"end":2582.64,"speaker":"Fr Andrew Stephen Damick","text":"Earlier. Okay."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2582.88,"end":2585.28,"speaker":"Fr Stephen De Young","text":"That's what God says he's doing on Passover night."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2585.52,"end":2587.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's judging the gods of Egypt."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2587.44,"end":2588,"speaker":"Fr Stephen De Young","text":"Judgment."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2588.24,"end":2675.33,"speaker":"Fr Andrew Stephen Damick","text":"Right. So like, is God rendering judgment to made up characters that the Egyptian pagans are worshiping? Like, it doesn't, the text doesn't say that. It doesn't say they're fake. It doesn't say that they don't exist. Right. And you know, I mean, we could, we will get into it in the New Testament later. I mean, most of the stuff we're reading from the old, but we're showing, you know, if you look at this, if you look at the scriptures folks closely, you'll see that the scriptures are taking these things very seriously and not saying this is some kind of metaphor or again, made up stories. Like, one of the problems with the way that the modern world tends to look at ancient religion is they'll say, oh, well, they notice that there's lightning in the sky, or they notice that there's earthquakes, or they notice that the Nile floods. And so they came up with some kind of explanation for it. And eventually that explanation evolved into believing in some kind of God of lightning or what. No, that's, that's not the way that the Bible depicts this stuff. And it's not the way that the people on the ground understood what they were doing. Right. That's not. They attest to the fact that they had encounters with these spiritual beings. And the Bible takes them very, very seriously. Again, God standing in the midst of the gods, God judging gods. You know, it's lots of places. Okay, I know we got some more. Okay, let's talk about a couple more here. Yeah, yeah. Because we do want to take some calls."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2675.73,"end":2704.38,"speaker":"Fr Stephen De Young","text":"Yeah. Deuteronomy 10:17. For, for Yahweh, your God is God of gods and Lord of lords, the great, the mighty, and the awesome God who is not partial and takes no bribe. And Psalm 95. 3 is similar. It's for Yahweh is a great God and a great king above all gods. So when we see this language, God of gods, it's not just a superlative, it's saying that the other gods have the God of Israel as their God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2704.85,"end":2713.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, you could say, like, you could read Lord of Lords and say, okay, that means that God is above all the kings and the presidents of whatever, the earth. But God of gods is harder to explain away."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2714.37,"end":2719.73,"speaker":"Fr Stephen De Young","text":"Right. And especially when it's disambiguated as the great king above all gods."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2720.37,"end":2721.97,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2722.05,"end":2764.75,"speaker":"Fr Stephen De Young","text":"That it's not that they don't exist, it's that he's. He's their king. And so what's going on here is a couple of things. The, the first is that the word God is just being used to refer to spiritual beings. It's hard to reflect in English we usually do that by using a capital letter for God and then a lowercase God or gods for these other beings. But the reason for that, and the fathers actually, when they talk about the word, the Greek word theos and what it means, they really get into the idea that it's kind of a verbal idea, even though it's a noun."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2765.39,"end":2766.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay, what do you mean by that?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2767.07,"end":2782.91,"speaker":"Fr Stephen De Young","text":"The word is something that God does. He is God. It has to do with his, like godding. It has to do with his dominion and his rule and his power."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2783.76,"end":2784.16,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2785.28,"end":2797.44,"speaker":"Fr Stephen De Young","text":"And some examples of this that might help with that in, in the New Testament, for example, St. Paul refers to the devil as the God of this present age."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2798.16,"end":2798.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2799.92,"end":2809.54,"speaker":"Fr Stephen De Young","text":"He's not saying that he rivals the God of Israel in power. Right. Or prestige, or is a second God. He's talking about function he has and."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2809.54,"end":2811.94,"speaker":"Fr Andrew Stephen Damick","text":"Or certainly he's not saying that he should be worshiped."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2812.58,"end":2812.98,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2812.98,"end":2818.22,"speaker":"Fr Andrew Stephen Damick","text":"And we're going to talk. I know, over and over and over about that issue. Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2818.22,"end":2821.86,"speaker":"Fr Stephen De Young","text":"But St. Paul is saying that he is worshiped in this present age."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2822.26,"end":2822.66,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2823.46,"end":2880.85,"speaker":"Fr Stephen De Young","text":"Yeah, that. And so these, these spiritual beings can be called gods. In English, we do it with a small G, but you know, they aren't using capitals in, in Greek can be talked about that way because either on the one side, God has chosen to share his rule and his dominion with them. And so with, with angelic beings, they are sharing in and reigning with God and God is exercising his rule and his dominion and his power and his authority through them, graciously sharing it with them, or on the other side, on the more demonic side, because humans, in their rebellion and sin, have elevated these spiritual beings and chosen to worship and serve them and become enslaved to them. And so they are functioning as gods in that sense."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2880.93,"end":2882.45,"speaker":"Fr Andrew Stephen Damick","text":"They become their God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2883.01,"end":2911.67,"speaker":"Fr Stephen De Young","text":"And I know, I think it may be even our next show in a fortnight, we're going to go deeper into this. But this is a big part of what's going on. When the fathers talk about theosis and talk about us becoming gods, that's directly connected to the idea in the New Testament of Christ exercising his rule and authority through the saints in glory, that they rule and reign with him and share in his dominion. But we'll get more into that."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2911.83,"end":2945.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I just wanted to make another. Because we're going to be talking. I know, because. Because we're both nerds in different ways and on different levels, for sure, but we're going to be talking a lot about words and what they mean and how they're used and how they're used in lots of different ways. And someone might counter and say, well, doesn't the word Elohim, which, you know, doesn't that mean gods in Hebrew? Doesn't Elohim just mean the Father, Son and Holy Spirit? Doesn't that just mean Yahweh? Right. Is that the case? Is Elohim only used in the. In the Hebrew Bible for. For Yahweh?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2946.59,"end":2949.87,"speaker":"Fr Stephen De Young","text":"No, in fact, it's even more flexible than Theos."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2950.99,"end":2953.07,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow. Right, Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2953.23,"end":2990.53,"speaker":"Fr Stephen De Young","text":"Elohim is used to refer to any spiritual being. So it's used to refer to God, the true God. It's used to refer to the gods, the same word, Elohim. And now to really freak people out. Oh, yeah, I have a couple of examples where it's even used for deceased humans. The first one and the one that might freak people out less in 1st Samuel 28, verse 13."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2991.25,"end":2995.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this is First Kingdoms. If you're looking at a Septuagint Bible."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2995.57,"end":2999.06,"speaker":"Fr Stephen De Young","text":"If you're in your. If you're in your orthodox study Bible."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":2999.22,"end":2999.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3001.06,"end":3051.02,"speaker":"Fr Stephen De Young","text":"This is when Saul, near the end of his reign as king and his disobedience, goes to consult with the witch or the medium at Endor, not the one with the Ewoks, oh, man, the city, Palestine, and asks her to sum it up, the spirit of Samuel. And there's this moment in verse 13 where she's kind of seemingly maybe a little surprised at how well it worked and because she starts freaking out. And verse 13 says the king said to her, do not be Afraid. What do you see? And the woman said to Saul, I see a God coming up out of the earth. So. And then that turns out to be Samuel's spirit. And he speaks."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3051.66,"end":3053.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. So he's called a God in the Bible."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3053.98,"end":3069.82,"speaker":"Fr Stephen De Young","text":"Right. So he's. The term Elohim is used to apply to him. And, you know, the. The biblical author is not saying that. That the prophet Samuel was another person of the Trinity or that he was a polytheist and."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3069.9,"end":3070.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3070.38,"end":3081.42,"speaker":"Fr Stephen De Young","text":"The prophet Samuel now lived on Mount Olympus or something. Yeah, that's not. That's not what he's going for. The word is just flexible to include that now."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3081.42,"end":3081.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3081.82,"end":3088.26,"speaker":"Fr Stephen De Young","text":"And now the one that will be most controversial, that I kind of warned you about, but we're gonna go there."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3089.06,"end":3089.46,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3090.1,"end":3194.52,"speaker":"Fr Stephen De Young","text":"And this is in Exodus 21, verses 1 through 6, which is in the context of laws governing slavery. So not controversial at all, this passage in the Torah. And so this particular rule that's being made in the. In the first six verses of Exodus is for a situation where someone has been in a period of indentured servitude, so they've been working for and part of a household for some period of time to pay off a debt, and they come to the end of their term of service, but they like the household and the family, and they want to stay on. There were strict rules about how long you could keep someone in slavery and all of these things that are outlined in the rest of the chapter. But so if a person voluntarily says, you know, I rather like being the tutor or nanny for your children, and I want to stay, you know, I feel like I'm part of the family. There was a provision to do that. And so there is a ritual described here for what you do with that person who has decided they want to stay permanently as part of the household. And so I'll read Exodus 21, verses 5 and 6. But if the slave plainly says, I love my master, my wife, and my children, I will not go out free, then his master shall bring him to the gods, and he shall bring him to the door or the doorpost, and his master shall bore his ear through with an awl, and he shall be his slave forever. There's not a way to get around the fact that it says that he will bring him to the gods."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3195.4,"end":3195.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3196.36,"end":3206.84,"speaker":"Fr Stephen De Young","text":"In the Hebrew, there's a definite article. So the word the. So you can't say, bring him to God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3207.56,"end":3208.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3208.68,"end":3244.61,"speaker":"Fr Stephen De Young","text":"It's the gods. And St. Jerome translated this just woodenly literally. It's. If you look in The Vulgate. He has deists. It's just the plural of God. Bring him to the gods. He just translated it directly from the Hebrew. The Greek is interesting because the Greek says that you should bring him before the court of God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3245.25,"end":3248.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Like the Orthodox city Bible has the judgment seat of God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3249.09,"end":3258.29,"speaker":"Fr Stephen De Young","text":"Right. And it's not the word judgment seat. It's the. It's the word. It's where we get the word criterion, actually. It's criterion."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3258.61,"end":3259.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3259.89,"end":3262.85,"speaker":"Fr Stephen De Young","text":"And it means a law court. It means, like the actual court."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3263.01,"end":3265.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a court of people there, right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3265.44,"end":3268.96,"speaker":"Fr Stephen De Young","text":"Yeah. So it's talking about, like, the counsel of God, basically."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3269.04,"end":3284.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. All right, well, so, okay, so I want to. I want to move on here so we can start taking a couple calls, because Bobby is telling me that we have a lot of people who have called in. So thanks, everybody."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3286.56,"end":3291.35,"speaker":"Fr Stephen De Young","text":"Let me add one. One little note before we do that. I don't want to leave people hanging with there."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3291.59,"end":3293.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, sure."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3294.87,"end":3298.79,"speaker":"Fr Stephen De Young","text":"That. Who that's referring to are the departed family members."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3299.19,"end":3303.75,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right. Right there. Because they're still around some sense."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3304.23,"end":3309.19,"speaker":"Fr Stephen De Young","text":"Right. God is the God of Abraham, Isaac, and Jacob. He's not the God of the dead, but of the living."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3309.75,"end":3310.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3310.31,"end":3318.5,"speaker":"Fr Stephen De Young","text":"And so the idea here is that it's not that you, like, summon up the spirits of your dead ancestors or worship them or sacrifice that. There's none of that here."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3319.29,"end":3319.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3319.53,"end":3344.88,"speaker":"Fr Stephen De Young","text":"But you take them to the doorpost, which is sort of representative of the household and the family. That's why that's what was marked with blood on the Passover. You take them there and you do this to do this ritual because you're making them a part of the family. And so it's talking about those ancestors as witnesses. It's more closely related to the great cloud of witnesses in Hebrews 11 than to some kind of ancestor worship or something."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3345.04,"end":3345.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3345.48,"end":3350.32,"speaker":"Fr Stephen De Young","text":"But I wanted to get that in so people don't walk away with a weird idea."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3350.56,"end":3448.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So just to summarize real quick, then. So when we're talking about spirits or gods, setting aside those terms to use to refer to Yahweh, the Father, Son, Holy Spirit, there's kind of three kinds of beings that are described as gods in the Bible. And we're just talking about the Bible here. We're not even getting into some of the more interesting. I don't want to say more interesting. Some of the literature you probably haven't read too much, folks, you know, like Enoch or Jubilees, whatever. And there's three Kinds of beings. There's angels, there's demons, which really are just angels that are rebelling against God. And there's dead people, you know, those who have passed on. Those are all referred to as gods in the scripture. So. Yeah, so I want to start taking calls. But before we take the first call, actually, I wanted to answer a question that came in over email, and this comes from Brian, who's actually relatively local to me, and he sent me an email earlier today because he heard we were going to be talking about angels and demons and so forth. And he sent this question. He said, my grandson, John Cassian, what a great name for a kid who is six years old, is going to be listening to your podcast and Angels tonight from. From Scottsdale, Arizona. He is very interested in angels right now, wants to ask if good angels are able to be killed by bad angels. He's curious about whether they can die or not. And I just want to take this one and the reason here's why, because this might be the only question that I can answer from the other ones."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3448.51,"end":3451.11,"speaker":"Fr Stephen De Young","text":"We'll see. I may be about to actually you."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3451.11,"end":3452.15,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, maybe."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3452.15,"end":3454.19,"speaker":"Fr Stephen De Young","text":"Maybe get that tension out there."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3454.53,"end":3474.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. Because, I mean, that's one of the things that's going to be going on is like, I'm ready to be corrected, I'm ready to learn. But I'm going to say that good angels cannot be killed by bad angels because they don't have mortal bodies. Am I correct in that? We do have an episode. We're going to be talking about spiritual bodies in the future, but this is not it. Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3475.49,"end":3480.13,"speaker":"Fr Stephen De Young","text":"Without going into the whole bodies question, because. Yes, that's a big topic unto itself."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3480.13,"end":3480.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3483.1,"end":3488.86,"speaker":"Fr Stephen De Young","text":"So it is true that you are correct, obviously, that evil angels cannot kill good angels."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3488.94,"end":3489.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3489.74,"end":3493.58,"speaker":"Fr Stephen De Young","text":"However. However, evil angels can die."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3494.86,"end":3495.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3496.22,"end":3498.86,"speaker":"Fr Stephen De Young","text":"You just read from Psalm 82."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3499.26,"end":3499.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3499.74,"end":3502.78,"speaker":"Fr Stephen De Young","text":"You didn't read the verse, but verses 6 and 7."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3502.86,"end":3505.82,"speaker":"Fr Andrew Stephen Damick","text":"I have said your gods, but you shall die like men."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3506.3,"end":3527.68,"speaker":"Fr Stephen De Young","text":"Right. You will die like men. And so the. The thing we have to keep in mind is that when. When the fathers talk about death, they did. Saint John of Damascus clearly disambiguates this. There's. There's physical death and there's spiritual death. And so physical death is something that happens to humans where our soul is separated from our body."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3528.16,"end":3529.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3529.28,"end":3535.64,"speaker":"Fr Stephen De Young","text":"And so as you said, angels don't have mortal bodies, so. So they can't die physically in that sense."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3535.88,"end":3536.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3536.28,"end":3541.56,"speaker":"Fr Stephen De Young","text":"There's also, however, spiritual death, which is the separation of the soul or spirit from God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3542.04,"end":3542.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3543.88,"end":3551.08,"speaker":"Fr Stephen De Young","text":"And that is the fate that awaits the demonic spirits at the final judgment."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3551.8,"end":3558.12,"speaker":"Fr Andrew Stephen Damick","text":"Which, if I'm correct, doesn't mean non existence. It's kind of an eternal dying or eternal death."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3558.76,"end":3562.36,"speaker":"Fr Stephen De Young","text":"Right. Because death, death doesn't mean non existence for us either."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3562.44,"end":3565.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. Okay, let's go to break."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3565.56,"end":3583.4,"speaker":"Steven Cristoforo","text":"Father Andrew, Stephen Damick and Fr. Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3588.37,"end":3611.49,"speaker":"Fr Andrew Stephen Damick","text":"Now available on Ancient Faith Publishing. The Shield of Psalmic Reflections on Translating, Interpreting and Praying the Psalter. In this posthumous collection of poet and teacher Donald Sheehan's reflections on psalms and psalmic prayer culled from his journals and teaching notes, you will find two quite different kinds of writing working in tandem."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3612.02,"end":3614.82,"speaker":"Fr Stephen De Young","text":"Poetic and personal journaling by a man."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3614.82,"end":3681.03,"speaker":"Fr Andrew Stephen Damick","text":"Of faith, a scholar, a linguist, and in the deepest sense, a teacher. Alongside scholarly linguistic and poetic analysis by a man steeped in poetry who thought like a poet. Here's what Father Stephen Freeman has to say on the book. In the spiritual life, two things are essential, what we do and how we do it. In this wonderful collection of the late Donald Sheehan's thoughts on the Psalms, we see both. He takes us into what the Psalms are in depth, that is the Word of God. But he also demonstrates time and again how those deaths shape his life in the world in which he lives. Thus we are given two the Word of God and a life in which the Word has given shape. It's a path we all should walk. You can find this book and others like it@store.ancient faith.com Again, that is store.ancientfaith.com."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3681.51,"end":3697.56,"speaker":"Steven Cristoforo","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3702.28,"end":3715.48,"speaker":"Fr Andrew Stephen Damick","text":"All right. We are back and we are now ready to take your calls. And there's somebody who contacted me beforehand who I know had a really interesting question, and that is Stacia in Georgia. So can we get Stacia on the line?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3716.24,"end":3717.52,"speaker":"Raphael","text":"Hi, Father, can you hear me?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3717.84,"end":3719.68,"speaker":"Fr Andrew Stephen Damick","text":"I can hear you. It's working."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3720.96,"end":3721.76,"speaker":"Fr Stephen De Young","text":"Eureka."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3724.32,"end":3724.96,"speaker":"Fr Andrew Stephen Damick","text":"Wonderful."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3725.04,"end":3754.08,"speaker":"Raphael","text":"Delightful to be on the show. Glad to hear from you. I have a question about First Corinthians 11. I've been covering my hair daily for most of the year. I probably started last November. I cover my hair about 90% of the time. And I don't really know why I see it in icons. That's the only reason I have right now. But I'm looking at Scripture. I'm looking at First Corinthians 11:10, and my Catholic version here says, therefore, have a sign of authority on her head. Because of the angels."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3754.32,"end":3779.73,"speaker":"Fr Andrew Stephen Damick","text":"Because of the angels. Yeah. So this is one of these things that there is a very long explanation for this, but I know that Father Stephen has covered this in some detail, so I'm going to punt this to him and say, give us the short version, Father Stephen, as to what it is, why does it say in 1st Corinthians 11:10 that a woman should have her head covered? Because of the angels."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":3780.93,"end":4015.21,"speaker":"Fr Stephen De Young","text":"Yeah. So this is good that we have a first question like this, because I want to let people know. Some of the questions that I've even seen in advance from people who have emailed or sentiment in other ways are very good questions and very big questions. And so some of these are going to end up being an episode unto themselves at some point in the future, because we ought to do justice to it. But so when we get a question like this, this is an example of one of those really good questions. I'll try to give you at least a sort of summary answer, and then we will probably come back to this at some point and expand more in full. And also because that will give me time to prepare this answer, because though I won't go into it right now, the Greek in that passage is very sexually graphic, and it may not look that way in English, but what it is basically referring to is St. Paul. One of the major problems he's addressing throughout his first Epistle to the Corinthians is helping the former pagan, now Christians in the Christian community in Corinth to sort of fully separate from their pagan way of life, including pagan modes of worship, which included a lot of ritual sexuality in their worship. And so St. Paul is, in that overarching passage from which you read the verse, is reiterating that, that there is no place for sort of sexual expression or sexual immorality within the worship of the Christian church. That seems obvious to us, but it wasn't obvious to a pagan in Corinth in the first century. And so the reason he specifically refers to angels there is that for St. Paul and just about any other first century Jewish person, sort of the two paradigmatic sins were idolatry and sexual immorality. And so the worst thing you could do would be to mix Those two things together, and the ultimate example of that in the Hebrew Bible in the Old Testament is actually what happens at the beginning of Genesis 6 and the first four verses of Genesis 6 that talks about the origin of the giants. That talks about some kind of sexual congress between rebellious angelic beings and human beings. And that was sort of ritual sexual immorality that produced. That produced sort of these horrors on the earth. And so St. Paul is sort of alluding back to that and saying that a woman needs to be not only not making a sexual display in the Christian church, but practicing sexual modesty, not only because of the other humans there. You know, we sometimes hear about modesty in that sense. We don't want to tempt the men in the congregation. And then that gets into all kinds of sexual politics and things. But St. Paul is even throwing it open to. Because sexual immorality in any kind of ritual sense opens the door to all manner of sort of horrible evils. So that's what St. Paul's alluding to. There is that idea. And so that modesty is important. We go in the exact opposite direction of any kind of sexuality involved in our worship. Our worship needs to be chaste and pure. Our worship of the true God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4015.29,"end":4064.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, I know we're going to get into it, like, in a future discussion, but at least part of why, if I remember correctly, part of why this is important in this case is that in that time and place, a woman displaying her glorious hair openly was regarded as essentially a thing to do to attract men, you know, and so, you know, doubly inappropriate for church. But, you know, as to why that is considered attractive to men in that time and place, we're going to have to save that for a future episode. It's going to blow your mind when you hear it, though, folks. So. All right, so our next call comes from. From Gareth, who is in Louisiana. So he's somewhere near you, Father Stephen."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4065.98,"end":4067.1,"speaker":"Fr Stephen De Young","text":"He's very near me."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4067.42,"end":4074.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, oh, so you know him, then. So, yeah, Gareth, who's in Louisiana, he has a question about. About Mount Herman."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4077.26,"end":4079.98,"speaker":"Raphael","text":"How's it going, Noble? Can you guys hear me all right?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4080.38,"end":4080.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4081.26,"end":4081.86,"speaker":"Fr Stephen De Young","text":"Yes, sir."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4081.86,"end":4145.9,"speaker":"Raphael","text":"All right, thanks. So, yeah, a little bit of context for my question. So Father Stephen has a blog post he did a while back about Mount Tabor and Mount Hermon. This is the common traditional site for the transfiguration of Christ. It's called Mount Siphon in the BAAL cycle. And this is after BAAL defeats Yam, who's the Canaanite God of the sea, he ascends to become Lord of Mount Zephon or Mount Hermon. This is also in the Enochic literature, the site of the watchers and the fallen angels descent upon Earth. Second, Enoch 19 says they broke their promise on the shoulder of Mount Hermon to defile themselves with human women. So this question is kind of, I guess, refers to any sort of physical geography and the, the correlation it has to heavenly events and places. But what is it about Mount Hermon that makes it a recurring physical place for events of such cosmic significance?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4149.82,"end":4151.58,"speaker":"Fr Stephen De Young","text":"So do you want me to go straight for that one?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4151.9,"end":4165.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, sure. So, yeah, Mount Her. Mount. I mean, Mount Hermon. You know, we've been talking about the. We're going to talk about the divine Council over and over and over and over and over again on the show. So what does Mount Hermon have to do with all of that then? In a nutshell."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4166.39,"end":4397.99,"speaker":"Fr Stephen De Young","text":"I know, yeah, again, this is another one that's going to be probably a future episode at some point. But Mount Hermon is not only a mountain. And of course, throughout the ancient world, gods live in gardens on top of mountains. It's just a commonplace. And so that imagery isn't just used in scripture for the Garden of Eden or for Mount Sinai and Mount Zion, but it's used. Obviously, the one most people will be familiar with would be Mount Olympus. But in the case of BAAL and the divine council of El, that was Mountain Zaphon. Zaphon is the word for Semitic word for north. So it's the mountain of the north, and that corresponds to Mount Hermon, which right now is. Is kind of on the border of the Golan Heights. So it's not a place I would recommend visiting currently. But in addition to being this mountain, which was seen by people from at least the late Neolithic period as being a home of the gods. One of the things that further, that is there's also a natural spring in a cave at the base of Mount Hermon. And natural geographic features were the first shrines for pagans. Mostly springs, groves of trees that they could fence in. Those were sort of the first temples. And so that cave and that spring were considered sacred to baal. Again, going back into the likely the Neolithic period, it sort of got rebranded. Later it became a shrine to Pan, the Greek God, and the name was changed to Panius. And then today it's called Banius. It's gotten switched from a P sound to a B sound. And if you were to go, which again, I don't recommend at the present time to Mount Hermon, it is dotted with hundreds of pagan shrines from all of those periods, going back to the Neolithic period, all the way up through the Roman period. All over its face, at its peak, altars. And the cave with the spring at the bottom was considered to be an entryway to the underworld. So any kind of phthonic God, any kind of God associated with the underworld, which includes baal, that would be a place where people would go in order to interface with those spirits. And so, yes, a lot of there are things with the transfiguration associated with it and with Christ and Moses and Elijah being atop it instead of sort of Baal's council. That is also the place. It was near Banius, where Christ told St. Peter that the gates of hell would not prevail against the church. And there were literal gates to Hades that you could point at at the time that Christ said that, because it was right after they left Caesarea Philippi, which is right there. So this is a theme we're going to come back to a lot, is that all of these sites in the underworld and in the divine realm that are talked about in scripture and in other cultures, all also correspond to actual physical places."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4398.62,"end":4398.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4400.06,"end":4416.14,"speaker":"Fr Stephen De Young","text":"And there seemed the spiritual world, we tend to think of like, well, heaven's up at the sky somewhere, and the underworld is down below us. But in actuality, they saw the spiritual world as sort of overlapping with the physical world."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4416.38,"end":4431.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, thank you very much for that call, Gareth. Next we have Michael, who is in Arkansas. And Michael has a question or a comment about polytheism versus monotheism. So, Michael, are you there?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4432.74,"end":4433.38,"speaker":"Raphael","text":"Yes, I am."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4433.38,"end":4437.46,"speaker":"Fr Andrew Stephen Damick","text":"How are you, Father? Good. How are you? Good. Thank God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4437.46,"end":4441.58,"speaker":"Raphael","text":"I have a question for Father Stephen DeYoung. You know, I was told once that."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4441.58,"end":4443.98,"speaker":"Fr Andrew Stephen Damick","text":"There may have been a change at."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4443.98,"end":4450.7,"speaker":"Raphael","text":"Some point in just the way we're educated about religion. And I remember being taught about monotheism."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4450.7,"end":4453.27,"speaker":"Fr Andrew Stephen Damick","text":"And polytheism, and I wonder if in."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4453.27,"end":4459.87,"speaker":"Raphael","text":"The ancient world, it was taught the same way. And how could this maybe contribute to our perceptions when we read gods in the Bible?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4461.07,"end":4468.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's. That's a good question. I know you asked after Father Stephen, but can I just begin to take a shot at this, if you don't mind? Sure."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4468.31,"end":4468.83,"speaker":"Raphael","text":"Please do."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4469.23,"end":4475.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, because, I mean, he's the expert, but I do have a couple things I want to throw in here, if only so we can hear him correct me. So."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4478.03,"end":4478.43,"speaker":"Fr Stephen De Young","text":"Actually."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4479.15,"end":4680.27,"speaker":"Fr Andrew Stephen Damick","text":"Actually, yeah, exactly. Everyone get out your animated GIFs for that. Yeah. So, you know, we today, like Christians Today, we are monotheists. That's the way we talk about it. And we're not polytheists. So there's this idea that we worship the one true God. And those pagans, they worship many gods, right? But that, as you know, if you listen to the beginning of what we were talking about tonight, you know that that's not the image that the Bible depicts. It uses the word gods to refer to all kinds of beings and doesn't see a problem with using that same word to refer to the Father, Son and Holy Spirit, the one true God, you know, the one true God. That phrase that we use doesn't mean that that's the only being that we use the word God to refer to, because the Bible doesn't do that. Right? So this idea of polytheism versus monotheism is actually a relatively later kind of notion in Western intellectual history. And, you know, the reason why the idea of monotheism was kind of come up with is to try to group sets of religions together. So we're monotheists, and Jews are monotheists and Muslims are monotheists, and over here you have polytheists, you know, these other kinds of religions. But I don't think anyone in the ancient world would have looked at it that way. I mean, that's not the way that religion kind of works and the way people understood it. And the question is really not is there only one God? Which is what monotheism means, that there's only one God. We see, the Bible doesn't teach only one God. The difference is that there's only one God that you worship. And the other significant difference is that the God whom we worship, the Father, Son and Holy Spirit, is a very different kind of divine being from all these other divine beings. Right? So we, you know, like we were talking about atheists earlier who say, well, I just believe in one less God than you do. And it's like, well, no, the God that I believe in and worship is a God who is outside of time and space, is the God who created all things. Right. You know, that is a different kind of being, if we can even speak in those terms from how pagans understood what their gods were. And, you know, a pagan God is really a much kind of smaller kind of being. And the reason why is it's because a pagan God, we're going to talk about this a lot. I know a pagan God is a fallen angel, right? So it is a God in the sense of being a divine, spiritual being, but it's not a God worthy of worship. Now people do worship them and have worshiped them. So that is what I would say is kind of the big difference between this idea that we have monotheism and polytheism. Really what the picture that the Bible presents is actually not monotheism, but rather monolatry, meaning there's only one whom we worship. We recognize there are many gods now. They're not equal. They're not equal. The Father, Son and Holy Spirit is not the same kind of thing that, you know, Zeus is or Hera. Right? Not at all. But the main thing is, the main question is how we behave towards them. And we're to worship only Father, Son and Holy Spirit. So, Father Stephen, do you have any way you wanted to correct that or add that or magnify that or."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4680.75,"end":4697.5,"speaker":"Fr Stephen De Young","text":"Not really. Not really correct it. I'll fill in blanks. I don't have to. I'm actually here yet. Yeah, it was the. The term monotheism was created at the end of the 16th and beginning of the 17th century, which in Orthodox time."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4697.5,"end":4698.54,"speaker":"Fr Andrew Stephen Damick","text":"Is like last week."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4699.18,"end":4708.46,"speaker":"Fr Stephen De Young","text":"Yes. It doesn't even count for Orthodox people. Yeah. And it's not that it couldn't. I mean, monos and theos are both Greek words."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4709.42,"end":4709.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4710.22,"end":4735.24,"speaker":"Fr Stephen De Young","text":"Right. And you do find polytheos used as a term by the Fathers to refer to pagans, but not monotheos. When they talk about the fact that we have one God who we worship. Like in the discussions about the Trinity and saying that they weren't tritheists, the term they used was. Was monarchia."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4735.4,"end":4736,"speaker":"Fr Andrew Stephen Damick","text":"That there's one."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4736,"end":4736.44,"speaker":"Raphael","text":"Archie."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4736.44,"end":4814.96,"speaker":"Fr Stephen De Young","text":"One first principle is how they chose to express themselves. So monotheism gets invented and it basically, this whole taxonomy was invented so that we could have this evolutionary view of religion. And it was created mostly by 19th century liberal German scholars who not coincidentally, at the end of their taxonomy, discovered that 19th century German liberal Protestantism was the pinnacle of all human religion. Right. Like it evolved to them. Right. And so they posit, well, see, polytheism is this sort of primitive thing, and then you kind of outgrow that to monotheism. And they did this whole Hegel thesis antithesis thing where you have. Well, you have monotheism and polytheism, and then the synthesis of that is the Trinity or something. And as silly as that sounds, or as silly as I'm making it sound, if you or one of your children goes and takes an Old Testament course just about anywhere at a secular university, or even most big Christian universities, they will be taught that Israel started out polytheist and evolved into monotheists."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4815.84,"end":4816.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4816.72,"end":4888.82,"speaker":"Fr Stephen De Young","text":"And they will quote some of the passages we just quoted and say, oh, see, these are leftovers from back when they were polytheists and try to set up this sort of, this sort of tax where it just sort of evolved. Religion just evolved. And that of course, takes the idea that God revealed himself to humans out of the picture, which is why we would want to have that theory if we're atheists. And so it's important that we not only say, well, look, these categories aren't ancient and aren't original, but that we say that whole taxonomy doesn't work. And a couple of things real quick that refute it are. Number one, it depends on the people who put together the Hebrew Bible being both incredibly sophisticated editors and writers of, of deep theological truths and being complete imbeciles. Because while they were doing all the editing and while they were changing all this stuff to make it look like they were always monotheists, they just missed all these passages. Oops, whoops."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4888.82,"end":4890.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4890.86,"end":4918,"speaker":"Fr Stephen De Young","text":"Whoops. We left all this polytheistic stuff in there. Our bad. So that's a problem. And then the other, the thing to me that really blows it out of the water is that the plural form of gods, talking about gods in the plural, is actually more common in the Dead Sea Scrolls than it is in the Old Testament. And the Dead Sea Scrolls are written right before and during the time of Christ."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4919.28,"end":4919.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4919.92,"end":4936.96,"speaker":"Fr Stephen De Young","text":"So they clearly hadn't evolved in their language. They were still talking about. About a plurality of gods. And one last note on this question, hopefully that's thorough enough. But one last note on this question, because I think this is important, is what we mean when we say that there is one true God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4939.44,"end":4939.76,"speaker":"Fr Andrew Stephen Damick","text":"What it."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4939.76,"end":4948.24,"speaker":"Fr Stephen De Young","text":"Means to be a true God. Because I think what we hear as modern American Christians when you hear true God is, oh, well, he's the one that exists. And the other ones are fake."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4948.56,"end":4949.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4949.8,"end":4983.68,"speaker":"Fr Stephen De Young","text":"The other ones are made up. Right. But remember what we were saying earlier in our discussion. The idea of being God is the idea of exercising authority and dominion and reign. And so God is the one true God. He is the one who truly holds all authority and power and dominion over the entire creation. Anyone else who has any authority or power or dominion has received it from above, has received it from him, or they don't have it."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4983.84,"end":4985.44,"speaker":"Fr Andrew Stephen Damick","text":"It's derivative. It's."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":4985.44,"end":5003.21,"speaker":"Fr Stephen De Young","text":"Yeah, right. And that's why we reiterate that in the creed that Christ is true God. Right. It's not just that he's God. That he's divine. Right. But. But that he is. He is true God. He exercises the same authority."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5004.17,"end":5007.77,"speaker":"Fr Andrew Stephen Damick","text":"All right, so, Michael, does that answer your question?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5008.97,"end":5014.97,"speaker":"Raphael","text":"Yeah, that was excellent. I feel a bit misled by our education system, so I appreciate you both clearing that up."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5015.21,"end":5033.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes, well, we're probably going to do a whole lot of debunking, so. All right, well, thank you for that, Michael. And we've got another good angelic name next, Raphael, who has a question about comment about guardian angels. So, Raphael, are you there on the line?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5034.61,"end":5035.89,"speaker":"Raphael","text":"God, I hope so."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5036.53,"end":5038.21,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome, Raphael."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5039.65,"end":5040.21,"speaker":"Raphael","text":"Right on."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5040.21,"end":5040.61,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5040.61,"end":5046.21,"speaker":"Raphael","text":"Fathers, first of all, congratulations on the episode. I am blown away so far."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5046.69,"end":5047.17,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5047.81,"end":5054.93,"speaker":"Fr Andrew Stephen Damick","text":"And we're just sort of stumbling through this, too, like you. Yeah, I'm learning how to do this. So thank you for bearing with us."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5055.74,"end":5082.22,"speaker":"Raphael","text":"Oh, absolutely. No, this is fantastic. I actually have tons of notes already on questions I could ask. But what I was really curious about, since we're talking about angels and demons, is how can I deepen my relationship with my guardian angel? It's something I've struggled with for the past seven, eight years. What you got to say?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5082.62,"end":5386.26,"speaker":"Fr Andrew Stephen Damick","text":"That is a good and a very. That's a great question and I think really important because if you look at the baptismal service, we ask God in the course of that baptismal service to assign a guardian angel to that person. Right. So we, you know, and we don't say that because we just want to say it. We believe that that happens. You know, we don't ask God for things that we don't think are going to happen, you know, especially in services like baptism, so that. That angels are assigned to us, to guard us, to help us. So how do you interact more with your angel? Well, number one, you know, a lot of prayer books, for instance, will have a prayer in there called the prayer to your guardian angel. You know, if you don't have it in your prayer book, then you could probably find an orthodox prayer to the angel online somewhere. I'm sure that you can find something, and that's something that I would incorporate into your prayer every day. But, you know, one of the things that actually, I don't know why I started doing this not that long ago. I'm kind of ashamed to admit within just the past couple of years, as I'm going to sleep, you know, first, of course, you know, we pray to our Lord Jesus Christ to preserve us and to save us, you know, of course, because we could die in our sleep. But also the next thing that I do then is I Specifically say, you know, oh, guardian of my soul and body, protect from me from all assaults of the evil one this night. And then I also add, because I'm a husband and a father, protect my wife and my children. And I name them in that prayer as I'm going to sleep. Because, you know, you go to sleep, that's a kind of a vulnerable position to be in. And you want, you know, the guards up and doing their task in the night while you're asleep. And that's what, you know, that is one of the things that we know that the angels do. That's not all that they're about for sure. We're going to be talking a lot more on this show about what angels are about and what they do. But one of the things that they do, of course, is to guard us, you know, that they keep us from harm, not just physical harm, but also spiritual harm. Like there is a war going on. There is a war going on. It is a spiritual reality and we're participating in it. We're either participating in the works of God and becoming more like him, or we're participating in the works of the devil and becoming more like him. Like one of the biggest aha moments in my conversations with Father Stephen was when he said, you know, that there's. There's basically a thing that's the opposite of theoses, you know, that there's. I said, what is that? Demonosis? And he's like, well, I don't know if there's a word for it specifically, but there is. Like, you participate in what God is doing and you become like him. But if you participate in what the dark powers are doing, you become like them, right? So you're always headed in one direction or the other. You don't get to stand still. So, you know, how do we participate in the reality of our angels? I mean, prayer is the biggest thing. But also just have that sense, I think, especially when you're going to sleep is a good one. But also, you know, when you wake up in the morning to say, help me today, you know, be with me. We're not talking about some kind of flim flow phlegmy, you know, I hope angels are watching over you. Like that's okay to say that, right? But that's kind of not all that they're really about. These are, you know, God's armies, His created beings. They're his government in a very real sense. Right. And part of our task is to become like them. You know, the Lord says that the sons of the resurrection this isn't in Luke's gospel. Sons of the resurrection become like sons of God and equal to the angels. So we take on their roles. We do the things that they do. So, yeah, your guardian angel, your patron saint, the one you're named after, the one who's assigned to your parish, like the saint who's assigned to your parish is very concerned with the place that your church is in. Right. So I think if we just be. The beginning is just to acknowledge that, like, they're here. My church is just named after, like, here in Emmaus. Our church is named for the Apostle Paul. It's not just named after the Apostle Paul. He's here, and this place is important to him because we asked God to assign him here, and so we believe that that happened. Right. So, like, my studio. My studio I assigned to St. Raphael of Brooklyn. I don't know if you're named after him. Yeah, there you go. So. Right. So he's. He's here with me right now, and he's there with you. He's doing that. So I think those are the key things, is add that to your regular prayer and understand that they are part of your life. They're not just there as a kind of spiritual technology, like, oh, hey, I need some protection. So I hope the angel shows up. But they're there. They're assigned to you, to your place, whatever. So I know. Father Steven, do you have anything to add to that?"}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5387.62,"end":5398.1,"speaker":"Fr Stephen De Young","text":"Just a couple quick nuances, dad. One that you brought out there at the end, that. That it's not just the Frank Peretti version of Guardian angels, you know, fighting off."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5399.22,"end":5426.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. Anybody out there read Frank. Frank Peretti? There's. Yeah, there was a. There was a novel series called oh, man, Now I'm Piercing the Dark. Yeah, this present darkness and Piercing the darkness. I read those when I was a kid, and it scared me to death that, like, there was an angel, there was a demon under my bed, or whatever, you know, that kind of thing. Oh, man, this is the worst. I bet you we're gonna get a lot of Frank Peretti calls over the. Over the course of the show. Anyway. Sorry, Father. Go ahead."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5426.63,"end":5430.91,"speaker":"Fr Stephen De Young","text":"But this role as angels, proper, as messengers, that they bring our prayers before."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5430.91,"end":5431.35,"speaker":"Fr Andrew Stephen Damick","text":"God."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5433.27,"end":5458.01,"speaker":"Fr Stephen De Young","text":"And are part of that communication beyond the spiritual warfare factor is important. But that. Yes, that they're. They're bringing our prayers to God. And potentially, although this isn't something we initiate, they can bring messages from God to us. That doesn't mean you summon them up or ask them."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5458.49,"end":5461.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Don't do that, channel them or any."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5461.41,"end":5474.58,"speaker":"Fr Stephen De Young","text":"Of that sort of new age angel channeling stuff. Right. But, but yeah. And then the rest of what Father Andrew said."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5474.9,"end":5526.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thank you. Well, thank you very much for that call, Rafael. Thank you. It's good to have you on. And thank you to everybody who called and to all of those who joined us in the chat room today, to those who emailed us and even God bless you spammers who showed up in our Facebook event and posted all those ridiculous links that had nothing to do with our show. Thank you everyone for participating and thank you for bearing with us on this, our inaugural episode of the Lord of Spirits podcast. And you know, God willing, we're going to have a lot more episodes after that, after this. So that's our show for today. Thank you for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you either via email at LordOfSpace or you can message us at our Lord of Spirits Podcast."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5526.21,"end":5541.85,"speaker":"Fr Stephen De Young","text":"Facebook page and join us for our live broadcast on the second and fourth Thursdays of the month at 7 Eastern, 4pm Pacific. And don't forget to like our Lord of Spirits Podcast Facebook page. While you're at it, leave a recommendation and invite your friends."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5542.49,"end":5553.6,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts, then that raises the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5554.8,"end":5562.96,"speaker":"Fr Stephen De Young","text":"And finally, finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasts stay on the air."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5563.76,"end":5566.16,"speaker":"Fr Andrew Stephen Damick","text":"Thank you and God bless you."}
{"episode_id":"LOS - #002 - 2020-09-11 - Angels and Demons - Introducing Lord of Spirits","start":5568.16,"end":5578.82,"speaker":"Steven Cristoforo","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio."}
