{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2.48,"end":67.12,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":69.2,"end":94.16,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. I am Father Andrew Stephen Damick in Emmaus, Pennsylvania and my co host, Father Stephen DeYoung is with me from Lafayette, Louisiana. So unlike most of our episodes, this one, like the previous one, actually is prerecorded because when this one airs, Father Stephen is going to be at a retreat. Last time I was at a retreat treat, so if you call, you're not going to get anyone on the other end. But we should be back again live."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":94.16,"end":99.84,"speaker":"Fr Stephen De Young","text":"In the future as, as you hear this, I will be in Tennessee, the greenest state in the land of the free."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":100.48,"end":137.35,"speaker":"Fr Andrew Stephen Damick","text":"Well, it is monster month here on the Lord of Spirits podcast and we're going to be focusing on biblical and other monsters for both of our episodes here in October. For tonight's episode, we're going to be talking about gigantic demonic monsters like Leviathan and behemoth, but also some assorted and related spiritual beasts that we see in apocalyptic biblical texts. First, though, Leviathan. I think the question that most people would probably start with is this. Is the Bible saying that there is some kind of gigantic sea dragon swimming around in the ocean?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":139.43,"end":140.71,"speaker":"Fr Stephen De Young","text":"Yes. Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":140.87,"end":152.64,"speaker":"Fr Andrew Stephen Damick","text":"I knew it. I remember watching the movie the Abyss and I was, it's like, okay, I know it's going to be here at some point. There's got to be. But no, there was no dragon."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":153.52,"end":162.8,"speaker":"Fr Stephen De Young","text":"Yeah. No, there. Yeah, you kind of get that in Pacific Rim a little bit. I mean, they're technically dragons. Kaiju. Yeah, close enough."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":162.8,"end":163.2,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":164.96,"end":188.67,"speaker":"Fr Stephen De Young","text":"So, yeah, so we're going to be talking about Leviathan, this, this particular sea monster here in the first half. And so we're going to be talking a little bit about him or her, and we will be also sort of disambiguating from other sea monsters."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":188.75,"end":189.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":189.31,"end":190.11,"speaker":"Fr Stephen De Young","text":"As we go."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":190.75,"end":195.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's a lot of things crawling down under there. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":196.43,"end":223.92,"speaker":"Fr Stephen De Young","text":"Lots of critters. Yeah. So the one we're talking about, Leviathan, is. Leviathan is the sort of standard English transliteration of the Hebrew lou yatan, which. The actual Semitic root. Right. If you. If you know a little bit about any of the Semitic languages, they all have a trilateral root. They have three consonants that are sort of the root of the word."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":224,"end":224.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":224.96,"end":228.48,"speaker":"Fr Stephen De Young","text":"And it's LTN equivalent in this case."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":228.8,"end":229.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":230.16,"end":250.08,"speaker":"Fr Stephen De Young","text":"So you get Lotan in some places, in some dialects, Ugaritic. You have Latano, though. That comes at the end of a big, long academic argument about how to correctly pronounce the Ugaritic version of the name. Because. Because that's what we do for fun."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":250.08,"end":257.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we don't have any, you know, Ugaritic people around to let us know how it's supposed to. How they would say it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":258.85,"end":276.61,"speaker":"Fr Stephen De Young","text":"But everyone now has settled upon Litanu for the Ugaritic and all of those. What they. What they sort of mean is the twisting one or the writhing one. Right. And that. That is obviously evocative of a sort of sea serpent type."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":277.73,"end":278.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":278.13,"end":279.17,"speaker":"Fr Stephen De Young","text":"Type of creature."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":279.25,"end":280.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. And."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":280.73,"end":282.01,"speaker":"Fr Stephen De Young","text":"And, you know, I mean, its movements."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":282.01,"end":325.63,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. And that's. And. And that's connected. I mean, there's a lot of sort of serpentine imagery from the ancient world that has that. That emphasizes this idea, which is, you know, is connected with. With being twisted in the way that you talk, you know, being a liar, you know, And I mean, you know, it brings up Genesis 3, right. The serpent in the garden. So, like, the idea of twist, being twisty and being a serpent and being shifty and. And evil, like, this is totally a thing. But. But we're not. We're not talking about all of those images together. But. But this particular one, and not even every, as you said, every kind of, you know, snake in the water, but this particular one. Right, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":325.63,"end":342.54,"speaker":"Fr Stephen De Young","text":"Who is sort of, sort of emblematic of that, right. That. That is its emblematic feature. So, like, when. When we say liturgically, oh, good one, we're not just saying, like, ah, he's pretty good. Right. Where we're saying, you know, this is the one who is truly good."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":342.7,"end":343.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":343.42,"end":353.66,"speaker":"Fr Stephen De Young","text":"Same kind of idea here. This is the one that is truly twisting and writhing and subtle. And slippery the twisted one. All of those things. Right, right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":354.3,"end":371.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So to help us begin to disambiguate exactly what we're talking about, we actually, even though this episode is prerecorded, we are going to, quote, take some calls, but they're all prerecorded calls, so we have one. And this was submitted by Steve, who has this relevant thing to say."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":371.82,"end":439.87,"speaker":"Steve From Grand Rapids","text":"Greetings, fathers. This is Steve from Grand Rapids, Michigan. First, I just wanted to say thank you for the show. I've been curious about and have felt drawn to orthodoxy for many years, but this podcast has finally lit the fire in me to actually go and participate. So thank you for that. My question is about yom, the Hebrew word for sea. I took some biblical Hebrew way back in the day at a very liberal liberal arts college. The professor loved to try and scandalize the students by pointing out all the places modern translations demythologized the text. I never quite had enough of a grid for how to deal with his critiques. But thanks to this podcast and also shout out to Jonathan Peugeot as well, I now feel like I do. One of my professor's favorite examples was what he called Yam, the sea God. It seemed that anytime the text would say the word yam, he'd wink an eye and kind of chuckle to himself. So I'm curious about the connection between nyam, the word for sea, and more explicit references to Leviathan and behemoth. Is every reference to the sea a reference on some level to these lesser gods? Thanks. Love the show."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":440.43,"end":457.64,"speaker":"Fr Andrew Stephen Damick","text":"All right, so, okay, so he mentions Yam. I mean, Yam has been mentioned on this podcast before. What's the deal? How does yam relate to. Is every. As he says, is every reference to the sea a reference to the God of the sea, Yam, or. And, you know, and how does this connect to Leviathan?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":459.15,"end":462.43,"speaker":"Fr Stephen De Young","text":"Right? And despite spelling, Yom has no connection to sweet potatoes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":462.51,"end":465.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Disappointing. Also disappointing."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":465.27,"end":465.59,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":465.59,"end":467.23,"speaker":"Fr Andrew Stephen Damick","text":"Y a m. Yeah, Yam."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":469.87,"end":489.11,"speaker":"Fr Stephen De Young","text":"So he is right that Yam, the word that's just used for the sea, is also the word for this sort of primordial. What is in the BAAL cycle, the previous most high God, this chaos force. Yeah, but that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":489.11,"end":489.75,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":489.75,"end":496.27,"speaker":"Fr Stephen De Young","text":"That's common, right, in the ancient Near East. Right. Shemesh is just the word for sun, and it's also the sun God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":496.27,"end":496.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":496.51,"end":498.59,"speaker":"Fr Stephen De Young","text":"I mean, and."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":498.59,"end":520.7,"speaker":"Fr Andrew Stephen Damick","text":"And you know, and as we've emphasized before on, on this show, you know, Hades is the place and the God who rules it, or, you know, hell in in Germanic mythology. So, I mean, you could understand why someone might think, okay, every time this word is mentioned, is it supposed to be evoking this notion of the God who rules it or is in it?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":522.46,"end":544.38,"speaker":"Fr Stephen De Young","text":"Right. And this brings us back to the concept that we kind of broached last time about the way epistasis is used to describe ancient gods in general. Right. We're most used to that. So before you freak out about me using it this way here, go back and listen to the last episode if you haven't."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":544.56,"end":545.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, please."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":546.08,"end":582.05,"speaker":"Fr Stephen De Young","text":"Because there are continuities and discontinuities with how it gets used by the. Is used by the Church Fathers in terms of the doctrine of the Holy Trinity and how it's used when we're talking about ancient gods. Right. It's not completely different, but there are significant differences. Right. And when we're talking about pagan gods, probably the key word we need to remember in terms of that is the idea of embodiment, the idea of something serving as sort of a body or a localization or an instantiation of that spirit."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":582.45,"end":591.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So if you're in the water, on some level, you're interacting with yam from the point of view of, you know, Semitic paganism."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":591.45,"end":601.18,"speaker":"Fr Stephen De Young","text":"Right, right. In the sea. Right. Yeah. Yeah. And so when they're going, if they're going, they didn't really go out to sea. They stayed pretty close to the land at this point in history."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":601.18,"end":603.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Their boats couldn't go too far out. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":604.78,"end":610.46,"speaker":"Fr Stephen De Young","text":"But, yeah, so if you're a pagan and you're doing this, you're going to."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":610.46,"end":610.78,"speaker":"Fr Andrew Stephen Damick","text":"Be."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":612.62,"end":627.76,"speaker":"Fr Stephen De Young","text":"Offering before you go your sacrifices and your rituals related to Dagon slash Poseidon slash yam slash whomever. Right. To sort of try to be friendly, make friends."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":628,"end":628.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":630.32,"end":655.68,"speaker":"Fr Stephen De Young","text":"So that when you're out there, that then you'll be. You'll be. You'll be safe and not to go. We're not going to go down this rabbit trail. But this is sort of what's at play when Jonah gets caught in the storm at sea and all the pagans are praying to their gods. Right, right. To try to figure out, like, hey, try yours. Which one did we make angry?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":655.68,"end":656.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":658.43,"end":768.16,"speaker":"Fr Stephen De Young","text":"That'S so. Yeah. But so this, the. What we would call the material sea. Right. The Mediterranean is what we're really talking about. In this case, they would say that is an embodiment of yam, the same way, you know, the Egyptians would see the solar disk in the sky as one embodiment of ray. And so when in. In Egypt, when The worship of Amun as such, the solar disk itself as such sort of comes to the fore later on. It's still often referred to as Amun Re in the text. It's not. They don't see it as a different God. They see it as we're work. We're worshiping this particular localization or instantiation of that. Right. Spirit. Right. So all of that said, this, this, this then gets us to the relationship between Yam and Latanu. Right. To stick with the Ugaritic language and names. So in. In their understanding, Yam has a whole bunch of dragons, Right. Who are sort of one of the ways in which he sort of projects his will and activity into the world. And so they sort of represent. You could use the word hypostasis. They represent different sort of aspects of Yam as they go out into. Into the world. And so Letanu in particular, or Leviathan sort of represented his destructive power. So power like his might."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":768.56,"end":775.68,"speaker":"Fr Andrew Stephen Damick","text":"Would they make reference then to Latanu Yam or. Or. I don't know what order they would put it in, but it would."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":775.76,"end":781.36,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yum. It would be. It would be like. It would be a possessive. Yams. Letano."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":781.52,"end":782.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay, gotcha."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":785.2,"end":788.08,"speaker":"Fr Stephen De Young","text":"The way we would talk about, you know, Bob's strength."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":788.56,"end":790.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":792.06,"end":794.22,"speaker":"Fr Stephen De Young","text":"Because that Bob, he's a tough guy."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":795.98,"end":799.82,"speaker":"Fr Andrew Stephen Damick","text":"So we're not sure where he's worshipped, but somewhere. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":800.14,"end":827.36,"speaker":"Fr Stephen De Young","text":"Oh, there's a cult of Bob, I'm sure. And so this is why this sort of comes up, of course, in the first big struggle in the BAAL cycle is BAAL versus Yam. Right. In his sort of revolution of the gods against the previous most high God. And so in the process of him defeating Yam, he defeats Latano."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":827.6,"end":827.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":827.92,"end":837.6,"speaker":"Fr Stephen De Young","text":"He defeats Leviathan. Right, right. He overcomes sort of his power and his might. Right. So it's sort of you. You break him down a piece at a time. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":838.48,"end":842.48,"speaker":"Fr Andrew Stephen Damick","text":"You gotta. You gotta defeat all the foot soldiers before you go up against the boss at the end of the level."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":843.66,"end":852.78,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. Y' all is the end boss. Yeah, yeah. But. But there's also. It's a little different than that in that yam isn't seen as totally separate."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":852.78,"end":853.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":853.66,"end":872.7,"speaker":"Fr Stephen De Young","text":"So to defeat all of these dragons. Yeah, to defeat all of these dragons is to defeat Yam. Right, right, right. So, yeah, so it's a little. Yeah, there's a little subtlety to it, but. And this is. This is lost, by the way, on most folks like the professor we just heard about."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":874.09,"end":874.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":874.49,"end":900.45,"speaker":"Fr Stephen De Young","text":"Who who tend to look at, you know, ancient quote unquote mythology through the clash of the Titans lens of, you know, Zeus yelling release the Kraken. Right. Like that. These are just these creatures and these beings and stuff and they, they, they basically. We've talked about this before, several times. They, ancient pagans are sort of these primitive screw heads who don't know anything."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":900.45,"end":916.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, yeah. I mean, I think it's worth revis this question because, I mean, I started out with this sort of idea. Is there a dragon in the water? You know, like, you know, in the abyss? They go down there and there is. Not that they're looking for one, but that there isn't something there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":916.79,"end":918.79,"speaker":"Fr Stephen De Young","text":"Or just like they had diving."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":919.03,"end":989.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Or Yuri Gagarin goes up into space and says, I didn't see any God there. And that's the, that's one of the problems is there's this, the sort of materialist reading of ancient religion which looks at these beings and says, well, I just, you know, the way I conceive of, you know, Zeus, whoever, is basically just a big human that's really powerful or whatever. And I didn't see any of that. So there must not be any Zeus, you know, and, or, you know, I, I, I, we, we took a submarine down into the water and we didn't see any dragon there. So there must not, not be one. But, but even though that's, you know, the, the, the imagery that's used in ancient paganism depicts these things, you know, in, as images. Right. As something you can see or describe or look at. That's not the way that people actually interacted with the idea. It's not like they went out there and they're like, oh, I bet there's a sea serpent down there. Look, look, I can see it. You know, there's, it's, it's, it's rather that there's the experience that they have of it and, and then this is the kind of language that they use to describe it because it's kind of indescribable."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":991.4,"end":1000.92,"speaker":"Fr Stephen De Young","text":"Right, right. And they, and they looked at the sea and the sea is in motion. Storms come off of the sea, the sea swallows people up and kills them."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1001.16,"end":1001.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1001.64,"end":1025.07,"speaker":"Fr Stephen De Young","text":"Boats go out to sea and never come back. Right. And their understanding, which is not an unsophisticated understanding, for something to act, for something to do things, it has to be animated by a spirit. Right, right, right. Things that aren't animated by a spirit don't do things other than maybe decompose in the case of a dead body."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1025.47,"end":1025.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1026.99,"end":1031.23,"speaker":"Fr Stephen De Young","text":"But decomposing. Right. Like the sea seems to hold together."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1031.95,"end":1073.09,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's funny, even in modern materialist views of these things, we still have like, we don't call it that, but we still have these notion of kind of animating spirits, like gravity. Right. It's this force that's acting all the time and moves things, but, you know. Well, I can't see it. You can't. You know, like, it's, it's, it's, it's interesting. Like there still is this idea or even things like, you know, cosmic rays or radiation or all these things that have these effects that we, and we can measure them, but, but they're not, they're not visible. Right. So it's just really, it's in some ways a kind of alternative take on exactly the same kinds of things that ancient people were talking about."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1074.21,"end":1089.25,"speaker":"Fr Stephen De Young","text":"Right, right. It's just a question of what level of consciousness you ascribe to these things. And there are scientists and philosophers of mind today who are starting to ascribe consciousness to things like the Earth."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1089.49,"end":1090.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1091.57,"end":1106.36,"speaker":"Fr Stephen De Young","text":"So. And welcome back, everybody. So, yeah, it's not, it's not. While it was pooh poohed for a long time because of the completely materialist approach to things, people are now coming."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1106.36,"end":1106.92,"speaker":"Nathan Hargraves","text":"Back around."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1108.76,"end":1167.35,"speaker":"Fr Stephen De Young","text":"And saying, oh, well, yeah, maybe in some places they phrased things in an unsophisticated way. But there's an important insight many times to be had here. Yeah. So this, this assumption of, you know, again, our 19th century German friends, that everything just evolves and it's all progress and, you know, everything starts out primitive and stupid and then culminates in 19th century Germany. One, one, you know, sort of through line, maybe with a little hiccup for the Dark Ages, quote, unquote. Dark Ages. But other than that, it's onward and upward, just is being abandoned. Now we get it. It was dumb. So this, this understanding, you know, we were just using the, the ugaritic terms and names, but you find parallels to this understanding all over the place."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1167.43,"end":1167.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1168.39,"end":1193.04,"speaker":"Fr Stephen De Young","text":"In the ancient, in the ancient Near East. Right. So we have these very early seals and inscriptions that, that show Haddad or Hey dad or Hadad, depending on. But Haddad, this is not H A D, D A D. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1193.04,"end":1197.52,"speaker":"Fr Andrew Stephen Damick","text":"Which means blacksmith in, in Arabic at least. I'm not sure about other languages."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1198.16,"end":1212.65,"speaker":"Fr Stephen De Young","text":"Right. This is, this is HDD are the consonants. Right. And this was the, the storm God in ancient Syria, that was roughly parallel to baal."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1212.65,"end":1213.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1213.09,"end":1291.72,"speaker":"Fr Stephen De Young","text":"In, in what's Now Lebanon, Phoenicia. Right. And Hadad, we have these inscriptions and these seals of Haddad defeating a serpent. The succession myth, Marduk is sort of the actor and part of that is defeating Tiamat, whose other Semitic name is Tahom, which is the word for abyss. Right. So Tiamat, this dragon is seen as the abyss in the same way that that Leviathan or Latanu is related to Yam, who Marduk defeats. Marduk ends up when he defeats Tiamat, he makes the world out of her carcass and her blood drips and becomes humans. So that's an enchanting tale for your kids about how the world came to be. And then we even see in Egypt, we see in inscriptions and seals these depictions of Horus, who's the sort of falcon headed God, the God associated in that early period with the pharaoh defeating Sobek, who was the God of the Nile. Sobek had a crocodile head."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1292.44,"end":1292.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1292.96,"end":1328.65,"speaker":"Fr Stephen De Young","text":"Right. So this is falcon head guy versus crocodile head guy. If you're showing it to small kids, that's how they will describe it. They might not say falcon, might say bird head guy, to be fair. And then this even, because as we've said before, Greece is not really the first western civilization. They're the last ancient Near Eastern civilization. Starting in the 6th century in Greece, we start getting imagery of the Hydra."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1329.05,"end":1343.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, Which, which gets defeated by Hercules. Although Hercules is not exactly. He's not the thunder God. I mean, he's related, you know, he's the son of Zeus, Right. If I recall. Yeah, now I'm blanking."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1343.48,"end":1346.8,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So he's really a human woman."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1346.96,"end":1365.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, exactly. He's. He's a demigod. And then you know, even get. You even get. Then although it's. It mute, it mutates further as you get further out, I think like you get Thor and Jormungandr, but Jormungandr is the Midgard serpent, sort of the world serpent, which we're going to talk about in just a second as to why."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1365.43,"end":1367.07,"speaker":"Fr Stephen De Young","text":"That'S a little bit different."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1367.07,"end":1380.27,"speaker":"Fr Andrew Stephen Damick","text":"Not yet. Not exactly the same thing. But there is this notion, for whatever reason of a thunder God versus a serpent that seems to keep getting popping up over and over again in various kinds of mythology."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1381.71,"end":1403.23,"speaker":"Fr Stephen De Young","text":"Right. And, and there is, with Hercules, the connection is a little more tenuous. But he is sort of the rejected illegitimate son who has to sort of earn his place among the gods. So it's not a true succession myth. He doesn't go and kill Zeus, but there is sort of A. There are elements there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1403.23,"end":1403.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1403.87,"end":1429.05,"speaker":"Fr Stephen De Young","text":"That would connect it. And we also have now going even further back, going way, way back to the long ago time in Sumeria, we have depictions. There's not a depiction of a God or someone else defeating it, but there are depict depictions of these seven headed serpents that generally have horns on their head."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1429.77,"end":1430.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1430.97,"end":1463.46,"speaker":"Fr Stephen De Young","text":"So we don't see somebody beating it up. But the idea of this creature, because the seven heads and the horns are, are typical parts of the way Leviathan, Lotan, Latanu are, is depicted. That depiction of such a creature goes all the way back into ancient Sumeria. So this is the idea of this creature. Leviathan has been around sort of as long as human civilization has been around, as far as we could tell."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1463.46,"end":1463.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1465.62,"end":1476.01,"speaker":"Fr Stephen De Young","text":"And then they had various figures in their understanding defeating it. But that means they saw it as sort of the primordial threat that someone needs to defeat."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1476.25,"end":1476.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1477.13,"end":1484.25,"speaker":"Fr Stephen De Young","text":"Someone needs to, to overcome in order to establish order or create the world or both. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1485.13,"end":1487.77,"speaker":"Fr Andrew Stephen Damick","text":"Well, let's not get too far ahead of ourselves. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1491.13,"end":1491.53,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1491.61,"end":1492.01,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1494.65,"end":1502.25,"speaker":"Fr Stephen De Young","text":"It'S worth noting that the, one of the frequent sort of epithets."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1502.57,"end":1502.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1502.73,"end":1556.15,"speaker":"Fr Stephen De Young","text":"We talked about how Leviathan and latanu and Lotan mean sort of the twisting one. But one of the titles that gets applied to Leviathan over and over again, both in Ugaritic texts and in the Old Testament in particular in Isaiah, is the fugitive serpent. That gets translated in weird ways sometimes in English translations, those the fleeing serpent or the serpent who runs away. And that makes for some really weird reading in English because you have somebody, you know, God beating up the serpent that runs away. And that doesn't sound very heroic or impressive. He was trying to run away, like seriously. But it means, it's more the idea of a fugitive. That's what fugitive means, actually."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1556.15,"end":1557.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it means fleeing, literally."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1557.43,"end":1558.31,"speaker":"Fr Stephen De Young","text":"Somebody who runs away."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1558.55,"end":1559.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1559.51,"end":1563.03,"speaker":"Fr Stephen De Young","text":"So it's not incorrect. It's just not really capturing the idea."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1563.37,"end":1563.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1564.49,"end":1566.45,"speaker":"Fr Stephen De Young","text":"Of what's going on and that I."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1566.45,"end":1568.05,"speaker":"Fr Andrew Stephen Damick","text":"Didn'T kill my wife kind of thing."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1568.05,"end":1606.55,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I don't care. So that in Hebrew is nakash, Akalaton and nakash. That word that's translated. That's the word of the two. That's translated serpent is the word that's used, that's translated as serpent in Genesis. Genesis 3. Right, Nakash. So there is a connection between the devil as depicted in Genesis and this creature."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1606.79,"end":1607.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1607.27,"end":1613.11,"speaker":"Fr Stephen De Young","text":"Right, right, right. So there is a, a sort of a direct connection there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1613.19,"end":1638.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I thought. And the, you know, the, the temptation is, you Know, since we have sort of modern, post enlightenment brains, we're like, okay, is that. Are you saying that this is the devil? Like, this is this spirit, this is this creature, you know, but like, that's just kind of not the way that these. That ancient myth and its texts actually work. You know, it's not a taxonomy."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1639.12,"end":1648.8,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. Well, and it's. And like we were talking about before, it's like asking, is Yom Leviathan yes or no? And the answer is yes and no."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1648.88,"end":1650.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right. Often."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1651.82,"end":1665.66,"speaker":"Fr Stephen De Young","text":"Yeah. So. So is Leviathan the devil? Yes and no. So as we mentioned, we have to kind of disambiguate a little."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1666.06,"end":1666.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1666.94,"end":1668.22,"speaker":"Fr Stephen De Young","text":"Not terms of."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1668.38,"end":1672.14,"speaker":"Fr Andrew Stephen Damick","text":"Not every. Not every snake down in. In the depths is the same snake."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1672.7,"end":1712.84,"speaker":"Fr Stephen De Young","text":"Right. So there are, There's. There's some diversity in that. We could. There's a tendency when we get on to something like this, right. We're like, oh, Leviathan. Oh, this is interesting. There's all these parallels. There's a temptation sometimes to go a little crazy. Right. Therefore, every snake, every dragon, every crocodile, everything, every lizard is Leviathan now. And we have to disambiguate a little. Right. They're not all the same. There's. There's some nuance there that you'll miss if you just try to lump everything together. This, by the way, is where Joseph Campbell goes horribly wrong."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1713.56,"end":1715.32,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is this where he goes horribly wrong?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1715.48,"end":1722.24,"speaker":"Fr Stephen De Young","text":"Yes. No, this is. This is the. This is the problem with his methodology that produces all of the other problems with Joseph Campbell."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1722.24,"end":1723.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Everything becomes about everything."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1724.36,"end":1733.65,"speaker":"Fr Stephen De Young","text":"Right. It's that you just, you. You. You ignore all of the nuance and particularities, and in order to lump as many things as possible into the same."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1734.05,"end":1752.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, which is a total problem, especially for the kind of not very studied approach to ancient religion that some people take. Like, oh, look, here's a God that seems to die and then comes back. Well, that must just mean that Jesus is just a ripoff from some Whatever, Whatever, you know, like. Okay, actually, the differences are really important here."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1753.09,"end":1761.33,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so, yeah, so you get Joseph Campbell saying Hercules and Christian Christ and Luke Skywalker are the same person. And it's like."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1766.37,"end":1772.45,"speaker":"Fr Andrew Stephen Damick","text":"No, is that Joseph Campbell in his George Lucas hypostasis?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1773.09,"end":1774.29,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1776.53,"end":1777.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Sorry."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1778.29,"end":1782.17,"speaker":"Fr Stephen De Young","text":"So you could watch the old PBS documentary. He literally says that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1782.17,"end":1783.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right now."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1785.07,"end":1812.19,"speaker":"Fr Stephen De Young","text":"So, yeah, so we. We have to take into account not only the continuities, but also the discontinuities. Right, right. So one of the most common ones that gets mixed with Leviathan is the Uroboros imagery, the serpent or the serpent that encircles the world. The snake eating its own tail. Right. The. And that. That is actually an ancient thing."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1812.27,"end":1812.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1814.59,"end":1827.67,"speaker":"Fr Stephen De Young","text":"That symbolism. But that symbolism occurs alongside the sort of Leviathan chaosy monster imagery. It's not another function of the same imagery, Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1827.67,"end":1843.06,"speaker":"Fr Andrew Stephen Damick","text":"Because this serpent, like in Norse mythology, you've got the Midgard serpent, right? This serpent is a binding sort of force that kind of holds everything together versus, you know, which if it comes unloose, that's where you get earthquakes and."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1843.06,"end":1845.82,"speaker":"Fr Stephen De Young","text":"You know, Ragnarok and all that stuff."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1845.82,"end":1861.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't. We don't want that. You know, whereas Leviathan is. Is a destructive force that's aimed at ripping things apart. And, you know, it's. It's, you know, the storms in the sea and, you know, that. That kind of stuff, right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1861.7,"end":1967.62,"speaker":"Fr Stephen De Young","text":"It's. It's chaos and death and darkness and that kind of stuff, right. So that needs. That's a separate thing, Right. In Egypt, something interesting sort of happens with Apophis. Apophis starts out right, in earlier periods of part of the. The story surrounding Ray, the sun God, is that what we would describe as the sunset? Is Rey entering the underworld to do battle with Apophis, who is this serpent being the serpent monster, right? So it's very easy to quickly jump on that and say, aha. So see, this is another, right. It's the God battling Leviathan thing. But in this early period, the Apophis monster is not associated with the sea in any way. Right. Egypt has a coastline with the Mediterranean, but Apophis is not associated with the sea because the sun didn't set into the sea. If you're Egyptian, the sun set into the desert. And so Apophis is more associated with the darkness of the sky between the stars, right? The sun ray drives out that darkness right at sunrise every day, right? So at night, that darkness briefly becomes somewhat ascendant and then. Right. Is defeated again in the morning. So that's how it sort of originally works. But ancient people jump to conclusions too."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1969.38,"end":1972.99,"speaker":"Fr Andrew Stephen Damick","text":"They're not all perfect geniuses that have all this stuff worked out, right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":1973.31,"end":2041.4,"speaker":"Fr Stephen De Young","text":"Some of them pulled the Joseph Campbell move, right? So during. During the Hyksos period, Semitic peoples who the Egyptians called Asiatics invaded and took over Egypt. And they brought with them their own stories and traditions and understandings of things. So you get these Semitic stories related to BAAL and Letanu, right? Hadad and the serpent, right? All of these things now come into Egypt. And this Sort of assimilation takes place. And so after the Hyksos period, you get depictions of Set, who of Set killing a crocodile. Right. And we could see this is on one hand, parallel to the earlier Egyptian imagery of Horus defeating Sobek, the crocodile God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2041.48,"end":2041.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2042.36,"end":2072.2,"speaker":"Fr Stephen De Young","text":"But on the other hand, Set, being a God associated with death, has sort of assimilated part of the chthonic BAAL tradition. Right. And so he's sort of replaced Horus in this, in killing a crocodile. So Apophis starts out disambiguated from Leviathan and then sort of gets pulled in later on to that Leviathan tradition."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2072.52,"end":2073.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2074.04,"end":2076.44,"speaker":"Fr Stephen De Young","text":"Once it comes to Egypt."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2076.44,"end":2084.15,"speaker":"Fr Andrew Stephen Damick","text":"And I mean. And relatedly, you know, Set is like. He has storms and disorder and violence and that kind of thing associated with him."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2085.27,"end":2085.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2085.67,"end":2087.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2090.95,"end":2156.65,"speaker":"Fr Stephen De Young","text":"So. And, yeah. And of course, Rey's going into the underworld to fight Apophis and the original Egyptian thing. So it just kind of gets smushed together and takes this new form. And then finally we have to disambiguate Leviathan from Rahav. Rahav is another name for a. A sea monster, a sea serpent. It's also described as a tannin, which is the Hebrew word for dragon. It's also described in ugaritic sources as a fugitive serpent. Right, as the fugitive serpent. But the Book of Job, for example, mentions Rahav and Louis Ton. Leviathan separately distinguishes the two. And so this is because, as we mentioned, Yam had several dragons. Litanu and Rahav are sort of two different dragons. They're both associated with Yam, but they're. They're not always necessarily the same critter."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2156.65,"end":2167.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, point of interest, this is the same name as the harlot Rahab who lets the people of Israel into Jericho."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2168.18,"end":2173.34,"speaker":"Fr Stephen De Young","text":"Right? Yes. Yeah, yeah, yeah. So not that we're saying she is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2173.34,"end":2174.58,"speaker":"Fr Andrew Stephen Damick","text":"A dragon of Yah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2174.66,"end":2175.78,"speaker":"Fr Stephen De Young","text":"No, no, no."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2175.78,"end":2177.06,"speaker":"Fr Andrew Stephen Damick","text":"She just has this name."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2177.46,"end":2193.36,"speaker":"Fr Stephen De Young","text":"She. She was a legit pagan, though, before. Yeah, clearly before becoming part of Israel. Yeah, she had her pagan street credit. I'll sort it out. Right. So with that sort of definition and disambiguation done."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2193.84,"end":2194.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2194.8,"end":2259.77,"speaker":"Fr Stephen De Young","text":"We're going to go to the places where Leviathan is mentioned in the Old Testament directly talked about. And so we're not going through the order they were written or even the order they appear in your Bible. There's a method to our madness. Trust us. We're going to start with Psalm 74. Okay, so Psalm 74, before we get to the part about Leviathan, which starts in verse 12 just to sort of set the context, verses 1 through 11 are sort of a lament. This is a psalm that's written during the exile in Babylon and the temple has been destroyed. And so there's sort of a lament for those 11 verses of the defeat of, of Judah, the destruction of the temple, and how Judah's been laid low."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2260.09,"end":2353.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then, then there's this turn in verse 12, thus, you know, the first word then being yet right after all this bad stuff has happened. So I'm just going to read verses 12 through 17 so you can hear where this turn then goes. Yet God, my king is from before the ages. He has worked salvation in the midst of the earth. You split Yam by your might. You broke the heads of the dragons on the waters. You crushed the heads of Leviathan. You gave him as food for the Ethiopians. You split open springs and brooks. You dried up ever flowing streams. Yours is the day, yours also the night. You have established the heavenly lights and the sun. You have fixed all the boundaries of the earth. You have made summer and winter. So I mean, this is cool because first there's this lament about the destruction that's happened in Israel. And then it's yet God is the king from before the ages. You know, he's the one who works salvation. And then you get this, this, you know, description of him defeating Yam and Leviathan, feeding Leviathan to the Ethiopians, and then talking about setting the earth in order. Right. There's you split open springs and brooks, you dried up ever flowing streams. And then, you know, the day and the night, the seasons, the bounds of the earth. Right. So it's this, this notion that God is not just the conqueror of these, these beings, but is also the Creator, the one who sets things in order."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2354.81,"end":2372.72,"speaker":"Fr Stephen De Young","text":"Right, Right. There's this, there's this move. And so this is. Well, first we should say just in case somebody just opened their Bible and didn't see Ethiopians. Yeah. So the Hebrew there literally has those who live in the wilderness."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2372.87,"end":2379.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes, those are the ones who get to eat Leviathan. But I think it's the Greek, the Greek Old Testament that has the Ethiopians."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2379.51,"end":2382.63,"speaker":"Fr Stephen De Young","text":"It identifies the Ethiopians as the ones who live in the wilderness."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2382.79,"end":2399.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you know, the point of that identification is for a lot of people in the Mediterranean, Ethiopia is the ends of the earth. Right. That's the super far away place that is on the margins of everything."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2400.29,"end":2400.93,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2401.65,"end":2409.73,"speaker":"Fr Andrew Stephen Damick","text":"And for more about that, listen to some of the stuff, the conversations that Jonathan Pageau has had with Richard Roland, where they talk about Ethiopia."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2410.37,"end":2466.41,"speaker":"Fr Stephen De Young","text":"Yeah. And so, interestingly here, notice that the salvation that God wrought in the midst of the earth here is the creation of the world. And the way the creation of the world is described is the defeat of Yom, the defeat of chaos, and then the putting in order. Right. We get the language from the days of creation. You fixed all the boundaries of the earth. Yours is the day, yours is the night. You made the heavenly lights of the sun. Right. And so this way of phrasing, it is deliberately sort of, as we've talked about many times before, taking the claims that the pagan nations made about BAAL and ascribing them instead to Yahweh. No, it's Yahweh who did this. Right. Not baal, not Marduk. Even though we're slaves in Babylon right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2466.41,"end":2466.73,"speaker":"Fr Andrew Stephen Damick","text":"Now."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2468.57,"end":2469.77,"speaker":"Fr Stephen De Young","text":"Not anyone else."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2470.17,"end":2491.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And again, a useful point to note is there's no struggle. God just splits Yahweh. He just breaks the heads of the dragons. There's not like there was a pitched battle where it was really touch and go for a while there. It never is with. With God. He simply commands and, you know, it's. It's done just boom. It's a single act, right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2491.39,"end":2504.59,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that split language is. Is also kind of a reference creation to separating the waters above from the waters below. Those are two different dragons in Neo Babylonian."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2504.67,"end":2506.11,"speaker":"Fr Andrew Stephen Damick","text":"Interesting stories. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2506.43,"end":2561.35,"speaker":"Fr Stephen De Young","text":"With Marduk. So over against, you know, what has befallen Israel or what has befallen Judah, in this case, Israel's already gone. What is befall Judah is, remember, this is who God is and what he has done. And a brief note, we're going to be developing this more later on in the episode, but this whole thing about Leviathan being fed to Ethiopians, right, this feeding thing, this is also an imagery of this sort of order. Right. So if. If you go out hunting and you go and hunt down a wild beast, Right, A wild beast out in the wilderness is. Is an image of chaos. Right. But if you go out and you hunt it and you kill it and you bring it back and you prepare it and you cook it, you have now placed it in order and it's now providing sustenance in life."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2561.67,"end":2594.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it's also worth noting, you know, for those who have been to the services for theophany or been to an orthodox baptism, in the Byzantine tradition, these texts are used at theophany and the blessing of waters and at baptism at the blessing of waters, associating this defeat of sea Monsters with the purification of the world that happens when Christ is baptized, and then also with the purification happens when a Christian is baptized."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2595.27,"end":2655.29,"speaker":"Fr Stephen De Young","text":"Right. And it also describes the movement that happens when water is blessed. Right, Right. That water within the fallen creation becomes like the sea. It becomes this destructive force of flooding, of drowning, of all of these things. But when it's taken and it's blessed, either by Christ's physical presence in it or by us at the great blessing of the waters, it is transformed into something that's for sustenance and purification and healing. Right. And so that same kind of move is happening. Right. And we're participating in it in those liturgical services. Right. And then, of course, this psalm ends in verses 22 and 23 with an opportunity for you to plug your book, I mean, with an important call."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2656.41,"end":2692.26,"speaker":"Fr Andrew Stephen Damick","text":"It turns out that the phrase arise, O God, appears in multiple places in the Bible. And I mean, it's super relevant. Verses 22 and 23. Arise, O God, defend your cause. Remember how the foolish scoff at you all the day. Do not forget the clamor of your foes, the uproar of those who rise against you, which goes up continually. So there's this notion then, that having earlier in the psalm said, this is our God, this is what he did, it's essentially saying, would you do this again? It's calling upon him to do it again. Come up against these same foes, you know?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2693.06,"end":2693.38,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2693.38,"end":2693.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2693.7,"end":2723.72,"speaker":"Fr Stephen De Young","text":"Honesty is again the arise from which we get anastasis. Right, Right. So that then is a good segue into another place where Leviathan is mentioned. And that's in Isaiah, chapter 27. Right. And this is right at the beginning, and it begins with, in that day, that day being the day of Yahweh, the day of the Lord."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2724.87,"end":2755.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. So verses one through three. In that day, Yahweh, with his hard and great and strong sword, will punish Leviathan, the fugitive serpent, Leviathan, the twisting serpent. And he will slay the dragon that is in the sea in that day, a pleasant vineyard. Sing of it. I, Yahweh, am its keeper every moment. I water it. And again, there's this connection of defeating a serpent. And then there's a vineyard, you know, the, you know, cultivated, nurtured land."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2757.45,"end":2814.69,"speaker":"Fr Stephen De Young","text":"Right. And so this is, rather than going back to the past, this is projected toward the future in that day of. Of Yahweh defeating Leviathan in the future. And then we have this paradise imagery of this watered garden, this watered vineyard that's going to be re. Established. So what does that mean. Well, when we put these two things together, we understand, right. Well, if Leviathan got its heads crushed and got fed to Ethiopians back at the creation, and how were their Ethiopians right at the create anyway? Then how. Right. How can Leviathan still be around? Well, the answer is in that movement and that Arizo God Leviathan is still around and is lurking behind is the Spirit, the force that's animating the enemies of God, like the Babylonians."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2815.09,"end":2815.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2816.29,"end":2846.49,"speaker":"Fr Stephen De Young","text":"And the others who are, who are oppressing Israel. And then this gets the other place where. Going Back to Psalm 74, for just a second, I didn't want to spoil. Right. That verse 12 of Psalm 74. Yet God my King is from before the ages. He has worked salvation in the midst of the earth. The place where you may have, if you're Orthodox or attending an Orthodox church, heard that recently was at the Feast of the Cross."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2846.49,"end":2851.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's everywhere in hymns related to the cross last month."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2852.33,"end":2875.02,"speaker":"Fr Stephen De Young","text":"And so you will get a lot of sort of lamo explanations of that, that he's worked salvation in the midst of the earth. Well, that means that, you know, they thought Jerusalem was in the center of the world. So that's what they're saying. Jesus died in the middle of the earth. In Middle Earth, not in Middle Earth. I knew you were going to try and go there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2875.34,"end":2877.34,"speaker":"Fr Andrew Stephen Damick","text":"Not. Not Midgard, not Midden Yard."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2877.42,"end":2883.69,"speaker":"Fr Stephen De Young","text":"Yes. It's not always the same podcast, so."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2883.77,"end":2886.57,"speaker":"Fr Andrew Stephen Damick","text":"It is being a different podcast. Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2889.53,"end":2914.4,"speaker":"Fr Stephen De Young","text":"So what this is saying. Right. Again, when you get a verse quoted, even if it's just one verse being sung in liturgy, that's supposed to call your mind back to the whole context. What that's saying is that what happens on the cross when Christ is crucified is that second battle against Leviathan in which Leviathan is defeated in the new creation begins."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2914.64,"end":2916.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's, it's."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2916.24,"end":2917.4,"speaker":"Fr Stephen De Young","text":"That's why it's quoted there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2917.4,"end":2933.36,"speaker":"Fr Andrew Stephen Damick","text":"It's not about a geographic location. It's about, you know, the, the, the whole creation at once. You know that it affects everything. It's about creation, not about, you know, a spot on a map."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2935.04,"end":2943.73,"speaker":"Fr Stephen De Young","text":"Right. Yeah. And the crucifixion is not Christ temporarily losing, but he's going to have a comeback three days later."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2943.73,"end":2945.21,"speaker":"Fr Andrew Stephen Damick","text":"No, no, it's his."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2945.21,"end":2952.37,"speaker":"Fr Stephen De Young","text":"The cross is, Is Christ splitting yam in two and crushing the heads of Leviathan."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":2952.85,"end":3019.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, there's, it's interesting to me that if you understand the underworld, you. According to ancient myth, then there's both this sense of a kind of cavern beneath the world, and then also a notion of plunging into the depths of the ocean. Right. And, you know, when we usually think of the harrowing of hell, then we. I don't know. And frankly, you know, most iconography depicts the kind of cavern. Right. I have an awesome icon here in my studio, thanks to some very generous people, that depicts exactly this. Although it's interesting, it's. It's kind of both, because you see the souls of the departed being swallowed up by what looks like a big serpent, but still you've got that. And then also kind of cave, but then also the underworld is understood as being underwater at the same time. And so you get sort of the Jonah imagery of being down in the depths of the sea at the same time. And so, I mean, that's kind of all going on at the same time here."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3019.76,"end":3025.6,"speaker":"Fr Stephen De Young","text":"Here. Right, right. And so."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3027.52,"end":3027.88,"speaker":"Fr Andrew Stephen Damick","text":"Those."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3027.88,"end":3043.16,"speaker":"Fr Stephen De Young","text":"Those are the two sort of most interesting, perhaps references that give us this picture of. Of sort of the cosmic significance of. Of. Of Leviathan. But there. There are also some other sort of appearances, and some of them have a little different character in the Old Testament."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3043.16,"end":3043.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3044.88,"end":3053.62,"speaker":"Fr Stephen De Young","text":"So there's. There's sort of a cursory mention in Amos 9. 3, where it's just, leviathan is the serpent at the bottom of the sea."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3054.74,"end":3055.46,"speaker":"Fr Andrew Stephen Damick","text":"It's gonna bite."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3055.46,"end":3060.42,"speaker":"Fr Stephen De Young","text":"I tried to come up with something interesting to say about that, but I mean, that's. That's what it is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3060.42,"end":3069.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it just literally says in that verse, if you try to hide from the sight of God at the bottom of the sea, then it's gonna. The serpent will bite you. That's. That's basically what it says."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3070.9,"end":3112.24,"speaker":"Fr Stephen De Young","text":"Yeah. So the one we probably hear the most, again, if you. If you go to vespers in an orthodox church is. And I'm going to use the. The liturgical English Antiochian translation we're probably used to hearing. So your. Your experience may vary in translation, but Psalm 104 or 103 in the Greek numbering, that's read at the beginning of vespers. Leviathan, whom thou hast made to sport therein is how it's usually translated, referring to the sea. So you have the sea, and then God makes Leviathan to sort of flip around and play in the water. Yeah, that's how it comes off."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3112.24,"end":3112.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3112.56,"end":3112.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3112.72,"end":3120.6,"speaker":"Fr Andrew Stephen Damick","text":"You get this image that God made this beast and, you know, go play. No, but that's not what's going on here."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3121.08,"end":3136.32,"speaker":"Fr Stephen De Young","text":"Right. Because you can equally translate it. Leviathan, whom thou hast made to play with him to sport with him. Right. The idea being that God plays with Leviathan. Leviathan is like his pet, like his dog."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3136.64,"end":3136.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3136.96,"end":3145.2,"speaker":"Fr Stephen De Young","text":"Or like his cat, who he plays with. Now, that seems to be a striking contrast."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3146,"end":3146.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3147.28,"end":3150.08,"speaker":"Fr Stephen De Young","text":"With what we were just talking about with Leviathan."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3150.08,"end":3162.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. But. But. But the. But the way that these two things come together is this notion of. Of almost domestication or muzzling or control, you know?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3162.77,"end":3163.17,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3163.65,"end":3165.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3165.57,"end":3189.33,"speaker":"Fr Stephen De Young","text":"And when we get into the last place where Leviathan is talked about, the Job, that kind of comes together. So Job actually talks about Leviathan in two places. The first place is kind of a cursory reference again, and that's in Job three, verse eight. Talks about those skilled in raising up Leviathan, which is kind of ominous."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3189.49,"end":3196.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, is this. We might picture Cthulhu sort of thing, you know?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3196.77,"end":3252.21,"speaker":"Fr Stephen De Young","text":"Yes. Or release the Kraken or. Yeah, right. So. So this is referring to sorcery. This is. That is. What it's referring to is. Is magic. And not good magic, not friendly magic. And so the. The form that this seems. What this seems to be referring to directly is we have these. These things from ancient Israel and ancient Judah that are called incantation bowls. We have them from their neighbors, too. This is something they got from their neighbors. This isn't something they were supposed to be doing. And they're called incantation bowls because they're sort of pottery bowls. And then around the. Like in a circle around the. Sometimes the outer ring, sometimes an inner ring, sometimes both. If it's a long inscription, they'll have these sort of spell incantations."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3252.29,"end":3257.97,"speaker":"Fr Andrew Stephen Damick","text":"Now, I mean, would they use this to kind of, like, mix up ingredients to make magical stuff, potions and such?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3258.93,"end":3297.4,"speaker":"Fr Stephen De Young","text":"It's hard to tell. Yeah, it's hard to tell because we just know that. Right. We know that in some cases they would. You could turn it and read it. We know in some cases where there were curses. Right. They would read the curse and then smash it. The symbolism being kind of obvious. You're putting a curse on someone. And so the idea here is that raising up Leviathan is not getting your summoning circle and calling, you know, Cthulhu or Nyarlathotep into the world. It's. The idea is that you're sort of sicking Leviathan. You're sending chaos and destruction after somebody."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3297.64,"end":3298.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3299.48,"end":3305.44,"speaker":"Fr Stephen De Young","text":"It's not a Christian thing, cursing them. Yes. It's a bad thing to do. Don't try this at home. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3305.44,"end":3306.2,"speaker":"Fr Andrew Stephen Damick","text":"Or anywhere."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3307.08,"end":3311.96,"speaker":"Fr Stephen De Young","text":"Yeah. Definitely not at church, so."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3313.56,"end":3313.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3313.88,"end":3352.1,"speaker":"Fr Stephen De Young","text":"But sort of the Main extended place where we hear about Leviathan in the, in the book of Job runs from Job 40, verse 25 to 41, verse 26. And Leviathan there is described in terms that are obviously reminiscent in many places of a crocodile. And so you'll get folks of a materialist bent sort of off out of a sort of. We need to take everything literally bent. Who will try to say, oh, well, this passage of Job is just describing a crocodile."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3352.34,"end":3352.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3352.7,"end":3355.54,"speaker":"Fr Stephen De Young","text":"Because crocodiles are big and scary wizards."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3355.54,"end":3358.94,"speaker":"Fr Andrew Stephen Damick","text":"But it's a fire. Fire breathing crocodile. And."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3358.94,"end":3372.01,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah, they don't do that. That one's hard to take literally. Yeah, right. So you say. I'm going to take it literally and say it's a crocodile, but the fire breathing part is figured right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3372.81,"end":3374.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. But, but yeah, good luck."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3374.57,"end":3375.37,"speaker":"Fr Stephen De Young","text":"Good luck with that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3375.45,"end":3384.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And then, and then this connects then with the idea that Leviathan can be a pet. Right. How does that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3385.13,"end":3436.92,"speaker":"Fr Stephen De Young","text":"Well, and so the place where the crocodile is coming in, you know, is. We've seen like with the Horace Sobek imagery in Egypt, right, where this sort of chaos was. Is depicted as a crocodile. That's where crocodile elements are coming into Job's description. But we also have in early Iron Age Palestine, which would be the period of the judges, roughly. Okay, we have these seals that show a humanoid figure. It's just an image. So we don't know if that's supposed to be a God or whatever, who is controlling two crocodiles, has them on either leashes or hooks in their mouth or something. And in the academic world, this guy is called the Crocodile Master, which really."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3436.92,"end":3441.48,"speaker":"Fr Andrew Stephen Damick","text":"Sounds like a Golden age, you know, D.C. hero."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3442.12,"end":3448.28,"speaker":"Fr Stephen De Young","text":"Yes, a villain. Excuse me, a Batman villain. Yeah, the Crocodile Master."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3448.43,"end":3449.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Crocodile Master."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3451.95,"end":3454.87,"speaker":"Fr Stephen De Young","text":"So, but that's just because we don't know who he's supposed to be."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3454.87,"end":3456.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's just what academics call him."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3457.55,"end":3466.51,"speaker":"Fr Stephen De Young","text":"But it's a. It's a symbol of sort of some being that has power or control over the forces of chaos and evil."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3466.67,"end":3467.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3468.27,"end":3483.15,"speaker":"Fr Stephen De Young","text":"Is able to sort of dominate them and control them. And so this is the, this is where this connects into this idea of Leviathan being, or Luyatan being in some sense Yahweh, the God of Israel's pet. Yeah, under his control."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3483.47,"end":3576.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And I mean, if this seems. I mean, if this seems really too weird, I mean, like, I'll just give, I'll just give a. An example from my own personal experience. Right. So, you know, most people in our culture are familiar with people owning dogs and dogs are pets. Right. Dogs are nice, you know, and that's why it horrifies us when we hear that people in the Far east like to eat them. Like don't eat them, you know, but, you know, when I was quite young, I used to deliver newspapers on the island of Guam. And Guam has a lot of totally undeveloped jungle area, and in a lot of that undeveloped jungle area are the descendants largely of people's pets. So there are wild dogs on Guam, at least there were back when I lived there in the late 80s. I don't know if that's. That's still the case. But they're wild dogs that run in packs and do awful things. And, you know, I would encounter them sometimes when I was out there at four in the morning delivering newspapers in my neighborhood. And, boy, are they. I mean, they look the same basically, as your. The. The pets that people have in their houses, although they're often, you know, mangy and gross. But. But they are. Their personalities are vicious and chaotic and. And, you know, and really destructive. Right. And so the idea of taking a wild, vicious animal like that and, you know, controlling it and turning into a different kind of thing, that's. That's a really great example of that. I mean, you don't hardly ever run across a wild dog in the United States. You just run across people's pets. But. But boy, dogs on their own, they are. They are chaos monsters, that's for sure."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3578.79,"end":3591.22,"speaker":"Fr Stephen De Young","text":"Right. And this. This imagery is critically important to understanding how the Old Testament looks at what we today call the question of theodicy."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3591.3,"end":3591.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3593.3,"end":3640.83,"speaker":"Fr Stephen De Young","text":"And the relationship between God and the evil and chaos and destruction in the world. So in. In paganism, as we saw when we started talking about Leviathan, there's this idea of sort of equal opposition. Right. That there are forces of order and forces of chaos, and they're sort of continuously at war. Right. And for now, order has the upper hand, but that order is always threatened, you know, by. By chaos coming back in. And so there's this constant vigilance and usually. Well, I shouldn't say usually. Often in. In these myth cycles, there's some point in the future where chaos comes back and wins."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3640.99,"end":3641.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3641.63,"end":3643.15,"speaker":"Fr Stephen De Young","text":"Like some kind of Ragnarok."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3643.15,"end":3645.71,"speaker":"Fr Andrew Stephen Damick","text":"Ragnarok, exactly. That's the one I mentioned. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3647.39,"end":3681.71,"speaker":"Fr Stephen De Young","text":"So. So there's this. This kind of equal ultimacy of these two forces. Right. You don't have that. Right. In the Old Testament, you have something very different. There is nothing equal and opposite to Yahweh. Everything that is Yahweh created Right. And so that then is what creates the question of theodicy. Right. You don't have the question of theodicy if it's just like, well, Ray's doing the best he can. He's fighting Apophis every bloody night. What do you want from it?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3681.71,"end":3686.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah, right, yeah. You don't ask, like, why does evil exist, Ray?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3686.71,"end":3732.62,"speaker":"Fr Stephen De Young","text":"You know, it's like, no, it's obvious, right. He's. He's working. He's working, he's sweating. So the picture we get, and we get this over and over again in different ways. And we'll talk about this again when we cover other topics, because there are depictions of other, like, gods of plague and gods of trouble that are parallel to this and connected to the Four Horsemen of the Apocalypse. Right. For example, in the. In the prophets. But what we see over and over again is this imagery of God having control over these things in the sense that he can then use them. They are in some sense forced against their will to be his servants. We've talked about this with demons in general."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3732.86,"end":3733.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3733.62,"end":3750.62,"speaker":"Fr Stephen De Young","text":"This, this idea, this imagery that's made very explicit in the book of Jubilees that, that God allows a certain number of demons a certain amount of leash in the world in order to torment the wicked, in order to bring them to repentance."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3750.62,"end":3753.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the idea of the left hand of God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3754.54,"end":3770.51,"speaker":"Fr Stephen De Young","text":"Right. And. And St. Paul, you know, this is what he picks up on that track about turning someone over to Satan for the salvation of their soul through the destruction of their body. Right. That's. That's what he's alluding to, is that understanding that that's why there are these troubles. To try to bring us to repentance."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3770.98,"end":3771.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3771.26,"end":3797.67,"speaker":"Fr Stephen De Young","text":"Right. To try to bring us to salvation. So God doesn't just. Yahweh, the God of Israel, doesn't just defeat chaos or hold chaos at bay. Right. But he actually grabs a hold of chaos and uses even it to bring about order, to bring about good. Right. He seizes the force of ev. Forces of evil and makes them bring about good despite themselves."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3797.67,"end":3800.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he harnesses it. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3800.59,"end":3800.99,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3802.11,"end":3808.51,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that is the first half of this episode, and we're going to be right back after a short break."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3809.07,"end":3825.39,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3829.63,"end":3838.15,"speaker":"Fr Stephen De Young","text":"Hi, this is John Maddox. You know, when you support Ancient Faith Radio, you're not only helping to make this ministry possible for you, but also."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3838.15,"end":3840.43,"speaker":"Steve","text":"For people like Bryce in Australia."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3840.99,"end":3882.8,"speaker":"Fr Stephen De Young","text":"I'd firstly just like to say that I love your show and what you do, it means a lot to all of us listening. I'm down in Australia and over here, Orthodoxy is basically unheard of. I'm not Orthodox. I was raised into an Evangelical Protestant family. However, from a gradual exposure and desire to learn more about Orthodoxy, I've come to agree and see truth in pretty much everything the church teaches. The nearest English speaking Orthodox church is several hours away and I feel all alone in my pursuit of the faith here. Currently, my only exposure to Orthodoxy is through Ancient Faith Radio. And my friend, how should I introduce the idea that I may be inquiring into Orthodoxy to my parents? Thanks again, Bryce."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3883.12,"end":3886.4,"speaker":"Steve","text":"Would you consider a donation to AFR right now?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3886.72,"end":3888.4,"speaker":"Fr Stephen De Young","text":"You can do so on our app."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3888.48,"end":3894.04,"speaker":"Steve","text":"Or go to our website@ancientfaith.com Support Ancient."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3894.04,"end":3896.84,"speaker":"Fr Stephen De Young","text":"Faith Radio here for you and for."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3896.84,"end":3898.24,"speaker":"Fr Andrew Stephen Damick","text":"People all over the world."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3902.09,"end":3918.09,"speaker":"Steve","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3922.33,"end":3933.7,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the second half. Normally we would start taking your calls here, but despite what the voice of Steve just said, this is in fact a prerecorded episode. So we're not receiving any calls. Don't call the number. No one's home."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3933.94,"end":3937.98,"speaker":"Fr Stephen De Young","text":"Well, some. Someone. Wait, what? What if they call it and someone does answer?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3937.98,"end":3942.18,"speaker":"Fr Andrew Stephen Damick","text":"I. I'm not sure what would happen, actually. I don't think anyone will be."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3944.02,"end":3946.02,"speaker":"Fr Stephen De Young","text":"It's a risk. You could roll the dice."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3946.5,"end":3954.34,"speaker":"Fr Andrew Stephen Damick","text":"It's possible. I mean, it's true. I mean, you could call. I mean, who. Hopefully Trudy is taking the night off or something, you know."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3954.42,"end":3958.36,"speaker":"Fr Stephen De Young","text":"Yeah, maybe. Maybe the call would end up inside your own house."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3958.36,"end":3963.68,"speaker":"Fr Andrew Stephen Damick","text":"Dun, dun, dun. That said, though, we did get this message from Chris."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3964.48,"end":3965.52,"speaker":"Fr Stephen De Young","text":"Hi, Fathers."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3965.76,"end":3971.6,"speaker":"Nathan Hargraves","text":"So my question is actually about these demonic beasts, the Leviathan and the behemoth."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3972.32,"end":3976.84,"speaker":"Fr Stephen De Young","text":"And I guess I've been thinking about it in relation to Christ putting all."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3976.84,"end":3978,"speaker":"Nathan Hargraves","text":"Things under his feet."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3978,"end":3979.84,"speaker":"Fr Stephen De Young","text":"So my question is actually two parts."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3980.64,"end":3996.1,"speaker":"Nathan Hargraves","text":"Do you think we could say that when Christ put all things under his feet, that he did in fact do the mash? He did the monster mash. And also, if so, do you think it actually was a graveyard smash? That's it. Thank you."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":3996.82,"end":4002.02,"speaker":"Fr Andrew Stephen Damick","text":"So, given everything we just said, I think the Answer is pretty clearly yes on both counts."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4003.62,"end":4008.1,"speaker":"Fr Stephen De Young","text":"My answer is wah wah brumch."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4009.38,"end":4034.34,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for that, Chris. It is a good observation you are making. All right, so, okay, we've talked about Leviathan and being monster mashed, and indeed, it was a graveyard smash since it's about, you know, the destruction of Hades and so forth. So. Okay, we're also going to be talking about Behemoth. So what is. What's that all about? This is a very different kind of image."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4035.3,"end":4038.34,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. This is not just another name for the same thing."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4038.58,"end":4039.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4039.7,"end":4072.06,"speaker":"Fr Stephen De Young","text":"This is a. This is a whole separate tradition. And Behemoth is also like. Leviathan is a transliteration of Louisan. Behemoth is a transliteration of Behemoth. And Behemoth, unlike Louisan, is a much more commonly used word because bahema, which is the. The noun in the singular, means cow."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4072.46,"end":4073.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4073.66,"end":4082.38,"speaker":"Fr Stephen De Young","text":"Literally, and is also sometimes used more generally just to mean beast, as in beasts of the field."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4082.78,"end":4083.34,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4086.14,"end":4112.17,"speaker":"Fr Stephen De Young","text":"And so, yeah, that's. That's a relatively common word. And then being a feminine. Because it's cow, being a feminine noun, grammatically feminine, the plural of that is behemoth. So, yes, you heard that, right? Grammatically, behemoth is feminine plural."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4112.57,"end":4112.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4114.09,"end":4141.06,"speaker":"Fr Stephen De Young","text":"But there are places where this feminine plural noun takes masculine singular pronouns. That's why we talk about behemoth as a thing, behemoth as a creature. Right. Not as things. And so this plural is what we call an intensive plural."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4142.34,"end":4150.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. So probably the first place people might go is to think of, okay, is this like the royal we, or as they call it, the. The plural of majesty."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4151.69,"end":4152.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4152.17,"end":4181.63,"speaker":"Fr Andrew Stephen Damick","text":"Which is sort of a similar concept. Right. But it's not just. It's not just a plural that refers to a singular thing. In that case, it's a plural that refers to, you know, royalty or, you know, although you also have the editorial we, as in. As we have all seen. But. But, but, yeah, it's not the plural of majesty. It's a. It's an intensive plural. Yeah. So what does that mean?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4182.19,"end":4185.87,"speaker":"Fr Stephen De Young","text":"This is really a brief digression to respond to pedantry."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4186.03,"end":4191.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. We don't have any pedants who listen to this podcast, though I'm sure. None."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4191.39,"end":4192.59,"speaker":"Fr Stephen De Young","text":"No, not a one."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4193.47,"end":4194.83,"speaker":"Fr Andrew Stephen Damick","text":"Only the people who make it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4195.55,"end":4196.03,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4196.51,"end":4196.91,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4199.15,"end":4206.47,"speaker":"Fr Stephen De Young","text":"Oftentimes, right, we're usually not talking about behemoth when this comes up. We're usually talking about the word Elohim."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4206.47,"end":4207.07,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4207.87,"end":4251.2,"speaker":"Fr Stephen De Young","text":"Which is another plural that takes masculine singular pronouns in the Hebrew Old Testament. Sometimes, yeah, often, yes. You know, because it's being used to refer to God. It's being, it's used to refer to Yahweh, but it's in the plural. And so oftentimes the way that's explained, some folks will try to bring the Trinity into that. There's a way you could do that that's semi valid, but frankly, no one is ever going to be convinced by it because there's another available option. And usually when that other option is being explained, usually people refer to the royal we that you were just referring to."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4251.28,"end":4251.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4251.64,"end":4275.55,"speaker":"Fr Stephen De Young","text":"We are not amused. Right. So, and this idea that, oh, well, this is, this, is this royal thing being applied to God because he's God. Right. And most times when that gets brought up, you will have someone show up and say, well, there's not a plural of majesty in Hebrew. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4275.55,"end":4276.35,"speaker":"Fr Andrew Stephen Damick","text":"Is that true?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4277.23,"end":4311.64,"speaker":"Fr Stephen De Young","text":"That is true. There it is not. Technically speaking. Yeah, technically speaking, that is a correct, actually, technically. But it's being used for pedantry because when, when people, giving them the benefit of the doubt, people who know what they're talking about when they use this example to explain to an English speaker why Elohim is plural, they're using it as an analogy. Right? So the plural of majesty in English is a structure like the intensive plural."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4311.64,"end":4314.08,"speaker":"Fr Andrew Stephen Damick","text":"In Hebrew, but it's not the same thing."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4314.64,"end":4317.36,"speaker":"Fr Stephen De Young","text":"Right. We don't have an intensive plural in English."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4317.68,"end":4364.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think the closest, I think the closest we get is, and this is purely colloquial spoken English is sometimes, when we want, sometimes we will repeat a word in order to, to achieve the same effect. Right. So, like, I might, so in this case, I might just, you know, disambiguate between, okay, I'm just talking about a God, or I'm, I'm talking about God. God. Like we sometimes do that. And there's a, there's a, there's a, there's a lift that happens in pitch when you do the first one and then, and then as, as the kind of modifier for the second. I think that's the closest thing we have in English. But it only, I think it only really exists in spoken English. You don't really see that written anymore anywhere."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4365.44,"end":4369.36,"speaker":"Fr Stephen De Young","text":"Right. I mean, the closest thing in written English would be capitalizing things."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4369.36,"end":4370.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4370.64,"end":4392.13,"speaker":"Fr Stephen De Young","text":"Turning it into a proper noun instead of a general noun. Yeah, right. But so what, what actually is going on with the intensive plural in Hebrew is that. So, for example, with Elohim, it's sort of like, this is God of gods, this is God with a capital g. This is the great God, right? This is the God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4392.13,"end":4392.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4392.45,"end":4392.69,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4393.09,"end":4394.29,"speaker":"Fr Andrew Stephen Damick","text":"Which is why in Greek you get."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4395.25,"end":4430.17,"speaker":"Fr Stephen De Young","text":"You know, the God, you get the article. You get the article added. Right. To convey that same kind of idea. So it's. It's that. That's why it's called the intensive plural. It intensifies the thing. So the same thing is happening with Behemoth. The reason it's plural, even though it's taking masculine singular pronouns, is that this is. This is the beast of beasts. Right. This is the beast. This is the great beast. Hey, yeah. It's the super beast. This is. Right. This is the beast capital."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4430.49,"end":4432.09,"speaker":"Fr Andrew Stephen Damick","text":"The beast to end all beasts."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4432.57,"end":4461.94,"speaker":"Fr Stephen De Young","text":"Right, right. That's. That's the idea. Right, that's the idea. And that's why Behemoth gets turned into a proper noun, transliterated into a proper noun, and capitalized. Right. The way Leviathan is. So we don't have the related cognate words related to cattle directly used to name Behemoth the way we have, like Lotan and Latanu and Louisan."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4461.94,"end":4462.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4464.02,"end":4489.79,"speaker":"Fr Stephen De Young","text":"But we do have parallels outside of the Old Testament for this idea. Right. That this is connected to. And probably the closest one. And I'll just go ahead and say it now. We're gonna be speaking delicately throughout this half of the program."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4490.03,"end":4490.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4490.43,"end":4491.11,"speaker":"Fr Stephen De Young","text":"About some things."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4491.11,"end":4493.15,"speaker":"Fr Andrew Stephen Damick","text":"Parents with Behemoth parents. Just."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4493.15,"end":4498.28,"speaker":"Fr Stephen De Young","text":"Yeah. We will be doing our best to speak delicately. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4499.56,"end":4499.96,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4502.36,"end":4525.8,"speaker":"Fr Stephen De Young","text":"The biggest and main parallel that we have from neighbors, again, comes out of the Ugaritic tradition. This shouldn't be surprising. Right. These are Israel's neighbors. And BAAL worship is what keeps intruding down into Israel throughout its history. So there is this figure, Gil el Turtle Te."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4527.32,"end":4529.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Say that again."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4530.52,"end":4533.32,"speaker":"Fr Stephen De Young","text":"Sorry, sorry. You just, like glottal."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4533.32,"end":4533.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4536.44,"end":4544.12,"speaker":"Fr Stephen De Young","text":"This is. And the. That translated is L's calf Atik, and."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4544.12,"end":4545.56,"speaker":"Fr Andrew Stephen Damick","text":"L is Bale's father."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4545.72,"end":4546.2,"speaker":"Nathan Hargraves","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4546.2,"end":4569.42,"speaker":"Fr Stephen De Young","text":"Right. And so he has this calf named ati, also sometimes called Arshu in the texts. And this is a sort of version of BAAL Elsewhere, he's sometimes referred to as bull, Bale, or chthonic BAAL that we mentioned before in terms of set being assimilated to set in sort of later underworldly baal."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4569.9,"end":4570.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4570.34,"end":4701.98,"speaker":"Fr Stephen De Young","text":"Yes, yes. Hellish bail. Yes. So, yeah. And so the. We talked about how Leviathan is from the Ur. From the sea. This bull is seen as being sort of from the earth. And when we see that, we assume that means, like, came up out of the ground, sort of. Right. Because the Hebrew word aretz, that usually gets translated earth is also a word that's used a lot to refer to the underworld. Yeah, right. This is what's going on in Genesis 3 also, by the way, with the serpent is going to crawl along the earth. Right. It's talking about the underworld being thrown down to the underworld, not being thrown down to like the ground, like, but the underworld. And so that's that cathartic element again. Right. And so Bulba is again, that hypostasis idea. This is, this is an aspect, this is a localization instantiation of BAAL that's associated with his power and particularly masculine power and virility. It's the delicacy, talking about some of this stuff. And so the primary sort of appearance of Bulbale in myth is Bulbil in the underworld, in which he three times engages with a heifer in Sheol in the underworld as a sort of bringing fertility out of death. This is a transition from winter to spring thing. And this was celebrated annually in Ugarit and in Phoenicia ritually with a fertility ritual that involved engaging human priests, engaging with cattle."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4702.3,"end":4702.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4704.06,"end":4705.82,"speaker":"Fr Stephen De Young","text":"That's as delicate as I could do it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4705.9,"end":4706.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4707.5,"end":4709.74,"speaker":"Fr Stephen De Young","text":"Let the listener understand. Yeah, it was an adult."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4711.02,"end":4711.42,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4714.06,"end":4784.05,"speaker":"Fr Stephen De Young","text":"Ain'T paganism beautiful? So, and, and this, this figure of Bulba, of Arshu is described in another Ugaritic source in which the goddess Anat is speaking and bragging about all the cool stuff she's done. She talks about having defeated the seven headed dragon, the twisting serpent. Right. Letanu. And having defeated Arshu. So in the pagan Ugaritic sources also, there's sort of this parallel between Behemoth and Leviathan emerging. They're not only drawn together as we're going to see in a minute in the Old Testament, we also see this kind of figure in the Bull of Heaven in the Epic of Gilgamesh. Right, where you have this bull figure that is precious to the gods and usually to a male God in particular, because it represents his virility and masculine power is Austin Powers mojo. Right. Et cetera."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4784.05,"end":4784.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4785.73,"end":4830.11,"speaker":"Fr Stephen De Young","text":"And this even sort of makes an appearance with Zeus and Europa and that kind of thing, and also with the Minotaur in Greek stories, because again, Greece is the last ancient Near Eastern civilization and sort of brings some of these things into their final form. So that brings us to. Then the Bible. And Behemoth shows up in the Bible lesson at least directly in the Old Testament than Leviathan does. There are only two places, and the second place is a little contested, but I think I have a good argument for it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4830.11,"end":4830.63,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4831.67,"end":4858.08,"speaker":"Fr Stephen De Young","text":"So, but the first place is uncontested, and the first place is in Job, chapter 40, verses 15 through 24 in the Hebrew, 10 through 19 in the Greek. You may notice from that verse reference that that's right before Leviathan is talked about, Behemoth is talked about. So they're sort of brought together and paired here in the same way that they're paired in the Ugaritic texts, these two figures."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4858.24,"end":4927.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, so I'm going to read this from job 40. Behold Behemoth, who I made as I made you. He eats grass like an ox. Behold, his strength is in his loins and his power in the muscles of his stomach. He makes his tail stiff like a cedar. The sinews of his thighs are knit together. His bones are tubes of bronze, his limbs like bars of iron. He is the first of the works of God. Let he who made him bring near his sword, for the mountains yield food for him. Where all the wild beasts play under the lotus plants. He lies in the shelter of the reeds and in the marsh for his shade. The lotus trees cover him, the willows of the brooks surround him. Behold, if the river is turbulent, he is not frightened, he is confident. Though Jordan rushes against his mouth. Can someone take him by his eyes or pierce his nose to capture him? And I'll just say here, there's a reference at the beginning to Behemoth's sort of power in terms of virility. So the bit about the tail is actually referring to something else, but that's just the way that often some English translations treat it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4927.48,"end":4929.32,"speaker":"Fr Stephen De Young","text":"So again, yeah, delicacy."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4929.32,"end":4930.28,"speaker":"Fr Andrew Stephen Damick","text":"Let the reader understand."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4931.24,"end":4946.12,"speaker":"Fr Stephen De Young","text":"Yes, right. And so here, right, Just like, you know, there's people who tried to do the crocodile thing, the materialist route with Leviathan. There are people who try to say, this is a hippo."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4946.76,"end":4947.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4948.68,"end":4960.98,"speaker":"Fr Stephen De Young","text":"That the beast of beasts is a hippo. I don't know that there are a lot of hippos in the Jordan. I don't know that hippos are renowned for being really placid in rushing water. I don't think either of those things are true, frankly. But."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4960.98,"end":4964.38,"speaker":"Fr Andrew Stephen Damick","text":"Okay, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4964.54,"end":4990.52,"speaker":"Fr Stephen De Young","text":"Clearly not. Right. So. So this is, this is behavior. And we see there's these images of virility, of power, but then also the, the marsh stuff, the river stuff, the George stuff. This is, this is associating him with the word river. There's literally Nahar, Remember in the BAAL story, Yam's sort of prince, his sort of right hand man is Nahar river."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4990.68,"end":4991.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":4992.04,"end":5017.58,"speaker":"Fr Stephen De Young","text":"And so this is connecting Behemoth again with yam, with this chaos, these chaos horses, that similar kind of. Kind of idea. And so if we see Leviathan, as we've said this before on the show, but it's worth saying again, if we see Leviathan is sort of toxic femininity, Behemoth is toxic masculinity."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5017.58,"end":5018.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5018.86,"end":5062.09,"speaker":"Fr Stephen De Young","text":"This sort of conquering tyrannical for tyrannical force. Right, yeah. So, and just as with Leviathan going imagery going back to Sumer, if you set the Wayback Machine, go back to our first episode where we were talking about sacrifices in the Neolithic era, the bull decorations also go all the way back, as far as we can tell in human civilization. Right. The same kind of connection with these forces. So the second place where I'm going to argue Behemoth shows up is in Isaiah, chapter 30, verses 6 and 7."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5062.17,"end":5065.21,"speaker":"Fr Andrew Stephen Damick","text":"Okay, now, is this the Deyoung standard translation or."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5066.34,"end":5078.74,"speaker":"Fr Stephen De Young","text":"Well, all of these translations are the Deyoung standard translation. Yes. Anytime you hear a translation on this show and you go and look it up somewhere and it doesn't match, that's because I've fiddled with it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5078.82,"end":5079.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5080.74,"end":5081.78,"speaker":"Fr Stephen De Young","text":"And corrected it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5082.98,"end":5084.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5084.14,"end":5089.74,"speaker":"Fr Stephen De Young","text":"You may disagree with me and think I butchered it, Right? Fair enough. But in my mind, I've corrected it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5089.74,"end":5090.74,"speaker":"Fr Andrew Stephen Damick","text":"It's okay to disagree."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5090.74,"end":5091.22,"speaker":"Fr Stephen De Young","text":"Everybody."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5091.8,"end":5092.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5092.12,"end":5092.52,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5092.92,"end":5126.24,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay, so Isaiah, chapter 30, verses 6 and 7. An oracle against the behemoth of the south, through a land of trouble and anguish, from whence come the lioness and the lion, the viper and the flying seraph. They carry their riches on the backs of donkeys and their treasures on the humps of camels. To a people that cannot profit them, Egypt's help is worthless and empty. Therefore, I have called her Rahav, who sits still. So what's going on with that?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5126.88,"end":5140.4,"speaker":"Fr Stephen De Young","text":"Right, so the way this is typically translated in English, right, is they'll say it's an oracle against the beasts of the Negev or the beasts of the desert."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5140.4,"end":5145.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the Negev, which is a particular desert, but it just means south, Right, Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5145.53,"end":5152.61,"speaker":"Fr Stephen De Young","text":"Negev is also the word for south. That's why they call that desert that. It was the desert to the south, right? Yeah, it's the southern desert, really, is what that means."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5152.61,"end":5156.17,"speaker":"Fr Andrew Stephen Damick","text":"Pretty uncreative name for the desert, but there it is. Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5157.45,"end":5214.36,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, and so what that would mean is if you read verses one through five, they're talking about Egypt. And verse seven again mentions Egypt. Right. So it's talking about. Right. The Assyrians are coming. They're coming after Israel. And the temptation for Israel is going to be, we need to go and make some kind of treaty with Egypt, this other great power, earthly power, to defend us against the Assyrians. Forget the whole repenting and letting Yahweh protect us. We need to go and cut a deal with the Egyptians because they have chariots. So in Isaiah's. And Yahweh, by means of Isaiah is saying, that's not going to work. Right. That's just going to bring about your destruction. Right. Because Egypt is correct. Remember, I. I delivered you out of Egypt. Right. I defeated the Egyptian gods. There's nothing for you there. Right, so that's what he's clearly."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5214.36,"end":5246.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was going to say. I mean, this is. I mean, this is a theme in a lot of the scriptures, which is, you know, revenge is mine, saith the Lord. You know, like. Like, it's the whole. The kind of king that they want. We talked about this, right. When they. When they talked about the kind of king that they wanted in Saul to be a king who's going to defeat their enemies and go and, you know, make war the way that they want to make war. Right. Not trusting in God to do this, but instead, you know, building up an army and making treaties and functioning just like any of the nations around them do."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5247.73,"end":5262.86,"speaker":"Fr Stephen De Young","text":"Right. And so that's very clearly what 1 through 5 is about. Isaiah 31, 5. So then if we go by this other translation, then all of a sudden God decides to denounce animals that live in the desert."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5263.74,"end":5269.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, esv, it's called. It says an oracle and the beasts of the Negev, which doesn't make any sense."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5270.54,"end":5285.56,"speaker":"Fr Stephen De Young","text":"Right. So why is God denouncing these animals? And then when we get the list of animals, right, we got lioness and lion. Okay, Viper. Okay, Vipers out in the desert. And then the way it's usually translated is flying flaming serpents."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5286.44,"end":5290.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which. That doesn't sound natural."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5291.08,"end":5291.56,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5291.72,"end":5292.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5292.68,"end":5296.28,"speaker":"Fr Stephen De Young","text":"So I, I translated that by just transliterating the word that's there."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5296.36,"end":5335.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Seraph, which, I mean, flying seraph. Right. Because. So the reason why it makes sense to translate it that way and why this would be associated with Egypt is like, this is this. Well, again, first, this is the Egyptian term for these throne guardians who are depicted in serpentine fashion. But as I think we've mentioned on the podcast before, if you think about that headdress that Pharaoh wears, it makes him look like a cobra, which. What is a cobra? It's a Snake with, with wings, you know, so to speak. Right. So there's, there's the sort of symbol of Egypt is this seraphic image, right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5335.73,"end":5344.61,"speaker":"Fr Stephen De Young","text":"This is, this is, you know, look at the Sphinx. It's a lion, right? So we've got lions and serpents, right? These are the symbols of Egyptian power."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5345.01,"end":5346.65,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5346.65,"end":5366.74,"speaker":"Fr Stephen De Young","text":"And, and that's what it's referring to because it's hard to imagine a bunch of lions and lionesses and snakes, even flying flaming snakes carrying their riches on donkeys and camels. Right, right. So like, like literally the normal translation of this makes no sense."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5366.82,"end":5370.18,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's. This would make a great, a great Rudyard Kipling story."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5370.9,"end":5418.7,"speaker":"Fr Stephen De Young","text":"Yeah, right, right. And so, right, if you translate verse six the way I did, an oracle gets the behemoth of the south calling Egypt the behemoth of the south. The tyrant associate Egypt with, with behemoth. Right? And then this is about a seraph, right? These are the symbols of their power. They, the Egyptians put their riches on the backs of donkeys and their treasures on the humps of camels when they're doing trade. Right. To a people that cannot profit them. Right. So their, their, their efforts are feudal. Right. Their, their trade efforts are futile. And then lo and behold, in verse seven, it then makes sense to say Egypt's help is worthless and empty. Yeah, Right. Therefore I have called it Rahav. Who's. And now we refer to Rahav. We refer to this sea monster, this other chaos monster."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5419.9,"end":5423.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. Who have still. Which is the opposite of its power."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5424.22,"end":5462.06,"speaker":"Fr Stephen De Young","text":"Yeah. Who is inactive. Yeah, right. They may seem like this powerful beast, but they're not, they're not doing anything. Yeah, Right. So this is the other. And we see here what's, what's important about this one is that the reason we spent all this time about, with me quibbling about the translation and being a pedant myself, is that this shows us the same way we saw Leviathan kind of lurking behind and animating the enemies of God. This shows us behemoth and Rahav also. But behemoth lurking behind, right. And animating these, these nations, these enemies of God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5462.22,"end":5462.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5462.58,"end":5465.1,"speaker":"Fr Stephen De Young","text":"And that's going to be really important when we get to the third half."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5465.1,"end":5493.46,"speaker":"Fr Andrew Stephen Damick","text":"Which, which shows then why Israel wanting to deal with this with Egypt by what we might think of as conventional military and diplomatic means, why that's a futile act on their part. Because. No, no, no, this is actually a spiritual conflict. You know, you must have God on your side. You can't just go off and do this on your own. One does not simply walk into Cairo. Sorry. Or Alexandria."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5494.18,"end":5494.98,"speaker":"Fr Stephen De Young","text":"Cairo."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5494.98,"end":5495.9,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. Excuse me."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5495.9,"end":5496.74,"speaker":"Fr Stephen De Young","text":"I was being a little."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5496.74,"end":5498.62,"speaker":"Fr Andrew Stephen Damick","text":"A little anachronistic there. Excuse me."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5498.62,"end":5501.78,"speaker":"Fr Stephen De Young","text":"Even Alexandria is anachronistic. This is Isaiah, bro."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5501.78,"end":5502.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5502.66,"end":5504.02,"speaker":"Fr Stephen De Young","text":"This is 8th century B.C."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5504.18,"end":5505.54,"speaker":"Fr Andrew Stephen Damick","text":"So what's. I mean, so what's the capital?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5505.7,"end":5506.26,"speaker":"Fr Stephen De Young","text":"Memphis."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5506.26,"end":5506.66,"speaker":"Fr Andrew Stephen Damick","text":"Memphis."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5506.66,"end":5507.62,"speaker":"Fr Stephen De Young","text":"Memphis, my friend."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5507.87,"end":5508.35,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5508.43,"end":5508.95,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5508.95,"end":5515.31,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, look, the Bible can be anachronistic. It can refer to Babylon when Babylon is nowhere nearby. So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5515.79,"end":5520.35,"speaker":"Fr Stephen De Young","text":"Okay, okay. Nice try, actually."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5520.59,"end":5521.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay, thank you."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5524.83,"end":5534.04,"speaker":"Fr Stephen De Young","text":"So, and now to sort of round this out, right, to catch us up to. Because when we get to the third half, we're going to move to the New Testament."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5536.35,"end":5536.59,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5538.35,"end":5547.35,"speaker":"Fr Stephen De Young","text":"We got. We got a lot of interesting reactions. So we, shall we say to the. The title of this episode."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5547.35,"end":5549.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Leviathan. What's for dinner?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5550.35,"end":5558.51,"speaker":"Fr Stephen De Young","text":"Yeah. This idea of chowing down on Leviathan and. Actually, we're talking about chowing down on Leviathan and Behemoth."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5558.59,"end":5559.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5562.97,"end":5570.09,"speaker":"Fr Stephen De Young","text":"So, yeah, it's dinner time with both of them. That dad joke is beneath me. So you're gonna have to make it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5570.73,"end":5573.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, He's. Father Steven is reading from the script right now."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5573.89,"end":5574.25,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5574.57,"end":5577.05,"speaker":"Fr Andrew Stephen Damick","text":"It's the surfing turf. You're welcome."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5577.05,"end":5625.82,"speaker":"Fr Stephen De Young","text":"Yes. Right. And so what's gonna happen is that as we move through Second Temple Judaism and into early Christianity, there's one more sort of piece to the puzzle in terms of how the traditions surrounding Behemoth and Leviathan are going to develop. And that piece comes in Ezekiel, which is also obviously exilic. Right. Written in the Babylonian exile. Ezekiel 39, 17:20. And this is describing the fate of Gog and Magog, these nations that are the enemies of God and who we now know who's animating them from the other texts."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5625.82,"end":5674.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay, so this is Ezekiel 39, 1720. As for you, son of man, thus says the Yahweh God, speak to the birds of all kinds and to all of the beasts of the field. Assemble and come. Gather from all around to the sacrificial feast that I am preparing for you. A great sacrificial feast on the mountains of Israel. And you will eat flesh and drink blood. You will eat the flesh of the mighty and drink the blood of the princes of the earth, of rams, of lambs and of goats, of bulls, all of them fat beasts of Bashan. And you will eat the fat until you are full, and drink blood until you are drunk at the sacrificial feast that I am preparing for you. And you will be filled at my table with Horses and charioteers with mighty men and all kinds of warriors, declares Yahweh God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5677.53,"end":5693.21,"speaker":"Fr Stephen De Young","text":"Right. So. And notice that hopefully by now, people notice that reference to Bashan. Yes. Home of OG, home of the dead. RepHaim, home of Mount Hermon, gateway to the underworld."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5693.29,"end":5693.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5695.05,"end":5713.98,"speaker":"Fr Stephen De Young","text":"So again, we have that imagery that we saw with. With Leviathan in the psalm. Right. At the creation of. Of giving as food. Right. To the creation, the carcasses and blood of the defeated. The defeated enemies of God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5714.06,"end":5714.78,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5717.42,"end":5766.83,"speaker":"Fr Stephen De Young","text":"And. And that's sort of the. The prophecy of the fate of these enemies. And so where we get into that Second Temple Jewish literature and early Christian literature in. In 1st Enoch 60, verses 7 through 9, there's this reference to Behemoth and Leviathan. Leviathan is a female figure. Behemoth, Behemoth as a male figure, despite language, gender being opposite. And Leviathan is in the abyss. Right. The tahome. Right. That we saw is connected to Tiamat. And Behemoth is in the desert of Dund, which is not a Tolkien place. It sounds like a place. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5766.83,"end":5768.03,"speaker":"Fr Andrew Stephen Damick","text":"Dunedina people."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5768.59,"end":5775.06,"speaker":"Fr Stephen De Young","text":"Yeah. But the importance of that desert is that desert is said to be east of Eden."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5775.29,"end":5780.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's the Kane homeland where he builds his city. His. The Kane civilization."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5781.29,"end":5832.52,"speaker":"Fr Stephen De Young","text":"Right. And so that Behemoth and bull imagery is associated with the cities. Right. So you have chaos in the abyss, and you have. You have this chaos, oppression in. In the cities, motivating these. These nations. And then in 4 Ezra. And again, you should read for Ezra if you're from a Slavic orthodox tradition, it's in your Bible. 4 Ezra 6, verses 49 through 52 describes that Leviathan and Behemoth were created on the fifth day and were separated. Separated. Behemoth was put on the land, on the earth, and Leviathan was put in the sea until the end times when they come forth to be eaten."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5833.4,"end":5836.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5836.36,"end":5882.73,"speaker":"Fr Stephen De Young","text":"And what's for dinner? Yeah. Sec. 2nd Baruch, sometimes called the Second Apocalypse of Baruch 29, verse 4. In its description of the Messianic age, the age when the Messiah reigns, Leviathan, Behemoth get eaten by the remnant. The remnant who has been purified by judgment. The Leviathan, Behemoth emerge, and they get eaten by them. And then finally you get a similar kind of imagery in the apocalypse of Abraham 21, verse 4. This is just about Leviathan, but Leviathan is sort of lurking in the sea behind the scenes, lying behind current events until the end times, when emerges."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5882.97,"end":5960.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the point being that all of this imagery that's in the Old Testament that we also find in a lot of pagan sources as well continues on into the second Temple period. And there's this remarkable, you know, similarity between what's. With what's said, you know, the notion that Leviathan and behemoth are these demonic forces at work in the world. Leviathan associated with chaos, Behemoth with sort of tyranny. And they're kind of underneath everything, like, there's a. There's a sort of a primal sensibility to them. Right. Versus a lot of the kind of demonic beings that are described as kind of going from one place to another and, you know, that kind of thing, and that they're going to be eaten at the end of time, you know, and, and in the case of, you know, second Baruch, this notion that they're going to be eaten specifically by the remnant who have been faithful to God. It's. It's really interesting, you know, how everything there is this sense that all of these sources are functioning within the same, the same world. They're not like cribbing notes from each other. It's just this is the tradition that people believe in. I mean, there's different takes, you know, pagan versus Israelite, but the. The basic kind of facts are essentially the same."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5962.89,"end":5979.09,"speaker":"Fr Stephen De Young","text":"Right. And. And this is bringing us right up, I mean, right up to the period of the New Testament being written, exactly where all of this is going to sort of come to a final flower in, in terms of the Christian appropriation of it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5979.09,"end":5985.53,"speaker":"Fr Andrew Stephen Damick","text":"All right, and we will talk about that in the third half. And so right now we're going to go ahead and take our second break. We'll be right back."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":5985.93,"end":6002.09,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6006.17,"end":6008.13,"speaker":"Fr Andrew Stephen Damick","text":"Big in Heaven, a collection."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6008.13,"end":6011.25,"speaker":"Steve","text":"Of short stories available now on the Ancient Faith Bookstore."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6012.84,"end":6018.32,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6018.32,"end":6028.84,"speaker":"Steve","text":"Convicting, these stories of life in an inner city immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6029.64,"end":6030.92,"speaker":"Fr Stephen De Young","text":"They are not for the faint of."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6030.92,"end":6036.78,"speaker":"Fr Andrew Stephen Damick","text":"Heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6037.41,"end":6048.41,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or out any work in the church. The woman was a stalwart, a tovarish."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6048.41,"end":6049.73,"speaker":"Fr Andrew Stephen Damick","text":"You could count on."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6050.45,"end":6060.01,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6060.01,"end":6062.53,"speaker":"Steve","text":"Dervish Parish didn't even know her name."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6063.14,"end":6065.06,"speaker":"Fr Stephen De Young","text":"It wasn't anything they thought about."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6065.86,"end":6091.55,"speaker":"Steve","text":"To find this book and others like it, you can go to store.ancientfaith.com again that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6094.51,"end":6109.19,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half again. Just quick reminder, we do love you voice of Steve, but your own pre recorded voice does not know that this is a pre recorded episode. So we're not taking any calls. But that said, we did get this message from Nathan."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6109.19,"end":6190.72,"speaker":"Nathan Hargraves","text":"This is Nathan Hargraves calling from Baton Rouge, Louisiana. And my question is regards to the beast out of the sea and the beast out of the earth referenced in the Book of Revelation. In growing up in the Protestant world, I was commonly taught that the beast out of the sea was identified as the Antichrist and that the beast out of the earth was identified as the false prophet. However, in reading the Book of Revelation, along with studying Father Stephen DeYoung's blog and listening to this podcast, it seems to me that given what we see in our world today in the deification of American civil religion in particular and liberal democracy in general around the world, that the Beast out of the Sea is rather a world system that is Antichrist, but not necessarily a individual or a person, and that the beast out of the earth is in fact what we would call an Antichrist or the world or the devil's replacement of Christ in the form of a goat. I would be curious to hear your perspective on this, given the fact that we do see this proliferation of liberal democracy around the world and we see its ultimate bankruptcy in the liberal teachings that are proliferated with it. Thank you."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6190.96,"end":6202.53,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so a lot going on there. We are going to talk about the beasts out of the sea and out of the earth here in the third half. So this is kind of what we're doing, right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6202.53,"end":6251.62,"speaker":"Fr Stephen De Young","text":"And I think just to clarify, because especially the way political words are used and even the word politics is used in the United States today, everything's super ambiguous because everybody uses words different ways. I'm going to interpret what he's talking about with liberal democracy and liberal teachings to refer to sort of the whole liberal tradition like John Locke, right Like, and on, like the, the modern political idea of liberal democracy. Not like liberals, the way they're talked about in American politics. Right, right, right. So from that, from that perspective, pretty much all of America, just about all of American politics beyond the fringes, is somewhere in the liberal democracy category."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6251.62,"end":6252.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6252.1,"end":6254.34,"speaker":"Fr Stephen De Young","text":"And Western Europe and. Right, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6254.34,"end":6257.34,"speaker":"Fr Andrew Stephen Damick","text":"We don't have hereditary absolute monarchy. We have."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6257.58,"end":6260.54,"speaker":"Fr Stephen De Young","text":"Right. For example. Right, yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6261.1,"end":6269.54,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So to understand the beats out of the sea and the earth, we have to go back to Daniel first. Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6269.54,"end":6304.73,"speaker":"Fr Stephen De Young","text":"That's. I mean, that's really the topic of this whole episode is the beast out of the land of the sea. So of course we're going to talk about it at the very end of the episode, as is our want. Yes, but so, right, so we need to pick up the first place where beasts like this appear is in Daniel chapter seven. We've talked about Daniel chapter seven a couple of times before, but in those couple of times we've talked about it, we focused on mainly verses 9 through 14, which is the enthronement of the Son of Man with the Ancient of days. Yeah, we've talked a lot about that. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6304.73,"end":6308.09,"speaker":"Fr Andrew Stephen Damick","text":"On our, on our ascension episode particularly, we focused on that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6308.65,"end":6389.55,"speaker":"Fr Stephen De Young","text":"Right. And. And this is the rest of that chapter. Right. So verses 1 through 8 and verses 15 through 28, which deal with some beasts. Right. So this is what's before the enthronement of the Son of Man and then afterwards the interpretation of that vision with which culminates with that enthronement. So what we get in Daniel 7, 1, 8 is this vision that Daniel has of these four beasts, all of whom come up out of the sea. So if, if everybody is paying attention in the first two halves, before we come to our third half, they know that as soon as you hear beast from the sea, you should be thinking Leviathan. Right, right, right. And so, but we have this succession. The four don't come out all at once. Right. They come out one at a time. And so each of these is going to be connected in some way to Leviathan. So the first one of these. Well, and we'll go ahead and say, as we already saw Leviathan as a motivating spirit, sort of lies behind these national enemies, these armies, etc, that are opposed to Yahweh, the God of Israel, and, and the people of Israel."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6389.55,"end":6390.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6390.19,"end":6405.71,"speaker":"Fr Stephen De Young","text":"And so that's very much a tandem here. So these are sort of monsters that are, that are emerging as sort of instantiations of Leviathan."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6406.19,"end":6406.71,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6406.71,"end":6431.01,"speaker":"Fr Stephen De Young","text":"Particular, particular instantiations of Leviathan. There's a connection here. I don't want to go down this rabbit trail, but just let people know I'm aware of it. Just because we don't want this episode to be five hours long. I know there's a connection here to Typhon and Gaia and the Titans, but we're not going to go down that road right now. Maybe at a later point. Yeah, so I'm interested already."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6431.01,"end":6435.21,"speaker":"Fr Andrew Stephen Damick","text":"I don't. I don't know what that is, but yeah, yeah. Sorry, everybody. Another time."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6437.3,"end":6442.18,"speaker":"Fr Stephen De Young","text":"So the first one that emerges is this lion with wings."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6442.58,"end":6443.94,"speaker":"Fr Andrew Stephen Damick","text":"Okay. A chair and."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6444.74,"end":6461.13,"speaker":"Fr Stephen De Young","text":"Right. A cherub. And. And this may particularly. Right. If you're familiar with Babylonian sort of iconography etc, and Assyrian too, for that matter. But Babylonian, you've seen those things that look kind of like a sphinx."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6461.52,"end":6461.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6461.64,"end":6465.6,"speaker":"Fr Stephen De Young","text":"It's got a lion body and wings and then it's got like a human head."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6465.6,"end":6476.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. With usually like some kind of a crown, a kind of more vertical sort of crown than the Egyptian version, which has the sort of pharaonic headdress on it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6477.04,"end":6528.53,"speaker":"Fr Stephen De Young","text":"Right. And it's usually got the sort of. Instead of the sort of tacked on pharaoh beard, which was a fake beard, it's got sort of the big curly ringlet. Right, exactly. Right. The Babylonian. Right. And so when we read about a winged lion that's given the mind of a man, Right. We can pretty clearly see this is referring to Babylon and the Babylonian empire under whose dominion Daniel was living in exile. Right? Right. So this first sort of instantiation of Leviathan is the Babylonian Empire. Then the next beast that comes out of the sea is this bear that's sort of listing or limping to one side, who has three ribs in his mouth. And this is. This is a depiction that's referencing the Persian empire."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6529.41,"end":6532.45,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Why is it limping? What's that all about?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6533.33,"end":6536.37,"speaker":"Fr Stephen De Young","text":"Well, because it's technically the Medio Persian empire."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6536.61,"end":6537.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6537.17,"end":6539.52,"speaker":"Fr Stephen De Young","text":"And the Medes were sort of the junior partner."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6539.91,"end":6542.23,"speaker":"Fr Andrew Stephen Damick","text":"No. Okay, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6542.63,"end":6545.11,"speaker":"Fr Stephen De Young","text":"And you got the ribs, the meats are getting thrown a bone."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6545.83,"end":6548.55,"speaker":"Fr Andrew Stephen Damick","text":"You're willing to make that dad joke, but not the serpent?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6548.55,"end":6567.91,"speaker":"Fr Stephen De Young","text":"Yes, I'm willing to do that. I draw the line somewhere. Maybe not where anyone else would, but somewhere. And then the third beast that emerges is described as a leopard who has four wings and four heads."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6569.74,"end":6570.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6570.1,"end":6615.29,"speaker":"Fr Stephen De Young","text":"And the leopard is a reference to Alexander the Great. So Greece and then. Right. And then after Alexander's death, you end up with the four kingdoms, the Diadochi. The successors form the four sort of states when they carve up what was his empire. And then finally the fourth beast emerges. This beast is described as being like any animal. It's just sort of terrible and horrible and has iron teeth and 10 horns, and there's three more horns. And then those horns get cut off. There's a little horn, and a little horn is talking trash, which that's just."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6615.77,"end":6626.13,"speaker":"Fr Andrew Stephen Damick","text":"That's just eerie and weird, you know? Yeah, yeah, yeah. I mean, not that it's all not weird, but, you know, I'm saying, like, this little. Little horn, I think it's described as having a face of a man. Right. Or something like that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6626.61,"end":6630.77,"speaker":"Fr Stephen De Young","text":"Yeah, well, and it's so it. Yeah, the horn does. Yeah. The horn has eyes in a mouth."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6631.41,"end":6631.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6632.29,"end":6693.61,"speaker":"Fr Stephen De Young","text":"And so the little horn. The horns are kings. The little horn is. Is sort of one of this one king in particular who is particularly blasphemous and evil. Now, you may be wondering, am I just pulling a Jack Van Impe here and saying, well, this represents this, this represents that. So this is really secure that this is what it's talking about. This is in parallel to the other vision Daniel has where he sees the statue made of the different metals that points to the same four empires with bronze and iron. There's even some of the same imagery. And this is so obvious and so clear that this vision is why a whole host of modern secular scholars don't believe Daniel could have been written during Daniel's lifetime. Because, of course, they don't believe in actual prophecy. And so there's no way he could have been this spot on."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6693.61,"end":6701.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's so. It's sort of so on the nose that. That. Yeah, it's not vague enough for. For quote, unquote, real prophecy."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6701.73,"end":6702.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6702.09,"end":6702.53,"speaker":"Fr Andrew Stephen Damick","text":"For that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6702.53,"end":6736.11,"speaker":"Fr Stephen De Young","text":"For them to buy it. Right. And so, yeah, so that's how secure this is. Like, that's how clear it is that that's what this is talking about. And so the enthronement of the Son of Man, then, that we've talked about before, that part of the vision in 9 through 14 accompanies, you know, this final beast with the horn talking trash, gets defeated and killed. And we're told that the Dominion is taken away from the beasts and given to the Son of Man. But they continue to live for a long time. They're sort of still around."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6736.83,"end":6740.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. An interesting useful point."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6740.99,"end":6782.77,"speaker":"Fr Stephen De Young","text":"Right. And the mark of this horn is it sort of makes war against the holy ones, and that's usually translated as saints here, which is a valid translation of holy ones. But usually when we associate with The New Testament. Right. And could give the wrong idea. Right. We think the saints. Oh, it's talking about persecuting Christians. Well, this is the Book of Daniel. So this is primarily talking about that there is this. This. What they're seeing is this persecution by empires. The Babylonian empire persecuting Daniel and his friends."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6783.29,"end":6783.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6783.41,"end":6801.93,"speaker":"Fr Stephen De Young","text":"That we see throughout the Book of Daniel, and then the Persians also in the Book of Daniel, and then the Greeks that we see in first and Second Maccabees and then the Romans. Right. So that's this sort of visible material part is this persecution, but what lies behind that is the spiritual warfare."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6801.93,"end":6822.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this. This concept of, you know, on. In heaven as on earth. You know, put it the other way, you know, on earth as in heaven, that there is a war going on on all levels of the creation, both the material visible and the invisible heavenly reality at the same time."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6823.46,"end":6856.43,"speaker":"Fr Stephen De Young","text":"Right, right. And sort of at the culmination of the interpretation, talking about the Son of Man. Just to add to this, in verse 27, it says that his kingdom shall be an everlasting kingdom, and all dominions shall serve and obey him. Dominions being sort of beings that's that rank of angels. Right, right. Who have authority over the nations. So, yeah, the dominions, the spirits behind these powers ultimately are going to have to submit to Christ as well at the end of the long time."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6856.59,"end":6869.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, this is. This is the exact theme that the Lord is referencing. Right before the Ascension, you know, all authority on heaven and earth has been given to me. Go therefore, and, you know, make disciples of all nations."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6869.95,"end":6873.47,"speaker":"Fr Stephen De Young","text":"Right. Rome didn't suddenly disappear and stop persecuting Christians."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6873.95,"end":6922.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. There's, you know, Christ is ruling in the midst of his enemies. I had someone really actually asked me recently. They're like, how can you say that Christ has defeated the demons when you know, things are as bad as they are right now? And it's like, well, if you understand what the pagan world was like and then how the whole world changed with the coming of Christ, then you begin to see that what we're looking at is no longer demons in charge. Rather, this is demons on the run, and they're looting and burning as they go. They don't run things anymore the way that they once did, but they're still causing a lot of trouble as they're being routed."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6923.51,"end":6930.71,"speaker":"Fr Stephen De Young","text":"Right, right. So all that set up now. We can finally get to Revelation 13."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6930.95,"end":6931.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6933.27,"end":6960.08,"speaker":"Fr Stephen De Young","text":"And these two beasts. And these two beasts emerge in Revelation 13. And both of them are said to have the power of that, we've already seen the dragon in chapter 12, right. The devil. And these two beasts who emerge in chapter 13 have the power of the dragon. And if we're talking about the power of the devil, according to St. Paul's Epistle to the Hebrews, that's death."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6960.8,"end":6961.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":6963.04,"end":7015.82,"speaker":"Fr Stephen De Young","text":"Violence, death. Right. We see this again, this chaos idea. It was to be one beast emerges from the sea and one from the earth, from the arts, from the underworld. Right. And so it's very clear now that we've read these things, if you read the Second Temple, early Christian literature leading up to this, this is Leviathan from the sea and Behemoth. Right. This is not now a representative of them, but this is them. Right. And so they're sort of the paradigmatic beasts. Right. These are the forces that animate, right. The various instantiations, the various aspects that we see in the material world. This is now exposing, remember, that's what's being revealed. Apocalypse, revelation. This is what's being revealed."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7016.7,"end":7020.62,"speaker":"Fr Andrew Stephen Damick","text":"The demons behind the curtain, so to speak, are now stepping out."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7021.42,"end":7044,"speaker":"Fr Stephen De Young","text":"Right? We're going to reveal what's behind these things you're seeing and experiencing in the material world, the spiritual reality behind it. So this is important because just like there's a tendency to play pin the tail on the Antichrist."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7046.96,"end":7053.04,"speaker":"Fr Andrew Stephen Damick","text":"Someone out there is creating a game right now called Pentatonic Antichrist. It's going to be sending it to us."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7053.04,"end":7094.52,"speaker":"Fr Stephen De Young","text":"Yes, yes. And they'll have photos of various figures in world history. Napoleon, Hitler, Juan Carlos, King of Spain, you know, pick. Pick one. So that. That when we see these beasts depict. We just saw the beast in Daniel were referring to these. Right. Specific empires. Right. That emerged in sequence. Right. He was kind of giving us Daniel. This is one of several places where the Book of Daniel and its visions gives us the timeline of when the Messiah is going to be born. And people had figured that out in the first century. That's why there were so many people showing up in the first century claiming to be the Messiah, not just the actual Messiah, but fake ones."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7094.52,"end":7097.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because. Because Rome was on the scene, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7097.8,"end":7117.9,"speaker":"Fr Stephen De Young","text":"And. And they were reading the Book of Daniel and going, oh, yeah, now's the time when this is supposed to happen. Right. So people managed to, being a little narcissistic, managed to convince themselves they were it. So there's been a tendency then to apply that same kind of reading to what we get in Revelation 13."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7120.14,"end":7120.46,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7120.46,"end":7130.78,"speaker":"Fr Stephen De Young","text":"Treat this not as being the revelation of the power behind all of it throughout history, but to view it as being a particular one."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7131.1,"end":7134.46,"speaker":"Fr Andrew Stephen Damick","text":"I see, I see. So, you know, the story continues, you know."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7135.02,"end":7159.72,"speaker":"Fr Stephen De Young","text":"Right. And so amongst our Protestant friends, for example, you will have people who are preterists who want to say that all of this prophecy has already been fulfilled, or at least most of it. And they will say, well, okay, these beasts are talking about the Roman Empire. It's a specific empire. It's the Roman Empire that's in the past."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7159.88,"end":7160.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7161.72,"end":7183.37,"speaker":"Fr Stephen De Young","text":"Then conversely, amongst our Protestant friends, particularly among people who are of a pre. Millennial bent, but even some who are of an amillennial or other bent, in terms of how they see the end times, they will see this as this is talking about some particular future kind of empire or oppressor."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7183.85,"end":7208.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I remember system. I remember. I remember when, you know, in. In the 1980s growing up in churches that were very much of that kind, often it was taken from. Just from the future to, you know, now. So in other words. So this is about, you know, the big one at the time was the Soviet Union. This is about the Soviet Union, which means that the end of the world is coming, like, any day now, you know."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7208.98,"end":7214.5,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah, yeah, yeah. This is. So this is some future thing. And now here it is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7214.5,"end":7215.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7215.38,"end":7216.22,"speaker":"Fr Stephen De Young","text":"On the Antichrist."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7216.22,"end":7269.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. Yeah, I think, you know, and. And, you know, America in particular has this millenarianism in its, you know, in its soup and it's. In its religious soup. You know, people have been looking for the end of the world over and over again. And I think this is one of the things that. Why a lot of people get super, super anxious about when they see bad things happening in the world is they're like, this is the end. This is the. The precursor to that, you know, or this is. This is. It's has arrived. You know, like, there's this. There's this sense of often, I think, not really realizing what's actually going on in these scriptural passages. You know, like, you know, the answer to the question, are we living in the end times? Is yes. And we've been living in the end times for 2000 years at least. You know, these. This is still. These last days. Are, you know, are these the last, last, last, last days? I don't know about that. We don't know."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7269.84,"end":7275.96,"speaker":"Fr Stephen De Young","text":"Yeah, right. We don't know. Right. We don't know. And this goes back further. It's not just the U.S. this is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7275.96,"end":7276.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7277.04,"end":7279.84,"speaker":"Fr Stephen De Young","text":"This starts around 1000 A.D. yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7279.92,"end":7280.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7280.28,"end":7290.56,"speaker":"Fr Stephen De Young","text":"Because there were people looking at Revelation 20 and saying, oh, well, this period where Christ reigns in the midst of his enemies, is going to last a thousand years. Well, we must be about on it. Right? It's a thousand ad. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7291.2,"end":7305.51,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, and that's, that's not to make light of evil things happening in the world, but just to say that the sort of prophetic narrative that sometimes is pushed is, Is a bit of a stretch, you know, in terms of what the scripture actually is saying."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7306.39,"end":7320.75,"speaker":"Fr Stephen De Young","text":"Right. And so there's, there's, there was medieval apocalypticism surrounding the Crusades. You see it at the Reformation. Oh, yeah, tons of it. You see it with Jonathan Edwards, you see it with Sir Isaac Newton. You see it with. I mean, all, all the."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7320.75,"end":7321.91,"speaker":"Fr Andrew Stephen Damick","text":"This is World War I."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7321.91,"end":7352.56,"speaker":"Fr Stephen De Young","text":"This is just a thing. Yeah, yeah. Napoleon. Yeah, yeah. So, and what we're going to see, though, as now we get into the, into the text, is that again, this is talking about the animating spirits themselves. These are the paradigmatic beasts that lie behind not one of those, but all of those. Right. So in one way, I'm not saying all those people were wrong. In one way, I'm saying they were all right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7352.85,"end":7354.85,"speaker":"Fr Andrew Stephen Damick","text":"Just not in the way they think. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7354.85,"end":7465.39,"speaker":"Fr Stephen De Young","text":"Just not in the way they think that. That, that there is this force behind all of that. And so when they look at something in their world happening and they point to that and say, see a connection to these beasts in Revelation. There is a connection, yes. Right. But. But it's not that. That's taught. Making a prediction. And now that prediction is happening in front of you. Right, right. That's the extra step. So we see that right away when we get into the beast from the sea and the way he's described in Revelation 13, because we're told he has seven heads. That's Leviathan. Right. Leviathan is the seven headed serpent and he's coming out of the sea. And that there are 10 horns. Right. On each head, those 10 horns. Remember the fourth beast in Daniel, and Daniel had the 10 horns. And then when you look at the description of him, he's got leopard parts and bear parts and lion parts. Right. And this isn't saying he's man, bear, pig. This is. He's a combination of all four beasts in Daniel. Right, right. And Leviathan. Right. And there are, on the heads, there are these blasphemous names that titles. This is a reference to a phenomenon that happened in the Roman Empire, but not just in the Roman Empire. This happened in pretty much all of the empires from Daniel. And going forward, where the individual emperor, the ruler, would take to himself These titles. So you look at the Seljukid monarchs who ruled over the area that included Palestine, included Judea. You have Antiochus Soter, the Savior."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7465.47,"end":7465.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7465.87,"end":7470.03,"speaker":"Fr Stephen De Young","text":"You have Antiochus iv, Epiphanes, the manifestation of a God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7470.27,"end":7473.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or, or, I mean, Augustus called himself Savior of the world."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7474.19,"end":7520.78,"speaker":"Fr Stephen De Young","text":"Right. Savior of the world, Son of God. Yeah, right. The Lord. Right. These are all titles that the, these, these emperors took. Right. And we're going to talk more about that in a little bit. But so we see, this is, this is bundling all of this together. This isn't talking about one in particular, but bundling it all together. And it's even refers to the fact that. That what it. This represents, this spirit, this force is. Is being worshiped over against not just God himself, but against. It's set up against the. The divine council, the kingdom and the dominion of God on earth."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7520.86,"end":7545.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, in Revelation 13, it says, you know, this beast, it opened its mouth to utter blasphemies against God, blaspheming his name. And his dwelling, that is, those who dwell in heaven also is allowed to make war on the saints and to conquer them. So there's this, you know, a kingdom against the kingdom of God and all the holy ones who are dwelling within it."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7547.03,"end":7557.35,"speaker":"Fr Stephen De Young","text":"Right. And notice also, though, that language, it was allowed, even as terrible as this is, it's on a leash. Leviathan's still on a leash."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7558.31,"end":7558.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7560.47,"end":7584.88,"speaker":"Fr Stephen De Young","text":"And this idea of this kind of animating spirit that starts all the way back with Cain building that first city and goes to the Tower of Babel and goes through all of these human empires. Right. This is, this is sort of the core insight of what St. Augustine picks up on in City of God when he talks about the City of God over against. Right. The City of Man."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7584.96,"end":7586.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7586.64,"end":7635.03,"speaker":"Fr Stephen De Young","text":"The City of Man starts with Cain building that city. And it's worth noting that St. Augustine saw even the Christian Roman Empire that was collapsing in the west around him as part of the City of Man. That, that this is a. This separate thing. Right. So then that brings us to the Beast from the Earth. So then we have this second beast, the Beast from the Earth, in Revelation, chapter 13. And it's described as having horns like a lamb, but speaking like, like the dragon. Right. So this is, this is, as our caller pointed out, this is, you know, an antichrist depiction."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7635.11,"end":7635.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7635.47,"end":7636.95,"speaker":"Fr Stephen De Young","text":"It looks, it looks like a lamb."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7637.11,"end":7640.55,"speaker":"Fr Andrew Stephen Damick","text":"The Messiah, but looks like the Messiah, like the devil."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7641.35,"end":7667.17,"speaker":"Fr Stephen De Young","text":"Right. So, but it's speaking the Devil's words, not Gods. Right. Right. Remember St. John wrote Revelation. Remember what St. John says over and over again in his Gospel? Right. Christ says, I speak the words of my Father who is in heaven. I do the works of my Father who is in heaven. Right. So this guy may look like a lamb, but he's speaking the words and doing the deeds of his Father, who is the devil in this case."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7667.17,"end":7667.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7669.17,"end":7686.71,"speaker":"Fr Stephen De Young","text":"This figure. And what he does is he gets people to worship the beast from the sea. And through the beast from the sea, the dragon. Right. The devil ultimately. Right. Himself. So this is a. A religious leader and a religious system."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7688.31,"end":7688.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7688.67,"end":7697.15,"speaker":"Fr Stephen De Young","text":"That is then tied to and a function of this sort of world system that is animated by the first beast."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7697.15,"end":7706.86,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, it's essentially a kind of state religion. Right. It's state Satanism, so to speak."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7707.02,"end":7710.86,"speaker":"Fr Stephen De Young","text":"Right. A civil religion which does not appear to be Satanism."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7711.18,"end":7713.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It appears to be something else."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7714.38,"end":7716.02,"speaker":"Fr Stephen De Young","text":"Yes, it appears to be something else."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7716.02,"end":7716.86,"speaker":"Fr Andrew Stephen Damick","text":"Looks like a lamb."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7717.58,"end":7758.27,"speaker":"Fr Stephen De Young","text":"Yeah. And so. Right. So these are these two beasts, Behemoth and Leviathan, and how these two spirits are functioning, how they're revealed to be functioning behind the scenes, not just in St. John's Day, he's making clear, but before that and after that, until the end. And then in Revelation 19, verses 17 through 21, St. John describes what happens to these beasts right at the end, and spoiler alert, it's going to be a beast feast."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7759.63,"end":7760.67,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7761.15,"end":7761.51,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7761.51,"end":7821.35,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so here's what it. Here's Revelation 19, 17, 21. Then I saw an angel standing in the sun. And with a loud voice he called to all the birds that fly directly overhead, come gather for the great supper of God to eat the flesh of kings, the flesh of captains, the flesh of mighty men, the flesh of horses and their riders, and the flesh of all men, both free and slave, both small and great. And I saw the beast and the kings of the earth with their armies gathered to make war against him who was sitting on the horse and against his army. And the beast was captured, and with it the false prophet, who in its presence had done the signs by which he deceived those who had received the mark of the beast and those who worshiped its image. These two were thrown alive into the lake of fire that burns with sulphur. And the rest were slain by the sword that came from the mouth of him who was sitting on the horse. And. And all the birds were gorged with their flesh. So, I mean, this is the same scene right out of Ezekiel, chapter 39. Right, right. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7822.31,"end":7847.07,"speaker":"Fr Stephen De Young","text":"And so those forces of chaos and evil and destruction are. Are turned into nourishment for the creation. And so it's not just order defeats chaos, it's God brings order out of chaos, good out of evil, life action out of death. Right. In this. In this imagery."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7847.71,"end":7848.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7848.99,"end":7893.27,"speaker":"Fr Stephen De Young","text":"And so to narrow our focus down a little. Right. Because we talked about this being. Right. There's clearly symbolism about Rome here. Right. So this is clearly the spirit. The beast from the sea is clearly the spirit animating Rome. The beast of the earth is clearly animating Roman religion. Right. Because people literally worshiped Rome and worshiped the emperor. Right. But there's also this. This particular Antichrist element. Right. And just like there is a particular reference in St. John's Day for. For empire, there's a particular reference in St. John's Day for who the emperor is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7893.42,"end":7894.42,"speaker":"Fr Andrew Stephen Damick","text":"Is. Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7894.42,"end":7901.34,"speaker":"Fr Stephen De Young","text":"Who was also the Pontifex Maximus, who was also the high priest of the Roman religion."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7901.42,"end":7903.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. And that was Nero."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7904.38,"end":7905.1,"speaker":"Fr Stephen De Young","text":"That's Nero."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7905.18,"end":7905.74,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7905.74,"end":7948.8,"speaker":"Fr Stephen De Young","text":"Yes. So just like we talked about with the empires, Right. The same thing applies to the Antichrist. Right. In fact, if you go to First John, again written by the same authority, St. John says, you have heard that an Antichrist will come, and already antichrists, plural, have arisen. Yeah, Right. So he's not denying that there will be one final Antichrist. Right. Just like there will be one final empire because Christ is going to return and there will be one, presumably, at that point, and that'll be the last one. But. But that doesn't mean that it's just this figure in the future."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7948.96,"end":7990.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. This is a really important point. A lot of times when we're, you know, playing pin the tail on the Antichrist, we ignore the fact that it's plural, that there's been a bunch. And then, you know, we can become. Even if you recognize that, then you might become obsessed. Well, like, okay, is this the final one? And the truth is it's, you know, sort of Antichrists and empires all the way down. This force keeps animating things all the way down. It's. It's. It's always with us. Right. It's always going to be the context in which the people of God are called to be faithful."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":7992.01,"end":8025.65,"speaker":"Fr Stephen De Young","text":"Right, right. And so, again, you know, somebody wants to say, you know, Napoleon was an Antichrist. Okay, sure, right. Hitler. Hitler. Stalin. Sure. Yeah. Lenin. Yeah. Okay, right. You know, Mao. Yeah. You know, it's not just a question of finding this one. Right. This is. This is. We're having a type revealed to us, Us and Nero is sort of emblematic of this."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8025.81,"end":8026.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8026.49,"end":8062.33,"speaker":"Fr Stephen De Young","text":"For St. John's Day. He's the one who's sort of in front of St. John. And the particular element that sort of. There are a few elements that cement this. Two main ones and then a, a, a secondary one. The first main one is this imagery of the beast having this wound that was healed, this mortal wound that was healed. And this is a connection to what's come down to us as named the Nero Reda vivis myth, which just means Nero come back to life."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8062.33,"end":8063.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Alive again."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8063.21,"end":8094.34,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So Nero, of course, committed suicide back in the, I believe, 68 AD. 68. And I won't get into all the current scholarly arguments about the fire and everything, but anyway, Nero died by suicide, but almost immediately there were rumors and this kind of thing that he wasn't really dead."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8094.82,"end":8095.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8096.1,"end":8141.2,"speaker":"Fr Stephen De Young","text":"That he had faked the suicide or he was injured but not really dead and he'd gone off to Asia Minor. Not coincidentally, this is where St. John is writing to. The seven churches he addresses Revelation to are all in Asia Minor, in the place where folks thought Nero might be hiding out to come back. So according to St. Irenaeus of Leon, who I have no reason as a church father to doubt on this, since he was the spiritual grandson of St. John, St. John's revelation, he had his vision circa A.D. 95, second year of Domitian."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8142.64,"end":8143.04,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8144.8,"end":8158.12,"speaker":"Fr Stephen De Young","text":"We have evidence from before that of the existence of this belief. And one of the primary places we have that is in Dio Chrysostom. No relation to St. John."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8158.12,"end":8161.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That's not a last name, it just means golden mouth. So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8161.97,"end":8211.84,"speaker":"Fr Stephen De Young","text":"Right, good speaker, a title for somebody who is good with rhetoric. But Dio Chrysostom, who's a Roman pagan, his discourse 21 on beauty, that was written circa AD 88, so seven years before St. John had his vision. He talks about there, about this hope that Nero would return and sort of return the empire to its glory days. We have in The Sibylline Oracles 4 and 5 Tacitus Histories 2, 8 and Suetonius 57, they all talk about in later Roman history, pseudo Neros who. People who show up in Rome or other major Roman cities claiming to be Nero."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8212.08,"end":8213.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8213.28,"end":8225.94,"speaker":"Fr Stephen De Young","text":"Back from the dead to try to get a throne or get a following or start a revolution. Right. So this was ingrained enough in people that you could try to pull that."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8226.02,"end":8226.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8228.42,"end":8263.71,"speaker":"Fr Stephen De Young","text":"This, this sort of story was firmly embedded and this lasts all the way up to St. Augustine in the City of God. That we mentioned earlier in 2019, 3. So this is the fifth century in North Africa, the Western Roman Empire, the Christian Roman Empire as the Western part is collapsing. Right. He tells us that at that time there were pagans who were going around holding out hope and saying that Nero would return and save the Western Empire."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8263.95,"end":8264.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8264.51,"end":8311.05,"speaker":"Fr Stephen De Young","text":"And there were Christians who also believed it. There were Christians who said, Nero is going to come back and he's going to be the antichrist. He's going to be the final antichrist. So they were doing that even in the fifth century. Right. So that's how embedded this was. Right. Nero as sort of this prototypical antichrist figure. Right. And Nero. The relationship between Nero and this figure in Revelation 13 is just embedded in Roman Christianity. Not just here, but again, Nero is the type of this. Not. It's not saying, oh, Nero was it. So don't worry about that whole Antichrist thing anymore."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8311.05,"end":8312.73,"speaker":"Fr Andrew Stephen Damick","text":"He's not the one and only. He's."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8312.73,"end":8365.59,"speaker":"Fr Stephen De Young","text":"Yeah, sorry, preteris. So there's also. So this is this kind of secondary argument. I don't want to go down this rabbit hole. I think it's kind of a weak argument, frankly. But in Revelation 17:10, 11, there's these seven kings, and people try to link them up to seven Roman emperor, the first seven Roman emperors. And there's some shenanigans there. I, I don't think we need to try and do that. But more importantly, we get the mark of the beast's name at the end of the chapter 13, which is either the 666 that everybody's familiar with, or in the oldest manuscripts we have of Revelation 6:1:6. And that's not a contradiction or a problem because if you do what's called Gematria."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8366.23,"end":8368.31,"speaker":"Fr Andrew Stephen Damick","text":"What's Gematria? Father Stephen?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8369.83,"end":8390.31,"speaker":"Fr Stephen De Young","text":"I know that. I'll explain this to Father Andrew. Thank you. I know most of our listeners engage in Gematria on an almost daily basis. Gematria was a way of, Of. Well, in Hebrew, they didn't have numerals. Right. Or Greek for that matter."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8390.87,"end":8392.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they just use letters. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8392.91,"end":8419.5,"speaker":"Fr Stephen De Young","text":"They. They just use letters. And so that lends itself to a system in which you can kind of swap out letters for numbers and then add them up and do things, both to put things in code or to do esoteric stuff with, like the text of the Bible, sort of quasi numerological, magical stuff."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8419.5,"end":8419.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8419.9,"end":8452.6,"speaker":"Fr Stephen De Young","text":"But also just kind of simple encoding and stuff. But so the language in Revelation 13 surrounding this number, that it's the numbers, the name of A man. Right. I mean, St. John is very deliberately going, let the reader understand. Right. Like, you know. You know what I'm saying? Right, Right. So. So in order to do gematria with a name or a word or a sentence in a language other than Hebrew, you have to transliterate it into Hebrew."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8454.61,"end":8454.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8454.81,"end":8502.74,"speaker":"Fr Stephen De Young","text":"Because it's all about Hebrew letters and numbers. Right. And so if you take Nero's title in Greek, Nero and Kaysar. Right. And of course, since we're doing Hebrew, you just have the consonants, and you add that up, you get 666. If you take his title in Latin and translate it into. Or transliterate it into Hebrew, you get Nero, kaisar, which adds up to 616. So they're both encoding the same thing using the same methods. It's just which source language they're going into Hebrew from."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8502.74,"end":8503.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8503.02,"end":8503.9,"speaker":"Fr Stephen De Young","text":"So this is."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8503.9,"end":8511.99,"speaker":"Fr Andrew Stephen Damick","text":"This is St. John saying, you know, the emblematic person I'm talking about is Nero. That's right. Yes. Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8511.99,"end":8527.75,"speaker":"Fr Stephen De Young","text":"But again, this is emblematic. Right, Right. So, yes, I know Ronald Wilson Reagan. There are six letters in each name, but he was not the Antichrist. I'm gonna go out on a limb here. At least not the final one."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8528.23,"end":8528.87,"speaker":"Fr Andrew Stephen Damick","text":"You're right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8529.19,"end":8536.62,"speaker":"Fr Stephen De Young","text":"There's some people in South America who might think he was one of them, but he was not. Right. That's not what this is going for."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8538.22,"end":8539.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8540.14,"end":8569.44,"speaker":"Fr Stephen De Young","text":"So where. Where does this bring us? Well, okay, we're talking about these. These spiritual forces, Behemoth and Leviathan. And the way they express themselves in our world is by being the spirits that lie behind empire. Right. That lie behind this. This whole concept of empire. And there's a fundamental difference between the idea of a tribe or a nation or a people or a cultural group and an empire."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8569.6,"end":8591.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah. One. You know, the first is an actual shared life based, you know, in the earliest stages on families. Right. But empire is about taking your values, ideology, way of life on the road and making other people follow it, you know."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8592.67,"end":8594.27,"speaker":"Fr Stephen De Young","text":"Right. Through violence and death."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8594.27,"end":8595.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8595.23,"end":8596.35,"speaker":"Fr Stephen De Young","text":"The power of the dragon."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8596.51,"end":8616.6,"speaker":"Fr Andrew Stephen Damick","text":"Totalitarian. It's expansive, it's aggressive, it's conquering, you know, which is the opposite of the gospel, which is. Which is a universal way of life, but it's. But it's spread not through, you know, force, but. But through persuasion, through and through martyrdom, frankly."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8617.16,"end":8622.68,"speaker":"Fr Stephen De Young","text":"Right. And it takes these different forms as the gospel comes to different tribes and nations and peoples."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8622.84,"end":8623.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8623.24,"end":8628.84,"speaker":"Fr Stephen De Young","text":"It doesn't come and dominate them and seek to eradicate them as entities."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8628.92,"end":8630.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8632.04,"end":8695.94,"speaker":"Fr Stephen De Young","text":"And so this also always. I mean, in the ancient world, there was no real separation, but there's always a religious dimension to empire. Right. There is always a sort of imperial religion. Even in an empire like the Soviet Empire that ostensibly was atheistic. Right. There was functionally civil religion that you look at the Arab conquests, and immediately after the Arab conquest, you find Islam rising up. Right. There is always the Persian Empire. It was the official Zoroastrian religion. And again, all of these are enforced. Right. And often the state itself, the empire itself, the emperor himself is worshiped as a God. Right. As part of this, both Caesar was, Was a God and animated by a divine force. And there was the God Roma."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8696.1,"end":8696.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8696.54,"end":8727.49,"speaker":"Fr Stephen De Young","text":"Roma patria was. Was worshiped. And so we could see how that language about the. The beast from the sea, right. That there is this kingdom of God and administration of God over the world. And, and instead one chooses, and one therefore worships and serves this imperial administration, which is not simply an imperial, a human administration, but is animated by these hostile spiritual forces of chaos and evil."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8727.57,"end":8754.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it sets itself up as in competition with the Gospel because it also is a totalizing, totalitarian force. But it's force, Right. What God sets up, again, is not about smashing people into worshiping him, you know, it's, it's, it's. It's given in humility. And again, with martyrdom."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8755.15,"end":8766.43,"speaker":"Fr Stephen De Young","text":"Right. And. And a major part of what happens in as. As the religious function of empire is the creation of founding myths. The rewriting of history."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8766.83,"end":8767.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8767.63,"end":8849.74,"speaker":"Fr Stephen De Young","text":"The rewriting of the story of the world, the rewriting of the story of culture. And sort of a preeminent example of this is the beginning of the Roman Empire under Augustus. Right. So Augustus becomes the first Roman Empire, Octavian becomes Augustus, and he has Virgil write the new history of the world which culminates in Augustus, and he has Ovid go and collect all the disparate traditions of all the tribes and nations and peoples and. And forge them together into one collective story, one sort of monoculture, one ruling culture. Right. And so the Greeks get their actual culture displaced by a Romanized version of Greek culture. You get the Egyptians, their culture replaced with a Romanized version of Egyptian culture. And of course, the Greeks and then the Romans tried to do that with Judea, and that's what triggers the Jewish revolts is their refusal, their refusal to allow their, their culture to be Hellenized and then Romanized because the base of their culture is coming from the Torah. Right. And they, they choose that instead. But the Greeks and the Romans can't Help but try to force compliance."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8850.14,"end":8850.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. And."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8850.66,"end":8853.82,"speaker":"Fr Stephen De Young","text":"And forced violence, because that's the whole ethos of empire."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8853.82,"end":8910.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. And that's why it's not just sort of competition or whatever. That's why it's Antichrist. It sets itself up as not just against Christ, but instead of Christ, it's doing a parody, so to speak, of what the Kingdom of God is actually about. Like, the Kingdom of God Christianizes cultures. It doesn't suppress them, it doesn't replace them. It Christianizes them in a way that's healing for mankind and not destructive. Right. You know, the Kingdom of God does bring all cultures together under its influence and rule and so forth, but not by force, not by conquest. On the human level, there is certainly a spiritual conquest going on. Right. But it's not about making people mandatory, you know, do the will of God."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8912.64,"end":8914,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":8915.36,"end":9284.61,"speaker":"Fr Andrew Stephen Damick","text":"Well, let's say some things to wrap up and kind of give us a way forward at the end of this episode about Leviathan, Behemoth, the beasts out of the sea and the earth. To me, the big question is, now that we've seen the way that the world on a macro level operates, what do we do as Christians or as people who maybe want to become Christians? How do we live the right way? Well, I think it's pretty clear that we don't try to beat them at their own game. We don't try to win by acting like the Antichrist. Empires and leaders. That is not the way. It's not the way. Right. And the reason why that's not the way is not just because that's bad, but because that is fundamentally telling a different story about what the world is. I mean, we saw, we heard just now about how, you know, Augustus has to rewrite the history of the world in order to justify his rule. That's the false story. That's not the real story. That's not the story that we are actually in. That is a lie being told by these demonic forces and a lie about the creation of an ultimate empire. The story that is the story of Christ is the story that, number one, begins, as we know, with the fall into rebellion of certain spiritual powers. And then they're dragging mankind into their rebellion. And so then the story of Christ is his rescue of us from that slavery, from being dominated by these dark powers and behaving like them and becoming like them. That's the story. And that the kingdom of God is coming and now is. Right. And so then what is the response to the coming of the Kingdom of God? Well, we See it right there at the Gospels. Repent, repent, for the kingdom of God is at hand. The Scripture throughout its text is always correcting the takes that paganism is offering. It's always saying, no, no, no, this is the real story. This is what's actually happening. And frankly, the, the narrative that the Scripture offers is much more coherent and takes account of everything in the world in a way that none of these other stories actually do. If you look at them close enough, you'll always see the cracks. You always see that it doesn't really work out. There's something false, there's some lie down at the bottom of them, right? The Bible is always correcting these stories and saying, no, this is the truth. And if we understand that we're in that story and we understand that the people that we should be emulating are our Lord, who doesn't come wielding a sword to strike down human beings, but he comes and offers himself to die, right? He does strike down his enemies. His enemies are the dark powers, but he dies for us. It's mankind that he's offering himself for so that we can benefit from that, so that we can be rescued from that slavery, right? When we see that we're supposed to be like the Lord, and then we look at the way the saints are like the Lord again, offering themselves again, martyrdom, humility. This is the way, this is completely different than the way that the Leviathan behemoth systems work. It's not about destruction and domination and tyranny and so forth. It's. It's about love. When we see that, then we, then we see exactly how we're supposed to live. We see how we can be faithful in the midst of this. You know, one of the themes that's really kind of intriguing in a lot of this discussion is this, this theme that we see of as we titled it Leviathan, it's what's for dinner. That chaos can serve order. That chaos can literally be served to order as food, as nourishment. And I think that's one of the things that we're called to as Christians, is even as we live in the midst of a world that is animated by these dark demonic powers, we can take what's around us and turn it to good. Man meant it for evil because he was inspired by demons to make it evil, but God turns it to good. And so we are called to participate in God's works in this world. And that's one of them, is to take what is evil and to turn it to good. And so we can take what we see around us, even the stories that we see around us, even pagan stories, right? But even the stuff that's happening around us right at this moment, we can take that and turn it to what is good, right? By interpreting it, by critiquing it, right? By seeing how sometimes in surprising, unusual ways, things that are dark and tragic can be turned to beauty and towards hope for the future and towards life and love, sacrifice, all of these things. So, yes, there is an eschatological reality in which Leviathan is going to be cut up and served to the people in the wilderness. But there's also a present reality in which we can do the same thing, in which we can take the Leviathanic, if I may say, cultures that we live in and use them for the service of Christ's gospel, for his kingdom, for the rescuing of mankind from these dark demonic forces. So I've loved having this conversation. I think it's one of the most interesting and intriguing ones we've had so far. And this, that's my takeaway, Father."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9286.45,"end":9868.23,"speaker":"Fr Stephen De Young","text":"So I'm not on social media, so I'm gonna go ahead and get myself canceled. Who knows how long it'll even take me to find out about it? Yeah, so I was gonna say today, but this has been going on for a while, but there's been another flare up of it today. There are a lot of folks, you can find them on the Internet, you can find them in all kinds of media who are very concerned that. And you know, I know we have listeners in other countries, but I'm in the United States, very concerned that the United States or the Western world, whatever we want to say that is, or the liberal democratic tradition, as we heard it expressed by our caller, that that is about to collapse into something else, something more like empire, something more like tyranny, the kind of thing we've been describing as being motivated by behemoth and Leviathan. And if you're a person who's worried about that, I have bad news for you. It happened about 50 years ago. So if, if you. We do even a casual sort of study of history and really dig into it, the British Empire was the empire it really died in World War I, but it was kind of coughing up blood a little, and still until World War II. And then after World War II, frankly, the British handed the baton to the United States of America to become the new empire. And as always happens, at the beginning of that, everything looks good. You know, the Roman Empire had an auspicious beginning. Alexander's conquest had an auspicious beginning, but since then it has taken its course. And now that's where we are. The world now is either dominated by the United States of America militarily and. Or dominated by our culture, our movies, our television, with all of the elements of our media. That's our main production. We don't build actual objects anymore. We make. We make culture and send that culture with all the sex, violence, blasphemy, and everything else that we Christians criticize about it all over the world to indoctrinate the world in consumerism and all of those. All of those good things. So it's not about sitting and worrying about whether and when we're going to be in that situation. We are in that situation. Christians have pretty much always been in that situation. The. The. Either they lived in the. The headquarters of that empire or they lived someplace where that empire was. Was a threatening presence. So the question then is, well, what do we do about it, right? Is this just hopeless? Do we just sort of brace ourselves for incoming martyrdom? Is. Is there nothing we can do except, you know, pray that our suffering is not prolonged? There's a lot more we can do than that. But to do that, we have to come back to real Christianity, what Christianity actually is. What do I mean by that? We live in a society. All societies have a. Have a base. And that base is grounded in sort of material realities then built on that reality. That base, that foundation of reality. You have a superstructure, and that superstructure is all the cultural elements that we think about. And they're supported by that base. They feed back into that base. They promote and they serve that base. And for the entirety of the modern period, I'll be blunt. The entirety of the modern period in the west, and even in a lot of orthodox countries, Christianity has not been part of the base of our society. It's been part of the superstructure. It's been serving the material realities of various empires and cultures and civilizations. I can give lots of examples, right? Christians lined up to defend king Leopold, killing 10 million people in the Congo to turn it into a rubber farm. One closer to home for folks in the United States of America. When slavery became a material necessity in order to continue the cotton and sugar harvests in the plantation system. All of a sudden, Christians found Bible verses supporting the enslavement of Africans and all of the horrible and brutal violence inflicted upon them. Christianity served what was necessary for the culture. That's not actually Christianity. That's the beast from the earth. That's Antichrist. When Christianity distorts itself and contorts itself to fit its culture, to serve its needs, to serve the ruler of that culture. That is a twisting and a perversion of Christianity, real Christianity, and I know I'm disagreeing with someone publicly on this, but real Christianity is revolutionary in the truest sense, because real Christianity has the power to transform the base. Because real Christianity has the ability to change reality by changing people. Real Christianity is the only thing on earth. The Gospel is the only thing on earth that could transform humanity. Not just an individual human doing morally better, but transform who and what we are to be more like Christ. Meaning we can change that base. This has happened once before in history. This happened with the Roman Empire. St. Paul set out to convert the Roman Emperor to Christianity. That was his goal. That's why he went to Rome. He says so a couple of times in the Book of Acts. That didn't happen during his earthly life. That happened with Constantine. When St. Constantine became a Christian, the base which supported the entire culture of the Roman Empire changed. And so there were any number of elements of Roman culture that were no longer supported by that base, and it crumbled. The Roman view of sexuality crumbled. The Roman view of men and women crumbled. The Roman pagan religion crumbled. The Roman view of humanity as being stratified as people who are more and less human crumbled. And all those elements of Roman culture which were good and positive and godly, we're all reinforced and strengthened by the transformation of that, of that base. So we have the power, through the Gospel, to change the fundamental reality of our society and our culture. But that doesn't start by us going and trying to convert the president of our country. That doesn't start there. Not that that's a bad thing to do. That doesn't start by us trying to convert other civil authorities. That starts with us converting ourselves. That starts with us discovering true Christianity again and being transformed. Not using Christianity in our own lives to shore up and defend the things that we already believe or want to be true or the way of life that we want to live, but instead being transformed by it. I'll be blunt. If you've become a Christian or you've joined the Orthodox Church and become an Orthodox Christian, and it hasn't changed how you eat, how you dress, how you act in your family, how you do your job at work, how you apportion your time, how you look at and treat and handle your finances, if any of those things are untouched, you have not converted to Christianity. You've started to. And that's good. It's good to start, right? But you haven't finished. The revolution has to start in a transformation of your own life. And when your own life is transformed, when the basic principles of your life, the things that your life is built upon, change and all the parts that don't need to be there, that are sinful and corrupt, crumble away and all of the good parts that were created and put there by God are reinforced, that will put you in the position then to go out and start changing those around you and ultimately to transform our culture, our communities, our nations, our tribes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9869.19,"end":9869.59,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9869.67,"end":9913.74,"speaker":"Fr Stephen De Young","text":"That's where it changes. That's. And that's where it starts. So bad news. We're living in an empire, too. Good news, we've seen once before that our fathers in the faith, our fellow Christians, were able to completely transform it and defeat it through Christ. And we can do the same thing if, number one, we're willing to stop worrying about whether it's an empire or not and being afraid. And number two, if we're willing to begin with ourselves and be radically transformed in a revolutionary way and then go out and with the gospel, not with force and violence, bring revolution to our society."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9914.94,"end":9938.53,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Thank you very much for listening. If you didn't get a chance to call in during a live broadcast, we'd still love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We do read everything, but we can't respond to everything we do. Save some of what you send for possible use in future episodes."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9939.57,"end":9945.49,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9945.89,"end":9958.5,"speaker":"Fr Andrew Stephen Damick","text":"If you are on Facebook, you can like our page and join our discussion group. Leave reviews and ratings everywhere. But most importantly, please share this show with a friend whom you know is going to love it and or benefit."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9958.5,"end":9969.7,"speaker":"Fr Stephen De Young","text":"From it and or just needs a cure for insomnia. That's fine too. And finally, be sure to go to ancientfaith.com stroke support and help make sure we and lots of other AFR podcasters."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9969.7,"end":9982.71,"speaker":"Fr Andrew Stephen Damick","text":"Stay on the air. And please buy my new book, Arise, O God, and also Father Stephen's book, which came out earlier this year, religion of the apostles@store.ancientfaith.com thank you. Good night. God bless you all."}
{"episode_id":"LOS - #029 - 2021-10-14 - Leviathan - It's What's for Dinner","start":9987.59,"end":10024.8,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many ancient round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
