{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":0.8,"end":65.45,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation that the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":66.97,"end":76.81,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, everyone. Yes, that little voice that you heard over the voiceover was in fact Father Stephen talking over the voice of my mic was on. Your mic was on."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":77.37,"end":79.37,"speaker":"Fr Stephen De Young","text":"Oh, I was just. I was answering a question."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":79.69,"end":85.17,"speaker":"Fr Andrew Stephen Damick","text":"Oh, not a question from a listener. I'm sure it was just your plumber or whatever, but."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":85.17,"end":88.56,"speaker":"Fr Stephen De Young","text":"Well, they might be listening now. I don't know. It's possible. True."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":89.28,"end":136.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Hey, everybody, you're listening to Lord of Spirits podcast. My co host, whom you just heard, The Very Reverend Dr. Stephen DeYoung is with me from Lafayette, Louisiana, and I am in Emmaus, Pennsylvania, and we are live. And if you are listening to us live, you can call us at 855-237-2346 and you can talk to us. And we're going to get your calls in the second half of the show. And our very own beloved Matish Katrudi will be taking the those calls. So we stood up a lot of thoughts last time and probably one or two feelings with our episode introducing the Torah and especially talking about how it's situated within the Christian church. And that's evident by the many emails and questions we got in our Facebook group."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":136.7,"end":138.3,"speaker":"Fr Stephen De Young","text":"You got emails in the Facebook group?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":138.46,"end":141.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah. You can email the Facebooks now. Did you know that?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":141.66,"end":142.7,"speaker":"Fr Stephen De Young","text":"No, I did not know that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":142.7,"end":143.66,"speaker":"Fr Andrew Stephen Damick","text":"It's totally a thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":143.82,"end":145.42,"speaker":"Fr Stephen De Young","text":"I eschew the Facebooks."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":148.5,"end":200.94,"speaker":"Fr Andrew Stephen Damick","text":"On that episode, we first talked about how the Torah has not been abolished, but fulfilled. Then we talked about two Cora Core Torah principles. Easy for me to say. Core Kora Torah, Core Torah, Torah, Torah, Torah principles. And those are dwelling safely with God and also managing the problem of Sin, including how those principles get worked out in the church now that Christ has come. So this time we're going to continue talking about these Torah themes. How the commandments of the Torah continue to be applied because it was not abolished. And we're going to look at three more major themes this time. Number one, what is clean and unclean. Number two, how worship works. And number three, probably the most controversial one of them all, the Torah death penalty. So father, is it safe to say that here in 21st century America we should not be stoning every kid who talks back to his mom?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":203.43,"end":214.15,"speaker":"Fr Stephen De Young","text":"Yes, because the stoning was her talking back to your father. Oh, see, man, you caught me. Better of the law."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":214.23,"end":216.15,"speaker":"Fr Andrew Stephen Damick","text":"You're a way better Pharisee than I am."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":216.55,"end":221.19,"speaker":"Fr Stephen De Young","text":"Yeah. What do you mean by talk? What do you mean?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":222.39,"end":228.95,"speaker":"Fr Andrew Stephen Damick","text":"And what do you mean by father? Yeah, right. So clean and unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":230.63,"end":232.67,"speaker":"Fr Stephen De Young","text":"You're jumping all the way ahead to."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":232.67,"end":233.11,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":233.11,"end":236.55,"speaker":"Fr Stephen De Young","text":"You know, to the third half with this whole death penalty thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":236.63,"end":241.43,"speaker":"Fr Andrew Stephen Damick","text":"I know, I like spoilers. We'll get there sometimes patience."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":243.03,"end":254.08,"speaker":"Fr Stephen De Young","text":"Try to cultivate patience in our listeners since we don't get to the point until like three hours in. And here you go jumping the gun, setting a bad example. For shame."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":254.64,"end":257.36,"speaker":"Fr Andrew Stephen Damick","text":"The Torah will allowed me, allow me to repent though. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":257.68,"end":267.28,"speaker":"Fr Stephen De Young","text":"Yes, yes. See, there you go again. Anyway, that almost constitutes a lack of repentance if you keep doing it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":270.48,"end":271.84,"speaker":"Fr Andrew Stephen Damick","text":"Your high handed co host."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":272,"end":328.83,"speaker":"Fr Stephen De Young","text":"Yes. So we're starting out talking about. Yeah, talking about clean and unclean. And this may be the element or theme in the Torah that would be most widely regarded as able to be disregarded by contemporary people who identify with Christians as Christians in the United States, especially when it comes to clean and unclean food, animals. Clean and unclean as it relates to bodily functions and fluids. Clean and unclean as it relates to just about anything else touching holy things."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":331.64,"end":339.08,"speaker":"Fr Andrew Stephen Damick","text":"So I was gonna say, I think it feels like a foreign concept. Like it seems arbitrary, I think to a lot of people. Like, this is clean, this is unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":339.56,"end":340.12,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":340.68,"end":343.8,"speaker":"Fr Andrew Stephen Damick","text":"Why? So what? Do we really do that? No, we don't."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":344.12,"end":463.07,"speaker":"Fr Stephen De Young","text":"Yeah. There was a list of rules, complex procedures for getting rid of like yeast and mildew and things. Right. Not that battles with mildew are not a whole thing in southern Louisiana, but the particular religious procedures are less of a thing in Louisiana currently for most people. I don't know about the local Jewish community. I would have to ask them. But yeah. And so since people are not in the habit of checking to see Christian people are not in the habit of checking to see if their food is kosher, are not in the habit of worrying about, you know, petting their dog. In fact, you know, there's people who feed their dogs off their own fork. This I've seen this. I've not done this I've seen this. Right. Even though we now understand the germ theory of disease, we still don't attach any religious or moral freight to. To that kind of thing. Right. We, you know, yeah, that's kind of gross. And, yeah, probably shouldn't do that. And yes, employees must wash their hands before returning to work. But, like, that's not because religion anymore, that's because germs. Yes. But there is something very important going on in the Torah in regard to these distinctions that are made between clean and unclean. And the point being made with those distinctions is one that's very much still important, as we will see. And it's important. I keep using the word important. It's crucial that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":463.9,"end":465.5,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. For English style."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":466.06,"end":521.27,"speaker":"Fr Stephen De Young","text":"Yeah. When we look at Grammarly blown up with a little thesaurus bubble. Right. That we look at what the Torah actually says about this. Right. Because especially, again, with Leviticus, I think when people think about this, they're just thinking of, okay, well, there's this big long list of unclean animals and then a big long list of clean animals, and there's a big long list of things that make you unclean. Right. It's just these lists. Right. But there's more to it than that if you actually read what the Torah says. So, for example, in Leviticus 20, verse 25, and this is an important locust because this is in the midst of the food laws and this sort of thing, it frames this in an important way."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":521.67,"end":541.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is what the verse actually says. You shall therefore separate the clean beast from the unclean and the unclean bird from the clean. You shall not make yourselves detestable by beast or by bird or by anything with which the ground crawls, which I have set apart for you to hold unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":543.19,"end":666.97,"speaker":"Fr Stephen De Young","text":"Right. So part of what's going on in designating certain animals clean and certain animals unclean. Right. And all of the other things that are designated as unclean according to this text is that God is teaching the Israelite people, later, the Jewish people, to discern between. To distinguish between clean and unclean. He is making this a category, because the category, the principle involved, is going to have applications beyond just, hey, you're unclean. After you relieve yourself, hey, you're. This animal is unclean. And you shouldn't eat it. Right. You shouldn't eat a vulture. Right. Or an owl. Beyond that, there is further application of this principle of clean and unclean. And God is here giving the Israelites a very practical, a very hands on, a very literal version of this. So that by observing and performing this literal version of separating a clean bird from an unclean bird, they will also learn on a moral level, on a spiritual level, what is clean and what is unclean and separate those as well. And when we say that this isn't like spiritualizing in the woo woo sense. Right. This isn't allegorical interpretation or application."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":667.45,"end":674.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which the idea that like. Okay, well, now that you've got sort of the point, don't worry about doing the actual thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":675.46,"end":714.83,"speaker":"Fr Stephen De Young","text":"Right, right. This is, this is the point that's being made in and through those literal observances. Yeah, right. In and through this point, this understanding is being cultivated. Right. In a very practical way. If you want to hear allegory on this, go check out Charles Haddon Spurgeon's Sermon on the Owl, the Nighthawk and the sparrow of these birds you shall not eat."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":716.27,"end":717.35,"speaker":"Fr Andrew Stephen Damick","text":"That could be the title of a."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":717.35,"end":766.87,"speaker":"Fr Stephen De Young","text":"Novel, though it is very long. And he ends up, through a lot of chicanery, getting to preaching what he understands to be the gospel at the end. But you got to do a lot of ledger domain, right. With, well, the owl represents this and the nighthawk represents this and the sparrow represents that. Right. That's allegory. But pointing out that distinguishing between clean and unclean in practical, everyday matters, making that distinction and having that distinction be part of your thought process, part of your phronema. Right. Part of your. Right. That then is going to apply itself to weightier matters."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":768.95,"end":769.35,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":770.55,"end":800.4,"speaker":"Fr Stephen De Young","text":"And we're gonna go into this now and describe this more. Right. Because it's important that another piece of this that's critical is that those lists, we already saw the purpose statement. But those lists are not just arbitrary. Yeah, right, right. God didn't just randomly select some animals to say it's okay to eat and then randomly select some other animals and say, no, not these."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":800.72,"end":804.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So when they received the lists, they would have said, oh, we see what he's doing here."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":805.2,"end":813.2,"speaker":"Fr Stephen De Young","text":"Right. And he's not. Didn't randomly select some bodily functions that make you unclean and then some other ones are fine."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":814.32,"end":814.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":816.72,"end":852.93,"speaker":"Fr Stephen De Young","text":"None of this is sort of arbitrary or random or just God's fiat. There is first of all something real here and then something that's being communicated about that reality. So why are things Unclean. Right. That's the question we really need to ask. Because, of course, when God creates everything in Genesis 1, he says after each day of creation, he calls it Tov in Hebrew. He says, it's good, it's beautiful."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":853.65,"end":857.73,"speaker":"Fr Andrew Stephen Damick","text":"It doesn't say, and on the fifth day, God made unclean stuff."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":858.05,"end":861.65,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. He doesn't get to the end and say, it's kind of filthy. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":863.01,"end":871.03,"speaker":"Fr Andrew Stephen Damick","text":"Now that I've made everything, these things are clean. That's not. Adam and Eve are not presented with clean and unclean animals."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":871.35,"end":928.65,"speaker":"Fr Stephen De Young","text":"Yeah. Someone needs to come and dust in here. Right. That's not a thing. Right. But there's this transition, right. In Genesis 3, when the curse is enunciated. Right. Now, I think we talked about this back in the blessing and curses episode, but it bears repeating. Sometimes people read this as God cursing Adam and then cursing Eve and then cursing the devil. Right. And that's not the way it's actually presented in the text. Right. The way it's presented in the text is God is describing the curse. He is describing the cursed state of the world. Now, as a result of the. The actions of Adam and Eve and the devil. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":929.05,"end":931.21,"speaker":"Fr Andrew Stephen Damick","text":"They tainted the world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":931.77,"end":946.41,"speaker":"Fr Stephen De Young","text":"Right. This is the consequence. And it's kind of summed up in what he says to Adam, cursed is the ground because of you. Right. God doesn't say, curse you, Adam. I'm going to make your life difficult."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":947.21,"end":950.55,"speaker":"Fr Andrew Stephen Damick","text":"Curse you, Adam. Right, Sorry."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":951.19,"end":967.83,"speaker":"Fr Stephen De Young","text":"He says, right, the ground is now cursed. The earth, literally, the land, the earth. The creation is now in this state of curse because of what you have."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":967.83,"end":968.15,"speaker":"Unregistered: David","text":"Done."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":972.95,"end":1052.28,"speaker":"Fr Stephen De Young","text":"Which is, as we've said before a number of times on the show, the opposite of what he was supposed to do. He and Eve were supposed to go out from Eden and put the world in order and fill it with life until the whole world was Eden. And what he has done has had the opposite effect. The creation, he was put in charge of. The creation he was to tend like a garden. He is now corrupted. He is now tainted. And so this is the state of the world from then on. In the Hebrew scriptures, in the Old Testament, by the time we get to the flood, the whole world, the curse is at the point where everyone's thoughts are always evil all the time. Right. It's gotten as bad as it can get. And so God uncreates everything and purifies it with water. Right. And then creates again. Yeah. And then, as we've talked about before, things immediately start to run in the same direction. Nimrod shows up. Right. We Got Nephilim coming back. Tower of Babel happens."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1052.76,"end":1053.8,"speaker":"Fr Andrew Stephen Damick","text":"Semiramis."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1054.52,"end":1136.49,"speaker":"Fr Stephen De Young","text":"And God, rather than destroying the world again, which he promised he wouldn't do, he steps back away. But that leaves the world in this state of curse. When God then approaches humanity again, beginning with Abraham, but then especially with the giving of the Torah at Mount Sinai, God is essentially establishing an island or an outpost in the midst of a cursed world. So, you know, you could say this about Abraham and his family wherever they're traveling as nomads, right? But especially once we have the Torah being given, like we talked about last time, God is going to come and dwell among his people. And so there have to be these concentric circles of holiness, of purity. Right? Of cleanness. But even the farthest out concentric circle, which is just the borders of the Israelite camp in the wilderness or the borders of Israel, Judah, right? Once they're in the land, that furthest boundary is still maintaining a level of purity and holiness higher than the rest of the world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1138.21,"end":1163.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, I mean, it's like, you know, the flood comes and there is a boundary that's set up which is the ark, right. And the people in it are people and animals in it are saved. And then when the flood is over, it's not like, okay, everything is great now because the demonic force of sin is still at loose in the world, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1163.24,"end":1188.2,"speaker":"Fr Stephen De Young","text":"We said right away with Ham, who's like Cain. Yeah, yeah, yeah. And so, I mean, a way to picture this, right? Is, you know, you've got the whole world covered in darkness except for this one little island of light, Right. And holiness. And through the history of Israel, in the Hebrew scriptures, that light's minimally flickering."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1189.73,"end":1191.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1191.37,"end":1250.45,"speaker":"Fr Stephen De Young","text":"And perpetually looking ready to go out. Right. There's this little island, and so there has to be. Right. To keep that light going, to keep that purity going, there has to be this level of purity maintained. And we talked last time about how there's moral and ceremonial uncleanness, moral and ceremonial impurity. And we talked about how ceremonial impurity is not necessarily a moral issue. Right. So using the restroom is not immoral. Right. Will be more controversial, shall we? Women menstruating is not immoral. Right, Right. Having a wound that bleeds is not immoral."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1250.85,"end":1251.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1254.05,"end":1290.14,"speaker":"Fr Stephen De Young","text":"None of these things are immoral, but they do make you unclean. Right. In a very practical, literal way. Right. You need to clean yourself afterwards. Moral impurity also makes you ceremonially impure because the sin not only is a sin that does damage to you, to whoever else was involved, whatever injured party there might be. But that sin leaves this taint, this stain."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1291.34,"end":1337.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's good to underline as well that it's not just a matter of defining things as clean and unclean. And, you know, this is how you wash up or whatever. But it's so that. And we talked about this last time, but it's so that people can approach God's dwelling place and not be destroyed, right? So it's cleaning up for a purpose. It's not like just saying this thing is good and this is bad, you know, it's not, it's not that. It's. It's. It has a purpose behind it, as in the idea is to be able to commune with God. You know, just like, you know, wash your hands before you come to the table, kids. Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1337.03,"end":1365.6,"speaker":"Fr Stephen De Young","text":"And those very literal things, right? If you understand and you internalize those very literal things, they will help you understand the idea of moral impurity, Right? Right, right. They'll help you understand what it means to have a stain, right? A moral stain on your life. Right? And so these, these ideas work together."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1366.32,"end":1366.72,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1367.2,"end":1510.39,"speaker":"Fr Stephen De Young","text":"But what doesn't happen when the Torah is given is the nation of Israel is not made perfect all at once. All of the people, right. The people still sin, right? And the people still do things that cause them to contract ceremonial uncleanness. And the fact that that keeps happening, the fact that living life in a sinful world, what we would call a fallen world, right. Causes them to become physically impure. They needed to be clean, is again supposed to be a pointer to help them internalize. The fact that in addition to that, living in a fallen world often forces people to make compromises and do things that compromise them morally. And even when not forced, we make a lot of unforced errors. We also just have our own evil motives and do evil things. Right. But even if we're trying, right. The world we live in is a simple reality that sometimes we find ourselves in situations in this world where there is no good option. There are better and worse options, but there is no good one. There is no good one. For example, there are times when people or groups of people are forced to resort to violence because the consequences of not doing it are far worse. Yeah. That doesn't make the violence good or justified or right. And anyone who's had to perform acts of violence in that kind of situation can tell you for sure from their experience that there was nothing good about it, but it was what had to be done. And the Torah takes this into account. For example, someone comes back from war, even if it is a war that was completely allowable by the Torah, that followed all the Commandments in Deuteronomy 10 about warfare perfectly. The returning soldiers have this whole period of penance at the edge of the."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1510.39,"end":1510.67,"speaker":"Fr Andrew Stephen Damick","text":"Camp."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1512.59,"end":1645.46,"speaker":"Fr Stephen De Young","text":"Where they clean the blood off their weapons off of themselves, and they spend time there repenting before they're reintegrated into the people. There was a way of dealing with this. Right. And so that means in order, if we're talking about our island of Light again, in order for that thing to to continue to exist, there has to be ongoing purification and forgiveness going on to allow that level of holiness and purity to exist, because the people are not capable of maintaining it by their own efforts, by just not sinning, right. Or not contracting uncleanness, they are going to do both. And so there has to be a process for dealing with it and taking care of it. This is sort of the point where the two things we talked about last week meet. We talked about the concentric circles of holiness. Right. And we talked about purification and the management of sin. Right. This is the place where those things meet. Right. Practically, is that having those concentric circles of holiness requires the management of sin. The two go together. And so the most sort of immediate way of dealing with uncleanness is through ceremonial washings. And we talked about this a little, I know, in our baptism episode. But even ceremonial impurity, if it wasn't dealt with properly, could turn into moral impurity, could turn into an issue of sin if those procedures for dealing with it were not followed. And we get some of this in numbers, chapter 19."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1646.89,"end":1655.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So there's. I mean, the whole chapter is worth reading. Obviously, any chapter in the Scripture is worth reading. But anyway, we're going to just read a couple of verses from that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1655.29,"end":1657.53,"speaker":"Fr Stephen De Young","text":"There's a couple lame ones, but I won't say what book."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1660.89,"end":1713.09,"speaker":"Fr Andrew Stephen Damick","text":"Just say some chapters will probably be less immediately edifying than others. Yeah. Okay, so verse 13 of Numbers 19, whoever touches a dead person, the body of anyone who has died and does not cleanse himself defiles the tabernacle of the Lord, and that person shall be cut off from Israel, because the water for impurity was not thrown on him, he shall be unclean. His uncleanness is still on him. And then similarly, verse 20, if the man who is unclean does not cleanse himself, that person shall be cut off from the midst of the assembly, since he has defiled the sanctuary of the Lord. Because the water for impurity has not been thrown on him. He is unclean. So this is not just someone who's unclean. This is someone who does not wash himself and therefore chooses to remain unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1714.37,"end":1723.81,"speaker":"Fr Stephen De Young","text":"Right. And I love that translation of the water of impurity being thrown on him. Like some priest would come running up with a bucket full of water and just chuck it at you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1723.97,"end":1734.27,"speaker":"Fr Andrew Stephen Damick","text":"Which, I mean, you know, the immediate image that came to my mind was at the end of a sports ball game, you know, when members of the team go and. And ritually cleanse the coach with Gatorade."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1734.43,"end":1754.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. It's got what plants crave, electrolytes. So, yeah, but notice here in verse 13 that Father Andrew read, it's about talking about somebody who touches a dead person, the body of anyone who has died. There is nothing sinful about that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1755.39,"end":1758.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, burying a dead person is a good work."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1758.51,"end":1766.27,"speaker":"Fr Stephen De Young","text":"Right. Burying a dead person with no family is a good work. And of course you're expected. It's a duty for you to bury your father."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1766.91,"end":1767.63,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1767.79,"end":1816.3,"speaker":"Fr Stephen De Young","text":"Bury your mother. Right. To bury family members in an appropriate way. Right. So that's not a sinful thing to do. Right. To bury someone. But you could track ceremonial uncleanness. A dead body is unclean. And so if a person refuses then to properly cleanse themselves and tries to return to regular life. And then verse 20 is even more general. Right. And notice it says, we'll come back to this in the third half, but they'll be cut off from the midst of the assembly. This is like the death penalty for not washing up after you use the bathroom. That's literally what it says."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1816.54,"end":1817.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1817.58,"end":1964.39,"speaker":"Fr Stephen De Young","text":"Like, we got to start with what it actually says, and then we're going to keep talking about it. But that is what it says. Right. Notice also here, because this is about to become important, notice how it says that in. In verse 13, it says that that person has defiled the tabernacle. And in verse 20 it says he has defiled the sanctuary, the holy place. Okay, this isn't just talking about priests. Yeah. Priests are the only ones who went in there. So this person may not have gone anywhere near the tabernacle proper. Right. But he has still defiled it. He may not have gone anywhere near the holy place, but he still defiled it by his sin. So this is part of what we were talking about last time and that we're about to talk about some more. That the sanctuary, that inner circle, the most holy place, the holy place, the tabernacle. This is the holiest part of the concentric circle. And so this is the place where sin is the most dangerous. Right. But here we see this principle that is in the Torah, that even if that even Israelite sin that is performed outside the tabernacle, outside the camp even still can potentially bring this taint of curse to the tabernacle where it is most dangerous. And so this is the reason for it. We're going to talk about more. But this is the reason for that cutoff from among the people language. It's not just, oh, he might experience death by holiness even though he's not actually going into the holy place, it's, he, the whole camp, might experience death by holiness because of what he's done. And let me tell you, if you really want to get into this stuff, as I have, you will find a rich and fascinating scholarly literature about how the taint of sin gets from the sinning Israelite to the sanctuary."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1966.07,"end":1966.55,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":1967.12,"end":2044.92,"speaker":"Fr Stephen De Young","text":"Like if it sort of physically moves there or appears there or how exactly that works, because people need to write journal articles, dissertations. Right. But suffice for tonight. We won't go into all that suffice for tonight. It does. Right. What they do, even away from the sanctuary, affects the purity of the sanctuary, of the place where God is dwelling, because he is dwelling with them, even if they're not walking in physically. So there is this great danger, not only for the person who becomes ceremonially unclean and doesn't deal with it appropriately, but for the whole people because of his disobedience. I think I could use his instead of his or her. Because we're talking about bad things. Right. Nobody's gonna be like, you need to denounce sinful women also. But. Well, maybe somebody will. But. And so we have to have. We have to have a very established system for how to deal with this to prevent that danger."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2046.77,"end":2047.01,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2047.17,"end":2063.97,"speaker":"Fr Stephen De Young","text":"And so we have this procedure that's slightly different depending on who it is. Right. But the first thing when someone sins is what we would now call from the Latin, penance. But what we mean by that is restitution, restoration."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2064.13,"end":2066.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Make it. Make it right. Fix it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2066.33,"end":2078.8,"speaker":"Fr Stephen De Young","text":"Fix the thing that you broke, which is which. That's the actions that constitute repentance. Right. Not feeling bad about it. Not wanting to avoid the consequences of your actions."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2078.96,"end":2082.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And not just merely stopping doing bad stuff."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2083.2,"end":2083.68,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2083.76,"end":2087.52,"speaker":"Fr Andrew Stephen Damick","text":"Although that's. Obviously, you can't repent if you don't stop doing bad stuff."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2087.52,"end":2098.24,"speaker":"Fr Stephen De Young","text":"Yes. Don't steal from anybody else. But you also need to pay back what you stole from the first guy. Right. So you do that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2099.61,"end":2099.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2101.05,"end":2122.97,"speaker":"Fr Stephen De Young","text":"And then typically. Right. You offer a sacrifice. Now, when we say offer sacrifice, that's not literal under the Torah because the you is probably not a priest. Right. A sacrifice is brought for what you did to the tabernacle where it is sacrificed."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2124.66,"end":2124.9,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2125.78,"end":2141.3,"speaker":"Fr Stephen De Young","text":"And then once that is taken care of, once the moral issue is taken care of, then there is ceremonial washing. If you're a priest who sins, this gets changed up a little bit. Because of course, for you to go and offer a sacrifice for yourself, you have to wash first."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2142.98,"end":2146.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because a priest is going in into the tabernacle."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2147.06,"end":2151.66,"speaker":"Fr Stephen De Young","text":"Right, Right. So that gets inverted because no one."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2151.66,"end":2157.74,"speaker":"Fr Andrew Stephen Damick","text":"Else, just as a reminder, everybody, no one else goes into the tabernacle, that area, except for the priests."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2158.06,"end":2163.82,"speaker":"Fr Stephen De Young","text":"Yes. We cannot, we cannot stress this enough because, you know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2166.22,"end":2166.58,"speaker":"Fr Andrew Stephen Damick","text":"Just."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2166.58,"end":2201.32,"speaker":"Fr Stephen De Young","text":"Just wait for a worship debate to come up. Right. And you're going to have someone say, well, look, they used musical instruments in Temple worship. Right. And when someone makes that argument, there's sort of an unspoken presupposition that, like what used to happen in ancient Israel is that on the Sabbath day, everybody would trek over to the temple in Jerusalem and they'd all go worship God there. Like, they'd all file in and have a worship service where they use musical instruments. That never happened."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2201.8,"end":2213.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. So even if, even if they were using musical instruments in the Temple, like some of these people say that they were, that was not been something that most people would have ever seen or heard."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2214.04,"end":2256.55,"speaker":"Fr Stephen De Young","text":"Yes, yes, that would have been something accompanying the priests on duty, going about and fulfilling their duties with some kind of music in the background. Right. Like the Psalms of Ascent are called the Psalms of Ascent, not because these are the psalms they sang in the worship service at the Temple. It's. Those were the psalms that people sang on their way making the hike to Jerusalem for the feasts when they were able to. Right. And it took a long time, but then when they got there, they didn't go in."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2256.87,"end":2261.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They would stand at the door, hand over their animals to the priests."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2262.87,"end":2374.55,"speaker":"Fr Stephen De Young","text":"Yeah. So we have to really emphasize this, Right. Because we have this. We've projected our modern worship services, or at best projected like a Jewish synagogue service back into the Temple. And synagogue worship and Temple worship were two very different things. When temples and synagogues coexisted, there were very strict rules. There were all kinds of temple things you weren't allowed to do in the synagogue. And I have had someone Jewish who went to an Orthodox service say to me, where do you guys get off Doing xyz, you're only allowed to do that in the temple. We'll get to more of that, the second half. But these were very. These were very, very different things. But so this brings us to the day of Atonement, because the annual day of atonement is really for dealing with this issue, dealing with the danger that the sins of the people create in those sins, defiling the sanctuary, even if they aren't committed there, and the threat to the entire community of death by holiness that that presents. This is why we need to have an annual day of atonement in the Torah. And if you read Leviticus chapter 16 closely, which is where the day of atonement is laid out, what you find is that atonement is not made for people. Yep. Atonement is made for the physical accoutrement of the tabernacle and the later temple."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2374.95,"end":2376.07,"speaker":"Fr Andrew Stephen Damick","text":"It's about the space."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2377.27,"end":2389.43,"speaker":"Fr Stephen De Young","text":"Yeah. That is the language. Atone for the altar, atone for the Ark of the Covenant, atone for the table, atone for the altar of incense. Right. You're atoning for physical objects."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2391.35,"end":2398.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now you're atoning because of what people did to those objects effectively, or what."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2398.35,"end":2400.55,"speaker":"Fr Stephen De Young","text":"People did nowhere near those objects."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2400.71,"end":2403.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. There's sort of the taint."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2404.23,"end":2410.47,"speaker":"Fr Stephen De Young","text":"Right. It doesn't presuppose that someone pulled an Antiochus Epiphanes and went in there and defiled the altar."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2410.63,"end":2414.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, sure. Yeah. So it could be direct, but probably indirect."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2415.59,"end":2417.83,"speaker":"Fr Stephen De Young","text":"99% of the time it was indirect. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2419.11,"end":2420.47,"speaker":"Fr Andrew Stephen Damick","text":"Nadab and Abihu."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2420.55,"end":2439.11,"speaker":"Fr Stephen De Young","text":"Yeah. There are incidents. There are certainly incidents. Right. But 99.9% of the time, you know, most years, they were not, you know, atoning for that, but they're atoning for these objects. Let me suggest this ought to condition how we understand the meaning of the word make atonement."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2440.8,"end":2441.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2442.88,"end":2463.44,"speaker":"Fr Stephen De Young","text":"Right. If your definition of this is what atonement is, makes no sense. When you say make atonement for the altar or make atonement for the Ark of the Covenant, you have misunderstood. Make atonement. I'll put a finer point on it. Okay. They did not punish a goat for the sins of the table."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2466.31,"end":2480.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, I think, you know, like, the way that atonement often gets used in a lot of discourse, especially post Reformation, is essentially as though it were some kind of synonym for the Western Christian doctrine of satisfaction."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2482.55,"end":2482.87,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2482.87,"end":2489.27,"speaker":"Fr Andrew Stephen Damick","text":"That, that. And so obviously it would only apply to humans, because what did a table ever do to God?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2490.31,"end":2490.63,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2490.63,"end":2505.97,"speaker":"Fr Andrew Stephen Damick","text":"You know, so. But. But clearly, when you look at Leviticus. And when it talks about the day of atonement, it's not talking about paying off a person's sins, it's about cleaning up a space."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2506.29,"end":2515.73,"speaker":"Fr Stephen De Young","text":"Right, right. It's not about turning away God's wrath in the sense of God is really angry, but he'll take some goat blood instead of yours."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2515.81,"end":2519.73,"speaker":"Fr Andrew Stephen Damick","text":"Yes. God's gonna smite the altar because. No, wait, that's not what's going to happen."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2521.38,"end":2586.5,"speaker":"Fr Stephen De Young","text":"The blood for the blood God thing, it's. Right, yeah. It's God's wrath in the sense of death by holiness in the sense of. There is this danger of sinful humanity, beginning with sinful Israel, being consumed by God's holiness if their sin isn't. What? Isn't what? Because notice, this isn't about God punishing the sin. This is about them being consumed in their sin. So what needs to happen to that sin? Well, what happens in Leviticus 16 in the Day of Atonement ritual? Step one, the sin is taken away. Right. There's the goat for Azazel. The sins of the people are taken and put on this goat, which then isn't killed and isn't sacrificed. You can't sacrifice it because it's now unclean. It's full of sins."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2587.78,"end":2590.82,"speaker":"Fr Andrew Stephen Damick","text":"Remember, sacrifice is a shared meal with your God. You would not offer."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2592.42,"end":2603.34,"speaker":"Fr Stephen De Young","text":"You cannot offer unclean animals as sacrifices. Yeah, that's like rule one of unclean animals. Offering one to God as a sacrifice is way worse than just eating it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2604.54,"end":2605.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2605.42,"end":2672.73,"speaker":"Fr Stephen De Young","text":"Right. So that's right out. And it's sent right out into the wilderness. So that goat is called the goat for Azazel. The goat for Azazel. There are a lot of folks now who especially because they don't like so much quote, unquote, supernatural in their Bible, want to read Azazel very literally. Because Azel's a goat. Right. So Azazel can literally mean the goat that goes away. This is where scapegoat comes from. Yeah, As a word. Scape as in escape, as in go away. Right. So I say, oh, it just means the goat that goes away. There's something much deeper going on here. And this isn't just because Azazel becomes this demonic figure in some later Jewish literature, which he does. But this is also built into the Torah, because guess what comes after Leviticus 16."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2674.17,"end":2681.75,"speaker":"Fr Andrew Stephen Damick","text":"Leviticus 17. Yes, but wait, there's more Leviticus in Leviticus 17."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2682.79,"end":2684.07,"speaker":"Fr Stephen De Young","text":"There is verse 7."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2684.55,"end":2726.83,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which says this. So they shall no more sacrifice their sacrifices to goat demons, after whom they this shall be a Statute forever for them throughout their generations. So it's, it's, it's flipping it on its, on its head in a sense. Right. So like don't sacrifice to goat demons. Instead we're going to be using this goat, which is not a demon. It's a goat, like a goat. And we're going to put the sins on it and send it out into the wilderness so that Azazel can basically, the goat demon can reclaim what belongs to him, which is the sin. So the goat is being used as a vehicle."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2727.07,"end":2729.47,"speaker":"Fr Stephen De Young","text":"You're taking that sin and saying return to sender."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2729.95,"end":2741.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not being sacrificed to Azazel. That would mean a ritual offering and eating together with Azazel. Like that's the whole point is you're not doing that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2741.87,"end":2745.95,"speaker":"Fr Stephen De Young","text":"Right. The goat is not killed in Leviticus 16."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2746.91,"end":2750.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not put on a barbecue. It's not sacrificed."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2750.67,"end":2775.12,"speaker":"Fr Stephen De Young","text":"It is true that a practice developed later. Once they lead the goat out, they push it off a cliff and kill it. But that's not part of the ritual in the actual scriptures. Yeah, Right. So all of our Protestant friends especially should put no stock in that because it's not in the Bible. It's an extra biblical tradition. You guys don't like those."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2775.28,"end":2788.16,"speaker":"Fr Andrew Stephen Damick","text":"There you go. And reminder, I mean, sacrifice is not the thing that makes a sacrifice. Sacrifice is not the killing. It's the offering on an altar and shared eating or whole burnt offering, you know, on the altar. It's not the killing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2788.48,"end":2793.45,"speaker":"Fr Stephen De Young","text":"And they shoved it off a cliff for a very practical reason. To stop it from wandering back into town."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2793.77,"end":2795.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Don't bring the sins back."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2796.33,"end":2807.61,"speaker":"Fr Stephen De Young","text":"Right. That's awkward. Right? You know, you just got rid of all your sins on this goat. No, wait, he just showed up at Bob's house. Right. What do we do now? We'll lead him back out there, I guess so."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2808.17,"end":2808.85,"speaker":"Fr Andrew Stephen Damick","text":"Don't touch it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2808.85,"end":2833.51,"speaker":"Fr Stephen De Young","text":"So that's why they started pushing him off a cliff. Now in just a second we're going to talk about why that particular mode of death showed up later. Right, but so this procedure for atonement had to be repeated every year. Right. Because every year people kept sinning."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2836.71,"end":2837.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":2837.07,"end":3001.7,"speaker":"Fr Stephen De Young","text":"And while the forgiveness of sins was happening through the daily sin offerings, remember, this is additional. There are daily sin offerings going on. People are making sin offerings, repenting of their sins, taking care of it. But there's still this taint that's developing in and around the sanctuary. This taint of sin, this curse. Right. This uncleanness, this impurity that has to be dealt with, that has to be purified. And every year this has to be done, and every year this has to be done over and over and over again just to keep this little island, right? Let alone the rest of the world. And once we get into the Second Temple period and Jewish people understood this, they began to see in terms of their eschatology, in terms of their thinking about the end, the future, right? And the end of this world, that this problem, right, of the world being under a curse, right, of this wickedness and of this constant purification being needed just for this little island, God was going to deal with this problem sort of once and for all with some kind of finality in the future, right? There was going to be some kind of eschatological day of atonement that was going to happen in the future. And we see related ideas to this expressed in a whole bunch of places in Second Temple Jewish literature, right? And this idea that there's going to come a day, there's going to come a point when God is going to deal with Azazel himself, not just keep shipping the sin back to him, but actually deal with this guy and deal with the sin and deal with the curse once and for all, not only in the little island, deal with it once and for all. So we don't need to keep doing this every year, but deal with it for the whole world, right? Turn the whole world into that island, expand that out to include the whole creation. And this eschatological day of atonement gets imagined in different ways in the details. But even some of the details are the same. So one of the details is that this, this Azazel fella is going to get his comeuppance. And that's going to come in the form of him being bound, him being chained up and thrown into a pit in the earth. That's the sort of form this is going to take."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3002.1,"end":3004.34,"speaker":"Fr Andrew Stephen Damick","text":"I feel like I've seen that in an icon somewhere."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3004.66,"end":3016.37,"speaker":"Fr Stephen De Young","text":"Yeah. And this is where the idea of pushing the goat off a cliff comes from. I mean, there's a lot of easier ways to kill a goat, right? You just slit its throat. You could use an axe. You can, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3016.69,"end":3017.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3017.05,"end":3053.24,"speaker":"Fr Stephen De Young","text":"But leading it to a cliff and pushing it off is kind of an inefficient way. But this idea of throwing it into a crag in the earth to Azazel comes from this idea, right? And so that added traditional element that develops in the Second Temple period develops related to this tradition. It's an element that looks forward to that ultimate eschatological day of atonement, when the world will be purified from Azazel and his works. Right. So in First Enoch, in the Book of Enoch, which I know is all we talk about on this show every."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3053.24,"end":3056.92,"speaker":"Fr Andrew Stephen Damick","text":"Episode, we really should do a show on Enoch."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3057.24,"end":3059.1,"speaker":"Fr Stephen De Young","text":"Yes. Or two."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3060.22,"end":3062.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there are several Enochs to choose from."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3062.7,"end":3107.24,"speaker":"Fr Stephen De Young","text":"I mean, he's my favorite Sleestack first of all. But no. So in first dig, in the book of Enoch, it's St. Michael the Archangel who comes and sort of whoops up on Azazel, at least in one truth. There's also. It may also be Raphael who whips up on him, which is interesting because Raphael, of course, is associated with healing. And in First Enoch, there's a nice little summary verse that talks about this. When the angels are being commanded to go take care of Azazel."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3107.72,"end":3149.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It says, and the whole earth has been corrupted through the works that were taught by Azazel. To him ascribe all sin. And it's interesting. It's not just Azazel has corrupted the whole world. It's that he taught works through which the world was corrupted, which is this idea of, as we've talked about in the past on the show of synergizing with demons, that when we sin, we bring demonic corruption and energy into the world. Right. And then that's. That's what corrupts the whole world, is the humans cooperating with demonic power."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3149.96,"end":3211.67,"speaker":"Fr Stephen De Young","text":"And so here, that's why this is sort of eschatological and final. All the sin in the world now is balled up and thrown onto Azazel. Right. And all the corruption. Right. That it caused. That's first Enoch 10, 8, by the way. In the Apocalypse of Abraham, which is another one of these texts, there's a being who is. Who is the angel of the Lord. Right. His name is Yehoel, which is a combination of a typical angel name that ends in L and the name Yahweh. So the name of this angel is Yahweh. God. And we need to understand what's going on in naming an angel that in the sense that the angel of the Lord. Remember in Exodus, Moses is told that there's going to be this angel who will go before them and that God says he will put his name in him."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3212.55,"end":3215.51,"speaker":"Fr Andrew Stephen Damick","text":"So this very. This literalizes that to the extreme."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3215.99,"end":3353.6,"speaker":"Fr Stephen De Young","text":"Yes. So this is trying to convey this isn't just an angel. This isn't just one of the archangels. This is the angel of the Lord. Right. And he shows up dressed as A priest to officiate and lead Abraham in this eschatological day of atonement against Azazel in the apocalypse of Abraham. So this is sort of a well testified to tradition, and I'll just come out and say it. So when you get to First John, the first epistle of St. John, which is, if we're talking about using the word illustrion, if we're talking about using the words, the Greek vocabulary related to atonement, even though it's a relatively short letter, it uses that vocabulary more than any other book of the New Testament. Right? So a lot of people, they're doing their atonement theories. They're pulling this and that verse from St. Paul here and there, saying it's about atonement. Okay, whatever. First John is actually talking about atonement using the words. Right? And he, St. John very clearly. I mean, obviously we've talked about the binding of the devil in Revelation before on the show. There's a clear connection here to the binding of Azazel. Right. Like, obviously. And also St. Matthew's gospel, which is another book of the New Testament that relies a lot on Enochic traditions. We have, you know, the binding of the strongman. But in First John, he says things like, for example, that the Son of God came, right? The Messiah, Jesus came to destroy the works of the evil one. Not to destroy the evil one or defeat the evil one to destroy the works of the evil one. Sounds a lot like 1st Enoch 10, 8."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3354,"end":3356.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3356.72,"end":3378.08,"speaker":"Fr Stephen De Young","text":"And he says that in his discussion of Christ's atonement about that and to put a fine point on it. Right? First John 2. 2, right. Christ came to make atonement not only for our sins, but also for the whole world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3381.37,"end":3381.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3381.61,"end":3395.21,"speaker":"Fr Stephen De Young","text":"This is one of our themes on the show. Whenever we talk about atonement, Christ is both goats, right? So Christ atones for our sin. He takes away our sin. Right. But then he also atones for the whole world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3396.49,"end":3408.02,"speaker":"Fr Andrew Stephen Damick","text":"And just as a side note, everybody, if you're new to the podcast or newer, one of our older episodes is called the Priest Shall Make Atonement, and the whole episode is about the day of atonement. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3408.1,"end":3408.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3408.66,"end":3413.06,"speaker":"Fr Andrew Stephen Damick","text":"If I feel like it feels like we're not covering everything, it's because we did before."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3413.3,"end":3416.54,"speaker":"Fr Stephen De Young","text":"Yes. And so this is a more pointed discussion, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3416.54,"end":3417.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3417.7,"end":3458.91,"speaker":"Fr Stephen De Young","text":"But so when St. John says and for the whole world, he means the whole physical, material world, which has now been purified by Christ's blood, like the sanctuary, the whole creation, and all the Sin has been taken away. And we see in the New Testament the immediate effects of this. We see the immediate effects of this in, for example, the Acts of the Apostles. People are now able to have, as we talked about last time, the Holy Spirit come and dwell within them."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3461.54,"end":3461.7,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3461.7,"end":3509.36,"speaker":"Fr Stephen De Young","text":"The sanctuary, because they've been purified with Christ's blood and because their sin has been taken away. Right. We see with St. Peter going to Cornelius and the vision he has before Cornelius. Right. That Cornelius qua gentile. Right. Animals qua created things are not ceremonially unclean in and of themselves anymore. Right. Nothing is in clean of itself, but. Right. But I know where some folks listening to this are going. You're trying to get rid of that difference between abolished and fulfilled again."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3510.24,"end":3510.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3512.53,"end":3536.61,"speaker":"Fr Stephen De Young","text":"You're trying to go down this road of. Right. Well, okay, so we don't have to worry about cleaning unclean anymore because everything's clean. Right? Yeah. I don't have to wash my hands when I leave the bathroom anymore because, see, that makes no sense. Right. And obviously there's still moral uncleanness in the world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3538.79,"end":3539.03,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3539.03,"end":3542.39,"speaker":"Fr Stephen De Young","text":"Right. So obviously that's not what that means."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3543.27,"end":3543.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3543.59,"end":3561.03,"speaker":"Fr Stephen De Young","text":"So there's been a change, but the New Testament tells us more than that in describing that change. And we're going to look. We're going to look at some verses from St. Paul that address this very directly, using the language of clean and unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3561.19,"end":3587.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. So in Romans 14:14, St. Paul says, I know and am persuaded in the Lord Jesus that nothing is unclean in itself, but it is unclean for anyone who thinks it unclean. Now, he doesn't. He's not saying, like, what is it, Hamlet, you know, nothing is good or bad, but thinking makes it so."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3587.21,"end":3588.01,"speaker":"Fr Stephen De Young","text":"Yeah, that's not."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3588.01,"end":3588.89,"speaker":"Fr Andrew Stephen Damick","text":"That's not what he means."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3590.46,"end":3592.86,"speaker":"Fr Stephen De Young","text":"If I think someone is filthy, then they're filthy and need me."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3592.86,"end":3597.02,"speaker":"Fr Andrew Stephen Damick","text":"So the power of negative thinking. Yeah, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3597.02,"end":3631.33,"speaker":"Fr Stephen De Young","text":"Yeah. No, this is. That it is not. Nothing is innately unclean. But it could become unclean based on how we treat it and how we use it and what we do with it. Right. So St. Paul will set up, on one hand, receiving things with prayer and thanksgiving to God. Right. As the proper way to receive any created thing that comes into our life. Right. Or person. Right. But there's a lot of other things you can do, as we all know. Right. You could take food and you could offer it to an idol."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3632.53,"end":3632.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3633.33,"end":3643.49,"speaker":"Fr Stephen De Young","text":"There was. There was nothing innately, you know, impure or unclean about that lamb or that goat. But now you've taken and you've done something unclean and impure with it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3644.58,"end":3659.38,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, and this is, you know, this is the reason we get our houses blessed. Right. Or anything blessed. It's not because it's unclean in and of itself. Right. It's that we have sinned."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3660.34,"end":3660.82,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3660.98,"end":3692.08,"speaker":"Fr Andrew Stephen Damick","text":"You know, and it's. It's no longer, you know, trying to maintain this island of cleanliness, of cleanness in the midst of an unclean world in general, but rather that the world has been cleaned by the work of Christ, but we can still mess it up by our own sins. And so, you know, there needs to be this. This. So it's. It's similar in certain ways to the. The old system of sin management, but in pretty significant ways. It's. It's different as well."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3692.32,"end":3696,"speaker":"Fr Stephen De Young","text":"Right. There are continuities and discontinuities."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3696,"end":3698.52,"speaker":"Fr Andrew Stephen Damick","text":"There we go. That could be a teacher."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3698.52,"end":3698.64,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3698.64,"end":3698.88,"speaker":"Fr Andrew Stephen Damick","text":"There."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3699.48,"end":3722.28,"speaker":"Fr Stephen De Young","text":"There is no, you know, your body and no part of your body is innately unclean, but you can take your body and do unclean and impure things with it, obviously. Right, obviously. So he says that in Romans. Now, we're going to look at a little different angle. Something he says in First Corinthians."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3723,"end":3745.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is 1 Corinthians, chapter 7, verse 14. St. Paul says, for the unbelieving husband is made holy because of his wife, and the unbelieving wife is made holy because of her husband. Otherwise your children would be unclean. But as it is, they are holy. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3745.26,"end":3778.24,"speaker":"Fr Stephen De Young","text":"So what's going on here? He's talking about families in which one spouse. And we're talking. We're writing to Corinth. So this is mostly former pagans. Right. Where one spouse is still a pagan and the other has become a Christian. And in the context of this, St. Paul has urged very strongly that if at all possible, those couples should not separate or get divorced. Yeah, right. That they should stay together."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3778.8,"end":3782.65,"speaker":"Fr Andrew Stephen Damick","text":"Now, this is not the same as don't marry a pagan."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3782.97,"end":3798.17,"speaker":"Fr Stephen De Young","text":"Right. He's equally strongly says, do not be, you know, unequally yoked. Right. Don't. Don't sign up for this situation because it's very difficult. Right. But if you find yourself in this very difficult situation, thinking of divorce as an easy answer to it is wrong."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3798.73,"end":3799.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3800.49,"end":3804.73,"speaker":"Fr Stephen De Young","text":"And that's, of course, mainly directed at men because women were kind of stuck. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3807.88,"end":3810.88,"speaker":"Fr Andrew Stephen Damick","text":"Not by Christian design, but that's because how the world worked in the first."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3810.88,"end":3839.83,"speaker":"Fr Stephen De Young","text":"Century, that's how the Roman Empire was. Yes. That's, you know, so what St. Paul is doing here, you know, how does he understand it where he's able to say, like, okay, well, somehow. Like if the wife is a Christian, that somehow makes her pagan husband holy and then her children holy and not unclean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3840.95,"end":3842.39,"speaker":"Fr Andrew Stephen Damick","text":"What does that mean exactly?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3842.71,"end":3862.96,"speaker":"Fr Stephen De Young","text":"How does that work? Right. And if you approach this in a very individualistic way and you're thinking about holiness purely in terms of getting saved, then this gets really confusing because then it's like, well, wait a minute, does that mean this husband is saved even though he's still a pagan?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3863.92,"end":3866.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Even though he's still communing with demons."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3866.32,"end":3903.88,"speaker":"Fr Stephen De Young","text":"And the kids are sort of somehow automatically saved? You know, I mean, if that were true, we'd have to baptize them anyway. Sorry, imaginary interlocutor. But that, of course, is a category confusion, Right? Because clearly in what St. Paul says here, the opposite of holy is not unsaved. The opposite of holy is unclean. So he is making a clean and unclean distinction. Right? A clean and unclean distinction, a pure and impure distinction. And he is basing this on the understanding of circumcision."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3906.2,"end":3914.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because in the Jewish world, the Torah, the way that you become part of the covenant is by being circumcised if you're male."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3915.36,"end":3915.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3915.6,"end":3929.36,"speaker":"Fr Andrew Stephen Damick","text":"But if you're a woman or a daughter, a girl, then you are either the child, the daughter of a circumcised man, or the wife of a circumcised man. And so you're included through his circumcision."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3929.76,"end":3957.69,"speaker":"Fr Stephen De Young","text":"Right. His circumcision. And we've talked about circumcision before on the show, and what it's a sign of, but the sign of being separate, being cut off from the world. Separate from the world. Right. That holiness that the circumcision entails is equally true of the spouse. Right. The daughter, even though they are not. You know, Israel never practiced what's called female circumcision, which is a completely different thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3957.93,"end":3958.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3958.65,"end":3960.57,"speaker":"Fr Stephen De Young","text":"Not even related to male circumcision."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3960.57,"end":3962.49,"speaker":"Fr Andrew Stephen Damick","text":"Horrendous, horrific, evil."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3962.81,"end":3989.1,"speaker":"Fr Stephen De Young","text":"Right. So what St. Paul does is he takes that theological understanding and he applies it essentially to baptism. Right, Essentially to baptism, and says that it. Because baptism was done to everyone, it wasn't just males who were baptized. Right. It was men, women, children who are baptized."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3989.42,"end":3989.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":3991.5,"end":4124.71,"speaker":"Fr Stephen De Young","text":"That even if we're in a situation where the father is a pagan and therefore he won't allow the children to be baptized. Right. The woman who was baptized and who is a Christian, her holiness, her being set apart from the World, Right. She, by that, sets apart her whole family. Right. It sort of communicated that cleanness or that holiness. Right. That separation from the rest of the world, even if the husband in this case. Right. And this would go the other way also, right. Where it'd be almost identical to circumcision, where, you know, the believing father. But in the Roman Empire, that was less of a situation. Right? Because bluntly, in the Roman Empire, if the potter familiar became a Christian, everybody became a Christian in the family. If you wanted to stay in the family and not die, that's just the way society worked. But he's extending this, right, this promise to women. And so got to remember, this is the basic building block, right? The circumcised male head of family is the basic building block of Israel and of the later Jewish people. Right? You have a family headed by a circumcised male who circumcised the other males of that household. Right. Those households make up clans, those clans make up tribes, those tribes make up Israel. That's the building block. Right? And so St. Paul, by saying this about Christian families, right? These families are the building blocks of the church, right? Of the assembly, right. Which is the continuation of the assembly of the Hebrew Scriptures, the assembly of the Old Testament, the assembly of Israel as it continues in the church, the building block is still."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4126.15,"end":4126.51,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4126.51,"end":4166.1,"speaker":"Fr Stephen De Young","text":"These believing family units. Right? But so the one believing parent, the one believing family member connects that whole family to the assembly, to the church and its life, and makes it part of that clean space out of the world. Right. Which seems bent on continuing to re. Pollute itself. That's where he's going with this idea."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4166.58,"end":4180.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And God willing, through that, those other people in the family will also come closer to Christ and potentially experience salvation as well."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4180.82,"end":4208.88,"speaker":"Fr Stephen De Young","text":"Right. But remember, the salvation that comes in Christ is not just individual people going to heaven, not hell when they die. In fact, that's not even what it's about at all, as we talk about many times on the show. But this idea of just personal or individual salvation, Right. Otherwise, passages like where St. Paul says, Christ is the savior of all men, especially those who believe, or especially those who are faithful, makes no sense."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4210.16,"end":4212,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, especially like."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4213.2,"end":4221.35,"speaker":"Fr Stephen De Young","text":"Right, so there are benefits of Christ's salvation, Right. That. That aren't just the kind of personal salvation we think of."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4222.15,"end":4222.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4222.99,"end":4236.71,"speaker":"Fr Stephen De Young","text":"And these are the kind of benefits that St. Paul is talking about being received by the other members of the family, even if they are not faithful Christians, like the one person who is. Right. So one more example from St. Paul."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4237.03,"end":4257.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so this is from 2nd Corinthians, chapter 6, verse 17. Therefore go out from their midst and be separate from them, says the Lord, and touch no unclean thing, then I will welcome you. So we see that dynamic set up right there, which is approaching God means being clean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4259.28,"end":4259.68,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4259.84,"end":4260.96,"speaker":"Fr Andrew Stephen Damick","text":"Got to be clean first."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4261.6,"end":4268.32,"speaker":"Fr Stephen De Young","text":"Right. And St. Paul is saying this after the death and resurrection of Christ and the coming of the Holy Spirit."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4269.24,"end":4272.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's unclean things even then."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4272.68,"end":4326.47,"speaker":"Fr Stephen De Young","text":"The pagan world out there. Right. Those people are no longer unclean just because they're gentiles, just because they're goyim. That doesn't necessarily make them unclean or impure, but actions they take, sinful, wicked actions they take, pollute them, make them impure. Right. That needs to be purified. Right. Baptism, etc. When they come into the church. Right. But there is still an inside and outside. It is not an island in the midst of darkness anymore. Right. Especially since the church is spread out through the whole world. Right. But there are still dark places. There are still places where the light is not shining as brightly yet."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4326.87,"end":4346.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one thing, I think this would be a good moment to mention this. We had a number of people ask in the last couple weeks, like, what does it mean if that Christ has taken care of the problem of sin once for all? I still see sins in myself, around me, other people that took care of sin. What do you think?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4346.65,"end":4348.09,"speaker":"Fr Stephen De Young","text":"It's Lent. You're supposed to quit that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4348.25,"end":4349.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4349.53,"end":4351.01,"speaker":"Fr Stephen De Young","text":"Just knock it off with the sin."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4351.01,"end":4360.33,"speaker":"Fr Andrew Stephen Damick","text":"But. But this is. This is part of what that means, that there's been a fundamental shift in the environment, so to speak. Atonement for the whole world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4360.89,"end":4361.37,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4361.61,"end":4370.81,"speaker":"Fr Andrew Stephen Damick","text":"You know, no longer do we live under the. The heavy weight of sin everywhere. Now it's only present if we bring it in."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4372.1,"end":4379.38,"speaker":"Fr Stephen De Young","text":"We're not. We're not trying to defend an outpost of light in a dark world. We're going out and shining a light into the dark places that still remain in the world."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4380.42,"end":4380.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4381.7,"end":4383.38,"speaker":"Fr Stephen De Young","text":"And I think defense to offense."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4383.86,"end":4393.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And part of it is that no one alive knows what it was like to be alive when paganism ruled the whole world. So we don't."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4393.94,"end":4394.74,"speaker":"Fr Stephen De Young","text":"The saints."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4395.06,"end":4396.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, of course. You know what I mean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4397.22,"end":4400.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, I know. I'm just. I'm actually you for no reason now."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4400.61,"end":4402.13,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. It's fine. It's fine."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4402.13,"end":4403.25,"speaker":"Fr Stephen De Young","text":"Being pedantic about it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4403.33,"end":4415.17,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. Well, someone wanted to actually you recently because you used the phrase God can't. I thought you said God. There's nothing God can't do."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4415.81,"end":4419.17,"speaker":"Fr Stephen De Young","text":"No, that was just. I was really angry at Immanuel Kant."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4421.49,"end":4423.33,"speaker":"Fr Andrew Stephen Damick","text":"Well, there are many good reasons for that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4423.57,"end":4430.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, they misinterpreted that. Did the transcript get it wrong? They spell can't differently, but."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4433.15,"end":4473.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. That. That Christ dealing with the problem of sin once for all is. Is not that there's no sin left in the world. That's not what that means. It means that all sin is now on the run. And, you know, as we've said many times, now is the time when he rules in the midst of his enemies until all his enemies will be put at his feet. That process, you know, D Day has happened to put it in World War II metaphorical terms. Right. The. The decisive battle has been won. So he's. It's. It's like you could say that at D Day, you know, the. The threat of. Oh, this be. Two episodes in Roman mentioned Nazis. The threat of the Nazis was dealt with once and for all."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4473.93,"end":4480.25,"speaker":"Fr Stephen De Young","text":"Come on. It's played out. Talk about Pol Pot or something. The Khmer Rouge. Oh, sorry."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4480.25,"end":4494.61,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, that. That the decisive battle has been. Has been won, but it doesn't mean that the cleanup doesn't continue. Right. So that's. That's what's going on. That's what that is meant by that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4494.61,"end":4495.05,"speaker":"Unregistered: David","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4495.13,"end":4498.49,"speaker":"Fr Andrew Stephen Damick","text":"You know, eventually the cleanup will be done. I mean, eventually the cleanup will be completed."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4498.97,"end":4502.57,"speaker":"Fr Stephen De Young","text":"Yeah. You know what else is on the run?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4504.97,"end":4506.81,"speaker":"Fr Andrew Stephen Damick","text":"Band. Band. Band is on the run."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4506.81,"end":4507.37,"speaker":"Fr Stephen De Young","text":"Bands."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4508.02,"end":4508.42,"speaker":"Unregistered: David","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4511.3,"end":4511.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4511.74,"end":4548.31,"speaker":"Fr Stephen De Young","text":"And so there is still this need for us as Christians to distinguish between the clean and the unclean. Right. And so for us now, right, who are gentile Christians, who are never called to keep those commandments in the first place, Right. What we're called to do is to understand this as being as clean and unclean, as being concerned with actions rather than things."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4549.67,"end":4550.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4550.15,"end":4612.39,"speaker":"Fr Stephen De Young","text":"Right. And that was the goal of discriminating between the animals and discriminate these other things. Right. The goal of that was to be able to. To discriminate between clean and unclean actions, attitudes, thoughts, desires. Right. That was the goal. Right. So again, this is not a making spiritual. This is a continuation of the heart. Right. The spirit, meaning the Holy Spirit of the Torah. Right. The Spirit of God speaking in the Torah for all people who make that distinction. Right. And you know, as Father Andrew mentioned, people still sin now and then. Yeah. Right. Even people who have been baptized, who have been washed. Right. Who have been purified, who had cleansed, they still will sin. Right. And so now we have the process of repentance, absolution, forgiveness."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4613.7,"end":4613.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4614.82,"end":4618.98,"speaker":"Fr Stephen De Young","text":"That allows us to maintain now not a physical sanctuary."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4619.62,"end":4620.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4620.26,"end":4624.9,"speaker":"Fr Stephen De Young","text":"But ourselves as the sanctuary in which the Holy Spirit dwells."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4625.46,"end":4636.38,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, yep. All right. Well, that was a good. I was going to use the word beefy, but I don't want to tempt anybody. Second week."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4636.38,"end":4636.98,"speaker":"Fr Stephen De Young","text":"Yeah, that's out."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4637.7,"end":4639.86,"speaker":"Fr Andrew Stephen Damick","text":"Holy week for some people listening."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4640.02,"end":4640.74,"speaker":"Fr Stephen De Young","text":"Shrimpy."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4643.52,"end":4657.44,"speaker":"Fr Andrew Stephen Damick","text":"It was not a shrimpy first half. It was a good, solid, mushroomy mud buggy. There you go, first half. And we're gonna go ahead and take our first break. And we'll be right back with the second half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4657.52,"end":4673.53,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-22-346. That's 855-AF-RA."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4696.74,"end":4726.29,"speaker":"Fr Andrew Stephen Damick","text":"Blessed are the legend makers with their rhyme of things not found within recorded time. J.R.R. tolkien. Since the very dawn of humanity, myth, legend and story have communicated history, meaning, identity, and the highest truths about the world, both seen and unseen."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4727.65,"end":4731.25,"speaker":"Fr Stephen De Young","text":"Who are we as human beings? Who is God?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4731.73,"end":4765.42,"speaker":"Fr Andrew Stephen Damick","text":"What is the true shape of our great cosmos? Who are the gods, the heroes, the monsters, the angels, the demons, the spirits that inhabit and touch our world? Both in ancient Israel and from when the Christian church arose in the first century, continuing to our own day, the people of God have not only told their own tales, but also recorded, preserved, rewritten, commented on, and found edification in the great epic tales of the pagan nations."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4767.02,"end":4768.98,"speaker":"Fr Stephen De Young","text":"No less a church Father than St."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4768.98,"end":4772.74,"speaker":"Fr Andrew Stephen Damick","text":"Basil the Great said that the prophet Moses studied Egyptian learning."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4773.3,"end":4776.94,"speaker":"Fr Stephen De Young","text":"The prophet Daniel studied Chaldean lore, and."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4776.94,"end":4783.66,"speaker":"Fr Andrew Stephen Damick","text":"He demonstrated his own extensive familiarity with Greek paganism. Through this, he said, we can trace."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4783.66,"end":4786.9,"speaker":"Fr Stephen De Young","text":"The silhouette of virtue in the works of paganism."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4788.42,"end":4825.4,"speaker":"Fr Andrew Stephen Damick","text":"Have you ever wondered why the ancient myths and legends survived when their religions died out centuries before? Or what shaped Christian monster lore? Or why Saint Paul quoted pagan Greek authors? Or why the legend King Arthur keeps being revived? I'm Father Andrew Stephen Damick. And I'm Richard Roland. In this video podcast, we'll read the myths, we'll recount the legends, and we'll ask how they point us in one way or another to the most High God and to his son, Jesus Christ."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4827.64,"end":4830.28,"speaker":"Fr Stephen De Young","text":"Welcome to the Great tales."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4834.76,"end":4848.93,"speaker":"Fr Andrew Stephen Damick","text":"Coming fall 2024 from Ancient Faith Radio. Subscribe now on YouTube or wherever you get podcasts."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4855.17,"end":4871.33,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick. And Father Stephen DeYoung, if you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4874.86,"end":4910.73,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. I see the call board is lighting up. Yeah, we're going to take some calls when they get slotted in there, but I just want to say we currently have, as far as I'm aware, 11 countries listening right now. So, hello, our fellow Americans, but also, hello, Brazil. Hello, Norway, Sweden, Canada, Mexico, Spain, Canada, United Kingdom, Germany, and Malaysia. That's pretty good. It's pretty good. I don't. We haven't hit. We haven't hit all continents so far yet, I don't think."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4912.09,"end":4914.65,"speaker":"Fr Stephen De Young","text":"Actually, you said Nuckistan twice."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4914.65,"end":4920.01,"speaker":"Fr Andrew Stephen Damick","text":"Did I? Brazil, Norway. Oh, I did. So it's. Yeah. Well, there you go."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4922.89,"end":4926.53,"speaker":"Fr Stephen De Young","text":"I mean, I gave the Kanakistanis a hard time, so maybe it's fine."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4926.53,"end":4936.09,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. Well, some guy claimed earlier that Texas was the greatest country in the world, which I understand how Texans feel about Texas, and that's great. That's lovely."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4936.17,"end":4938.17,"speaker":"Fr Stephen De Young","text":"You could go visit their embassy in London."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4938.33,"end":4948.01,"speaker":"Fr Andrew Stephen Damick","text":"But. But it's like. I mean, that whole thing where they sold their sovereignty to pay off debts. No offense, Texans. I'm just saying."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4948.01,"end":4966.18,"speaker":"Fr Stephen De Young","text":"Well, next you're going to say, the United States isn't a country. Come on, bro. Like, you can't. The night we got political nation states, you know, who needs them? Yeah. Also, you guys aren't gonna play that whole, like, commercial intro at the beginning of every episode, are you?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4966.5,"end":4967.14,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4967.14,"end":4969.62,"speaker":"Fr Stephen De Young","text":"You know. Hey, that's, like, way too long, man."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4969.7,"end":4970.66,"speaker":"Fr Andrew Stephen Damick","text":"Nice long break."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4972.1,"end":4988.94,"speaker":"Fr Stephen De Young","text":"That's, like, way too long. And I. I don't know about this Richard Rehoboth character. You're doing the show, but, like, if people have to sit through that Richard Rare Bowen, they're not going to listen live. They're going to skip ahead, slide that slider right over to the end of the beginning."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4989.02,"end":4990.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4990.78,"end":4992.22,"speaker":"Fr Stephen De Young","text":"They'll listen to it once or twice."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":4992.54,"end":5008.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Anyway. All right. Yes. Okay. Well, let's go ahead and take a few calls. So we have. We have Alex calling. So, Alex, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5010.12,"end":5011.64,"speaker":"Unregistered: David","text":"Thank you. I'm stoked to be here."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5012.12,"end":5019.16,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we are stoked. Likewise to have you. What is on your mind, Alex?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5020.2,"end":5051.94,"speaker":"Unregistered: David","text":"Yeah, well, first of all, I just want to say I super appreciate you guys delving into the Torah. I was Torah observant for part of my life, and since coming into the church, I've really wondered about a lot of these questions and so really appreciate it. I want to bring back what we're learning right now to a point that Father Stephen made in the last episode about the reasoning of St. James and the Council of Jerusalem."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5052.98,"end":5053.94,"speaker":"Fr Andrew Stephen Damick","text":"Acts chapter 15."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5055.38,"end":5126.68,"speaker":"Unregistered: David","text":"Right. So James argument is based upon this distinction between the nations that are coming to worship the God of Israel and the Jewish nation, a difference that seems to persist in his understanding. And for that to make sense, right, like the Jewish nation would need to continue being defined to some degree by its charter in. In their specific obligations according to the Torah. So things like circumcision and even some of the things that we're talking about tonight with respect to the Temple specifically. So I was wondering. I know that a lot of this teaching is geared towards, I think Father Stephen said, we who are Gentile Christians, but there are a lot of Orthodox Christians who, according to that definition of the Torah, you know, came from the Jewish nation, were circumcised, et cetera. And so I was wondering to what degree does this distinction that James identified continue to persist, if not historically, then at least, like, in theory. I'm wondering if you could unpack that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5127.8,"end":5232.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we did talk about that a little bit last time. The first thing that comes to mind to me, and you know, obviously I'm going to ask Father to mostly expand on this because this is based on stuff he said. One is that, you know, in the first century, Acts chapter 15, Jewish Christians living as Jews in community is. Is very much a thing, you know, so it's. It's a live controversy at the time. Right. This is not individual people with Jewish ancestry. This is communities, whole communities of people that are. That are. That have this. This history, this background, this community identity. Right. But one of the other things that I remember you said, Father, and maybe you could expand on this a little bit, is. And this was. This especially was talked about at the end of the episode was that the ways of life that we're discussing are done in community. These are not like, oh, I have some ancestry that is this, or I used to be this. Right? It's whole communities of people. And this is why then you mentioned, for instance, the idea of, like, what if, for instance, there were mass conversions of. Of people in Israel in the modern state of Israel becoming Orthodox Christians, what would their version of Orthodox Christianity look like in terms of the practical observances? You know, would it potentially incorporate some things that other Orthodox Christians are not doing? But ultimately that would kind of be in their hands to work that out as to how that would apply to them. So that was my understanding and takeaway from last time. I don't know, Father, I'm actually me or whatever needs to be done to."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5233.11,"end":5311.03,"speaker":"Fr Stephen De Young","text":"Well, I mean that's kind of the broad strokes, right? I mean just functionally, literally in history, Judea was destroyed by the Romans, right? Not just Jerusalem in AD 70, but after the Bar Kokva rebellion, massive, monstrous, brutal de Judaization project all across Judea. And that ended Jewish Christianity as such, right? That's why there's not a Jewish Orthodox Church. Like there's a Greek Orthodox Church, right? Or, or you know, an Alexandrian or the Church in Egypt, right? That's just functionally why it's functionally what happened. And by the way, there are references to this in our Holy Week books that a lot of I don't care anymore, a lot of wild eyed libs don't understand. In one of our translations it literally says now is the nation of the Jews destroyed? And they get all upset, right? Oh no, antisemitism. And it's like, no, this is talking about a historical fact."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5311.27,"end":5312.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, A historical event."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5312.79,"end":5378.59,"speaker":"Fr Stephen De Young","text":"This is something that historically happened, did occur, right? It's not calling for anything against anyone. It's not. Right. This is talking about what happened, right? And theories about what it was that was done that brought about the judgment of the Romans. Destroying Judea are not a new thing either. So for example, Josephus in one place says he thinks it happened because of Herod killing St. John the Baptist. And another place he seems to suggest, although some people think this is an interpolation, but he at least seems to suggest that it's because they killed St. James, the brother of Jesus on the Temple Mount, right? So that way of thinking is not like an anti Semitic way of thinking. The idea that it might be because of what happened to Jesus, that's not an anti Semitic way of thinking. That's the way Jewish people thought about it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5380.31,"end":5380.51,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5380.51,"end":5439.18,"speaker":"Fr Stephen De Young","text":"Jewish people thought about it. Why is God bringing this judgment upon us? What did we do? And there were suggestions of different righteous people who were murdered, for example, that could have brought about that kind of judgment. And by the way, you see the same kind of thinking from later Orthodox Christians when Constantinople falls. Oh yeah, the writings of monks after it happens are full of, it's because we did this, it's because we did that. That's why God brought this judgment on us. So there's nothing particularly anti Semitic about that. And so just functionally there was under St. James and his immediate successors, essentially what we would today call a Jewish Orthodox Church centered in Jerusalem. That was the mother church for the whole church. In fact, the concept of a mother church developed out of the Jerusalem church."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5440.3,"end":5441.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a lot of hymns."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5441.42,"end":5442.06,"speaker":"Fr Stephen De Young","text":"Sorry, Rome."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5442.94,"end":5445.26,"speaker":"Fr Andrew Stephen Damick","text":"Well, and sorry, Constantinople."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5445.26,"end":5445.74,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5445.9,"end":5450.38,"speaker":"Fr Andrew Stephen Damick","text":"You know, there's a lot of hymns that refer to Jerusalem as the mother of the churches."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5450.78,"end":5451.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5451.22,"end":5456.86,"speaker":"Fr Andrew Stephen Damick","text":"And that's the only. That's the only church that is described in those terms in our liturgical tradition."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5457.18,"end":5498.26,"speaker":"Fr Stephen De Young","text":"Yeah. And that church was destroyed. The Jerusalem Patriarchate is a successor church to that church. It just is. Right. I mean, functionally, all of the bishops from St. James until A.D. 70 were Jewish. In fact, several of them were members of Jesus family like St. James was. And then after that, it's Greek converts. Right. So there is an unbroken apostolic succession in Jerusalem. I'm not saying that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5499.22,"end":5499.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5499.58,"end":5656.32,"speaker":"Fr Stephen De Young","text":"But I'm saying that the character of the church of Jerusalem after AD 70 and before AD 70 is very different. Right. Because those gentile convert successors after A.D. 70 did not continue to practice circumcision, did not continue to keep kosher, did not continue to do the ceremonial washings that St. James did. Right, they didn't, because they're Gentiles. And that was pretty firmly established in the church by that point already that, that even though they were now the Bishop of Jerusalem, that didn't make them Jewish. And so, yeah, the way that that would have to be restored, like Father Andrew said, there would have to be a kind of mass conversion that restored that church as a thing. Right. Individual Jewish people joining the Greek Church, the Antiochian Church, the Russian Church. Right. Very good. Happy when it happens. Right. But one by one, they don't constitute the kind of thing. So in the same way, if there was such a mass conversion like I suggested, could happen in Israel. Right. The Chief Rabbinate, some vast swath of the religious Jews in Israel today were to convert to Orthodox Christianity and sort of reconstitute that church. You'd have a process just like what happened when the Gospel went to Greece or went to Russia or went to where there's sort of a sifting, a transformation, a transfiguration of the culture within Christ and Christianity so that you produce Greek Christianity, Russian Christianity. But in the case of Jewish Christianity being restored, we know that those things, those things that are actually in the Torah, not things that were added later, things that. Other things. Right. But the things that are in the Torah, at least we know for sure, come from God. So it's a lot easier to sift. Right. And so I think that, and I hope it happens someday that if we had those kind of mass conversions from Judaism that the reconstituted kind of Jewish Orthodox Church that would produce would probably be Torah observant. But. But, you know, something they would have."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5656.32,"end":5660.64,"speaker":"Fr Andrew Stephen Damick","text":"To work out for themselves, not a theory that the rest of us say, oh, this is what you should be doing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5660.8,"end":5679.15,"speaker":"Fr Stephen De Young","text":"Right. Yeah, We. The rest of the church would not impose that on them. It would be something they work out and they would have to sift. Right. What if this is actually from the Torah? And what if this is stuff that happened later? What if this is stuff that we added that's kind of anti Christian in nature? Right. That obviously would have to go."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5679.55,"end":5679.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5680.19,"end":5694.51,"speaker":"Fr Stephen De Young","text":"So there would be a lot of things that it isn't. Just like a one for one. Right. Like everything they're doing now would just continue. Right. But I think a substantial recognizable amount that is direct from the Torah would."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5696.59,"end":5697.95,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense for you, Alex?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5703.49,"end":5704.29,"speaker":"Unregistered: David","text":"Yes and no."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5704.61,"end":5705.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes and no."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5705.37,"end":5794.61,"speaker":"Unregistered: David","text":"Honestly. Because I think that. I think that the answer doesn't seem to, at least to me on the face of it, do justice to the sort of mandated nature of what's in the Torah. Right. Like, it doesn't really make sense to me that if you had. And I'm not. It's a good. It's a fair point that Father Andrew made and that you made in the previous episode about there is a difference between people coming in en masse as like a group, as a nation of sorts versus individuals. But I don't know that the argument is true that, like, a. That an individual isn't mandated given certain things. Right. In other words, they're only mandated to do XYZ or keep coast or whatever if they happen to be in a community that's already doing that. But also, B, I don't follow the notion that the church wouldn't provide that instruction. If this line of thought is coming from. Sorry, if the transformation will be coming from the fact that it's mandated in the Torah versus, like, okay, well, this is sort of the character of your nation. Right. So that's where I'm at. But I understand it's not an easy issue and I appreciate the input and the answers."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5795.17,"end":5822.86,"speaker":"Fr Stephen De Young","text":"Let me just throw two quick things that might help with a couple of those things. One is that the Torah is what constitutes them as a nation. That is their identity as a nation. Right. Because it's not. I mean, we have these separate categories. But the Torah is not only religious commandments, it's also their constitution and declaration of Independence. Right. Like that is what makes them a nation."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5823.1,"end":5823.5,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5824.46,"end":5830.06,"speaker":"Fr Stephen De Young","text":"And then the other thing is we have to talk about what makes an individual Jewish."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5832.63,"end":5833.03,"speaker":"Unregistered: David","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5833.59,"end":5847.83,"speaker":"Fr Stephen De Young","text":"Right. And we now have these modern ethnic categories about what makes a person Jewish. Right. So we would understand that a person who's never been in a synagogue in his life."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5848.31,"end":5848.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5849.43,"end":5904.43,"speaker":"Fr Stephen De Young","text":"Has never had any connection to it, isn't circumcised. Right. But he goes and he does 23andMe turns out he's like 85% Jewish. Well, that person is Jewish. Right. But that person in the ancient world would not have been considered Jewish. What would make that person Jewish would be being part of a Jewish community. Right. So identity is not an individual thing. It's a collective thing in the ancient world that the Torah is speaking into. So I don't think the commandments are directed to individuals based on their ethnicity or DNA. I think they're directed. Directed to individuals qua members of a community. So I hope that helps a little bit, maybe in terms of where we're coming from at least. You may still not buy it, but I hope you understand the point we're making."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5905.87,"end":5909.67,"speaker":"Unregistered: David","text":"I appreciate it, and I you guys letting me take so much time. Thank you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5909.67,"end":5920.17,"speaker":"Fr Andrew Stephen Damick","text":"All right, thanks for calling, Alex. We're going to take a couple more calls before we move forward. And we've got Anthony calling. So Anthony apparently has a question about ritual sacrifice. Anthony, welcome to Lord Spirits podcast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5921.05,"end":5922.41,"speaker":"Unregistered: David","text":"Hi. Thank you. Good evening."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5922.73,"end":5923.61,"speaker":"Fr Andrew Stephen Damick","text":"Good evening."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5924.73,"end":5927.93,"speaker":"Fr Stephen De Young","text":"So are you from the northeast of the United States by."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5929.13,"end":5929.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5929.53,"end":5932.01,"speaker":"Fr Stephen De Young","text":"Okay. So is it correctly pronounced Antony?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5933.21,"end":5935.09,"speaker":"Unregistered: David","text":"Anthony? Yeah. Little Anthony."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5935.09,"end":5935.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5935.61,"end":5937.53,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. All right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5937.93,"end":5938.81,"speaker":"Unregistered: David","text":"Or Tony."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5939.21,"end":5939.77,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":5941.69,"end":6037.8,"speaker":"Unregistered: David","text":"So you guys have spoken about death as being sort of incidental in the whole process of the sacrifice and how the sort of. The most. One of the most important aspects of sacrifice and worship is the fellowship meal with God. And I guess I've been thinking about the ritualized aspect of it. The death of the animal is not really ritualized, but the eating doesn't seem ritualized either, compared to, say, like a modern Passover Seder, for example, where it has steps in the meal itself, or even a eucharistic service that has many as a very ordered aspect of the whole meal, if you want to look at the services of the entire meal. Right. Seems to me that the ritual is more about the separation of the animal. It's the separation of the kind of animal and the portioning of how the animal is butchered and things like that. So I guess my question is, can you clarify your argument of what is ritualized or not ritualized? Is or is not important to sacrifice and the worship. And it might be related to what we've been talking about tonight in terms of clean and unclean separation. Does that make sense? I hope it makes sense."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6038.28,"end":6055.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, I mean, one thing I'll just say on his face and you can check this for yourself if you do a, like, just do a word search on the word eat in Leviticus, which it appears a whole bunch of times, actually 78 times in the ESV, because I just checked."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6055.4,"end":6055.71,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6055.86,"end":6101.22,"speaker":"Fr Andrew Stephen Damick","text":"And it constantly references who may eat what, where exactly it must be eaten, and on what times and days and so forth. So, like there's already all of these kinds of sanctifications, that is to say settings apart, going on. Right. So I don't, I. That's clearly ritualization. Right. At the very least. And off the top of my head, I don't remember other details, but certainly like which parts can be eaten, who. Who is allowed to eat which parts. All of that is. Is in there as well. I don't know, Father, is there, is there, are there other details here that are not coming to mind or in my."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6101.3,"end":6147.8,"speaker":"Fr Stephen De Young","text":"Well, yeah, the where and the when that you mentioned in terms of where the priests eat and when and those kind of things and things having to be eaten at certain times and before certain times, but also with. And the portioning, the butchering, which, as you mentioned is highly detailed. Right. That's all about who gets to eat what. Right. Which part gets burned and offered to God that way. And then which parts get eaten by the priests and which parts get eaten by the people bringing the sacrifice. Right. And then which parts are not to be eaten and are to be disposed of. Right. That's all related to eating. But the other big thing to note about killing is a lot of the sacrifices, including a lot of the sin offerings, were wheat cakes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6149.08,"end":6149.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6150.6,"end":6172.37,"speaker":"Fr Stephen De Young","text":"Which, I mean, technically, I guess you're killing the wheat when you pluck it, but I mean, there's drink offerings too. You're stretching to call that killing. Right. But even when you're offering sin offerings. Right. With wheat cakes, again, the concern is who each eats which cake, which ones are burned."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6172.85,"end":6173.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6173.17,"end":6188.29,"speaker":"Fr Stephen De Young","text":"How they're burned, when and where they're burned to offer them to God and then what's eaten by who in terms of. Of the rest of them. So part of the eating thing is that the offerings are not don't always have to be killed, but they are always food."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6189.89,"end":6190.45,"speaker":"Unregistered: David","text":"Yep."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6194.14,"end":6197.02,"speaker":"Fr Andrew Stephen Damick","text":"Does that help? Do we have to pronounce it? Antony."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6198.86,"end":6200.46,"speaker":"Unregistered: David","text":"You can pronounce it however you want."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6200.62,"end":6202.06,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, that's very kind of you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6205.02,"end":6222.48,"speaker":"Unregistered: David","text":"Yeah, I think that helps. And I don't know if that. Yeah, it's interesting, I guess, how even a Passover Seders that the ritual is within the eating itself. It's not just the where and what and who, but it's like the parts of it. Right, okay. The elements in the meal."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6222.72,"end":6223.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6223.08,"end":6224.72,"speaker":"Fr Stephen De Young","text":"And I mean, that developed later."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6225.28,"end":6226.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you got to remember."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6227.36,"end":6234.16,"speaker":"Fr Stephen De Young","text":"And a lot of it developed in reaction to and based on the Christian Eucharist, not vice versa."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6234.64,"end":6302.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's also worth noting that if you were to attempt to reconstruct the ritual life of ancient Israel only by reading exactly what's in Leviticus, I don't think you could succeed in doing it. Right. It's in many cases, it's a kind of outline. So there may well be things going on that are just simply not written there. You know, like, it's interesting, like even in some early Christian texts, sometimes they'll say things like. And this will be in the liturgical text, they'll say. Say something like. And. And the bishop says the usual prayers, you know, so. Which. That doesn't help you if you're trying to reconstruct something out of nothing. So, yeah, I don't think we should assume that everything that they were doing is exactly what's written in Leviticus, because if you just simply do exactly what's there and nothing else, a lot of that would be pretty brief kind of cursory stuff, you know, but it strikes me in a lot of it as being a kind of an outline. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6303.7,"end":6305.46,"speaker":"Unregistered: David","text":"All right, thank you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6305.7,"end":6311.78,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Anthony. All right, well, we're going to take one more call. We have Cade calling. So, Cade, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6313.3,"end":6315.7,"speaker":"Unregistered: David","text":"Hello. Thanks for having me."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6315.94,"end":6316.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6318.5,"end":6326.02,"speaker":"Unregistered: David","text":"Yeah. So I guess I'll just get right to my question then. I was wondering in relation to."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6327.74,"end":6327.94,"speaker":"Fr Andrew Stephen Damick","text":"Death."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6327.94,"end":6375.06,"speaker":"Unregistered: David","text":"By holiness and the idea that's been discussed on podcast of the total freedom of God. So I guess the crux of the question is it seems like God can pick and choose when to apply death by holiness. So I guess I'm just not sure how that process plays out because even in this episode so far, you've mentioned the put the reason for the atonement and things is because of the potential of death by holiness. So I guess I'm trying to understand where the potential crosses over. If that's just something that is like, we. We aren't God, so we don't know, or if there's more kind of going on there."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6376.98,"end":6384.74,"speaker":"Fr Andrew Stephen Damick","text":"All right, it's a good question. What do you think, Father? Yeah. Does God turn the death by holiness on and off at some times? Or what's. What's going on?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6385.05,"end":6519.47,"speaker":"Fr Stephen De Young","text":"Well, so the way it's presented to us in Scripture, which of course is all, you know, that's all we can know about God is what God has revealed about himself to us, Right. Is that the other option? Right. The other thing that can happen for death by holiness to not happen is that God can withdraw. Now, even that's a metaphor, right? Because obviously God isn't like, in one place and he, like, leaves that place. Right? That's not what we're saying. Right. It's a metaphor, sort of analogical language. But it's the difference between the flood and the Tower of Babel, Right. And it's the difference between the destruction of the northern kingdom of Israel and the exile of the southern kingdom, right? So the threat is either Israel gets consumed in its sin or. Or God departs from them. And there are examples of this scripture, obviously, the big one being the exile, right? Ezekiel sees God leaving the temple because of the sins of the people. But we also see it on a personal basis. For example, the Holy Spirit departing from Saul at a certain point in his life, the first king, not Saul of Tarsus, the first king of Israel. So this is the other sort of possibility, right? Now, if the question is why does God sometimes choose to depart and sometimes stays and people die, that's something we can't know, right? But we know that. I mean, both. And we're going to get into here in the, in the second half and the third. The third half, why exactly? God departing is just as much of a threat, right. As. As, you know, him staying and people dying. But. And this is right in, in Psalm 51 or Psalm 50, this is what David is praying, right? Take not your Holy Spirit from me."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6521.53,"end":6521.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6521.69,"end":6524.09,"speaker":"Fr Stephen De Young","text":"He sees after what he's done. Oh, no."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6524.57,"end":6524.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6525.69,"end":6574.34,"speaker":"Fr Stephen De Young","text":"That God could withdraw his spirit from me because of my wickedness and my sinfulness and this blood on my hands. Right. And he prays that that won't happen. Right. He knows he needs to be purified and cleansed and forgiven so that the Spirit of God can remain, can remain with him, Right? So God, yes, has an option there, right. He decides to do one or the other as it's presented to us in the Scriptures, Right. But why he decides one or the other, when and where the details of how that all works, even what exactly it means to withdraw are things we're humans. Right. That we can't fully understand. That's the language we've been given to talk about it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6576.42,"end":6588.82,"speaker":"Unregistered: David","text":"Okay, yeah, that helps a lot because I was thinking of it as you either die by holiness or God does nothing. But that makes much more sense when it's kind of the withdrawal or the death by holiness."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6588.9,"end":6649.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, whatever it is that God does. And I think it's really important to really take this seriously. Whatever it is that God does is the best thing for everyone. Whatever it is he does. Because God is love. Right. So like Ananias and Sapphira, we don't like to imagine that that was the best thing for them, but that was. If we believe that God truly loves, that was the best thing that could happen for them. Now God knows way more about what would have happened had that not happened to them. What, you know, what their lives would have been like after that, we do not know. We could only speculate. But God is doing exactly the best thing for everyone involved. Always. Always. So, anyway. All right, thank you very much, Cade. We're gonna go ahead and move on."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6649.25,"end":6652.69,"speaker":"Fr Stephen De Young","text":"Get off of Mars. Sorry. Wrong."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6656.81,"end":6658.33,"speaker":"Fr Andrew Stephen Damick","text":"I don't even know what to do with this guy."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6660.49,"end":6662.17,"speaker":"Fr Stephen De Young","text":"Fairly part of the movies. I don't know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6662.17,"end":6662.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6664.97,"end":6666.33,"speaker":"Fr Stephen De Young","text":"I seem to have seen them all."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6666.89,"end":6668.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6669.53,"end":6675.13,"speaker":"Fr Stephen De Young","text":"So, yeah. So now, second half. I think this is the latest we've ever started. A second half."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6675.45,"end":6676.81,"speaker":"Fr Andrew Stephen Damick","text":"Could be. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6676.81,"end":6678.53,"speaker":"Fr Stephen De Young","text":"We're in for it, guys. Buckle up."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6678.53,"end":6679.61,"speaker":"Fr Andrew Stephen Damick","text":"A lot of sleep tonight."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6682.06,"end":6682.26,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6682.26,"end":6684.06,"speaker":"Fr Andrew Stephen Damick","text":"This one we're talking about worship. We're talking about."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6684.06,"end":6686.7,"speaker":"Fr Stephen De Young","text":"Hope you brought some potato chips. Yeah. We're gonna start talking about."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6687.66,"end":6691.5,"speaker":"Fr Andrew Stephen Damick","text":"Unmute. Mute your mic when you put in the potato chips, though, please, if you don't mind."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6691.58,"end":6699.18,"speaker":"Fr Stephen De Young","text":"I'm not eating potato chips. I was saying that I hope our listeners brought snacks for this long journey on which they have embarked."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6699.5,"end":6701.26,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay, okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6701.42,"end":6704.94,"speaker":"Fr Stephen De Young","text":"If they're baked right, then they're kind of legit. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6704.94,"end":6727.63,"speaker":"Fr Andrew Stephen Damick","text":"Well, we just had someone in the chat say, like, you know, continuing, because I guess this is a thought experiment that people love. It's interesting. You know what? If there were a Jewish community of Orthodox Christians, someone asked the question, like, wait, how could they actually completely follow the whole Torah because there's no temple? How would they offer animal sacrifices? Well, buckle up. Welcome to the second half."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6727.95,"end":6729.95,"speaker":"Fr Stephen De Young","text":"You're tracking. Yeah, Here we go."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6730.19,"end":6731.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6731.19,"end":6731.55,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6731.95,"end":6775.4,"speaker":"Fr Stephen De Young","text":"So when we're talking about worship scripture and so we're focusing here on the Torah, right? Worship of the Torah, we have to talk about worship space. We have to talk about dedicated places of worship because that's the only kind of worship there is in the Torah. So I have. We have to say sorry to some of, not all, but some of our Protestant friends who want to insist that the church is not a building or the church didn't have buildings and etc. Etc. Etc. That's just not accurate. There were dedicated spaces of worship at the same. Whether we're talking about the patriarchs in Genesis building altars in particular places."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6775.88,"end":6778.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They didn't just pull out their kitchen table."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6779.88,"end":6780.24,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6780.24,"end":6781.48,"speaker":"Fr Andrew Stephen Damick","text":"Or their coffee table."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6781.64,"end":6792.65,"speaker":"Fr Stephen De Young","text":"And they didn't just build a different one every time they made a sacrifice. Right. They build an altar at a place because they had an encounter with God there and that. That became a holy place, a sacred place, a place of worship. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6792.73,"end":6793.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6793.45,"end":6866.37,"speaker":"Fr Stephen De Young","text":"And then of course, this becomes super obvious when we get to the Torah itself being given, because huge focus of a massive part of Exodus is the building of the tabernacle, the Leviticus, the dedication of the tabernacle. And as we've just talked about, maintaining the purity of the tabernacle. Right. And then of course, the temple, which is a dedicated place where God is worshiped, and that's all that happens there. And it's built in a particular way, structured and designed in a particular way, based, as we've talked about before, on the heavenly sanctuary into which Moses entered on the top of Mount Sinai. See Hebrews. Right. So worship is at a particular place, constructed, dedicated, set up for that purpose in the Torah. That's how worship works. Now, that said, that said, there is also obviously still space within the Torah, Right. For what we might call a home altar."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6867.66,"end":6867.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6867.86,"end":6981.51,"speaker":"Fr Stephen De Young","text":"In. In later times would be around the hearth, but prayer, Right. And, you know, the, the singing and recitation of psalms, these kind of things taking place in the home on the road, during life. Right. So it's not that like. Right. None of that was allowed outside temple or the tabernacle. Right. Like you're, you're not allowed to sing like Psalm 23 while you're working your field. Right. Or you're not allowed to pray with your family. Right. But particular elements of worship, particularly offerings, sacrificial offerings, were restricted to a particular place at a particular time. And this is a product, as we've talked about before, and we won't go into all this again, but a product of the split between the father, the head of the household and the priesthood that happens with Moses and Aaron and then with the Golden Calf, with the Levites. Right. But even Though, again, these particular types of worship are restricted to being administered by this particular priesthood in a particular place, a particular time. There are still elements of priesthood that still fall within the father's head of the family, leading in prayer, these other kind of activities. Right, yeah. So the first commandment about worship in the Torah has to do with. With morning and evening worship in the tabernacle in the book of exodus."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6983.83,"end":6984.39,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6988.71,"end":6990.23,"speaker":"Fr Stephen De Young","text":"Chapter 30, to be specific."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":6994.55,"end":7082.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Sorry. Your volume was kind of jumping up and down there for a second. I was like, is something going wrong with him? Is it. Are we back to season one, so to speak? Anyway. Yes. Yes. I need the Mexican radio back. Yes. Exodus chapter 30, verses 1 through 8. You shall make an altar on which to burn incense. You shall make it of acacia wood. A cubit shall be its length and a cubit its breadth. It shall be square, and two cubits shall be its height. And just as a comment, everybody, cubit is the space between your elbow and, like, the end of your fingers. So it's about a foot and a half, roughly. Two cubits shall be its height. Its horns shall be of one piece. With it, you shall overlay it with pure gold, its top and around its sides and its horns, and you shall make a molding of gold around it. And you shall make two golden rings for it. Under its molding, on two opposite sides of it, you shall make them. And they shall be holders for poles with which to carry it. You shall make the poles of acacia wood and overlay them with gold. And you shall put it in front of the veil that is above the Ark of the Testimony, in front of the Mercy seat. Well, we know what that means. The lid. The lid that is above the Testimony where I will meet with you. And Aaron shall burn fragrant incense on it. Every morning when he dresses the lamps, he shall burn it. And when Aaron sets up the lamps at twilight, he shall burn it. A regular incense offering before the Lord throughout your generations."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7084.28,"end":7137.27,"speaker":"Fr Stephen De Young","text":"Right? So this is our first and most basic pattern of worship. The offering of incense with prayers at the trimming of the lamps in the morning, meaning sunrise, and the lighting of the lamps in the evening at sunset. This becomes the pattern for. Right. As in the Orthodox Church, the matins and vesper services, the orthros and vesper services, where incense is offered with prayers at the lighting of the lamps at sunset and the trimming of the lamps at sunrise. So sometimes when I bring this up. Right, because, of course, we should worship God in the way he has told us to worship Him."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7137.84,"end":7138.08,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7138.48,"end":7201.87,"speaker":"Fr Stephen De Young","text":"Not in some other way that we invent, people will say, well, that's the Old Testament. It's like, yes, that is the Torah. That is exactly where that comes from. But here's the thing. When we get to the New Testament, if you ask me, where does it say we should stop offering animals as sin offerings? Right. Or where does it say we should stop celebrating the day of atonement? Or where does it say that Gentile Christians don't need to keep kosher? Or any of these other things where there's some kind of disjunction in the way in which the Torah's commandments are fulfilled in the new covenant? I can point you to those things in the New Testament. Right. Can you point me to where in the New Testament it says stop offering incense at morning and evening? Where God says, oh yeah, I don't want you to do that for me anymore. For reasons."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7202.27,"end":7205.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not a thing to do with Christ."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7205.39,"end":7211.31,"speaker":"Fr Stephen De Young","text":"I guess you have to have something to do with Christ. Those reasons why we don't offer incense anymore, but I'm at a loss."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7211.79,"end":7220.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's a bunch of details about worship that are clearly transformed, altered, whatever, but this isn't one of them."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7220.63,"end":7222.31,"speaker":"Fr Stephen De Young","text":"Yeah. When that happens, we're told."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7223.19,"end":7223.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7224.31,"end":7225.43,"speaker":"Fr Stephen De Young","text":"The apostles tell us."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7225.51,"end":7237.19,"speaker":"Fr Andrew Stephen Damick","text":"Right. And we know that historically, incense continued to be offered morning and night. It just is a thing. There's never a point in the history of Orthodox worship where you don't have that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7237.59,"end":7244.76,"speaker":"Fr Stephen De Young","text":"Right. It never stopped. And that's related to the fact that we're never told it should. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7244.76,"end":7245.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7245.92,"end":7269.68,"speaker":"Fr Stephen De Young","text":"So the only reason to think that this commandment would still apply in terms of how God wants to be worshiped would be if you start with the presupposition that Christianity is this new religion that starts in the New Testament. And so everything in the Old Testament is irrelevant."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7270.04,"end":7272.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That it has to be sort of constructed from the ground up."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7272.6,"end":7295.77,"speaker":"Fr Stephen De Young","text":"Right. And so only things in the New Testament are relevant. Right. And while there may be certain segments of the self identified Christian world who like to do that. Well, Jesus didn't say anything about blank. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7295.77,"end":7296.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7296.69,"end":7309.49,"speaker":"Fr Stephen De Young","text":"If you, if you say the only things that are sins are things that Jesus specifically mentioned as being sins. Right. You're going to end up with a weird moral code."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7309.73,"end":7310.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7310.21,"end":7312.21,"speaker":"Fr Stephen De Young","text":"Well, if you leave out the rest of the Bible."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7312.53,"end":7314.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's. Right, yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7314.85,"end":7392.63,"speaker":"Fr Stephen De Young","text":"There's a lot of things he didn't mention that are really bad. Right. That he didn't feel the need to specifically mention. Part of the reason is as we said last time, Christ is all the time talking about applying the Torah. He assumes you're familiar with it. St. James, in his letter telling the Gentiles they only had to keep those four commandments, says in the same letter, Moses has been preached in every place, in the synagogues. He's assuming everyone's familiar with the Torah. Right. He sees that as relevant. If St. James was constructing a new religion, why would he say that? Why would that be relevant? So clearly that is a false premise and just a plain reading of the Scriptures tells us that the most basic structure of our worship of God should be the offering of incense at morning and evening with prayers. Right. And of course, in explaining how prayer works, prayer is compared to incense in the Old Testament."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7392.79,"end":7404.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In Psalm 140, 141, depending on which version. Verse 2, which you come to vespers. This is one of the psalms you'll hear. Let you know, Let my prayer arise in thy sight as incense."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7405.83,"end":7444.07,"speaker":"Fr Stephen De Young","text":"Right. And so since the offering of incense could only take place at the tabernacle or the temple. Right. In the Old Covenant, the pattern nonetheless began of morning and evening prayer in the home. Right. So morning and evening prayer in the home is derivative of the morning and evening offering of incense, not vice versa. So matins and vespers, Orthodox and vespers do not come from, hey, we're all going to say our morning and evening prayers anyway. Let's just all get together and do it together. It's the opposite."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7445.19,"end":7445.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7445.67,"end":7672.82,"speaker":"Fr Stephen De Young","text":"The offering of incense with prayers takes place, and those who aren't able to participate in it pray at home as a means of participating in it when they're not able to gather together. So that's the most sort of basic structure of worship. The next structure up, of course, is then going to be sacrifices. More broadly, the offering of incense is a type of sacrifice. The same language is used of it in terms of being a pleasing aroma in God's nostrils that's used of the burning of offerings to him and sacrifices. And in the same way that the blood that is the product of the sacrificial animal is used for cleansing and purification, the smoke that comes from the burning incense is used for cleansing and purification. So the daily sacrificial cycle took place. Sacrifices every day, whole structure of sacrifices, including sin offerings, grain offerings, drink offerings, was happening every day in the temple until its destruction. And as the Book of Acts shows us that we've talked about on the show before, to some controversy, Christians continued to participate in that up until the temple was destroyed. And at that time, right at that time, until the Temple was destroyed, functionally for Christians, the Eucharist was functioning as an additional sacrificial offering by the Christian community. When it met on the Lord's Day, they would go to the synagogue on the Sabbath and then they would gather together to celebrate the Eucharist just as Christians on the Lord's Day. And so the Eucharist that was offered, there was a new sacrificial offering with a new priesthood, a new priesthood appointed to administer that particular sacrifice, not the others. Then he'd go to the temple to do the others. And as Hebrews points out, those doing the sacrifices in the temple who weren't Christians couldn't come and eat from the altar of the Eucharist because this is a new priesthood with a new sacrifice received from Jesus the Messiah. And that sacrificial offering of the Eucharist. See our Eucharist episode for this in much more detail, but very short version. Is a means by which those eating it participate in Christ's sacrifice in his self offering, which happened at one point in history, but we come to participate in it ritually within the Eucharist. And so Christ's sacrifice, self offering of Jesus the Messiah fills the sacrificial system full fulfills it because it does what those daily sacrifices did, but does it once and for all. And so when the temple is destroyed and those daily sacrifices cease pretty much immediately, the Eucharist starts to be offered daily. Right. Christians don't miss a beat on that. Right. And in fact, you will find the early Christians writing, well, yeah, the temple's gone, but we didn't need it anymore anyway. Right. Because Christ has done what those offerings did."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7673.38,"end":7696.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this idea that some people have like, oh, that temple has to be rebuilt in order for, I don't know, whatever to happen. It depends on what kind of dispensationalist you are. I guess that's just not a thing in early Christianity. Like there's never a sense of we need to retake Jerusalem so that we can rebuild that temple and start putting bulls and goats and sheep up on the altar again."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7697.27,"end":7697.47,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7697.47,"end":7705.11,"speaker":"Fr Stephen De Young","text":"And it wouldn't be a thing. To answer the question from comments, it wouldn't be a thing for a Jewish Orthodox Church either."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7706.15,"end":7710.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yep."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7710.23,"end":7723.28,"speaker":"Fr Stephen De Young","text":"Right. Because they would have embraced Jesus as their Messiah. Right. And would be participating in the self offering of the Messiah in the Eucharist. Right. So they would not bring those back."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7723.76,"end":7724.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7724.2,"end":7743.04,"speaker":"Fr Stephen De Young","text":"And that's not a big deal, by the way, to Most Jewish people, the people dragging the genetically engineered red cows around Jerusalem right now are a weird fringe group. That is not mainstream Judaism. Most religious, pious Jews think that's ridiculous."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7743.6,"end":7744.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7745.28,"end":7749.92,"speaker":"Fr Stephen De Young","text":"Okay. Yeah. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7751.04,"end":7753.52,"speaker":"Fr Andrew Stephen Damick","text":"But I love a good red heifer cult."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7753.92,"end":7762.08,"speaker":"Fr Stephen De Young","text":"Yeah. But one more bit before we leave this. And I know we've talked about this on the show before, but every episode is someone's first, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7762.08,"end":7762.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7763.12,"end":7806.21,"speaker":"Fr Stephen De Young","text":"And so there may be somebody out there who. Especially if they're not Orthodox or Roman Catholic, meaning if they're one of our Protestant friends or someone else might have gotten caught up on the whole idea that the Eucharist is a sacrificial offering. Right. Because some of the Protestant reformers explicitly say it isn't. Some say explicitly it is, but some say it isn't. Right. So there are segments of Protestantism that would take great issue with that. Others that would just find it foreign and a weird concept. But St. Paul, in First Corinthians 10, verses 14 through 22. There is no way around this in the text."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7806.69,"end":7807.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7807.09,"end":7810.85,"speaker":"Fr Stephen De Young","text":"There's no way around this in the Greek text. He says the Eucharist is a sacrifice."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7810.93,"end":7887.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you have to understand what a sacrifice is. It's a shared meal with your God. That's key to understanding why this is the case. Okay. So first Corinthians 10, 14, 22. We've probably read this 10 times on this show, but it is worth hearing again. Therefore, my beloved, flee from idolatry. I speak as to sensible people. Judge for yourselves what I say. The cup of blessing that we bless, is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ? Because there is one bread. We who are many are one body, for we all partake of the one bread. Consider the people of Israel are not those who eat the sacrifices participants in the altar. What do I imply, then? That food offered to idols is anything, or that an idol is anything? No. I imply that what pagans sacrifice, they offer to demons and not to God. I do not want you to be participants with demons. You cannot drink the cup of the Lord and the cup of demons. You cannot partake of the table of the Lord and the table of demons. Shall we provoke the Lord to jealousy? Are we stronger than He? I love those good rhetorical questions. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7889.51,"end":7898.47,"speaker":"Fr Stephen De Young","text":"You may have heard, all through there, Participation, Participants, partake. Participate. Right. That's all the same word in Greek."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7898.87,"end":7902.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then even at the end, you get that parallel, cup of the Lord. Cup of demons."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7902.47,"end":7902.87,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7902.87,"end":7904.47,"speaker":"Fr Andrew Stephen Damick","text":"Table of the Lord, table of demons."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7904.87,"end":7906.83,"speaker":"Fr Stephen De Young","text":"Kydaniyah all the way through. Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7906.83,"end":7907.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7907.75,"end":7931.19,"speaker":"Fr Stephen De Young","text":"So verse 18, he talks about those who eat the sacrifices on the altar at the temple in Jerusalem. Then he talks about the sacrifices that are offered on pagan altars to idols and thereby to demons. And then he talks about the Eucharist, and he explicitly says all three of those are functioning the same way."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7931.69,"end":7934.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The difference is who you're in communion."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7934.01,"end":7947.13,"speaker":"Fr Stephen De Young","text":"Right. Who you're in communion with. Right. So there's just no way around it. He says it's a sacrifice. He says it does what sacrifices do. It works the way sacrifices work."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7947.61,"end":7963.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is one of the big transformations that happens in applying the Torah. Right. The sacrifices of the Torah get summed up in, subsumed into and expanded, frankly, in the Eucharist."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":7964.34,"end":8010.06,"speaker":"Fr Stephen De Young","text":"Right. Filled up to overflowing, filled full, fulfilled. Right. Not done away with. Right. They are encapsulated. And I mean, just think about it. You've got a grain offering, you've got a drink offering, you've got a thank offering. It's a sin offering. Right. It's not that those are all done away with and replaced. Right. It's that those are all summed up in the one offering, ultimately, the one offering of Christ in which the Eucharist is a participation. So then finally, in addition to those sort of daily sacrifices, then the daily worship with the offering of incense and that kind of thing, there's the cycle of feasts."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8011.02,"end":8020.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is another one that we get a lot of questions about people like, well, why don't we do this feast? Why don't we do this feast? And actually, 75% of those questions are, we do that feast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8022.62,"end":8029.74,"speaker":"Fr Stephen De Young","text":"Yeah. You may not have understood a feast that we do properly to see the connection. And sometimes our translations don't help, but."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8030.46,"end":8031.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8032.86,"end":8038.68,"speaker":"Fr Stephen De Young","text":"So there are some where there's an obvious and very direct correspondence. Right. So Pascha."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8039.08,"end":8040.4,"speaker":"Fr Andrew Stephen Damick","text":"Passover. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8040.4,"end":8042.28,"speaker":"Fr Stephen De Young","text":"Right. Is the Greek word for Passover."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8042.68,"end":8065.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's Easter is the Christian Passover. So I don't want to be mean here, but I know of Protestants who love, you know, elements of Jewish tradition they've encountered, and they will celebrate Passover and then they will celebrate Easter. It's like it's. It's. You're doing Passover and then you're doing Passover."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8066.47,"end":8070.95,"speaker":"Fr Stephen De Young","text":"Yeah. You're doing the Jewish Passover and then the Christian Passover, and you're not even Jewish."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8072.39,"end":8075.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8075.15,"end":8082.23,"speaker":"Fr Stephen De Young","text":"They're sort of trans Jewish, I think. Is that rude referring to, like, Hebrew Roots, people as trans Jewish."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8082.55,"end":8083.27,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8083.99,"end":8095.09,"speaker":"Fr Stephen De Young","text":"And then, like, actual Jewish people. Are CIS Jewish. Am I canceled now? Am I canceled now? Fully canceled."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8095.49,"end":8097.41,"speaker":"Fr Andrew Stephen Damick","text":"People scratching their heads in 10 countries."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8099.09,"end":8107.53,"speaker":"Fr Stephen De Young","text":"All right, Have I put my finger on something? Should I take it off? Okay, so Pentecost. Pentecost is."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8107.53,"end":8108.13,"speaker":"Fr Andrew Stephen Damick","text":"Pentecost."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8108.29,"end":8110.61,"speaker":"Fr Stephen De Young","text":"Yes, Pentecost, the feast of weeks."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8110.77,"end":8111.33,"speaker":"Fr Andrew Stephen Damick","text":"Same thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8111.33,"end":8115.81,"speaker":"Fr Stephen De Young","text":"More direct correspondence with Pentecost. And we talked about that some more a couple episodes ago."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8116.05,"end":8116.93,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8117.01,"end":8147.66,"speaker":"Fr Stephen De Young","text":"In the Len episode, the indiction. Right. Ecclesiastical new year, September 1st in the Orthodox Church, right around Rosh Hashanah, the Feast of Trumpets, the new year. Yep. Right. There's a direct carryover. You read the hymnography and everything and the related iconography. There's direct carryover. Little more sub rosa, a little less obvious. The transfiguration in the Feast of Booths."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8148.22,"end":8151.82,"speaker":"Fr Andrew Stephen Damick","text":"Which, if you read the text in the Gospels, it's happening during that feast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8152.46,"end":8164.54,"speaker":"Fr Stephen De Young","text":"Right. And of course, St. Peter famously says, let's make three booths. Did I just ruin the word booths for everyone by pronouncing?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8164.54,"end":8170.94,"speaker":"Fr Andrew Stephen Damick","text":"No. I mean, you know, some people like voiced fricatives, some people prefer unvoiced fricatives. You know, whatever."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8171.69,"end":8184.89,"speaker":"Fr Stephen De Young","text":"I think you need to watch your language on Christian radio, my friend. Anyway, so then maybe even more indirect. Right. Is the connection between theophany and Hanukkah, the Feast of Lights element."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8185.69,"end":8186.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8186.97,"end":8189.61,"speaker":"Fr Stephen De Young","text":"If you're not the most significant element of theophany."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8189.61,"end":8219.81,"speaker":"Fr Andrew Stephen Damick","text":"But no, Right, right. If you read. Read the theophany texts, the actual hymns closely and think about Feast of Lights and you'll start to see it. And actually, indeed, like, if you look in the Manean, it refers to theophany sometimes in, like, the rubrics, as the Feast of lights. It calls it that. And there's. There's, you know, dedication of temple stuff going on in there and all that. All that sort of thing as well. Yeah, yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8221.17,"end":8300.7,"speaker":"Fr Stephen De Young","text":"So, yeah. So. But then there are other things, right? So there are other things in the Hebrew Bible of the Old Testament. There are obviously other feasts in the church historically that don't quite match up with each other so neatly. Right. And so part of what we have to understand is a, Is the principle that's set out in the Torah, and then that's followed through the rest of the Hebrew Scriptures and then continues to be followed in the church, and that is that when there is a new act of God, particularly a redemptive or salvific act of God that takes place, there is a new feast that comes into being to commemorate it. Right? So one example, Purim in Esther, right? The people of Israel, well, the people of Judah who are still in Persia are right. And those returning to Judea are delivered, are saved through Esther. And there is this new holiday, Purim, Hanukkah that we already mentioned, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8300.78,"end":8305.36,"speaker":"Fr Andrew Stephen Damick","text":"So these are not feasts of the Torah. These are things that come later, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8305.76,"end":8368.7,"speaker":"Fr Stephen De Young","text":"And so in the same way that we saw that these sort of new acts of God like Christ's death and resurrection sort of subsumes and fulfills what happened at the first Passover. The delivery from slavery in Egypt, right? The passing from death to life. We've talked about that on the show before, right. There are also these new acts of God which get their new feasts. So events in the life of the Theotokos, like the Annunciation that we just celebrated and that our old calendar friends will be celebrating in a couple of weeks and events related to the life of St. John the Forerunner, right. So these new acts of God develop these new feasts and that has continued later into church history like the Feast of the Protection of the Theotokos and the Feast of the Exaltation of the Cross, right. Because of course God has continued to act in history. He didn't just stop when the last apostle died, right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8369.98,"end":8371.98,"speaker":"Fr Andrew Stephen Damick","text":"New stuff has come to light, dude."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8372.46,"end":8417.41,"speaker":"Fr Stephen De Young","text":"Right. And so just as we see this principle of the acts of God, starting with the Passover being commemorated, right? Meaning remembered together, meaning made, present again together ritually, right? That begins with Passover, the other feasts of that of the Torah, right? That isn't taken to then just be okay, well now God is done acting. And so those are the feasts and that's it. As the Hebrew scriptures continue, as the history of God's people continue, use that same principle is applied to add new feasts. The same thing continues in the church."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8419.65,"end":8420.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8420.77,"end":8423.17,"speaker":"Fr Stephen De Young","text":"And when we come back, people get killed."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8426.05,"end":8431.57,"speaker":"Fr Andrew Stephen Damick","text":"Death, destruction. On the third half of the Lord of Spirits podcast. We will be right back."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8431.97,"end":8448.22,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8455.18,"end":8507.32,"speaker":"Fr Stephen De Young","text":"Forge enduring connections with Orthodox brothers. Strengthen your faith, be encouraged and challenge yourself at the first ever ancient Faith Men's Retreat. The retreat features four engaging speakers, daily services and Sunday divine liturgy, fellowship with like minded Orthodox men and more at the beautiful Antiochian Village Conference center in Bolivar, PA. Thursday, August 22 through Sunday, August 25. Speakers include Hiramunk Basil of Holy Cross Monastery in Wayne, West Virginia, Father John Strickland, author of the paradise and Utopia book series, Father John Oliver, the host of the AFR podcast Hearts and Minds, and Father Michael Marcantoni, priest at St. John Chrysostom Orthodox Church in Nashville, Tennessee. For more information and to register, please visit store.ancientfaith.com events."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8513.09,"end":8529.01,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8530.21,"end":8541.95,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. Before we get to all that death and so forth, we do have a caller who has been very patiently waiting since the beginning, beginning of the second half. And this is one of our Canadian friends."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8541.95,"end":8543.71,"speaker":"Fr Stephen De Young","text":"So waiting in the waiting room because."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8543.79,"end":8546.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, indeed. So, David, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8548.99,"end":8551.15,"speaker":"Unregistered: David","text":"Hello, Fathers, how are you?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8551.63,"end":8552.51,"speaker":"Fr Andrew Stephen Damick","text":"Good. How are you?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8554.19,"end":8587.29,"speaker":"Unregistered: David","text":"Good. Longtime listener and first time caller and it's, it's an honor. So I'll get to my question. I'm just wondering is there an origin story for our Orthodox fast? Like, for example, like who started it and did they believe that we were under the rule of law? And the reason I asked that is kind of a two part question. So the reason I'm asking is because in my church we're actually not allowed shellfish during, throughout the year even, you know, so. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8587.69,"end":8590.97,"speaker":"Fr Andrew Stephen Damick","text":"So. So tell me about your church that you're not allowed shellfish."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8591.29,"end":8595.05,"speaker":"Fr Stephen De Young","text":"Speaking as someone who now lives in Louisiana, this is grave apostasy."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8600.04,"end":8614.92,"speaker":"Unregistered: David","text":"So I know Father Andrew, you'd be familiar with us. We're Russian Old Believers. And because I think you did an interview with Father Pimin Simon from Pennsylvania from that church."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8615.96,"end":8617,"speaker":"Fr Andrew Stephen Damick","text":"I love him."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8618.12,"end":8632.94,"speaker":"Unregistered: David","text":"Yeah. Yeah. He's pretty good guy, too. And so, yeah, I guess we're kind of, I don't know, that's, that's kind of like we're, we don't do any services in English. So we are kind of more, a little bit more old school. We'd be called the priestless."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8633.5,"end":8637.22,"speaker":"Fr Andrew Stephen Damick","text":"So Bezpopopsi. I'm sure I'm mispronouncing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8637.22,"end":8639.5,"speaker":"Unregistered: David","text":"Yeah, exactly."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8639.5,"end":8640.62,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I was pretty close."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8641.74,"end":8675.19,"speaker":"Unregistered: David","text":"Yeah. Yeah. So we don't, it's, it's old church Slavonic is what we, what we're under. Right. Like, so that's, that's our, how our services are done in church and everything. So. But yeah, I'm just curious like, like I couldn't find anything on, like, who started our. Our fast and, like, say, our great length right now, for example, or, like, for. For. And like, did they believe. Was it a group of people and did they believe that we were under the law? Because, you know, that's kind of my basic question of the. Yeah, there."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8675.19,"end":8686.35,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, you know, I mean, this is a fascinating. This is a fascinating question which I do not know the answer to, too. So I'm just going to speculate a little bit. Okay, so this is just pure speculation on my part."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8686.51,"end":8687.15,"speaker":"Fr Stephen De Young","text":"This should be."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8688.59,"end":8720.43,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, it's true, right, that shellfish are forbidden under kosher. And we've talked a little bit about kosher and clean and unclean and that kind of thing. But it's also true that. And this is news to me, like, I didn't know this detail about Old Believers as far as I know. At least. No mainstream Orthodox tradition forbids selfish even during fasts. Like, it's not something that you need to fast from, generally speaking. Right, okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8720.43,"end":8724.95,"speaker":"Unregistered: David","text":"Well, it doesn't date back to Russia, like to the 1600s."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8725.19,"end":8725.75,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8725.75,"end":8728.19,"speaker":"Unregistered: David","text":"We've kind of kept our way for a long time."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8728.19,"end":8792.45,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, yeah, I know. I mean, I do know the general story about the Old Believers, where, you know, where that comes from and so forth. But yeah, it's interesting to me that this would be forbidden in the Old Believer tradition or traditions, I mean, because there's a lot of groups, Right. And I wonder about that, like, well, number one, for your average Russian Orthodox Christian in the 17th century, how often is shellfish actually going to be available to him anyway? Right? I don't know. Maybe some coastal living ones it would be. I have no idea. But maybe. But I imagine for most of them, probably not. It wouldn't even be around. Although, I mean, maybe there's some kind of crayfish in the streams of Russia that I've never heard of. I don't know. It's entirely possible because, again, I don't know anything about these things, but, yeah, I don't know. I mean, do you have any ideas about this? You know, you just know that this is your practice, right? I'm asking."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8792.45,"end":8793.37,"speaker":"Unregistered: David","text":"Are you talking to me?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8793.69,"end":8799.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yeah, I want to know. Yeah, I'm sorry, I know you called it with your question, but I have questions. Questions for you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8801.67,"end":8823.99,"speaker":"Unregistered: David","text":"No, sorry, I have no idea. And I'm like, that's just a question I've always had. So it's more like if I can generalize, like, even if we could just move away from My church even, like. And we just say, like, who created the whole fast, the way it's done? Right. Like, do you know answer anything like that?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8824.23,"end":8828.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, go ahead, Father. Yeah, that I do know something about, but I know you do too."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8828.42,"end":8834.94,"speaker":"Fr Stephen De Young","text":"Father, is the shellfish thing the only difference you know about? Before I go further."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8836.94,"end":8839.58,"speaker":"Fr Andrew Stephen Damick","text":"Like, and is it generally forbidden?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8840.94,"end":8841.42,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8841.42,"end":8847.5,"speaker":"Fr Andrew Stephen Damick","text":"And I just want to ask, is it generally forbidden? Like you never have shellfish or is it only forbidden during fasts?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8848.06,"end":8853.81,"speaker":"Unregistered: David","text":"No, like throughout the year, like you can't have shellfish and I think ever. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8853.97,"end":8854.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8854.85,"end":8858.17,"speaker":"Unregistered: David","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8858.17,"end":8858.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8858.49,"end":8860.73,"speaker":"Unregistered: David","text":"Like we eat pork. Right? So I don't know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8860.73,"end":8866.05,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, that's what, that's what I was getting at. Is this a one off or is it. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8867.09,"end":8869.13,"speaker":"Unregistered: David","text":"So it's not the whole Torah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8869.13,"end":8879.1,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. We did. We did an episode in terms of the origins of Lent as such. We did an episode a couple episodes back called the Season of Virtue that sort of talks about that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8879.34,"end":8879.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8880.3,"end":8899.9,"speaker":"Fr Stephen De Young","text":"The Wednesday and Friday fasts go back into pre Christian Judaism in a form so that as far as we could tell, I mean, this. What I say, as far as we could tell is apostolic. Like, there are atheists who would agree with me that fasting on Wednesday and Friday is apostolic."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8899.98,"end":8900.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's in the. The."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8900.94,"end":8932.44,"speaker":"Fr Stephen De Young","text":"The key or it's in the. What everybody else calls the D K. So trans Greek over here now, but so you're not passing Father Andrew. Anyway, so. Yeah, and what it explicitly says in the DDK is it mentions that it was moved by the Christians to Wednesday and Friday so they would not be fasting with the hypocrites, meaning the Pharisees. Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8933,"end":8933.56,"speaker":"Unregistered: David","text":"Okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":8933.72,"end":9028.36,"speaker":"Fr Stephen De Young","text":"So the Pharisees had had two days a week when they fasted. I think it was Monday and Thursday. And so that gets moved to Wednesday and Friday by Christians. Right. So that's the fasting part. Right. But if this is throughout the year, that it's not just a fasting discipline, but in general, in terms of what we fast from, it is the things that at the time were considered to be sort of the delicacies, like the stuff that made food good and rich. Right. And yeah, as controversial as this is, since my metropolitan has said something similar recently, I feel like I could get away with this one, unlike everything else I've said tonight might need some reconsideration in our modern world. Right. Because like a fast where you could eat lobster but not like a cheap chicken sandwich seems like an odd thing to me. If you're trying to avoid delicacies, right? So at that time, right, shellfish was considered kind of garbage, right? Like you would go out fishing and you'd catch all this other garbage in your net, right? And so sort of like, well, you can't eat the good fish. You can eat that other stuff. Right? And then, you know, enterprising Greeks learned how to cook calamari and stuff to make it appetizing. Right?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9028.84,"end":9030.04,"speaker":"Fr Andrew Stephen Damick","text":"Thank God for them."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9032.68,"end":9073.07,"speaker":"Fr Stephen De Young","text":"Right? But so my thought might be, and thinking about Russia, thinking about things like caviar, right, that maybe a lot of that seafood was considered kind of a delicacy and kind of decadent culturally during that formative period for the old believers. And so since that food was considered kind of a delicacy, kind of decadent, kind of borderline gluttonous, that you would go and consume that kind of thing. That seems to me the likely story, as Plato would say, in terms of, of how that came to be, based on what we do know."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9074.75,"end":9077.71,"speaker":"Fr Andrew Stephen Damick","text":"So that's our speculation. David, what do you think of it?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9079.39,"end":9093.71,"speaker":"Unregistered: David","text":"Okay, so what do you think the church fathers, like, was there any, like, what was the majority consensus then? Did they believe about the food? Did they all believe that every, every food was clean? Like that's kind of, I guess that's a three part question now."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9095.31,"end":9145.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Well, I mean, so like fasting rules is not clean and unclean. Right? Because if it is unclean, you would never be allowed to eat it ever. Right. And so like, you know, the example of pork, for instance. Right. So clearly that's now considered clean because Christians eat it outside of fasting periods. The exact details of the fasts, which is again, not a clean, unclean question. The exact details of the fast can have varied from, from place to place and time to time. Like Western fasting traditions, you know, even before, frankly, the Roman Catholic Church sort of gutted them. Western fasting traditions were always different from Eastern fasting traditions. Like as far as I know, for instance, fish was almost never actually forbidden or dairy."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9145.64,"end":9146.04,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9147.32,"end":9169.86,"speaker":"Fr Andrew Stephen Damick","text":"In, in the west, even in the ancient, ancient West. So there's variations on, on fasting. But yeah, I think that like, there's no, with the exception of like, you know, don't eat blood, there's not a sense of like, well, foods in general are still divided into clean and unclean. Right. And not eating blood is a separate question from the clean unclean thing. We've talked about that on previous episodes because it's."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9170.1,"end":9171.46,"speaker":"Fr Stephen De Young","text":"Mark 7:19."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9172.1,"end":9177.78,"speaker":"Fr Andrew Stephen Damick","text":"Mark 7:19. See, I'm going to look this one up. Real quick. Quick."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9178.1,"end":9181.14,"speaker":"Fr Stephen De Young","text":"We could do a. Do you even. Mark 7:19, bro."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9181.56,"end":9195.48,"speaker":"Fr Andrew Stephen Damick","text":"To the Bible gateway, Batman. All right. Yeah, yeah. Since it enters not his heart, but his stomach and is expelled, therefore, thus he declared all foods clean. There you go. All foods are clean."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9195.72,"end":9198.76,"speaker":"Fr Stephen De Young","text":"That's in red letters. So, you know, it's really important."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9201.64,"end":9210.55,"speaker":"Fr Andrew Stephen Damick","text":"Now. I mean, you know, don't go back to your. Your nastal yathel and tell him. Well, you know, it's too. These two dudes on a podcast said X, Y, and Z. So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9210.79,"end":9212.91,"speaker":"Fr Stephen De Young","text":"Come on. I'm a glutton from Louisiana."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9212.91,"end":9215.75,"speaker":"Fr Andrew Stephen Damick","text":"The shrimp basket at the Long John Silvers."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9217.67,"end":9220.63,"speaker":"Fr Stephen De Young","text":"I'm a glutton from Louisiana. You can't trust me on this at all."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9220.63,"end":9225.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm sorry. Nostavnik. That would be the term for the leader of your community. Is that right, Nostavnik?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9225.67,"end":9227.59,"speaker":"Unregistered: David","text":"No, honestly, I think you're right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9227.83,"end":9229.39,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, Nastya. Okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9229.39,"end":9230.39,"speaker":"Unregistered: David","text":"All right, all right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9230.79,"end":9231.27,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9231.51,"end":9233.54,"speaker":"Fr Andrew Stephen Damick","text":"So not an expert on this by any means."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9234.09,"end":9245.37,"speaker":"Unregistered: David","text":"Okay. Okay. So they believe that John, like, Chrysostom has said that. That we are forbidden from eating those things. So I'm like. I recall."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9245.69,"end":9252.61,"speaker":"Fr Andrew Stephen Damick","text":"I'd be like, well, you know, show me. Show me the money. That's what I have to say about that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9252.61,"end":9259.05,"speaker":"Fr Stephen De Young","text":"Well, I think you should just be obedient to your spiritual father. But I would be interested in finding out if that's true and where he said that."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9259.54,"end":9267.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. Exactly. All right, well, thank you, David. It's been fascinating chat with you. Thanks for calling."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9269.06,"end":9270.82,"speaker":"Unregistered: David","text":"Thank you so much, fathers. Appreciate it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9270.98,"end":9278.94,"speaker":"Fr Andrew Stephen Damick","text":"All righty. Okay. Death, destruction, mayhem. The death penalty."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9278.94,"end":9279.46,"speaker":"Unregistered: David","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9280.58,"end":9283.3,"speaker":"Fr Andrew Stephen Damick","text":"Cut off from among the people parts."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9284.18,"end":9296.18,"speaker":"Fr Stephen De Young","text":"We're talking about. Yeah, we're talking about the death penalties of the Torah, which clearly are still enforced completely in the Orthodox Church. I'm not joking."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9296.9,"end":9302.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes, it's true. Not a joke. So could he possibly mean, you ask?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9303.14,"end":9343.86,"speaker":"Fr Stephen De Young","text":"Stay tuned. Let's talk about it. Right, so first thing. First thing. You know, we had to talk a little bit last time about the idea that sacrifices were only for unintentional sins. Right. Like unintentional robbery and that kind of thing, and how that doesn't really work. So there's something we have to talk about with this that doesn't really work either, and that's. There are some folks out there who look at the death penalties prescribed in the Torah and think that no repentance was possible."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9345.7,"end":9360.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which. Let's think this through, everybody. Look at all the things that the death penalty is prescribed for, and let's assume that that gets really applied every single time. And Israel, every time a son makes."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9360.5,"end":9369.67,"speaker":"Fr Stephen De Young","text":"A smart remark to his father, no, sorry, son, no repentance possible. I'm going to stone you to death. Yeah. Every single time."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9369.75,"end":9371.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Israel would not have lasted a generation."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9372.23,"end":9388.63,"speaker":"Fr Stephen De Young","text":"Yes, right. Like that's clearly not going on now. You say. Well, it doesn't say anything there about repentance, okay? It doesn't have to. That's not how the Hebrew Bible works. Example, Jonah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9390.15,"end":9393.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where he doesn't say, repent Ninevites, or."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9394.07,"end":9404.07,"speaker":"Fr Stephen De Young","text":"This bad thing will happen. He just says, yeah, this bad thing is happening. Yes. Three days in your toast, right? That's what he says."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9404.31,"end":9406.95,"speaker":"Fr Andrew Stephen Damick","text":"The Deyoung standard transliteration."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9407.35,"end":9436.93,"speaker":"Fr Stephen De Young","text":"You will be destroyed in three days. Yes, that's it. He doesn't say anything about repent, doesn't tell them how to repent, what to do to repent. Right. But they all repent and the city is spared by God. Right? So the fact that. Right, this is there. And we mentioned, we were talking about this earlier, one of the lines in great compline here in Lent, we're reading the prayer of Manasseh."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9437.81,"end":9438.21,"speaker":"Unregistered: David","text":"And."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9440.37,"end":9450.72,"speaker":"Fr Stephen De Young","text":"At least in our Antiochian translation, the old Antiochian translation, which I hope remains with us always, it says, thy threatening towards sinners is intolerable."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9451.04,"end":9452.4,"speaker":"Fr Andrew Stephen Damick","text":"That's such a great line."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9454,"end":9510.02,"speaker":"Fr Stephen De Young","text":"Right? So, right. But what is this talking about? It's not that God goes around making empty threats, right? Yeah, yeah, yada, right. Like it's talking about, right? This is a person who has grievously sinned, right? And he can look at the Torah. This is Manasseh, the wicked king, right? Of Israel. And he's looking and say. Looking at the Torah and saying, I know what I deserve, right? I know what God has appointed for someone who does the things that I did, right. I should be killed dozens of times over, right? That's the threatenings he's talking about. And he's saying, I can't live with this. Right? I can't live with it. I can't go on with this. I need to be forgiven. This is too much of a wait for me. But he's repenting. The whole prayer is one of repentance."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9510.26,"end":9516.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. A beautiful prayer by the way. Listener, if you've never read it, go look this up. The prayer of Manasseh. Amazing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9516.26,"end":9673.81,"speaker":"Fr Stephen De Young","text":"He's not resigning himself to the executioner's acts. Well, this is what I deserve according to the Torah. Gotta follow through on it, right? He's seeking forgiveness. That is at the core of everything in the Torah is that you can repent. God is telling you that this is, right? What must happen to someone who does these things to drive you to repentance? That's the purpose of that threatening, right? We also have to note that the language that's used, being cut off from among the people, being cut off from the synagogue, literally sometimes, or being cut off from the ecclesia, from the assembly, from the church in the Old Testament, right? That language of being cut off is kind of ambivalent, right? There are places that specifically say, if someone does this, they must be stoned to death, right? Like that's very clear. Stoned to death, right? But the cutoff from among the people language, obviously you could see how that would be a death penalty, but you could also see how that might refer to, like, exile, right? They're going to be exiled from Israel, they're going to be exiled from the Israelite camp, they're going to be cast out, right? They're going to be removed, right? And if you think about what we were saying earlier tonight, right, God's two options with death by holiness, right, are death happens to a sinful people or he withdraws, right? Think about the day of atonement ritual, right? Sins are put on the goat, the goat takes the sins away, removes them, and so cut off from them, the people, death, exile, right? This unrepentant sinner has to be removed from the people, has to go away, right? One way or the other. But these ideas being so closely connected is not just an ambiguity of the Hebrew phrase, of the idiom, right? Cut off from among the people. These are closely allied ideas, not just in Israel, in the ancient world, right? So think about Socrates, our old friend Socrates, Socrates Johnson. So, right, Think about the apology. What was he sentenced to? He was not sentenced to death, right? He was sentenced to exile from Athens."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9674.21,"end":9676.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, he said, I'd rather drink poison."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9677.33,"end":9774.07,"speaker":"Fr Stephen De Young","text":"And he chose to drink the hemlock, right, Rather than be exiled. And while he was preparing to drink the hemlock, he had friends trying to smuggle him out of town. He's like, I don't want to be smuggled out of town. I don't want to be exiled, right? Why? Right? It wasn't just, oh, he thought it was the most beautiful city, right? This is a different view of what life means. We as contemporary people think of life in terms of biological life, and death is the cessation of biological life. And so, for example, all of our medical science is just aimed at prolonging biological life for every moment possible that's why in the contemporary world there are so many difficult end of life decisions that have to be made by families and that kind of thing. Because there's just biological life. Right. Keep them breathing by force if necessary. Right. That's not how life was viewed in the ancient world. And this is something you can see from nature. This is why the Greek philosophers and other people in other places hit upon it, because you can see it in nature. Right. There are animals that are solitary and there are animals that run in packs. Right. And it was very clear to them that man was a social, was a communal animal."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9774.79,"end":9782.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, from day one, you know, a baby born must have other people in order to survive, period."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9782.87,"end":9786.79,"speaker":"Fr Stephen De Young","text":"Yes, yes, right. It was not good that Adam was alone."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9787.09,"end":9791.65,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I'm an owner, body, a rebel."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9793.41,"end":9926.65,"speaker":"Fr Stephen De Young","text":"So as a communal animal. Right. The community of which you are a part, we were talking about this a little earlier with a collar, is what forms your identity. At the core of Socrates identity was being an Athenian. And that meant particular things about his relationship to the divine right to the gods, to the particular gods of Athens, to his relationship to the land in and around Athens. For him to be exiled, for him to go somewhere, even if he just went to Corinth, Sparta, Right. Wherever, he would not be the same person as a citizen of Sparta that he was as a citizen of Athens, as part of the demos of Athens, his life as he had led it up to that time would end just as surely by exile as it would by him drinking the hemlock. And he might be able to forge some new identity in that other place, but he didn't want to try and do that. Right. So we have to understand for the Israelites and the later Jewish people in the second Temple period, their identity is formed by being part of this community. Right. And when the diaspora happens during and after the exile, and you say, well, there are Jewish people all over, Right. But what do they do every place where they go? They form Jewish communities to maintain their Jewish identity. Because without that community, their Jewish identity vanishes in a couple generations. That's what happened to the northern tribes of Israel, their Israelite identity, once they were shuffled off to towns in Assyria and they intermarried and they didn't have any kind of Israelite communities, their Israelite identity vanished in a couple generations."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9927.45,"end":9947.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's, it's frankly, it's just like, you know, immigration to the United States. Right. People who form their own local communities tend to perpetuate that identity for a while. But those who don't you say? Oh, well, I think some of my ancestors came from such and such a place, you know?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":9947.97,"end":10022.71,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so the genetics of those people in the Northern Kingdom of Israel continued. They had genetic descendants. Right. But their Israelite identity was gone. Yeah. Right. And so their descendants were Assyrians and then Babylonians. Right. They were not Israelites. DNA doesn't matter in this case. Right. But more than that, even more than that, that's sort of the self conception of the person who's receiving this threatening. Right. Is death, exile, whichever. My life is over, I'm not me anymore. Right. The me that exists, my identity would be destroyed by this. Right. Is the other sense in which being cut off from the community is being cut off from life itself in a more literal sense. So think back to going Back to Genesis 3 again, not about the curse this time, but about the expulsion from paradise. Remember the threatening that Adam received? Right. Which was, if you eat of this tree in the day that you eat of it dying, you will die."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10024.15,"end":10024.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10025.51,"end":10036.82,"speaker":"Fr Stephen De Young","text":"Right. You're dead in that day, on that day. Right. And of course, we've talked about this a bunch. Right. Clearly that didn't mean physical death. He didn't eat from the tree and then fall over."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10036.98,"end":10037.62,"speaker":"Fr Andrew Stephen Damick","text":"Drop over."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10037.62,"end":10248.02,"speaker":"Fr Stephen De Young","text":"Yeah, drop dead physically. Right. Then we talked about there's physical death and there's spiritual death. Physical death is the separation of the body from the soul. We've talked about this a lot, so you can go to past episodes, get a lot more detail. But physical death is the separation of the body and the soul. Spiritual death is the separation of the soul from God. And as we've talked about in our episode about the soul, our soul is really our connection to God that brings life to our bodies. So in the day that Adam ate of it, he died spiritually, he was expelled from paradise. He was cut off from God. And when he's cut off and he's cut off from the tree of life, as we've said, as a mercy, so he wouldn't live forever in that state. Right. He's cut off from the tree of Life. Now what does he do now that he's in our present world? Right. Well, he needs to find ways of restoring the life that he's lost and maintaining the life that he has. And those means are worship and the purification that comes through sacrificial worship. Those then become Adam and Eve's and all of their descendants. Right. Subsequent humans. That's their tether back to God, who is life. Worship coupled with repentance. Purification, transformation, that's their tether back to life. So then what does it mean to be cut off from the means of worship and the means of purification? That is true spiritual death. This is why the first two halves were groundwork for this. Right. We talked about purification from uncleanness, how that happens. That happened in the community, in the Israelite and then the Jewish and then the Christian community. Right. We talked about worship and its effect. Where does that happen in the Israelite, in the Jewish, in the Christian community? Yep. Right. And so being cut off from that community means spiritual death. And restoration to that community is the only means of restoring that spiritual life. And it's spiritual death that leads to physical death. It is spiritual death that leads to physical death. This is what's going on in incorrupt saints in Enoch and Elijah not dying physically and going into heaven, of the bodies of Moses and the Theotokos being taken up into heaven and not seeing decay. Right. As they had reconnected with the source of life. So then some of you may have already keyed in, how do those death penalties continue to exist in the and function in the church in the same way they did before? In the form of excommunication."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10248.82,"end":10249.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10251.3,"end":10324.13,"speaker":"Fr Stephen De Young","text":"In the form of excommunication. Because the church is the realm in which forgiveness and purification, restoration to communion with God, restoration of life take place through the Eucharist, through repentance, forgiveness, absolution. It's where our identity is formed. And that's not just identity in terms of my sense of self. Right. This is quite literally, when we're baptized, our old self dies. A new creation, a new person comes into being. But that person only exists as part of a community of baptized and newly recreated people. And so being cut off from all that means being cut off from that new identity, that new life, the ability to maintain life. The church is the realm where sacrificial worship is taking place in the Eucharist. So excommunication as death, as real death."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10325.33,"end":10325.73,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10326.53,"end":10343.96,"speaker":"Fr Stephen De Young","text":"As a threatening exists for the same reason that the threatenings of the death penalty of being cut off from among the people exist in the Torah first and foremost to promote repentance."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10345.96,"end":10389.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is explicit in the passages in the New Testament that mention it, where you get this language of being handed over to Satan. Which sounds kind of weird and scary. It is definitely weird and scary. More scary than weird, probably, but St. Paul says it, but yeah, once again, you can't get away from it. Yeah. So in 1 Corinthians 5, 5, St. Paul this is the passage where St. Paul is talking about the guy in Corinth who is sleeping with. Is it his mother in law or stepmother?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10389.27,"end":10393.75,"speaker":"Fr Stephen De Young","text":"It's one of the two. It's not totally clear, but it's either his mother in law or his stepmother."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10394.1,"end":10398.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. And obviously it refuses to repent unrepentantly."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10398.22,"end":10402.42,"speaker":"Fr Stephen De Young","text":"And both of those are bad. Like there's not a better option among those two."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10402.74,"end":10430.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes, both are bad. Yeah. So this is what St. Paul says about this man. 1 Corinthians 5. 5, you are to deliver this man to Satan for the destruction of the flesh so that his spirit may be saved in the day of the Lord. And then similarly in First Timothy 1:20, I can't remember what the. What the offense is here, but he's."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10430.99,"end":10433.43,"speaker":"Fr Stephen De Young","text":"Talking about some false teachers and stuff who have."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10433.43,"end":10458.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah, yeah. Then he says, among whom are Hymenaeus and Alexander, whom I have handed over to Satan, that they may learn not to blaspheme. So in both cases, it's handing over to someone to Satan in order that the first case, you know, so spirit may be saved in the day of the Lord, and then the second one, so they may learn not to blaspheme. So it's both. They're both for the sake of repentance."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10459.23,"end":10470.11,"speaker":"Fr Stephen De Young","text":"Right. You know, they're not being thrown out of the church and handed over to Satan. And by the way, as we've said before, church in the Bible has a border and someone can be put outside it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10471.15,"end":10471.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10471.87,"end":10476.59,"speaker":"Fr Stephen De Young","text":"But they're not being thrown out and put outside it because go pound sand. We never want to see you again."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10477.07,"end":10477.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10477.27,"end":10478.83,"speaker":"Fr Stephen De Young","text":"Right. Quite the opposite. It's."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10478.83,"end":10479.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10479.47,"end":10483.07,"speaker":"Fr Stephen De Young","text":"This is our last desperate attempt to try to get you to repent."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10483.55,"end":10510.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is, you know, this is sort of. The same dynamic is in place. Parents, right. Go to your room until you're ready to be with other people. Right. It's not, I never want to see you again, child. Get out. You know, it's not that. It's. It's okay. There's a way that we need to behave together. So you're going to have to be somewhere else until you can be with the community and be in the community and live as the community."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10512.48,"end":10577.72,"speaker":"Fr Stephen De Young","text":"Right. And there is a similar dynamic here in terms of the removal, not just their individual removal, to get them to repent. But St. Paul, for example, in 1 Corinthians 5 is very clear that the fact that the people in the Christian community in Corinth have been not saying anything about this yeah, they've been letting it go, have been letting it happen. And some of them, from what he says, even sort of silently applauding themselves for how open minded they are about it. Nothing like that would ever happen today. Right. That. That is actually presenting a danger to them surrounding the Eucharist. St. John is going to say, right, that when they allow false teachers and these people to come in and they host them at the Eucharist, that they are a stain on their love feast. Stain, taint."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10578.6,"end":10582.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's harming the community to let sin go."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10582.92,"end":10657.23,"speaker":"Fr Stephen De Young","text":"It's pointing to that danger. So both for the sake of the community, if the person will not repent, they have to leave, and for the sake of the person who needs to repent, they need to be put out as that last call for them to. To repent. And in terms of the specific language of handed over to Satan, don't miss the connection here of who's outside the camp, in the wilderness, who. When you exile someone or a goat, you're sending them to a zazel. Yeah, the goat demon of the wilderness. Right. So don't miss that. But implied by the fact that we want them to learn not to blaspheme or we want them to be saved in the day of the Lord, is the fact that reentry to the community is possible in Christ. Repentance and restoration. Right. Is not only possible, but the goal. So a final note here. Final note here. Recently online, in certain circles, some people have gotten very deeply upset about anathemas."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10658.35,"end":10663.43,"speaker":"Fr Andrew Stephen Damick","text":"Well, we just had the Sunday of the triumph of Orthodoxy. So, yes, got anathemas on the mind."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10663.43,"end":10680.16,"speaker":"Fr Stephen De Young","text":"Where, depending on your Orthodox tradition and whether there was a bishop there, you may or may not have heard some anathemas. Right. So anathema, the word means accursed, Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10680.24,"end":10687.2,"speaker":"Fr Andrew Stephen Damick","text":"Or cursed. Yeah. I think most literally it's like put somewhere else is what it effectively means. Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10688.56,"end":10795.74,"speaker":"Fr Stephen De Young","text":"But the idea is that they're under a curse. You're putting them outside the camp. Right. If it's directed toward a person. Now there are anathemas directed toward people from various church councils within the Orthodox tradition, more often there are teachings, right. Ideas, positions, activities, actions that are declared to be anathema. Right. And so first of all, we see that they're functioning as threatenings, they're functioning as warnings to the people in the church when they hear these things. Right. Oh, a person who teaches xyz, that person is anathema. That person is outside the church. Right. These are bad ideas. These are ideas that will be Harmful to your salvation. Right. These are things to steer clear of, not to do, ways not to go. They're the natural result of the other thing that church councils do, which is ecumenical councils, at least, which is establish dogma. And we've talked before about how dogma, the word originally referred to a boundary marker in property. So you have these dogmas, dogmas that are the fences, Right. The markers out at the edge of the teaching of the church. And therefore anything that's outside of those boundary markers is de facto anathema. And so an anathema is just the flip side of a dogma. So if we say the truth is X, then not X by definition is."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10796.86,"end":10798.5,"speaker":"Fr Andrew Stephen Damick","text":"Outside, out of bounds."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10798.5,"end":10807.66,"speaker":"Fr Stephen De Young","text":"Right. Is under the curse outside the camp. Anathema. Right. But the most important thing here."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10807.74,"end":10808.06,"speaker":"Unregistered: David","text":"So."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10808.06,"end":10846.95,"speaker":"Fr Stephen De Young","text":"Most important thing. So some of these people who are very upset about the anathemas, who have a big problem with them, don't understand the point we're about to make because they will say things. I may or may not be referring to any person in particular. They will say things like, well, if you read these anathemas, then you can see that in the past, through most of Orthodox Church history, they thought no one outside the Orthodox Church was saved and they were all going to hell."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10848.96,"end":10849.2,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10851.04,"end":10905.69,"speaker":"Fr Stephen De Young","text":"But now, recently, now, they try to act all nice and say that they don't think that anymore. Right. But that's not really what the Orthodox Church teaches. So leaving aside the problem of. Right, what do you mean by not saved and what do you mean by going to hell? Right. Again, we've talked about those categories plenty on this show and why that's not a good way of thinking. But there's another explanation. There's an actual reason for that difference, Right. Between just going and reading the anathemas of a council and then talking to actual Orthodox people about the anathemas. Right. So we have to understand that in the Orthodox Church, right. Texts don't have authority in and of themselves."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10906.41,"end":10920.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, and let me just approach this issue from another angle because I think it's important to show how problematic that whole methodology is."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10921.29,"end":10921.69,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10923.13,"end":10945.56,"speaker":"Fr Andrew Stephen Damick","text":"And I've seen people do this, like, find a good, faithful Lutheran and say to him, you know, I've been reading the writings of Martin Luther, and I found this. What do you have to say for that? You know, because Martin Luther said some things that most modern Lutherans would definitely reject."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10946.52,"end":10948.36,"speaker":"Fr Stephen De Young","text":"We talked about some of them two weeks ago."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10949.56,"end":10980.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. While still calling themselves Lutherans. And they would very rightly say to you, that's not how Lutheranism works, you know. Right. So now the writings of Martin Luther do not have the kind of canonical authority that rulings of ecumenical councils do. But the principle holds, which is you can't just dig in unless. Unless a religious community says explicitly, look, all of our texts are basically self applying."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10980.58,"end":10981.02,"speaker":"Fr Stephen De Young","text":"Whatever."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10981.7,"end":10983.54,"speaker":"Fr Andrew Stephen Damick","text":"You can't say, look, I found this thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10983.78,"end":10985.86,"speaker":"Fr Stephen De Young","text":"If they say that, they're lying, frankly."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10986.66,"end":10988.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's not a thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10988.42,"end":10991.38,"speaker":"Fr Stephen De Young","text":"They may be deceived themselves, but that is not a true statement."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":10991.78,"end":11012.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, look, I found this thing in your religious community's past. Ha. Gotcha. No, that's not how it works. It's got to be applied by someone who is qualified."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11012.89,"end":11038.9,"speaker":"Fr Stephen De Young","text":"Well. Or who is authorized or the position to do so. Yeah. Because text. There's some self criticism here. That's part of why I want to come at it this way. Right. Not me. Well, maybe even me personally, but within the Orthodox camp. Right. So people don't always feel like we're picking on them if they're not orthodox, since that's what we're talking about right now with the anathemas anyway. Right. So for us, texts don't have authority. Right. So we aren't sola scriptura."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11039.78,"end":11040.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11040.58,"end":11073.55,"speaker":"Fr Stephen De Young","text":"The biblical text itself does not have authority. The Holy Spirit who inspired it, guides it, transmits it, leads the church in interpreting. It has authority because the Holy Spirit is God. Right. And there are particular people within the church who have received positions of authority to interpret and apply the Scriptures. Right. But the text on paper doesn't have authority because it can't exercise authority, can't do anything. It's paper."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11073.95,"end":11074.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11074.83,"end":11162.04,"speaker":"Fr Stephen De Young","text":"With printing on it. Right. It literally can't do anything. And the reason why this is self critical for Orthodox too, that's not just me taking a shot at Protestants, is that we have a lot of people in the Orthodox Church. Well, I don't know if it's a lot of people. There are a lot of online Orthodox people who speak as if they are a kind of wooden, unnuanced sola scriptura Protestant who has just added the canons and the anathemas and certain quotes from church fathers to the Bible and treats all of those things as if they're just self interpreting and self applying. The canons are not self interpreting and self applying any more than the Scriptures are. The anathemas are not self interpreting and self applying any more than the Scriptures are. The church fathers are not self interpreting and self applying any more than the Scriptures are. The Holy Spirit who stands behind them has authority as God. And there are people in the Orthodox Church, they're called bishops, let's be blunt, they're called bishops who are entrusted with the authority to interpret and apply the Scriptures, the canons, the anathemas, the writings of the church fathers. Right. And being entrusted with that position, as we've emphasized many times before on the show, God is then their judge."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11164,"end":11164.12,"speaker":"Fr Andrew Stephen Damick","text":"As."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11164.12,"end":11223.26,"speaker":"Fr Stephen De Young","text":"To how well they live up to that calling and that authority with which they've been entrusted and how they use it. That's how it works in the Orthodox Church. So back to the issue at hand. Why does it sound different when you read the anathemas on paper versus when you talk to an actual Orthodox Christian? Because they're being applied in a certain way. Let me give you an example, okay. In the modern world, right? In the modern world. So if I go to average person who identifies as a Christian, Protestant, Orthodox, Roman Catholic, someone who doesn't identify as any of those doesn't matter. I go to them and I say average layperson, explain the Trinity to me. Okay? I'm going to get some kind of heresy."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11224.46,"end":11224.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11225.18,"end":11226.78,"speaker":"Fr Stephen De Young","text":"9.9 times out of 10."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11226.86,"end":11230.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Within the first five minutes, at least one heretical thing will be said."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11230.54,"end":11456.71,"speaker":"Fr Stephen De Young","text":"Yes, but so let's say just for the purpose of this example, that the person I go to, this particular person, gives me the whole water, ice, steam thing, right. And is basically a modalist, basically a civilian in the way he explains it. Right? His explanation is modalist or civilian. Okay. But he just, he's never studied it, doesn't know much about theology. He's just got kind of a wrong headed view of it. Okay? But the view he expresses when asked about the Trinity is Sibelian. Now let's imagine I go and I talk to someone who is a theology professor at a oneness Pentecostal seminary. And this professor is, say in his late 50s, he spent his life writing books against the doctrine of the Trinity and writing books laying out a model that is modalist, that is Sabellian. And he has had public debates with Trinitarians about it. Right. Allow me to suggest that the anathema of the Council of Nicaea against Sabellianism applies to these two men differently, just obviously, Right. When it gets applied to the av, just the average Christian layman who's a little confused. Right. It gets applies in terms of. Whoa, man, that's not correct. Right. Let me lay out for you a better way to understand the Trinity. Right. Whereas the person who spent his life arguing against the truth gets Rebuked by that anathema. Rebuked in the sense that if you believe that, if you reject the doctrine of Trinity, the Council of dicea, you aren't properly speaking, a Christian. Yeah. You are outside the church. Right. That's how those get applied. And that's not being inconsistent, that's not being wishy washy with the one person. That's being normal, reasonable, and addressing the two cases. Now if I talk to that layman and I lay out a more correct way of understanding the Trinity and he rejects it, he says, no, I don't believe that. And he, and he doubles down with the modalism and says, no, this is what I think is true. He starts moving over into the other category. Right. If he goes and starts talking to his friends and trying to form a faction in his church, he's moving way over into that other category of rebuke. Right. And so the Orthodox Church, when it's addressing people who have grown up with no knowledge of the Orthodox Church and its teachings, right. They're not going to apply the anathemas to those people in the same way that they apply them to someone who understood those teachings full well and rejected them. Those are two different scenarios. So just to choose a random example, because of course this is not directed at any particular person. The Second Council of Nicaea, the seventh Ecumenical Council, the anathemas against those who refuse to venerate icons. Okay. At the time those anathemas were spoken, historically, they were spoken to people who had been murdering, imprisoning, torturing people for owning icons."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11457.35,"end":11462.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And smashing them in pieces. Smashing the icons of pieces, burning them, throwing them into the ocean, etc."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11462.95,"end":11490.88,"speaker":"Fr Stephen De Young","text":"Yes. Right. And so, yeah, they get rebuked in pretty harsh terms. Okay, now we have an average Evangelical Protestant trying to follow Christ as best they know how. They walk into an Orthodox Church one day, they see people kissing an icon. That gives them the heebie jeebies and they say, you know, I don't think that's right. That seems weird."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11491.36,"end":11492,"speaker":"Unregistered: David","text":"Okay."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11492.8,"end":11497.04,"speaker":"Fr Stephen De Young","text":"Those anathemas do not apply to the second person the same way they apply to the first person."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11497.68,"end":11498.16,"speaker":"Unregistered: David","text":"Yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11498.72,"end":11504,"speaker":"Fr Stephen De Young","text":"And that is not being wishy washy, that's being normal, being sensible and reasonable."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11505.47,"end":11505.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11506.27,"end":11548.34,"speaker":"Fr Stephen De Young","text":"They are applied differently in these different cases because they're different people and because what's the goal? The goal is not to identify good guys and bad guys. It's not to identify an in group and an out group. The goal is to call people who are on the wrong path or who have wrong ideas to Repentance. And if the best way to bring someone to the right point of view is to come and speak to them lovingly and express, explain and teach them what we believe to be true, that's what we're going to do. If a person is hardened and argumentative. Right. And opposing the truth, then we're going to try for rebuke to bring them to repentance."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11548.34,"end":11570.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, like, this is actually baked. This is actually baked into the very text of these anathemas. Right. Because the phrase those who teach exists in most of them. You know, to those who teach, or those who say X, Y and Z, not to those who think or to those who speculate, or to those who."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11570.06,"end":11570.74,"speaker":"Fr Stephen De Young","text":"Don'T know any better."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11570.9,"end":11578.9,"speaker":"Fr Andrew Stephen Damick","text":"Don't know any better. It's those who teach. Right? Those who teach this heresy, anathema."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11581.86,"end":11584.34,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":11585.22,"end":12142.04,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, this didn't go quite as late as. Of course, we're not done yet, but this didn't go quite as late as I thought it would. But nonetheless, we have some closing thoughts. Well, number one, this will certainly not be the end of our discussion of Torah in the church and how to apply it. We will come back to that. But next time, actually, we're planning to do an all live Q and A, so, you know, jam up those phone lines and make Matushka Trudy earn her living, as she already very ably does. But I just wanted to summarize some of my own thoughts from this episode and also a little bit from the last one talking about Torah and how it applies for Christians. And the entry point for some of my thoughts is we got an email within the past few days, actually, in which someone wrote to us. And the situation was that he was doing something that was under the direction of his spiritual father and in my own assessment, pretty normal thing to do, but was explicitly being rejected by people he was running to on. On the Internet. And Andy was concerned, like, well, look, there's canons that seem to be relevant to this, and my spiritual father is applying this one way, but this is what the canons say and whatever it might be. And the question that I had, and I wrote him back and I said, well, he said in his email, he said, I'm concerned I might be under anathema. And the question I said to him was, well, who exactly is going to anathematize you, right? People on Twitter or on a Discord server somewhere. Are they going to. If so, who cares? Right? Who cares? Because as we said, there are people who actually have authority to pronounce anathemas. And it's not, you know, it's not me, right? It's not the interwebs. There are people who actually have this authority. And as Father Stephen said, like, you know, it's funny, like, you know, Americans would be like, but, but, but, you know what? If a bishop is wrong, God will hold that person accountable. Like, he will. He will. Like, don't we believe that God is active and here and doing stuff? We do. You know, God will hold them accountable. They are accountable to God, not. Not to me personally. Right? Not to mobs on Twitter or wherever else. So why is this important? Well, it's not just to re. Emphasize the point we made earlier about who has the authority to do these things, but it is actually about this question of who we are, what is our identity? Right? And this is one of the big questions of Torah. What is the identity of Israel? And therefore, what is the identity of the church, the Renewed Israel? And I think based on some of the questions we've got, which they've been great questions, people, so please don't feel in any way embarrassed by asking them. There have been great questions. Some of them are tough. Some of them have at least sent me to the books. Probably not Father Stephen, but definitely me on several occasions to try to understand these things better myself. But I think from a lot of the questions that one of the ways that we tend to try to understand and to digest this question of. Of the Torah and of the Scriptures in general, of all kinds of elements of church tradition that we can point to, right? Liturgical texts, patristic texts, canonical texts, whatever it is, is that we're trying to analyze these in ways that in some way somehow don't assume that it's actually happening within communities. Right? And that's the question, the email, you know, I'm scared I might be under anathema. Even while he's being obedient within his community to the person that God gave him, his own spiritual father. Right. And why is this a problem? Well, I think that it is a problem because, as we said earlier, what it means to be a Christian is bound up in community. It is not something one does individually. Yes, I as a person need to make choices about how to live my life. I am the one who is in charge of this being, who is me. But it is not something that I do individually. It is something I do in my community, right? In obedience to my own spiritual father, my own bishop, in concert with the other people in my actual on the ground parish community. This is one of the big points that we make all the time in this podcast. But we're applying it in a particular way this time. But it's not separable from community. And even this idea of being cut off from among the people, there's a sense in which being truly cut off from the church, especially if it becomes long term, that's not a Christian out there anymore. Let's come back and be Christian. You have to be part of the family. You have to be part of the family. You can't be cut off from life and be alive. Right? You can't. And I think that a lot of this problem gets exacerbated in the age of social media. And I say this as a participant in social media. You know, a lot of the work that I do is. Is in social media. But that's not the only reason that I'm on social media. I'm using it for myself. I'm staying in touch with family and friends and reading things and being informed and learning about stuff and whatever. But because of the way that social media works. Right? Like, it's data that comes at us largely visual, but there's also sometimes, you know, audio and whatever. It's data that comes at us. And so we receive it as data, we process it as data, and it's mostly an individual experience. Now there are. I know there's other people on the other end. Like I was chatting with people in the YouTube chat this evening and. And so forth. I see you, I see you. You're out there. But nonetheless, like, you're not. We're not in each other's presence. So there's a significant limit that's happening there. And so it's easier for me. Right. I see you as just words on the page. It's easier for me to just analyze it. Analyze you as words. I know that you're not just words, but that's easy. All of us are doing this. Right. And so what happens then is we're nurturing. Not on purpose, I think, but let's be on guard, okay? We're nurturing a kind of virtual Christianity. And in that virtual Christianity, canons do things like apply themselves because it's all just text anyway, right? Right. You know, the Bible applies itself. It's all just text anyway. It's when we're actually in each other's presence and praying together and worshiping together and having to be obedient to the person who is leading our community. That's Christianity. This is so explicit everywhere in the scriptures. And it's just baked into what the church is. And, and there is a kind of million man schism that is happening when we dissociate ourselves from the community and attempt to. To become a thing called Orthodox Christian in a way that's utterly individualized. Like, I have seen people online, and I'm not joking about this, I've seen people online that, calling themselves Orthodox Christians, calling themselves sometimes catechumens, which is a very specific category, right? As is Orthodox Christian. But a catechumen is a very specific category. And some of these people have literally never been to an Orthodox church, or they don't go very often, or they, you know, and I've seen them say that. I saw someone once say, I'm a catechumen, although I still haven't visited my local parish. I'm like, well, how did you become a catech? What?"}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12142.6,"end":12143.88,"speaker":"Fr Stephen De Young","text":"Like, it's not a thing."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12144.76,"end":12376.52,"speaker":"Fr Andrew Stephen Damick","text":"But when you have this kind of virtual Christianity, it is a thing, but it's not actually a thing. It's not. It's just an idea. It's a concept and functions because people give it. People use their agency to give it functionality, but it doesn't actually exist. It doesn't actually exist. It's like saying, I'm married, but where is, where's your husband? Where's your wife? Is that a person somewhere, you know? Or like, I'm a parent, okay, show me your children. Right? It's not a thing. You can do without that. And one of my big takeaways, this is my biggest takeaway. I think my biggest takeaway from talking about the Torah and the way that it functions within the church is that it functions within the church. We made this point last time, which is you do not need to reinvent the. The wheel. Right? And so I understand why someone might ask a question like, well, okay, I see this on the Torah, but are we doing that? You know, shouldn't we be doing X, Y and Z? I understand why people ask those questions, and it's fine, it's fine. Ask them, you know, but ideally we get to the point where we say, okay, I see this in the Torah. I don't understand how that's being applied in the church or if it is, or whatever. Let me dive more deeply into the tradition of the church and try to understand how the church has digested this and not assume that the church hasn't. Because if I think like, oh, I spotted something that the church has been missing all this time, I'm wrong. This is true of the Scriptures. It's True of the Church councils. A lot of people were unhappy at us when several episodes ago, we rejected universalism, rather like the Ecumenical Councils do. But think about this, okay? Like, if you're going to embrace whatever form of universalism and you're going to say, okay, these Church councils got this wrong, and for the last over thousand years the Church has gotten it wrong, then that's not orthodox Christianity. That's something else. Something else, right? That's essentially saying, I know, and the community of the Church doesn't, or I'm right and the Church has been wrong. The Holy Spirit has not successfully guided the Church all of this time. I got it. I got it. Right? And so the way that the Torah and all the Scriptures function within the Church is within the church. It's not arbitrary. It's not that the, you know, the bishops can say whatever the heck they want. They are constrained, but not by a text. They are constrained by the Holy Spirit, who is guiding the Church together. And, no, that doesn't work out kind of mathematically. Like, there's not a method, a formula that you can apply where, like, oh, if I apply this formula, then I'll always get the correct answer. It's not how it works. And the biggest reason that it doesn't work that way is because I am not omniscient and I am not sinless and I am not omnipotent. And so therefore, I have to have some humility. And seeking to understand what's in the Torah more thoroughly is one of the ways of pursuing that humility and seeing how it's applied in the Church. Okay, rant over. Father Stephen, it's your turn."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12379.16,"end":12587.64,"speaker":"Fr Stephen De Young","text":"I'm going to be somewhat nicer to our Internet friends. I mean, not a lot I'm not a nice person, but a little. Yeah. I want to talk a little bit about zeal. Zeal is not a bad thing. According to the Scriptures. It's a good thing. Right? It's a good thing. The big example biblically of zeal is, of course, in the Torah is Phinehas, right? Who ends a plague at BAAL Paor by skewering an Israelite man. And the person with whom he was chambering, to use a phrase that was in our Epistle book last week as a euphemism. And for this act of, frankly, violence. Right. He and his descendants were awarded the high priesthood in Israel. And the zeal that he had was not a zeal for violence or a lust for blood. Right. That's not what's being praised here. The Zeal is for the purity of the camp, the purity of God's people, maintaining that purity. And there are a number of other figures who we could talk about running through the Scriptures who manifest that kind of zeal for the purity of God's people and the purity of the camp. And when I look at folks on the interwebs, right, Orthodox folks on the interwebs, other Christian folks on the interwebs, I see that there are a lot of people with zeal, specifically that kind of zeal. Zeal for the purity of God's people, for the purity of the church, right? We can't have these people teaching these things that are wrong. We can't have these people who want to change things about the church based on the zeitgeist, right? Because the spirit of the age is a demon, right? We can't have this. These people need to be opposed at every turn. They need to be rebuked. We need to fight back against them. Zeal, right? And again, not necessarily a bad thing. But we also have to remember St. Paul, because Saul of Tarsus, in his early years as a radical, had a lot of zeal. And he had exactly that kind of zeal. Zeal for the purity of God's people. It's why he became a Pharisee. But that zeal kind of got out of control for St. Paul because what started out as I must be pure, the people must be pure, this is how we will receive God's blessings, turned into a kind of violence and a kind of persecution that led to him, all of a sudden, persecuting Christians."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12590.84,"end":12591.16,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12591.16,"end":12755.39,"speaker":"Fr Stephen De Young","text":"Led to him standing by and approving of the murder of St. Stephen. Things got out of control. Later, St. Paul would say he had zeal, but not according to knowledge. That brings us to 1 Corinthians 5 that we read a verse from just a little bit ago. He's got this problem with the church in Corinth, with this fellow we mentioned who's engaged in sexual immorality. Unrepentant. And no one in the community seems to care, want to say anything, let alone do anything about it. Some of them, as we said, even congratulating themselves for how wise and open minded they were. And so St. Paul, in part in that letter, has to upbraid them, has to rebuke them for lacking zeal, for not having zeal, for the purity of their community and their church, for letting this unrepentant sin continue to stain their gatherings. But there's a difference. There's a difference. When you Read everything he says to the church at Corinth. There's another peace, right? St. Paul now has some knowledge. St. Paul is a wiser man. He's able to keep a couple of different thoughts in his head at the same time. One of those is still that zeal. The purity of the church must be maintained. But the other piece is this unrepentant sinner needs to repent. That purifying the Church doesn't mean driving this guy away for the sake of driving him away, declaring him unfit, ridiculing him, executing some kind of violence against him, some kind of retribution. It means trying to bring him to repentance. If we could do that with a conversation, great. If it takes a rebuke, that's what we have to do. If we have to excommunicate him publicly, that's what we have to do. Whatever we have to do to, as St. Paul says, save this man's spirit, save his soul on the day when Christ judges all of us. That's what we have to do."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12757.79,"end":12758.11,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":12758.11,"end":13022.9,"speaker":"Fr Stephen De Young","text":"Order to purify the church and keep the Church pure. He can hold those two things together. And so to all those people who I just commended on their zeal on the Internet, I have to say also the other piece, we have to keep this other piece in mind. That person who day after day identifies as an orthodox Christian and posts things that are not in keeping or are the opposite of orthodox Christian teaching may be smug about it. That's a person God loves. That's a person for whom Christ died. That's a person who you need to purify the church from by bringing them to repentance. And I'm sorry, guys, and you're mostly guys. Not everyone needs to be rebuked all the time, right? Not everyone needs to be rebuked all the time. A lot of people need to be educated. A lot of people need to be brought along. A lot of people need to have some kind of connection with somebody where they feel like the person actually cares about them, and then they'll be able to hear what they have to say and be corrected. Some people need to be corrected privately. Some people need to be corrected publicly. We need to exercise some wisdom and some knowledge about this. We need to keep the goal in mind is how I'm talking to this person and how I'm talking about this person, Is this going to achieve the result that I should want of trying to bring them to repentance and restoration, of trying to get them to embrace the fullness of the Orthodox faith, or is what I am saying going to get me congratulated by my friends for how well I owned them and destroyed them with facts and logic? So one of those is pride, and the other one is trying to save someone's soul, which St. Peter tells us will cover a multitude of our own sins. That said to all the folks out there who have people in mind, who they think I'm talking to and are saying, yeah, get them, sometimes people do need to be rebuked, right? Like in Corinth. Sometimes we can't just all get along, sometimes we can't. Almost never can. We just overlook this stuff. We need to be wise about how we handle it. But sometimes the way it has to be handled is a rebuke, a public rebuke, right? Sometimes that is what has to be done. And we do need people with a little bit of zeal and some courage to do that, and people who have the wisdom to know how to do even that, how to issue a rebuke in a way that might bring someone to repentance. So hopefully, right, if you haven't left social media permanently, as I think we all should, or at least left it for Lent, which inarguably, everyone should, if you're still on it right now, right. Lent may be a time to have some serious thoughts about this. So not about dampening anybody's zeal. It's not about telling people they shouldn't care about the purity of the church. It's about also being wise and being smart and keeping the goal in mind. God desires that no man should perish, but that they should turn and live. That has to be our goal, too. He promises us blessings for anyone who can bring someone who errs, someone who sins, someone who has gone astray, back into the fold. That's what we should be pursuing. Not our egos, right? Definitely not money. Right. In these interactions, that's what we should be after."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13024.9,"end":13055.19,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. All right, well, that is our show for tonight. Thank you very much, all of you, for listening. If you didn't get through to us live, we'd still like to hear from you. And next time, it's going to be an all live Q and A, so make sure you show up for that. You can email us also, though, at Lord of Spirits and Ancient, you can message us at our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help finding a parish, head over to orthodoxintro.org and."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13055.19,"end":13066.56,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. I've been planning out all that I'd say to you since you slipped away Know that I still remain true I've been wishing out the days if you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13066.56,"end":13078.76,"speaker":"Fr Andrew Stephen Damick","text":"Are on Facebook as Father Stephen is not Follow our page Join our discussion Group Leave reviews and ratings in all the appropriate places, but most importantly, share this show with one of your friends who is going to benefit from it."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13079.16,"end":13091.66,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to anxiety.com support and help make sure we and lots of other AFR podcasters stay on the air. Please say that if you hadn't have gone now, I wouldn't have lost you another way from wherever you are, come back."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13092.45,"end":13094.69,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. God bless you."}
{"episode_id":"LOS - #089 - 2024-03-28 - Torah 2 - Back in the Habit","start":13096.93,"end":13134.14,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 thousand and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
