{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":0.24,"end":4.88,"speaker":"Fr Stephen De Young","text":"He will be a staff for the righteous with which for them to stand and not to fall."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4.96,"end":8,"speaker":"Fr Andrew Stephen Damick","text":"And he will be the light of the nations and the hope of those."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8,"end":12.72,"speaker":"Fr Stephen De Young","text":"Whose hearts are troubled. All who dwell on the earth will fall down and worship him."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":12.72,"end":14.96,"speaker":"Fr Andrew Stephen Damick","text":"And they will praise and bless and."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":14.96,"end":64.74,"speaker":"Fr Stephen De Young","text":"Celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":64.74,"end":88.42,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers. You are listening to the Lord of Spirits podcast. My co host, Father Steven Dion is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. This episode is pre recorded because when it airs, I will be in the UK and Father Stephen will be wherever it is that he is when we do pre record nights."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":88.42,"end":92.64,"speaker":"Fr Stephen De Young","text":"So I don't know, I'll probably write a book or get a master's degree or something."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":92.64,"end":100.44,"speaker":"Fr Andrew Stephen Damick","text":"Hey, that's a nice thing to do on a Thursday night. Yeah, you're just leaning into that now, aren't you?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":100.44,"end":102.72,"speaker":"Fr Stephen De Young","text":"That's great. Might as well."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":102.72,"end":103.52,"speaker":"Fr Andrew Stephen Damick","text":"Might as well."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":103.84,"end":108.84,"speaker":"Fr Stephen De Young","text":"There's worse reputations to have. Yeah, I've had some of them and."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":108.84,"end":127.11,"speaker":"Fr Andrew Stephen Damick","text":"We'Ll have some more. So, yes, we're doing q&a. May. Our last episode was a live Q and A. This particular one is an asynchronous Q and A, meaning that we're going to be doing voicemails that y' all have left us now. You've left us a lot because it's been a long time since we had an asynchronous Q and A."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":127.11,"end":128.03,"speaker":"Fr Stephen De Young","text":"Speak pipes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":128.03,"end":130.83,"speaker":"Fr Andrew Stephen Damick","text":"Speak pipes. Yeah, as it were. Yeah, Speak pipes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":131.55,"end":135.91,"speaker":"Fr Stephen De Young","text":"Spoke into a pipe. Your voice was trapped there and will now be released."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":135.91,"end":156.17,"speaker":"Fr Andrew Stephen Damick","text":"Ceci n' est pas un peep, unspe spig peep. I don't know how you say that in French, but. Right, so we have a big pile of them stacked up, so I just grabbed a bunch and we're going to be addressing those on this episode. And so that's what it's going to be. It's just going to be kind of like a rapid fire."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":158.81,"end":168.25,"speaker":"Fr Stephen De Young","text":"Come on. We're going to go fast. Sure. I can just do yes, no to all the questions, then we can do rapid fire."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":169.53,"end":196.9,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is the. I'm blanking on the term. The lightning round. There we go. Yeah, the lightning round. Lightning from fire, from heaven. So, yeah, but we'll still do three halves the way we normally do, and there'll be breaks in between. But just remember, even though you hear the voice of Steve saying to call, if you call, probably nobody will pick up. You never know, someone might be in the studio at Chesterton."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":196.9,"end":199.94,"speaker":"Fr Stephen De Young","text":"It'd be an interesting experiment, but, you know, probably not."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":199.94,"end":202.82,"speaker":"Fr Andrew Stephen Damick","text":"You know, Bobby might wander through and be like, oh, someone's calling."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":204.06,"end":209.42,"speaker":"Fr Stephen De Young","text":"Especially if the, you know, if. If the commercial is boring. Right, Exactly. You can try then."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":209.5,"end":210.5,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":210.5,"end":211.82,"speaker":"Fr Stephen De Young","text":"That might be a way to bide your time."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":211.82,"end":223.74,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So, all right. Well, unsurprisingly, we have several giant related questions, so I decided to stack them up here right at the beginning. So first we've got Maria calling."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":225.18,"end":292.86,"speaker":"Audience Member","text":"Christ is risen, Fathers, thank you so much for this podcast. It's really helped me as a teenager and an orthodox Christian trying to understand the world. My question is, are giants able to repent? You mentioned that giants come from whole clans of people participating in ultimate demonization rituals. But there's also the ritual, the specific ritual for conception of a giant. If they are born from a ritual that makes them part demon and part human, are they born with the static nature of demons or the capacity for change of humans? If the former, then giants seem to be unique in that they are the only spiritual or human being without the choice of good or evil. I know part of this is probably a materialistic misunderstanding of nature, free will, or repentance. And if so, please correct me. But the reason I'm interested is that secular culture, especially in fictional storytelling, seems to be obsessed with the theme of a half human, half monster. A person who is evil or demonic in their nature, but they can't help it because they were born that way. Does the nature of giants shed some light on the dynamic of repentance and redemption as understood by humans? Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":293.82,"end":312.98,"speaker":"Fr Andrew Stephen Damick","text":"I love this question, especially since she embedded it within the. The cultural context, because I think it's true. And I think that's why we're getting, like, all these novels about nephilim and this kind of thing. You know, even. Even romance novels which, like, I don't know what to do with that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":312.98,"end":321.89,"speaker":"Fr Stephen De Young","text":"But anyway, no, it's just. It's. It's just an extension of the supernatural romance genre."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":321.97,"end":336.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which is big. And I recently discovered there's a whole romance genre that's dedicated to, like, orcs and stuff, like fantasy orcs and. Anyway, I just don't know what to even do with that. Nothing is my preference. Nothing."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":336.49,"end":340.05,"speaker":"Fr Stephen De Young","text":"I mean, Rule 34, anyway."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":341.17,"end":344.05,"speaker":"Fr Andrew Stephen Damick","text":"I don't remember which one that is. Is this Rules of Acquisition or."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":344.88,"end":348.84,"speaker":"Fr Stephen De Young","text":"No, no, Internet rule 34. People who know will know. I won't go into more detail."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":348.84,"end":350.56,"speaker":"Fr Andrew Stephen Damick","text":"I probably used to know, but I don't know anymore."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":352.96,"end":353.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":353.52,"end":369.52,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, the short answer. Right. Is yes, giants can repent because they're still human. Right. There's not something that's been altered about their DNA that makes them not human, as we've said before. Right, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":371.13,"end":373.61,"speaker":"Fr Stephen De Young","text":"Oh, we're not trying to do this real quick. Okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":374.33,"end":376.01,"speaker":"Fr Andrew Stephen Damick","text":"This is not actually the lightning round."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":376.41,"end":406.71,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. Yeah. So, yeah, we're not talking about a DNA thing. We're not talking about. So, like, within the question. Right. They aren't sort of. They don't have a demon nature. Right, Right. But that. That ritual falls into the category of initiatory rituals. Right. So there's a reason. It may seem weird to some people, but there's. There's a reason why we do exorcisms on babies we're about to baptize."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":407.43,"end":407.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":409.03,"end":450.21,"speaker":"Fr Stephen De Young","text":"Like, a lot of the things you say in those prayers sound, like, really counterintuitive because you're like, this kid's like three or four months old. Like, how are they demon possessed? And how do they have, you know, the spirit of concupiscence within them and stuff. But, you know, in the pagan world, stuff happens. So, yeah, somebody who's ever worn those clans can repent and leave and give up those ways. And we need to understand that happening. That's key to understanding what's going on in Joshua, is that what's being wiped out is the clan Qua. Ritual structure."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":450.21,"end":451.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A way of life."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":454.09,"end":508.49,"speaker":"Fr Stephen De Young","text":"Not qua. Every individual person. Right. Now, if a person refuses to give up. Right. That way of life, then you could be in a situation, especially the ancient world, where there aren't, like, prisons, where the only answer would be for that person to be put to death. But that's not that foreign. I mean, if people were engaging in cannibalism and human sacrifice and that kind of thing today, they would probably end up getting the death penalty either directly or passively, the way Jeffrey Dahmer did. So. But yes, they can. Certainly someone from one of those groups could certainly and did certainly repent. And of course, there's Basque Santa."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":511.29,"end":513.93,"speaker":"Fr Andrew Stephen Damick","text":"Have we talked about Basque Santa? I remember you reading."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":513.93,"end":515.21,"speaker":"Fr Stephen De Young","text":"I think we have at some point."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":515.85,"end":520.09,"speaker":"Fr Andrew Stephen Damick","text":"Refresh my memory, because just the name is stuck in my head, but nothing else."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":521.53,"end":521.93,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":524.17,"end":536.26,"speaker":"Fr Stephen De Young","text":"There is a story among the Basque that there's a repentant giant involved in bringing the toys."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":536.26,"end":539.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, this is sort of like a merger with the St. Christopher thing then."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":539.86,"end":553.06,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Seems like. Yeah, so. Yeah. So. But the point is just there's. There's even later stories and, you know, in other contexts of sort of repentant giants."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":553.54,"end":669.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, I think, you know, we get this question every so often, right. But like I said, I love the way she contextualize it within pop culture questions of, you know, half giants or half monsters or whatever. And I think that the reason that the society is still meditating on this is, number one, this is actually a perennial issue that humans have always thought about, right? But I think in our. In our particular context, there's all kinds of questions going on about what it means to be human. And, you know, theologically, the only being with two natures is Christ, right? There's. There's no one, no one, no thing else that has two natures. So in this case, you're either human or you're a. A demon, you know, But. But giants are humans. And I think part of the reason that we're trying to work it out is not just this question of. Of what is. What does it mean to be a. So buried, at least within American culture is this puritanical Calvinist idea of the possibility that someone is irretrievably damned right, that there's nothing you can do. It's just sort of who you are. And it's funny that we have, culturally, we have this warring idea of, well, that's who I am, and I can't help it, for whatever sin it is that the person wants to keep doing versus I can be whatever it is I want to be. And I mean, it's like this cage match between these two ideas, and yet I have kind of no idea who's going to win this one. But I mean, the solution is repentance, right? Like, okay, you are this, but you can change what you are now. You can't change your nature, but you can change the way that you are, right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":670.48,"end":682.72,"speaker":"Fr Stephen De Young","text":"Which I think. I think. I think part of the reason. That's part of the reason for it too. Especially the sort of repentant or misunderstood monster."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":682.88,"end":683.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":683.24,"end":786.22,"speaker":"Fr Stephen De Young","text":"Is that, you know, when you take away the language of sin and repentance. Right. And a real understanding of that, people are aware of the fact that there's something a little monstrous inside them. They're. They're aware that they're capable of doing horrible things and they have horrible thoughts occur to them. And, you know, vampire fiction is one of the popular forms of this. Right. There is some part of them that looks, say, at the person they love and kind of wants to drain them, use them, you know, exploit them. And so telling a story about someone who very much is a monster and has done monstrous things, but is able to somehow redeem themselves and find a way to control that and move past that. Right. Has sort of taken the place of the earlier understanding of sin and repentance in terms of. It gives somebody hope like, oh, well, I can, you know, restrain these desires I have. I can. But the problem is it's fiction. And it's just sort of a question of, well, maybe I could do this instead of actually giving someone the tools they need to actually repent and actually have their life transformed in Christ, which is what actually lets you do that and overcome that part of you, even if you weren't born into a giant clan, that. That is capable and yearns towards those kind of things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":786.22,"end":804.54,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that kind of fiction, it functions in a cathartic way. Like, I can feel different from having read it or watched it or whatever, but it does not actually train towards virtue the way that other kinds of fiction that actually point towards repentance and that kind of thing too."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":805.1,"end":839.85,"speaker":"Fr Stephen De Young","text":"And it's worth saying that from the other perspective, that kind of literature could be deeply harmful and I'll just say toxic, because the readership, for example, of a lot of that stuff is primarily female. I don't think I'm going out on a limb to say that there are men who read romance novels, but that's a minority of the readership."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":842.17,"end":842.57,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":844.57,"end":849.21,"speaker":"Fr Stephen De Young","text":"Usually it's the male character who is like this."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":849.93,"end":850.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":850.73,"end":873.06,"speaker":"Fr Stephen De Young","text":"And it's having to overcome these horrible, monstrous desires. And I think sometimes that encourages women to get into and remain in and even see his romantic, like, really dysfunctional, abusive situations. Because it's like, oh, no, he'll be able to work through this with my love. He'll overcome his."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":873.7,"end":874.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":874.74,"end":877.78,"speaker":"Fr Stephen De Young","text":"And it's like, that doesn't work either, by the way."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":877.86,"end":878.82,"speaker":"Fr Andrew Stephen Damick","text":"No, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":879.06,"end":886.58,"speaker":"Fr Stephen De Young","text":"Like, like you. You as a human and your romantic love is not a substitute for the love of Christ and theosis."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":886.58,"end":895.12,"speaker":"Fr Andrew Stephen Damick","text":"No. Yeah, we're just not a thing. All right, well, we've got another giant question, and this comes from Caitlin."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":898,"end":971.04,"speaker":"Audience Member","text":"Hi, my name is Caitlin from Virginia. Please excuse my voice. I have Covid at the moment, and because of said Covid, I have been watching Keep Sweet, Pray and Obey on Netflix about the FLDS church with Warren Jeffs, the fundamentalist Latter Day Saints church. And on the fourth episode, there was a section where the police are raiding the temple in Texas, and they find a bed behind the altar in the temple where Warren Jeffs had his sacred rituals with his underage brides. And to me, that just spoke instantly of the Nephilim ritual that you have talked about here on Lord's Spirits. And I just wanted to know what you thought about that, if you thought there might have been a relation, because the whole FLDS thing seemed very much demonic. And I was just wondering if you thought that there was a relation between what Warren just was doing with the sacred rituals in the bed and the Nephilim ritual. So thank you very much and Father's Bless."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":972.32,"end":982.8,"speaker":"Fr Andrew Stephen Damick","text":"So we're starting with really nice, light, easy, airy questions to begin with. So, I mean, parental advisory, everybody. I watched."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":982.88,"end":984.28,"speaker":"Fr Stephen De Young","text":"Now that that's already been said."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":984.28,"end":1060.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I watched. So I watched that series, and I definitely do not recommend that for younger people. It was really interesting, though, as. As a description of a depiction of a particular kind of religious practice and. And life. And. Yeah, I. So, I mean, yeah, when you get to that episode, it's like. It's awful. It's horrible because they actually. Although they don't show you a video, there actually is audio that was recorded of what she's talking about, and they play it. So that's why I super don't recommend that for young people. I was a little horrified myself. I don't. On the one hand, I don't think that what Warren Jeffs was doing would qualify in the sense of that ancient sense of Nephilim ritual. Like, he's not trying to embody a God and breed half gods or whatever. But. But on the other hand, I mean. Okay, yeah. I mean, within Mormon theology, it kind of raises all kinds of questions about that, I guess. So there is that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1060.76,"end":1061.16,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1062.6,"end":1107.09,"speaker":"Fr Andrew Stephen Damick","text":"It's just not quite the same matrix, though. But on the other hand, like, what is actually being accomplished by Nephilim rituals in the ancient world? It's demonic sex rituals. Even if the understanding the theology of it is different, it's still the same kind of evil. Right. And in this case, it's like, it's underage girls. Oh, man. It's horrible even to think about. I don't know. On the one hand it seems like, okay, yes, there's definitely some similarities here, but I don't think that the theology is quite the same. But maybe it doesn't matter. The action is essentially the same kind of thing. I don't know. What do you think, Father?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1108.86,"end":1122.46,"speaker":"Fr Stephen De Young","text":"Well, yeah, the. And I mean, we don't have to put too fine a point on it. Right. Like quote unquote. Nephilim ritual is a category. Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1122.7,"end":1123.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1123.78,"end":1126.22,"speaker":"Fr Stephen De Young","text":"I think trying to delineate the exact borders."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1126.22,"end":1126.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1126.58,"end":1129.1,"speaker":"Fr Stephen De Young","text":"This is very clearly demotic. It's very clearly."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1129.5,"end":1151.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's. Well, and I think it's useful because, like, it's not a specific, like magical spell that you have to. I mean, maybe the pagans saw it this way. Right. But a magical spell that you have to do way in order to achieve this particular result. Like, there's a formula for that. It's just like. No, actually demonic stuff and sex stuff is bad and it produces evil, you know."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1151.28,"end":1193.41,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah. And this is. So this is one of those things where, you know, it doesn't necessarily seem intuitive to us. Like what I've said in Bible studies to people engaged in a, we'll say relatively normal way of life. I don't think our way of life is normal, but today. But relatively compared to being a member of an FLDS like community like Warren Jeffs, it's relatively normal. And I say that, you know, these two paradigmatic sins of idolatry and sexual immorality are closely linked to each other."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1193.91,"end":1194.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1194.71,"end":1206.71,"speaker":"Fr Stephen De Young","text":"In ancient Judaism and early Christianity. And people are like, sort of. Why? Like those don't seem intuitively linked. Right. But I think the modern place we see this emerge is that invariably all cults become sex cults."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1207.11,"end":1209.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1209.99,"end":1237.17,"speaker":"Fr Stephen De Young","text":"Like once you go down the road of, of spirituality following a spirit other than the Holy Spirit, you end up with sexual immorality and other kinds of corruption too. But those are like. And, and that was just an observation for Jewish people in the ancient world when they looked at gentile pagans."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1237.89,"end":1238.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1238.45,"end":1244.05,"speaker":"Fr Stephen De Young","text":"Right. They weren't making some complex argument about how the two are connected. They were just like. Well, look like."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1245.01,"end":1256.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, even when they themselves like engaged in the, the, the calf worship right there with Aaron, like it says, they rose up to play. Right. Which we all know what that means."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1256.27,"end":1311.14,"speaker":"Fr Stephen De Young","text":"Euphemism. Well, hope we may not all, but yeah, this would be sing and dance. Yeah, yeah. Or BAAL peor right. Yeah, all the way through. So, I mean, that was just observable. And the same thing for. For early Christians who are still living in a pagan world. Our pagan world has receded, but those same kind of spirits reemerge in these sort of cult groups. Right. And you know, and it's not. And this is not to pick on Mormonism, because, I mean, you can talk about David Koresh, you can talk about. Right. I mean, this is, you know, it's a spirit that is sort of poking its head up through the cracks. Right. In modern society."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1312.58,"end":1318.42,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. All right, we got one more giant question, and this one is actually about the Book of Esther. This is Paul."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1321.7,"end":1325.14,"speaker":"Audience Member","text":"Hello, Fathers. Thank you for your work and what you do."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1325.38,"end":1329.86,"speaker":"Fr Stephen De Young","text":"I very much appreciate it. I know it's a likable topic on the show."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1329.86,"end":1333.06,"speaker":"Fr Andrew Stephen Damick","text":"And so I have a question about a potential giant."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1333.46,"end":1336.24,"speaker":"Audience Member","text":"My question is about Haman from the."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1336.24,"end":1338.04,"speaker":"Fr Stephen De Young","text":"Book of Esther and whether or not."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1338.04,"end":1339.24,"speaker":"Audience Member","text":"He is a giant."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1339.56,"end":1341.48,"speaker":"Fr Andrew Stephen Damick","text":"He is said to be an agagite."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1341.48,"end":1344.36,"speaker":"Fr Stephen De Young","text":"And Agag was a king of the."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1344.36,"end":1346.68,"speaker":"Audience Member","text":"Amalekites, who are a giant tribe."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1347.08,"end":1352.84,"speaker":"Fr Stephen De Young","text":"He also has a tyrannical nature in opposing the Jews and wanting them all."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1352.84,"end":1354.76,"speaker":"Audience Member","text":"Wiped out in the story."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1355.32,"end":1357.8,"speaker":"Fr Stephen De Young","text":"And then we also have his gallows."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1357.8,"end":1359.56,"speaker":"Audience Member","text":"Which is said to be 50 cubits."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1359.56,"end":1374.42,"speaker":"Fr Stephen De Young","text":"High, which is very big. Haman built it as a cruelty to Mordecai, but he ends on it. And I'm wondering if that's a bit of divine providence to accommodate his potential height. And so I'd like to know if."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1374.42,"end":1379.94,"speaker":"Audience Member","text":"You think that Heman was a giant. Thank you again for taking the question."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1380.02,"end":1380.98,"speaker":"Fr Stephen De Young","text":"And what you do."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1381.06,"end":1387.06,"speaker":"Audience Member","text":"And as said before, I'm happy to be a longtime caller and first time listener. Thanks."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1388.1,"end":1390.94,"speaker":"Fr Andrew Stephen Damick","text":"This is something I've wondered about myself. And for those who don't have their."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1390.94,"end":1392.76,"speaker":"Fr Stephen De Young","text":"Quick cubit to feed."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1393.15,"end":1393.47,"speaker":"Audience Member","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1393.55,"end":1407.15,"speaker":"Fr Andrew Stephen Damick","text":"Cubic to feet measuring stick, a cubit is about one and a half feet. So 50 cubits is 75ft, give or take. I think a cubit isn't supposed to be like the distance from your elbow to your. The tip of your finger, I think."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1407.15,"end":1408.71,"speaker":"Fr Stephen De Young","text":"Tip of your. Your middle finger."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1408.71,"end":1409.71,"speaker":"Fr Andrew Stephen Damick","text":"Middle finger, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1409.71,"end":1417.71,"speaker":"Fr Stephen De Young","text":"But so that means it was a different measurement at different times. Usually in the Bible they're referring to royal cubits, which doesn't help you because it depends on who is king."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1417.71,"end":1422.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, yes. So you're saying Haman is a giant."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1423.36,"end":1423.84,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1423.92,"end":1430.8,"speaker":"Fr Andrew Stephen Damick","text":"Well, there we go. I mean, is that the reason why they say specifically. I think it's multiple times that he's an agagite."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1431.12,"end":1459.77,"speaker":"Fr Stephen De Young","text":"Esther 3:1. He's identified as an Agagite descendant of Agag, who is the Amalekite king who Saul was supposed to kill but didn't. And this is. I mean, I don't blame the caller for not knowing this, but they read in synagogues, they read the texts about Amalek and the Amalekites at Purim."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1460.41,"end":1462.97,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1463.93,"end":1500.66,"speaker":"Fr Stephen De Young","text":"I didn't like that you get synagogue sermons on who the Amalekites were on Purim. That's. And part of this is explaining why. Right. So the Amalekites made that first attempt. Well, we talked about Amalek. Right. The descendant of Esau, who. The daughter of Leviathan in that context of his origin. Right. Identifying him as a giant. But then the Amalekites made that attempt at Mount Sinai to wipe out."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1501.02,"end":1501.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1501.98,"end":1604.75,"speaker":"Fr Stephen De Young","text":"They sent Israel, and they were the first giant clan who, at least to the Israelites, God said they need to be wiped out completely. There can't be any left. And the reason they are identifying him as an Agagite rather than as an Amalekite is to make a further identification, because Saul was supposed to wipe out the Amalekites, but he let Ag Egg live. And within the story of King Saul, this is like his first major and egregious sin where the kingship gets taken away from him for not doing this. And there's a reading of that, that someone could take that. Oh, well, why is God mad at him for showing mercy? Now, that's not really what's going on in the text, but you could try and play it that way. Right. Know that he was just showing mercy. What cuts against that is who he spared. He spared basically people. He could take his slaves and the king so he could show up, parade him around, and show off that he defeated this other king. Right. But Agag is identified there in Esther 3:1 because it's trying to point to the consequences. Right. The Amalekites were allowed to survive. And see this late date in the Persian empire. There's one who's still trying to exterminate Judah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1605.15,"end":1625.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is one of those places where it's important to remember that the way that the story is told, including specific words like Agagite versus Amalekite, is designed to be a reference to something and not just like, oh, this is how he happens to have been known. Like, this is not a historical record in the modern sense of historical records."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1626.77,"end":1648.46,"speaker":"Fr Stephen De Young","text":"Right, Right. So that's. Yeah. So that's what it's trying to tell Us, it's trying to say, see, this is why God said we can't have any Amalekites, because as long as there were Amalekites, the demonic powers who were controlling and manipulating them would be trying to destroy God's people."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1648.54,"end":1654.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Okay. So moving on from giants, now we have one from Monica."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1657.18,"end":1726.05,"speaker":"Audience Member","text":"Hello, Fathers. My name is Monica. I'm an Orthodox Christian convert and I enjoy learning about how other Judeo Christian communities understand the Torah. I've been deep diving into the concept of family purity, Taharat Hamishpacha, as fundamental to a deeper understanding of Jewish marriage, described by some as a hedge of roses that creates boundaries and rituals to cultivate the sanctity, preservation and intimacy of marriage as God intended to the blessing of the family community and the creation of new life, all based on laws of the Torah. Now, Jesus Christ came to fulfill the law, not abolish it. Orthodox Christians are not required to keep Jewish purity laws, but as primarily Western Orthodox Christians, many of us converts. For those of us who are married or want to be married, what is our hedge of roses? What are our guidelines, rituals and understandings of clean and unclean as understood in the Torah regarding the taint of sin and the whisper of death surrounding some sexual and marital relations? How are these fulfilled but not abolished in an Orthodox Christian marriage? And how can we avoid the relativist and catch all platitude of we're just characterized by love. Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1727.57,"end":1788.62,"speaker":"Fr Andrew Stephen Damick","text":"I thought this is interesting because it touches on this question of purity which we've talked about a number of times. And there's this idea that. And she kind of alludes to it, this idea that the purity practices of the Old Testament are just sort of gone now. But that's not actually true. So the question is, how does this apply now? Right. I mean, one of the ways that obviously it would apply is chastity within marriage. You know, don't sleep with someone to whom you are not married as one of the ways of keeping things pure. But I mean, is there more to it than that? I mean, are there? I mean, certainly we have the traditions of fasting and prayer and refraining from marital relations for periods of time by mutual consent. I mean, this is all in St. Paul, right? In order for prayer to be more dedicated to at certain times, is there something else going on that doesn't get just sort of translated into what we might think of as normal sort of sexual morality?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1790.94,"end":1791.42,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1791.9,"end":1794.42,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what. I mean."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1794.42,"end":1798.54,"speaker":"Fr Stephen De Young","text":"Yeah, you already. Well, yeah, so you already gave a parental advisory."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1799.18,"end":1800.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1800.1,"end":1807.24,"speaker":"Fr Stephen De Young","text":"But I'm still not going to get graphic, hopefully. So. Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1807.4,"end":1807.8,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1810.04,"end":1820.68,"speaker":"Fr Stephen De Young","text":"St. Paul, for example, is appealing to the elements of the Torah that the caller is referring to when he says that the marriage bed is holy and undefiled."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1820.68,"end":1821.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1824.52,"end":1878.41,"speaker":"Fr Stephen De Young","text":"And so this is probably gonna get some people mad, but when have I ever cared? So there's a. There's a really weird misconception and dysfunction in American Orthodoxy, and I kind of know what caused it. There's a problem with basically taking reactionary stances. Yeah, well, we're American in the sense that, yeah, our culture is very corrupt in many ways. And so there's a tendency for us in the Orthodox Church because of course, we're trying to get away from that corruption in the culture to react in the other direction."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1879.29,"end":1879.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1879.69,"end":1880.09,"speaker":"Fr Stephen De Young","text":"To."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1880.09,"end":1880.49,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1883.62,"end":1929.24,"speaker":"Fr Stephen De Young","text":"So our, our culture is obviously completely over sexualized to an insane degree, obsessed with. With issues of sexuality. And so that causes in some Orthodox circles in the US people to take a kind of reactionary stance where they almost go to a sort of Augustinian extreme of like, sexuality is somehow innately bad, even in marriage."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1929.96,"end":1930.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1930.36,"end":1983.58,"speaker":"Fr Stephen De Young","text":"But there are, like, certain circumstances within marriage where it's okay. And that's not. The Orthodox Christian tradition is actually very balanced on this. If you take it as a whole, you get out of the reacting phase. Just look at it. It's much more similar to the Jewish tradition in the idea that when St. Paul says the marriage bed is holy and undefiled, he's not just saying sex within marriage is good. And he's definitely not saying. There was a really awkward moment in a junior high sex ed class I had where a good friend of mine who was sitting right next to me said, and this was a Christian presentation. He said, so once you're married, everything's okay. Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1984.46,"end":1987.02,"speaker":"Fr Andrew Stephen Damick","text":"Wow. And he asked this in a sex ed class?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":1987.26,"end":2088.88,"speaker":"Fr Stephen De Young","text":"Yes. And the instructor's like, well, I mean, you know, within reason. Right? Like, yeah, he's like. He's like, everything. Wow. And we're all looking at him like, dude, like what? Like, and the answer to that question is no. Yeah, right. It's no. And this is something that I think comes out of the other side. This comes out of sort of evangelical purity culture where it's sort of like nothing at all until you're married. And then as soon as you're married, it's like lust with permission. Now you can just let, you know, let the passions rage. So St. Paul also means that the marriage bed has to be kept pure and undefiled. And there are all kinds of ways you could read Leviticus 18 to defile your marriage bed. So I've argued in the past talking about Acts 15, that. Acts 15, when it applies the commandments of sexual immorality, it's referring directly to Leviticus 18. So you can look there about issues of menstruation. There are sex acts that are not permissible. And again, I don't want to be graphic, but part of the problem with the way the church has addressed homosexuality typically, is that we haven't pointed out that most of the sex acts that we prohibit to people of the same sex, we also prohibit to marry couples."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2089.44,"end":2090,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2091.52,"end":2106.48,"speaker":"Fr Stephen De Young","text":"They're seen as sinful when a married man and woman do it. And that's what we mean when we're talking about the subject of homosexuality and we say it's the act that's a sin, not orientation or something."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2106.56,"end":2107.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not a feeling."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2107.4,"end":2144.43,"speaker":"Fr Stephen De Young","text":"It's because those acts are sinful. Those acts are defiling. Those acts are corrupting to the human person. They're debasing to the human person. Right. And again, I don't want to get more graphic than we absolutely need to. And so that sense of purity. Right. That there is a purity established within the relationship when the sacrament of matrimony happens, that, that needs to be maintained by the married couple. That obviously includes not committing adultery."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2144.91,"end":2145.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2145.39,"end":2173.69,"speaker":"Fr Stephen De Young","text":"Right. But it also involves. Right. The, the, the maintenance of intimacy within the family, not committing certain corrupting acts. That. And, and there's also a problem here. So the caller mentioned, like, just saying, oh, well, everything needs to be out of love. And so the problem is love has gotten so debased in this context."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2173.93,"end":2174.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2174.65,"end":2188.04,"speaker":"Fr Stephen De Young","text":"In our modern culture, like where we say love and we mean like romantic love. Right. And then it's like, well, where's the border between romantic love and lust? And people can't identify it because there really isn't one."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2191.47,"end":2300.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The question is, what do you do? That's really what it's about. I mean, like, even, even the question of, of like, let's say, homosexuality. Right. Our culture spends so much time trying to pinpoint, like, I have this thing called love for this other person. The thing that I'm calling love, this feeling I have. And I'm saying this is love and it needs to be put up on this high pedestal that we all developed in the renaissance of this glorious, courtly, idolatrous love. Right. But, but the truth is, is that throughout most of history, same sex relationships could be intense friendships without including sexual acts. Right. I mean, like, just read Shakespeare for Instance when, if, you know, often there's men saying, you know, I love thee to each other. Right. And they do not mean that they're hopping into bed to. With each other. They mean that they really close relationship, or it can sometimes just mean, I'm doing good towards you. That's all it might mean in many cases. There's clearly even a difference of just feelings there. But the. The key question for morality is what is the action that you are doing? And I think in our. Especially in our kind of gnosticized age, where we've split the spiritual from the material or however you want to put that, it's become just way more problematic. And we, you know, so we can ask questions and people think it makes sense to say things like, but do I really love her? Like, well, what does that mean? Do I really have a feeling that hits the needle to this level? Like, what? You know, like, what does that actually mean? You know, we talk about it like it's this objective, almost empirical thing, but we have no measurement for it other than, I feel something big, you know?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2301.59,"end":2317.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And. And bluntly, the reason I say there's not really a border is if the church says to you, you're not allowed to participate in certain sex acts with this person, and you say, why are you saying it's wrong for me to love them? That's not love."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2318.07,"end":2320.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2320.87,"end":2322.91,"speaker":"Fr Stephen De Young","text":"Love does not require sex acts."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2322.91,"end":2330.1,"speaker":"Fr Andrew Stephen Damick","text":"And. And it doesn't. And love also is unselfish. It's not about getting what you want Right. Ever."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2331.22,"end":2349.62,"speaker":"Fr Stephen De Young","text":"Right. And so. Right. If. If a married couple were to tell me that if something happened medically or something where they could never have sexual relations again, that that would be like the end of their marriage, I would find that deeply, deeply sad."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2350.1,"end":2352.91,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep, yep."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2352.91,"end":2371.23,"speaker":"Fr Stephen De Young","text":"Right. But this is. And this is so. And those are some of the things, though, that make us want to react. Right. We hear about these nursing homes where people are passing around STDs, and that doesn't impress us as deeply sad. You know, our culture wants to say, well, all right, you know, hey."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2374.83,"end":2375.23,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2375.23,"end":2390.8,"speaker":"Fr Stephen De Young","text":"But so we see that in our culture, we want to react the other way and don't. The marriage bed is holy and undefiled, but the married couple has to. To keep it that way by maintaining the purity of their relationship at all levels."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2390.88,"end":2397.36,"speaker":"Fr Andrew Stephen Damick","text":"Yep, Yep. All right, well, we've got another one. This comes from Aglaida."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2399.92,"end":2404.86,"speaker":"Audience Member","text":"Father's Bless. I had a question about the crowns of martyrdom."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2405.57,"end":2408.21,"speaker":"Fr Andrew Stephen Damick","text":"I understand from your Constantine episode that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2409.25,"end":2413.57,"speaker":"Fr Stephen De Young","text":"Being crowned is being Imbued with a kind of authority."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2414.37,"end":2419.09,"speaker":"Audience Member","text":"Is that the case with the martyrs, or is there something else going on there that is unique to them?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2419.89,"end":2423.01,"speaker":"Fr Andrew Stephen Damick","text":"And also, how does the crowning of."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2423.01,"end":2432.53,"speaker":"Audience Member","text":"Martyrdom relate to marriage, which we orthodox understand is a kind of martyrdom? Thanks for your time."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2433.17,"end":2470.51,"speaker":"Fr Andrew Stephen Damick","text":"All right. I love this one because it brings these things together in a really nice, concise way. I mean, the place my mind went initially was in Revelation, where it talks about the martyrs being co enthroned with Christ. Right. That they come to life and they are enthroned with him. So there is this authority, but it's not authority like I stand and give orders to people, but it's authority in the sense of I'm responsible for this, which, I mean, that makes sense within marriage as well, that they're now responsible for this. This life that they have together and the children they're going to have together and that kind of thing. What do you think? Am I tracking okay on this or is there."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2471.23,"end":2480.35,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I would also add a lot of times with the martyrs, the crowns we're talking about are crowns of victory."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2480.75,"end":2482.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2482.15,"end":2534.32,"speaker":"Fr Stephen De Young","text":"Like the victor is crowned at the end of the contest. And so part of that is an inversion, right. In the eyes of the world, they're victims, Right. They suffered this horrible fate, but that is actually their victory right in the same moment. Their victory over the evil spiritual powers, over sin, over death. Right. Which of course, a victory they share. Right. In Christ, who won that victory. And I think that's especially important when we're talking about the marriage crowns, the crowns of martyrdom. That it's not. Okay, you guys are king and queen for the day. Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2538.01,"end":2539.05,"speaker":"Fr Andrew Stephen Damick","text":"Like, the problem that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2539.77,"end":2544.17,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It's that you're. You're. We are."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2544.25,"end":2544.81,"speaker":"Fr Andrew Stephen Damick","text":"We are."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2547.13,"end":2626.02,"speaker":"Fr Stephen De Young","text":"Crowning you in advance as you begin the struggle. Right. As you begin the race and the crowns. I think this is why they're removed, by the way. Is that, okay, this is the prize now you need to, over the rest of your lives together, attain to it. You're sort of given a taste of it. And the reason why marriage is a path to salvation is that there is struggle involved and there is dying to self involved and there is repentance involved. My confessions would be much quicker if I just sent my wife to list all the things I did. Right. Like, she'd have a better list, more detailed. And so all of that is involved. Right. And so the hope of the prayer is that this married couple will complete the race and be crowned as Victors, right at the end."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2626.26,"end":2636.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Cool. All right, this one comes from Dorian, who has a question about Ezekiel's temple. Good evening, fathers."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2636.74,"end":2639.22,"speaker":"Fr Stephen De Young","text":"My question is about Ezekiel's vision of."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2639.22,"end":2640.18,"speaker":"Fr Andrew Stephen Damick","text":"The temple at the end of the."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2640.18,"end":2642.26,"speaker":"Fr Stephen De Young","text":"Book of Ezekiel and in a couple."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2642.26,"end":2647.59,"speaker":"Fr Andrew Stephen Damick","text":"Of previous episodes, you've mentioned that Ezekiel is writing about Christ, and I would."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2647.59,"end":2656.99,"speaker":"Fr Stephen De Young","text":"Love to get that idea fleshed out a little bit, because those particular chapters of Ezekiel contain quite explicit instructions about."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2657.47,"end":2661.99,"speaker":"Audience Member","text":"Dimensions and building materials and also hints."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2661.99,"end":2666.55,"speaker":"Fr Andrew Stephen Damick","text":"At the fact that the Levitical priesthood would be restored and that animal sacrifice."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2666.55,"end":2668.83,"speaker":"Audience Member","text":"Would be restored as well, which seems."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2668.83,"end":2681.43,"speaker":"Fr Andrew Stephen Damick","text":"To stand in direct tension with Christ's priestly line coming from Melchizedek, and the crucifixion having been the ultimate sacrifice that ends the need for animal sacrifice."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2681.67,"end":2685.11,"speaker":"Fr Stephen De Young","text":"So it just feels like those things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2685.11,"end":2690.75,"speaker":"Fr Andrew Stephen Damick","text":"Are almost in contradiction with Christological imagery."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2690.75,"end":2692.87,"speaker":"Fr Stephen De Young","text":"So if there's any clarification you could."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2692.87,"end":2701.5,"speaker":"Fr Andrew Stephen Damick","text":"Offer that would be much appreciated. Thanks very much. All right, I know you've talked about this a bunch of times, so, yeah, I'd love to hear this."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2702.7,"end":2747.3,"speaker":"Fr Stephen De Young","text":"Well, so the first point that has to be made is, right, the caller is taking a very. And I don't know if he does this in general or if he's just, you know, for the sake of the text or if he's talking to someone, taking what would be called a very. A very literal read of it. Right. That. That in this prophecy, Ezekiel is predicting the future, and he is predicting the exact dimensions and construction materials, etcetera, and operations of a future physical temple. Right. And the first problem with that, Reed, is that it's a completely modern read."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2747.46,"end":2748.02,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2751.22,"end":2757.83,"speaker":"Fr Stephen De Young","text":"So Ezekiel's prophecy happened before the second Temple was built."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2758.71,"end":2760.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2760.27,"end":2765.83,"speaker":"Fr Stephen De Young","text":"And before it was kind of wrecked and rededicated, and before Herod built it up and before."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2766.23,"end":2767.99,"speaker":"Fr Andrew Stephen Damick","text":"So no one used it as blueprints."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2768.55,"end":2774.39,"speaker":"Fr Stephen De Young","text":"No one used it as blueprints, yeah. None of them did. And they certainly could. Herod especially could have."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2774.39,"end":2775.11,"speaker":"Fr Andrew Stephen Damick","text":"He had the money."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2775.91,"end":2777.75,"speaker":"Fr Stephen De Young","text":"Yeah. And spent it."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2779.35,"end":2783.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he spent a lot of money on building, from what I recall. Yes. Like, he was a big builder. Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2784.49,"end":2789.29,"speaker":"Fr Stephen De Young","text":"Yes. But no one took it that way."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2790.65,"end":2791.01,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2791.01,"end":2860.69,"speaker":"Fr Stephen De Young","text":"No one took it that way. From my understanding, the typical Rabbinic Jewish, post Christian, Rabbinic Jewish read on it, you get a bunch of different readings in the Second Temple period, but the one that sort of Rabbinic Judaism seems, from what I know to have settled on, is that this is a sort of allegorical description of the final temple which will come down from heaven, meaning the dimensions and the instructions and stuff are Sort of like the description of the New Jerusalem at the end of the Book of Revelation. Right. So even that perspective doesn't take it literally any more than we take the dimensions of the New Jerusalem literally at the end of Revelation, at least I hope, because it's a giant cube. So unless you're a Borg, I don't think we all want to live in a giant cube, golden cube. So the way the New Testament interprets."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2860.69,"end":2861.01,"speaker":"Fr Andrew Stephen Damick","text":"It."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2863.5,"end":2877.58,"speaker":"Fr Stephen De Young","text":"Is very clear, and St. John makes it even more abundantly clear than the other Gospels. Christ says, destroy this temple, and I'll rebuild it in three days. And St. John adds the editorial note, by this, he meant the temple that is his body."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2878.54,"end":2880.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2882.06,"end":2900.21,"speaker":"Fr Stephen De Young","text":"And we know what he meant by that. Now, you could say, well, that's not directly connected to Ezekiel, but It is by St. John's immediate disciples. By whom? I mean, particularly St. Irenaeus."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2901.01,"end":2901.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2904.37,"end":2978.59,"speaker":"Fr Stephen De Young","text":"St. Irenaeus, who supposedly, and I debate this somewhat, but supposedly was Achilleast. Right. The early form of quote unquote premillennialism. Right. Ironically. So you get very early details of Ezekiel's description being interpreted as elements of Christ's incarnation, because that's the understanding. The understanding is that the temple that's being described there is a way of describing the incarnation where God enters from the gate facing east, which is shut, and no one else enters, which gets interpreted as being about the Theotokos in the second century, and from then on remains the interpretation of the church. Right. So that text from Ezekiel is read at the Annunciation, I think, some other feasts of the Theotokos, and around Nativity, that part of Ezekiel's vision about the king or the prince entering and the prince coming in and eating bread."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2980.35,"end":2982.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the door being shut."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":2982.75,"end":3056.78,"speaker":"Fr Stephen De Young","text":"Yeah, the door being shut. No one else entering in through that door, the gate facing east. And this is the place from which the presence. The temple from which the presence of God never departs. Furthering this, of course, in terms of what St. John means, and part of where they're getting this is what St. John is referring to, is that again, if you go to the end of the Book of Revelation, there is no temple. And the reason St. John says there is no temple is that God and the Lamb dwell with them. Right. So the lamb, Christ, is serving the function of the temple. So there isn't one. And there's not a way. I mean, you could take, if you want to say, well, dispensational thing, there's gonna be another temple. It's gonna match those Measurements. Exactly. It's going to get built, it's going to get destroyed. Then that's not compatible with what Ezekiel says, because Ezekiel says the glory of the Lord will never depart from that temple."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3057.34,"end":3057.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3059.58,"end":3094.71,"speaker":"Fr Stephen De Young","text":"Right. So Ezekiel is describing a temple that is permanent. St. John says there isn't one in the new heavens and the new earth. And St. John identifies the temple with Christ's body and the incarnation. So all of these other things elaborating on the details, like the gate facing east and how many steps there are leading up to the altar, you can read St. Gregory the Dialogist on that. I mean, he goes. St. Gregory goes to that level of detail in breaking down the symbolism of all the measurements."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3095.11,"end":3095.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3095.75,"end":3133.78,"speaker":"Fr Stephen De Young","text":"Here's how many steps there are to the altar. Here's what they represent. Here's the. All of that is just an elaboration of what St. John does with Ezekiel's vision. There's a lot of ezekiel actually, in St. John's Gospel. But. So, yeah, so we don't have time. That's like several chapters of the book of Ezekiel. So we don't have time to go through all that in detail. The whole council archives on Ezekiel are up. But. But that was like 12. Not 12. That was like a long time ago. Eight. Eight years ago. Yeah, something like that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3133.78,"end":3136.74,"speaker":"Fr Andrew Stephen Damick","text":"Maybe we should do an episode on. On that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3137.38,"end":3163.23,"speaker":"Fr Stephen De Young","text":"Yeah. So I both don't remember what I said and therefore won't vouch for it. Like, I might now disagree with myself back then, but. But yeah, that's where. That's where that comes from. Right? That's where that comes from. So a literal interpretation of that both doesn't accord with history in terms of the rebuilding of the temple and doesn't accord with the New Testament."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3163.47,"end":3172.03,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay. We're going to take one more question, then we're going to go ahead and go to our first break. So this is from. It's either Alyssa or Elisa. I'm not sure how to pronounce it."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3174.19,"end":3267.12,"speaker":"Audience Member","text":"Hi. I had a question about some resources, maybe for kids or maybe for me, that would help me explain to my kids this more symbolic way of thinking and understanding Scripture. So we're in a homeschool group that will start teaching the Ken Ham, ray comfort, Josh McDowell type stuff, like around middle school, like just creation versus evolution and defending your faith. And, you know, that stuff really never answered my questions. Growing up as an evangelical, I always wondered, you know, how does. How does this make sense? And I've been listening to you guys for the last couple years, and finally, it's like all these questions that really bothered me my whole life are now either answered or irrelevant. And I just. I don't mind my kids reading that stuff and understanding that it's out there and that it's how a lot of Christians think. But I want to give them the. I want to give them the way to refute it or the way to understand Scripture more in depth, more symbolically, not trying to view it through the lens of modern science and history. And so I was just wondering if you guys have any books or anything that I could look into to help them understand that. I know I could pull them from the program, but right now it's better than any public or private school that we have access to. I taught at the local Christian school for a year, and, well, there was a lot of Calvinism in their Bible classes. And anyway, I just ended up pulling my kids from that and quitting and finding this homeschool group. So right now, this is the best we have."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3267.92,"end":3499.74,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, I think she hit the, the limit or whatever, but anyways, yeah, I mean, it's a good question. And I think especially for Orthodox Christians who are living, particularly in the US or anywhere where there's a minority religion, we're going to be interfacing with other people's theology and views of the Bible, no matter what, Right. Whether you keep your kids completely home and totally craft your own curriculum, or you got them in public school or a private school or some kind of co op or whatever. I mean, it's just. It's just a reality, right? I've had this with my own kids, even though, you know, we've. We've, you know, some of them are in an Orthodox school now. We've homeschooled them as well, but we were in a co op which included other Christians. I don't. I don't know of any books or resources right off the top of my head, but maybe you do, Father. But the main thing that I would say is I think the key is to frame it, right? To remain on top of it and to say, look, you're going to hear this in your program or whatever. This is what they're going to say. And the reason that they're saying this is because they assume that this is the only way that things can be true, right? And so try to lay out empiricism on some, you know, whatever's appropriate for that kid and his or her age. And so therefore, based on that, they make these arguments. Now, the way we read the Bible is different. It is not based on the idea of trying to find absolute empirical data for things and then hanging whether or not the scripture is true on that, because that's not the way the people who wrote this and listened to it thought they were communicating in a different way. So, I mean, I think that's the main, the main thing that I would do as a parent is to frame it. And I've done this, you know, my wife and I do this with our kids. We say, look, you're going to encounter this, whether it's somebody else's theology or, you know, outright anti Christian philosophy or even politics, whatever, we frame it for them rather than saying, you know, don't listen to that, never, don't be aware of that, or whatever. Now, obviously if a kid is really young, you have to ask questions. What are they ready to encounter? But honestly, I believe the biggest part of parenting is giving children the tools to encounter what they're going to encounter so that they can interpret, so that they can discern what is good and what is bad, rather than just sort of hiding from it. Like I always think of St. Basil the Great's text, that's quote usually titled something like an address to young men on the right use of Greek literature or something like that. I don't know what he might have called it, but that's how it usually appears in books. And he says, you know, the Greek literature he's talking about is not the church fathers, it's not the scripture, it's pagan literature. And he's saying this is how you appropriately read this stuff. He doesn't say, stay away, stay away, it's all pagan. You know, he says, this is how you appropriately read it. So he gives a frame for it. He, in fact, at one point he even says, they need to get this stuff down before they're even really ready for the scripture, which is kind of a whole other can of worms. But he gives a frame for encountering. He doesn't say, just read it all, or certainly doesn't say, get away, get away, don't touch it, don't listen to any of it, don't read it, because it's going to corrupt you. It's really about how do you make your way in a sinful world and get what's good from wherever you can get it. I, I don't. That might be a good text to look at, just to kind of see what his argument there is. Even though he's talking about pagan literature, a lot of the principles can be applied no matter what you're talking about. So I don't know. Father, do you have any specific recommendations in this regard?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3500.78,"end":3503.1,"speaker":"Fr Stephen De Young","text":"Well, I mean, it depends on age group a lot, too."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3503.18,"end":3504.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3505.34,"end":3514.31,"speaker":"Fr Stephen De Young","text":"So, I mean, younger kids, there are actually some. Some really good Orthodox kids books that I've seen."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3514.47,"end":3514.95,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3515.03,"end":3540.86,"speaker":"Fr Stephen De Young","text":"What makes them really good, though, is that a lot of them are relying on our tradition of iconography. And that can be one way with younger kids and even with older kids and adults, frankly. If you look at the iconography of biblical stories, like you look at the icons of the days of creation."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3543.74,"end":3544.06,"speaker":"Fr Andrew Stephen Damick","text":"You."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3544.06,"end":3597.96,"speaker":"Fr Stephen De Young","text":"Look at the icon of, you know, the expulsion from paradise, the icon of the creation of man, they're not trying to give you like a scientific, positivist portrayal of these events. Right. The icon of Noah's Ark right. At the flood. They're interpreting those events in a different way. They're not trying to create a photographic representation of what it would really have looked like and so approaching it through iconography. And I've seen the kids books I'm talking about are primarily just like illustrated with icons, but they'll have paintings and illustrations that are drawing from and in the style of iconography to try to communicate the same kind of thing."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3598.36,"end":3611.16,"speaker":"Fr Andrew Stephen Damick","text":"I think there's one called the Children's Bible Reader, which is essentially that it's Bible stories with iconographic. They're not exactly icons, but they kind of look like icons, type illustrations."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3611.8,"end":3642.37,"speaker":"Fr Stephen De Young","text":"Right. And so that's a way of getting at this kind of interpretation of those events with older kids, you know, by the time they're in high school, especially if they have some kind of background in Christian schooling, so they know the basic of the Bible. Frankly, I don't think anything Father Andrew or I have published is beyond a high schooler who has biblical knowledge."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3642.53,"end":3643.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3644.22,"end":3644.46,"speaker":"Fr Stephen De Young","text":"Just."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3644.62,"end":3647.9,"speaker":"Fr Andrew Stephen Damick","text":"And that, you know, just the basics of what's happening in the Bible."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3648.3,"end":3648.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3648.62,"end":3651.66,"speaker":"Fr Andrew Stephen Damick","text":"You know, the basic. Just narrative stuff that's there."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3652.14,"end":3729.37,"speaker":"Fr Stephen De Young","text":"Right. So, I mean, in terms of. Of actual materials, but yeah. And so not over against what Father Andrew said. But in addition, I think it's important to teach a positive. This is. At all levels. This is just kids. This is adult education. Right. A lot of times we fall into. Because again, we're a minority community. Right. As Orthodox Christians, you know, go through Romans and critique Calvinism. Right. Without actually giving any kind of positive. Okay, here's what St. Paul's actually saying. Right. And I think the latter is actually far more effective. It would be better to go through Romans and say, here's what St. Paul is actually saying, and never mention Calvinism. Right. Because. And I'm just using this as an example, you know, then when you know the college roommate's a Calvinist, right. Is trying to argue with. With your kid for. About Calvinism, they'll be like, no, that's not what that means. Here's what it means. And they'll be able to walk through in a positive way."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3729.37,"end":3729.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3730.56,"end":3806.26,"speaker":"Fr Stephen De Young","text":"And say, no, there's this entirely different way to read this. Right. Rather than just sort of debating a bunch of talking points about Calvinism or whatever. And the same is true with this. Right. You don't want to fall into only teaching them. Okay, here's why Ken Ham is wrong. Here's why, as I once argued as a petulant Teenager with Josh McDowell in person, why it isn't evidence that it doesn't demand a verdict, but to say, hey, here's our positive view of what this story is about and what it means. Right. This story about Adam and Eve being cast out of paradise is not about how God has doomed us all to death for our sin, that we all inherit this horrible guilt and there's nothing we can do about it. Right. And you don't teach them why that's wrong. You teach them, no. This is a story about how God made us mortal so that we wouldn't live forever in our sinful state and gave us this life of repentance."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3808.34,"end":3808.62,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3808.62,"end":3810.1,"speaker":"Fr Stephen De Young","text":"That we could return to paradise."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3811.86,"end":3812.02,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3812.02,"end":3824.74,"speaker":"Fr Stephen De Young","text":"And when you teach them the positive meaning of these passages, it's far more powerful and actually, I think equips them better to then deal with alternative views than just knowing why the alternative views are wrong."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3829.14,"end":3835.66,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're going to go ahead and take a little break, and we'll be right back with more of your questions here on the Lord of Spirits podcast."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3835.66,"end":3851.91,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3855.35,"end":3919.18,"speaker":"Audience Member","text":"New from Ancient Faith publishing. Psalms of Salvation. The strength of Abba Moses. Freedom, power, strength. These he would gain, then lose. Released from slavery and no longer frightened by his master's whip, Moses uses his new freedom and great physical strength to rob and destroy. Consumed by his own desires and unable to escape the reminders of his past, Moses must learn of the true source of freedom and power. Meet St. Moses the Strong, also known as St. Moses the Black. As he surpasses his physical strength with spiritual discipline, obtaining the crown that thieves can neither harm nor steal. The Strength of Abba Moses, a graphic novel by Gabriel Wilson, is now available@store.ancientfaith.com that's store ancient F."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3922.37,"end":3938.37,"speaker":"Fr Stephen De Young","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3941.01,"end":3955.43,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the second half of the Lord of Spirits. Asynchronous Q and a for many. 2023. We just tackled seven questions. We're going to do several more. So our first one comes from Christy."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":3958.95,"end":4046.53,"speaker":"Audience Member","text":"Hi, my name is Christy. I am just beginning the process of becoming an Orthodox Christian and I would love some help understanding prayer in the Orthodox world. All my questions would sound incredibly Western and probably wouldn't even make sense to a lot of cradle Orthodox. So I'm coming to you, too. You help me understand things and I know that you at least understand the Protestant world I'm coming from. So I would love to understand how to do it. What does it mean to pray as an Orthodox? Are there rules to it or is there a lot of freedom there? How much do I need to pray with books as opposed to praying out of my own mind? Do I need to be praying before icons? Do I need to be praying aloud? Those sorts of things that when I ask Orthodox people, they seem confused and seem to think I am trying to make it very legalistic, which is not really my goal. But I can understand why it comes out that way. Also, I want to understand just generally what it does, which is such a, such a post Enlightenment question. But what am I accomplishing when I pray? What is my goal? So thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4047.57,"end":4059.52,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. So Christy says she's new to the Orthodox faith. So. Welcome, Christy, welcome. I mean, the quick answer, right, to the first part of her question of how do you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4059.52,"end":4060.08,"speaker":"Fr Stephen De Young","text":"Here it comes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4061.04,"end":4062.08,"speaker":"Fr Andrew Stephen Damick","text":"What? What's that?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4062.56,"end":4065.52,"speaker":"Fr Stephen De Young","text":"Here it comes. Oh, I know where this is going."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4065.6,"end":4066.24,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4066.32,"end":4067.28,"speaker":"Fr Stephen De Young","text":"Okay, go ahead."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4067.28,"end":4072.16,"speaker":"Fr Andrew Stephen Damick","text":"All right, all right. Well, I mean, the quick answer is, you know, ask your own priest, right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4072.32,"end":4073.12,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4073.2,"end":4082.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He'll explain it. Like he'll say, do this, do this, don't do that, do this. So you knew that I was going to say that?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4082.49,"end":4084.25,"speaker":"Fr Stephen De Young","text":"Yeah, I knew that. I knew that's what it is."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4084.25,"end":4088.21,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, it's good advice, right? Especially when you're looking for practice."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4088.21,"end":4090.09,"speaker":"Fr Stephen De Young","text":"We can say some broad Strokes things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4090.25,"end":4247.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I would say broadly pray as the church prays. Right. The main thing, be involved in the services that are going on at your parish as much as you can. Go to as many as you can. I mean, not everybody can go to all of them, but go to as many as you can. And, you know, keep a prayer rule that your priest sets for you, which. Yeah. Is going to involve standing in front of icons. Yeah. It's going to involve praying out loud. Although, I mean, there's some. Some people have circumstances where maybe that wouldn't be the best idea. Like maybe the only place I have to pray is where someone else who, you know, would. Would really object, would. Would be really mad or something like that. And so you just, you know, do it silently to. So that you could still do it, but. But not, you know, harm your local relationships, whatever. But, but yeah, I mean, all. All of these kinds of prayer, like out loud or even silently, meditatively, the Jesus prayer, over and over again from prayer books, even a little bit of just, I mean, you know, extemporaneous prayer. Right. These are all things that are normal part of orthodox Christian life. But the key thing is to be guided by your own parish priest because different people have different things. Like, someone might be so used to just being super extemporaneous that they need to learn the discipline of using the prayers of saints. And I think one of the big reasons for that is that the saints, being holy, experienced people who are drawing on the tradition, drawing on scripture, that the prayers that they have are formative in a way that makes you more like Christ. Right. Makes you more steeped in the orthodox tradition. Whereas if you're only ever praying extemporaneously, that still is formative, but it's formative in a way that's very, very subject to your personal feelings and thoughts and so forth. You know, like if you're doing it yourself, then you're just forming yourself. Right. It's like they say, you know, that the. The what. What's the phrase? The. The defendant that has himself as. The lawyer, that has himself as a client. I don't know how it goes, but you know what I mean? Or like a doctor treating himself. I guess it's not a good idea. You know, with prayer, we're trying to be formed, which I think kind of leads into the second part of what it does. Right. I've heard you articulate that in really, really great ways, Father. So I'm a hand off."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4247.96,"end":4261.81,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, before I get to that, a little on the first part. Yeah, yeah, yeah. If, as Father Andrew doesn't you listen to rappers freestyling?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4264.13,"end":4265.41,"speaker":"Fr Andrew Stephen Damick","text":"I'm aware that it exists."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4266.77,"end":4286.37,"speaker":"Fr Stephen De Young","text":"And you do this very much. You'll notice that any given rapper, when they decide to freestyle, they have certain rhymes and things that they fall back into. If they get a little stumped and they need a second to think, they just sort of fall back into the. These repeated things and tropes and things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4286.37,"end":4286.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4288.48,"end":4302.16,"speaker":"Fr Stephen De Young","text":"And that tends to happen with a lot of prayer in the evangelical world, because there's this thing that it has to be extemporaneous or it's not legit or something."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4302.32,"end":4333.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which let me point to a really good book on where that developed. Laurie Branch. Dr. Laurie Branch, who's in Iowa. She has a book called Rituals of Spontaneity, in which she tracks how it is that spontaneous prayers came to be regarded as the most authentic kind of Christianity. So if you're interested in, like, studying that, I mean, it really gets into the weeds, which is great if that's what you're into. But I just want to point at that. At that book."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4333.68,"end":4348.13,"speaker":"Fr Stephen De Young","text":"Yeah. But they don't end up being spontaneous because everybody has sort of a groove that they fall back into. Right. And one of these things that I like to point out, because this is super common with evangelical prayers, is the number of times they use the word just."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4348.21,"end":4351.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lord, we just. And just. And we just wadu."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4351.17,"end":4354.05,"speaker":"Fr Stephen De Young","text":"And we just wadu. And we just wadu. You could only say just once."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4354.21,"end":4362.41,"speaker":"Fr Andrew Stephen Damick","text":"My favorite, and I'm not trying to make fun of anybody, but it is a little funny, is the people who are saying, like, father God, Father God, Father God, like, over and over. But."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4362.41,"end":4396.2,"speaker":"Fr Stephen De Young","text":"But that's an example. That's. They're trying to think, and so they fall back into sort of a comfortable, like, groove. But why is that a major problem? People are doing their best. Right. That's the worst. When you're in public and someone throws to you to just spontaneously pray. And you've got to come up with something. So the core of why that's a problem is getting at the second question. Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4396.28,"end":4396.68,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4398.76,"end":4532.83,"speaker":"Fr Stephen De Young","text":"What lies at the core of the difference between prayer and magic? Magic is trying to get some spiritual power or force to do what you want them to. And this is the way a lot of us have spent a lot of our lives approaching prayer. I want God to do something for me or keep doing something for me, or thank him for doing something for me in the hopes that he'll keep doing it for me. I want to state his good graces so he'll keep doing good stuff for me. And so that's how we approach prayer. And if we really want him to do something, then we try to get as many people as possible to also pray that God would do that thing. As if, like, it's a democracy or something. Like, if you could just get enough likes, then God will do it. Right? And that is, again, magic, not prayer. Prayer doesn't change God because God doesn't change, and he doesn't need to change. And we don't want him to change. Right? Don't worry. He can't. He won't. Prayer is about changing us. It's about bringing ourselves in line with God's will in the world. It's about reconciling ourselves to his providence. And you see this in biblical prayers. One of my favorite examples of this actually comes from the story of the tree Yeats that we read on Holy Saturday, where before Shadrach, Meshach, and Abednego get thrown into the fiery furnace, they say, you know, our God is able to deliver us from this. So we pray that he will. But even if he doesn't, right, we're still not going to worship this idol."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4533.63,"end":4534.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4535.79,"end":4819.95,"speaker":"Fr Stephen De Young","text":"And too much of our prayer is, again, God, heal me of this, or heal this person of this. Don't let this dying person die. And then when that person dies or when that person isn't healed, then we say, well, prayer doesn't work, or we get mad at God for not doing what we want, or we try to find reasons why God didn't do it. Well, is it because I'm sinful that he won't do this for me? Is it because that person is sinful and that's why they're sick? And all of this is spiritual dysfunction. The real goal of prayer, for example, for the sick and. Well, I'll get to that in a minute. Prayer for the sick is to reconcile ourselves to the sickness and suffering in this world and to know that it is God who brings healing. It is God who brings health to us and everyone else. When we're healthy, it's not just we're naturally healthy. And then when someone gets sick, God is doing it and to transform us and the way we view the world and to try to come closer to God's perspective on things. The thing I put a pin in just there is this is another element that runs counter to a lot of. A lot of the Protestant world, is that we should always be praying with as many people as Possible. The Protestant world tends to have the opposite emphasis. Like real prayer is something you go and do in your closet. That's the real intimate, right? Like deep prayer. And the perspective is actually the opposite, right. Like that's what you do if you can't find anyone else to pray with. So if so, for example, as Father Andrew said, if the church is having a service, best case scenario is that you're there praying with the whole community, right. United together in prayer. If you can't do that, right. For whatever reason, right. Next best is you're praying with your family. If you can't do that, next best is you're praying with someone else or some other subgroup of other Christians. And if you are only by yourself, then you pray with the saints, with the angels, right? But that's never really solo because Christ is never really solo by himself. He's surrounded by the saints and the angels and is worshiped at all times and every hour. And we join that in progress when we pray, that praying is already happening and we join the group. But so that's the goal. And that's why the reason I started this by talking about sort of faux spontaneity is starting out using written prayers, right? That doesn't mean there's nothing wrong with. You're driving down the street, you see a car accident, you make the sign of the cross and pray that God would bless whoever was involved in the car accident. Good. Right. You don't have to go and like, oh no, where's my prayer book? Where's my prayer for someone who's been in an accident? Right? But your normal cycle of prayer and your normal rhythm of prayer using written prayers especially at first, is you have to sort of mold your way of praying, right? So that the prayers you're praying are going to help shape you and transform you, to draw you closer to God. That is not the ultimate level of prayer. That's the beginning of prayer. And then prayer moves on from there as you're shaped and transformed by it. Because those prayers were all written by somebody who was a saint. And part of how they became a saint was they were praying other prayers that pre existed them. So there comes a time when you're more shaped and you're more able to do that. And there's even higher levels of prayer where there's no words involved at all, which I of course, have not achieved."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4820.19,"end":4872.48,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, I mean, Elder Emilianois, the modern elder and he was the former the abbot of Simonopetro monastery on Athos. He died just. I Think just a couple of years ago, maybe he makes the distinction between. He uses Greek words. He uses prosefchi, which is the usual Greek word for prayer, and then. Which also means prayer. But he defines the first. This is in one of his essays. I can't remember which one it is now. He defines the first essentially, as the thing that we normally think of as prayer, like asking God for something. Right. Which is. I mean, that is. That's valid. It's good. That's prayer. But. And then f. He is this sense of, like, abiding in God, and that's this very much higher level, you know, which takes a lot of purity and so forth. But it's definitely a thing."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4872.48,"end":4873.24,"speaker":"Fr Stephen De Young","text":"It is a gift."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4873.24,"end":4875.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it is A gift is a gift. Yeah, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4875.6,"end":4876.28,"speaker":"Fr Stephen De Young","text":"That he gives."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4876.28,"end":4887.55,"speaker":"Fr Andrew Stephen Damick","text":"It's not achieved by working really hard. Yeah, yeah. All right. Well, we've got a question from Margaret, who wants to ask about unicorns."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4890.18,"end":4961.11,"speaker":"Audience Member","text":"Hi, Father Stephen and Father Andrew. My question today is one my younger self often thought about, and I'm a little embarrassed to ask it as an adult, but here it goes. When I was younger, I loved unicorns. They were my favorite fantasy creature. I love how they were described. Lion's tail, their appearance, sort of being a hybrid of a horse and a goat, and of course, a singular horn on their forehead. I loved how they were often associated with protecting maidens or visiting them when they needed. Needed them most. And of course, especially in those famous unicorn tapestries, the unicorn's death is visually equated with Jesus's death. Hybrid creatures in their creation are often associated with nephilim and are described as having aggressive or questionable character, like a chimera. Satyrs or centaurs. In the kgv, unicorns are mentioned, but I have read that it is better translated as wild ox. Here is my question for you both. Do you think unicorns in any respect are a real creature that walked the earth? Are earthly hybrid creatures ever good creatures? I just recently read through the Book of Daniel, and horns on creatures seem to have a spiritual significance, and maybe there is a spiritual significance to a singular horn on a hybrid creature. Thank you for your time."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4962.71,"end":4990.42,"speaker":"Fr Andrew Stephen Damick","text":"I love questions about unicorns and all this kind of stuff. I think there's a bunch of things that we could say here. Like, one, I would say that the stories in scripture that include this kind of thing are different from, like, the. So, like, she's talking about the tapestries that she's mentioning. You can go see them. They're at the Cloisters Museum in New York, which is in northern Manhattan, because."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4990.66,"end":4993.14,"speaker":"Fr Stephen De Young","text":"We talked about biblical unicorns in one of the."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4993.73,"end":4994.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":4994.65,"end":5004.21,"speaker":"Fr Stephen De Young","text":"Las Vegas episodes. And we talked about aurochs, which is what. What she was referring to. But yeah, so most. Most of her question is actually for a medievalist, so I get to punt on this one."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5005.81,"end":5009.77,"speaker":"Fr Andrew Stephen Damick","text":"So I'm not a medievalist exactly, but I'm kind of medievalist adjacent."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5009.77,"end":5010.61,"speaker":"Fr Stephen De Young","text":"Closer than me."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5010.61,"end":5084.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, maybe. And kind of, you know, medievalist wannabe. Right. So, I mean, the medieval world that produced, like, those tapestries is thoroughly Christian. Right. I mean, they're much more pagan adjacent than we are. But for most of that stuff, it's still centuries in the past. Right. So when you get stuff like that, it's not an attempt to smuggle in something pagan or something evil or whatever, like you said, you know, within those tapestries, it's a. Is a Christian interpretation of this. And so a lot of the way that that kind of stuff shows up, like another example, for instance, is the. The. The theme of the questing beast. Right? So you get like, usually it's a stag, but there's other stuff too. You know, these. These mystical animals that appear in the forest and then. And then somebody goes, and, you know, the hero runs after them and then has a vision that that could lead to salvation or damnation. I mean, interestingly, that that particular image is actually based on. From the life of Saint. It's based on the life of St. Of Stathios. But. But anyway, you get a lot of."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5084.33,"end":5085.69,"speaker":"Fr Stephen De Young","text":"About Jagermeister."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5085.77,"end":5086.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5087.61,"end":5088.77,"speaker":"Fr Stephen De Young","text":"Now, I have a touch point."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5088.77,"end":5222.56,"speaker":"Fr Andrew Stephen Damick","text":"There you go. But within those stories, it functions very differently than it does biblically. It's intended to point towards a higher reality. It's intended to point towards the other world. So it's become Christianized. It's become Christianized. And so, I mean, we've talked about this. Like, with dragons, right? Even biblically, you've got good dragons and bad dragons. So a lot of what's going on with those medieval depictions is taking stuff that might have been considered a bad image at one point and just reinterpreting in a completely different way. Which is one of the reasons that a lot of the, you know, within the stories of Middle Earth, for instance, Tolkien stories, you've got. He does both. Like, he has bad giants and kind of good giants. You know, he imagines what if there's both? But these are fictional accounts that are designed to point towards something. This is not the same as saying, like, okay, well, in reality, we could have this Right. The point is that these. These images are being repurposed to tell a different kind of story. Right. So I think it's important to make sure that we. Even though the boundaries sometimes are a little fuzzy, there are still boundaries, and we still, you know, when we look at those unicorn tapestries, which I recommend if you're in, if anybody's in New York or near New York, the Cloisters Museum is a great museum. It's almost all medieval Christian art. So it's. And the architecture is really just interesting in and of itself, too. So probably my. One of my favorite American museums, if not my favorite. You know, go. Go see. Those tapestries are really, really fantastic in. In multiple senses of the term. But, yeah. So, I mean, not every monster has to be evil. Not every hybrid creature has to be evil. But there's a difference between using it fictionally and trying to figure out what's going on biblically, where most of the time, the account there is not intended to be fictional, but is rather something else."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5224.56,"end":5293.16,"speaker":"Fr Stephen De Young","text":"I will say that angelic beings, whether we're talking about in the Bible or completely not coincidentally, pagan gods and things like satyrs and centaurs, are depicted as hybrid forms. Right. Just that type of being is depicted as hybrid forms. So, for example, the four living creatures, the cherubim, who have different animal parts, they have wings, they have different faces of animals. Right. So that's just. Theriomorph. Spiritual beings is just a common thing. Now, the pagans were primarily interacting with demons throughout that period, but those are kind of descriptions of those beings. And concerning unicorns in particular, we do have to say they are not a biological creature that. That once walked the earth. But there are narwhals swimming in the ocean, causing a commotion because they are so awesome."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5294.12,"end":5296.52,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Basically, unicorn whales."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5297.16,"end":5297.64,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5297.64,"end":5302.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. An actual thing. Yep. Okay. Thanks for that, Margaret. Okay, next is Jake."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5305.4,"end":5315.09,"speaker":"Audience Member","text":"My question is, how could someone who's not a scholar or a theologian discern which of the historic churches is the true body of Christ? Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5316.37,"end":5359.77,"speaker":"Fr Andrew Stephen Damick","text":"It's a simple question, but I think it's a really important one because especially the way that orthodox Christianity often presents evangelistically or apologetically in Western culture. Is that you need to be some kind of scholar or theologian in order to figure this stuff out? Like, well, do the homework. Do all your research. Is there no room for someone to come into the church who has done a bunch of research? You know, I remember. I remember reading one time someone complaining that American Orthodoxy is a book club for Upper middle class white people, something like that, which it's not. But like there's something to that criticism that comes off."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5359.85,"end":5370.73,"speaker":"Fr Stephen De Young","text":"Well, anyway, that comes off as super racist to me. But anyway, right. Like non whites or poor white people don't read books apparently."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5370.73,"end":5371.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5371.31,"end":5372.11,"speaker":"Fr Stephen De Young","text":"According to this person."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5372.11,"end":5627.58,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, yeah, I, you know, I, I think that there's part of the problem is the way that our culture tends to frame things is like it, it, you know, the expertise is the path to truth in, in every case. Right. And, and you know, so, so therefore if you don't have expertise or you haven't done your research, whatever, then you can't make any truth claim. There's a couple things that I would say is, number one, people become Orthodox Christians all the time who have never done any of this kind of research. And a lot of times it's because they showed up at an Orthodox church and they met the people and they felt loved. Which, you know, turns out to be one of the things that Jesus said would be a proof of the reality of those who are his disciples. But also I would say another major frame for my thoughts about this is that God judges everyone based on what they do with what they have. So while I would not say that I believe, you know, that I believe very much that the Orthodox Church is uniquely the church, right? So I would not say that some other church is uniquely the church, but I would also say that someone who is involved in another Christian group and according to the best that they know, right? Like maybe they've never heard of the Orthodox Church or maybe their presentation of it was so bad, you know, or so sad, so, you know, pathetic that they weren't able to recognize Christ in it, you know, that they said, no, I can't do that. I mean, I'm not the judge. But my opinion, and this is just my opinion, is that God is going to judge someone who is humbly and earnestly doing the best that they can with what they have much more mercifully than he is, someone who is formally Orthodox and has all of this tradition in front of them and is not living according to the commandments of Christ. Now these might be extreme comparison to make. And again, this is my opinion because, you know, people have opinions. So that's my thought about it. So I mean, I don't know that that answers the question directly, but at least part of what I would say is people need to go where they see Christ. And that might sound like a purely subjective thing to say, and it might be somewhat subjective, but sometimes People who belong to the true church of Christ obscure Christ for other people and it makes it hard for them to see him. That's just a reality. I don't think that everyone needs to be a theologian or a historian or a scholar or whatever, because the truth is, even people who are, are like people who have look at all exactly the same set of data and really pursue it. They don't all make the same decision about it. And it's not just because, you know, they might be evil or that they might be ignorant or that they might be too stupid to get it right. I don't, I don't think that we can always say that people we disagree with are either, you know, have some kind of ulterior motive or that they just don't know enough or they're just too dumb to get it. I don't think that that's always true. Sometimes people in good faith make decisions that I disagree with and in good faith and with a lot of research and with perfectly good intellectual capability make decisions that I disagree with. I'm not going to say, well, you're damned because you made the wrong decision. That's not my place. So I don't know that there's an easy answer. But I mean, I just say like, pursue Christ. And yes, sometimes that means you're going to get it wrong. But I think if you're, if you're humbly pursuing Christ and you're earnestly seeking Him, God is going to see that. I believe that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5631.66,"end":5641.59,"speaker":"Fr Stephen De Young","text":"So a couple things. One thing is defining expertise."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5641.99,"end":5642.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5643.03,"end":5676.88,"speaker":"Fr Stephen De Young","text":"I don't think the problem is so much that, well, I got to tick off a few people every episode. So it's interesting to me that a lot of the folks out there, including orthodox folks who are the most pro hierarchy, who are like, hierarchical organization is the way to go. This is biblical. We're in a hierarchical church. Hierarchies are good. The one hierarchy they don't like is the hierarchy of expertise."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5679.92,"end":5683.84,"speaker":"Fr Andrew Stephen Damick","text":"Or sometimes don't like. Or even sometimes the ecclesiastical hierarchy that they are actually."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5684,"end":5688.72,"speaker":"Fr Stephen De Young","text":"Well, that too. The actual. Yeah, they like the non. Theoretical."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5688.72,"end":5691.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they like the hierarchy where they're the guy in charge."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5692.24,"end":5725.92,"speaker":"Fr Stephen De Young","text":"Right. But also the hierarchy of expertise. They don't like someone saying like, hey, well you know what? Someone really smart who has studied this for years and years knows more about it than you and so you should defer to them rather than your own judgment. Right. Which is sort of when they're actually called to acknowledge a hierarchy and don't want to. So that happens. But the expertise we're talking about with the church is not really intellectual."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5727.04,"end":5728.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5729.04,"end":5745.22,"speaker":"Fr Stephen De Young","text":"The expert on orthodox Christianity is not the smartest guy in the room. It's the holiest guy in the room or gal. Right. And I say this as someone who is sometimes the smartest guy in the room, but never the holiest guy in the room."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5745.45,"end":5745.69,"speaker":"Fr Andrew Stephen Damick","text":"Room."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5746.33,"end":5790.22,"speaker":"Fr Stephen De Young","text":"So this is a statement against interest here. So the holiest person, the most pious person, the person who's closest to God, who may not have finished high school, is the expert, not me with PhD plus other stuff. So that's the person we need to be deferring to. That's the person we need to be looking to for expertise in terms of the church. The other thing is this is another place where I think there's a little bit of a reactionary thing within American orthodoxy. And that's a kind of reactionary anti intellectualism."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5790.78,"end":5791.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5793.34,"end":5824.35,"speaker":"Fr Stephen De Young","text":"And the problem with this reactionary intellectualism is not actually distrusting intellectuals because it's healthy to distrust intellectuals. It's the problem is that to be totally blunt about it, most people, including most of our institutions, including most of our orthodox institutions in this country, think the average person is stupid."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5824.99,"end":5825.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5827.79,"end":5828.83,"speaker":"Fr Stephen De Young","text":"They really do."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5829.07,"end":5831.39,"speaker":"Fr Andrew Stephen Damick","text":"Which they're not, actually. I mean, it's."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5831.39,"end":5832.03,"speaker":"Fr Stephen De Young","text":"They're not."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5832.03,"end":5856.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Like it's so often I, God help us, I even see clergy underestimating. Oh, well, that's too high level. I'm like, you know what? Every time I dive into something that I think is going to be way too nerdy for people, people are like into it. You know, even just at a parish education class or something where you're not necessarily attracting from worldwide all the people who are into your thing. We underestimate people a lot."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5856.97,"end":5995.84,"speaker":"Fr Stephen De Young","text":"Yeah. This is a deep cut example, but there's some quantity of Dutch Reformed and former Dutch Reformed people out there who will know what I'm talking about. But I think it's a good example. So there was a church split in the Christian Reformed Church in North America in the 1920s where a group called the Protestant Reformed broke off. And there were a couple of pastors who split off from the denomination who kind of led that. One of them was Reverend Dan Hoff in Kalamazoo, Michigan. And at one point, when I was a Dutch Reform pastor, I met his organist, who was still alive, was retired in a. In a retirement home at that point. And she gave me. She had collected all of his bulletins from back in the 1920s from when the split happened. And they were part in Dutch and part in English and she gave them to me. But the most fascinating thing to me was that these are just the Sunday bulletin. Okay? And for folks who don't know of the Dutch Reformed denominations in the United States, the crc, the Christian Reformed Church in North America were the black shirts. They were the working class denomination as opposed to the rca, who were the white shirts because they wore white short sleeved shirts because they were working in offices. They were like the middle class, upper middle class denomination. So this is a splinter group, a kind of fundamentalisty splinter group that broke off from the working class denomination. So this is sort of the Dutch Reformed equivalent of like an independent fundamentalist Baptist. So in terms of the education level of the, of the parishioners and in each of those Sunday bulletins there was a theology page teaching some aspect of Reformed, like Calvinist theology, including one where the Dutch farmers who went to church that week read all about the difference between superlapsarianism and infra lapsarianism, which I."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5996.56,"end":5999.12,"speaker":"Fr Andrew Stephen Damick","text":"Still can't figure out quite the details of that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":5999.44,"end":6001.6,"speaker":"Fr Stephen De Young","text":"And I've tried to explain it to you a couple times."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6001.68,"end":6005.98,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. I'm just like, what? What?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6006.14,"end":6037.19,"speaker":"Fr Stephen De Young","text":"Okay, so. And I do not think, you know, I do kind of think you're not much if you're not Dutch, but. Right. I do not think we have some sort of intellectual superiority over all the peoples of the earth where our farmers can learn these things and you know, everybody. And if, if you look at the Orthodox church especially you look at the average education level of an Orthodox church parishioner, it's much higher."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6037.43,"end":6039.59,"speaker":"Fr Andrew Stephen Damick","text":"Especially in the U.S. yeah, yeah, especially."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6039.59,"end":6080.62,"speaker":"Fr Stephen De Young","text":"In the U.S. but I, when I started doing the Bible study that is now the whole Council of God podcast 12 years later. But when I started doing that, and for years when I was doing that in West Virginia, some of the most faithful people who were there every single week for that Bible study, which I'm doing at about a college level. Right. Were women in their 80s who were cradle Orthodox and English was not their first language. And they were there every time to hear college level Bible instruction and loving it and getting a lot out of it."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6080.62,"end":6082.18,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6082.66,"end":6159.72,"speaker":"Fr Stephen De Young","text":"So our people are not stupid. People in general are not as stupid. Right. It doesn't matter what social class they're from, they're not stupid. In fact, there are a lot of rich idiots, I don't know if you've noticed. And so I don't think reading a few books or attending some adult education or learning a Little bit about church history, I don't think requires you to be a genius or a scholar or to get a PhD. Right. And the idea that somehow piety and that are juxtaposed in some way is a problem too. So understanding the history of our faith should. Is not. Not only. Not a hindrance to piety, it's. It's a help. And so, to some extent, bringing this all back to the question, part of my answer, the question is, if you really don't know anything about any of those topics, it'll be really hard to decide which one."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6160.6,"end":6161.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6162.6,"end":6175.74,"speaker":"Fr Stephen De Young","text":"Because you're doing it based on not knowing anything. Right. And the more you know about those topics, the more educated and opinion you'll be able to form and the better you'll be able to judge."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6177.42,"end":6182.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, we've got now one from Olivia."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6185.74,"end":6258.96,"speaker":"Audience Member","text":"Hello, Fathers. My name is Olivia. I'm calling from Toronto, Canada. Thank you so much for this podcast. It's truly opened my eyes to the spirit spiritual realm and the relationship between the material and immaterial. My question is about psychedelic substances. Now, I want to preface this by saying I understand that there are no shortcuts, and using substances like marijuana or psilocybin or whatever open us up to the spiritual realm in an uncontrolled way, and the demons take advantage of us as soon as they can. So that is absolutely understood. But one time I did hear Joe Rogan talk about the experience Moses had with the burning bush where he saw the face of God. And he was saying that some scholars apparently have said that in that area of the world, there are. There's a breed of bush that, when burned, releases dmt. I'm sure you know what DMT is, but for those who don't, it is considered sort of a God substance, where for a short amount of time, like 90 seconds or something, you sort of see God for lack of better phrasing. So I just wanted your take on that. Is it possible that it was DMT that is on or not, and Joe Rogan doesn't know what he's talking about? Thank you so much for the show. God bless you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6259.76,"end":6269.04,"speaker":"Fr Andrew Stephen Damick","text":"All right. Could it be that Joe Rogan doesn't know what he's talking about? It could. It could be."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6269.2,"end":6275.16,"speaker":"Fr Stephen De Young","text":"I have to say, I have to be fair. Newsradio, incredibly underrated television program."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6275.16,"end":6277.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, I watched that years ago."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6277.88,"end":6280.52,"speaker":"Fr Stephen De Young","text":"Yeah. Holds up pretty well, too."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6282.6,"end":6283.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6284.04,"end":6285.8,"speaker":"Fr Stephen De Young","text":"I have to say something nice about Joe Rogan."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6285.8,"end":6286.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there you go. Okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6287.32,"end":6287.88,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6289.8,"end":6291.08,"speaker":"Fr Andrew Stephen Damick","text":"Before you say other things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6292.6,"end":6292.96,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6292.96,"end":6333.62,"speaker":"Fr Andrew Stephen Damick","text":"I Mean, my first thought about. I mean, I'm not trying to laugh too much here. Thank you. Lift you. But like the burning bush, right? It's not on fire. Like, it's not burning up. So the idea that it's going to release a chemical that's going to make Moses high and quote, unquote. See, God is not consistent with the biblical image, nor certainly the way that the Orthodox church is interpreted as the bush that's burning, yet not consumed. It's not burning up. Right. There's this fire within it, but it's not burning it. Right. So I don't know. I don't know what else to say beyond that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6335.22,"end":6337.18,"speaker":"Fr Stephen De Young","text":"Let me say a couple more nice things about Joe Rogan."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6337.18,"end":6337.7,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6338.42,"end":6346.74,"speaker":"Fr Stephen De Young","text":"I really liked his interviews several years ago with the one he did with Henry Rollins and the one he did with Chuck Poloniuk. So there we go."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6346.82,"end":6347.38,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6348.83,"end":6369.23,"speaker":"Fr Stephen De Young","text":"Now that said, now he is. I mean, he's kind of pointing to. There is a weird sub genre of biblical studies literature trying to explain various visionary experiences in the Old Testament as being the result of who's energetic drugs."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6369.23,"end":6369.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6370.35,"end":6422.01,"speaker":"Fr Stephen De Young","text":"Right. So it's very common, actually. So there's a whole subset of what was Ezekiel taking? Right. Coming back to the prophet Ezekiel with the visions and stuff and walking around naked and all those kind of things. So that is a thing that people do. It's very early modern. It's kind of a throwback to the 18th century. Right. Like 18th century biblical studies. Like, it's so fascinating because you get all these things like, okay, well, so here Jesus is walking on the water. Well, we know that's not possible. Right. Because miracles don't happen. So there must have been a hidden sandbar. Right? He's walking out on a sandbar. And then somewhat in the early 19th century, I think, finally just kind of said, this had to be in Germany. Why don't we just say it didn't happen?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6424.25,"end":6424.65,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6425.21,"end":6426.97,"speaker":"Fr Stephen De Young","text":"And that made the whole thing a lot easier."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6427.05,"end":6427.45,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6429.13,"end":6430.01,"speaker":"Fr Andrew Stephen Damick","text":"I don't believe this."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6430.48,"end":6454.08,"speaker":"Fr Stephen De Young","text":"Oh, that's easy. Yeah. So the prophets were doing drugs thing is kind of a quaint holdover from that kind of early modern exegesis of, well, we don't say it didn't happen, but how do we explain this? And the drugs is a thing. So they tell you that it's fun to take a trip, put acid in your veins."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6456.83,"end":6462.51,"speaker":"Fr Andrew Stephen Damick","text":"All right, okay. Well, thank you for that, Olivia. Next we have Rachel."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6465.07,"end":6542.72,"speaker":"Audience Member","text":"Hi, this is Rachel calling from Lafayette, California. My question for Father Stephen. You often talk about the difference in faith versus faithfulness and how a lot of the times in our English translations, the Greek word beastis is often translated as faith, whereas faithfulness is maybe a more helpful translation. My question is, do you think that faith, like the ascent, true or false proposition to the idea that God exists is necessary or is in order to be faithful to God? Sometimes in our modern world, with all that we, you know, know about science and everything, it gets kind of hard to. You can be kind of nihilistic. So I was just thinking, like, do we maybe put too much emphasis on the idea of assenting. Yes. To the proposition that God exists and that if we have a problem with that, maybe that's, you know, not too bad, or you can still be faithful to God in other ways. I don't know. I'd love to hear your thoughts on that. Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6543.44,"end":6549.44,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, she said that was for you, so you're assuming she said I know."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6555.28,"end":6557.68,"speaker":"Fr Stephen De Young","text":"Could be a question for Father Stephen Freeman for all we know."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6557.68,"end":6559.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay, that's true. But."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6561.77,"end":6573.29,"speaker":"Fr Stephen De Young","text":"He just passes on. No. So, yeah, so there's a couple of interesting things going on. So the idea of God's existence."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6575.45,"end":6575.77,"speaker":"Fr Andrew Stephen Damick","text":"Sort."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6575.77,"end":6601.46,"speaker":"Fr Stephen De Young","text":"Of wasn't an issue in the biblical period. Right. There weren't atheists in that sense. So like when Proverbs says, the fool says in his heart there is no God, that's not saying that there were people at that time, you know, circa the 10th century BC who were materialists."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6601.62,"end":6602.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6602.34,"end":6776.7,"speaker":"Fr Stephen De Young","text":"Didn't believe in the supernatural or something. That's actually referring to the idea that there's not going to be any judgment, there's not going to be any consequences for their actions, for their sins. So the main reason why the emphasis in the use of that word in Scripture is on faithfulness is that the ascent part wasn't at issue. Right. You get in St. James Epistle, him pointing out that mere assent. Right. Isn't. Doesn't mean anything because he points at point that, you know, the demons assent to the truth of those things, like that there's one God, etc. But again, he's doing that to emphasize that it's the faithfulness part and the works that proceed from it that's important in St. James Epistle. So when we bring that to the modern period in one way, that's a different issue then what is at odds there? So the easy answer would be, well, yeah, obviously you have to believe God exists to be faithful to him. But. But what that ignores is kind of the pathology of the. The modern atheist. And that pathology, as I As I said once when I was talking to Pageau, every atheist is dragging around the dead body of the God. He doesn't believe it. The atheist has, by definition, by defining himself as an atheist. And I'm not saying he to be sexist, I'm saying he because most of them, at least online, seem to be guys. So the atheist, by defining himself as an atheist, is defining himself as I am a person who doesn't believe in X. Right. Which means you can never actually be free of X. Yeah, you have to keep X around to define yourself over against. Right. That's why I said dead body, because it's not a living reality for them. But they have to keep him around. Right. And meaning, since they have to keep him around, they believe in God's existence in some sense. Even if it's like we were talking about last episode, even if it's as concept. Right. There is some existence there, at least as concept, that really exists. And they'll go farther than that if you listen to them talk, because they'll blame him for things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6776.7,"end":6777.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6779.42,"end":6842.82,"speaker":"Fr Stephen De Young","text":"Right. Religion is responsible for all the wars, evil, whatever in the world. Well, how is that possible? You just gave it agency. You just said it exists in and of itself. It has agency. That kind of sounds like God. So the truth is atheists believe in God just like everyone else. So meaning, vocalizing that ascent is not the issue. Right. It's an issue of them having a particular relationship toward God. But we also have to distinguish faithfulness. Now, I'm coming at it from another side again. We also have to distinguish faithfulness from just the functioning of ideology. Now I get to quote Slavoj Iek."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6844.74,"end":6846.02,"speaker":"Fr Andrew Stephen Damick","text":"Have you done that before in this show?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6846.58,"end":6892.48,"speaker":"Fr Stephen De Young","text":"I don't know. Slavoj Iek has a really good definition of ideology. He says ideology is the thing that makes you behave as if. Right. Where regardless of what you would say you believe if asked. If you look at the way you behave and the way you act, you are behaving and acting as if XYZ are true. Even if you would say you don't believe them. Right. That means you have. You have taken a certain ideology into your person and it's functioning that way in your life regardless."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6893.2,"end":6893.6,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":6894.8,"end":7073.89,"speaker":"Fr Stephen De Young","text":"And this is what Nietzsche was always railing about the Europeans. He said, none of you believe in God, none of you are Christians, but you all keep acting like Christians. Right? Because Christianity was just so integrated into, Even in the 19th century into European culture that it was still forming social morality and all of these things, even though the People were all claiming they didn't believe in it anymore. So it was functioning as ideology at that point. And so we have to make that distinction because someone who is an atheist and by denying that God exists, is actually expressing the relationship they have toward God, at least as concept, right? May behave in a way, maybe behaving in a way that is virtuous or semi virtuous by Christian standards. But doing that based on a cultural ideology that you've internalized is not the same thing as faithfulness. And so faithfulness, to be the kind of faithfulness that produces salvation, the kind of faithfulness that brings about theosis, that unites us to God, that draws us closer to God, has to be functioning at a conscious level. And so a person who denies the existence of God, sort of falsely, right, still has a relationship with God, at least this concept that they're expressing. But them taking Christian actions despite that is not necessarily then faithfulness. It can just be functioning at this level of ideology, in which case it is not being faithful to anything or anyone in particular. So I wouldn't say that faithfulness requires assent to a whole series of propositions, but I would say that to constitute faithfulness, there has to be an awareness, a conscious awareness that is informing that way of life and those actions that make it faithfulness and not just, for example, slavish obedience, which would be another example, right? Other than ideology, if you were just forced, if you were just compelled, right, on pain of torture, to become a Christian and go to church, that would not be faithfulness either, right? So there has to be a sort of consciousness, participation in the way of life and the actions for it to be faithfulness and to be salvific."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7076.77,"end":7081.01,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're going to take one more before our break. And this comes from Sean."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7083.41,"end":7169.02,"speaker":"Audience Member","text":"Good evening, Fathers. Christ has risen. I have a question about authority. I'm a recent convert, and as I've learned more about the orthodox view of authority and spiritual fatherhood in particular, it seems to me that to really take the idea of authority seriously, we have to voluntarily bring some intensely personal decisions to our spiritual fathers for guidance, whether that's regarding finances or marriage or children. I see two major challenges to this as a modern person and recovering evangelical. First, while my family has been blessed with a wonderful parish priest, one of the major projects of the Enlightenment was to persuade us as a society that authority figures like priests aren't any more qualified to make decisions and flood our lives than we are. The second challenge I see goes back to the episode on the Crowning of an emperor. In that episode, you pointed out that most Israelite kings, Byzantine emperors and Russian tsars were not saints and in fact many of them were evil. Previously, I believe you've also said similar things about many church clergy. The popular post enlightenment story seems to go well. Before the enlightenment, people were ignorant and uneducated and didn't understand how bad their leadership was. But now we're so much smarter so we don't have to rely on the so called experts. It seems to me that one glance at our world today shows that to be self evidently false. My question is how do we navigate the problem of authority in the modern world without being naive and potentially being victimized by bad leaders on one hand and without becoming cynical and self willed on the other?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7170.22,"end":7389.37,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. You know, the thing that came to mind as he was speaking is where Christ is standing before Pilate. You know, he's literally condemning the Lord to death and says you wouldn't have any authority except that it was given to you from above. And it strikes me that one of the differences between the way that Christians see authority, whether it's within the church or even within the government, is this notion that it ultimately does come from God. Whereas especially in a lot of early paganism and then, you know, even in more developed paganism, like Roman paganism, the idea is that the God King is himself. You know, the authority flows from him because he's the God King, right. It doesn't come to him from above that it's seated within him. And so I mean on the one hand, right, it's true like what Sean says that, that we tend to be very self willed. So the idea of you should obey that just sounds suspect right off the top of the bat. But the authority has to be voluntarily obeyed. But that doesn't mean like I obey as long as I like what this person is saying. But rather that my value of knowing that obedience is salvific for me is greater than my value of thinking that I need to judge every single thing a person over me does. Right. Then the question is, as he said, like, well, how do you avoid being victimized? I mean, I think on one level you're not going to avoid being victimized, you're going to be harmed by people. Right? That's just a reality of life. So I think the bigger question, which he doesn't say is how do we help other people who are being victimized? Right. Well that's because that's much more important rather than just like, well how do I stop from being victimized myself? But really, how do I help to protect other people? And I mean, it depends a lot on the situation. Right? It depends a lot on the situation. But protecting the innocent is a good thing. Sometimes you can't. Sometimes you just in keep. Like, I can't personally stop if there's a genocide going on in another continent. I can't stop that with my, like the resources and the power and the influence that I have, I can't. I can't stop that. I can pray. I can ask people to pray, but I can't make them stop. But yeah, I mean, I think it's important to consider this question of like, okay, well, I need to know that suffering wrongs is part of what it means to be Christian and actual wrongs, someone actually doing me wrong, and how I bear up under that is the question of what I do with that. But then also if someone else is being wronged, what can I do to help alleviate that? What can I do to help do the works of God to bring justice as a situation as much as I can? And I think it's very situational dependent. You know, as I said, sometimes you don't have the ability to do anything immediately, but sometimes you do. Sometimes you can feed that hungry person, sometimes you can take in that person who has no place to go. You know, sometimes you can draw someone out of an abusive situation. I don't know. Those are my thoughts on that question."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7391.29,"end":7406.58,"speaker":"Fr Stephen De Young","text":"Yeah. A lot of these questions are spotlighting problems, I think, with American Orthodoxy. And one in this case is the fact that so much of the literature we have translated into English is monastic literature."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7407.3,"end":7412.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which really emphasizes obedience, like almost absolute obedience to an elder."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7413.54,"end":7444.07,"speaker":"Fr Stephen De Young","text":"So if you are a non monastic layperson. Right, A non monastic layperson. If you're clergy or a monastic, there's more going on here. Right. But if you are a layperson who is not a monastic, you should not be asking your spiritual father to make decisions for you. You should be going them to get their insight and guidance in the decisions you make. That's a different thing."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7445.02,"end":7445.5,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7448.54,"end":7495.82,"speaker":"Fr Stephen De Young","text":"And obedience in that context means that you weigh their insight higher than your own insight. It doesn't mean you always follow their advice. The spiritual father does not live your life for you if you're, again, if you're laborers. Right. So I as a priest, Right. Anything having to do with the parish, I do whatever the bishop tells me. Right. That's it. Including if he sends me somewhere else. Right. That's different. I'm Clergy. Right. And if you're a monastic, then you're a monastic elder. If he tells you to go put a stick in the ground and water it every day, you put a stick in the ground and you water it every day."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7495.97,"end":7496.13,"speaker":"Audience Member","text":"Day."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7496.13,"end":7501.01,"speaker":"Fr Stephen De Young","text":"Okay. But you're a layperson out in the world."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7501.57,"end":7501.97,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7502.21,"end":7525.9,"speaker":"Fr Stephen De Young","text":"Your spiritual father should not be making decisions for you about your finances, that you should not be expecting him to do that, and he should not be doing that. And this, if we approach it this way, will prevent a whole ton of abuse. Right. Because you're not giving power to a person that he's not supposed to have."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7526.46,"end":7528.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7529.42,"end":7577.26,"speaker":"Fr Stephen De Young","text":"Anytime a person has power they're not supposed to have, that's at least going to be a temptation. Right. That's at least going to be a temptation for them to sort of take control. Right. Of other people's. Of other people's lives. So I think that's one of the key things there is. You approach it as, I don't know, everything. My spiritual insight isn't that great. My spiritual father has greater spiritual insight than me. I need to get his advice. I need to get his wisdom. I need to get his insight on this topic to inform the decision I'm going to make. I think that right there will help. Will help strike the right balance for you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7577.66,"end":7649.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I'll also add, like, as. As a. As a father, like, as a dad to kids, like, my goal with the kids is not that they bring every single. Every single thing to me and want me to give a ruling on it. In fact, that's maddening to me and to their mother. Right. We're trying to train them so that they can do it themselves. They could decide for themselves and live themselves. You know, the analogy doesn't work perfectly because, like, when they're babies, you do have to do everything for them. But a baby Christian, you shouldn't have to do everything for them. Right. Now, they might need more guidance initially, but ultimately the point is like to. To empower them to do the right thing themselves, to live the life themselves, to actually have some courage and to do it, you know. So, yeah, it's a. It's a really good point. All right, we're going to go ahead and take our second break, and we'll be right back with the third half of this asynchronous all Q and A. Lord of Spirits, Father Andrew Stephen Damick."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7649.74,"end":7664.69,"speaker":"Fr Stephen De Young","text":"And father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7668.29,"end":7718.55,"speaker":"Audience Member","text":"Ancient Faith Publishing is pleased to announce a new release that is part history, part theology and part devotional. The Story of A History and Theology of Christ explains the complete life and teachings of our Lord from before his conception in Mary's womb until his ascension. Revered 20th century Egyptian elder and scholar Matthew the Poor wrote many volumes on the subject of Christ's significance, life and teachings which translator James Helmi has distilled into one highly readable book that will make a valuable addition to every Christian library. The Story of Jesus is now available in paperback, ebook and audiobook@store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7718.87,"end":7734.96,"speaker":"Fr Stephen De Young","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7736.96,"end":7766.07,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of this asynchronous all Q and A episode of the Lord of Spirits. Reminder that despite what the voice of Steve just said here, if you call in, you're not going to reach us. Don't know who you're going to reach, but it's not going to be us. I am in the United Kingdom when this airs and Father Stephen is out getting another master's degree or writing another book or just random doctoral degree that he can just kind of pick up."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7766.07,"end":7773.39,"speaker":"Fr Stephen De Young","text":"On a Thursday night or playing WWE 2K23 as one does. Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7774.43,"end":7783.67,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, so we've got a few more questions before we wrap up this episode here in the third half. And this first one comes from Adrian."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7787.66,"end":7815.2,"speaker":"Audience Member","text":"My name is Adrienne. I'm calling to ask you if you have heard of a religion called Eckankar in particularly, I would like in particular, I would like to know when my aunt and uncle are singing the word hu, capital H, U. They claim that this is the sound of the soul, that it reaches directly to God and brings that particle, that particle of God that is in us."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7815.28,"end":7815.68,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7817.84,"end":7834.88,"speaker":"Audience Member","text":"Harmony, I guess. But anyway, I just have this weird feeling that perhaps it is a different spirit that they are singing to. And I was curious if you might be able to shed some light on that. Again, the word is hu and it is part of Eckankar. Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7835.68,"end":7843.45,"speaker":"Fr Andrew Stephen Damick","text":"All right. First, I'm going to say I can't believe we got a question about Ekam Karn. Wow."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7844.57,"end":7861.69,"speaker":"Fr Stephen De Young","text":"The only things I Will say about this before you take it away is number one. Hoo hoo was a major gear check in. Encourage back in vanilla. And you should only sing Hu as part of hey Hue, get off of my cloud."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7862.33,"end":7862.81,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7863.77,"end":7865.21,"speaker":"Fr Stephen De Young","text":"You can take the rest. Okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7868.33,"end":7919.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So a lot of people probably never heard of Eckankar, which Adrian kind of wondered if we'd ever heard of Eckankar, but this is the kind of thing that I've heard of. So what is it? It's what they call a new religious movement. It was founded in the mid-1960s and it draws on a number of things from, I don't know, guru traditions of Hinduism. I think it's probably the easiest way for me to put that. But again, it was invented. I mean, it's a new western religion. So yeah, Hugh. Boy, I really just want to make some Star Trek Next Generation references to Hugh, that reformed Borg, but they're just not coming to me. If you come up any good jokes along that line, father, just jump in."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7920.27,"end":7922.99,"speaker":"Fr Stephen De Young","text":"Or Hue and cry is right there."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7922.99,"end":7924.19,"speaker":"Fr Andrew Stephen Damick","text":"There we go. That's true."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7924.83,"end":7925.59,"speaker":"Fr Stephen De Young","text":"Waiting for you to."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7925.59,"end":7928.07,"speaker":"Fr Andrew Stephen Damick","text":"I think that's a Shakespearean phrase. I'm not. I'm not certain."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7928.07,"end":7928.75,"speaker":"Fr Stephen De Young","text":"But yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":7930.91,"end":8062.2,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so echists, that's people who belong to Eckankar, of which, by the way, it is not a big religion. Like it's like 50,000 people total in the world. Maybe that makes sense. Many. I. I did one time drive by actually an Eckankar center. I can't remember what they call their temples. I was really shocked to see it because they're so rare. But the big temple of Ek is up in Minnesota. I haven't been there, but so Ekists, this is their main spiritual practice as they sing or chant the word hu spelled H U. And it's described as like a. A love song to God or it's the name of God. And they will sing it or chant it like with a long, drawn out breath. And so in some ways it's a little bit like the Hindu or Buddhist mantra of Om, you know, in that it's meditative and it's sort of drawn out. You can find. And they'll sing it like by themselves or sometimes in groups. You can find videos of this on YouTube. So if you look up Eckankar and then Hugh, you can find like 20 minute long Hue singing recordings of this. And I, before we talk about whether what this might actually really be, I wanted to play. So the guy who is the current leader of Eckankar is a man named Harold Klemp, which is an amazing name. And he is called the living Eck master. Not making that up. And he's also called Mahanta, which you can find sort of pseudo gospel music singing about Mahanta again on YouTube. So they're singing about their leader like this is a living guy. And in the lyrics of this Mahanta song, they talk about singing Hunter again, not making that up. So I. But I did find a short recording of Harold Klemp explaining how to do this. I know this is kind of way off, but it's just so amazing that we get a question about Eckar."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8062.2,"end":8066.28,"speaker":"Fr Stephen De Young","text":"Harold Klemp sounds so much like a Monty Python sketch character, doesn't it?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8066.92,"end":8090.96,"speaker":"Fr Andrew Stephen Damick","text":"God bless him. Okay, so, yeah, this is Harold, government office. This is Harold Klemp explaining how to do the hue. Make yourself comfortable. If you're a guest here and not familiar with us or our ways, that's fine. Just sit and enjoy. Be comfortable, if nothing else. But when you shut your eyes, look."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8090.96,"end":8094.24,"speaker":"Audience Member","text":"Into the center here, spiritual eye area."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8094.56,"end":8112.73,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes called third eye. When you sing Hu, know that this is one of the most sacred names for God. Sing it with love and with reverence."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8112.81,"end":8114.89,"speaker":"Audience Member","text":"And look for the light."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8116.01,"end":8117.29,"speaker":"Fr Andrew Stephen Damick","text":"Listen for the sound."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8117.45,"end":8119.25,"speaker":"Audience Member","text":"You may or may not have anything tonight."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8119.25,"end":8120.89,"speaker":"Fr Stephen De Young","text":"I'd be very surprised if you did."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8121.13,"end":8122.45,"speaker":"Fr Andrew Stephen Damick","text":"But just to show you how to."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8122.45,"end":8123.81,"speaker":"Audience Member","text":"Practice it and do it on your."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8123.81,"end":8129.53,"speaker":"Fr Stephen De Young","text":"Own, it'll give you the spiritual insight that other people wish they had."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8130.01,"end":8130.35,"speaker":"Audience Member","text":"But."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8130.42,"end":8131.7,"speaker":"Fr Stephen De Young","text":"But it doesn't come overnight."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8132.58,"end":8134.98,"speaker":"Fr Andrew Stephen Damick","text":"You have to develop this like any other skill."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8135.78,"end":8137.3,"speaker":"Audience Member","text":"So let's begin with you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8170.19,"end":8171.79,"speaker":"Fr Andrew Stephen Damick","text":"All right, so, I mean, you get the idea."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8172.67,"end":8175.79,"speaker":"Fr Stephen De Young","text":"So the next generation. Hugh was a drone."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8175.87,"end":8183.03,"speaker":"Fr Andrew Stephen Damick","text":"That's. There you go. That's right. What was he, third of five? Was that his original name? I think three to five?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8183.03,"end":8183.67,"speaker":"Fr Stephen De Young","text":"I think so."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8183.67,"end":8184.11,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8186.18,"end":8252.62,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. So Adrian is asking, like, are they reaching out to some other God? I don't know. It's. It's. The matrix of this religion is so. A lot of modern religions are like this. They're so kind of intellectualized, it's hard to know. Right. And I'm sure people, you know, like meditative practices. People often feel a sense of well being or calm or peace, largely because they're doing things like sitting still and humming or saying a mantra or whatever, which, I mean, these have a real physiological, psychological effect on a person. Are they calling out some other spirit? They believe that it's God. What exactly an echist believes God is is a different question. I don't know. It's. It's. It's Hard to tell. Again, it has. It has influences from Hindu traditions, but also some Sikh stuff. So sort of, you know, Indian religions."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8254.46,"end":8257.74,"speaker":"Fr Stephen De Young","text":"None of that is like the God of Abraham, though."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8257.82,"end":8261.26,"speaker":"Fr Andrew Stephen Damick","text":"No, no, for sure not. Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8261.58,"end":8261.98,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8262.3,"end":8263.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8263.1,"end":8265.26,"speaker":"Fr Stephen De Young","text":"But I don't think we could say it's the same God."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8265.34,"end":8295.45,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no, no, no, no. But. But also, like some of those Far Eastern religions, the conception of God is sometimes not even like a pagan conception of God. It's a philosophical conception of God. It's sometimes pantheistic. So are they reaching out to something or are they just humming? I don't know. I don't know. I really don't know. But. Wow. I'm just amazed that we got an."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8296,"end":8296.32,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8296.32,"end":8296.72,"speaker":"Fr Andrew Stephen Damick","text":"Question."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8296.88,"end":8313.92,"speaker":"Fr Stephen De Young","text":"There is a. There is a porque no los dose there, though. Right. Because when you look at, like, second temple Jewish stuff on idolatry. Right. That. I mean, they have room there for. Some of. Some of this is just made up or weird or goofy."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8313.92,"end":8314.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8314.24,"end":8327.94,"speaker":"Fr Stephen De Young","text":"Right. Like, but they say when that happens, there are demons there ready to intercept. Right. Like, ready to move in and take advantage. Right. Of whatever it is."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8328.18,"end":8328.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8329.94,"end":8350.09,"speaker":"Fr Stephen De Young","text":"So it may be that, you know, your average brand Ek person is just kind of diluted, but that doesn't mean that they're not in a spiritually dangerous place. And that also doesn't mean that, like, the leaders of it aren't involved in something spiritually dark as well."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8350.09,"end":8396.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, my sense, like, this religion has now been around since, like, 1965, so it's not. And it's only got, you know, a few tens of thousands of people. I don't think it's a particularly compelling. Like, it hasn't taken off. You know, it's had almost 60 years to do that. It hasn't really taken off. It's not a very compelling story, I think, for most people. So. But yeah, I mean, it's amazing. Obviously, Adrian talks about her aunt and uncle singing the hu. So it clearly she does know people that are. That are doing this. So I don't know if that's helpful, Adrian. But, yeah, pray for your aunt and uncle, obviously, and show them Christ as much as you can. Okay, so we've got now one from Jessica."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8399.49,"end":8484.39,"speaker":"Audience Member","text":"Hi. Father Andrew and Father Stephen. My name is Jessica. I'm a mother of five residing in Prescott, Arizona. I'm a catechumen at our local Orthodox parish, and my family and I will be charismated the Saturday after Thanksgiving. I just want to start out by sincerely thanking you for your podcast and all the time and effort that you two put into that and providing that content for us. It is just so life giving and something I return to again and again. I'm currently about halfway through all of your episodes, listening through them a second time and getting something fresh and new each time I listen. I know your upcoming episode is about the Eucharist, however, my question relates to the end times. So I'd like to know what is the orthodox understanding of the end times and of the return of Christ? I've grown up in the Protestant tradition, always hearing about things like the Rapture and date setting and speculation of that nature. And I'm interested in more of the traditional understanding of the books of the Bible that speak about Christ's return and what your personal opinions and viewpoints are on that topic. And also any books or podcasts that are available that also speak about the orthodox understanding of the end times and the return of Christ. Thank you so much for your time and I appreciate the show so much. God bless."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8484.87,"end":8491.75,"speaker":"Fr Andrew Stephen Damick","text":"All right, so as people might be able to tell, this call was this voicemail is from several months ago because."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8491.83,"end":8492.83,"speaker":"Fr Stephen De Young","text":"Sat on that for a while."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8492.83,"end":8536.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, that's true. But yeah, like I say, we do save stuff for later. So this is proof of that. So that means that Jessica and her family are Orthodox by now, God willing. So welcome, welcome, Jessica and crew. Five kids. Awesome. Good job. Yeah, I mean, I've got four. So it's a lot of work. When people have more than that, I'm just like, yes, I admire you. I mean, on one level, like, this is what our next stuff is going to be about, right? A lot of end times kind of stuff. So we could just say stay tuned. But I don't know. Do you have any words for a recovering dispensationalist right off, Father?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8536.94,"end":8539.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. We are doing that Antichrist episode next."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8541.66,"end":8542.06,"speaker":"Audience Member","text":"So."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8544.7,"end":8569.75,"speaker":"Fr Stephen De Young","text":"I mean, if you want a basic summary of it, right. The last part of St. John of Damascus, precise exposition of the orthodox faith, which is the third part of his fount of wisdom. He gives a pretty good summary there, basically. And biblically, Christ and people who've listened to my stuff know I don't like the word return."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8571.03,"end":8571.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8572.55,"end":8780.28,"speaker":"Fr Stephen De Young","text":"Because that implies he's gone off. We're about to celebrate Ascension, Right. So it isn't Jesus goes away somewhere that he comes back, but his glorious appearing, as St. Paul calls it that the parousia, it's a Greek word, his presence that is going to happen. He's going to judge the living and the dead, all of the dead, righteous and wicked will be raised to face that judgment. Now, I think she's more looking for the stuff preceding that, and that is a little vaguer. In the Orthodox Church, we know that there is going to be a final Antichrist figure that we're going to talk more about next time. And I say final Antichrist figure because as we're going to talk about next time, there are various precursors and types and forerunners of the Antichrist proper and Antichrists in the same way that there were of Christ. But there is going to be one final Antichrist figure. There are some traditions that we'll talk about next time regarding the rebuilding of the temple that go in a very different direction, the Temple of Jerusalem that go in a very different direction than the dispensationalist version, to say the least. But those are partial. Those are traditions. Right. In the sense that those aren't like, dogmatic part of the problem. And we'll talk about this more next time. I'm sure with a lot of Orthodox stuff online about the end times is that there are a lot of contemporary elders and even roughly contemporary saints who have various statements quoted as predictions. Weren't necessarily predictions, but statements quoted as predictions that try to get assembled into some kind of end times thing. A lot of times those are being posted by former Protestants, and we'll talk more about that next time. But there's a whole process by which, over the course of the history of the Church, not every word that exits a saint's mouth or a father's mouth or even that they put on paper is of the same level of authority. And the Holy Spirit in the Church takes care of that over time. But when we're dealing with contemporary people, almost everything they said is recorded because we're in the modern world and that process hasn't taken place. And so it's very easy to take things out of context and act like they're authoritative pronouncements about the future when that's not what they are or were or were ever intended to be. So, yeah, that's to say at least a little something. And we're going to get into that more on the next episode. So you're gonna have to wait a couple more weeks is what we're saying after waiting several months."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8782.52,"end":8788.8,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah, as long as the Second Coming or, sorry, the second manifestation doesn't happen between now and then."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8788.8,"end":8791.36,"speaker":"Fr Stephen De Young","text":"Manifestation. I don't know about that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8791.36,"end":8792.04,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8792.12,"end":8793.24,"speaker":"Fr Stephen De Young","text":"That's not in my notes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8794.12,"end":8814.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's a Dr. Harry Bacalis reference there for all the Tikonites? Yes, it's not in my notes. Okay, well, thank you for that, Jessica. Now we've got one from Matt. Hello, fathers of the Lord of Spirits, My name is Matt, a Canadian who listens to your show. I'm a Protestant Bible teacher in Calgary."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8814.73,"end":8819.57,"speaker":"Audience Member","text":"Alberta, and I've listened to everything. I love it, learned a ton. Thank you so much for your ministry."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8819.89,"end":8831.98,"speaker":"Fr Andrew Stephen Damick","text":"My question regard is regarding polygamy. In the One Flesh episode, you mentioned that polygamy was. Was not God's idea. And yet I'm curious to know how you might interpret the situation where a."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8831.98,"end":8842.94,"speaker":"Audience Member","text":"Brother has to marry his deceased brother's wife in order to carry on the family line, such as is outlined in Deuteronomy 25, verse 5 to 10. Would you mind commenting on this?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8842.94,"end":8845.62,"speaker":"Fr Andrew Stephen Damick","text":"Is this polygamy? And why is this."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8845.62,"end":8849.94,"speaker":"Audience Member","text":"Okay. And does any of this make sense for people still today?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8850.66,"end":8851.7,"speaker":"Fr Andrew Stephen Damick","text":"God bless you guys."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8851.7,"end":8852.18,"speaker":"Audience Member","text":"Thanks again."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8853.06,"end":8856.86,"speaker":"Fr Andrew Stephen Damick","text":"All right, so it's Levirate marriage, right? That's where. If you're."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8856.86,"end":8857.38,"speaker":"Fr Stephen De Young","text":"Leverett."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8857.38,"end":8868.86,"speaker":"Fr Andrew Stephen Damick","text":"Leverett. Excuse me. Well, yeah. Does that count as polygamy? I mean, right, like, no. Right, like, like, if. You know, if."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8868.86,"end":8872.82,"speaker":"Fr Stephen De Young","text":"Yeah, we could start with the last part first. You should not practice Leverett marriage."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8872.82,"end":8876.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't do that. Everybody, don't do that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8880.91,"end":8892.03,"speaker":"Fr Stephen De Young","text":"Yeah, so. Well, there's several things here. So first of all, at the time that the brother takes the wife, the other brother's dead."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8892.59,"end":8892.99,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8893.87,"end":8908.7,"speaker":"Fr Stephen De Young","text":"Right. So she's only married to one man at a time. But the bigger issue is that the purpose of this is to give the departed older brother an heir."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8910.94,"end":8911.34,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8911.66,"end":8931.51,"speaker":"Fr Stephen De Young","text":"Right. That's the purpose. So his name will continue. Right. And this is requiring a. Essentially a selfless act from the younger brother. This is not, yay, I get to have two wives, or yay, I get to have sexual relations with two women. And it's listening."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8931.66,"end":8931.86,"speaker":"Audience Member","text":"It."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8931.86,"end":8949.98,"speaker":"Fr Stephen De Young","text":"Right. This is, I'm going to give this woman a son, and that's not going to be my son. That's going to be my older brother's son, meaning this kid, who biologically is my kid, is going to inherit everything from my father instead of me."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8951.34,"end":8968.07,"speaker":"Fr Andrew Stephen Damick","text":"So wait, so let me make sure I understand how this works. If brother number two, right, who is being expected to marry this woman if he's already married to another woman, he could still engage in this and bring her in. Is the idea like."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8968.07,"end":8968.47,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8968.55,"end":8970.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay. But it's not a normal."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8970.63,"end":8974.47,"speaker":"Fr Stephen De Young","text":"Normal, but only for as long as it takes to produce a male child."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8974.63,"end":8976.47,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting. Okay, okay."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8976.63,"end":8986.64,"speaker":"Fr Stephen De Young","text":"And then that male child will inherit everything from his grandfather because he's the firstborn son of the firstborn son."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8987.6,"end":8989.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, Right, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":8990,"end":8999.76,"speaker":"Fr Stephen De Young","text":"So if the firstborn son dies without an heir, the second born son would inherit everything. Right. So this is what happens with Onan."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9000.88,"end":9001.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9003.36,"end":9089.16,"speaker":"Fr Stephen De Young","text":"Onan is like, hey, if I don't give her a baby, I inherit all of Judah's stuff when he dies. If I do give her a son, then that son will be my older brother's son, and so he'll inherit everything. And that's why Onan does things, to make sure that she won't conceive. Right. And if you don't understand that, you won't understand the story of Judah and Tamar. Right. Like why what Onan did was so evil. Right. So, yeah, it's purely for that purpose of producing a male heir. And this is part of us reading our modern understanding of marriage back into the Old Testament culture. Right. So like, when, when it talks about you'll, you'll get these atheists who do the, you know, oh, the, the Bible says, you know, rape victims have to marry their rapist. Right. Which is, it's, it's difficult to determine even what passage they're talking about in the Torah, but the best guess is that it's in Deuteronomy where it basically says that if someone takes a woman's virginity, he has to marry her."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9090.76,"end":9091.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9092.2,"end":9106.92,"speaker":"Fr Stephen De Young","text":"And what that means is not the two of them are going to go settle down and create a nuclear family together because that social structure didn't exist. What that means is he has to take care of her for the rest of her life."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9107.24,"end":9112.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And isn't that especially because she would be regarded as not marriageable?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9113.16,"end":9198.71,"speaker":"Fr Stephen De Young","text":"Right, right, right, right, right. So the goal there again is not like, oh, well, you slept with her once, so now she has to sleep with you for the rest of her life. Right. We've like sexualized it. Right. In this way. Right. And so when we look at Leverett marriage, it's like, oh, well, see, the younger brother now gets to have two wives. And that's okay for him to have two wives who he's sleeping with. And it's like, no, he has a responsibility, according to the Torah, to provide a male heir to his brother selflessly as an act of love toward his older brother. Right. And that's it. Right, that's it. And this is part of why the Sadducees question about this to Jesus didn't make any sense. Because remember, they say, oh, there was one bride for seven brothers, right? Like, they go through it, right? They all are married to her, and then, you know, because none of them produced a male heir and they all die. And whose wife is she in the resurrection? And Jesus is like, he starts out by saying, this is a stupid question."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9198.71,"end":9201.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I love what his response initially is. You are wrong."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9202.55,"end":9203.03,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9204.63,"end":9205.43,"speaker":"Fr Andrew Stephen Damick","text":"You are wrong."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9205.83,"end":9351.54,"speaker":"Fr Stephen De Young","text":"You are wrong because, you know, not the power of God. Right. Like, it's. It's like that's basically a not so subtle way of saying that is the stupidest question I've ever heard in my life. Right. You know, you hear people say, there are no stupid questions. You know, if so, there are a lot of inquisitive idiots, right? Take that as you will. But, yeah, so, yeah, so I think. And I'm not saying our caller asked a stupid question. No, our caller asked a reasonable question. But. So the purpose of lever at marriage is not marriage, Right. Even though that's what we call it, the purpose of leverent marriage is producing this heir. So the brother, the dead brother's widow was not, like, kept around as a concubine or something by the younger brother. Yeah, it's. You have the responsibility to give your brother an heir is what that was about. And the reason that took place within the context of marriage was because. Was to make it licit, Right. Publicly, number one. And number two, because again, a widow doesn't have any legal rights, right? A widow can't bring a court case. A widow can't do anything. She has to be represented by a man. And if she doesn't have a male heir, if she doesn't have a son to do that, she needs someone else to do that. And so by legally marrying her, right, publicly marrying her, then the younger brother was responsible for her in that regard, too. And again, this is playing out in the background of the story of Judah and Tamar, right? Tamar can't do anything about it. Judah decides, hey, this woman's a son killer. I'm getting rid of her. There's nothing she could do about it. So she has to resort to sort of treachery to try to get the heir that she is due from Judah. And she ultimately does that. And that's why in the court case, that eventually happens. Judah says she's righteous, not me, because she was. Yes. Entitled to have that son. And I tried to deprive her of it."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9351.54,"end":9359.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, we've got one from Anna, and she's asking a question about death."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9363.38,"end":9441.33,"speaker":"Audience Member","text":"Hi, fathers. Thank you so much for doing this show. We really love it. We listen to it. We've listened to every episode with our teen kids, and we really enjoy it. So the question that we have is according to the theory of evolution, which I'm sure is boring to discuss whether that's true or not, but according to the theory of evolution, there has always been physical death in the world since day one. Are we then to understand that the only type of death that came into the world following the fall of mankind was spiritual death? How are we to understand physical death existing in a good creation before the fall of Adam? There's a book called Peril in Paradise. I'm not sure if you're familiar with it. I think it was written by a Protestant author where he is arguing for the fact that there was actually death in the world before sin. It was just spiritual death. That was something new. Not sure if that's theologically correct or not, or if that's theologically sound. And just wanted to see your take on how we're to understand that as Orthodox Christians. Thank you so much."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9442.21,"end":9451.65,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, I think, number one, it's incorrect to say that the only kind of death introduced at the Fall was spiritual death."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9453.06,"end":9453.74,"speaker":"Fr Stephen De Young","text":"For humans."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9453.74,"end":9487.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For humans. Right. Yeah. I mean, I think the way that this. And correct me if I'm wrong on this. I know you will. Is, is it doesn't say in Scripture that there is no death for anything and anyone until the transgression of Adam and Eve. Right. In. In Genesis 3, it shows human death coming in. And certainly it's physical death. It's material death. Right, right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9487.78,"end":9491.34,"speaker":"Fr Stephen De Young","text":"Well, spiritual death that results in physical death for humans. Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9491.34,"end":9518.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. There isn't a comment on death for anything else, as I recall. I'm pretty sure you were the person who mentioned this to me that I think maybe one of the fathers speculates that plants and animals could die even before that because they had been under the care of the angel that we know later as the Satan. And so he."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9518.91,"end":9519.67,"speaker":"Fr Stephen De Young","text":"Well, the devil."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9519.67,"end":9537.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the devil. Yeah, the devil. So that he. He turns to evil and that brings death to the. The creatures under his care, which doesn't include man. But that this is a kind of a speculation, which if true. Right. Kind of solves the problem that Hannah is talking about."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9538.27,"end":9539.79,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9540.19,"end":9540.59,"speaker":"Audience Member","text":"Well."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9540.67,"end":9570.28,"speaker":"Fr Stephen De Young","text":"And so. Yeah. And it is important to emphasize, Right. That what we're told in Genesis 1 through 3 is agnostic on the question of animal death and plant death, for that matter. It doesn't say one way or the other. So this is not, you know, it doesn't say therefore evolution is true. Right. And we're not saying it doesn't say therefore there wasn't any."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9570.44,"end":9570.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9572.2,"end":9608.53,"speaker":"Fr Stephen De Young","text":"It just doesn't say. That's not something that is addressed there in the text, the death of animals and plants. And I think part of this. I think part of this is there's a sense in which we. There's a sense in which as we continue God's creative work of putting the world in order and filling it with life, we are humanizing it that we've talked about before. But I think there's a tendency to humanize nature in a different way."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9609.34,"end":9609.74,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9611.74,"end":9643.19,"speaker":"Fr Stephen De Young","text":"To kind of anthropomorphize nature. So, for example, when I've been forced to talk about this issue, I've had people present to me, you know, this phrase, you know, nature red in tooth and claw. Right. Like, you know, oh, look, this tiger is tearing apart the zebra. Right. And eating it. I think we need to ask, is that actually evil?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9645.59,"end":9646.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9648.87,"end":9650.95,"speaker":"Fr Stephen De Young","text":"Why is a tiger eating a zebra evil?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9652.23,"end":9652.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9654.71,"end":9661.69,"speaker":"Fr Stephen De Young","text":"Or why is plant life dying and mulching and being replaced by new plant life? Why is that bad?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9663.45,"end":9663.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9666.89,"end":9707.78,"speaker":"Fr Stephen De Young","text":"Right. I mean, I think we're over sort of over assuming in a lot of regards now. I think we do get the imagery in Scripture of, like, the lion lying down with the lamb and the kid putting his hand in the viper's nest and, you know, that kind of hostility. But that's at the end, right. That's a new state of the world produced by the revelation of the sons of God."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9707.86,"end":9708.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9708.34,"end":9718.01,"speaker":"Fr Stephen De Young","text":"By theosis, by the humanization and through Christ's divinization of the cosmos."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9718.09,"end":9738.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think one of the big problems is that there's often this vision of the restored cosmos, the renewed cosmos really, at the end being essentially just a perfect reset of where it was with Eden, that they're identical, which is not the orthodox view."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9739.22,"end":9754.66,"speaker":"Fr Stephen De Young","text":"It seems to me completely in keeping with what the scriptures say, that outside of the garden, which was not the whole earth, that outside of the garden there were lions eating gazelles."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9756.5,"end":9758.74,"speaker":"Fr Andrew Stephen Damick","text":"There were whale filtering in krill."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9759.38,"end":9759.82,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9759.82,"end":9764.91,"speaker":"Fr Andrew Stephen Damick","text":"We don't usually think of that as being violent and evil. They're literally swallowing shrimp pole."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9765.31,"end":9801.48,"speaker":"Fr Stephen De Young","text":"Well, it's. It's okay to eat fish because they don't have any feelings. So, like. Yeah. So, I mean, that all of that was going on outside the garden. Right. And that arena was then going to be the action of human participation in God's activity that would eventually bring about the result of a peaceful and whole Cosmos without violence and predation. Right. But to me, none of that has anything to do with the theory of evolution."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9801.88,"end":9803.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yep."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9803.36,"end":9808.12,"speaker":"Fr Stephen De Young","text":"I mean, that's irrelevant to that, really, ultimately."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9810.36,"end":9815.56,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty, we've got just a couple more before we're going to wrap up this episode. This one comes from Julius."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9819.51,"end":9875.38,"speaker":"Audience Member","text":"Thanks for taking my voice message, Dr. Crane. I wanted to ask a question about divination. Mostly that in the Old Testament, of course, divination is punishable by death. Jacob's Uncle Laban, which is using divination, and he's always portrayed in a bad light. And of course, divination in Hebrew is kind of close to the word for nakash, the serpent. I know all this, but I want to ask what's the difference between divination and prophecy? Or especially clairvoyance, which some of the saints have achieved? And personally, I've had many dreams that came true, very specific dreams, and I want to know how I should feel about that. Like, how do I know this is from the Holy Spirit and not something demonic? Or should I just pray about it? Anyhow, thank you for taking my question. And Christ is risen."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9876.42,"end":9880.66,"speaker":"Fr Andrew Stephen Damick","text":"I loved the reference there to Frasier at the beginning."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9880.66,"end":9882.74,"speaker":"Fr Stephen De Young","text":"You're assuming that was a Frasier reference."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9882.74,"end":9884.18,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is there another Dr. Crane?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9884.26,"end":9887.3,"speaker":"Fr Stephen De Young","text":"It could have been a Scarecrow reference from Batman."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9887.86,"end":9899.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, color me corrected. I'm listening. Did he take calls? Did Scarecrow take calls? Well, no."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9899.89,"end":9901.77,"speaker":"Fr Stephen De Young","text":"He dosed people with fear gas."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9901.77,"end":9902.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9902.97,"end":9906.65,"speaker":"Fr Stephen De Young","text":"Which caused them to have frightening visions. See? See where I'm going with this?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9906.65,"end":9961.09,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, I'm. Yeah, yeah. So I mean, the. I think the quick response to this would be. So divination is an attempt to use a technique to get knowledge, right? Knowledge from a spiritual source, so to speak. Whereas prophecy given by God or, you know, you know, that clairvoyance, however you want to call it that you see, in the saints, this is not because they did some technique or ritual to make it happen. It is that God gave them this knowledge because it suited his purposes for them to have it. I don't know, he didn't mention this, but like, maybe the fuzzy point between these things is the urim and thummim, Right. Which seem to be some kind of God given divination."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9961.97,"end":9965.73,"speaker":"Fr Stephen De Young","text":"Well, thing the urim and thuma were pretty clearly a condescension."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9966.45,"end":9966.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9967.25,"end":9973.41,"speaker":"Fr Stephen De Young","text":"Because in the context where it's described, it's explicitly. Okay, I'm doing this so that you won't engage in divination."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9974.21,"end":9976.85,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I'm giving you this so that you have this to play with."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9977.17,"end":9986.77,"speaker":"Fr Stephen De Young","text":"Right, right. Okay. Where the chips are down and you just don't know it. So it's sort of an accommodation. It's like a stooping, which is why they kind of disappear."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9990.93,"end":9993.53,"speaker":"Fr Andrew Stephen Damick","text":"And are not seeing stones that you can find in upstate New York."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":9993.53,"end":10011.2,"speaker":"Fr Stephen De Young","text":"Yeah, no, no, unfortunately. And, yeah, that's why casting lots is so sort of ambivalent in the New Testament, even though it's not always treated that way. It's sort of like maybe you shouldn't be doing this."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10012.72,"end":10014.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10015.76,"end":10032.55,"speaker":"Fr Stephen De Young","text":"But. Yeah, but, yeah, you're right. That it's a question of. Again, like, when we're talking about prayer. Right. Divination is a practice, usually magical, like directly in the ancient world, by which."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10032.55,"end":10035.99,"speaker":"Fr Andrew Stephen Damick","text":"I arrive at cutting open animals and looking at their innards and."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10035.99,"end":10048.63,"speaker":"Fr Stephen De Young","text":"Yeah, ecstasy. Yeah. By which I, you know, determine these. These things. And it was based on skill. Right. So people learned to be a haruspex. Right. And to read the entrails."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10048.63,"end":10049.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10051.67,"end":10088.31,"speaker":"Fr Stephen De Young","text":"Whereas a prophet is someone chosen by God, who God gives vision, sometimes visions. They're unhappy with Jonah, or sends them to do things they're not happy with doing. Right. So, yeah, that's the thing. And in terms of having dreams and stuff, those kind of things. Any spiritual experience in our life of any kind, Right. The number one thing is you look at the fruit of it, and if the fruit it produces is you becoming proud or arrogant about your spiritual experience."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10088.71,"end":10089.11,"speaker":"Audience Member","text":"Or."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10090.95,"end":10104.31,"speaker":"Fr Stephen De Young","text":"You being filled with fear, you being disturbed, then that's not from God. If the fruit it produces is drawing you closer to Christ, then it's from God."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10105.91,"end":10116.77,"speaker":"Fr Andrew Stephen Damick","text":"Here we go. All right, we've got one last question before we wrap up. This asynchronous Q and A for May 2023. And this one comes from Miriam."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10118.93,"end":10130.13,"speaker":"Audience Member","text":"Hi, fathers. Thank you so much for this show. I'm just wondering, how can people like Elijah and Enoch, as well as Christ himself, be in heaven bodily if heaven isn't a physical place? Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10131.01,"end":10157.65,"speaker":"Fr Andrew Stephen Damick","text":"I love this because it's. It just hits right in the middle of a whole bunch of stuff we've talked about in this show. So clearly you can tell Miriam is a longtime listener. Yeah. So, I mean, I mean, this is about the resurrection, Right? Especially about Christ. Are Moses and Enoch raised? Have they been bodily raised? The Theotokos? She didn't mention Theotokos, but certainly we believe that she has been bodily raised."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10158.93,"end":10161.65,"speaker":"Fr Stephen De Young","text":"Enoch and Elijah didn't die. Right. So, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10161.97,"end":10171.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. So where are their bodies, please? I mean. Yeah, it is a great question. I love this. So. Yeah, take it away."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10172.85,"end":10174.61,"speaker":"Fr Stephen De Young","text":"No, I mean, not offering anything."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10174.77,"end":10176.05,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10177.41,"end":10182.13,"speaker":"Fr Stephen De Young","text":"So I'm not going to get to talk about the extra Calvinisticum again?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10183.33,"end":10256.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, let's not do that. Yeah. Where is the body of Christ? Exactly. Yeah, I know, I know. I thought that as soon as I said that, where's Christ? But I was like, no, no, let's not talk about Calvin. So one thing I will say is, I mean, we have a clue about this in the scripture, right? Which is that when St. Paul talks about the resurrected body, he compares it to a plant versus a seed. You know, the seed being the, the unresurrected body, and that it's sown in corruption and raised in incorruption and that there's this change and. Oh, by the way, I mean, for people who are looking for some, some way to, to deal with the data that is used to push the Rapture doctrine, this is what's being talked about is, you know, being taken up is this image of the human body being changed in the resurrection, right. And so it becomes a body like Christ's body when he's raised. It becomes. It becomes angelic. Not an angel body, but angelic, you know, equal to the angels. So. Yeah, I mean, that's what I would offer. Yeah. I love this, though, because it points towards so many really beautiful and good things."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10257.43,"end":10368.79,"speaker":"Fr Stephen De Young","text":"Right, Right. And it's so, I mean, the key language for this, the key ancient language for this is visible and invisible, right? But that's metaphorical language, right? Because when we think of somebody being invisible, right? Like the invisible man or the invisible woman, right. They're still occupying one particular part of space. You just can't see them. Right. Or it's like predator. You get like the ghostly outline right. In the jungle. But they're still in that place, like locatable in that way. So while that points to something, right, as in they still exist, we can't see them with our physical eyes. Right. And in the case of Christ, right, when we say he's in our midst, we mean he's in our midst. We also can't generally see him with our eyes. This also has to do with both. This is going to be the. We're going back to time and space aren't real because time and space are categories of our experience of reality. Right. And so because they're qualities of my experience, they don't exist outside of human experience. When I am not directly experiencing, say, the prophet Elijah, you say, well, what does that mean? Well, on Mount Tabor saints Peter, James and John directly experience the prophet Elijah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10369.75,"end":10370.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10371.83,"end":10381.36,"speaker":"Fr Stephen De Young","text":"And in their experience of him, he occupied a place at a particular time. Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10382.4,"end":10382.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10382.8,"end":10392.96,"speaker":"Fr Stephen De Young","text":"When he entered into their experience, he entered into the categories of time and place, place, Mount Tabor, time, while they were there. Right. He's not still there now. You can go there."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10393.76,"end":10394.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10394.96,"end":10425.75,"speaker":"Fr Stephen De Young","text":"At least not to your direct experience. Right. But so when outside of human experience, the saints, Christ himself, the angels, for that matter, when outside of a human experience do not occupy any particular point in time and space, the Archangel Gabriel does not occupy a particular point in time and space, except when he appears in Nazareth."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10427.02,"end":10427.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10427.22,"end":10460.22,"speaker":"Fr Stephen De Young","text":"To tell the Theotokos she's going to bear a son, and then he is at that place at that time. So this is kind of brain bending. Right. But this is also the answer to a whole slew of related questions. Right. Like, how can the Theotokos hear all these people all over the world asking for her prayers? Because she's not occupying a particular place in space and time with physical ears having to hear them."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10460.22,"end":10463.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or through the vibrations in the air, you know, Panopticon."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10464.62,"end":10469.9,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Right. Like, because that's not how it works."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10470.46,"end":10472.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10473.26,"end":10501.58,"speaker":"Fr Stephen De Young","text":"And this raises questions that we as humans don't know the answer to. To, like after someone dies. Right. The intermediate state. And we've pointed at this on the show before, this is why things are so vague about, in Scripture, about what happens to us after we die before the resurrection, because there aren't words to describe it from the perspective of our experience."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10502.78,"end":10503.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10503.83,"end":10507.67,"speaker":"Fr Stephen De Young","text":"But what it isn't is sitting around somewhere waiting for the resurrection."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10508.95,"end":10509.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10509.27,"end":10511.11,"speaker":"Fr Stephen De Young","text":"I mean, that's kind of waiting room."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10511.19,"end":10514.31,"speaker":"Fr Andrew Stephen Damick","text":"That's the best that we can kind of conceive of it, but."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10514.63,"end":10515.11,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10515.27,"end":10517.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10518.23,"end":10525.83,"speaker":"Fr Stephen De Young","text":"Where we go to a place and then we are there in that place over a succession of moments."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10526.23,"end":10526.63,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10526.79,"end":10527.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10528.47,"end":10544.57,"speaker":"Fr Stephen De Young","text":"And that's not how it's going to be. And so there aren't words to describe that in terms of our current experience. So we get allusions and metaphors and these kinds of things in Scripture, but that's all we can do in terms of understanding that."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10544.57,"end":10551.45,"speaker":"Fr Andrew Stephen Damick","text":"Amen. All right, well, we did 19 questions, so good job, Father Stephen."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10555.05,"end":10556.65,"speaker":"Fr Stephen De Young","text":"Passable job, Father Andrew."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10556.73,"end":10557.29,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10557.37,"end":10560.45,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right, well, that is our show."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10560.45,"end":10561.38,"speaker":"Fr Stephen De Young","text":"I don't want you to get a big hat."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10562.09,"end":10609.62,"speaker":"Fr Andrew Stephen Damick","text":"That's okay. Yeah, it's fine. Yeah. We'll be back live next time we're going to be talking. I don't know how many episodes we might do on this kind of stuff. We're going to talk about the Antichrist, we're going to talk about the Mark of the Beast, a lot of that fun kind of stuff. So tune in X or Recovering Dispensationalists. This should be fun. It's really fun. So, all right, that's our show for this time. Thank you very much for listening, everyone. If we didn't take your question this particular time, we'd still like to hear from you. You can email us@lordofspiritscientientfaith.com or you can message us at our Facebook page. Or you can leave us a voicemail as you would have heard in this episode@speakpipe.com LordOfSpirits it's like a message in a bottle."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10610.34,"end":10618.35,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month. Normally, other than this one at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10618.43,"end":10631.79,"speaker":"Fr Andrew Stephen Damick","text":"I'm sending out an SOS and if you are on Facebook you can follow our page, you can join our discussion group, you can leave reviews and ratings everywhere, but make sure that you share this with a friend and also please let your priest know so he can know what the heck you're listening to."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10632.83,"end":10641.32,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. But Rock Roxanne, you don't have to put on the red line."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10641.56,"end":10645.48,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night. God bless you. Christ is risen."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10654.76,"end":10685.17,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Race Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10685.49,"end":10688.69,"speaker":"Fr Andrew Stephen Damick","text":"And honor and glory and Blessing."}
{"episode_id":"LOS - #068 - 2023-05-25 - Pantheon and Pandemonium VII - Asynchronous Q&A May 2023","start":10689.01,"end":10692.05,"speaker":"Fr Stephen De Young","text":"Revelation, chapter 5, verses 11 through 12."}
