{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":0.32,"end":64.91,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":66.99,"end":99.49,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers and dragon slayers. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Steven Damick in Emmaus, Pennsylvania. This is a pre recorded episode, so we're not taking any calls this time. And even though I said I'm in Emmaus in Father Stevens, Louisiana, the truth is when you're hearing this, assuming you're listening to it live, we're actually both somewhere in Texas. Can't tell you where exactly, but somewhere."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":99.49,"end":101.73,"speaker":"Fr Stephen De Young","text":"Not listening to it live, listening to the premiere."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":102.37,"end":104.69,"speaker":"Fr Andrew Stephen Damick","text":"That's true, yes. Thank you for that precision."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":105.49,"end":112.69,"speaker":"Fr Stephen De Young","text":"And also we will take your call if you sense that we're recording and you call right now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":112.69,"end":113.41,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":115.01,"end":128.64,"speaker":"Fr Stephen De Young","text":"What I'm really hoping by repeating that in these pre recorded episodes is that listeners of the show will just start calling the Ancient Faith studios at odd hours. Poor Trudy, hoping to catch us recording. That's what I'm going for."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":129.04,"end":202.69,"speaker":"Fr Andrew Stephen Damick","text":"Are they on now? Can I get through? Yeah, yeah. So a brief commercial. So on October 26th to 29th, 2023, Happy New Year everybody. By the way, at the Antiochian village in Western Pennsylvania, the forests of Penn, we are going to be holding the first ever Lord of Spirits conference. Fr. Stephen and I are going to both be there. We'll both be speaking, as well as will be Archbishop Alexander Gallitzin and Fathers David Subu and Lucas Christensen. And yes, there will be an RPG tournament, Dungeon Dragon. Extra points to anyone. And I'm not kidding about this, extra points to anyone who brings me A copy of Jack Chick's literary and yes, indeed, film classic Dark Dungeons. The schedule is still being worked on, but you can find all the current details and you can register very important because, like, we've sold out, I think, over half the Antiochian village now. Well over half. Well over half. Yeah. You can go to store.ancientfaith.com events. So get your tickets right now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":203.65,"end":215.25,"speaker":"Fr Stephen De Young","text":"And because my sister had to have this question answered, her question being, and I quote, can I get a refund if somebody dies before then?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":218.13,"end":219.17,"speaker":"Fr Andrew Stephen Damick","text":"You mean like you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":219.89,"end":220.77,"speaker":"Fr Stephen De Young","text":"It could be."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":222.53,"end":229.49,"speaker":"Fr Andrew Stephen Damick","text":"I mean, even if you. I don't know, I could die. You yourself, someone else could die. I think they would still hold the event. We'd have to all."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":229.49,"end":233.29,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, but the answer is yes. Yes, it is possible."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":233.45,"end":333.51,"speaker":"Fr Andrew Stephen Damick","text":"There are. Yes, it is possible to get a refund up to some point. I don't know when exactly. So. But yes, it is a thing. It is a thing. So the other commercial I want to give, since, you know, this is our bully pulpit, I want to point everyone. And you are a bully, and I am sometimes a bully, but I'm a nice bully. I'm a very nice bully. I want to point everyone to a newly released pilgrimage documentary that has begun to be available through ancient faith radio and of course, on all of your favorite podcasting apps. It is called the Wolf and the Cross, and it is the result of a pilgrimage. That friend of this show. I shouldn't call him that, actual friend. Richard Roland and I took along with my daughter to Lithuania this past summer, and we made a bunch of recordings and we've done a huge amount of research. The first episode is out. It's a little over two hours long. Fans of this show should recognize that as a very short episode of something and very, very high level of production. We've got ambient music, we've got sound effects, we've got voice actors. It is not just the whole nine yards. This goes to ten yards. This is ten yards worth of material. So I hope everyone will check that out. Like I said, the first episode is now available. We're planning on releasing them about once a month or so, maybe have some bonus episodes on top of the nine main episodes that we're planning on doing. I think you will find it fascinating and a lot of fun to listen to, actually."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":333.91,"end":337.34,"speaker":"Fr Stephen De Young","text":"So tonight, though, and allow me to point out."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":337.34,"end":338.3,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, point it out."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":338.38,"end":346.22,"speaker":"Fr Stephen De Young","text":"Shameless self promotion is over. That when I called out Richard Rollins, he fled the country."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":347.18,"end":348.7,"speaker":"Fr Andrew Stephen Damick","text":"That is actually true."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":349.5,"end":349.98,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":350.14,"end":351.9,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, he'd never even been outside."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":351.9,"end":353.1,"speaker":"Fr Stephen De Young","text":"Of the country kind of guy he is."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":354.7,"end":398.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So tonight though, for this episode, we're going to be talking about confession. We're continuing our series on sacraments. Confession is the Christian sacrament of the forgiveness of sins. What exactly is it? What does it do? Before we get to that though, we really need to ask, what is forgiveness? So is it true, I've heard this. Is it true that some Christians actually think that God can't forgive people? Kinda kind of true. Right. They wouldn't say that we should be, you know, fair and say. They would not say that. But what does that kind of mean?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":398.46,"end":416.18,"speaker":"Fr Stephen De Young","text":"Well, part. Part of what occasioned this phrasing was the Excerpting from a YouTube conversation I had by a person who I believe is a Muslim apologist."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":416.58,"end":417.14,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":417.79,"end":433.39,"speaker":"Fr Stephen De Young","text":"Of a less than a minute long clip of me saying that God can forgive people. And this was posted as me making me as a Christian priest making a startling admission."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":435.15,"end":436.35,"speaker":"Fr Andrew Stephen Damick","text":"You've given away the farm."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":436.91,"end":437.95,"speaker":"Fr Stephen De Young","text":"It was admits."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":438.11,"end":438.43,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":438.43,"end":531,"speaker":"Fr Stephen De Young","text":"Like admits. Like I've been trying to conceal this from people, that God can forgive people. Wow. Right. But what occasioned this from him? I'm assuming I don't know him, but what I believe occasioned this from him and from some other folks in other interactions I've seen. And what occasion be talking about it in the, in the YouTube conversation was that the people involved had been speaking to certain Christians who hold to a certain view of, from their perspective, they would say how forgiveness works. Right? Okay. So they wouldn't say God can't forgive sins. Right, right, right. But the way they would define, theologically define God forgiving sins to especially non Christians does not sound like forgiveness. And here's what I mean by that. There is. And we got to be honest, this is mostly some of, not all by any means, but some of our Protestant friends have this view that God has to punish sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":531.64,"end":532.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":532.6,"end":535.64,"speaker":"Fr Stephen De Young","text":"And not just in general. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":535.64,"end":536,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":536,"end":538.2,"speaker":"Fr Stephen De Young","text":"All sin, but that he has to punish sins."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":539.08,"end":541.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":541.24,"end":559.17,"speaker":"Fr Stephen De Young","text":"Like the individual acts all have to be punished. Because if he doesn't punish every single sin, then he isn't just. God isn't righteous. He isn't just if he fails to fully punish any sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":559.81,"end":560.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":561.89,"end":567.33,"speaker":"Fr Stephen De Young","text":"And so there are a lot of problems with this idea."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":568.13,"end":589.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean like logical, biblical. Right. I mean, to me the biggest one is this sense that God must do something, that God is subject to some kind of necessity. Right. That there's, that there's, I mean frankly, that there's something that God has to be obedient to."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":590.66,"end":600.18,"speaker":"Fr Stephen De Young","text":"Right. Right. That for God to be just, he has to do this means that this category of justice or righteousness is somehow over above him."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":600.82,"end":605.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, ancient people would have regarded something like that as being a God itself."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":606.35,"end":615.47,"speaker":"Fr Stephen De Young","text":"Right, Right. So if that's true, then whatever that is or whoever put it in place is the actual God. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":615.47,"end":616.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":619.39,"end":634.15,"speaker":"Fr Stephen De Young","text":"So that's a problem. Right. But when, when the, the folks who hold this view, when you ask them, obviously they're not going to say that. They say, no, no, no, no, no, there isn't something above God."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":634.95,"end":637.55,"speaker":"Fr Andrew Stephen Damick","text":"This is just who God is. Right, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":637.55,"end":674.94,"speaker":"Fr Stephen De Young","text":"It's God's own nature. Right. God's own nature. God has to be true to his nature. Again, using has to is weird in that case with nature. Right. Because nature is just who and what you are. But God acts consistently, which is nature. But that ends up amounting to a weird circular reasoning. Right. So it's like God is. God is just and therefore he has to punish every sin completely."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":675.02,"end":680.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But that's about one particular version of justice. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":680.98,"end":681.34,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":681.42,"end":681.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":681.82,"end":687.66,"speaker":"Fr Stephen De Young","text":"Right. And they would say, well, that particular version of justice is God's nature. But that's why it becomes a weird circular argument."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":687.91,"end":688.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":688.87,"end":715.95,"speaker":"Fr Stephen De Young","text":"Because let's say for the sake of argument that God actually didn't have to punish any sins at all. Right. Let's say God just forgave all sins and he didn't have to punish any of them. Right. Then that would be the way God is. And so that would be justice. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":716.11,"end":719.95,"speaker":"Fr Andrew Stephen Damick","text":"It's just a definitional argument is really what it is."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":720.11,"end":731.47,"speaker":"Fr Stephen De Young","text":"So that's the way God is. Because that's the way God is is not an argument. Right. It's just a statement. It's a tautology. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":732.83,"end":737.15,"speaker":"Fr Andrew Stephen Damick","text":"Well, the first rule of tautology club is the first rule of tautology club."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":737.31,"end":765.08,"speaker":"Fr Stephen De Young","text":"Yes. So the. You could use that same argument to support any notion of God's justice. That's just who he is. Based on his nature. That's who he is. But so beyond those logical issues is the fact that you end up with a God then who is merciless."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":766.53,"end":766.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":767.57,"end":809.9,"speaker":"Fr Stephen De Young","text":"Because how can he if he has to punish? Definitionally, one of the words, not the most common one, probably the second most common word in the New Testament that gets translated as mercy. The literal lexical definition is not punishing to the full extent. Right. So, you know, if a judge could sentence you to, I mean, I'm using a modern example, but if he could sentence you to 20 years in prison and he sentences you to 10. He is having mercy in that sense."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":810.22,"end":812.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":812.26,"end":821.59,"speaker":"Fr Stephen De Young","text":"By. By not punishing you to feel full extent. So that definite, that word for mercy, God can't have in this view at all."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":822.31,"end":823.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":824.95,"end":843.19,"speaker":"Fr Stephen De Young","text":"And the way that other term then gets interpreted according to this view is, well, yes, God has to punish every sin and he has to punish it fully, but so he shows mercy to you by punishing someone else, namely Christ, for it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":845.52,"end":845.76,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":848.4,"end":872.97,"speaker":"Fr Stephen De Young","text":"In order to argue that God is just. Because justice has been defined as punishing every sin completely. And so to make God fit that definition, you now have him letting a guilty person go free and punishing an innocent person and saying that that makes him both just and merciful."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":873.61,"end":874.73,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, I can imagine."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":874.73,"end":876.33,"speaker":"Fr Stephen De Young","text":"But really, it kind of makes him neither."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":876.65,"end":883.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, see, I can imagine. You know. You know, my kids occasionally get in fights and they occasionally do wrong things."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":885.53,"end":887.69,"speaker":"Fr Stephen De Young","text":"Are they fighting about, like, etymologies?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":889.37,"end":890.81,"speaker":"Fr Andrew Stephen Damick","text":"Not today, no."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":891.21,"end":891.77,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":893.69,"end":960.6,"speaker":"Fr Andrew Stephen Damick","text":"But we do. I mean, it is my house, so occasionally we do have conversations about. Yeah, yeah, but. But you know, if one of them, like, let's say one of them decides to, like, I have a fondness for what we refer to in my house simply as fake cheese, which is that sort of chemically produced Tostitos nacho cheese, you know, and I bring it home usually expecting that I will eat some of it. Sometimes when I go to eat some of it, it is gone already gone. You know, someone has taken it without permission. So if I find out who took it without permission and I say, well, look, I'm going to have mercy on you by punishing your brother instead. You know, he has to go to his room for the rest of the day or he's, you know, grounded from playing with his friends, number one, they would be dumbfounded. Right. But number two, I mean, that would seem so arbitrary and, like, cruel, especially to the person who had to receive the punishment and probably the person who didn't receive it, the kid would be just kind of confused by the whole thing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":963.96,"end":965.44,"speaker":"Fr Stephen De Young","text":"Wondering when his turn was going to be."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":965.44,"end":988.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. When are you going to get it next time? Yeah, I mean, it's not merciful because there's no, like, in that model where to be merciful is not to give the full punishment. That's not what's actually happening there. What's happening is, well, part of the punishment, or all of it, is being given to someone else instead. You know, the holding back is not actually a thing within this model that we're talking about."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":989.45,"end":989.85,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":989.85,"end":990.41,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":991.37,"end":1003.33,"speaker":"Fr Stephen De Young","text":"Right. So the Scriptures are pretty clear that the God who created the heavens and the earth, at least, is not merciless. In fact, quite the opposite."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1003.33,"end":1004.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1005.13,"end":1007.13,"speaker":"Fr Stephen De Young","text":"Is abundant and plenteous in mercy."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1007.13,"end":1009.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Way more merciful than any human being ever."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1009.81,"end":1010.05,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1010.21,"end":1019.81,"speaker":"Fr Stephen De Young","text":"And that creates yet another problem with that view, which is when we're told by Christ, forgive as the Lord forgave you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1021.33,"end":1021.89,"speaker":"Fr Andrew Stephen Damick","text":"Whoa."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1022.61,"end":1025.97,"speaker":"Fr Stephen De Young","text":"I just thought. Yeah, yeah. What does that mean?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1026.29,"end":1030.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That means the scenario in which I punished the kid who didn't do anything, not the one who did something."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1031.01,"end":1037.25,"speaker":"Fr Stephen De Young","text":"Or does it just mean, as any of the folks who hold that view would say when it comes to humans?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1039.06,"end":1039.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1039.38,"end":1041.7,"speaker":"Fr Stephen De Young","text":"They would say, well, no, you need to just forgive people."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1044.26,"end":1044.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1044.58,"end":1047.94,"speaker":"Fr Stephen De Young","text":"I mean, you don't need to punish every sin committed against you completely."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1048.1,"end":1052.86,"speaker":"Fr Andrew Stephen Damick","text":"Just let it go, just say it didn't happen, move on."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1052.86,"end":1066.83,"speaker":"Fr Stephen De Young","text":"Right, right. Have more love in you for them than the pain they caused you. Right. That's what we would say. But so are humans more merciful than God?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1068.99,"end":1069.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1069.47,"end":1078.67,"speaker":"Fr Stephen De Young","text":"In that model, humans can do that, but God can't. Right. And if you're gonna say God can't do that because it would be unjust. Is he commanding us to be unjust?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1079.71,"end":1081.39,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1082.43,"end":1139.84,"speaker":"Fr Stephen De Young","text":"Right. Like, so that whole thing kind of falls apart. Right. That. That whole. That whole understanding. And so the truth is as shocking as it is, apparently to at least one Muslim apologist, God can and does and always has just forgiven people their sins. Yeah. Now, the rest of this episode, we're going to be kind of talking about how he has done that at different times at different places, and how he does that today and who is involved. As we talked about last time in the ordination episode. Right. God works through people. Through whom does God do this? That's what we're going to be talking about the rest of the episode. But we have to start with forgiveness is a thing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1140.89,"end":1143.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1143.77,"end":1144.97,"speaker":"Fr Stephen De Young","text":"Forgiveness is a thing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1147.13,"end":1147.53,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1149.53,"end":1193.12,"speaker":"Fr Stephen De Young","text":"It'S not, again, a question of what sins was christ punished for 2000 years ago? Brief note to our Protestant listeners who are not Calvinists. How does that even work for you? I get how it works for a Calvinist. Right. Because God had already decided who he was going to save and who he wasn't. Christ was punished for the sins of those people he was going to save and not for the others, but for the rest of you folks who are Calvinists."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1196.13,"end":1196.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1196.33,"end":1241.02,"speaker":"Fr Stephen De Young","text":"Like, how does that work anyway? I'll leave that to you. Or we can sort of abandon that view of atonement, sin and punishment, and our lives get much Better. So the other piece that we kind of need to talk about here at the beginning is about the. The Torah, the law, as St. Jerome would have it. Although when he translated that way, I think we've talked about this in a previous episode, that when he translated it that way, it didn't have the same connotation as Lex. Did not have the same connotation as law does today."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1241.1,"end":1246.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's much more like ways. Right, yeah. Like the Greek teaching."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1246.79,"end":1262.63,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Teachings. Yeah. Custom. Yeah. Way of life. But so. And I hate, you know, how I hate to pick on people or at least how I hate to be seen to be picking on people."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1265.51,"end":1265.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1265.87,"end":1276.83,"speaker":"Fr Stephen De Young","text":"Because, you know, hey, Thrasymachus kind of had it right. You know, as long as you appear, just. You can act unjust and get the best of both worlds. But."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1278.03,"end":1279.23,"speaker":"Fr Andrew Stephen Damick","text":"Well, good night, everybody."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1281.63,"end":1328.36,"speaker":"Fr Stephen De Young","text":"Many of the same folks who hold to the view of sort of justice. Right. And the punishment of sin and forgiveness that we just talked about also have another belief regarding the Torah, the law. Right. The commandments, in terms of what it's for, what the purpose was. And that's why it's germane here when we're talking about confession and forgiveness. And that's that the view that some folks have is that the commandments outline a way to earn your way to heaven."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1329.16,"end":1336.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And I think that this is mostly connected with our dispensationalist friends. You know, where there's this."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1336.96,"end":1338.04,"speaker":"Fr Stephen De Young","text":"Oh, there's lots of folks."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1338.04,"end":1374.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which, I mean, definitely them, but also others. Yeah, yeah. It especially gets out into a lot of other groups as well. You know, there's this notion that, well, God set up this one method of salvation that he knew everyone was going to fail at, so that, you know, the. The next method of salvation is going to come on the. On the scene with Jesus and, you know, you don't have to do much for that one. And it's okay. You don't have. It's not about you failing or succeeding. Jesus is going to take care of it, essentially."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1375.05,"end":1375.73,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1375.73,"end":1382.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is the view that I was. This view I was raised with as evangelical, even though we weren't especially dispensationalist."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1383.84,"end":1405.36,"speaker":"Fr Stephen De Young","text":"Right. And classical Reformed, like not just Reformed, like Calvinist, but Reformation Protestantism, is that Christ comes and fulfills the law and earns. It's the flip side of what we were just talking about. Right. Christ earns heaven for himself."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1405.6,"end":1408.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he gets it all and now he can kind of hand it out."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1408.64,"end":1417.7,"speaker":"Fr Stephen De Young","text":"The Torah Perfectly. And so he receives the punishment for our sins and he gives us the heaven that he earned. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1418.02,"end":1420.02,"speaker":"Fr Andrew Stephen Damick","text":"Almost like it's a storehouse of merit."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1420.66,"end":1432.82,"speaker":"Fr Stephen De Young","text":"Yeah. And so the core problem here is that's never what the Torah, the law, the commandments. That's never what they were."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1433.3,"end":1435.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It never says that anywhere in the Old Testament."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1436.05,"end":1450.21,"speaker":"Fr Stephen De Young","text":"It says that nowhere in the Old Testament. It says that nowhere in the New Testament. Jewish people have never believed that. They didn't believe it in ancient Israel. They didn't believe in the second Temple period. I have it on very good authority they don't believe it now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1451.25,"end":1459.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's why even there are some Jewish people who don't actually believe in an afterlife in heaven. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1460.77,"end":1462.29,"speaker":"Fr Stephen De Young","text":"Eternal life, the resurrection."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1462.29,"end":1467.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which would be an impossible belief to hold if that's what the law was all about. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1469.55,"end":1501.71,"speaker":"Fr Stephen De Young","text":"But yeah. Or salvation, however you wanted to find out about earning salvation. It's not about earning anything. Right. And there's all kinds of basic levels that falls apart at. Beyond the fact that it literally never says that. And as we're going to talk about here in a minute, it says the scriptures say it was for something else. I mean, just think for a second about the fact that most of the commandments of the Torah are directed at Israelites and only Israelites."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1503.39,"end":1503.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1504.67,"end":1521.46,"speaker":"Fr Stephen De Young","text":"Right. So is it just way harder for Jewish people to get to heaven than everybody else? Right. Like, is their road of salvation just, like way harder than everyone else's? Right. Gentiles just have to not eat blood and refrain from sexual immorality and idolatry."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1521.46,"end":1524.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because, I mean, the law includes commandments for them."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1524.9,"end":1593.31,"speaker":"Fr Stephen De Young","text":"Yeah. But that's about all you have to do. Right. You can eat bacon. Right. You can live, laugh, love. But you know, so. Right. At that level, it doesn't make sense either. But more importantly, the scriptures tell us what the commandments of the Torah were for and are for still. And that's that they operated as a sort of sin management system. Yahweh, the God of Israel, comes to dwell among his people. He is holy. Therefore that is dangerous because they are sinners. And so towards the system for managing the sins of the people. Part of that system is giving commandments of life. Right. Meaning, here's how to live your life to avoid sin, to avoid coming under the power of sin. Part of that then also though, is what you do when you sin, how you deal with sin when it happens."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1593.39,"end":1604.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, some of the commandments are like, you can't keep all the commandments without Breaking some of the commandments. Right. There's no way around it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1605.39,"end":1611.07,"speaker":"Fr Stephen De Young","text":"St. Paul says this in Galatians when he says the law was added because of transgressions."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1611.47,"end":1611.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1613.87,"end":1643.92,"speaker":"Fr Stephen De Young","text":"Right. The Torah was given because of transgressions. If it were not for sin, it wouldn't have been needed. Right. Well, that means it can't be about how to earn your way to eternal life or salvation. Right. So, yeah, keeping Torah. The idea of keeping Torah is not just about not doing a whole list of bad things."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1644.56,"end":1645,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1645,"end":1646.4,"speaker":"Fr Stephen De Young","text":"That's a small portion."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1646.4,"end":1661.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think a lot of people, that's their concept of it is, you know, thou shalt not. Thou shalt not. Thou shalt not. And as long as you shall not. Terrible grammar. I know. But as long as you shall not, then you've got it covered. Right. And like, oh, you broke one. Sorry."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1662.97,"end":1663.61,"speaker":"Fr Stephen De Young","text":"That's it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1663.77,"end":1664.37,"speaker":"Fr Andrew Stephen Damick","text":"Big loser."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1664.37,"end":1665.29,"speaker":"Fr Stephen De Young","text":"Now you're going to hell."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1665.29,"end":1666.05,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1666.05,"end":1668.09,"speaker":"Fr Stephen De Young","text":"I think there's nothing you can do about it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1668.25,"end":1668.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1668.81,"end":1671.13,"speaker":"Fr Stephen De Young","text":"Unless someone gets punished for that thing you did."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1671.37,"end":1673.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1673.61,"end":1706.02,"speaker":"Fr Stephen De Young","text":"And again, that's nowhere in Scripture. And one of the things that really highlights this is that the scriptures say that there are a bunch of people who kept the Torah perfectly. And even though they kept the Torah perfectly, they still needed Christ, they still needed a savior. So, for example, one of these that people find surprising is David."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1706.58,"end":1708.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The adulterer and murderer."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1708.85,"end":1780.61,"speaker":"Fr Stephen De Young","text":"Yes. And if you want to see where you go to where after the kingdom has been, most of the kingdom has been taken away from Solomon because of his sins. Right. So Rehoboam becomes the king of Judah, which covers Judah, Benjamin, and most of the Levites. Right. And then the other tribes, the northern kingdom of Israel, is being given to Jeroboam, son of Nebat, who is one of Solomon's court officials. And God sends the prophet to Jeroboam. And the prophet says to Jeroboam, if you keep all of my commandments and my statutes, just as my servant David did, I will also give you an everlasting dynasty. Right. And so little record scratch. David perfectly kept all of God's commandments and statutes. Right. Well, he did. Once you realize the fact that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1782.77,"end":1783.05,"speaker":"Fr Andrew Stephen Damick","text":"A."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1783.05,"end":1787.01,"speaker":"Fr Stephen De Young","text":"Whole bunch of those commandments and statutes are about what to do when you sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1787.48,"end":1788.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1788.6,"end":1796.28,"speaker":"Fr Stephen De Young","text":"So when David sinned, he repented. He did what the Torah prescribed."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1796.84,"end":1797.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1797.2,"end":1845.66,"speaker":"Fr Stephen De Young","text":"He did what he was called to do. Right. And so he is, as far as God's Torah is concerned. Right. He had kept it perfectly. That didn't mean never sinning. It meant doing what it said, when it said. And by the way, by the way, I know there's this weird meme going around that's come out of certain Old Testament scholarly circles that the Torah only offered forgiveness for unintentional sins. Here's an example where that's obviously false. David committing adultery and murder was not unintentional or accidental or involuntary."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1846.06,"end":1846.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1847.98,"end":1850.86,"speaker":"Fr Stephen De Young","text":"Okay. And how do you involuntarily steal?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1852.22,"end":1852.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1853.42,"end":1867.8,"speaker":"Fr Stephen De Young","text":"Okay, anyway, oops, I robbed someone. So anyway, but so David kept the Torah perfectly. Still needed a savior."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1869.48,"end":1870.04,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":1870.36,"end":2065.13,"speaker":"Fr Stephen De Young","text":"Right. Some unnamed Gentiles kept the Torah. You can find that in Romans 2:14 specifically, but in Romans chapter 2. In Romans chapter 1, I'll back up even a little further, real briefly. So St. Paul writes his Epistle to the Romans to the Christian community in Rome after for a couple of years, the Emperor Claudius had expelled all of the Jews from Rome. And this is actually mentioned in the Book of Acts, this is how St. Paul ended up meeting Saints Priscilla and Aquila, is that they were some of the Jewish people who had been exiled from Rome. And then after a couple of years, he let them come back. And so the Christian church with only Gentile members had continued functioning in Rome. And now the Jewish members are coming back after being away for this time. And so St. Paul writes the Epistle of the Romans aimed at primarily helping them reintegrate right, into one community and not becoming these two separate. This is a constant struggle for St. Paul. He doesn't want there to be a Jewish church over here and a Gentile church over there, sort of ethnically defined. And so in the first chapter of Romans, St. Paul is kind of talking to the Gentile members of the church, talking about all the former wickedness and depravity they were involved in back when they were pagans. But then in the second chapter, he turns to the Jewish Christians and says, well, okay, yeah, you weren't in the same boat, right? You had received the Torah, you had received the covenants, the commandments, right? You received these things. But then he turns around and says, okay, you received all these things, you received the Torah, but did you keep it? Did you really live by it or did you violate it? And as part of that argument, he says, the Gentiles, these people who aren't Jewish, there's a bunch of them who have kept what's required of them, the Torah, without knowing about the Torah. And he says they were like a law unto themselves. They were like a Torah themselves. They were self taught. If Torah means teachings, right, they're sort of self taught, they kept those things better than some of you did who read and studied it. Right. But so in the course of that argument and in the point that he's trying to make, St. Paul says there were Gentiles who didn't even know what the Torah was, didn't know the law, but who kept it. He's not saying by that. Well, I guess those Gentiles have earned their way, earned their salvation and don't need Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2065.37,"end":2065.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2065.69,"end":2123.3,"speaker":"Fr Stephen De Young","text":"That's not what St. Paul is saying. Again, see chapter one. But his point is right again about Torah keeping. Right. But probably the most important example here I think is in Philippians chapter three. And St. Paul in sort of lifting off his credentials from his former life, a non Christian pharisee in Philippians 3:6 says that he, this is before the road to Damascus. St. Paul is writing after, but saying about himself before that he was blameless in terms of the law. He was blameless in terms of the Torah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2123.3,"end":2126.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which he's not saying he never sinned."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2127.3,"end":2127.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2127.86,"end":2130.1,"speaker":"Fr Andrew Stephen Damick","text":"And he's certainly not saying he does not need a savior."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2131.55,"end":2134.43,"speaker":"Fr Stephen De Young","text":"Yes. Because he goes on to say he was murdering Christians."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2134.83,"end":2139.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2140.51,"end":2153.07,"speaker":"Fr Stephen De Young","text":"It certainly is the same. In fact, he goes on to say that he counts all of that as rubbish, as garbage compared to what he found in Christ. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2153.23,"end":2157.79,"speaker":"Fr Andrew Stephen Damick","text":"Because what you get from the law is not the same thing that you get from Jesus Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2159.4,"end":2187.8,"speaker":"Fr Stephen De Young","text":"Right. Because it serves a different function. It's a whole different thing than what Christ does. Some of that up is that the commandment to repent is a commandment. You can't say you've kept all the commandments unless you also have kept the commandment to repent."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2188.42,"end":2190.82,"speaker":"Fr Andrew Stephen Damick","text":"And you can't repent unless you've sinned."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2192.42,"end":2199.46,"speaker":"Fr Stephen De Young","text":"Right. And the person who repents is keeping the commandments. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2199.62,"end":2250.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Which I mean, you know, as a sidebar, right. Some Christians have this notion of Christian life is about not committing any sins, but you know you're going to sin like it's just the way that it is. Sorry everybody, you're going to sin. And sure, you know, we try not to commit sins, but the Christian life, a lot of it actually is, what do you do when you sin? And doing that does not make you a bad Christian, it makes you a Christian. That's what being a Christian is about, is about this life, repentance. So as a sidebar, although again, not about earning salvation either, but we'll get to that to some extent."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2250.34,"end":2286.92,"speaker":"Fr Stephen De Young","text":"But yeah, and it also, frankly, this Idea that God gave a bunch of rules to the Israelites that he knew they would never be able to keep just to make a point. Right, right. Like you could kind of make that work in this. A lot of times theological discussions end up in this weird abstract place, this weird ideological place where it's just sort of ideas battling against each other. And if you try and put them into the real world, you quickly realize that the whole conversation makes no sense."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2287.08,"end":2305.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, this is one of the polemics sometimes that ex Christians particularly have against Christianity is like, well, God set up all these rules that he knew that no one could follow, and now he sends us to hell for not following, following them. And, you know, if that's you listener, if you think that that's what Christianity is, I don't believe in that either, you know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2305.9,"end":2375.44,"speaker":"Fr Stephen De Young","text":"Right, right. So over against this idea that, like, ancient Israel was a giant fallout vault. Right. Is the right. What you're saying when you say that. Right. When someone says that. Right. And you look at it as this abstract idea, you say, well, yeah, I know it's really hard for me. I mean, I sin. So, yeah, that seems to make sense to me. Okay. But let's take it outside the realm of ideas. Let's take this into the world of. We'll say again, because I don't argue about it. 1500 years of history, 1500 years of actual humans, of humans being butchered, enslaved, disemboweled, taken into exile. Right. As judgment for having not kept rules that God gave them that he knew they couldn't keep. Yeah. That's what you're saying, right? That's the God you're talking about."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2375.44,"end":2379.52,"speaker":"Fr Andrew Stephen Damick","text":"Because that's what happens to Israel and. Right, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2380.32,"end":2457.07,"speaker":"Fr Stephen De Young","text":"All to make a point. That point being, oh, you gentiles, you should just believe in Jesus and not try to keep commandments. This is bizarro world. When you take it outside the realm of ideas, when you take it outside of a theology textbook. Right. It doesn't make sense. And so, you know, and the bigger problem is then people try to structure their actual lives according to a set of ideas that don't make sense in the real world, which is not something God has ever called us to do. Right. So when God gave the Torah, the world was already full of violence. It was full of vengeance taking. It was full of consequences of sin and wickedness playing out in people's lives and destroying them. The Torah doesn't bring that into the world."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2458.83,"end":2459.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2461.72,"end":2499.64,"speaker":"Fr Stephen De Young","text":"The Torah comes into the world in order to bring forgiveness in Order to bring the presence of God into the world safely for the people in whose midst he's living. It is as St. John says in the prologue to his Gospel. The law came through Moses. Grace and truth came through Jesus Christ. Therefore, we have received grace after grace. The law is grace. The Torah is grace. It is not the opposite."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2499.64,"end":2506.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because grace is the action of God in this world, and that comes from God. It is his act."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2508.92,"end":2533.24,"speaker":"Fr Stephen De Young","text":"And there are other things going on through the Torah too. Right. Because the Torah is a way to practice holiness, and it's a way to live and be in the world. Go listen again to our blessings and curses episode. Right. Where you have a life in this world that is blessed rather than cursed, and that is not rewarded versus punished."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2535.4,"end":2535.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2536.44,"end":2539,"speaker":"Fr Stephen De Young","text":"Right. This is consequences."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2539.48,"end":2574.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like keeping a garden. If you plant the particular plants that you have in the right way and water them in the right way and take care of them in the right way, they're going to do well. But if you neglect them or you plant them too close together, or you put it next to something you shouldn't have, or water it too much or not enough, then it's going to do badly. It's not that God is saying, ah, I see what you're doing. I will smite your vegetables. Right. It's that this is what happens when you live in a certain way."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2575.79,"end":2580.91,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And all. All of these things were still wrong before the Torah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2581.15,"end":2584.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Sin wasn't invented by the Torah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2585.71,"end":2591.47,"speaker":"Fr Stephen De Young","text":"Right. God had not said, thou shalt not murder before Cain killed Abel. It was still murder."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2592.03,"end":2592.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2594.99,"end":2604.59,"speaker":"Fr Stephen De Young","text":"It wasn't God saying it that made it a sin. Right. It wasn't God saying it that made it evil. It wasn't God saying it that gave it consequences."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2604.59,"end":2607.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of written into the fabric of creation itself."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2608.07,"end":2608.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2609.27,"end":2609.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2609.71,"end":2610.07,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2612.07,"end":2614.63,"speaker":"Fr Andrew Stephen Damick","text":"That's why you can't just revise morality, by the way."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2614.87,"end":2630.92,"speaker":"Fr Stephen De Young","text":"Right, Right. And so the Torah is teaching. It's God revealing that, making that plain to people. Right. The law is given, as our liturgy says, as an aid, as a guide to aid us."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2634.28,"end":2634.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2635,"end":2683.59,"speaker":"Fr Stephen De Young","text":"Instead of being in the dark like the Gentiles fumbling around trying to figure out where to live the light, Israel is told, here's how to live in the world in a state of blessedness. That's a help. That's a good thing. Right. And the whole wisdom literature tradition, both inside and outside of the Old Testament scriptures, is based on meditating on that, on working that out in various practical ways in human lives. So the other thing that we've been hinting at already is that salvation is not. And we've talked about this a lot when we've talked about theosis before. But salvation is not just having your sins. Forgiveness."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2684.54,"end":2684.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2685.9,"end":2687.66,"speaker":"Fr Stephen De Young","text":"It's not returning to a state of innocence."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2687.82,"end":2692.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Nor is it just, I get to go to heaven when I die instead of going to hell."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2693.66,"end":2706.22,"speaker":"Fr Stephen De Young","text":"Yeah. Salvation is. Again, it's theosis. Salvation is becoming like God, which is what humanity was created to do before sin came into the world."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2706.62,"end":2722.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the first commandments that God gave to cultivate the earth and to fill it are exactly the things that he Himself had just been doing in Genesis chapter one. So he's saying, these are the works I did. I want you to continue my works, become more like me."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2724.08,"end":2728.16,"speaker":"Fr Stephen De Young","text":"And then as now, sin is obviously an obstacle to that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2728.32,"end":2730.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2730.96,"end":2748.7,"speaker":"Fr Stephen De Young","text":"But it's an obstacle along a road that we're still walking that's going in a positive direction, and that is salvation that's accomplished in Christ, which the law."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2748.7,"end":2751.26,"speaker":"Fr Andrew Stephen Damick","text":"Was never set up for through his."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2751.26,"end":2768.96,"speaker":"Fr Stephen De Young","text":"Incarnation, through his death and resurrection. His death and resurrection is removing another one of those obstacles, death. But Christ removes all the obstacles, but he also fulfills the path that leads to God."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2768.96,"end":2780.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So all of that lengthy throat clearing done. Yeah. Right. So what exactly is forgiveness, then?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2784.96,"end":2787.76,"speaker":"Fr Stephen De Young","text":"Forgiveness is just forgetting about stuff."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2789.12,"end":2789.52,"speaker":"Announcer","text":"No."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2792.55,"end":2806.23,"speaker":"Fr Stephen De Young","text":"So when forgiveness is talked about in the scriptures, it is talked about in the context of purification, being purified. Of uncleanness."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2806.23,"end":2807.43,"speaker":"Fr Andrew Stephen Damick","text":"Of uncleanness. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2807.91,"end":2817.78,"speaker":"Fr Stephen De Young","text":"Right. Uncleanness over and over again. Starting the Torah is paralleled with. Right. It wasn't just that God was super concerned about mildew."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2820.41,"end":2821.21,"speaker":"Fr Andrew Stephen Damick","text":"I love that example."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2821.21,"end":2841.85,"speaker":"Fr Stephen De Young","text":"Every time, I'm sorry to have an ugly bathroom. Right. It's now that you're super concerned about mildew. Right. Does mildew represent something? It's not that the skin conditions called leprosy are like the worst diseases. Right. It's that it's an image of how sin works."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2841.85,"end":2860.82,"speaker":"Fr Andrew Stephen Damick","text":"Well. And I mean, I think, for instance, about 1 John 1:9, very famous verse where it says that if we confess our sins, that God is faithful and just, he's going to. And these are paired together, Forgive us our sins and cleanse us from all unrighteousness. So there's that purification as part of the whole action."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2861.78,"end":2867.94,"speaker":"Fr Stephen De Young","text":"Right. Or Psalm 51, which is 50 in the Greek numbering. Cleanse me with hyssop and I shall be clean."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2868.26,"end":2869.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2869.46,"end":2877.54,"speaker":"Fr Stephen De Young","text":"Wash me and I shall be whiter than snow. Right. So this is over and over and over and over again. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2877.54,"end":2884.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That your sins be as scarlet. I mean, it just. Yeah. This washing connection goes along with forgiveness of sins everywhere."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2884.78,"end":2921,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And you notice what. That isn't right. This isn't about crime and punishment. Right. This is about purification. Because as we said before many times on the show, sinning, committing sins. Right. And sin does something to you. It changes you, and that needs to be healed and corrected. Today's word of the day. So anytime you hear it, scream real loud. Wow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2921.16,"end":2922.04,"speaker":"Fr Andrew Stephen Damick","text":"That's a throwback."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2924.17,"end":2938.17,"speaker":"Fr Stephen De Young","text":"Is Agos. You probably won't hear it that well. You'll hear it a few times in this episode, but beyond that, I don't know how many times you'll hear it, but as a kid, I actually did that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2939.77,"end":2940.33,"speaker":"Fr Andrew Stephen Damick","text":"You actually."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2940.33,"end":2942.33,"speaker":"Fr Stephen De Young","text":"The rest of the day, I would scream at my parents."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2942.49,"end":2943.37,"speaker":"Fr Andrew Stephen Damick","text":"Scream real loud."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2943.37,"end":2947.61,"speaker":"Fr Stephen De Young","text":"After you watched Pee Wee's Podhouse in restaurants. It didn't matter."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2947.77,"end":2952.26,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I'm sure everyone else was watching it, so they understood what you were doing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2953.46,"end":2974.06,"speaker":"Fr Stephen De Young","text":"Probably not. I tried to lead my younger sister into my same evils and indignities by screaming along with me. But anyway, agos is a Greek word, not to be confused with ayos, although they're spelled very similarly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2974.06,"end":2975.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's one."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2975.58,"end":2976.66,"speaker":"Fr Stephen De Young","text":"The latter means holy."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2976.66,"end":2977.9,"speaker":"Fr Andrew Stephen Damick","text":"One iota's difference."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2979.02,"end":2990.94,"speaker":"Fr Stephen De Young","text":"Yes. Anyway, they are not. I'm going to go ahead and say they are not etymologically related."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2991.58,"end":2992.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":2992.38,"end":3022.09,"speaker":"Fr Stephen De Young","text":"There are a couple guys who argue they are, but I don't think they are. And so this word has several usages. Right. Because, of course, meaning is derived from usage with words. One of them is awe or reverence or fear. And this is in the fear of the Lord sense."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3022.09,"end":3024.85,"speaker":"Fr Andrew Stephen Damick","text":"The fear of the Lord, the beginning of wisdom, all that stuff."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3025.09,"end":3028.53,"speaker":"Fr Stephen De Young","text":"Or in the liturgy, when we talk about the dread mysteries of Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3029.47,"end":3030.03,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3030.03,"end":3044.75,"speaker":"Fr Stephen De Young","text":"We're not talking about scary or macabre. We're talking about this kind of sense of awe or reverence. Right. It can also mean impurity or uncleanness."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3045.95,"end":3052.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So, like, it seems like it's like the English word mullet, which can mean so many different things."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3054.11,"end":3056.27,"speaker":"Fr Stephen De Young","text":"Mostly means a sweet haircut."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3056.75,"end":3082.98,"speaker":"Fr Andrew Stephen Damick","text":"Don't seem to have much to do with each other. I mean, an initial blush. Right. Okay. All reverence and fear. Okay. And then impurity or uncleanness. Like, but what's the relationship between these concepts? If you are impure or unclean, then the appropriate attitude for you to have as you approach God is awe, reverence, fear. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3082.98,"end":3084.78,"speaker":"Fr Stephen De Young","text":"So that's what instills that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3084.94,"end":3087.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's connected together. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3087.98,"end":3089.98,"speaker":"Fr Stephen De Young","text":"Think of Isaiah during his vision."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3089.98,"end":3092.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Man of unclean lips. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3094.86,"end":3101.14,"speaker":"Fr Stephen De Young","text":"And the third use is related to the second one, and that's an abomination. It's the word that's used to translate."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3101.14,"end":3106.94,"speaker":"Fr Andrew Stephen Damick","text":"The word, which means really, like a thing that's thrown out or cast away or, you know. Yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3107.26,"end":3117.56,"speaker":"Fr Stephen De Young","text":"Polluted thing. Yeah. And then it could also be revolution used to refer to a sin offering type of sacrifice. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3117.56,"end":3118.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3118.28,"end":3123.16,"speaker":"Fr Stephen De Young","text":"The sacrificial ritual that seemed to sort of remove the impurity and uncleanness."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3123.4,"end":3129.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes. There's kind of this whole sort of network of meanings that are all used in various ways with this one word."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3130.12,"end":3168.31,"speaker":"Fr Stephen De Young","text":"Right. Probably the most common place it shows up is in Second Temple Jewish literature, a vast swath of it. It's the word in Greek that's used to talk about impurity, both ritual impurity in terms of the Torah and moral impurity. And once you understand that concept and the conceptual link of this word, it helps you understand a lot of texts. Right. In a new way in the scripture. Like the fear of the Lord is the beginning of wisdom."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3169.72,"end":3170.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3170.36,"end":3175.08,"speaker":"Fr Stephen De Young","text":"It's not about don't be an atheist or you can't know anything. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3175.8,"end":3197.24,"speaker":"Fr Andrew Stephen Damick","text":"No, I mean, the cool thing is you can kind of use a few of these different meanings there. So all reverence, fear. Okay. So, you know, that sense of approaching God reverentially, but also the repentant act of sin offering and sacrifice is the beginning of wisdom."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3197.82,"end":3199.26,"speaker":"Fr Stephen De Young","text":"So that is. Yes. Repentance."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3199.82,"end":3200.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3201.34,"end":3204.06,"speaker":"Fr Stephen De Young","text":"The idea of repentance being the beginning of wisdom."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3205.42,"end":3206.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3207.18,"end":3209.7,"speaker":"Fr Stephen De Young","text":"Of a kind of humility being the beginning of wisdom."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3209.7,"end":3233.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I'm reminded, I think it's an. On the incarnation, St. Athanasius at one point says, and I might be slightly paraphrasing here, but he says, unless one has a pure mind and is trying to imitate the lives of the saints, he can't ever understand their teachings. Yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3233.45,"end":3237.69,"speaker":"Fr Stephen De Young","text":"And also, you know, true love casts out fear."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3238.33,"end":3240.65,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. So it casts out."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3240.65,"end":3243.65,"speaker":"Fr Stephen De Young","text":"It's not just, well, if you love God enough, you won't be afraid of him anymore."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3243.65,"end":3246.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's cast out that impurity, that uncleanness, the abomination."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3247.77,"end":3249.45,"speaker":"Fr Stephen De Young","text":"Right. That love purifies."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3249.61,"end":3251.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Cool. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3251.6,"end":3316.28,"speaker":"Fr Stephen De Young","text":"The love of God purifies. But so this is that pollution, that impurity idea is closely related to. And I think we may have even briefly talked about the Word back when in the blessings and curses episodes, we were talking about curse, that purification that is, forgiveness is the. The removal of that cursed state and of the stuff, the kind of residue of sin that kind of brings it about. Right. And this is transformational. Right. In the same way that sin corrupts. Right. Forgiveness brings sort of new life and restoration. Right. And a new way of life. And this is part of why. And you see this especially in the Gospels."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3319.32,"end":3319.72,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3321.72,"end":3344.84,"speaker":"Fr Stephen De Young","text":"Healing and forgiveness are always closely linked together. Right. As being parallel with each other. Right. That healing and forgiveness work in the same way. This is where you get St. John Chrysostom's famous saying that the church is not a courtroom, it's a hospital."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3345.24,"end":3345.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3349,"end":3374.34,"speaker":"Fr Stephen De Young","text":"And a place where you especially see that in these terms. And to kind of wrap up what we've been talking about in this first half in Matthew 8, 16, 17, which is a short little bit that gets skipped over really fast because there's sort of a story before that in Matthew 8 and a story after that in Matthew 8. This is kind of a transitional two verses, but it's actually very important in terms of the topic we're addressing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3374.58,"end":3404.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I think another reason this gets skipped over probably is it's like, oh, yeah, Jesus did some more good. He's doing good all the time. Here's some more good he's doing. Yeah. So Matthew 8, 16, 17. That evening they brought to him many who were oppressed by demons, and he cast out the spirits with a word and healed all who were sick. This was to fulfill what was spoken by the prophet Isaiah. He took our illnesses and bore our diseases."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3407.27,"end":3430.79,"speaker":"Fr Stephen De Young","text":"So notice there. Right. So Jesus is doing all of these healings. Right. And then there's this quote from Isaiah. Real easy to read over that. But if you go and look where that quotation from Isaiah is from, it's from Isaiah 53."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3431.67,"end":3432.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3432.71,"end":3434.63,"speaker":"Fr Stephen De Young","text":"It's the suffering servant passage."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3434.63,"end":3437.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3438.71,"end":3484.19,"speaker":"Fr Stephen De Young","text":"And so some of the folks we were addressing at the beginning of this half, Isaiah 53 is a go to. Christ has borne our iniquities right. By his stripes. We're healed. Right. Talking about, you know, see, look, this is saying he's being punished for our sins. Right. But that's not how Matthew 8 reads it. St. Matthew reads this totally differently. St. Matthew reads this as this scripture being fulfilled. He took our illnesses and bore our diseases. Took them. Bore them. This obviously doesn't mean that when Christ healed someone who was paralyzed, he became paralyzed."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3485.15,"end":3486.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's sort of absorbed there."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3487.55,"end":3496.84,"speaker":"Fr Stephen De Young","text":"Right. Or that he healed a leper and he got leprosy. Like he took the leprosy for them. Right. It's clearly not what it means."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3497.4,"end":3497.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3497.96,"end":3531.86,"speaker":"Fr Stephen De Young","text":"It means he took them away, he bore them away. They're gone. Right. So since in Isaiah, the healing language and the forgiveness of sins language is all mixed together, why on what basis would you disagree with St. Matthew and say no forgiveness of sins works entirely differently than the healing of diseases?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3532.82,"end":3534.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3534.7,"end":3539.1,"speaker":"Fr Stephen De Young","text":"I mean, even though St. Matthew and Isaiah are both paralleling those same way."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3539.1,"end":3547.79,"speaker":"Fr Andrew Stephen Damick","text":"How many times do we see in the Gospels Jesus saying, your sins are forgiven you and he's healing them of a disease while he does that?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3548.19,"end":3549.55,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3549.55,"end":3549.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3550.27,"end":3553.55,"speaker":"Fr Stephen De Young","text":"Which is easier to say your sins are forgiven or to say, rise up and walk."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3553.63,"end":3554.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3556.11,"end":3564.03,"speaker":"Fr Stephen De Young","text":"Right, yeah. He just forgives people their sins. You're admitting that he's God."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3564.67,"end":3570.39,"speaker":"Fr Andrew Stephen Damick","text":"He can do that. He can do that. He's not bound by any kind of necessity. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3570.55,"end":3585.83,"speaker":"Fr Stephen De Young","text":"And you notice the objection of the rulers of the synagogue is not. Wait a minute, all sin must be punished or God is unjust. The objection of the synagogue rulers at that point is who is he thinking he could forgive sins? Only God can do that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3585.83,"end":3591.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Leading us to all ask that Christianity."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3591.27,"end":3592.87,"speaker":"Fr Stephen De Young","text":"If you forget it, God can do that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3592.95,"end":3597.64,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Wait, he's God. Oh, that's. That's right. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3597.64,"end":3630.57,"speaker":"Fr Stephen De Young","text":"Right. So, yeah. And so partially here to wrap up the first half, just to bring back to mind some of the things that we're not going to laboriously go through it all again, a lot of the things we've talked about in terms of sin on the show that are then connected to this idea of forgiveness, as we've already mentioned, at least this idea of sin in the singular that St. Paul uses, that goes all the way back to Cain. Sin is crouching at your door. It wants to master you. You must master it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3630.57,"end":3632.21,"speaker":"Fr Andrew Stephen Damick","text":"Demonic force of sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3632.85,"end":3681.12,"speaker":"Fr Stephen De Young","text":"Right. And as St. Paul later says, you know, all things are permissible to me, but I will not be mastered by anything. Right. That. That sin is this. This power in the world. Sins are passions because they make us passive. And when we yield to them and allow them to take control of us, that is transformative to us in the direction of the demonic. And we give the demonic a place in our lives. Therefore, on the flip side, this is why we're at least summarily bringing it up again here on the flip side, that means that forgiveness represents being set free from that, being healed from that, saved from regaining freedom to allow for self mastery and self control in the future."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3681.44,"end":3692.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Saved from and saved for both at the same time. Yep. Yep. All right, we're going to take a short break and we'll be back with the second half of the Lord of Spirits."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3693.84,"end":3711.63,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3717.31,"end":3719.87,"speaker":"Fr Stephen De Young","text":"If you enjoy listening to Ancient Faith."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3719.87,"end":3723.23,"speaker":"Fr Andrew Stephen Damick","text":"Radio podcasts, consider making them accessible to."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3723.23,"end":3724.71,"speaker":"Fr Stephen De Young","text":"The members of our community who are."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3724.71,"end":3727.83,"speaker":"Announcer","text":"Hearing impaired by commissioning the transcription of."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3727.83,"end":3735.24,"speaker":"Fr Andrew Stephen Damick","text":"A podcast episode for only $0.75 per audio minute, most podcasts can be transcribed."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3735.72,"end":3747.2,"speaker":"Fr Stephen De Young","text":"And thereby made accessible to those who cannot hear the podcasts. Visit ancientfaith.com transcripts to learn how you can sponsor a transcript and enable our."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3747.2,"end":3749.32,"speaker":"Announcer","text":"Brothers and sisters who are hearing impaired."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3749.4,"end":3757.9,"speaker":"Fr Stephen De Young","text":"To read podcast transcriptions again. That's ancientfaith.com SLtranscripts. Thank you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3757.98,"end":3774.06,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Dick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3780.94,"end":3808.54,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for that voice of Steve. This is the second half of the Lord of Spirits, our episode on confession. We're not taking calls unless somehow you know that we're recording right now. We'll wait for you. Okay. You didn't call. This is a pre recorded show. Father Stephen and I am both in Texas on undisclosed official business. But welcome back. So we just talked."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3808.54,"end":3813.54,"speaker":"Fr Stephen De Young","text":"It does not involve smuggling barbecue sauce across the border."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3813.7,"end":3824.38,"speaker":"Fr Andrew Stephen Damick","text":"No. Because, I mean, I spent a significant amount of my life in North Carolina and there's not such a thing as barbecue sauce, at least in Eastern Carolina."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3824.38,"end":3826.98,"speaker":"Fr Stephen De Young","text":"Barbecue there is in Texas."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3827.22,"end":3837.53,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. And honestly, I have said this many times, but it's true. I have room in my stomach for all of God's barbecues. But there is a hierarchy. There is a hierarchy."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3840.49,"end":3869.78,"speaker":"Fr Stephen De Young","text":"Yeah. I should say the greatest culinary achievement of my time in Texas was when I was at the prison. And I'll just leave it at that. Let people who don't know speculate. Folks used to when they're making a big pot of chili, spray pepper spray into it for seasoning. Are you serious? I am dead serious."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3872.26,"end":3874.26,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that's kind of horrifying."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3875.7,"end":3891.24,"speaker":"Fr Stephen De Young","text":"Pepper spray is just concentrated capsicum. Is it the same stuff that's in hot sauce? It's just super concentrated still. I mean, see, you hit a big pot with just a little, you know, stir it Up. Good chili, Rock your socks."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3892.92,"end":3903.64,"speaker":"Fr Andrew Stephen Damick","text":"It's not food grade. Wow. I'm glad you're able to confess that sin right here on this episode of Lore Spirits."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3904.92,"end":3910.04,"speaker":"Fr Stephen De Young","text":"I don't know that that was a sin. Texans don't think it was."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3910.52,"end":3911.08,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3911.72,"end":3916.45,"speaker":"Fr Stephen De Young","text":"That and having jalapenos and cornbread, that was a genius plan somebody came up with, too."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3916.45,"end":3947.68,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah. I mean, that's. Yeah, yeah, I'm on board with that. Okay. So in our first half, we basically established and talked about that God can indeed and does forgive sins. We kind of started moving a little bit towards how that works. And now in this half, we're going to talk about how God forgives sins. So let's start with the Old Testament. Right. That's always a good place to start."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3949.68,"end":3958.4,"speaker":"Fr Stephen De Young","text":"Eventually, this evening we will actually get to confession. Right. Promise. As is our want. That will be very late in the episode."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3958.4,"end":3975.61,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, even though our episodes do tend to be of leisurely length, you know, the truth is that almost all of the Christian practices that we talk about are built on thought. Thousands of years. Thousands of years. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3976.17,"end":3979.13,"speaker":"Fr Stephen De Young","text":"So really, our episodes are very short, lightning fast."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3979.13,"end":3980.57,"speaker":"Fr Andrew Stephen Damick","text":"Little quick summaries."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3981.21,"end":3985.85,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. In the great cosmic scheme of things. And eye blink."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3985.93,"end":3989.29,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. So."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":3992.25,"end":4104.5,"speaker":"Fr Stephen De Young","text":"And this is another one we're not going to super belabor, but we're going to hopefully remind folks about mostly. And that is that through obviously in the Old Testament, at least once you get to the patriarchal period, so at least for the vast majority of the Old Testament, and I would say pretty much the whole thing, that forgiveness primarily comes through sacrificial ritual. That is the primary sort of way that God works forgiveness in. In people's lives. And so the part that we're going to kind of review and not belabor because we did three episodes on this, is the. That sacrifices come in the context of hospitality. Hospitality's sort of central form. The main form of hospitality is the sharing of a meal. Right. And so sacrifices are such meals, and those meals are celebrations and actualizations of restored or deepened communion and relationship. Right. Between peoples. So, right. If I invite you over to sit down for a meal, it might be we're reconciling. It might just be we're already good friends and we're going to become closer friends. Right. By sharing some more time together. The important part for us here tonight with our topic tonight to reiterate, is that the meal part, Right. Of the sacrifice. Right. That's after the fact of forgiveness."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4104.9,"end":4114.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not that. If you Give God this. You know, if you say, okay, God, we're gonna have a meal, I hope you're gonna come and forgive me. That's not what's going on."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4115.7,"end":4121.46,"speaker":"Fr Stephen De Young","text":"Right. And it's also not. There's a difference between a ritual sacrifice and ritual magic."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4122.18,"end":4131.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because ritual magic is, you know, if I do this, then I will get this result. If I do this, then God must respond in the following way."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4132.71,"end":4161.44,"speaker":"Fr Stephen De Young","text":"Right, right. And even among pagans, by the way, there was a distinction between ritual sacrifice and ritual magic in that the pagans understood that with a regular sacrifice, the God could tell you to buzz off whatever they were sacrificing to, still had free agency, whereas with magic, they did. But God had to reiterate this, and he reiterates it over and over again in the Hebrew Bible in the Old Testament, that this doesn't work by magic."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4161.6,"end":4162.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4162.24,"end":4170.12,"speaker":"Fr Stephen De Young","text":"Right. That if the sacrifice isn't following on repentance, then it doesn't do anything."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4170.12,"end":4178.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's all these places where God says, your sacrifices are not acceptable to me and it's because you're unrepentant."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4179.28,"end":4183.34,"speaker":"Fr Stephen De Young","text":"Right, right. He literally gets to the point where he says, through the prophets, just stop."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4184.06,"end":4184.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4185.26,"end":4199.06,"speaker":"Fr Stephen De Young","text":"Stop offering sacrifices. Right. Because this whole I'm going to live however I want to live, and then, you know, go and offer sacrifices so that I'm good, like in the clear."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4199.06,"end":4199.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4199.34,"end":4203.34,"speaker":"Fr Stephen De Young","text":"Sort of that mobster religion kind of thing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4204.06,"end":4207.18,"speaker":"Fr Andrew Stephen Damick","text":"Like, you know, were guild. It's Were guild."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4207.82,"end":4219.24,"speaker":"Fr Stephen De Young","text":"Yeah. You're going out. You're, you know, you're going out as a mobster and you're, you know, having people whacked and. And engaging in all kinds of graft and corruption and everything. But then you go to church on Sunday."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4221.08,"end":4222.36,"speaker":"Fr Andrew Stephen Damick","text":"Pay off the government officials."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4223.48,"end":4250.91,"speaker":"Fr Stephen De Young","text":"Yeah. And it's sort of okay then. Right. That dog don't hunt. Right, Right. And a place where you really see this after the fact. Nature is when Christ says, if you're bringing your gift to the altar and you realize that someone has something against you, leave it. Go be reconciled with your brother and then come back and then come and make your offering."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4250.91,"end":4271.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and this makes sense just on a kind of a human. A human relational level, too. Right. Like, if you are going to share a meal with somebody that you are, you know, in an antagonism with, you need to make that antagonism right before the other person's even going to be willing to go to lunch with you, you know? Yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4271.6,"end":4294.08,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So the. The. Yeah. So this isn't this is an after the fact. And by the way, Christ talking about bringing gifts to an altar kind of implies that someone reading that text would have an altar they were bringing gifts to."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4294.16,"end":4296.64,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, sacrifices in the New Testament."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4298.48,"end":4400.84,"speaker":"Fr Stephen De Young","text":"So. Right. But so it's. It's afterward. Right. And so in the case of the within the Torah, the within the functioning of. Of the Torah, the fact of after the fact. Right. Of what you were doing was generally restitution. Right. Most sins involved some kind of restitution. Right. I killed your goat. I'm going to give you a goat. Right. I, you know, did this damage, amount of damage to you. I give you the money I stole from you, I give it back plus. Right. Four times more. Right. So there's this restitution that's made, and then after the restitution is made, then the meal, then the sacrifice. Right. Then the ritual that sort of seals it. But this means that sin is being treated not as an individual, personal, private matter. Hmm. Right. The problem is not between you and God only. Right. And I know there's someone out there. As soon as I said that, they were already typing a social media post somewhere to say, well, wait a minute. In Psalm 51 or 50 of the Greek, David says, against you and you only have I sinned."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4402.21,"end":4402.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4403.33,"end":4412.05,"speaker":"Fr Stephen De Young","text":"There's somebody doing that right now. Stop typing. Think for a second. Is a literal interpretation of that true?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4412.69,"end":4415.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there are other hurt parties involved."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4415.49,"end":4417.01,"speaker":"Fr Stephen De Young","text":"He didn't sin against Uriah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4417.41,"end":4417.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4418.61,"end":4420.45,"speaker":"Fr Stephen De Young","text":"He didn't sin against Bathsheba."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4420.69,"end":4421.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4423.81,"end":4429.81,"speaker":"Fr Stephen De Young","text":"He's not denying that in his great psalm of repentance, David is not denying that he hurt anyone else."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4429.81,"end":4434.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a kind of emphatic. I mean, only gets used. The scripture is kind of emphatic."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4435.23,"end":4445.31,"speaker":"Fr Stephen De Young","text":"Yes, yes. This is a poetic description. So stop typing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4446.11,"end":4447.15,"speaker":"Fr Andrew Stephen Damick","text":"Don't add us, bro."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4447.87,"end":4498.13,"speaker":"Fr Stephen De Young","text":"Yeah. The point is, that's true, because sin always involves hurting others. Even if you sin completely by yourself. Right. You hurt others in ways that you may not immediately realize. Okay. If you are a married person or a person in a relationship, just to give an example, and you secretly watch pornography, your spouse or the other person may never find out about it, may never know. Right. But the damage that sin has done to you will affect your relationship with that other person."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4499.49,"end":4500.05,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4500.37,"end":4502.21,"speaker":"Fr Stephen De Young","text":"Because it changes and therefore it will affect them."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4502.21,"end":4503.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It changes who you are."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4504.45,"end":4504.93,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4505.17,"end":4505.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4506.05,"end":4528.57,"speaker":"Fr Stephen De Young","text":"So there are always consequences and ripple effects. No man is an island. Right. And so there's always restitution in the sense of repair and healing. That has to happen beyond just you, yourself in order to make things right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4529.45,"end":4529.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4531.13,"end":4573.71,"speaker":"Fr Stephen De Young","text":"And repairing that damage within yourself and with other people. Right. Is what needs to happen for the forgiveness to happen. That's going to be celebrated in the sacrifice. Another example, and I know I overuse this example, right. But is if, again, if you're a married person and you go and commit adultery, you cheat on your spouse, right. You can't just say, come home and say, well, you know what? I've medeneia. Right. The word for repentance in Greek means to think again. And I've rethought, honey, and what I did was wrong and I will never do it again. So just go ahead and forgive me."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4576.51,"end":4578.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, try that. No, don't try that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4578.43,"end":4590.23,"speaker":"Fr Stephen De Young","text":"Don't try that. That's not going to work. And neither is, by the way. Well, I confess to God that I committed adultery and he's forgiven me. So now you forgive me too, honey. Right? Yeah, that's not gonna work."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4590.31,"end":4604.79,"speaker":"Fr Andrew Stephen Damick","text":"Well. Or, you know, as. As Ulysses Everett McGill says in O Brother, where art Thou? You know, it might put you square with the Lord, but the state of Mississippi can be a little more hard nosed. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4606.31,"end":4619.34,"speaker":"Fr Stephen De Young","text":"So. Right. So this is. This is a reality, right. Of. Of restitution, repairing the damage done. Right? And we see a positive example of this really clearly in the story of Zacchaeus."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4619.82,"end":4620.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4621.26,"end":4701.13,"speaker":"Fr Stephen De Young","text":"So Zacchaeus is a tax collector, right? Nobody likes the irs, but tax collectors were way worse. So he's a Roman collaborator, siding with them against his own people, helping them oppress him. He's extorting money from people, robbing them, quite literally. Right. That's how he makes a living, a very good one. Right. So Christ goes to eat with him. And Christ is going to end up saying, today salvation has come to this household. Right. But he doesn't do that when he walks in the door. He could have, Right, because he's Christ. Right. He is salvation. Right. He could have said that when he walked to the door of Zacchaeus house, but he doesn't. And this story shows us something for that reason. Right? He says that after Zacchaeus has stood up publicly in front of the other people there, in front of the community who he's been sinning against. He says, half of what I have, I'm going to give to the poor, and everything I stole, I'm going to pay back five times. And it's after he says that publicly to the community that Christ says, today salvation has come to this house because this too is a child."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4701.13,"end":4703.81,"speaker":"Fr Andrew Stephen Damick","text":"Of Abraham, because a change has been made."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4704.61,"end":4751.41,"speaker":"Fr Stephen De Young","text":"Right now. He is a child of Abraham. Now salvation has come because of that restitution. And then another sort of note in terms of how this works in sacrificial offerings is because we made the point that forgiveness is about purification. Right. And you could see this element of purification distinguishable from the element of the sacrificial meal in that purification takes place through what you might call the byproducts of a sacrificial offering."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4752.37,"end":4753.41,"speaker":"Fr Andrew Stephen Damick","text":"So given off."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4754.87,"end":4761.55,"speaker":"Fr Stephen De Young","text":"Right. Exuded. So if you're offering incense. Right. That's smoke."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4761.55,"end":4762.95,"speaker":"Fr Andrew Stephen Damick","text":"Smoke, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4762.95,"end":4809.9,"speaker":"Fr Stephen De Young","text":"Right. It's the smoke that has this purificatory quality, as we've talked about before on the show with an animal sacrifice. It's blood. Right. It's the blood of the animal which expressly is not eaten. Right, right. It's separated from the meal. Right. But that blood has that purificatory quality that is on the day of atonement. Right. And the fact that that particular animal or that particular incense has been offered sacrificially is what makes that byproduct, the blood of the smoke, sacred and gives holy. And gives it this purificatory effect."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4810.3,"end":4810.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4810.66,"end":4812.78,"speaker":"Fr Stephen De Young","text":"It's not that tied into the offering."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4812.94,"end":4834.38,"speaker":"Fr Andrew Stephen Damick","text":"It's not that the thing itself like that, that blood is purifying or that smoke is purifying. It's that in the context of it being offered as a sacrifice, it has that effect. You know, it's not a medicine, so to speak, in the sense of like, just swallow this pill and it'll all be good. Like it's within the relationship with God."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4835.38,"end":4860.82,"speaker":"Fr Stephen De Young","text":"Right, right. And this is touching upon some of the things we said in our episode on the Eucharist. Right. This is why we have body and blood. Right. Body participating in the sacrifice, blood purification of the person from Sid. So now we're going to talk to the Rock."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4862.13,"end":4865.33,"speaker":"Fr Andrew Stephen Damick","text":"So, Dwayne Johnson, if you're listening, please call in."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4865.57,"end":4872.21,"speaker":"Fr Stephen De Young","text":"Yes, Rock, the Dwayne Johnson. If you feel twitching and raising of the eyebrow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4872.37,"end":4889.92,"speaker":"Fr Andrew Stephen Damick","text":"I don't remember if we've ever talked about him on this show before, but I do have to point out a little sort of local pride is that he went to high school in nearby Bethlehem, Pennsylvania. So we claim him as a Lehigh Valleyite. I don't know that that's the right word. I don't know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4889.92,"end":4893.64,"speaker":"Fr Stephen De Young","text":"Allentown was a wrestling hub back in the day."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4893.64,"end":4894.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's amazing."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4894.84,"end":4895.96,"speaker":"Fr Stephen De Young","text":"In the territory system."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4896.28,"end":4905.48,"speaker":"Fr Andrew Stephen Damick","text":"It's amazing. Yep, yep. So, Dwayne Call in. All right. Well, we just edited out the 20 minutes that we waited for him to call."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4905.88,"end":4909.08,"speaker":"Fr Stephen De Young","text":"He never called, so shockingly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4909.08,"end":4909.64,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4910.04,"end":4913.72,"speaker":"Fr Stephen De Young","text":"I thought his rock sense would tingle, disappointingly. Eyebrow would rise."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4914.85,"end":4915.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4915.49,"end":4917.25,"speaker":"Fr Stephen De Young","text":"And you would pick up a phone and call us."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4919.17,"end":4921.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So we're gonna have to talk about some of the."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4921.01,"end":4938.53,"speaker":"Fr Stephen De Young","text":"I even liked Black Adam. I mean, come on, man. Anyway, not the actual rock we were talking about. Go figure. So we are talking about Moses and the rock."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4939.98,"end":4940.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4940.46,"end":4945.1,"speaker":"Fr Stephen De Young","text":"Which may or may not have been one rock, but we won't go down that rabbit trail now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4945.5,"end":4948.14,"speaker":"Fr Andrew Stephen Damick","text":"And may or may not have been the name of your first band."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4949.98,"end":4984.07,"speaker":"Fr Stephen De Young","text":"There are two instances. Everybody wants a rock to tie a piece of. Hey, there we go. So. And I am largely cribbing this understanding of these stories from a now departed man who is probably one of the people most responsible for me being here talking to you today."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4985.11,"end":4986.87,"speaker":"Fr Andrew Stephen Damick","text":"Say, wait, William Shatner isn't dead, is he?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4986.87,"end":4990.95,"speaker":"Fr Stephen De Young","text":"But whom I will not identify. He is not. He is 91 years young."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4990.95,"end":4992.7,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say it's not William Shatner. All right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":4996.61,"end":5010.05,"speaker":"Fr Stephen De Young","text":"So, no, this is more directly responsible than that. Yeah, but. So there is this first episode where Moses is going to bring water from the rock."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5010.37,"end":5010.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5011.25,"end":5155.34,"speaker":"Fr Stephen De Young","text":"Right. And so the details of this sometimes get lost in the. In the telling of the story, sort of the. The Sunday School version. I'm not going to ruin the Sunday School version of it, but I'm just going to add to it and nuance it a little bit. So I'm being nicer today. But. So people remember they don't have water. Right. They're in the. They're in the desert, they're in the wilderness. The people start grumbling again. And in their grumbling, they decide what they really ought to do is kill Moses and go back to Egypt, because they had it better there. And so in the midst of that, Moses and God are speaking to each other. And God says that the way he's going to handle this. And what happens is that we're told that Yahweh comes and stands on the rock. So this is another one of those episodes where God apparently has a body and stands somewhere. See previous episodes. And then Moses is told to strike the rock with his rod. And Moses rod, as we've talked about as recently as last episode, was this symbol of authority and of judgment. So the idea here in this image is that is an image of God voluntarily taking upon himself the hatred, the judgment, the slander directed against him by the people, and in return, giving them Water to drink, giving them life in return. Right. And this is taken to be in the New Testament, St. Paul being the most obvious place where he says the rock was Christ. You can't get more obvious than that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5156.58,"end":5157.06,"speaker":"Fr Andrew Stephen Damick","text":"To be."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5158.02,"end":5158.9,"speaker":"Fr Stephen De Young","text":"To be Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5159.54,"end":5159.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5159.9,"end":5164.82,"speaker":"Fr Stephen De Young","text":"Not just an image of Christ, but first of all, that that was Christ who was standing on the rock."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5164.98,"end":5165.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5167.22,"end":5281.63,"speaker":"Fr Stephen De Young","text":"But that this image of Christ taking upon himself the scorn, the hatred. Right. The judgment of the people. Right. And one of the things that often gets less left out is there's so much. And I understand why there is, because of the way in which texts have been weaponized against people, especially in Western Europe, but not only in Western Europe over the centuries, but over who's responsible for Christ's death. Right. That we kind of lose out on the fact that the whole point of having both the Jewish leaders and Pilate there emphasized in the Gospels is that the Jews and the Gentiles, that it's everybody in agreement, but Christ takes all of that upon himself and gives life in return. But then there's this second episode at the other end of the wilderness journey. And we won't go down this rabbit hole. But St. Paul refers to a tradition in the passage we just quoted in 1 Corinthians, he says that not only was the rock Christ, but the rock followed them in the wilderness. So it's the Same rock for St. Paul and for a lot of other Jewish writers in that period. But there's this second episode with the rock and hi, Pete ends if you're listening. There's this second episode with the rock, and in this case where the people are grumbling again. God tells Moses to go and speak to the rock."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5281.63,"end":5286.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But he gets mad and he hits it instead."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5286.99,"end":5321.89,"speaker":"Fr Stephen De Young","text":"Right. He's mad at the people. He's kind of mad at God. And he strikes the rock again with his rod, meaning he in his anger joins the people in sort of casting this judgment at God. That's why this is such a serious sin on Moses part, that it would be that he would not be able to enter the promised land because of it, that he would not get to. Because of it. Right. It wasn't just I gave you instructions and you didn't follow the instructions. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5321.97,"end":5322.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5323.33,"end":5441.89,"speaker":"Fr Stephen De Young","text":"This is why it's treated so seriously. And the idea there, if we understand again the rock to be Christ, is that Christ suffered and died once. Now he offers forgiveness when we speak to him. And that, you know, this is part of that understanding that really gets fleshed out. For example, in Hebrews this shift from repeated sacrifice to participation in the one sacrifice of Christ and Christ, then his intercessions as high priest. Right. That this is one little piece in the background of that. But it's important to note as we get ready to move into the third half, where we will finally actually talk about confession. Right. That making restitution entailed confession. So it's not laid out like this person must go and admit what they did and then make restitution. It just talks about making restitution. But the confession part is implied. Right. Like someone has robbed you, I show up at your house, I give you five times what was stolen. You're going to kind of figure out I'm the guy who took it. Right, right. You're sort of admitting it by making restitution. Right. Like you can't really have one without the other. Right. And so the reason we want to reiterate that here as we go on is that confession that we're now going to move into talking about also entails restitution."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5442.77,"end":5444.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have to make things right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5445.49,"end":5488.41,"speaker":"Fr Stephen De Young","text":"Right. That again, like in that adultery example, just admitting what you did all by itself does not fix the situation. These two things always go together. Right. But what doesn't have to be, there is more suffering. Now, sin causes suffering. When you sin against someone, you probably are causing them to suffer. The consequences of that may cause you to suffer, but infliction of suffering, of more suffering beyond that does not make it better."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5488.97,"end":5514.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and there's no point in any of the commandments in the Old Testament, for instance, or anywhere in the New Testament where it says, you know, and correct me if I'm wrong with this, because I'm not super certain about what I'm about to say, but I mean, there's no point where it says, you know, and let him be flogged or let him be tortured. You know, there are things that require someone be removed from the community."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5515.91,"end":5516.31,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5516.31,"end":5517.03,"speaker":"Fr Andrew Stephen Damick","text":"Whether through."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5517.11,"end":5526.51,"speaker":"Fr Stephen De Young","text":"There's a practice that develops of lashes being given at synagogues. Right. But that's not prescribed in the Torah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5526.51,"end":5527.83,"speaker":"Fr Andrew Stephen Damick","text":"God doesn't say to do that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5528.71,"end":5566.91,"speaker":"Fr Stephen De Young","text":"Right. But yeah. And in part, this is getting back to where we were at the beginning of the first half in that there's no punishment required and that punishment at any rate, would not involve the inflicting of suffering. And so you never see animals that are going to be sacrificed, being tortured, being treated cruelly. That in itself would be a sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5567.79,"end":5568.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5568.91,"end":5619.35,"speaker":"Fr Stephen De Young","text":"Right. And so, like, the restitution we're talking about is not Whipping yourself. Right. Self flagellation. Right. It's not degrading yourself. Right. It's not inflicting harm on yourself. Right. It is about fixing the harm you've already done through sin. That's what restitution is. And so brief note to my fellow priests, we're going to talk more now. This is part of our segue. We're going to talk in the third half about confession as it's practiced in the Orthodox Church now. Well, from the New Testament until now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5622.39,"end":5622.79,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5628.31,"end":5658.76,"speaker":"Fr Stephen De Young","text":"My fellow priests don't make things into punishments through confession. Right. Here's what I mean by that. Sometimes, and this isn't always the priest's intent. Right. But sometimes people will read whatever they're told to do after confessing a sin as being a punishment anyway. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5658.76,"end":5662,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because I mean, this is just the way that our culture tends to think."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5662.96,"end":5689.2,"speaker":"Fr Stephen De Young","text":"Right? Yeah. And so if you go and sorry to our Roman Catholic friends, because I know this is super common, but if you, for example, say, well, go say so many prayers. Right. Because you did thing X. Well, number one, you've made prayer a punishment. I don't know that that's the message we want to send."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5689.28,"end":5690.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5691.04,"end":5722.21,"speaker":"Fr Stephen De Young","text":"And once they've said that many prayers, it's like, whoa, shoot. Good. Now I'm done with that whole praying thing. Won't have to do that again until I screw up. Right. Like, that's not good. Right. Or from my perspective, though, this may just be my personal perspective. Even worse, go and read so much of the Bible every day for a certain period of time because you did this thing and it's like, oh, great. Making reading the Bible a punishment. That's. Yeah, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5722.45,"end":5762.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's. Yeah. Or like, occasionally my kids will say something like, do I have to go to church? You know, particularly like, if they've just lost their minds, you know, and my wife will sometimes say, you know, bring them to vespers or whatever. And. And they're like, you know, I'm being punished by being sent to vespers. Like, no, that's not. You're not being punished. Like, I go to vespers and no one's punishing me. You know, I love it. But it's really like, look, no, you get to do this. And that's not ironic. That's not ironic. This is how we're supposed to be living. So let's move."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5762.89,"end":5764.01,"speaker":"Fr Stephen De Young","text":"This is going to help you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5764.01,"end":5776.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, let's move into where we're supposed to do better. Right? Yeah, exactly. So just a brotherly admonition, I think."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5776.65,"end":5779.13,"speaker":"Fr Stephen De Young","text":"And to everyone else, don't take things as punishments."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5779.13,"end":5823.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And I think mainly the main thing, I mean, you and I are both confessors. Yeah. I think the main thing especially is to I try to communicate to people like, look, this is to help. This is not to punish. This is not because you did something wrong and now you have to do this onerous thing like, no, this is and if it's too much, if it's too much for that person, then the question might be like, well, okay, what is going to bring them into the good habits? So, yeah, it's supposed to be healing and beneficial. Just like taking even, even taking medicine is not a punishment. It's for health. So, yeah. All right. We're going to take another short break and we'll be right back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5823.45,"end":5927.42,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-23723. That's 855-AF-RADIO. Hi, this is Father Evan Armitas Jesus last words to his disciples were, go and make disciples of all the nations. Unfortunately, many parishes are struggling to follow this commandment. In my new book, Reclaiming the Great Commission, I offer a rose to help us get back on track. Drawing from my 20 years of parish experience, holy scripture and insights from research and visits with churches across the United States, I discuss how you and your community can implement changes that will transform, revitalize and renew your parish. You'll learn how to diagnose and remove the barriers you face, deal with resistance to change, define what a healthy parish looks like, lead with purpose and create a parish health plan. Written for clergy, council members, ministry leaders, small groups and all committed parishioners, this book will help any church in its journey to reclaim the Great Commission. Reclaiming the Great Commission is now available in paperback, ebook and audiobook@store.ancient faith.com that's store.ancient faith.com we're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5935.58,"end":5946.1,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everyone. It's the third half of the Lord of Spirits and this is a pre recorded episode. So we're not taking any calls this time around. And we're talking about confession."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5946.82,"end":5952.58,"speaker":"Fr Stephen De Young","text":"So we just, you know, some people complain that the show has three halves."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5954.26,"end":5954.82,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5955.7,"end":5962.58,"speaker":"Fr Stephen De Young","text":"And I must point out, as Aristotle said, everything that comes in threes is perfect."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5965.3,"end":5974.06,"speaker":"Fr Andrew Stephen Damick","text":"I know. I mean, it's. I don't. We could call them 3/3, but no, I don't know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5974.38,"end":5974.9,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5974.9,"end":5975.58,"speaker":"Fr Andrew Stephen Damick","text":"It just wouldn't be."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5975.58,"end":5976.9,"speaker":"Fr Stephen De Young","text":"Because a half is more than a third."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5976.9,"end":5986.14,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Exactly. And I really feel like people are getting a show and a half, at least. And there was that one episode we did that had four halves. That was a double show."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5987.82,"end":5989.74,"speaker":"Fr Stephen De Young","text":"That is true. That did happen once."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5989.74,"end":5991.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5991.46,"end":5994.3,"speaker":"Fr Stephen De Young","text":"That's because we're Orthodox. So for every rule there's an exception."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5994.46,"end":5996.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":5996.3,"end":5998.8,"speaker":"Fr Stephen De Young","text":"There's a Sunday of the Cross, if you will."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6000.8,"end":6001.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6005.12,"end":6009.76,"speaker":"Fr Stephen De Young","text":"There are like five liturgy nerds who just got really excited about that reference."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6012.08,"end":6014.28,"speaker":"Fr Andrew Stephen Damick","text":"Wait, wait, I'm working this out. I'm working it out."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6014.28,"end":6014.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6017.44,"end":6058.09,"speaker":"Fr Andrew Stephen Damick","text":"We know who you are. We're happy for you. Yes. All right. So in the first half we talked about the fact that God can and does indeed does forgive us. And then the second half, he does a forgiveness. He does a forgiveness. He did a forgiveness. In the second half we talked about how that is enacted, especially in the Old Testament, but of course, edging on into the New Testament. But now we're going to go fully into the New Testament and speak about the way that forgiveness is given by God starting then and continuing on now in the Orthodox Church, even here in 2023. So."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6058.17,"end":6061.21,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And not only how, but through whom."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6061.37,"end":6068.49,"speaker":"Fr Andrew Stephen Damick","text":"Through whom, yes. This is where it gets uncomfortable for some people. Yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6068.81,"end":6071.05,"speaker":"Fr Stephen De Young","text":"And in part, the answer is through. Hum."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6072.81,"end":6074.49,"speaker":"Fr Andrew Stephen Damick","text":"Wow. You almost spoke Lithuanian."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6075.37,"end":6075.97,"speaker":"Fr Stephen De Young","text":"Oh, really?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6075.97,"end":6077.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6078.17,"end":6079.77,"speaker":"Fr Stephen De Young","text":"Does that count as speaking in tongues?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6080.25,"end":6086.97,"speaker":"Fr Andrew Stephen Damick","text":"Yums. Is. Is a plural second person plural accusative. Maybe. I don't know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6087.85,"end":6090.57,"speaker":"Fr Stephen De Young","text":"I could have been speaking Pennsylvanian and gone for Yuns."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6090.89,"end":6093.77,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's western Pennsylvania. Yuns Yins."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6093.77,"end":6095.05,"speaker":"Fr Stephen De Young","text":"Yeah, they don't count."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6095.77,"end":6098.49,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's the other Pennsylvania. What can I say?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6098.81,"end":6102.97,"speaker":"Fr Stephen De Young","text":"Is there like an east coast, west coast rap beef within the state of Pennsylvania?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6103.13,"end":6115.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, pretty much. Like out here you will hear some people, not everybody, but you hear some people actually say use. They did. That's the plural. Out here is use. Occasionally here use guys, but use."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6116.31,"end":6118.47,"speaker":"Fr Stephen De Young","text":"That's more Jersey. That's Jersey bleeding."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6118.47,"end":6143.51,"speaker":"Fr Andrew Stephen Damick","text":"Right? I know. I mean, I'm only 25 miles from New Jersey, so. But yeah, I mean, there's also. You would think also that there would be like a divide with the Eagles on this end and the Steelers on the other end, but it Actually is not so much East West. The Steelers seem to have actually most of the state, and then sort of the Southeast is the Eagles, roughly. But I think the line runs through the Lehigh Valley, so I don't know. But yes, a lot of that is."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6143.99,"end":6147.83,"speaker":"Fr Stephen De Young","text":"I think, related to the win loss records of the respective teams."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6148.15,"end":6149.87,"speaker":"Fr Andrew Stephen Damick","text":"It's probably true, to be fair."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6149.87,"end":6151.71,"speaker":"Fr Stephen De Young","text":"Sort of like the Mets and the Yankees. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6151.71,"end":6153.75,"speaker":"Fr Andrew Stephen Damick","text":"Like it's true. You know it's true."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6154.47,"end":6162.25,"speaker":"Fr Stephen De Young","text":"Yes. Well, as far as your east west feud goes, hit them up. So confession in the New Testament."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6162.88,"end":6163.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6165.68,"end":6219.89,"speaker":"Fr Stephen De Young","text":"And so the first place, as you read through the New Testament, that you get to one of the most important places where this is talked about is in Matthew, chapter 18. And this is the part that we're going to talk about is within a passage that's well known in a lot of circles in that it's the passage that sort of talks about what gets called church discipline. Right. That if there's someone who's sinning in the church. Right. This is the part that is more well known that you should first go to them individually, privately, then bring someone else to them, and then if you still can't work it out, that you bring it before the whole church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6219.97,"end":6220.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6221.57,"end":6231.65,"speaker":"Fr Stephen De Young","text":"That part people are very familiar with. But in the midst of that, there's a statement that kind of gets glossed over, but that is probably the most important part of it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6231.81,"end":6252.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So verse 18, and I'm going to go ahead and use Southern American plural rather than throw myself into the epic Pennsylvania feud of the second person plural. Truly, I say to y', all, whatever y' all bind on earth shall be bound in heaven. And whatever y' all loose on earth shall be loosed in heaven."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6253.58,"end":6256.98,"speaker":"Fr Stephen De Young","text":"Yes. And you used y' all there to point out that the you is plural plural."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6256.98,"end":6264.3,"speaker":"Fr Andrew Stephen Damick","text":"That's right. As opposed to all y', all, which is what I like to call the pervasive plural, meaning every single last one of you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6264.94,"end":6266.38,"speaker":"Fr Stephen De Young","text":"Yes, all y'. All."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6266.46,"end":6266.98,"speaker":"Fr Andrew Stephen Damick","text":"All y'."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6266.98,"end":6267.18,"speaker":"Fr Stephen De Young","text":"All."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6270.11,"end":6270.35,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6272.19,"end":6280.83,"speaker":"Fr Stephen De Young","text":"The idea here, right. Is that. And this is within that passage, whatever you as a group, the community, the church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6281.15,"end":6281.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6282.35,"end":6316.6,"speaker":"Fr Stephen De Young","text":"Ecclesia, the assembly. Right. Whatever you all bind on earth will be bound in heaven. Whatever you loose on earth shall be loosed in heaven. So this means that, right. There is obviously applied here that there is an agreement. Right. That there's a mutual agreement that is taking place and that this has the effect of the forgiveness or not of sin."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6317.48,"end":6384.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, the reason why I think this is uncomfortable for some Christians is That as Christ says here, whatever you. And he's talking to the apostles, whatever you bind on earth is going to be bound in heaven. Whatever you loose on earth will be loosed in heaven. In other words, that their action has a corresponding action in the kingdom of God. Right. And that they're connected and they're not. They're not separable. And I think the problem that some people would have with this is like, well, my forgiveness is not in the hands of some person, you know, not some human person, whatever. But I mean, you can't get around it. Jesus is actually saying this. And the way that some people try to get around it is they'll say, well, you know, that was for the apostles. And then kind of not after that. And. But then that sets up another set of questions like, well, why would Jesus give that to just them? And then it just stops when the last one dies? I don't know."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6385.92,"end":6389.6,"speaker":"Fr Stephen De Young","text":"Yeah. And why would, why would St. Matthew bother recording it then?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6389.68,"end":6390.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6390.88,"end":6426.93,"speaker":"Fr Stephen De Young","text":"Knowing full well going to mean anything to later generations at all. Right. But also you have the basic problem of the context this is talking about in the context of the church. Right. You're bringing this issue with this brother or sister in Christ before the whole church. And in fact, our German friends use the fact that this passage is talking about the church to say that Jesus couldn't have possibly said it because it's about the church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6426.93,"end":6432.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because their theology means that there's not a church at this point. And so therefore he couldn't be talking about the church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6432.97,"end":6443.05,"speaker":"Fr Stephen De Young","text":"But so it seems very clear to pretty much all readers who aren't trying to get around it that this is talking about how things are going to be done in the church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6443.85,"end":6444.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6444.81,"end":6456.97,"speaker":"Fr Stephen De Young","text":"Right. Now it's ridiculous that Jesus didn't say it because, you know, these are folks who want to say that Jesus is just a human, didn't know the future, could possibly have predicted that there would be a church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6456.97,"end":6457.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, there's."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6458.48,"end":6464.92,"speaker":"Fr Stephen De Young","text":"Yeah. And they're also ignoring the fact that ecclesia was used for the assembly of the Old Testament, the assembly of Israel."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6464.92,"end":6468.24,"speaker":"Fr Andrew Stephen Damick","text":"There is this Greek translation of the Old Testament that uses the word. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6468.56,"end":6514.74,"speaker":"Fr Stephen De Young","text":"So, you know, our 19th century German friends are wrong as usual. But the point just being, this is very clearly the text associated with the church. Right, right. And so what this means is that is not that right independent from God, some kind of church authority? Which isn't what's being talked about here. It's talking about the church as a whole or even the Church as a whole controls your eternal destiny. Right. That's not what it's talking about. That's taking it in the wrong direction. What it's saying is that as we were talking about last time in the episode about ordination, God works through people in the world."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6515.14,"end":6515.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6516.58,"end":6532.74,"speaker":"Fr Stephen De Young","text":"And God forgives people. It's God who's doing the forgiving, but he forgives people through the community of the church. That is where that forgiveness is received and experienced is within the community."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6533.78,"end":6538.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Can't get away from that communal aspect as a whole. It's not just me and Jesus."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6539.04,"end":6591.76,"speaker":"Fr Stephen De Young","text":"Right. As opposed to me off by myself. And whatever sins I may or may not have committed is nobody's business at the church. In fact, every time I go to the church, I'm going to dress as nicely as possible and pretend as hard as I can that I'm completely sinless. Right. Because otherwise they'll all judge me. We'll get back to that later. So it's in this communal context. Right. And so because forgiveness comes in that communal context of the community, confession takes place in that same community context. And so Martin Luther's favorite book of the Bible, The Epistle of St. James, talks about this."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6592.32,"end":6615.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. St. James writes this. Therefore confess your sins to one another and pray for one another that you may be healed. The prayer of a righteous person has great power as it is working. Again, that's the esv. So you might be used to the prayer of a righteous man availeth much, which is the way it is in."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6615.92,"end":6618.75,"speaker":"Fr Stephen De Young","text":"My head, or is powerful and effective."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6618.91,"end":6619.95,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6619.95,"end":6623.59,"speaker":"Fr Stephen De Young","text":"I think that's the niv, maybe never inspired version."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6623.59,"end":6624.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6626.99,"end":6638.91,"speaker":"Fr Stephen De Young","text":"Right. But so notice it's confess your sins to one another and pray for one another. That's given as a command. Why do you do that? So that in order that you may be healed."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6638.91,"end":6640.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's conditional."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6641.31,"end":6663.4,"speaker":"Fr Stephen De Young","text":"Yes. That is the means by which you will experience healing from your sins. Notice again, healing is what's being used, not juridical terminology. Healing is used, but the way that happens is through confessing your sins to one another within the Christian community."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6663.96,"end":6664.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6665.32,"end":6679.73,"speaker":"Fr Stephen De Young","text":"Right. And another example. There are a lot more, but another example that's good. In Acts 19, verse 18."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6680.13,"end":6692.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Also, many of those who are now believers came confessing and divulging their practices. That's a colorful way of putting it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6692.93,"end":6699.85,"speaker":"Fr Stephen De Young","text":"Yes. So in case there's any ambiguity about what confessing means, divulging their practices."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6700.09,"end":6701.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6702.33,"end":6716.33,"speaker":"Fr Stephen De Young","text":"Divulging like secrets. Like, this is the stuff I've been doing. Secretly, they're now making public and confessing. Right. And the reality is we're not running through every single passage. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6716.41,"end":6716.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6717.61,"end":6718.25,"speaker":"Fr Stephen De Young","text":"If you want to."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6718.25,"end":6723.77,"speaker":"Fr Andrew Stephen Damick","text":"I was going to just add, by the way, if you read the next couple of verses after that, like in case you wonder what those practices they're divulging are."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6724.24,"end":6725.36,"speaker":"Fr Stephen De Young","text":"It talks about magic."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6725.44,"end":6732.72,"speaker":"Fr Andrew Stephen Damick","text":"Magic and burning their magical books and all this kind of stuff. Like it's. They're confessing the occult in this particular case. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6733.44,"end":6749.2,"speaker":"Fr Stephen De Young","text":"They had some practices going on. Yeah. So. But we could keep going on with these examples. But. And you could do this study yourself. No one in the New Testament confesses their sins to God privately. There's not a single example."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6750.17,"end":6765.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So if you believe in sola scriptura, and especially if you're the kind that says that if it's not written in the scripture, you're not allowed to do it, then you have kind of an issue there."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6765.93,"end":6774.94,"speaker":"Fr Stephen De Young","text":"Right. Because the New Testament pattern, the biblical pattern is public confession within the church community. That's what we're to do."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6775.33,"end":6793.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. According to the Bible and the word itself, like the basic sense of the word, and I'm not just talking about etymology here, but although it does kind of work out that way, but the word itself means, you know, etymologiesis is to proclaim something out publicly. Yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6793.49,"end":6809.35,"speaker":"Fr Stephen De Young","text":"And if you do a. If you want to go the word study route and do it on that word in the New Testament, you will notice something, is that there's two ways that that word is used. One of them is confessing sin, the other one is confessing Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6810.71,"end":6811.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And you're not."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6811.91,"end":6813.99,"speaker":"Fr Stephen De Young","text":"We confess with our mouth that Jesus is Lord."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6814.15,"end":6818.55,"speaker":"Fr Andrew Stephen Damick","text":"Right. You know, just say, well, I privately, within my heart, confessed Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6819.19,"end":6825.83,"speaker":"Fr Stephen De Young","text":"Right. If he who confesses me before men. Yeah, right, right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6826.31,"end":6826.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6827.52,"end":6848.32,"speaker":"Fr Stephen De Young","text":"So in every case where it's talking about. In that usage of confessing Christ, it always means publicly, vocally. Right. And so to say. Oh, and then, as in the examples we gave in a whole bunch of cases, it clearly means that about confessing sins also publicly, verbally."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6850.4,"end":6850.76,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6850.76,"end":6868.81,"speaker":"Fr Stephen De Young","text":"Well, there's a few cases I can find here that are kind of ambiguous. So I'm just going to assume in those handful of ambiguous cases that it means something completely different than all the other usages. Right. And that here it means privately in my heart, at home, by myself. That's not a very good argument."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6868.81,"end":6882.45,"speaker":"Fr Andrew Stephen Damick","text":"And we should say that there's. We're not saying you should not confess your sins to God in your private prayers. We're not saying that, but that's secondary to this."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6882.45,"end":6884.21,"speaker":"Fr Stephen De Young","text":"I might be kind of saying, oh, really?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6884.21,"end":6889.34,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Well, I don't know. I mean, there are some of the prayers. I mean, you know, there are some of the prayers."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6889.34,"end":6891.5,"speaker":"Fr Stephen De Young","text":"Let me be an extremist. Yeah, let me be an extremist."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6891.5,"end":6893.62,"speaker":"Fr Andrew Stephen Damick","text":"You're such a rigorous Father, Stephen. I swear."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6893.78,"end":6896.02,"speaker":"Fr Stephen De Young","text":"Yes. Oh, no, I'm a radical."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6897.94,"end":6911.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But I think the main thing I would say is, I mean, there are, you know, like, for instance, daily prayers include prayers, you know, that are about confessing sins and so forth. So that's secondary. It's secondary."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6911.96,"end":6934.32,"speaker":"Fr Stephen De Young","text":"Right, right. And it's. They're mostly asking for healing. Right, right. But I. Well, let me put it this way. I don't know that that's actually confessing. I don't think that that's the verb we should use for it, because part of what's going on here is God already knows."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6934.64,"end":6935.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Of course."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6937.37,"end":6943.21,"speaker":"Fr Stephen De Young","text":"You're not giving him new information. And you already know because you did it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6943.29,"end":6949.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Hey, don't accuse me, man. I know what I did."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6949.81,"end":6950.41,"speaker":"Fr Stephen De Young","text":"It was you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6950.41,"end":6951.85,"speaker":"Fr Andrew Stephen Damick","text":"I know what I did, Jacques."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6952.09,"end":6977.98,"speaker":"Fr Stephen De Young","text":"Anyway, so whereas the practice of publicly and verbally saying out loud what it is that we did is a different thing and has a different function."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6978.54,"end":6979.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":6979.5,"end":7003.67,"speaker":"Fr Stephen De Young","text":"Right. Then I. Who already know. Thinking, I guess, to God who already knows. Right. That's not the same thing. That's a different thing. And that other thing may have value too. Right. So we won't get into that. Sure, that other thing has some value, but that's not confession in the same sense."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7003.75,"end":7004.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7005.19,"end":7041.11,"speaker":"Fr Stephen De Young","text":"Verbalizing. Right. Putting it out there in some kind of public, at least with someone else there. Right. Is a different thing. It's a different experience when you do it as someone who's done both. Right. It's. It's. And accomplishes different things. So, yeah, I wouldn't say that. I'm not saying the other thing has no value. I'm saying maybe the best thing to do is use a different verb for that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7041.19,"end":7041.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7043.11,"end":7050.07,"speaker":"Fr Stephen De Young","text":"Right. Talk about praying for forgiveness on one hand, and talking about confession on the other hand, is a public act."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7050.07,"end":7060.11,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. So, yeah, I mean, we say it's public, but the way that we actually practice it these days is not someone standing up in front of everybody and saying, okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7060.11,"end":7062.47,"speaker":"Fr Stephen De Young","text":"Although that's how it was done in the early Church, we must say."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7062.47,"end":7062.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7063.51,"end":7068.15,"speaker":"Fr Stephen De Young","text":"And that's what the New Testament reflects, is what was actually done for the first few centuries."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7068.15,"end":7084.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And honestly, I mean, I think even now, even though this is not sort of the normal that we do it. I'm not suggesting that parishes take up this practice, but there are some kinds of sins that someone needs to stand up and say to everybody, this is what I did. Like, there's some kind."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7084.41,"end":7085.17,"speaker":"Fr Stephen De Young","text":"Like Zacchaeus."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7085.73,"end":7087.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. You know that there's."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7087.77,"end":7089.41,"speaker":"Fr Stephen De Young","text":"Because he had sinned against all those people."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7090.21,"end":7104.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's interesting, you know, like, you know, at least in American society, that's kind of the one thing that public people almost never do. You know, like, they may say something like, I apologize if anyone was hurt."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7104.74,"end":7105.58,"speaker":"Fr Stephen De Young","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7105.58,"end":7106.74,"speaker":"Fr Andrew Stephen Damick","text":"That kind of nonsense."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7107.14,"end":7110.34,"speaker":"Fr Stephen De Young","text":"Yeah. They're professional apologizers. But it's not exactly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7110.42,"end":7110.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7110.9,"end":7120.1,"speaker":"Fr Stephen De Young","text":"Doesn't exactly ring true. Right, right. But so let me be a radical again. I think it would be great if we brought it back, but I don't think we ever will."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7121.46,"end":7123.06,"speaker":"Fr Andrew Stephen Damick","text":"No. I can't see that happening."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7123.78,"end":7155.17,"speaker":"Fr Stephen De Young","text":"Right. And one of the things that's cemented to me that we never will is I actually did an experiment once, and so if you were one of the people who ended up being part of my experience, meaning you live in Charleston, West Virginia, and you're listening to this, I apologize kind of. I mean, I don't totally regret doing it, but I'm sorry that you were part of the experiment. Experiment. If you were. And you're listening to this. Wow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7155.17,"end":7158.65,"speaker":"Fr Andrew Stephen Damick","text":"This is gonna be the part that's gonna be excerpted and will get go viral."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7159.37,"end":7175.61,"speaker":"Fr Stephen De Young","text":"I'm sure. There was. There was a point when I was at the cathedral in Charleston where I was gonna talk about confession. I'm like, need to encourage people go to confession. So I just gave my confession in a homily to the congregation."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7175.69,"end":7176.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7176.97,"end":7192.82,"speaker":"Fr Stephen De Young","text":"I just did it. And I felt a certain rush while doing it, but there were a lot of people looking at me awkwardly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7192.9,"end":7196.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I can imagine. I mean, I know many of those."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7196.38,"end":7199.62,"speaker":"Fr Stephen De Young","text":"People and shifting in their pews."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7199.7,"end":7200.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7200.26,"end":7213.31,"speaker":"Fr Stephen De Young","text":"I'll bet it's a church that has pews. Yeah. And so I. I can't honestly say I totally regret doing it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7213.47,"end":7215.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think you're gonna say, I feel."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7215.59,"end":7217.07,"speaker":"Fr Stephen De Young","text":"Bad for the people who I did it to."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7218.19,"end":7220.91,"speaker":"Fr Andrew Stephen Damick","text":"I thought you were gonna say you made other people do it. So this is not."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7220.99,"end":7246.52,"speaker":"Fr Stephen De Young","text":"No, no, no, no, no, no. Yeah, so that happened once. But. But. But the reason I think it would be wonderful if we got back to it is that one of the things I encounter in hearing people's confessions is that everyone who comes to me for confession thinks they're the most, like, hideous Malodorous pervert in the world."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7246.68,"end":7247.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7248.04,"end":7254.44,"speaker":"Fr Stephen De Young","text":"Right. And just they're wicked and evil and everyone else in the church is so holy and pure and wonderful."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7254.77,"end":7310.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, like them. And this kind of thing is just, it's exacerbated by, especially by the experience of social media that everyone has where it's like, well, there's this in many cases, a beautiful curated version of people that they put out. You know, my Instagram life and you know, everyone else's marriages, everyone else's child, rearing everyone else's careers, all this kind of. I've had people even say to me, you know, wow, you live such an amazing, great life. Whatever. I'm like, well, you know, you can ask my wife about the reality of the way that I, that I am. You know, I mean, but that's the reality of the way that these things work is whether it's social media or just behavior in public, you know, because we all behave publicly. It's all curated on some level. We're all, you know, holding back and putting out particular things."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7311.17,"end":7314.53,"speaker":"Fr Stephen De Young","text":"Yeah. And being well mannered and everything is not the problem."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7314.85,"end":7318.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's not bad to be polite. It's not."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7318.21,"end":7323.65,"speaker":"Fr Stephen De Young","text":"So I don't think we'll ever, like I said, I don't think we'll ever bring that practice back."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7323.73,"end":7324.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7325.81,"end":7344.98,"speaker":"Fr Stephen De Young","text":"But if all of us within the church community could be more open with each other about the realities of the things that we're struggling with, so that we would all realize, hey, wait, there's a bunch of other people here struggling with the same thing. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7344.98,"end":7345.58,"speaker":"Fr Andrew Stephen Damick","text":"We're doing this."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7345.58,"end":7346.7,"speaker":"Fr Stephen De Young","text":"So I'm not alone."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7347.02,"end":7349.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, and that's, and that's one."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7349.9,"end":7351.46,"speaker":"Fr Stephen De Young","text":"Of the great benefit to all of us."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7351.46,"end":7394.29,"speaker":"Fr Andrew Stephen Damick","text":"Like, like, you know, we, we, we, we like to make our, our Protestant friends feel uncomfortable. But I mean, one thing I will say, especially for certain sectors of, of evangelical Protestantism that have small groups who do this kind of thing with each other on some level. I mean, not that it's always healthy. Not that it's always healthy, but there are, I mean, I've been, you know, when I was evangelical now, wow, this is almost 30 years ago now. But I mean, when I was, I remember experiencing that where people would openly talk about their struggles with each other, which can feel super cringe for a lot of people and can be, you know, like it can be distorted and abused and all that kind of stuff. It can be, but."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7394.45,"end":7396.13,"speaker":"Fr Stephen De Young","text":"And sometimes that's even curated."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7396.29,"end":7397.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7397.65,"end":7398.53,"speaker":"Fr Stephen De Young","text":"Look for sympathy."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7398.69,"end":7408.13,"speaker":"Fr Andrew Stephen Damick","text":"But when it's done with actual real trust and love and friendship, it actually is pretty great. It actually is pretty great. Yeah, yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7410.05,"end":7468.48,"speaker":"Fr Stephen De Young","text":"But so, yeah, as you said, that's not the current practice. And there are all kinds of reasons for that. Right. Many of which are springing to people's minds if they're thinking about would they ever do that. So right now, the way it's done in the Orthodox Church is that you confess at the front of the church, but that only the priest is there present with you hearing it. Right. But the priest is there representing the whole community, representing the congregation. Right, right. And we talk. See our last episode about ordination. Right. And so that's. That's what the priest is doing there. And I try to emphasize to people, you're not really confessing to me as a individual person. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7468.48,"end":7501.97,"speaker":"Fr Andrew Stephen Damick","text":"And the way. I mean, not always, but the way that the sort of architecture of confession often is set up is you have a person facing maybe an icon of Christ or facing a cross or facing a gospel book, and the priest is beside them. I mean, there are cases in which confession is face to face, whatever. And that's nothing wrong, right? It's not wrong. But the architecture is often set up to kind of really reinforce this idea that you're confessing your sins to Christ. And the priest hears confessions. That's the verb. Hears confessions."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7502.53,"end":7548.78,"speaker":"Fr Stephen De Young","text":"And is there as a witness. Is there representing the congregation and praying with them as the congregation. Right. And then so within that context, in terms of the modern Orthodox practice, and why are we going into the modern Orthodox practice as much as we are? I think a lot of, if not all non Orthodox people probably have a lot of assumptions about how confession works, the contemporary Orthodox Church that are based on partially on how it's done in Roman Catholicism, probably mostly more on how it's done in movies and TV shows. Yeah, that's what I was gonna say."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7550.06,"end":7554.04,"speaker":"Fr Andrew Stephen Damick","text":"Probably mostly based on what people see in movies and stuff. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7555.88,"end":7577.64,"speaker":"Fr Stephen De Young","text":"Not even actually what happens in Roman Catholicism, but even if you are aware of how it actually functions in Roman Catholicism, it's different in the Orthodox Church in different ways. And so one of the things that functions very differently than most people probably think in the Orthodox Church is what gets called penance. Even in the Orthodox Church, it gets called penance. I don't think we should probably."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7577.64,"end":7580.93,"speaker":"Fr Andrew Stephen Damick","text":"Some people just like to throw out the Greek word epitimia and."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7580.93,"end":7581.21,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7581.21,"end":7582.73,"speaker":"Fr Andrew Stephen Damick","text":"Because no one knows what that means, so."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7582.97,"end":7683.64,"speaker":"Fr Stephen De Young","text":"Right. It doesn't have the freight. Right. That's because as we were Mentioning at the end of the second half. Right. Penance has this con, sort of this connotation of punishment or, you know, suffering or, you know, now some. Something you have to do. Right. Or you won't be forgiven and you'll go to hell or something. Right. And all those assumptions get shoved in there. Right. Whereas what actually happens in terms of orthodox confession is that you and your spiritual father, the person you're confessing to, have a conversation, long or short, about what it is you're struggling with. Right. And form kind of a treatment plan, to use the medical metaphor, or a game plan of how to be more successful in that struggle in the future and continue to work on it and try and replace bad habits that are causing you to fall into sin with good habits that will help you and give guidance. In terms of that restitution stuff we were talking about. Right. When people have been hurt, what do you need to do to try and make this right? So that's what quote unquote penance is in terms of the orthodox practice. It's trying to get at that restitution piece. And sometimes that can be complicated. In real life situations there could be a lot of different people involved in different ways. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7684.92,"end":7701.65,"speaker":"Fr Andrew Stephen Damick","text":"And a lot of the kind of conversation that happens within confession is about trying to help the other person think about their life in a different way so that they can interpret it in a way that's going to enable that repentance."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7710.53,"end":7727.79,"speaker":"Fr Stephen De Young","text":"That's kind of talking about loosing and God forgiving sins. But we got to go to the other side of that. The less, less nice part to talk about. And that is the binding on earth, binding in heaven part."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7727.87,"end":7728.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7728.83,"end":7731.07,"speaker":"Fr Stephen De Young","text":"Which basically is excommunication."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7731.07,"end":7735.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's a response to not repenting."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7735.95,"end":7736.35,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7736.83,"end":7737.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7737.95,"end":7742.91,"speaker":"Fr Stephen De Young","text":"Lack of repentance, a lack of willingness to make restitution and try to restore."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7743.31,"end":7756.09,"speaker":"Fr Andrew Stephen Damick","text":"And a lot of people, especially if they don't have any concept of, of, you know, how things work in the orthodox Church. Again from movies and TV depictions of Roman Catholicism and."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7756.09,"end":7757.21,"speaker":"Fr Stephen De Young","text":"Or Puritan settlers."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7757.21,"end":7765.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. You know, excommunication is often understood as we're throwing you out and we never want to see you again."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7765.65,"end":7768.33,"speaker":"Fr Stephen De Young","text":"Yes. And. Or we're going to burn you at the stake."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7768.33,"end":7776.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And literally neither. And they're, you know, excommunication in the orthodox context can mean a couple of different things and none of them is."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7776.07,"end":7780.83,"speaker":"Fr Stephen De Young","text":"That, you know, so there's, there's excommunication and there's excommunication."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7780.91,"end":7792.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's the sense of, okay, you're going to remain part of the church community, but you're going to refrain from communion for a while, you know, and it's for a while. It's not permanent. It's for a while."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7793.23,"end":7796.51,"speaker":"Fr Stephen De Young","text":"Right. Because again, leave your gift."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7797.07,"end":7798.39,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7798.39,"end":7807.63,"speaker":"Fr Stephen De Young","text":"And go and be reconciled. So the work of repentance and restoration has to happen before it's safe for you to. Again."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7808.43,"end":7824.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There has to be this purification on your way to have a meal with God. And the other sense, really, probably the better word is anathema, which sounds even worse. Like anathema."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7824.63,"end":7824.99,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7824.99,"end":7861.08,"speaker":"Fr Andrew Stephen Damick","text":"You know, but. But even so, like when. When solemn anathemas are laid down by ecumenical councils. Right. Or repeated in the Sonata Council of Orthodoxy. It's not accursed. Yeah. Cursed. Yeah. It's not pure rejection. It's not. It's about, okay, this person's unrepentant sin is so great that they have to be put outside the church community until they are repentant. See, it's still got that. Until it's not. We're sending you to hell. We can't do that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7863.96,"end":7866.52,"speaker":"Fr Stephen De Young","text":"Right. It has nothing to do with who goes to heaven. Who goes to hell."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7866.52,"end":7867.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7868.28,"end":7871.44,"speaker":"Fr Stephen De Young","text":"We get an athleticized person. We're hoping. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7871.44,"end":7871.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7871.84,"end":7896.53,"speaker":"Fr Stephen De Young","text":"Like when we get up. If you go to a church on the Sunday of Orthodoxy where they read the anathemas, I should say, when they say that the Arians are accursed. Right. If you are an Aryan. Right. There's a solution for that repent of Arianism. Now you're not an Aryan anymore and you're not accursed."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7896.53,"end":7902.97,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, most of those anathemas are leveled against those who teach or those who say xyz."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7902.97,"end":7905.81,"speaker":"Fr Stephen De Young","text":"Yeah. So stop teaching that and stop saying it. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7905.81,"end":7906.41,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7907.61,"end":7908.61,"speaker":"Fr Stephen De Young","text":"That's what it's aimed at."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7908.61,"end":7908.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7908.97,"end":7910.01,"speaker":"Fr Stephen De Young","text":"Try to get you to stop."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7910.97,"end":7923.76,"speaker":"Fr Andrew Stephen Damick","text":"And also, I should also point out it's not. To those who think. It's not leveled at opinions. They're directed at those who are actively doing something public. That's what's going on."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7923.76,"end":7934,"speaker":"Fr Stephen De Young","text":"Because this is. Okay, yeah. I've probably done this on the show before, but this is one of my hobby horses. The word heresy."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7934.72,"end":7935.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7936.88,"end":7939.44,"speaker":"Fr Stephen De Young","text":"Doesn't mean to choose. Stop with the etymologies."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7939.8,"end":7940,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":7940,"end":8008.96,"speaker":"Fr Stephen De Young","text":"The word heresy was used in the Greek at the time to refer to a sect. To be a heretic means to be a sectarian. It means to draw people off after yourself, to make your own little following. Right. To develop a cult of personality around yourself. That's why almost all heresies are named after a person. And so you don't become a heretic by being wrong. Arius was not a heretic because he was wrong. Arius is a heretic because he would not repent. Right. He would not accept it. When his bishop told him he was wrong, when other bishops told him he was wrong, when all the bishops of the church got together and told him he was wrong, he still refused to admit he was wrong and continued to teach the same things and try and convince other people that he was right. That's what makes you a heretic. Not just not getting something right. Because if that was the case, we'd be in a lot of trouble. Almost everybody, if you ask them to explain the Trinity, is a heretic."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8008.96,"end":8010.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8011.32,"end":8032.18,"speaker":"Fr Stephen De Young","text":"But most people are not going out and saying, no, my understanding of the Trinity is the correct one, and everyone who disagrees with me is a heretic. And you need to come and join my church that I'm starting for the real Trinitarians, that person is a heretic. Axe ground."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8033.46,"end":8035.06,"speaker":"Fr Andrew Stephen Damick","text":"It's a nice sharp axe now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8036.82,"end":8046.11,"speaker":"Fr Stephen De Young","text":"Right. So that's. But yeah, so that's. When we're anathematizing someone as a heretic, that's what doing we're talking about. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8046.11,"end":8046.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8047.47,"end":8080.52,"speaker":"Fr Stephen De Young","text":"So this isn't about proclaiming hatred for particular people or groups of people. It's the exact opposite. It's because we love them that we're calling on them to repent of their false beliefs and practices. Right. But the reason for why is this, this sort of removal from the community for lack of repentance. Right. Why. Why is this a thing? Right. Well, it's because sin is still a communal issue."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8081.08,"end":8081.64,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8081.72,"end":8084.52,"speaker":"Fr Stephen De Young","text":"Just like it was in the, in the Old Covenant."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8084.52,"end":8091.24,"speaker":"Fr Andrew Stephen Damick","text":"You're hurting other people when you sin. We, as we said earlier, and the."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8093.56,"end":8096,"speaker":"Fr Stephen De Young","text":"There are examples of this in the New Testament."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8096.23,"end":8096.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8096.55,"end":8139.31,"speaker":"Fr Stephen De Young","text":"First Corinthians 5 may be one of the most infamous ones. Right. Where St. Paul asked to write to the church in Corinth because there's a guy who's sleeping with. It's not clear, totally clear in the text whether this is his mother, his stepmother, his mother in law. It's bad either way. It's gross anyway. Yes, it is incest under Leviticus 18 in any case. Right. But St. Paul's writing to the whole church about it, not just sending him a letter and he's writing to the whole church about it because the whole church knows about it and isn't doing anything. Right?"}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8139.39,"end":8139.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8139.75,"end":8163.11,"speaker":"Fr Stephen De Young","text":"He's just sort of letting it happen. And he implies in the text that they kind of think they're being open minded and good at understanding by not doing anything about it. Like they think positively of themselves for not doing anything about it. Oh, how non judgmental we are rather than addressing it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8163.27,"end":8163.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8165.43,"end":8174.47,"speaker":"Fr Stephen De Young","text":"And why does St. Paul want it addressed? Because he hates that guy. Well, no, because that guy will never repent if someone doesn't confront him, clearly."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8177.12,"end":8177.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8177.52,"end":8220.97,"speaker":"Fr Stephen De Young","text":"So it's about the salvation of that man's soul. Jude 1, verse 12 talks about a certain group of people within that community who he calls sort of a stain on their love feasts. Right. When they get together to celebrate the Eucharist, having these people there is sort of tainting the whole thing. Right. Sort of wrecking the whole thing. And what St. Paul prescribes in First Corinthians 5, and he makes reference this again in First Timothy 1, verse 20, is that that person be handed over to Satan. That sounds really crazy, right? Like that sounds like he's saying, you know, send him to hell."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8221.13,"end":8221.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8221.85,"end":8226.73,"speaker":"Fr Stephen De Young","text":"Give him to the devil. Right. But keep reading."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8227.29,"end":8227.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8228.38,"end":8383.96,"speaker":"Fr Stephen De Young","text":"He's handed over to Satan for the destruction of the flesh and the salvation of his soul. Right. He's being put out of the community, back into the world. Right. That's under the influence of the power of the evil one. Right. But as we've talked about many times on this show, what are the demons out there for? Why does God let them stay out there to afflict the wicked and drive them to repentance. So the idea here is that this person is being put out, is being put out there into the world that's under the curse anathema. So that this ultimate step may finally, to use terminology, help them hit rock bottom, bring them to repentance finally. And there's even St. Paul is also picking up here on a Jewish understanding. It's kind of hard to explain. It's kind of an inverted kind of martyrdom where the person's death itself, Right. And everything related to it in a way may, may offer some kind of atonement for their sin. Yeah, like I said, it's. It's hard to, it's hard to totally explain. Right. Other than that obviously they're going to be enduring hardship and that kind of thing. And so there's a certain kind of, it's kind of a weird inverted aschesis or, or something that's part of what St. Paul is getting at with the death of the flesh or the death of the body there. But the core thing, even if you can't quite wrap your head around that, is that this is being done for the sake of that person's salvation. Even this ultimate act of throwing them out of the church. Right. Is for that purpose. But so one of the effects of this, though, this understanding of both forgiveness being brought about by the community and this understanding of binding and of excommunication, this is part and parcel of what the church does here in the New Testament. Right. And how forgiveness and excommunication work is that the church has to have definable borders."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8384.36,"end":8389.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can't put someone outside of the church if there is no outside."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8391.01,"end":8412.53,"speaker":"Fr Stephen De Young","text":"Right. If there's no border. Right. So the church has to have a border. There has to be church and not the church. Right. And there has to be Christian and not a Christian. There has to be. Right. There has to be a border so that there can be this kind of understanding of church discipline."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8413.09,"end":8456.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I would say it's worth pointing out that no one in the Scriptures or even in the early church says, you know, I made a decision to become a Christian, and so I became. And so I am one. Right. And indeed, you get, like, early church canons, for instance, talking about how to receive various kinds of heretics, whatever. There's this line that's very memorable to me, which is, you know, on the first day, we make them Christians. Becoming a Christian is something that happens to you. It's not something you sort of, you know, in my heart, I became a Christian, which is not a meaningless thing to say. I'm not saying saying that, but. But in terms of, like, your actual participation and membership in the church, it's something that the community does to you."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8457.43,"end":8457.91,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8458.15,"end":8458.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8459.91,"end":8477.67,"speaker":"Fr Stephen De Young","text":"So. And this may sound like I'm verging into picking on our somewhat beleaguered, after this episode, Protestant friends. But I want to make clear this isn't that because historically there is a Protestant ecclesiology."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8479.74,"end":8479.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8479.94,"end":8508.27,"speaker":"Fr Stephen De Young","text":"There is a Protestant sense of the church that includes a church that has borders, that includes concepts of church discipline. Right. And this is particularly, particularly if you read John Calvin. Right. This is, for him, one of the marks of the true church. What makes a local church part of the church for him is that there is church discipline."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8508.91,"end":8509.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8510.43,"end":8547.4,"speaker":"Fr Stephen De Young","text":"Specifically talking about this element of excommunication, less on the forgiveness part. I'll go too far into that. Luther's marks of the church are a little different. Luther also has a sacrament of absolution, so he kind of has a version of public confession. Sort of. And some Lutherans still do still consider that a third sacrament. Some don't, but. So they had this firm idea. And this is where the idea of denominations comes from."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8548.52,"end":8549.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8549.64,"end":8571.17,"speaker":"Fr Stephen De Young","text":"The idea was this is the Church of Christ, Denomine, whatever. The Church of Christ, which is called Lutheran, the Church of Christ, which is called Reformed. But from those traditional Protestant perspectives, coming out of the Reformation, there were groups that got together and called themselves churches, but weren't churches. They were false churches."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8573.33,"end":8573.97,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8574.37,"end":8592.32,"speaker":"Fr Stephen De Young","text":"There are three categories actually. True church, a false church, and a sect. Sect being what you definitely didn't want to be. Right. That would be the equivalent today for most. Like from an American evangelical perspective."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8593.12,"end":8593.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8595.36,"end":8602.28,"speaker":"Fr Stephen De Young","text":"This sect, the way talked about it, would probably. The way a lot of American evangelicals would look at, like Mormons or Jehovah's Witnesses."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8602.28,"end":8605.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They would probably use the word cult for that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8605.92,"end":8622.24,"speaker":"Fr Stephen De Young","text":"Right. They wouldn't use cult, they would say sect. Right. But so they. They had these categories, and those categories have kind of honestly fallen away, at least in American evangelical practice."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8623.76,"end":8624.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8624.4,"end":8692.81,"speaker":"Fr Stephen De Young","text":"And this is even true of a lot of people, at least publicly, I don't know. Privately, I don't know. Confess. I don't think any confessions have been changed. But publicly, we get a lot of folks, even from like, Calvinist or Lutheran churches who just. There's only an invisible church. It's just all the believers. There are no borders. Right. Et cetera, et cetera. And that creates a big problem from the perspective of traditional Protestantism. Right. So bluntly, if we went in the Tardis and we got John Calvin in Geneva and brought him to the United States and he saw how Calvinist churches function in the United States, he would not think they were churches. One reason would be the Eucharist, but that's a whole other issue for another time. But the biggest issue would be there's no church discipline. Because the way things are now in American evangelicalism is. There can't be."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8693.69,"end":8694.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, because."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8695.37,"end":8696.17,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8696.17,"end":8706.37,"speaker":"Fr Andrew Stephen Damick","text":"If you get thrown out of a particular local congregation and, you know, if you're still serious about being a Christian, you just go to some other one. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8706.37,"end":8706.97,"speaker":"Fr Stephen De Young","text":"Down the block."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8706.97,"end":8713.69,"speaker":"Fr Andrew Stephen Damick","text":"Down the block. And the people in congregation A would not say that person is no longer a Christian."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8715.13,"end":8732.01,"speaker":"Fr Stephen De Young","text":"Right, right. And they couldn't. And they couldn't even say he's not a member of the church because he's a member of a different church Right. Down the street that they also acknowledge is a true church. Right. So it can't functionally happen. And it rarely even Gets to that thrown out level."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8732.33,"end":8732.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8733.37,"end":8751.46,"speaker":"Fr Stephen De Young","text":"As soon as the pastor says something I don't like, I could just go to the next church down the block. And it never even gets to that. Yeah. So there is no like discipline and authority structure. At least for laity. There's a. There's more with clergy depending. Right. Some Protestant denominations."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8751.46,"end":8753.86,"speaker":"Fr Andrew Stephen Damick","text":"Because the skin in the game is different. Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8753.86,"end":8758.02,"speaker":"Fr Stephen De Young","text":"Yeah. But for a layperson, there's no church discipline. So John Calvin would say that's not the church."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8758.82,"end":8759.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8759.34,"end":8803.56,"speaker":"Fr Stephen De Young","text":"It doesn't have one of the marks of the true church. And so this is. And it's progressed so far in the United States that I've seen people complaining online see it as a critique of the Orthodox church or the Roman Catholic Church that we consider ourselves to be the church and that someone who's excommunicated is now not part of the church. And it's not just. I don't have to go way back in church history for John Calvin and Martin Luther, that wasn't a bug, it was a feature."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8804.36,"end":8804.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8805.4,"end":8861.57,"speaker":"Fr Stephen De Young","text":"Of the church. Right. And in case this still doesn't seem problematic to some of our listeners, let me tell you about. I won't, I won't give a lot of detail, but a leftist I know who's an atheist. Right. Who is one of the people who responded to. And I'm not going down this culture war road, don't worry. But was responding to the what is a woman? Question going around. It was basically presented to him, well, if you just say anyone who identifies as a woman is a woman, then that makes the term woman meaningless. It doesn't mean anything anymore. Right. And his response, his honest, straightforward response, now he's an atheist. But was no, being a woman is like being a Christian. Anyone who identifies as one is one."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8862.77,"end":8863.25,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8864.77,"end":8868.37,"speaker":"Fr Stephen De Young","text":"He said. But I wouldn't say that the term Christian is meaningless."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8870.21,"end":8870.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8870.93,"end":8883.9,"speaker":"Fr Stephen De Young","text":"Right. So I hope folks find that troubling. Right. That and I think frankly, we are at a point in American culture where the term Christian is meaningless. I'll be blunt."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8885.42,"end":8887.1,"speaker":"Fr Andrew Stephen Damick","text":"Doesn't mean we should stop using it. But."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8887.5,"end":8900.46,"speaker":"Fr Stephen De Young","text":"No, I'm not saying we should stop using it, but I'm saying it's because it doesn't mean anything anymore. Because precisely for that reason that just anyone who calls themselves one is one. And there's no way to say there's no border to it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8901.35,"end":8901.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8902.07,"end":8942.44,"speaker":"Fr Stephen De Young","text":"There's no way to say no, you're not Right. Right. There's no and. And there's no way to define it that would cover all Those people. So if I say, well, to be a Christian, you have to believe the contents of the Nicene Creed, you'd be amazed how many people in American evangelicalism that leaves out because they're social trinitarians or any number of other things. Right. Or if you want to say. Or if you go the other way and you just say, well, anyone who loves and tries to follow the teachings of Christ is a Christian. That includes a lot of Muslims and Jewish people and Buddhists."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8942.52,"end":8943.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8943.56,"end":8944.68,"speaker":"Fr Stephen De Young","text":"As Christians now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8945,"end":8945.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":8947.8,"end":9067.97,"speaker":"Fr Stephen De Young","text":"Right. Like Muslims believe in the virgin birth, they believe Jesus was a prophet. Right. But we wouldn't say they're Christians. Right. So, yeah, it's really problematic on the American scene. Right. And so in addition to calling people to kind of think about that, I want to say to our Protestant friends that when you hear Orthodox people refer to the Orthodox church as the Church or the true church or the visible church. Right. I think it would be helpful if instead of hearing us trying to say something negative about you, which we're not. We're not trying to say, you're going to hell. We're not saying you're not really a Christian. We're not saying any of that. You would see that statement in this light that the church as it is talked about in scripture has borders and rightly constituted, it has the ability to exercise church discipline. And so when we call ourselves the church or the true church, that's what we're trying to do. We're trying to reflect biblically, historically, traditionally, the church's understanding of itself. Not to say anything about you. Negative. That's what we're attempting to say. And As I said, 16th and 17th century Protestants would not have had problems with us using that language."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9068.13,"end":9070.57,"speaker":"Fr Andrew Stephen Damick","text":"No. I mean. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9070.57,"end":9071.97,"speaker":"Fr Stephen De Young","text":"They might have disagreed with us."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9071.97,"end":9073.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, even most 19th century."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9073.93,"end":9075.05,"speaker":"Fr Stephen De Young","text":"But there wasn't a problem with the language."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9075.05,"end":9077.01,"speaker":"Fr Andrew Stephen Damick","text":"Even most 19th century Protestants."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9077.25,"end":9077.73,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9077.73,"end":9093.16,"speaker":"Fr Andrew Stephen Damick","text":"You know, like it's really. You don't even have to go that far back to have this sense of that each person within his religious community believes that it's true and that all others are therefore at least somewhat false. Maybe. Totally."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9093.16,"end":9114.32,"speaker":"Fr Stephen De Young","text":"Yes. Yes. Yeah. Yeah. So that's my appeal there and something we need to think about because. And this isn't just our Protestant friends. Right. Because our Roman Catholic friends and all of us Orthodox folks, we live in American culture too."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9114.32,"end":9115.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're all affected by it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9116.33,"end":9129.69,"speaker":"Fr Stephen De Young","text":"Right. So we're all affected by this. And you know how even the term Christian now is used and heard in Britain, I guess It's a little different, I guess in Britain, Christian just means proper now."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9130.33,"end":9133.69,"speaker":"Fr Andrew Stephen Damick","text":"It can. Yeah. I think csos complains about that at some point."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9134.01,"end":9193.48,"speaker":"Fr Stephen De Young","text":"Yeah. Your Christian name is just your legal proper name, you know. So as a last note here, or a couple of notes, related notes here on this episode, there are a couple of things in the scriptures in the New Testament where we are told that certain things that we can do are means by which we receive forgiveness of sins from God. I phrase that the way I did on purpose. This is not what to do to earn forgiveness. This is not right. But these are things that we could do that will cause us to experience, Right. Forgiveness of our sins from God. One of those that I know we talked about our previous episode is first Peter 4, 8."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9194.05,"end":9201.09,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Which says, above all, keep loving one another earnestly, since love covers a multitude of sins."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9201.97,"end":9231.7,"speaker":"Fr Stephen De Young","text":"And so that covers language is atonement language. And we talked about it in that context. And St. Cyprian's on almsgiving, right, where he talks about how acts of love, right, are a means by which. Towards others are means by which we experience the forgiveness of. Of our own sins and our own failings. And then another one, though that's also important, comes once again from The Epistle of St. James."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9232.18,"end":9256.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is about, you know, if someone sees someone sinning and then goes and brings them back, right? So that's the immediate context. James 5, 20. Let him know that's the person who's doing the retrieving. Let him know that whoever brings back a sinner from his wandering will save his soul from death and will cover a multitude of sins. The implication being there, his own sins too."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9256.85,"end":9291.75,"speaker":"Fr Stephen De Young","text":"Right, Right. That when you go out and someone is sinning and you bring them back, right. You bring them back to Christ, you bring them back to repentance. Right. That person experiences salvation and you experience the forgiveness of your own sins and being a part of the forgiveness of God that's brought to this. This person whom you're helping notice also that will save his soul from death. This is another place where the verb save is used in the New Testament not directly referring to God or to Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9293.03,"end":9293.91,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9294.55,"end":9297.11,"speaker":"Fr Stephen De Young","text":"That's. You don't have to freak out about that."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9298.15,"end":9300.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Just do a word search. There's actually a bunch of places."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9301.02,"end":9306.86,"speaker":"Fr Stephen De Young","text":"Yes. Because we understand that. That salvation is ultimately coming from God, but that God works through people."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9308.62,"end":9310.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9311.26,"end":9331.87,"speaker":"Fr Stephen De Young","text":"So you can say, right. St. Paul can say, you know, that he's all men, all things to all men. So that by all Means he might save some. He doesn't mean he's saving them instead of Christ. Right. But he's saying, I do this so that I can be the instrument. Instrument through which Christ saves some of these people."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9334.83,"end":9861.99,"speaker":"Fr Andrew Stephen Damick","text":"So to wrap things up for this episode on confession, we ended up talking a lot about ecclesiology. That might be a little surprising. You know, you turned on the episode and you probably didn't think it would be about that. But I think that ecclesiology is really, really important for us to ponder, particularly at this moment in our cultural history. So what do I mean by that? Well, I think at least especially here in America and maybe in other places in the west, too. I can't speak to that quite as well. Maybe other places in the world, but especially here in our own country of America, people's isolation from each other has been increasing. And, you know, we can blame social media, we can blame the pandemic, we can blame a lot of things, but. But isolation, you know, things that you could track. So, for instance, people's participation in groups, right? Whether it's church or, you know, the Rotary Club or, you know, whatever it might be, right. People's participation in social activities has been going down for a long time, actually. A long time. I think it's decades now. It's been being tracked. So while we could try to put the blame on certain things, I think mainly we can just say that they haven't helped, they've made it worse. So we live in a time where isolation is increasing and a lot of people are suffering ill effects from that. Mental health effects, definitely spiritual effects, bodily health effects. There's a lot of suffering as a result of that. What exactly is ecclesiology within the frame of this problem? Ecclesiology is how we are the church. It's what it means for us to be the body of Christ. You know, we've talked about. Some of our earliest episodes are about God's body and how the church is Christ's body. That is, the church is the collection of his. His powers, his abilities, his works in this world that he works through the church. And ecclesiology, therefore, in many ways is the cure for this isolation and this degradation that many of us are experiencing. And confession in particular, as we saw especially here near the end of this episode, confession actually is a very ecclesiological experience. On the one hand, the negative side, there's a sense that you can. If you're unrepentant, you can find yourself outside the ecclesia, outside the church. And now it's for the purpose of repentance, right. It's not like, just get out, we don't want you here anymore. But it's also for the purpose of protecting those who can be potentially led astray at the same time. So there's both things going on with that, but also on the other side, confession is about healing. It's about that restitution, about making things right, about repenting of our sins. I mean, that's the program. That's the Christian life. And it happens in relationship within the body of Christ. There's a lot of people who are feeling very isolated, who certainly also do things like praying alone at home and reading their Bible alone at home. And those are good things to do. Right? But they cannot provide the ecclesiological dimension, the ecclesial dimension. They cannot provide churchliness because church is precisely a gathering. Church is precisely relationship. And as Father Steven said earlier, the experience of standing at home and saying to God, I did the following versus having that experience in the church and having a priest standing next to you, and you say, I did the following. Those are not the same experience. They're just not. The second one calls you out of yourself in a way that the first one simply doesn't. Right. And it's not that God is not enough. By no means would we ever say God is not enough. But we do know that God does work through his body, the church. We do know that God does work through other people. And while we might be scared of that. Right. I think, for instance, a lot of people have a kind of, I don't know, a knee jerk. Anti Roman Catholicism, I think, is what it comes down to, you know, because of this sort of scary idea of clergy that can stand between you and God. We're not teaching that. That clergy or whoever stands between you and God. There's nothing that can stand between you and God. But when we fixate on that, then what we're doing is we're saying, you know what? I don't need or want. I don't want other people in my Christian life. I don't want what God has himself has provided. I don't want the way that God is working through these other people. I just want my own isolated experience. When we do that, I mean, that's very, very destructive. And we're letting our phobias, we're letting our fear of abuse get in the way of using the good things that God has provided. God has provided confession. We read it right there in the Bible, like, we're not making this Up. It's right there in the scriptures. God has given it. And God has given forgiveness of sins through confessing to other people. Does that mean that if the other person says, well, I don't forgive you, then God says, well, I guess, you know, no, that's not what that means at all. But again, abuse does not prevent the true use, right? So this basic principle in Latin, abusis non tollit usum. I'm sure I'm mispronouncing that, but it is a basic principle that the abuse of something does not mean that the good use is no good. Right? We clean up abuses, but we don't throw out the baby with the bathwater. So it is a little scary. All relationship is scary. But there are experiences. There's goodness, there's wholeness, there's healing, as we see in Scripture, there's forgiveness that's received only within that context. Only within that context. And so let's step outside of ourselves and let's go to confession. Let's be a part of. Of the Body of Christ, and let's not excommunicate ourselves. Like, it sounds scary to be excommunicated, but if we're not participating in the body of Christ, we've excommunicated ourselves. We did it to ourselves. That's the worst, right? Let's step outside of that. Let's go show up. Let's go be the body of Christ together. And maybe if it's been a long time since you did it, or maybe you had a bad experience, it's going to be uncomfortable. Okay, I get that. I get that. But you don't let that rule. Don't let the wound become who you are, right? It's still the body of Christ. It's still the body of Christ. And that means we do this together. And that means that we have access to this beautiful, beautiful, holy mystery of confession, of absolution, of forgiveness of our sins. It's one of the most powerful experiences that Christians can have. And there's only one context in which it really comes to its fullness. So let's show up. Let's do the thing. Don't live in your head. Don't think that being a Christian is about stuff that you read or stuff that you think or having the right opinions. It's not. Those can be important. But being Christian is about participation in the Body of Christ, and confession is one of those key ways that we participate. Father Stephen."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":9867.28,"end":10201.91,"speaker":"Fr Stephen De Young","text":"So as we mentioned back when you were talking about the giving of the Torah originally, there are a lot of things that have been present in the world since sin entered the world. Things like pain, suffering, shame, humiliation, loneliness, emptiness, meaninglessness. These things have been out there. Violence. These are just facts of sinful human reality. Those aren't the things that God brings into the world when he draws near to humanity. Not at Mount Sinai and definitely not in Christ. That said, churches, and I'm using churches here with a small C and in the loosest possible way, Christian communities. So I'm including everybody, all our friends, and a lot of Orthodox parishes too, have typically not done a great job of manifesting that fact to people. So we tend to fall into one of two poles. People come into our church gatherings and all those things that they were already experiencing out there in the world, like shame, isolation, embarrassment, humiliation, just feel exacerbated to them. They walk in the door and they feel judged and condemned. Or on the other side, on the flip side of the coin, they come in and they feel welcome and fine in the gathering, but that gathering doesn't present them any hope, any means of change, any means of bettering their situation. And sort of everyone commiserating. Nobody expects any better out of anybody else. But also there's no drive to do any better. There's no cure for the meaninglessness. There's no cure for the shame. There's no cure for any of these things. And so the core of what we were talking about tonight, which is repentance and forgiveness, that's a new thing that has come into the world, and that should be the earmarks of the Christian community. This should be what sets us apart, frankly, from every other organization or anything else on earth, is that this is the place where people can come to hear the words of life. This is the place where people can come to find Christ. This is the place where they'll find a path of repentance that will lead to forgiveness, that will lead to healing and freedom and transformation of their life. So on one hand, anybody who wants to can walk in the door. And on the other hand, nobody is going to be just left the way they are when they first walk in the door, unless they choose to turn around and leave themselves. Both not judging and condemning and calling to repentance are possible at the same time. Both experiencing forgiveness and taking sin seriously are possible at the same time. Part of it that I think, particularly in some of our Orthodox parishes, we need to get more through our head is that joylessness is not a sign of holiness. St. Paul says the exact opposite. He says joy is one of the fruit of The Spirit. So if in your parish you're not experiencing joyfulness, the joy that comes from having your sins forgiven, the joy that comes from not having to be weighed down by guilt and shame anymore, the joy that comes from knowing Christ. If you don't have that, something is deeply wrong, it is deeply wrong. You can focus on repentance at the expense of forgiveness, where it's all about being morose and moribund, about how sinful we are. It's all about the way you feel walking into confession, and not about the way you walk feeling the way you feel walking out. You should leave confession feeling 50 pounds lighter. You should walk out with the knowledge that now you have been reconciled to God in Christ and that your process of reconciling with your brothers and sisters who are all supporting you in this."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10204.55,"end":10204.95,"speaker":"Fr Andrew Stephen Damick","text":"People."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10205.43,"end":10348.54,"speaker":"Fr Stephen De Young","text":"If the church is a hospital and not a courtroom, then we should all be happy that we're getting better and recovering and being healed. I don't think when Christ, as we read about in St. Matthew's Gospel, when he was out healing crowds of people, that the people who had been healed of ailments that they'd sometimes had for years were walking away with a grim look on their face, right? There was joy there. And so I think we need to kind of refocus. We need to refocus as people and thereby help refocus our communities on being communities that are about repentance and forgiveness. You don't know. I've had a lot of conversations recently in various contexts with people who aren't Christians, some of whom are atheists, and you do not know how much they long for, right? When I've told people who are atheists and know nothing about the Orthodox Church about forgiveness, vespers, where once a year we gather together and ask each other forgiveness for what we've done in the past year. How many of them tell me they long for something like that, to be able to have an opportunity to just be honest with their friends and family about how they've been and ask for their forgiveness and experience forgiveness. Because there's no forgiveness out there in the world now. No one gets forgiven for anything. You get canceled. It gets brought up for the rest of your life. Things will follow you for eternity. And we've got a generation and a half now who almost every moment of their life has been recorded on the Internet, which means forever. This is something only we have and only that we can only offer. It's a kind of freedom that only comes through the Holy Spirit and through knowing Christ. That's where our focus needs to be. And when we do that, that's when what we have to offer the world is not moral principles or theological principles, but the salvation that comes in Christ."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10351.66,"end":10375.11,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that is our show for today. Thank you very much everyone for listening. We weren't live this time, but God willing, we will be live next time and we'd like to hear from you. You can email us at Lord of spirits@ancientfaith.com you can message us at our Facebook page. Or you can also leave us a voicemail@speakpipe.com lordofspirits or you can send hate."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10375.11,"end":10386.47,"speaker":"Fr Stephen De Young","text":"Mail to fatherandrewdamioncientfaith.com and join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10387.19,"end":10399.84,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook like our page, join our discussion group. Leave reviews and ratings wherever it is you listen to this podcast. But most importantly, please share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10400.72,"end":10411.6,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air. I do have to say, Father Andrew, you act like you've got nothing to lose, but I've already lost my patience."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10412.64,"end":10416.17,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless. God bless you all."}
{"episode_id":"LOS - #059 - 2023-01-12 - Loosed in Heaven","start":10420.17,"end":10457.38,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
