{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":0.48,"end":65.12,"speaker":"Audience Member","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":67.12,"end":81.08,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers and dragon slayers. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung is with me on location from Franklin, Tennessee. That's right near Nashville and I'm a."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":81.08,"end":82.48,"speaker":"Fr Stephen De Young","text":"State in the land of the free."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":83.04,"end":83.68,"speaker":"Fr Andrew Stephen Damick","text":"Is it really?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":84.72,"end":85.76,"speaker":"Fr Stephen De Young","text":"That's what I'm told."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":86,"end":151.81,"speaker":"Fr Andrew Stephen Damick","text":"That's what they tell you. Yeah, yeah, yeah. So I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, the forests of Penn. And if you're listening to us live, you can call in at 8-55-AF-RADIO. That's 855-237-2346. Matuska Trudy is taking your calls tonight and this episode is all Q and A. So get calling right now. You don't have to wait. Get your place in line right now. But first, a word from our sponsor. Lord of Spirits is brought to you by our listeners with help from the Theoria School of Filmmaking. Theoria School of filmmaking is the first orthodox film school. The primary instructor is Jonathan Jackson, a faithful orthodox Christian speaker, writer and five time Emmy award winner. To learn more about theoria, please visit thoriafilm.org that's T H E O R I A film. So tonight, in addition to being an all Q and A episode, this is our special second anniversary episode. Happy anniversary to us. It's hard to believe we've been at this for two years to mark this occasion."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":152.13,"end":156.37,"speaker":"Fr Stephen De Young","text":"So technically, technically it's not an all Q and A episode."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":156.69,"end":157.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":157.73,"end":164.13,"speaker":"Fr Stephen De Young","text":"Because like what we're about to play is neither a Q nor an A. Technically, that is."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":164.13,"end":166.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well I don't know. It depends on."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":166.32,"end":167.32,"speaker":"Fr Stephen De Young","text":"It's not a live one."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":167.56,"end":185.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true. Yeah. So anyway, to mark this occasion, we're going to be playing three special clips of some of our favorite memories, and we'll be playing one in each of our three halves. So, Father Steven, while all those calls are queuing up, should we go ahead and play the first one?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":186.44,"end":203.09,"speaker":"Fr Stephen De Young","text":"We probably should. And, you know, we went back and forth on doing this because, I mean, it's only two years of shows. These are pretty memorable clips. I'm sure people have already heard these and re. Listened to them like a thousand times. Yeah, these are just some of our favorites."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":203.33,"end":211.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, right. I mean, it's just so hard to pick. Right. We just had to pick a few that were super memorable. The kind that are already on T shirts and stuff."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":211.77,"end":216.7,"speaker":"Fr Stephen De Young","text":"Yeah. It's like choosing between your children. And we all know all parents have a favorite kid. The."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":219.49,"end":223.17,"speaker":"Fr Andrew Stephen Damick","text":"I don't. I love all four of mine absolutely equally."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":224.37,"end":229.89,"speaker":"Fr Stephen De Young","text":"Lies. Anyway, all right, well, so here is."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":229.89,"end":250.75,"speaker":"Fr Andrew Stephen Damick","text":"Our first half memory clip that we're going to play for you. Okay. We're going to go ahead and take a call right now. And the call board says I have Jonathan calling from Montreal. So, Jonathan, welcome to the Lord of Spirits podcast. Are you there?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":252.03,"end":294.88,"speaker":"Audience Member","text":"Yes, hello, Father. This is actually John. I'm calling, not from Montreal, from Montreal in Sicily. So, yeah, it's a little further away, but yeah, so I really love the show, you know, first time I called. But I have a question. It's a question I'm asking for a friend. So it's really actually more of a speculative question. Okay, so let's say they say just. Just for. For theory's sake, like, let's say that you were in a situation where you had caught a leprechaun. Like, just. Just let's say for theory's sake, how do you think you would. You would go about getting him to give you the pot of gold? Because. Because the catch."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":295.68,"end":296.08,"speaker":"Fr Andrew Stephen Damick","text":"My."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":296.4,"end":306.03,"speaker":"Audience Member","text":"The. The idea would be that you think that. That catching him would be the hardest, but it seems like the Paragould question is harder. So I don't know if you have any advice on that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":306.19,"end":309.63,"speaker":"Fr Andrew Stephen Damick","text":"So you're asking, like, for a friend. This is for a friend."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":310.51,"end":313.31,"speaker":"Audience Member","text":"Well, it's like a theoretical question for a friend, really."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":314.75,"end":322.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so the first question I have in response to this is exactly how. How is this accomplished? I mean, I'm, you know."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":322.59,"end":331.49,"speaker":"Fr Stephen De Young","text":"Well, there's a lot of which. There's a lot of ways to catch a leprechaun Okay. I mean, you can use a standard. Yes, I bear trap, you know. You can?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":331.73,"end":332.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":334.21,"end":353.25,"speaker":"Audience Member","text":"I think what I hear that you're supposed to listen for the sound of like a metal hammer, like a tink, tink sound. Because supposedly the leprechauns, they make shoes for elves. So if you hear that in the forest, then you know that it's nearby and then it's just. I mean, then you just can wrestle it to the ground. I mean, the nails are sharp, though. It's not easy."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":353.33,"end":382.57,"speaker":"Fr Andrew Stephen Damick","text":"So you're saying that leprechauns basically function for elves the way that dwarves do for humans and giants and so forth? That there's sort of like something like that, kind of. Yeah, yeah. Okay. Well, I mean, here's the first tip that I would give you is number one, don't feed it and don't eat with it. Because if you listen to this podcast at all, you know that that's a huge, huge problem. So just don't do that right off. Right? That's. That's the first thing that I would suggest. And I don't know. Father Stephen, do you have any, anything more to say about that?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":382.89,"end":396.94,"speaker":"Fr Stephen De Young","text":"Well, it's, it's interesting because of course, you know, the leprechaun, right, is doing this work out of its love for the craft, right? Because it has the pot of gold, right? It's not really a working class creature, right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":397.82,"end":398.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":398.14,"end":406.54,"speaker":"Fr Stephen De Young","text":"Less out of its, its love for its, its, its craft and the craftsmanship, right? And so to me, that says."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":406.86,"end":407.18,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":407.18,"end":439.12,"speaker":"Fr Stephen De Young","text":"To me that says the pot of gold. I mean, it's somewhere, it's. It's safety, it's backup, right? So it's maybe not as precious to the leprechaun as it would be to an avaricious human. So I would think if you could present a good case to the leprechaun, right, you could explain sort of comparative economics between reason with it, between the feywild, right, the fairy folk and like."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":439.12,"end":444.3,"speaker":"Audience Member","text":"A good shoes, like Italian shoes. I mean, it's Sicily, right? So could get them good shoes, right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":444.3,"end":463.06,"speaker":"Fr Stephen De Young","text":"Like, and human economics, he would see that that pot of gold is going to be much more valuable to you than it is to him, right? And he could continue. Then you'll let him go, right? After you get the gold, he could go back to his craft, which he loves. You'll have the gold. It's a win. Win."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":463.62,"end":478.91,"speaker":"Audience Member","text":"Everybody wins. That's what I've been saying. But, but, yeah, but I think I will definitely take that advice and, and and we'll see. Yeah, I think the theoretical. Yeah, we'll see. So thank you. Thank you so much for your advice and for your wonderful podcast."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":479.15,"end":486.95,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for calling in and tell all your friends. All right, bye. Bye. All right. That really brought me back. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":486.95,"end":490.91,"speaker":"Fr Stephen De Young","text":"And then that question, of course, is what inspired our leprechaun episode?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":491.71,"end":493.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah, you told us."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":493.07,"end":494.11,"speaker":"Fr Stephen De Young","text":"It's a big off point."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":494.19,"end":503.33,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because there's just a huge amount to talk about there. I actually did a lot of research for that. My. My Celtic mythology books. So."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":503.33,"end":513.93,"speaker":"Fr Stephen De Young","text":"Yeah, I know. See, at first, you know, I suggested, hey, let's just do a whole leprechaun episode. And you were like, well, I saw Leprechaun in the Hood. And I'm like, that doesn't count."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":514.33,"end":514.73,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":514.89,"end":522.85,"speaker":"Fr Stephen De Young","text":"Right. That's not even the best leprechaun movie. That's not even the one with Jennifer Aniston in it. Like, why would you use that as your basis? And so."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":522.85,"end":542.03,"speaker":"Fr Andrew Stephen Damick","text":"But did you know that Jennifer Aniston was raised Orthodox? Just put. I did not. Oh, well, she is Greek anyway, so actually, I don't know that she was raised with, but she is Greek, so. All right, well, we're taking calls, so we're going to go ahead and just start knocking out some calls. So we have Jim calling from. At least his phone is from Florida. Jim, are you there?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":543.07,"end":545.35,"speaker":"Audience Member","text":"Ion fathers, please bless God."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":545.35,"end":550.43,"speaker":"Fr Andrew Stephen Damick","text":"Bless you. Welcome, Jim, to the Lord of Spirits all Q and A podcast. How are you this evening?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":551.15,"end":556.36,"speaker":"Audience Member","text":"I'm doing well. Thank you so much for this show. It has redeemed so much of the Bible for me."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":556.68,"end":558.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh, awesome. Awesome."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":558.84,"end":569.32,"speaker":"Audience Member","text":"And although I am from Florida, I don't have any crazy Florida man questions. This is going back kind of to the fall of Man, Part 3 episodes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":570.04,"end":570.6,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":571.56,"end":615.58,"speaker":"Audience Member","text":"Where you have. As creation was initially ordered, you had the angels who were charged with overseeing the different nations. And as the angels fell and men fell, that kind of. That had to adapt and change their scope of work had to adapt and change. And so nowadays we have the saints kind of doing that function because we have heavenly, heavenly patrons of different cities and countries. And so they're not really replacing the angels, but they're functioning in that original capacity that they were ordered to do in the heavenly kingdom, which I think is part of God's promise to Abraham. The descendants would be like these stars."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":616.06,"end":616.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":616.62,"end":659.28,"speaker":"Audience Member","text":"And that we would expect in glory. The saints will continue to perform more and more angel like functions. And I'm not suggesting that we turn into angels by nature, but that we're Becoming more like them. But my question is kind of going back to the fall, like you had the five falls of angels and the three falls of men. What is there in place or have any of the fathers addressed anything about the potential for angels to fall again or then for us to fall again?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":661.53,"end":675.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay, I think I get what you're asking, that are we going to see potentially more angels go bad than are currently bad? Right. And could we theoretically see a saint go bad? Is that what you're asking? Yes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":675.25,"end":675.93,"speaker":"Audience Member","text":"Yes, sir."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":676.33,"end":714.54,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay. I think that makes sense to me. I don't. And maybe Father Stephen, you remember, but I don't recall exactly who said this. I feel like Saint John of Damascus may have addressed it, but there is this idea that God is preventing any further falls from angels and human beings once they participate in that first resurrection. Right. So once they actually become fully saints, that they are also then preserved by grace from doing that as well. But so that's my understanding. I don't know, Father, am I misremembering where that comes from?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":716.4,"end":723.72,"speaker":"Fr Stephen De Young","text":"I think. I'm not sure what exactly you're trying. The quote is that you're. But St. John Damascus does address that idea."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":723.72,"end":725.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":725.76,"end":734.88,"speaker":"Fr Stephen De Young","text":"So, yeah, contra the prophecy movies, the first one being the only good one in which Christopher Walken plays the archangel."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":734.88,"end":735.36,"speaker":"Audience Member","text":"Correct."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":736.56,"end":797.01,"speaker":"Fr Stephen De Young","text":"Contra those. Right. There will be neither further angelic or human falls, but for different reasons. So in the case of humans, we have to remember what Adam's position was. Right. And so this is why in. In the first episode where we talked about the falls of humanity, even though it kind of sounded like taking a shot at St. Augustine, we pointed out that. That Adam wasn't like perfect. He was not in a state of perfection. He was in a state of innocence. So Adam was at the beginning of a journey that would lead him to become what the saints have become. Right. And so because he was at that beginning point, that innocent but very mutable point, right. He was able to fall."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":799.81,"end":800.93,"speaker":"Fr Andrew Stephen Damick","text":"Now, does it make sense?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":801.41,"end":839.74,"speaker":"Fr Stephen De Young","text":"Saints we refer to as, for example, the spirits of the righteous made perfect, being made complete or made mature, or who have come to their end, sort of their telos. Right. And so the state of a redeemed human is different in a bunch of ways from the state of Adam. Right. And so that's why for humans, that that kind of fall will not be possible. So it's a little different with angelic beings. Part of this goes back to we don't know what it's like to be a bat or a vast Cosmic intelligence."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":839.82,"end":840.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":840.22,"end":902.98,"speaker":"Fr Stephen De Young","text":"That. That their experience of time is different from ours. Right. And so this is why, even though we had to go into some wibbly, wobbly, timey, wimey stuff and phenomenology, we talked about how. Right. The fall of the angels, if looked at from the top down. And some of the fathers say this looked at from the top down, sort of happened instantly at their creation, but looked at from our human perspective, that enters into our human consciousness and knowledge at different points in our history. And so what we have in the Scriptures is from the human perspective, not from an angelic perspective. And if it was from God's perspective, none of us would be able to understand it. Right. In the sense that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":903.7,"end":904.98,"speaker":"Audience Member","text":"Right, right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":905.06,"end":932.41,"speaker":"Fr Stephen De Young","text":"We're not capable of comprehending things as God comprehends things. Right. So when we talk about the 5ish falls of the angels, we're talking about how that enters into human history and their interactions with humanity and how those angelic falls come into play in the human falls. But we're not saying this is how angels experience it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":932.65,"end":933.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't know that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":933.93,"end":970.9,"speaker":"Fr Stephen De Young","text":"To suggest, like the movie prophecy, which is gonna see a spike in viewership after this episode, I'm sure that angels could fall in the future. One of the presuppositions there is that they're sort of like us and they're experiencing time the way we are, and they're just sort of immortal humans. Right. And therefore, on any given day, they can decide to sin. Right. But that's projecting what it is to be human onto an angel. We're imagining ourselves if we were just sort of immortal and had wings and lived in the sky."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":971.38,"end":971.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":971.74,"end":974.18,"speaker":"Fr Stephen De Young","text":"Which is not what an angel is. Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":977.14,"end":979.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. Does that make sense, Jim?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":980.61,"end":982.13,"speaker":"Audience Member","text":"That makes excellent sense."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":982.53,"end":994.69,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. All right, well, thanks very much for calling into the Lord of Spirits podcast. Okay. It's an all Q and A episode, so we're just going to keep going. So next we have William calling. William, welcome to the Lord of Spirits podcast. What's on your mind?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":995.81,"end":1091.65,"speaker":"Audience Member","text":"Thank you, Fathers. What's on my mind is the question of the branch theory of the church and Israel. So very small, non controversial topic. So it's a bit of a long question. I've heard some contemporary Protestants give a defense of the branch theory of the church by pointing to Israel being divided both into a northern and southern kingdom, but both being God's people. And obviously, as orthodox Christians, we reject the branch theory, but the division of Israel is strange because the Bible does. In the Bible, God does seem to refer to Both northern and eastern, southern as his people. And nevertheless there seems to exist a real schism between the two of them. I mean, it seems to me that one of the chief sins of King Jehoshaphat is trying to act like there is no schism between northern and southern when there clearly is. I've read St. Kipring's defense of the unity of the Church where he differentiates old Israel from the Church by saying Ahaj's tunic was torn and 12 but Christ tunic remains tall, so the Church will not be invited. And I'll be honest, that doesn't make a ton of sense to me. So my question is, if we as Orthodox Christians say that Israel is the Church, how do we understand that Israel had a real schism where both sides seem to be God's people with varying degrees of faithfulness? And honestly, I'm particularly interested in how this relates to how we understand the Roman Catholics and the non Chalcedonians."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1092.37,"end":1368.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I mean, it's a good question. And you know, I'll, I'll answer kind of from the angle of the way that the, the conciliar tradition and the Church Fathers treat schism. Right. So they definitely condemn it for sure. There is occasionally you will see some of them say that, you know, there's damnation on the other side of a schism, but actually you don't see that very often. For instance, what you see in the conciliar texts is much more like what you see in St. Paul where he talks about handing someone over to Satan so that for the sake of his salvation. Right. That's what anathema is actually for. It's supposed to be ultimately therapeutic for someone's salvation. And the thing that I'll, I'll add, and that doesn't mean, by the way, that schism doesn't do anything or that it isn't real, but that the question of who exactly is the people of God and who isn't the people of God is kind of in some sense the wrong question, because the question really is how does everyone become part of the body of Christ? Right? That's always the motive for the Church fathers. That's what they call the soteriological motive, like how can everyone be saved? Now, that doesn't make them universalist, but that's the motivation, right? So, you know, the problem with looking at a schism, even an old one, and saying, well, this definitely means that this one side is completely inside Christ and this other side is completely outside of Christ, is defining exactly when that happens. Right. So, for instance, right now in the Orthodox Church, there are schisms between churches. There are churches that are out of communion with each other within what we would all recognize as being the Orthodox Church. That is a reality. Does that mean that one side of that is outside of the Orthodox Church and the other side is inside it? What about the fact that some are in communion with some of the same parties as each other? Right. So it's not very cut and dry when you try to use the lines of schism to define who is the people of God and who is not the people of God. Especially because ultimately, as it says in Scripture, everyone's going to be judged according to his works. And the point at which it really matters whether you're in the Church is at the end of time, when it will finally be truly revealed, when everyone truly is in Christ, or there's going to be some who are outside of Christ. Right. That possibility exists. So that doesn't mean that every single person who calls himself Christian is equally within the Church. Right. But that, especially when we're dealing with it in this present life, it can be kind of difficult to define exactly who is in and who is out, because we're moving along the timeline. Right. What is clearer is, for instance, you've got a commandment from St. Basil, the priests, he says, you know, do not conselebrate with whom it is forbidden. Right. That's very direct. And, you know, you see that reflected in the canons of the councils. Don't conselebrate with whom it is forbidden. Well, who's doing the forbidden forbidding? It's your bishop. He's the one doing the forbidding. Right. So you have to obey him when he says that. So, you know, someone should not listen to everything I just said and say, well, you know, Father Andrew Stephen Damick thinks that schism doesn't do anything. I mean, certainly, like St. Ignatius of Antioch has very strong things to say about it. But also, I'll say, you know, it's not over until it's over. We don't really know the effect of a schism until it's truly, truly over. And it's not truly over. We're still in the Messianic age, Right. So I don't know if that muddies the waters at all or if that helps, but at least that's from the kind of looking at it, from what the Ecumenical Councils actually do say about it. Right. The motive always is how do we heal this? Not how do we say who's out and who's in. You know, even when you look upon people that are clearly heretics, for instance, to deny the divinity of the Holy spirit, for instance, St. Gregory the Theologian, in one of his orations talks about people who do not deny the divinity of the Holy Spirit, and he praises them and goes on and on and on and says, I really wish that we could worship together. I really, I admire all of these things that you do, you know, and so forth. That should be the, the attitude. So I don't know, Father Stephen, what would you add to that or comment on that or. I'm actually about that, based on what William is saying, especially about the division of the northern and southern kingdom of Israel."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1368.55,"end":1398.43,"speaker":"Fr Stephen De Young","text":"Yeah. So part of the way this question discussed is really freighted with a lot of our Protestant friends because they have as a presupposition that being a Christian, being a member of the church and being quote, unquote, saved. That's a Venn diagram. That is one big circle."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1399.15,"end":1399.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1399.87,"end":1475.25,"speaker":"Fr Stephen De Young","text":"Like those three things mean the same thing for a lot of our Protestant friends. And for us, those do not mean the same thing. Yeah, right. Those, those three terms can identify different groups of people, and there's an overlap in the Venn diagram, but it's not 100%. And so you can see this really clearly with the example of ancient Israel, right. In that, sure, both the northern kingdom and the Southern kingdom are still referred to as God's people, but that and five bucks gets you a cup of coffee at Starbucks. Right. If the Assyrians were there massacring you because you had spent the entire existence of your nation, at best, worshiping Yahweh in a pagan way alongside other gods, at worst, worshiping BAAL instead. Right. The fact that you were part of one of the tribes that came out of Egypt would avail you absolutely Nothing. In fact, St. Paul tells us in Romans 2 that. That those people faced a sterner judgment because they had the revelation of God, unlike the other nations."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1476.05,"end":1476.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1477.17,"end":1485.01,"speaker":"Fr Stephen De Young","text":"So, and as St. Paul quotes from the Old Testament, Right. Not all in Israel are of Israel."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1485.49,"end":1485.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1486.05,"end":1497.32,"speaker":"Fr Stephen De Young","text":"So there are lots of people who are part of God's people in the Old Testament. The sense that they were Israelites who did not experience what we would call salvation. Right. Who were apostates."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1497.88,"end":1498.28,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1498.52,"end":1591.31,"speaker":"Fr Stephen De Young","text":"And the same is true in the church today. Right. We all continue to work out our salvation because we don't want to be one of them. Right. But the fact that you got baptized in an Orthodox church and maybe got married in one and maybe get buried out of one that doesn't necessarily mean you found salvation, and that doesn't necessarily, depending on how you lived your life, even mean that you're a Christian. So these are. These are separate categories. So I could look at someone who's not part of the Orthodox Church and acknowledge whether or not they're a Christian, whether they're trying to follow Christ as best they know how. But by saying, yeah, I consider that person to be a Christian, I'm not saying they're part of the Church because they're not part of the Orthodox Church. And I'm not making any judgment about whether, you know, they're experiencing theosis, their relationship with God, what that is, how they'll fare at the final judgment. I'm making no presuppositions about that whatsoever when I say that. And likewise when I say someone's a member of the Orthodox Church, if I don't know them, I don't know that they're living a Christian life or not. And again, I'm not making any judgment about their. Their salvation. Right. So for us, these are sort of separate categories. And so that argument doesn't really work because we're able to say, well, sure, they're Israelites, Israel and Judah, all those people are Israelites. But again, that is. That doesn't get you anything."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1591.63,"end":1621.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think one of the big problems with the branch theory is that it basically says that schism is normal and doesn't have to be. Really doesn't have to be overcome. Right. I think that's really the problem with it. It's just like, well, we're out of communion and that's okay. Right. That it just sort of accepts it as normal. But that's, you know, that's indefensible from the Christian tradition, really. Schism is always a tragedy that needs to be fixed, you know, but it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1621.02,"end":1632.58,"speaker":"Fr Stephen De Young","text":"Goes further than that too, because what you have to do to hold to the branch theory is you have to form eventually, depending on how far you go with it, you have to form this kind of lowest common denominator Christianity."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1632.58,"end":1633.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1634.06,"end":1642.14,"speaker":"Fr Stephen De Young","text":"Where. Where I, as a modern human decide arbitrarily what are and aren't the really important doctrines."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1642.54,"end":1643.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1643.1,"end":1644.38,"speaker":"Fr Stephen De Young","text":"Just on my own authority."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1644.46,"end":1649.3,"speaker":"Fr Andrew Stephen Damick","text":"Because heresy eventually goes along with schism. Well, because even if it doesn't, on."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1649.3,"end":1652.46,"speaker":"Fr Stephen De Young","text":"Day one, all these groups have legitimate disagreements with each other."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1653.44,"end":1653.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1653.6,"end":1695.22,"speaker":"Fr Stephen De Young","text":"Theologically and otherwise. Right. So I know people who, from the way they live their lives, are very good Christian people. Some of them are even clergy in Protestant denominations. But they, not accidentally, they have considered the Nicene doctrine of the Trinity, and they're social trinitarians. Right. Or some other view of the Trinity that is at best heterodox and at worst heretical. Right. I can't say. Oh, yeah, there's no difference between me and them. Right. Because who God is is pretty important. Who Christ is is pretty important."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1695.22,"end":1696.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1696.66,"end":1708.37,"speaker":"Fr Stephen De Young","text":"Right. And so by doing the branch theory thing, you're not only saying schism is fine and schism is normal, but you're saying these differences don't matter, which means that these doctrines aren't important."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1708.85,"end":1713.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Heresy isn't really a thing or it's a smaller thing, you know, and the."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1713.81,"end":1726.85,"speaker":"Fr Stephen De Young","text":"Christian faith and the Christian way of life is something that could be broken up into pieces and parts of it are more important than other parts and parts of it are negotiable. And none of that is something we can say as an Orthodox Christian."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1726.93,"end":1732.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Does that help, William? Or does that make it all so much worse?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1735.87,"end":1736.19,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1736.91,"end":1737.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Great."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1738.11,"end":1738.67,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1738.75,"end":1740.51,"speaker":"Fr Andrew Stephen Damick","text":"It's a very Lord of Spirits response."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1740.51,"end":1741.79,"speaker":"Fr Stephen De Young","text":"Porque de los dos."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1742.11,"end":1790.36,"speaker":"Audience Member","text":"If I might do a quick follow up, I'm not terribly concerned about it in a question of salvation. I'm concerned about it in terms of a dissolution of what the Church actually is. Because, I mean, we talked before about the ritual participation as defining a people as a people, and the ritual participation of Israel. And as it's Orthodox, we also have the ritual participation in the Church, which branch there just rejects that possibility. And so this schism between northern and southern Israel for me is more of a concern that if we said the Orthodox Church is Israel, that we have been grafted into it, but Israel itself seems to have split apart."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1793.72,"end":1821.85,"speaker":"Fr Stephen De Young","text":"Right. Let me. Let me. Yeah, let me try and clarify. I think. I think I get what you're asking. So part of what we have to say here is that the ritual and worship of the northern kingdom was entirely illicit and apostate from day one. The worship and ritual of the southern kingdom of Judah was, you know, we'll be generous and say, 50, 50. Illicit and apostate."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1822.01,"end":1822.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1822.57,"end":1890.42,"speaker":"Fr Stephen De Young","text":"The true worship was still there and was maintained, though it was a narrow thread in the southern kingdom. So by that standard, before Israel was destroyed, the northern kingdom of Israel gets destroyed because it is already apostate because of its witness. That's what the Old Testament says. Right. And so we are grafted in, as we understand what St. Paul is saying in Romans 9:11. We're grafted in to replace the northern tribes. The northern tribes have been dispersed into the nations, into the Gentiles. And so the calling of the Gentiles is to reconstitute those 10 tribes. So it's not just that we got grafted in on top of the 12 tribes. Our grafting in reconstitutes the 10 northern tribes. So that, as St. Paul says, at the end of Romans 11, when the time of the Gentiles is fulfilled, all Israel will be saved, not just Judah and some Benjamites and some Levites."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1893.45,"end":1903.77,"speaker":"Audience Member","text":"Okay, so sort of like how the saints are replacing the spirit, the angels that fell, the Gentiles are grafted in to replace the 10 tribes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1904.49,"end":1919.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes, and also with the complication that the. And also with the complication that the 10 tribes have been dissolved into the nations. So when the nations come to worship Israel's God, it is the return of the ten tribes. Right? Yeah. Right. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1919.47,"end":1926.03,"speaker":"Fr Stephen De Young","text":"And that's what St. Paul is doing with that grafting language. If you're going to graft a branch in, you have to make a cut first."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1927.79,"end":1932.15,"speaker":"Audience Member","text":"Okay, okay, okay. This makes a lot more sense. This makes a lot more sense."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1932.15,"end":1938.35,"speaker":"Fr Stephen De Young","text":"The branches are cut off for faithlessness, and that then gives a place for the faithful branches to be grafted in."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1938.59,"end":1975.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Alrighty. Well, thank you very much for calling, William. Good to talk to you. All right, well, next we have Andy, and his phone, at least, is from Washington, D.C. so, Andy, welcome to the Laura Spears podcast. Andy, are you there? All right, did we lose Andy? Okay, well, we are going to go ahead and take the next caller and hopefully we can get Andy back Deep State got him. Yeah, I know it's. Well, it is Washington, D.C. i mean, what can you say?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1975.16,"end":1977.12,"speaker":"Fr Stephen De Young","text":"Exactly. So, yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1977.44,"end":1980.88,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I think we have. Zach? Zach, are you there?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1982.48,"end":1984,"speaker":"Audience Member","text":"Yes, Fathers, can you hear me?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1984.24,"end":1993.6,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. So, Zach, welcome to Lord of Spirits podcast. Are you still there, Zach? Okay, go ahead."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":1993.84,"end":2000.01,"speaker":"Audience Member","text":"Yeah, yeah. Yes. So my. My question goes all the way back to the relics episode."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2000.81,"end":2001.37,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2002.57,"end":2036.08,"speaker":"Audience Member","text":"This notion of being. Of identity as. As an action, and the example that you gave Father Andrew of. Was of the true cross that, like it. That it was almost beside the point whether that piece of wood was like, physically from the cross Christ was hung on, but because it was being venerated and received as the true cross, it was being the true cross, and so is, in a sense, the true cross. So my question with that is."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2038.88,"end":2039.2,"speaker":"Audience Member","text":"For."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2039.2,"end":2073.11,"speaker":"Audience Member","text":"Someone who I really. That really spoke to me and really cleared up a lot of things for me, but I can also see somebody who'd be skeptical Raising the point of how. How then does this not lead into a sort of, of relativism? Like a sort of self contradictory, almost unworkable, ontological and epistemic, free for all that, like we can make anything, anything just because of how we, how we see things or think it is."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2074.87,"end":2194.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So I mean, what I would say to that initially is we don't have the power to make anything, anything. Right. We still have to treat things according to their nature. Right. I can't just say, well, you're. I can't say, well, you are now an orangutan because I'm going to treat you like an orangutan. Like, you won't. Because, number one, that's not your nature. But number two, I'm not the only person. I'm not the only relationship that matters to your being. In fact, I'm a pretty minor one when your being is considered right, because you're also in relationship to God and you're in relationship to all the other matter that's around you and your relationship, other persons around you. And so even if every person around you says you're an orangutan, that still doesn't make you one. Right. Because that's not your nature. So it's not arbitrary. It's not that anything can be anything. Right. So we have to keep that in mind. You know, it's not the fact that a piece of wood can be put together and said, here's the cross of Christ. Whether we say this is a relic of the true cross or simply, this is a hand cross that I made from an oak tree in my backyard, it still functions as the cross of Christ for us. Right? Because that's appropriate to the way it's been shaped and that's appropriate to its nature. But if I have a handful of just, you know, liquid water and say, here's the cross of Christ, that doesn't actually work that way because it's contrary to its nature. Now you could, you could freeze it and actually I've used ice crosses for doing outdoor water blessings. And that becomes the cross of Christ within that ritual context. But if it was just liquid, then it. Then no one would believe that because that's not what it actually is. Father Stephen, you want to add adjust, bend, derelativize."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2196.17,"end":2210.28,"speaker":"Fr Stephen De Young","text":"Well, yeah, I mean, first, first. And this is just a general statement, a lot of things have become these sort of bugbear words, right? Where like that sounds like relativism."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2211,"end":2211.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2211.36,"end":2289.16,"speaker":"Fr Stephen De Young","text":"You know, and so. Oh, no, no, no, no, no. Right. And we all know that's better. That sounds postmodern or that sounds modern or. That's right. So we need to be careful sort of with those words. And if someone's criticism of an idea. I'm not applying this to you, Zach, but to someone who maybe you may be interacting with, if their sole criticism is that sounds like blank, that's not a valid criticism. Right. But so part of this is, as Father Andrew said, what we're able to do, and we aren't able to flip our own phenomenology like a switch. Here's what I mean by that. I can go and shave off a piece of wood, and I can go and buy a reliquary on ebay, and I can put the piece of wood in it, and I can go to my church and say, hey, I got sent this from a bishop in this country. This is a piece of the true cross, and I can put it out for veneration. You know, my bishop is in town, so I'm not saying I'm going to do this, whatever, do this, but texting."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2289.16,"end":2291.29,"speaker":"Fr Andrew Stephen Damick","text":"Him right now, it is possible."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2293.13,"end":2409.26,"speaker":"Fr Stephen De Young","text":"So. But I could do that. Right? And we were very much saying in that episode, and I would still say that for the people who believe me and come and venerate it, they are venerating the true cross of Christ and that God's action through my phony relic is undisturbed by the fact that it's a phony relic that I made, but it will never be for me the cross of Christ. I can't trick myself right into it being the cross of Christ for me. So we were speaking at a phenomenological level, at the level of experience and of interrelationship with specifically God's actions, the divine energies, not at the level of ontology in the sense of a kind of Parmenidean. Right? This is this thing. It is not any other thing. Right? So we're using identity in that phenomenological sense, because as we pointed out, everything, not just God, has an essence and has energies. So we're not talking about what that. What my phony piece of wood is in its essence. We're talking about what it is in its activities and its interrelationships with people. And all, everything, everything that exists has different identities and different relationships to different people. And so, for example, in my phony relic example, it would have one relationship to the people who come and venerate it wholeheartedly and a completely different relationship to me who phonied it up and made it in the first place."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2412.54,"end":2413.46,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2413.46,"end":2446.07,"speaker":"Audience Member","text":"Yeah, that. Yes. Yes, that does. Because what that really cleared up for me was with. With a lot of these phenomenological approaches is it almost seems to slip into an almost radical constructivism. But I know you all push back on that in a few episodes past, and it's more of this interaction idea between the objective real world outside of ourselves with our subjective consciousness is really what reality is for us phenomenologically."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2446.87,"end":2471.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, that's just how it works. We don't have access to a. We don't have access to anything outside of our experience. Like, that's just not possible. Yeah. As humans. Right? Yeah, yeah, yeah. So. All right, well, thank you very much for calling. We're going to go ahead and take one more call before the break, and hopefully we have Andy back. Andy, are you back?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2473.05,"end":2474.25,"speaker":"Audience Member","text":"I'm back. I'm here."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2474.65,"end":2477.65,"speaker":"Fr Andrew Stephen Damick","text":"All right, Andy, So you weren't swallowed by the deep state?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2477.65,"end":2478.89,"speaker":"Fr Stephen De Young","text":"Yes. You fought them off?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2479.05,"end":2493.58,"speaker":"Audience Member","text":"I guess not, no. And I'm here with my son Ezra, who's 13, and we both enjoy listening to the podcast together. It's really opened up the Scriptures for both of us. And we each have a question, if that's okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2493.58,"end":2497.26,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. All right, well, nice to be speaking with you as well, Ezra."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2498.7,"end":2534,"speaker":"Audience Member","text":"And so I figured I would ask, and then I'll have Ezra ask and you could answer the question. So my question is, in Matthew 16, when Jesus asked the disciples, who do people say that the Son of Man is? If, you know, for a first century or second century Jewish person hearing that for the first time, would they think that Jesus is about to open up a discussion about, for example, who the figure in Daniel 7 is without necessarily referring that to himself? And then I'm going to have my son ask a question."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2534.64,"end":2535.44,"speaker":"Fr Andrew Stephen Damick","text":"Okay, go ahead."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2536.89,"end":2550.09,"speaker":"Audience Member","text":"Thank you for answering. So I had a question about the extra books that are in the Orthodox and Catholic Bibles, but not in the Protestant."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2551.05,"end":2553.25,"speaker":"Audience Member","text":"I was wondering, like, I've read lots."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2553.25,"end":2556.65,"speaker":"Audience Member","text":"Of things that Protestant people have written."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2556.65,"end":2558.53,"speaker":"Audience Member","text":"Like, reasons why they should not be."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2558.53,"end":2574.02,"speaker":"Audience Member","text":"In the Bible, but it seems like many of those were developed after they were already taken out. And I'm just wondering, like, the main reason they were taken out in the first place and how we can react to that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2574.9,"end":2585.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, all right, great question, Ezra. Okay, well, I'm gonna punt the first one over to you, Father Stephen, because I'm sure that you have a lot to say about this."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2586.9,"end":2587.78,"speaker":"Fr Stephen De Young","text":"No, not really."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2588.18,"end":2588.98,"speaker":"Fr Andrew Stephen Damick","text":"No. Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2589.94,"end":2667.06,"speaker":"Fr Stephen De Young","text":"No, I will. So the. Yeah. So in the context. Right, we've already had Christ refer to himself as the Son of Man. So this is a porque de los dos situation. So for the disciples, they've already heard Christ identify himself as the Son of Man, but they're also, especially if you look at their answers, right. That they are bringing in answers that are connected to pre existing Son of Man traditions in Second Temple Judaism. Right. So for example, when they bring up Elijah or one of the prophets, right. Like that was one of the major traditions, that Elijah, because he didn't die, right. That he was going to return often with Enoch and that that shows up in the Book of Revelation. But so they're both implying, when they say, well, some say Elijah or one of the prophets, they're both implying this is who people believe the Son of Man is, and this is who people believe you are, who believe that you are the Son of Man. Does that make sense? It's kind of a both and yes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2667.46,"end":2682.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Like even if you just look at Matthew, Christ uses the phrase Son of Man to refer to himself like nine or ten times even before that passage. So there's context. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2682.19,"end":2696.67,"speaker":"Fr Stephen De Young","text":"But both ideas are being brought in. So it is good that you notice that. Yeah, this has this bigger resonance than just who do people say I am? Right. It's not just a synonym for I, but it brings in these other ideas as well."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2697.45,"end":2697.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2699.85,"end":2718.57,"speaker":"Fr Stephen De Young","text":"To Ezra, I want to say first of all, long before you were born in the 90s, there was a band called Better Than Ezra. And I'm gonna tell you today that I think they were lying because I think you are better than that. Even from this brief interaction we've had."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2718.57,"end":2719.65,"speaker":"Fr Andrew Stephen Damick","text":"Indeed, indeed."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2719.65,"end":2914.14,"speaker":"Fr Stephen De Young","text":"I think you are a better man than they. And in terms of your question. So part of the question between us and other Christian groups of this regard, and our Old Testament is actually a little different than the Roman Catholic Old Testament. We actually have a couple more books than they do. If you're Greek and if you're from a Slavic tradition, we actually have even a couple more than that. And so it's not an issue really of those books having been taken out. The reality is in the early Church, different Christian communities in different parts of the world received an Old Testament that was based on what the Jewish communities were using in that part of the world. So in Greek speaking communities, they received a Greek Old Testament that had books in it that were not necessarily part of the Hebrew Old Testament or of the. The Old Testament that was being used by Ethiopian Jews or Alexandrian Jews or. So there were different sort of Old Testaments that were received. And so in the west, in Europe and in the western part of North Africa, there were some churches that only used the Hebrew canon, which is what Protestants use today, the Old Testament that most Protestant groups use today. There were other Latin speaking churches that used the larger Old Testament canon that the Roman Catholic Church uses today, and that the Roman Catholic Church only made that their official Old Testament canon in the 16th century A.D. so before that, for close to 1500 years, there were different sides who debated that in Western Europe which one of those two should be used as the Old Testament. And on that, as well as a whole bunch of other issues, when the Protestant Reformation happened, the Roman Catholic Church sort of took one side and the Protestant churches took mostly the other side. Right. And adopted those two canons. Whereas different Orthodox churches and different what we call Oriental Orthodox churches sometimes, or non Chalcedonian churches, they're still using the same canon they've always used, that have those extra books. So the answer really for why we as Orthodox Christians have the canon we have, why we have the Old Testament we have is that this is the list of books that we've received from the earlier generations of our church. And we've just been using it continually all this time. There was never really a big debate or discussion about it in the east, like what happened in the West. So I hope that helps."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2914.94,"end":2917.18,"speaker":"Fr Andrew Stephen Damick","text":"Does that, does that answer your question, Ezra?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2918.7,"end":2933.1,"speaker":"Audience Member","text":"Yeah, so I have an orthodox study Bible and I read those books a lot and I like them. And I just, I was just kind of upset that they were taken out, I guess."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2933.98,"end":2937.02,"speaker":"Fr Andrew Stephen Damick","text":"Well, maybe you can share them with your friends if they're open to that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2938,"end":2945.08,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, that's one of the most, most like most of our Protestant friends are totally unfamiliar with what's even in those books."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2945.08,"end":2964.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they're really great stories. Like Tobit especially, is such a great story. So. And you know, bigger Daniel has a dragon. So. Anyway. All right, well, thank you very much for calling Andy and Ezra. We're gonna go ahead and take a short break and we will be right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2964.16,"end":2965.86,"speaker":"Fr Stephen De Young","text":"Way better than. Better than Ezra."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2966.25,"end":2970.49,"speaker":"Fr Andrew Stephen Damick","text":"Way better. Way better. So. And we'll be right back."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2971.21,"end":2987.53,"speaker":"Audience Member","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":2992.93,"end":3061,"speaker":"Fr Stephen De Young","text":"Hey there, Ancient faith radio listeners. I'm Bobby Maddox, station manager of afr. And as you might Be aware the very popular Ancient Faith Radio app was canceled unexpectedly by the company that built and supports it. We apologize for any inconvenience that this may have caused. The good news is that we have created a brand new app that will launch this coming September. And, boy, will you be pleased with the change. Not only is the interface more intuitive and easy to use, but the new app will totally revolutionize the way that you listen to Ancient Faith Radio. Among other features, it will include the ability to create playlists and share them, and a subscription option that will keep you up to date on new episodes of your favorite podcasts. And speaking of favorites, the app will likewise allow you to mark your preferred podcast as such and store them in a convenient, accessible location. We are thrilled with how the new app is turning out and can't wait to offer it to you. So fear not, AFR listeners, and thanks for your patience. The new, incredibly robust Ancient Faith Radio app is on its way this coming September. Look for it soon in your preferred application store."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3064.52,"end":3080.6,"speaker":"Audience Member","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3081.8,"end":3089.4,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, Dragon Slayers. So, I mean, I loved that ad from Bobby. He always sounds so positive in those ads."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3089.56,"end":3095.32,"speaker":"Fr Stephen De Young","text":"You know, I kept thinking it was me that was going to get cancelled, and it turns out it was the app."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3096.04,"end":3103.06,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. Just suddenly and literally, like if you pull it up. If you pull it up, it says app has been canceled."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3103.38,"end":3104.34,"speaker":"Fr Stephen De Young","text":"Total swerve."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3104.5,"end":3133.26,"speaker":"Fr Andrew Stephen Damick","text":"Completely true. Yeah. Right, right. Well, I mean, you know, I do want to play, though. So there is an ad that occasionally I get asked to do voiceovers, promo voiceovers and stuff, you know, because I am an Ancient Faith employee and I just wanted to play an ad for your second book for Father Stephen. You know, this is one of my favorite ads that I was ever asked to do, and it's been a long time since any of us have heard this, so let's go ahead."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3133.26,"end":3136.74,"speaker":"Fr Stephen De Young","text":"And finally, an ad that wasn't a snoozer."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3137.78,"end":3221.55,"speaker":"Fr Andrew Stephen Damick","text":"Here we go. In a world of infanticide, holy war, and divine wrath, violence in the Old Testament has long been a stumbling block for Christians and skeptics alike. Yet conventional efforts to understand this violence, whether by downplaying it as allegory or a relic of primitive cultures, or by dismissing the authority of scripture, scripture altogether, tend to raise more questions than they answer. God is a Man of War offers a fresh interpretation of Old Testament accounts of violence by exploring them through the twofold lens of Orthodox tradition and historical context. Father Stephen DeYoung examines what these difficult passages reveal about the nature of Christ and his creation, bearing witness to a world filled not only with pain and suffering, often of human making, but also with the love of God. Yeah, you gotta love that dramatic background music right there. Right? Yeah. Probably sold 10 copies just now. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3221.55,"end":3224.75,"speaker":"Fr Stephen De Young","text":"And unfortunately, you know, people could see the visuals that went with that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3224.75,"end":3225.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3225.07,"end":3228.99,"speaker":"Fr Stephen De Young","text":"The fire, the explosions, the, you know, the dancers."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3229.55,"end":3240.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it's true. All right, well, we're gonna go ahead and take another call. So we've got Celeste calling, and her phone is from Nevada. So, Celeste, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3241.39,"end":3242.99,"speaker":"Audience Member","text":"Hi. Okay. You can hear me."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3243.31,"end":3245.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3246.91,"end":3268.76,"speaker":"Audience Member","text":"So I'm piggybacking. I'm going to piggyback my question on Jim's question from earlier in the show. So you said that Adam wasn't perfect, but innocent and mutable. But I remember from earlier shows you explained that free will is explained like it's a."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3269.24,"end":3271.28,"speaker":"Audience Member","text":"It's the free will to choose evil."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3271.28,"end":3273.68,"speaker":"Audience Member","text":"Is a defect, and that it was."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3273.68,"end":3275.72,"speaker":"Audience Member","text":"A repercussion of the fall."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3277.16,"end":3282.08,"speaker":"Audience Member","text":"So how can Adam and Eve choose to sin before they were fallen?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3283.36,"end":3348.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I remember this taking up about three whole sessions in my seminary classes with our patristics professor. And I remember him saying, this is just my punt to Father Stephen, but I wanted to add in something I remember saying with his amazing London Cypriot accent that he had. It was exceedingly difficult for them to sin. So. Yeah, I mean, I think so. The one thing I would say is what is really the result of the fall is our tendency to sin. Our tendency to sin like that we lean in that direction. Right. That it's easier to do that. Not that it's, you know, the ability to fall only comes because of the fall. Right. That doesn't make sense, does it? Right, so that's what I'll add. And I'll. I'll pass the puck over to Father Stephen."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3349.5,"end":3350.38,"speaker":"Fr Stephen De Young","text":"Yeah, so."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3352.46,"end":3353.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so you're."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3353.42,"end":3434.28,"speaker":"Fr Stephen De Young","text":"You're basically what you're summarizing is the distinction, what it gets called distinction between the natural will and what the. Called the gnomic will. Right, There you go. The Nomec will being this sort of second movement of the will that emerges after the fall. And so the natural will is really sort of a force that. That propels us in the direction of our nature. But. So this is part, though, of a whole Understanding of. Of human choice, that really comes out of Aristotle, that gets picked up by the fathers. And so it's worth noting that when it comes to phronesis, which is sort of ethical decision making for Aristotle, he's going to argue there, and I think this is implied in the concept of the natural will, that everyone always chooses the good. And that at first doesn't make any sense to us, right? Because we're like, well, obviously no, people choose to do evil all the time, right? But the point he's trying to make is that people do what they do because what they are doing appears good to them at the time."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3435,"end":3435.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3436.2,"end":3621.78,"speaker":"Fr Stephen De Young","text":"And we see this in, in Genesis 3, right? It talks about how Eve looked at the fruit and saw that it was pleasing to the eye, right? That is all of these, right? So to her it appears good, right? To her it appears good and that then spurs her action. So we tend to think of the will purely in that gnomic sense of I choose X or I choose Y, I choose A or I choose not A. But the natural will is this force impelling us toward the good. So the reason Adam and Eve were able to sin is related to that fact that they were innocent and immature, right. That they had not their noose, right. Their ability to perceive what is truly good was undeveloped and therefore able to be mistaken, able to be fallible. This is why God forbade them to eat from that tree in the first place, right. Second Temple Jewish tradition all the way through the Church fathers is that there was nothing evil about the tree per se, but that Adam and Eve were not ready at that point to receive that wisdom. They were not yet mature enough to receive it. And so God's command was protecting them from right. And from the consequences of them eating it too soon. So this is part of why, part of what we were talking about. The answer to that previous question, why once we have reached that point of maturity in Christ, we will not be capable of seeing sinning again. Because then through the process of theosis, through the process of our salvation and glorification, our noose is purified so that we could correctly see what is good, what is pure, where God is right. And we will be able to do that correctly and infallibly so that we won't need to right the. The novik will, that second move of the will emerges after the fall because we need it after the fall, because after the fall, our noose is even worse off, right? So it goes from being a lens that isn't focused properly to being a lens that's cracked and covered in mud. And we're still using that lens to try to perceive what is good and what we should do. And so the second movement of the will emerges to help us as a faculty of our indecision and our inability to clearly discern it. All right, so we're at a worse off state. Right. So ultimately, Dr. Vanyamin was right. It was more difficult for them. Right. Because they had greater access than we do. But their ability to receive the good was not perfect either because of their immaturity."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3624.43,"end":3625.63,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, Celeste?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3627.15,"end":3629.79,"speaker":"Audience Member","text":"It's a lot to chew on, so I'll just chew for a while."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3631.31,"end":3647.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, we like to do that. Thank you. You're welcome. You're welcome. All right, well, we've got. Going to take another caller. This is an all Q and A episode. So we've got our old friend Samuel from Virginia. Samuel, are you there?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3648.44,"end":3649.56,"speaker":"Audience Member","text":"I'm there, fathers."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3649.96,"end":3654.76,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, Samuel, to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3655.4,"end":3702.65,"speaker":"Audience Member","text":"Well, I was wondering how much people's understanding of who and what God is affects how we design our places of worship. Like, we. We both know what a church looks like. And to contrast with that, a few months ago, I toured and the nearby Mormon Temple when it was open to the public during their renovations, and it did not look like what I expect a church to look like. Honestly, it looked more like a hotel than a church. But how much of that is from the different understanding of who and what God is rather than from something else going on?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3703.91,"end":3848.16,"speaker":"Fr Andrew Stephen Damick","text":"That's a great question. So, you know, like, Mormon temples are actually a great example of this, because the concept of who exactly God is and what it means to be his children and what heaven is like, all this kind of thing, right? This all is expressed in their architecture. It's all expressed in their architecture. The reason why, and I agree, I mean, I think that a lot of the rooms do look like a hotel, and that comes out of this conception of what the celestial kingdom is like and all this kind of thing. Whereas traditional Orthodox church architecture comes out of a concept of. I mean, if you look at, for instance, an icon of All Saints, and then you look at the inside of an Orthodox church, you're basically seeing the same thing, right? Christ enthroned at the center, surrounded by, you know, directly next to him, his mother, and John the Forerunner and the angels and all the saints. I mean, that's exactly what it is, an icon of. All Saints and an Orthodox church are depicting the same thing. The difference between them is that a church is a ritual space you can actually do things in. Right. So, yes, absolutely. Your concept of who God is, what it means to meet with him, what it means to be. To dwell with him, especially, does affect your worship space. I mean, I recall when I was, you know, 25 plus years ago, when I was still in evangelical, my last stop in the evangelical world was in the beginnings of a megachurch. And the church, the inside literally was a theater. Like, it just exactly was a theater. You know, the seating was theater seating. The stage was a theater stage. The lighting was theater lighting, sound, the whole thing. Right. And I recall, you know, discussions about what will heaven be like. We're in these exact terms that it's going to be sort of a long worship music session. Right. In that term. So, yes, absolutely. Your concept of who God is and what it means to dwell with him is going to be expressed in your architecture, Father Stephen. Anything to add or adjust there?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3849.69,"end":3867.69,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, with everything like that, form follows function, right? So the bridge of Kirk's Enterprise looks like the bridge of a starship, and the bridge of Picard's Enterprise looks like a Hilton lobby where they're having some kind of meeting to eat shrimp and talk about diplomatic issues or something."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3869.85,"end":3871.61,"speaker":"Fr Andrew Stephen Damick","text":"And quote Shakespeare. Hello?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3872.01,"end":3930.31,"speaker":"Fr Stephen De Young","text":"Well, yeah, so, but the same is true with churches, right? If what you're doing is you're going there to see a presentation, then your church is going to look like a theater. If what you're doing is you're gathering to hear a sermon, everything's going to be aimed at a lectern up front. And of course, in the Orthodox church, ultimately, our churches are patterned after the tabernacle, which is patterned after what Moses saw atop Mount Sinai. And so it's patterned after the cosmos, it's patterned after the heavens and the earth. And we have the altar at the front, which is the footstool of Christ's throne, because Christ is enthroned at the high place and we're there to meet with him and worship Him."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3930.79,"end":3931.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3931.27,"end":3951.27,"speaker":"Fr Stephen De Young","text":"And that's primarily done through sacrifice. That's why we have the altar there at the front. So, yeah, it very much. You're going to design your worship space around what you're intending to do there. And so it's revelatory of what it is that people think they're doing and what they intend to do."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3951.75,"end":3955.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Does that answer your question, Samuel?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3956.31,"end":3958.15,"speaker":"Audience Member","text":"Yeah, that was very helpful. Thank you."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3958.47,"end":3972.53,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Awesome. Great. Well, this is our second anniversary episode and we're playing some selections of Moments from some of our previous favorites. So I'm going to go ahead and play another happy memory right now."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3980.05,"end":3994.05,"speaker":"Fr Stephen De Young","text":"So, yeah, I mean, there's a lot of UFO abduction stories out there, but I think that that one in the clip that we just played, I think that's the one that I think really needs a response and really needs an explanation."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":3994.3,"end":4039.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, before, before we get to that, though, like, I just wanted to say that when I was in seminary, and of course you and I both went to the same seminary at Saint Tekon's I lived in a little town called Simpson, which apparently is actually renowned for being the site of the first. Either Simpson or the town next door, the first car accident in America. But Carbondale, Pennsylvania, which is right next to there, and which we used to amusingly reflect to as Carbondale, because of course, apparently Carbondale. And you can look this up on the Internet, people. Carbondale is the site of a. A UFO downing, like in a reservoir or something there. And, and, you know, I mean, who knows if it was covered up by the government? I have no idea. But I just wanted to point that out."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4039.52,"end":4052.44,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah, yeah. But so, I mean, a lot of those stories, I'm not super familiar with the, the Carbondale story, but a lot of the stories, you see the same sort of derivative elements from previous stories. Right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4052.44,"end":4053,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4053,"end":4085.43,"speaker":"Fr Stephen De Young","text":"And so it's hard to sort of sort those out. But in that clip we just heard, right? I mean, the connections to like, for example, Humbaba in the Epic of Gilgamesh. Right. Or, you know, even some of the stories regarding the God Enki. Right. They're just so clear. And this would be the one place where maybe somebody like Zacharias Sitchin. Right. Or the documentaries on Viper tv, where they, you know, might maybe have a point."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4085.75,"end":4086.55,"speaker":"Fr Andrew Stephen Damick","text":"Right, About."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4086.79,"end":4097.35,"speaker":"Fr Stephen De Young","text":"About the whole connection between this ancient literature and the modern experience of. Of alien abduction. And as we just heard, you know, cattle mutilation."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4097.35,"end":4116.38,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And, you know, one of the things that fascinated me the most about that recording was how you can actually connect that with passages from the ancient world, with stuff in scripture, and actually figure out the precise age of the earth, including, you know, such events as when the Exodus happened."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4116.38,"end":4121.66,"speaker":"Fr Stephen De Young","text":"Right, right. Because it all maps out if you just track those appearances."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4122.06,"end":4130.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Right, exactly. Yeah. That, to me, was one of the most mind blowing episodes ever. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4130.07,"end":4138.55,"speaker":"Fr Stephen De Young","text":"Honestly, we had all those people requesting the UFO episode, and we were resistant to doing the UFO episode, but I'm glad we finally did it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4138.71,"end":4139.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4139.63,"end":4140.79,"speaker":"Fr Stephen De Young","text":"Back then when we did."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4140.79,"end":4151.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Exactly. All right, well, we have another caller we're going to take, and Michael is calling. So, Michael, welcome to the Lord of Spirits podcast. What is on your mind? Thank you."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4151.92,"end":4152.88,"speaker":"Audience Member","text":"Father's blessed."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4153.12,"end":4154.08,"speaker":"Fr Andrew Stephen Damick","text":"God bless you."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4155.84,"end":4170,"speaker":"Audience Member","text":"I just want to say first, I really appreciate your show. This and the whole council and the orthodoxy and heterodoxy were major stepping stools in my family and I converting into orthodoxy. So we. We really appreciate all the work that you guys have done."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4170.24,"end":4170.96,"speaker":"Fr Andrew Stephen Damick","text":"Thank God."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4173.28,"end":4256.05,"speaker":"Audience Member","text":"So my question is it involves Most High God. So I know a little bit of the whole question now. It's when is the Most High God that they're referring to in these texts no longer Yahweh, the God of Israel? I'm looking in particular, I got a copy of the. The Papyrus of Ani, like with the. The Egyptian Book of the Dead. And in there it starts with praising. In this case, it's Ra, who's supposed to be the most High. And it talks about him creating all the other gods and being this other things. But then if you look at that and then you look at, you know, other other things, like with the golden calves or something like that, when the ones that Aaron put up or the ones that you see the put up in the divided kingdom in Northern Israel versus like in modern Islam where they, God as we are, just. They say that they understand him better or even to like Mormons or Jehovah's Witnesses or, you know, all that. It seems like everybody in these cases is like, saying they're talking about the same person, but at what point are they no longer actually talking about the same person?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4257.59,"end":4271.11,"speaker":"Fr Andrew Stephen Damick","text":"I think I see what you're saying. So, like, I mean, this seems to be a permutation of the question of, you know, is the God that Muslims and Jews and Christians worship truly the same God? Right. Is that kind of what you're talking about?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4272.15,"end":4293.55,"speaker":"Audience Member","text":"Right. And like, was. Was the Yahweh of the Golden Calves actually Yahweh, the God of Israel just being worshiped incorrectly? Is Ra in this case actually Yahweh, the God of Israel, just with a different name and bad understanding. Like, where's the line between, okay, you're still worshiping the actual Most High versus no. Now there's an inner looper."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4296.11,"end":4342.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So I mean, the place that I would start would be to say that, you know, if someone is teaching heresy, like. Right. For instance, let's say someone says that God is, you know, Unitarian Monotheistic God. God is only one person. Right. That, of course, does not change who God is God is still God. He's still Father, Son and Holy Spirit. That's just an eternal reality. Right. So the fact of heresy does not change who God is. The question then is when does someone's worship of their mistaken version of God actually veer away into worshiping something else? I think. Is that what you're sort of saying?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4342.57,"end":4343.25,"speaker":"Audience Member","text":"Right, exactly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4343.72,"end":4513.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Okay. I mean, I think. Well, number one, if someone is trying to worship Ra and not Yahweh, that's clearly someone else. I mean, the depiction of who Ra is, is. Is quite different, you know, or as, of course, Father Steven remind us, it's actually pronounced re. But, but he never gets written that way, at least in English, you know, and, and. And then where it gets sticky is when you're talking about, like, heretical versions of Christianity. Right. Like Unitarianism, for instance, is a good example of this. And I would say that inasmuch as someone is trying to worship the one true God, even doing it imperfectly, in as much as they are being faithful to what he said, they are doing that. But of course, it's mixed with other stuff, and that other stuff can be a problem. Now, if they're doing that out of ignorance, I believe that God is going to be merciful to their ignorance. Right. That he's not going to just say, well, you got it wrong. If you'd only moved, you know, flipped your doctrine 0.5 degrees north, you would have been fine. Right. That's not to say that doctrine doesn't matter, but I think that intent does matter. You know, if someone is trying to worship Yahweh, the God of Israel, the Father, Son and Holy Spirit, but doing it badly, that's better than someone who knows better and chooses something else. Right? So I don't know if there's a precise line that you can identify. Clearly you can see that, like someone trying to worship Zeus. If they do, you know, it's. Zeus clearly is a different figure than Yahweh. Right. If you're. If you're. If he's embedded within the whole matrix of Greek myth, it's clear that this is a different being. Right? But then, of course, you have the scenario. Like, you know, what you see in. I think it's the last battle in C.S. lewis's Narnian Chronicles, where you've got someone who's. Who's worshiping this false God in the book, who's called Tash. And yet the way that they're worshiping Tash somehow is him actually worshiping Aslan, who is the lion, who is the Jesus figure in there. So there's this idea of kind of the noble pagan on some level, the pagan who's trying to worship the one true God, but doesn't know that that's what he's doing. He's sort of being accidentally faithful or ignorantly faithful really is kind of the thing. So I don't know that there's like a clear line. I know I already said that, but that's my conclusion on that. I don't know. Father Stephen, you want to add. Adjust, correct, whatever."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4514.64,"end":4897.8,"speaker":"Fr Stephen De Young","text":"Well, I think. I think there's two different things here. Okay, so the first one is, right, Most High God is a title, right? Ll yon. Right. It's. It's a title. And so, yeah, for Egyptians, RE is the most high God. For BAAL worshipers, El later, BAAL is the most high God. For Greek pagans, Zeus is the most high God. And for Israelites, Yahweh is the most high God. The fact that they all apply that same title does not imply in any way that they're the same being. It's. They have a disagreement over who that title rightly belongs to. Right? Because Most High God is. Is sort of like, you know, lit being the best power pop band of the late 90s, right? You might be wrong and disagree. Right? But if you say no, man, Bowling for Soup is the greatest power pop band of the late 90s, early 2000s, then we're not talking about the same band. We're disagreeing about who that title belongs to. Right? And you see that like in the New Testament, the New Testament uses O, the. The articular form, right? The God is how it's sometimes put into English to refer to the Father. Whereas if you read classical literature, O, the Os is Zeus. Right? Again, that's not an argument that they're the same person. It's who. Who does that title sort of God with a capital G really, really belong to? Now, the other piece, that's the first piece, but the second piece, right. Is in terms of sort of. Father Andrew was brushing a little too close to the anonymous Christians idea for me, but he was CS Louis it up a little bit. But so the question is, you know, are these other groups worshiping the same God? And to me, the question, there is a question about knowledge, right? Level of the knowledge of God. What level of the knowledge of. Of the true God is required in order to worship and follow the true God Truthfully, right? And it's a good thing that perfect knowledge isn't required or we'd all be in bad trouble, right? And I don't just mean that rhetorically, right? Even from our perspective as people who may have done a bunch of reading of the Church Fathers and studying the doctrine of the Trinity, if we gave an essay exam to orthodox Christians, good faithful orthodox Christians, and asked them in an essay to explain the doctrine of the Trinity, we'd be mostly heretics, right? We would get something wrong. At bare minimum, if we didn't have a whole wrong headed conception, we'd have something or some turn of phrase or some preposition we used that was technically a heresy, right? That doesn't mean that because we don't have that knowledge, we don't have that higher level of understanding that we're not really worshiping the true God, we're not really orthodox Christians, right? It's that our knowledge is imperfect. And so God accepts imperfect knowledge. But what we find over and over again, for example in the Scriptures, is that when someone is worshiping the true God with an imperfect knowledge, they have more knowledge given to them. So Exhibit A would be like Cornelius the centurion, right? As far as we know, Cornelius was still technically a pagan. The fact that he was still a centurion in the Roman legions means he was participating in pagan sacrifices on a fairly regular basis. But in his heart he wanted to, he had a love for and wanted to follow the God of Israel. And so he was giving alms, he was making donations to the Jewish temple, he was praying, seems like probably in his own prayers, at least exclusively to the God of Israel. And so because he's doing that, the angel comes to him and says, hey, you know, your prayers and your alms have gone up like incense, right? As an offering before the Lord. And so we're now sending someone to you. And St. Peter gets sent to him to teach him the gospel, right? To raise his level of knowledge so that he can more truthfully worship the true God. So I have no doubt that there are people out there who are endeavoring to worship the true God, to worship and follow Jesus Christ as best they know how, like those, those Christians I was talking about earlier who aren't necessarily in the Orthodox Church. Those people are out there and there may even be some of them who, you know, because they grew up in a Muslim country or something, you know, don't have even any Christian words to apply to it, right? But you could go and Google this. There's been a rash over the last couple of decades of Muslims in Muslim countries having visions of Christ and visions of The Theotokos that are not all that dissimilar from what happened with Cornelius. So this is a thing that happens. And so those people, God reaches out to them, right? And raises their level of knowledge when someone is. Is doing that in truth. And that's, of course, offered to all of us because none of us, as I said, none of our knowledge is perfect. And so all of us need to continue to seek wisdom and the knowledge of God and to grow in our faith, because none of us have sort of arrived and got. I've got who God is down pat now. I've got that all worked out. Like, that's the surest sign that you're believing a heresy that there is, that you think you have it all worked out. So I hope those between those two things, that kind of answers your question."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4899.96,"end":4907.04,"speaker":"Audience Member","text":"It does, it does. That's very helpful. I have one quick question on, like, totally different topic, if I may."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4907.6,"end":4910.32,"speaker":"Fr Andrew Stephen Damick","text":"All right, The."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4910.8,"end":4912.64,"speaker":"Audience Member","text":"So Dungeons and Dragons."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4913.2,"end":4913.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4913.68,"end":4924.96,"speaker":"Audience Member","text":"Is it possible to share the Gospel and convert orcs and goblins and dragons and kobolds and all those kinds of things? Like, are they. Are they image bearers to the degree that they can be converted?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4927.36,"end":4941.24,"speaker":"Fr Andrew Stephen Damick","text":"Well, within Dungeons and Dragons, no. Within the real world, no. Because a monster is a monster. You know, that's what monsters are in stories is they're monsters."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4941.8,"end":4951.32,"speaker":"Fr Stephen De Young","text":"Well, but within Dungeons and Dragons, you could craft a world. You could do your homebrew campaign world, I guess, in such a way that that were possible."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4951.72,"end":4957.21,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you could cast charm on all of them, I suppose, and, like, keep casting it forever."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4957.61,"end":4963.77,"speaker":"Fr Stephen De Young","text":"I'm saying you could do. Hey, they've done the Bible as a setting for fifth edition."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4964.17,"end":4968.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, let's not go there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4968.53,"end":4971.45,"speaker":"Fr Stephen De Young","text":"But I know, because my name's in the book. But anyway."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4974.09,"end":4976.41,"speaker":"Fr Andrew Stephen Damick","text":"Everyone'S going to scrambling now to look that up now."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4976.41,"end":4978.73,"speaker":"Fr Stephen De Young","text":"Yes, yes. Try and find it. It's in there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":4978.97,"end":5075.44,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, I mean, here's what I'll say to take your question a little bit more seriously, Michael, although I don't know how seriously you meant it, but to take it a little bit more seriously, I've spent a lot of time actually working on this question of dragons. And I mean, what is a dragon within a story? A dragon is by definition a demonic force that is there to sort of prove the hero. Right? So it's like saying, you know, can I preach the gospel and convert demons? The way that demons actually function within the Christian mythos is that they're the enemies of God. Like, that's our. Our only actual experience of Them. That's how they're always depicted within the story. Right. So, I mean, can I imagine some other thing happening? Yeah, I can imagine it, but that doesn't mean that that works according to, you know, what my favorite author would call the canon of canons of narrative art. Right. Like, he would. You know, I'm referring to Tolkien, of course, but, I mean, he would hate, like, the modern depictions of dragons as being, like, people's pets and friends and stuff, because he would say that's not according to the canons of narrative art. And it's not because he's some kind of hardliner about how you tell stories. It's just that there is the reason. There's a reason why this tradition of what a dragon is functions the way that it always has within legends and tales and stuff. Right? So that's why I said, what is a monster? Well, a monster is a monster. You know, like, if you read Beowulf, are you supposed to feel bad for Grendel? I mean, you might want to, but the Beowulf poet certainly doesn't. He's. He's a monster. That's what his function in the story is. So I don't know if that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5075.44,"end":5080.92,"speaker":"Fr Stephen De Young","text":"If that helps at all, Michael, but I. I object. All dragons are not. Are not chromatic."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5081.16,"end":5081.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5081.96,"end":5083.88,"speaker":"Fr Stephen De Young","text":"Metallic dragons are seraphim."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5085.32,"end":5102.56,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I. I will. Yes, I will grant you that. I will grant you that. Yes. I will grant you that. Yeah. So, anyway, all right, well, thank you very much for calling, Michael. All right, we're going to take Alexandra next. So, Alexandra, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5103.12,"end":5104.16,"speaker":"Audience Member","text":"So happy to be here."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5104.56,"end":5105.08,"speaker":"Fr Andrew Stephen Damick","text":"Yay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5105.08,"end":5105.92,"speaker":"Fr Stephen De Young","text":"You made it through."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5109.68,"end":5110.16,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5110.16,"end":5114.12,"speaker":"Audience Member","text":"Awesome. So my question is, in the story."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5114.12,"end":5121.17,"speaker":"Audience Member","text":"Of Christ healing the paralytic at the pool, we seem to get the lesson that the healing comes not from the water, but from Christ."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5121.81,"end":5123.01,"speaker":"Audience Member","text":"But we also see that it's thought."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5123.01,"end":5127.01,"speaker":"Audience Member","text":"To be an angel that is stirring up the water. Actually, I noticed I staying vigil for."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5127.01,"end":5133.01,"speaker":"Audience Member","text":"The Sunday of the paralytic, and we had the refrains like, glory and holy resurrection, O Lord, but there's also one."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5133.01,"end":5134.77,"speaker":"Audience Member","text":"Step to the Archangel Michael."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5135.49,"end":5141.81,"speaker":"Audience Member","text":"So how are we to understand this angelic work being put almost in opposition to the work of Christ?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5142.21,"end":5144.21,"speaker":"Audience Member","text":"Or is that not the way to understand it?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5144.92,"end":5168.2,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. Well, I mean, no angelic work is in opposition to Christ, right? That's not possible. Angels obey him and everything they do, they're basically sent on that mission by him. Right. So I don't know, Father. I mean, what do you think in this regard? I mean. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5168.52,"end":5213.48,"speaker":"Fr Stephen De Young","text":"So on A nerd out moment. Oh yeah, there's a huge question about that little bit in, in St. John's text about the angel coming down and troubling the water. Because if there's, there are weird textual variants there, like which text it's in and which text it isn't in, follows like none of the normal patterns for textual variants in the New Testament. Like it's in older texts and not more recent texts. It's in texts that are normally considered to be non expansionist, meaning that don't normally have added things in them and it's not in texts that do tend to have added things in them. So it's an interesting little thing there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5213.88,"end":5215.4,"speaker":"Fr Andrew Stephen Damick","text":"A crux, as it were."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5215.64,"end":5235.38,"speaker":"Fr Stephen De Young","text":"Yeah, And I won't, I won't bore you with it, but, but I was once part of the PhD seminar, like a half hour debate about that couple of verses. But because that's what you do when you work on a PhD, you argue about minutia for extended periods of time."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5236.74,"end":5239.54,"speaker":"Fr Andrew Stephen Damick","text":"Papers have to be written, dissertations have to be put."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5239.54,"end":5397.93,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, but so part of this is this story and a number of other stories similarly in the Gospels show us that there's sort of a, a normal order of things within the created order. And then there is Christ. Right? So for example, and we just read this text on Sunday a few weeks ago, there's a text where the disciples try to cast the demon out of the boy and they can't and Christ walks up and just casts the demon out. That says this kind only comes out, comes through prayer and fasting. What we don't read about Christ doing any praying or fasting, Right. He didn't have to. He wasn't saying like this is the only technique by which you could drive out this deep. He was saying for you, this is what you're going to need to do. Right. And we see something similar with the paralytic in that. Right? The paralytic from his perspective, when Christ interacts with him, says, well, the reason I haven't been healed is that when the angel comes and troubles the waters, somebody else jumps in first. That's why I haven't been healed, right. And Christ doesn't then wait for the angel to come and then throw him in the water, right? Christ just heals him because he's God, he could do that. Right. And so we tend to write. When I started this, I said there's an order of creation and then there's, there's exception to it. Most of us modern people hearing that when we Hear there's an order to creation. We think, oh, yes, scientific laws. And then sometimes miracle happen. Miracles happen. Right. And that's not the paradigm of scripture. The paradigm of scripture is there's a way that creation works. And that includes the visible and invisible creation. That includes the material creation. That includes spirits like angels and demons. Right. All of that is included. And then there are also times where God acts directly without any intermediary. So all of the healings are God's doing. Sometimes he does it through intermediaries, Sometimes he does it through an angel, sometimes he does it through a doctor or a surgeon. Sometimes he just does it directly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5399.85,"end":5400.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5400.65,"end":5424.18,"speaker":"Fr Stephen De Young","text":"And we as humans distinguish between. We say the times with intermediaries. Those are quote, unquote natural. In fact, we might not even give God all of the credit, unfortunately. Right. Because of the intermediary. And then we say the others are exceptions. But really those are all sort of of a piece. It's just a question of God not being bound by the intermediaries."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5424.82,"end":5425.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5425.82,"end":5431.7,"speaker":"Fr Stephen De Young","text":"Christ could heal through that angel and the pool, or he could do it directly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5432.9,"end":5433.3,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5434.11,"end":5615.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I recall. I think it's in one of his homilies, Saint Nikolai Vilamitovic, and I might have referenced this on the show before, I don't know. But in one of his homilies, he talks about this question of what is a miracle. And he says miracles are simply gifts from God at which men marvel. The point being that everything that is good comes from God. That every. Like there is no good apart from God, you know, there's no other source of good. He's the giver of all good things. But there's some of those gifts at which we go, whoa. And that's the stuff that we call a miracle. But. But really it's still from him, you know, so it doesn't like. I know some. Sometimes people, for instance, when they refer, they look at, you know, like a baby being born or something like this, they'll say, oh, that's the miracle of birth. And then someone will say, no, that's not a miracle. That's just normal, that's natural, whatever. But the fact that there's this kind of discrepancy between the way people refer to it, even if it's not really, truly two different ways of thinking about it. Like, the people who say birth is a miracle are not saying something supernatural just happened in front of me. Right. But the fact that there is this discrepancy is. Is kind of getting at this reality that on some level, everything is a Miracle. But really I think it's better just to see everything as a gift from God. And I like what St Nicholas says, miracles are just gifts from God at which we marvel. But sometimes we marvel at things that other people might not regard as being, quote, unquote, supernatural. Right. In the years that I served as a pastor, and even now, when I see. When I see someone who is hardened in a way of thinking or behaving truly convert, that is marvelous to me because, I don't know. I mean, serving as a priest, it's pretty easy to get kind of cynical because there's not a lot of conversion necessarily happening in front of you, you know, so it is pretty marvelous. And it feels miraculous to me when I see that kind of thing, even though it's not what most people would think of as supernatural. But, I mean, all good things come from God. All good things come from God. And I think one of the best things that we can do as Christians is to apply that in a truly pervasive way. And then when we do that, then we find ourselves, as the scripture says, in everything, giving thanks because everything is given to us from Him. Right. So, you know, whether it's an angel stirring up water and healing happening when someone connects to that, or it's just. Or it's Jesus walking up and saying, get up. The giver is the same giver in both cases, right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5615.72,"end":5616.2,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5617.64,"end":5619.08,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, Alexandra?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5619.88,"end":5620.28,"speaker":"Audience Member","text":"Yes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5620.28,"end":5626.04,"speaker":"Audience Member","text":"Thank you. And I have to say, as someone who's currently pregnant for the first time, the baby analogy is particularly apt. Thank you very much."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5626.49,"end":5684.91,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, although I'll say this, right, like, you know, a baby being born does not seem like a supernatural thing, but when you conceive for a moment, pun fully intended, that there was not this human, and now there is this human, I don't know how that works. I mean, I know how it works biologically, but like. But this is a person. It's not, you know, it's. It's not just a phenomenon. That's really interesting to me. I have four kids, and I think about the fact that they used to not exist. I don't know. That's the point where my wife and I look at each other and go, I don't know what we ever did without him or without her. How could there ever been a world without you? That's the unexplainable thing at which we marvel. So congratulations on your pregnancy. It's such a. An amazing vocation to be a mom. So God be with you in that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5685.55,"end":5686.43,"speaker":"Audience Member","text":"Thank you, Bobby."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5686.91,"end":5695.15,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, thank you very much for that. We're going to go ahead and take our second break and we will be right back on this all Q and A episode of the Lord of Spirits."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5695.39,"end":5708.2,"speaker":"Audience Member","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5708.52,"end":5711.72,"speaker":"Fr Stephen De Young","text":"That's 855-AF-RADIO."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5716.84,"end":5816.91,"speaker":"Fr Andrew Stephen Damick","text":"Hi, this is Jerry Minetos. I'm the development director here at Ancient Faith Ministries. As you might already know, part of my responsibilities as a development director is to reach out to what are called major donors and share with them the reach and influence influence of Ancient Faith Radio. Of course, I do that. And occasionally this results in a fairly large financial gift, maybe aimed at a specific AFR project or towards our general operations. Glory be to God and thank you. When this occurs, however, I'll share with you a secret. Here at Ancient Faith, we consider every donor a major donor. I wish that I could and I do try to reach out to as many of you as I can. And practically speaking, relying on a handful of affluent individuals or institutions for the bulk of your revenue is not a good recipe. Losing one or two of these supporters and you're suddenly in trouble when it comes to keeping the ministry afloat. We've never done that here at Ancient Faith. We have relied on you, our wonderful listeners who give 10, 20, 50, $100 on a monthly or one time basis. Glory be to God. Fortunately, this is the model that Ancient Faith Radio has always utilized and will continue to do reach out to you. It's one of the reasons that we choose at the station to be entirely listener supportive, would you please consider joining the many who have already committed to sustaining AFR with a modest monetary gift? We say modest, but everything is appreciated. Every little bit does so much to keep the lights on and the audio rolling. Be a participant, be a partner. Support, support Ancient Faith Radio today by clicking on Donate in the upper right hand corner of ancientfaith.com. thank you in advance for your generosity."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5819.71,"end":5835.88,"speaker":"Audience Member","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5837.08,"end":5840.32,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you, Voice of Steve. Yeah, everybody give us a call. Go ahead."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5840.32,"end":5853.48,"speaker":"Fr Stephen De Young","text":"Let me just say. Yeah, let me just say if anybody's considering a major monetary gift to a particular AFR podcaster, I could give you my PayPal. I've got. I've got student loans, man."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5855.4,"end":5860.04,"speaker":"Fr Andrew Stephen Damick","text":"Can't you just get another PhD and defer those loans for another generation or so?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5860.28,"end":5861.56,"speaker":"Fr Stephen De Young","text":"I'm already doing that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5864.57,"end":5906.35,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, everybody give us a call. It's an all Q and A episode. That's all we're doing tonight, so if you don't call us, we're just going to go ahead and go to bed or whatever it is that Father Stephen does after he hangs up. To that end, though, we're playing some of our favorite clips from big memories from the past. And I've got one more I wanted to share, so here it is. Let's play that Wayback Machine. Okay, so we're going to go ahead and take a call. And according to my call board here we have Steve calling from Staten Island. So, Steve, welcome to the Lord of Spirits podcast. Are you there? Can you hear me?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5906.59,"end":5907.83,"speaker":"Audience Member","text":"I am here. You can hear me."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5907.83,"end":5912.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah, yeah, welcome. Welcome to the podcast. So what's on your mind?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5912.99,"end":5994.75,"speaker":"Audience Member","text":"Yeah, well, thanks for taking my call. Though this might be more of a rambly comment than a question, but I'd love to hear your reactions as I try to connect some dots that I've been thinking about for a while, at least from Father Stephen, who is super based. Father Andrew, on the other hand, is a soy boy, at least according to the orthodox apologists that I follow online, who are all very stable geniuses and doing wonderful things for the church. So anyway, I want to thank you for the show because it got me to a couple of things which got me into Joe Rogan, which got me into Alex Jones, and. And it's all opened my eyes to something that's been staring me in the face for a long, long time, because I feel like all these elite secret societies, Skull and Bones, Bilderberger, the Illuminati, it finally clicked, right? Like, they're all Nephilim. And I'm glad that you guys had the courage to expose this because it's really been something that's been haunting us for so long. And I've been thinking about this, right, everything from Comet, Ping Pong and Epstein's island, places where pedophilic corporate elites are engaged in weird sexual rituals to produce new generations of Nephilim that rise through the ranks of the deep State and are currently trying to destro or one true president. And the more that I think as I learned about, like, Hollywood occultism and the liberal agenda to host drag shows in every kindergarten across the country, the more Proud I am to be abased and red pilled Orthodox Christians. And I wouldn't have been awakened to any of this without this. So sorry, that was more of a comment than a question. That's been a lot of stuff that are on my mind. I'll take my response off the air."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":5994.99,"end":6007.69,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, I mean, this is what our whole previous episode was completely about. So, I mean, yeah, you've heard us. I think it's time that people understand all this. I don't know. Father Steven, do you have any comments on this? Any actually?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6008.17,"end":6033.75,"speaker":"Fr Stephen De Young","text":"Well, I mean, I think sometimes because of the way we talk about things. Right. We're talking about the spiritual world. We're trying to tell people not to be materialists, that they sometimes take it too far in the other direction. Right. And maybe they don't understand sort of the direction application to our day to day lives. Like what our caller just laid out."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6033.75,"end":6034.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6035.91,"end":6053.31,"speaker":"Fr Stephen De Young","text":"And I mean, if you don't understand all that, I don't know how you make just your day to day decisions. Right. About how to live your life as a Christian, making basic moral choices without that grid. Right. That he just described."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6053.31,"end":6065.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Well, good for you. You get it, caller. Thanks very much for calling in, Steve. That warmed my heart right there. One of my favorite calls ever."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6065.95,"end":6077.39,"speaker":"Fr Stephen De Young","text":"As as much as I enjoyed that call, you know, we. We've replayed it now and he was kind of saying the quiet part out loud, you know?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6077.47,"end":6078.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6078.27,"end":6080.35,"speaker":"Fr Stephen De Young","text":"Like it's a little too on the nose."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6080.63,"end":6082.95,"speaker":"Fr Andrew Stephen Damick","text":"Maybe we shouldn't have played that one. It reveals a little."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6082.95,"end":6095.03,"speaker":"Fr Stephen De Young","text":"Like, I do have to say though, I know you like to follow the fast really strictly and that kind of restricts your food options. But you could lay off the soy a little bit."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6095.27,"end":6096.47,"speaker":"Fr Andrew Stephen Damick","text":"I will keep that in mind."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6096.87,"end":6097.43,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6097.99,"end":6104.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's been a while since I've had tofu, so I feel like I'm making some progress here."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6104.15,"end":6104.87,"speaker":"Fr Stephen De Young","text":"That's good."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6104.87,"end":6105.67,"speaker":"Fr Andrew Stephen Damick","text":"That's. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6105.67,"end":6106.7,"speaker":"Fr Stephen De Young","text":"Since that episode at least."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6107.25,"end":6110.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I've never been into edamame. That's soy, right? I don't know."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6112.21,"end":6113.81,"speaker":"Fr Stephen De Young","text":"I would eat that kind of stuff anyway."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6115.65,"end":6124.45,"speaker":"Fr Andrew Stephen Damick","text":"All right, we're going to go ahead, take some more calls. So we've got Yvonne calling. Yvonne, welcome to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6125.17,"end":6129.01,"speaker":"Audience Member","text":"Yeah, hi. Thank you for taking my call. Can you hear me?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6129.25,"end":6130.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6130.65,"end":6131.13,"speaker":"Audience Member","text":"Oh, hi."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6131.13,"end":6131.37,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6131.37,"end":6228.12,"speaker":"Audience Member","text":"Thank you, Fathers. Okay, so this is going back to earlier in the show when you were talking about Adam and Eve. Eve. I just kind of wanted you to expand on that a little bit. Like, it sounded like you were saying that they showed poor judgment and that they were immature and that Eve, you know, she saw this thing as good, right? So, and I haven't had this question for a while in my head. And I also, I don't want to be guilty of like false teaching to my children because the way I've explained it might be incorrect. But was she being selfish, righteous, or were they both being self righteous in that they were using their own bodies to like take this, whatever it was, right? And to take it into herself and to say, oh, it looks good, it tastes good, it's good. Like, you know, they're immature, they're like children, right? They're using their bodies. Because the comparison that I have always given to my kids for a while, which could be wrong, I hope it's not, is that like if a 2 year old was in their bedroom, say, right, and they hear a bird and it's pleasing to the child's body, right? Like, oh, my eardrums sound great. You know, it would be proper for the child because the bird's not bad, right? But it would be proper for the child to say, mom, dad, look at the bird. What should be my next step? Rather than to just say, oh, it sounds good, and jump out the window, you know what I mean? And fly on the bird's back. Because that's not going to work. So was that like an example of self righteousness where she was kind of just, am I off on that?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6230.2,"end":6252.58,"speaker":"Fr Andrew Stephen Damick","text":"I'm tracking with you. I think that that works. And I think part of, you know, a big piece of the scenario, right, is that Adam and Eve did not encounter the fruit completely, you know, anew, right? God had told them, don't look at."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6252.58,"end":6253.5,"speaker":"Audience Member","text":"It, they could touch it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6253.5,"end":6255.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't eat that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6255.86,"end":6274.53,"speaker":"Audience Member","text":"Yeah, she ingested it. She took it into her body. But like, I mean, you know, I'm assuming she could have just looked at it, touched it, you know what I mean? Like, and also because, like, there's so much symbolism when you say the fruit. Like, fruit could be anything, like the fruit of the spirit. That's not like something you eat. That's like a product of."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6274.53,"end":6277.77,"speaker":"Fr Andrew Stephen Damick","text":"You know what I mean? So, like, yeah, that's fruit used as a metaphor."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6278.17,"end":6279.85,"speaker":"Audience Member","text":"Yeah, thank you. Right, Exactly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6279.85,"end":6297.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, like I said, they had this command from God, don't eat it. Right, yeah. But at the same time, of course, Eve was under deception. She believed what the serpent told her, right? He was convinced, convincing her to do this thing."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6298.58,"end":6307.06,"speaker":"Audience Member","text":"Right. Would they have? Yeah, right. She was under deception. So, so is my analogy a bad one?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6307.7,"end":6311.54,"speaker":"Fr Andrew Stephen Damick","text":"I mean, every now to say that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6311.54,"end":6325.15,"speaker":"Audience Member","text":"She was being self righteous or to compare her to a self righteous, you know, to say like, oh, yeah, well that's an example of self righteousness. Or to say that if a person is being self righteous, well, they're being silly. Like how each Eve was like, is that a bad connection that I'm making?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6325.55,"end":6332.47,"speaker":"Fr Andrew Stephen Damick","text":"I. I wouldn't use the word self righteous because to me that just right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6332.47,"end":6335.63,"speaker":"Audience Member","text":"Or wrong, like she said, oh, that's the right direction. But it wasn't."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6336.35,"end":6355.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, that's. She's deceived. She's deceived. She's wrong about this. Right. But, but self righteousness is more a sense of judgmentalism towards other people. And you know, where that's not really in this scenario at all. Yeah, yeah. So I don't know. Father Stephen, is there anything you wanted to add or subtract?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6356.65,"end":6360.01,"speaker":"Audience Member","text":"Multiply, divide Quickly, quickly."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6360.01,"end":6379.27,"speaker":"Audience Member","text":"Can I just say this? Because when you're being self righteous, aren't you using yourself rather than God to judge? Like, isn't that what that means? See, I'm off, right? Because I thought that's what self righteous meant. I thought like, if I'm being self righteous, I'm saying, well, I don't like that, but maybe God does. You know what I mean? Like, isn't."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6380.79,"end":6386.31,"speaker":"Fr Andrew Stephen Damick","text":"It's that you think you're right because you're you right. You know, I'm the one who's right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6386.87,"end":6388.31,"speaker":"Audience Member","text":"Yeah, like you're using."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6388.55,"end":6472.33,"speaker":"Fr Stephen De Young","text":"Yeah. So I mean, you're not. If you're off a little, you're not far off, right. That a self righteous person uses their self as the measure of righteousness rather than accepting like for example, God's measure of what righteousness is. Right. And so, yeah, I don't think your example's a bad. I mean, you're talking to kids, right? So I mean, you don't need to grow. Oh, but I mean, when you're talking to kids, you don't need to convey every nuance. Right. Of like everything. Right. But you're trying to get across sort of a main point. And so I think your example is good in terms of communicating the idea that it wasn't that the tree or the fruit was evil, that it wasn't just an arbitrary rule that God made, but God made this rule to protect them. And he had to make the rule to protect them because they didn't know for themselves Right. They weren't able to judge that correctly for themselves. The example I usually use is you tell a little kid not to go play in the street. Right. And to the kid, it may seem like, well, hey, if I run out the street, I could run farther than if I just run around my yard. And they like running, so it might seem good to them to go run in the street. But you know that trucks come down the street, they might not understand that. Right. That they could get hurt doing that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6472.33,"end":6473.09,"speaker":"Audience Member","text":"Right, right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6473.41,"end":6473.73,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6473.73,"end":6476.01,"speaker":"Fr Stephen De Young","text":"So I think that's a similar example to jumping out the window."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6476.01,"end":6478.81,"speaker":"Audience Member","text":"Right, right, right. Exactly. Like you need a boundary."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6478.81,"end":6496.64,"speaker":"Fr Stephen De Young","text":"Yeah, right. That we don't do what seems right in our own eyes. Right. Because in our humility, we accept that I don't always know what's good and what's bad for me. We trust the judgment of someone else. We trust God's judgment ultimately."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6497.36,"end":6505.07,"speaker":"Audience Member","text":"So if I judge somebody, but it's according to the Bible, I'm not really judging them. I'm just applying God's judgment."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6505.54,"end":6510.42,"speaker":"Fr Stephen De Young","text":"Well, no, because God didn't give you the Bible for that purpose."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6510.9,"end":6511.54,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6512.02,"end":6541.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a difference between. There's a difference between discerning what is right and what is wrong. Right. And. And. And maybe being the person. For instance, if you're a parent. Right. Part of your task is to correct your children, to teach your children. Right. But that's a different thing than simply observing someone doing something that is wrong and deciding that they're damned or unworthy of God's love or whatever in your heart, you know, that's a different kind of judgment."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6541.86,"end":6597.7,"speaker":"Audience Member","text":"If you say, is there a. Okay, so then real fast. And this is my last question, I promise. If I condemn somebody in my heart, is that the same as judging them? And also if I say, oh, well, let's take, for example, homosexuality. Homosexuality is good. Good. Is that also judgment? Like is judgment only because to me, you're judging. If you say it's good or it's bad. So the person who says, well, homosexuality is fine, is as judgmental as the one who says homosexuality is bad and is saying, well, it's bad. Is that the same thing as condemning them? Because, for example, when the woman is before the Lord and he says, does anyone here condemn you? And she says, no. He says, neither do I. That's. He's saying, I don't condemn you. Is condemnation the same thing as saying, well, that's bad. End of it? That's my last question."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6597.94,"end":6633.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a difference between discerning the rightness or wrongness of an action and condemning a person who is doing something that is wrong. Right. There's a difference between saying it is wrong to engage in homosexual acts. That is true. That is simply true. That is not being judgmental. That's discerning what is right and wrong. But if you say this person who is doing homosexual acts is damned to hell, that is not within our purview to do. We are not given that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6634.17,"end":6636.01,"speaker":"Audience Member","text":"So we don't condemn a person."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6636.09,"end":6637.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. Absolutely not."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6638.06,"end":6640.06,"speaker":"Audience Member","text":"Behavior. Got it. Okay, I understand."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6640.06,"end":6640.54,"speaker":"Audience Member","text":"Thank you."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6640.54,"end":6640.98,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6640.98,"end":6641.26,"speaker":"Audience Member","text":"Now."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6641.34,"end":6652.94,"speaker":"Fr Andrew Stephen Damick","text":"All right. I'm glad that was helpful. Okay, well, thank you very much for calling, Yvonne. And we have Marcus next. So, Marcus, welcome to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6654.06,"end":6662.46,"speaker":"Audience Member","text":"Hi, thank you so much for taking my call. So my question is about the connection between idolatry and sexual immorality."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6662.78,"end":6663.34,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6663.67,"end":6734.62,"speaker":"Audience Member","text":"I think. I think you mentioned in the past that, you know, either very closely related or identical. But the way I'm thinking about it is that, you know, God is creator, God is father. So I participate in that, you know, by becoming a father and, you know, sexual acts that would lead to that. And when I have sexual acts that are different than that, then I'm, you know, I'm being Zeus or I'm being the weird Egyptian God who, you know, disturbed himself with his hand or whatever. So, yeah, I'm just trying to understand what is the exact relation between those two and then kind of related to that. Like there's all this imagery about God being a jealous God about, you know, the bride and the bridegroom and, you know, like, as a red blooded guy, it just kind of strikes me as kind of strange. Like, is it saying that God is like the active partner and I have to be the passive partner? Like, it sounds odd to me. I don't understand what I'm supposed to do with that image."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6735.82,"end":6820.23,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. Well, you know, with regards to the first thing, the thing that really links idolatry and sexual immorality in particular, is that both are about serving oneself. Right. So the point of idolatry, you know, the way that it works. Right. Is to control a God so that the God will do for you what you want. And sexual immorality is exactly the same. Right. Which is, you know, why there's so many commands about both of these things, of course, in scripture and how they're almost always associated together in scripture. Right. And, you know, God creates man's capability of worship to be directed towards him. He creates man's capability of sexual reproduction to be directed towards reproduction, right? That is its telos. It's its purpose, you know, and, and so there's not necessarily a mechanistic cause, causative, you know, causal relationship between these two things. But they always go together, right? They always go together. And, you know, we, we see that again and again in scripture. And, you know, so we've talked about that, of course, many, many times on the show. I'm not as clear on, on the second, but before we get to that, though, I don't know. Father Steven, do you want to add anything to that, that link between idolatry and immorality?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6822.07,"end":6871.14,"speaker":"Fr Stephen De Young","text":"Well, there's also the connection of the body, right? Because of course, idolatry is the body of a God or is seen as that that is used to then manipulate and control the God. And in the same way, of course, our body, especially if we're Christian, St. Paul makes this point, is the being the temple of the Holy Spirit, having the spirit of God dwelling within us, right. Being members of the body of Christ. That what we do with our. Our body in terms of sexual immorality is not just sort of a question of moral uncleanness or moral impurity, but also of ritual impurity and sort of sacrilege."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6871.94,"end":6872.34,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":6873.23,"end":7006.46,"speaker":"Fr Stephen De Young","text":"And so that's another way in which, in addition to what Father Andrew said, in which those ideas are sort of united in the scriptures in terms of the second part, the analogy that God uses beginning in the Old Testament, and then it sort of blossoms into the idea of the church as the bride of Christ in the New Testament, but of Israel and then Israel and Judah as sort of his bride, right. Or his wife. That's really. That's culturally steeped, right? Because of course, when we're talking about our relationship with God, we are definitely the. The partner with the least power, right. In the ancient world of men and women, women had the least societal and social and economic and every other kind of sort of power to make things happen, right? And so they. Women were entirely dependent in the ancient world on the men in their lives, first their father and then later their husband. And so this is why widows and orphans had to be the subject of sort of special protection. Because, you know, legally in the ancient world, a woman couldn't give testimony in court. Even so if someone wronged her, she couldn't even testify on her own behalf. So that put them in this position. And so part of the analogy that God is using is that when God first comes to us and offers us his love and everything that comes with that. Everything else he offers to us, we are essentially powerless. Right. These aren't things that we could do for ourselves if left to our own devices. Right. These are gifts that he gives us. And in the same way, Right. That what he wants. Again, continuing the analogy, all he asks for from us in return is our love and our faithfulness."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7006.61,"end":7006.85,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7008.21,"end":7055.26,"speaker":"Fr Stephen De Young","text":"Right. And so the comparison that's made of the Old Testament prophets is to a wealthy man who goes and finds some woman in destitution and poverty and marries her and gives her, you know, shares with her everything he has, and then she goes and is unfaithful to him. Right? She goes and is. And is disloyal to him. So it's not so much that we are completely passive in salvation. Sorry, Calvinists, but it's that what we do in salvation is not the providing of the blessings."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7055.58,"end":7055.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7056.06,"end":7114.47,"speaker":"Fr Stephen De Young","text":"Of the theosis. Right. This is. This is God's doing. But we respond with love and with faithfulness. And love and faithfulness are not emotions. Right. Any. Any married person. I don't know if. If you're married, but any married person could tell you that love and faithfulness within a marriage is not primarily about your feelings on any given day. It's about what you do every day. And the same is true of our relationship with. With Christ. Right. That love and faithfulness is about what we do every day, and that those things that we do out of love and faithfulness are our part in working out our own salvation. So we're not passive. But this isn't a 5050 split. It's not even a 9010 split. I mean, you'd have to go out to a lot of decimal points to represent it in numbers."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7116.31,"end":7118.63,"speaker":"Fr Andrew Stephen Damick","text":"And even then, yes, it may be."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7118.63,"end":7120.71,"speaker":"Fr Stephen De Young","text":"A limit function approaching zero. Right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7123.19,"end":7125.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So does that make sense, Marcus?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7126.55,"end":7136.71,"speaker":"Audience Member","text":"That makes a lot of sense. You've given me something to chew on. I'm sure I'll call you again in the future. Thank you for all you do and all the content you provide."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7137.11,"end":7147.05,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, thank you, and thanks for listening. All right, we've got another call, and we've got Nathan calling. So, Nathan, welcome to the Lord of Spirits podcast. Speak."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7149.13,"end":7197.02,"speaker":"Audience Member","text":"Thank you, Fathers. I just had a quick question. A little confusion over your previous episode on the Tower of Babel. When y' all first talked about it way, way back in a long, long ago, it's. I thought I understood that the fallen angels I was calling, the overseers of the nations, had seduced them away from God. But then when I was listening to the episode, y' all going in detail, it sounded like it was people that was tempting them to. To set themselves up as false gods. And so I was wondering, you know, was which side was kind of at fault there, or was it some sort of like mutual feedback loop of the two groups?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7199.98,"end":7208.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay, I'm not sure I totally understand the question, but, Father, I do. All right, good. Maybe I can understand it by, let's."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7208.02,"end":7221.01,"speaker":"Fr Stephen De Young","text":"Say, so in large part, it's a feedback loop. But St. Dionysius the Areopagite, for example, wants to make it very clear that that feedback loop starts with human instigation."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7222.29,"end":7222.93,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7223.41,"end":7225.89,"speaker":"Fr Stephen De Young","text":"That God did not assign fallen beings."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7226.29,"end":7226.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7226.61,"end":7227.97,"speaker":"Fr Stephen De Young","text":"To oversee the nations."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7228.37,"end":7229.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7229.09,"end":7231.57,"speaker":"Fr Stephen De Young","text":"Or to tempt them or to lead them astray."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7232.29,"end":7232.69,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7232.85,"end":7237.33,"speaker":"Fr Stephen De Young","text":"So this is the human. The humans were the motivating factor."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7238.85,"end":7260.15,"speaker":"Audience Member","text":"Okay, that's what I was missing. So one quick follow up then. Does this play into or affect the, you know, later part in the New Testament where, you know, it is said that we will judge angels or, you know, that just seems linked to me as well."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7261.03,"end":7309.66,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, I. Yeah, yeah. But also we should say that judge is not just a matter of, like, rendering a verdict like you did a bad thing. You know, it's. It's, you know, as we've said many times in the show, right, Establishing justice. This is what judging is, is putting things in order. Right? So, you know, when I go in my backyard and I mow the lawn, I'm establishing justice, I'm judging the lawn, Right? That's, you know, to use that same language. So that judging function of human beings in the life of the age to come is about. On. It's an ordering function, Right. So that's also a big piece of what's going on there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7310.94,"end":7313.9,"speaker":"Fr Stephen De Young","text":"So you're cutting down the grass with the scythe of torment."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7314.14,"end":7315.74,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, totally."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7316.46,"end":7317.18,"speaker":"Fr Stephen De Young","text":"That's right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7318.06,"end":7319.5,"speaker":"Fr Andrew Stephen Damick","text":"Actually, if I used a scythe, I'll."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7319.5,"end":7321.82,"speaker":"Audience Member","text":"Break out the weed trimmer. I'll kill you there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7322.14,"end":7345.58,"speaker":"Fr Andrew Stephen Damick","text":"Here you go, honey. I'm going to go get the weed whacker and execute judgment upon this yard. Absolutely true. All right, well, thank you very much for calling, Nathan. We have Cameron calling, I think, all the way from the Great White north, so. Cameron, are you there? I'm not sure Cameron is connected."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7345.74,"end":7347.5,"speaker":"Fr Stephen De Young","text":"Speak to us, Cameron. Who did this to you?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7350.46,"end":7351.9,"speaker":"Audience Member","text":"Hello, Father, can you hear me?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7351.9,"end":7355.9,"speaker":"Fr Andrew Stephen Damick","text":"Cameron? Yes, we hear you. Welcome to the Lord of Spirits podcast. We're listening."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7356.86,"end":7367.58,"speaker":"Audience Member","text":"All right, thanks, Father. Well, first of all, thanks for the podcast. My spiritual father introduced me to orthodoxy and heterodoxy and it's been downhill ever since. So thanks so much for that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7367.58,"end":7369.34,"speaker":"Fr Andrew Stephen Damick","text":"Have you hit rock bottom yet?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7372.22,"end":7378.38,"speaker":"Fr Stephen De Young","text":"Hopefully he mostly introduced you to orthodoxy, less to the heterodox. Indeed."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7379.34,"end":7448.36,"speaker":"Audience Member","text":"Okay, so I got a quick two part question for you. With what's happened with Roe in the US there's been a lot of talk of abortion north of the border too. First, and quickly, I've seen people talking about how the Old Testament didn't necessarily disallow abortion. And I'm kind of like, you guys are read the Psalms, man. And I'm thinking like they're assuming that life in the womb isn't the life. So the Ten Commandments, I'm guessing, don't necessarily apply in their view. So I'm curious, with your father's knowledge of the Old Testament, we'd say to that. But second, and maybe more importantly or something I've been thinking about more lately is if we have to legislate abortion to stop people from doing it, have we already lost? I've been thinking about this a lot while reading Timothy Pettico's book about the ethics of beauty and how we must take a beauty first approach to things. Beauty first and goodness and truth. So like, you know, for yelling at people or setting up protests or putting up signs against abortion, really it seems to me like a truth first approach and likely why the battle's being lost. And if all this effort was put into maybe a beauty first approach, what would that look like? Hopefully my question makes sense."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7451,"end":7607.9,"speaker":"Fr Andrew Stephen Damick","text":"I think so. I mean, there's a bunch of different angles from this to look at this question. Right. And I would say also that there are multiple angles from which to work on it. And some people are going to be good at some angles and some people are going to be good at others. Right? Number one, I do believe, I very much do believe that it is right and proper for there to be laws saying not to kill people. Right? This is something I think it is right for the government to do is to restrain public evil. Now, I don't think that governments need to pass laws against every single possible evil, right? I mean, it's evil if someone looks at another person and lusts in his heart. That's evil. I don't think that should be against the law, right? It's evil. It's bad for your soul, it's bad for their soul. Right? But I don't think it needs to be against the law. But it is appropriate in Christian tradition, in the Scripture, for governments to restrain public evildoers, right? If someone is murdering other people, that it's appropriate for the government to stop that. Now that's not to say that there isn't work to be done on building communities and nurturing human beings and addressing poverty and all this other stuff that we know mitigates these kinds of public acts of evil if these other things are worked on too. Right. You know, like for instance, I have, I have four kids. And one of the questions, if one of the kids is acting out, one of the questions that we will often ask is, have you eaten? Because a cranky child is often a hungry child is often an angry child. And an angry child might well be a violent child. But at the same time, if one of the children is beating up on his brother, it is absolutely appropriate for me to go and grab hold of his arms and make him stop doing that right now. I may then go lead him to say, why don't you have some dinner? Or why don't we take a moment to think about what we're doing and why this was not actually accomplishing what you thought it would. So I understand, I have not read Dr. Patizis book. I'll just say that. But I understand the idea of beauty first. Right. Because the point that he's trying to make is how do you change souls?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7607.97,"end":7608.37,"speaker":"Fr Stephen De Young","text":"Souls."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7609.01,"end":7702.97,"speaker":"Fr Andrew Stephen Damick","text":"How do you change souls? Which is ultimately the goal. Right. As Christians. But at the same time, if someone has a loaded gun in his hand and is blowing people away, the first thing to do is stop him. And so with regards to this question of abortion, I do think that it's appropriate that there be laws against abortion. Now I'm not a politician, I'm not a doctor, I'm not a maker of laws, not a legislator. And so I can't, I don't have the ability to say what the best kind of law about it would be. There's a lot of opinions about that. Right. But I definitely believe that it's appropriate for laws to be passed against abortion. I don't know if that answers your question. But yeah, I think it's like, for instance, one of the big accusations that sometimes pro lifers get here in the US is they'll say, oh, you're just pro birth, you know, you don't care about women, you don't care about children, blah, blah, blah, blah, which is a huge lie. Almost all of the pro life activists that I know are actually very strongly engaged in helping people deal with all kinds of other related problems. But even if someone was just trying to prevent children from being killed, in the womb. I think that's pretty laudable. If someone is just trying to address one kind of evil, that doesn't mean they don't care about other evils. Right, but, but, but, yeah, so. So anyway, I don't know. Father Steven, you want to, you know, weigh in on into this?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7703.37,"end":7706.41,"speaker":"Fr Stephen De Young","text":"Get ready for attempt to get myself canceled number 27."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7706.57,"end":7707.13,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7708.33,"end":7717.93,"speaker":"Fr Stephen De Young","text":"I think this whole discussion is framed incorrectly, and I think it reveals deep pathology in American society."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7718.71,"end":7719.63,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, absolutely."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7719.63,"end":7728.63,"speaker":"Fr Stephen De Young","text":"So on one hand, this will be the less controversial part. Let me. Let me talk to. Let me talk to our radlib friends."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7732.23,"end":7734.87,"speaker":"Fr Andrew Stephen Damick","text":"So they're not listening to this podcast."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7735.59,"end":7736.47,"speaker":"Fr Stephen De Young","text":"You never know."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7736.87,"end":7737.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7737.59,"end":7738.15,"speaker":"Audience Member","text":"You never know."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7739.67,"end":7771.81,"speaker":"Fr Stephen De Young","text":"And let me. You know, part of this is just asking questions that don't get asked. Right. So if we take their assertion, for example, at face value, that abortion is health care. Right. Why is that the only form of health care that they want to pursue to be available at no cost to poor women and women of color in this country? If you're pro choice, doesn't that require you to give people multiple choices, not just one?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7773.13,"end":7773.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7773.93,"end":7839,"speaker":"Fr Stephen De Young","text":"And don't talk to me about rights, because we all know that every bourgeois white woman in this country has always been and will always be able to get an abortion if she wants it. So they're not fighting for the rights for those people to get abortions. They're fighting for poor women and women in color who get pregnant to have precisely one option, and that's to get an abortion. And they use, use. And this is both sides. Both sides use every lever of shame and humiliation this culture has to offer against poor women who get pregnant, calling them welfare moms, calling them leeches, calling them lazy. Right. Our culture does not value children. Our culture views children as a luxury item that certain people of a certain social standing from a certain cultural background get to have. And if other people dare to. Right. They're creating a societal problem. And the answer to that problem for our radlib friends is to kill the child."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7840.6,"end":7840.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7840.92,"end":7843.24,"speaker":"Fr Stephen De Young","text":"Now, here's the part that may get me more canceled."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7843.4,"end":7843.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7845.08,"end":7849.72,"speaker":"Fr Stephen De Young","text":"The other side sees making abortion illegal as the solution to the problem."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7851.17,"end":7851.41,"speaker":"Audience Member","text":"Right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7852.85,"end":7866.45,"speaker":"Fr Stephen De Young","text":"Right. And I know lots of people who do lots of things for charity. I know lots of people even who have adopted children. And they're doing good things, and those are wonderful things, but those don't solve the problem. You can't adopt all the kids."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7867.41,"end":7867.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7868.13,"end":7901.18,"speaker":"Fr Stephen De Young","text":"Your charity donation cannot pay for prenatal and postnatal care for every pregnant woman. In this country who can't afford it. So if you want to actually solve the problem from either side, we have to make systemic changes in this country and in our culture so that we value children and we value families. And so every pregnancy is not just okay, is not just unable to be terminated, but is actually valued and loved by the whole culture, the whole community, such that we're willing to sacrifice something."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7901.41,"end":7901.65,"speaker":"Audience Member","text":"Thing."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7901.97,"end":7960.34,"speaker":"Fr Stephen De Young","text":"I'm willing to sacrifice something. We're all collectively willing to sacrifice something to try to help this child come into the world. And we're. Rather than shaming this mother who dared to get pregnant, we're going to honor her and protect her and help her again on a systemic basis across the board, not just me. Doing this with one person, that's a good start, but it's not enough. And if we did that, if we made those changes in this country, abortion literally would not be an issue because, number one, there'd be no demand for it, or almost none. And what little demand there was, we could probably safely deny at that point. So I think we approach the whole issue in the wrong way. Arguing about whether it should be illegal or legal or illegal for me is the wrong question. We have to examine the pathology in our society that has led to us having the abortion rate. Rate we have, and try and do something to fix it. So there's my rant. Cancel."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7960.34,"end":7967.22,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, as the grand inquisitor of ancient faith ministries, I'm not going to cancel that. I agree with every single word. So there you go."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7967.22,"end":7968.06,"speaker":"Fr Stephen De Young","text":"It's white there."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7968.94,"end":7978.38,"speaker":"Fr Andrew Stephen Damick","text":"Well, tough. I don't. I don't know if any of that's helpful to you, Cameron. I hope so."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7978.54,"end":7984.02,"speaker":"Fr Stephen De Young","text":"But I. I think. Rant aside, I think that's what that kind of beauty and truth approach means."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7984.5,"end":7985.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7985.38,"end":7988.02,"speaker":"Fr Stephen De Young","text":"Seeing the child in the womb as beautiful."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7988.66,"end":7989.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":7989.94,"end":8003.62,"speaker":"Fr Stephen De Young","text":"And wanting to protect and nurture it, and the mother and all of us coming together to nurture the child. I don't think that either telling the woman who can't afford to have a child to kill it, or just saying, yeah, you can't kill it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8004.26,"end":8004.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8004.82,"end":8027.71,"speaker":"Fr Stephen De Young","text":"And hopefully you'll come into contact with someone like me who will try to help you. Maybe, maybe not. I don't think either of those really do the job. And I don't think they're based in beauty or truth. One's based on trying to punish injustice, and the other one is. Is based on basically wanting to sweep it up, Sweep a problem under the rug."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8028.11,"end":8033.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Well, does that help, Cameron?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8034.2,"end":8034.8,"speaker":"Fr Stephen De Young","text":"Yeah, that's Great."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8034.8,"end":8035.4,"speaker":"Audience Member","text":"Thanks, Father."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8035.8,"end":8037.64,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Awesome. Thank God."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8037.96,"end":8041.16,"speaker":"Fr Stephen De Young","text":"All right, well, he's canceling me. I could tell from the tone. No."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8042.92,"end":8052.6,"speaker":"Fr Andrew Stephen Damick","text":"No. You know, Canadians are always that polite. That's just required of them. Yeah. Oh, yeah, yeah, yeah, yeah. All right, well, we've got Jack calling."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8052.92,"end":8054.44,"speaker":"Fr Stephen De Young","text":"You get to follow that. Jack."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8054.68,"end":8061.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, from North. From North Carolina. So, Jack, good to hear. Hear from someone from the old north state."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8063.99,"end":8064.63,"speaker":"Fr Stephen De Young","text":"Indeed."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8066.47,"end":8071.35,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I lived in North Carolina for 11 years, so you have my attention."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8072.79,"end":8074.07,"speaker":"Audience Member","text":"It's a wonderful state."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8074.79,"end":8075.91,"speaker":"Fr Andrew Stephen Damick","text":"It is, it is."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8075.91,"end":8139.13,"speaker":"Audience Member","text":"Thank you for taking my call. So my question for you guys tonight is sort of about the role of doctrine in the church. You guys have spoken a lot about, I guess, the matter of intellectual understanding and in your discussion of the Bible and so on. And sometimes to me, it seems like you guys are. I'm not trying to discredit you guys or anything, but it sometimes comes across as, oh, doctrine is secondary to the life of the church or living the life in Christ. And I understand that because you have the matter of if someone like a child or someone who is mentally incapable of understanding things like doctrine or reading the texts of the. Of the church and understanding them and so on. So I guess my question is for you guys, what is the role of doctrine in the church and of understanding the faith?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8140.73,"end":8256.12,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. And I will say this to my own, you know, not to just refute what you said, but I do have to point out that in my first book, like, the first chapter is literally titled Doctrine Matters. So I feel like I'm on record as saying that doctrine matters literally. But the question is, how does it matter? In what way does it matter? Right? So I found a. There's a. An essay, and I'm blanking on the title of it now, but there's an essay by Father George Florovsky in which he talks about three levels. And he says that they're very interrelated and that. That the lines between them are not. The borders between them are not super clear. But he talks about three levels. He talks about dogma, doctrine and theology. Okay, so. And the way that he defines them is. Dogma is those things that there really is zero compromising on, right? These are the things that are the sine qua non. This is what the church believes, right? This is what the church, you know, the core things that the church believes and teaches. Doctrine is the way that you teach dogma. So that can have some variation, right? There are different ways of teaching the same dogma. As long as the Same dogma that's acceptable. And then theology is reflection and application of these things. This is essentially the way that Florovsky defines these things. And I think that while those are not absolute definitions, and he says that, I think that that's a useful way of thinking about it. Right. So one clue to this is, for instance, in Acts chapter 15. That's right. Isn't that when the apostolic council happens, Father. Acts 15."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8256.76,"end":8257.24,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8257.64,"end":8446.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, the decrees that they give, it actually says this in the scripture, the word that's used is the dogmas, the dogmas of the apostles that are distributed, you know, that are passed around and, you know, you know, don't, you know, don't engage in idolatry, don't engage in sexual immorality. Right. And like, this is their dogma. This is the first dogma in terms of conciliar dogma. Right. And it's precisely instructions on things to do. Right. And the way that dogmas that we might think of as being more conceptual, Right. Like that, you know, okay, Christ is fully God, fully man, one person and two natures. Right. The kind of Chalcedonian formula, some people will look at that and sort of draw that out from this question of things that you should do. The reason why, why that matters and the way that it gets applied is especially in the way that we worship and the way that we pray. Right? So like the example, one of the examples I give is if you have a really wrong belief about somebody, let's say you think that I'm a pathological liar, right. If you believe that, that everything I say is a lie, that I'm just constantly trying to deceive you, then the way that you relate to me is going to be different from if you didn't believe that whether your belief about me is true or not, not, it's going to alter the way that you relate to me. And so if we have wrong beliefs about who God is, that can alter the way that we relate to him, Right? So that's one of the ways in which doctrine applies in the church. But in many ways, it kind of depends on which doctrine you're talking about, right? So the doctrine that the Eucharist is truly the body and blood of Christ, that gets applied in another kind of way. You know, there's. There's multiple ways it gets applied. For instance, the way that the priest and the deacon clean up after the Divine Liturgy is one of the ways that that gets applied. The way that people receive Holy Communion is another way that that gets Applied. Right. So it is. Absolutely. We believe the doctrine matters, but. But at the same time we should say that, that the reason why it matters is because of how it affects what you do. And the reason why we know that that's why it matters is because, as it says in Scripture, that Christ is going to judge every man according to his works, according to his deeds, according to what he is doing. Right. It does not say that Christ is coming to judge every man according to his correct opinions. Opinions are important because they affect what you do. Right. So that's what I would say in response to that. Absolutely, doctrine matters. But the reason that it matters is because it actually has real world, it actually has practical effects. It's not just because of a sort of set of theories that you have to get it right. It's about doing right. And that's why doctrine matters, is because it affects what you do. It's sort of the roadmap for what you do. Father Steven, do you want to add to that or whatever?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8446.62,"end":8473.15,"speaker":"Fr Stephen De Young","text":"Yeah. So I approach that from kind of a different angle in that it has to do with the idea of the relationship between ideas and practices. And we as modern Western people tend generally to be kind of idealists in the sense that we see ideas as coming first and then those ideas being implemented in praxis."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8474.19,"end":8474.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8475.31,"end":8520.63,"speaker":"Fr Stephen De Young","text":"And the truth is actually the exact opposite. Ideas emerge from praxis, from practices. The practices come first thing, rituals come first, then belief, beliefs emerge out of those. And so in the same way that the actual practice and worship and life in Christ comes first, doctrines emerge from that. And as they emerge from that, they serve to codify, to protect, to guard. Right. To further define that and preserve that practice and that way of life. Right. To potential threats to that way of life."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8521.03,"end":8573.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'll just say what, I'll add to what you're saying just to add another piece of context to that. And this is one of the things that I've observed, I'm sure you've observed it too, is that conviction follows conditioning. Right. That people tend to hold fast and believe strongly about things because they. They've been engaging in it rather than the other way around in terms of the way that the human actually functions. If you go to a certain kind of church all the time, you're going to tend to believe that that's the place you should be, and you're going to have all kinds of arguments as to why it's the true church or why it's the right church or whatever it might be. So, yeah, I absolutely agree with you, Father, by the way, I should say, and I don't think you were disagreeing with me, but from another angle, like I said. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8573.91,"end":8672.51,"speaker":"Fr Stephen De Young","text":"And so if you look at, for example, Christian communities outside the Orthodox Church that we would say have kind of gone off the rails, right. They don't change their doctrine first and then implement the change doctrine in practice. It goes the exact opposite way. They change their practice, they change their praxis, they change who they ordain, or they change how they worship, or they change those things. Those happen first and then over time, the doctrinal changes emerge as a result of the change of worship, the change of practice. Right. The change of their view of the ministry changes because they change who they ordain, not vice versa. And so this is very important when we're addressing, for example, some of our radlib friends who are in the Orthodox Church who will, for example, say, well, doctrine, right? We're to love everyone, right? Love your neighbor as yourself. We share the love of God. This is what we're about. They take this idea and they say, so doesn't that mean we should change our praxis here, there, right. What we consider a sin, what we do here and there, right. And see, they're proceeding on that idealistic basis. They're trying to argue from the idea to the praxis. But the truth is that our understanding of what God's love is and what love for neighbor is, is something that emerges out of our collective experience of God. Right. We know what love is because we've experienced Christ's love of us."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8675.56,"end":8675.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8675.96,"end":8688.52,"speaker":"Fr Stephen De Young","text":"That's the love that we're called to show to other people. So what love is, is defined through our praxis. And so it can never be pitted against our praxis, Right?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8688.52,"end":8688.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8688.88,"end":8689.8,"speaker":"Fr Stephen De Young","text":"Because it comes after."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8691,"end":8731.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, relatedly, like this is another thing that Florovsky said. He said that, that charity, you know, which is good old fashioned word for love, right? Charity should never be set against truth. That these are not opposing things. You know, becoming more dedicated to truth should not make you more uncharitable. Becoming more charitable should not make you not care about truth. That really. Because Christ is the one who is, you know, God is love and Christ is the truth. Right? So it's all one. You can't pull things out and say, we'll do this and then we don't have to worry about that, you know? So does that help, Jack?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8732.93,"end":8753.01,"speaker":"Audience Member","text":"Yes, it does. And just to be clear, I wasn't trying to Throw any accusations. I'm a big fan of orthodoxy and heterodoxy, and I knew that you care about that and hold to that. I just was expressing some confusion and I think this was very helpful."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8753.25,"end":8763.22,"speaker":"Fr Andrew Stephen Damick","text":"No, I took, I took that as. See, now I was about to make a basketball reference and I've completely lost what you call it when someone passes the ball so that someone else can dunk."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8763.54,"end":8765.14,"speaker":"Fr Stephen De Young","text":"He's not good at the sports ball."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8765.46,"end":8790.13,"speaker":"Fr Andrew Stephen Damick","text":"I don't know the sports balls. Yeah, yeah, that's how I took it. Whatever the word for that is. So, anyway, well, thank you for calling Jack from North Carolina. We're going to take one more call and then we're going to wrap up this Q and A episode. So we have, we have Nicholas calling all the way from the other coast. So, Nicholas, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8790.13,"end":8791.53,"speaker":"Fr Stephen De Young","text":"Final call. Make it good, man."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8794.33,"end":8809.07,"speaker":"Audience Member","text":"Pleasure to be on Fathers. I've been listening for last several months. I. One of your episodes said to go back and start from the beginning. So I'm finally caught up in listening live."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8809.87,"end":8810.43,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8812.27,"end":8837.32,"speaker":"Audience Member","text":"But anyway, my question, I come from a Protestant background that was very much in very evangelistic, using the same methodology as Ray Comfort from the Way of the Master series. I'm not sure if either of you are familiar with that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8838.2,"end":8838.92,"speaker":"Fr Andrew Stephen Damick","text":"Vaguely."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8842.12,"end":8865.92,"speaker":"Audience Member","text":"Well, my question really was, as orthodox Christians, what would be a good approach to evangelism, whether to heterodox Christians or non Christians in general?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":8867.2,"end":9168.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is another. Someone just told me that the word I was looking for, the basketball word I was looking for was assist. The assist. So I will take this as another assist because this is one of my big obsessions is evangelism. My initial response to be to that would be to say it depends. Right? It depends not on whether or not you should evangelize. We should be evangelizing, should be preaching the gospel. Right. The question is how do you do it best in the context you're in? So there are some people that are much more open to hearing the gospel than others. And there's some people you're going to need to express in a particular way, and then there's other people getting express it in another way. I will tell you that I do think that there are some approaches that the orthodox, at least in the English speaking world, have been using for a while now that I don't think are a good idea or maybe not a good idea anymore. Right. And like one of those approaches is, okay, let's try to evangelize evangelicals by telling them that we are the one true church. And so you want to be in the one true church, don't you? We're it. So come on. Now, that is not to say I do not believe that the Orthodox church is not truly uniquely the church. I believe that. I very much believe that. But often the way that that sort of evangelistic pitch gets expressed is in terms of we're the best and don't you want to be in the best? Right? Or we're right and by definition everyone else is wrong, you know, and it becomes about being right. Don't you want to come be right? But, you know, as we said earlier, we're not going to be judged in the end by how right we were. We're going to be judged by what we did. We're going to be judged by if we're faithful to Christ. Right? And so I think this approach of this sort of appeal to authority is. Is not a good idea, even though of course it did. You know, there are many people who became Orthodox because they were searching for the true church, and here's the true church. And I would not knock anybody who, if that's there, was their path. That was certainly a major element in my path. I wanted something that was true, the truth, right? But it can be easy to get so attached to the idea of being right that one loses sight of Jesus Christ himself, who is the truth. And so I believe that preaching the gospel means however you have to express it or whatever the context is. The gospel is, who is Jesus Christ? What did he accomplish, and what does he expect from us? That's the gospel, those three things. And then the response to that is, well, what do I have to do to be saved? Like, how do I get on board with that? Right? And then we tell people exactly what it says in scripture. Repent and be baptized, become part of the church, live the life of faithfulness. That's the response to the gospel. But the gospel is fundamentally about who Jesus Christ is, what he accomplished, and what does he expect from us. That's what the gospel is. You can express it differently with different people. For sure. If you're talking to someone who's a Christian already, you can probably use the scripture very plentifully and they'll be on board with that because Christians respect the scripture. That's part of what it means to be a Christian. If you're talking to someone who isn't a Christian Christian yet, then you can't just say, well, the Bible says this because they don't have any particular reason to believe The Bible. Right now, you might show them what it says from scripture and say, well, this expresses what I'm trying to tell you. But you can't just say, well, the Bible says it, so you have to believe it, because there's no reason that they're going to agree with that. So you have to see where a person is. What does he already believe? Everybody has spiritual beliefs of some kind of, you know, even if it's just I believe that these things are right and these things are wrong. That's a spiritual set of beliefs. But it depends. It depends a lot on who you're talking to and what their particular context is. Like. The way that I would talk to a neo pagan is very different from the way that I would talk to someone who was raised going to an Episcopal Church for the first five years of their life and hasn't been back ever since. Those are two very different religious worlds that those people are in. So, yeah, like I said, it just depends. And I think the biggest thing is that people who become orthodox Christians out of a particular community, that they are probably going to be the most capable of speaking to that community, but they're going to need to go through some maturing in order to be able to do it in a way that's going to be healthy and good for everybody involved and not just be about convincing other people that they're right. Can come be right with me. So that's my little rant about preaching the gospel, Father Stephen."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9171,"end":9178.28,"speaker":"Fr Stephen De Young","text":"Yeah, and obviously evangelism requires preaching the gospel. It is not like an optional part."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9178.6,"end":9179.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9181.16,"end":9197.95,"speaker":"Fr Stephen De Young","text":"But it also has to take place within a frame. Right. As much as Father Andrew would like the royalties going around and handing out copies of Eryizo God or leaving them in public bathrooms isn't gonna do the trick. No, that's not evangelism."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9198.19,"end":9202.99,"speaker":"Fr Andrew Stephen Damick","text":"It's not. Let's just try buying 10,000 copies and seeing what happens first."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9204.83,"end":9217.27,"speaker":"Fr Stephen De Young","text":"Plant a faith seed with Father Andrew Damon. See what grows. No, don't. Really. I turned you into Rod Parsley there for a second."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9219.75,"end":9222.39,"speaker":"Fr Andrew Stephen Damick","text":"That is the worst thing you could turn me into."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9222.55,"end":9245.6,"speaker":"Fr Stephen De Young","text":"There's a whole frame, though, surrounding that conversation about the gospel. And that frame is, I'm not going to say more important, but it's just as important. Right. Because as Father Andrew said. Yeah. They have to have a reason to listen to the Bible. They also have to have a reason to listen to you."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9246.08,"end":9246.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9248.64,"end":9262.4,"speaker":"Fr Stephen De Young","text":"And, you know, you look at St. Herman when he goes to the Aleutians in Alaska. Right. He does translate the scriptures. The services, the prayers."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9262.72,"end":9263.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9263.08,"end":9266.45,"speaker":"Fr Stephen De Young","text":"But he doesn't just do that and like hand them out."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9267.57,"end":9267.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9269.01,"end":9301.97,"speaker":"Fr Stephen De Young","text":"He also goes that he lived among them and learned their language and became a part of their community. But he didn't just do that either. He also translated the Scriptures and the services and the prayers. Right. Those things have to go together. And you'll sometimes hear some of our Protestant friends talk about being a Christian in public. And unfortunately, when they describe what that means, it sounds an awful lot like the stuff Jesus used to condemn the Pharisees for doing."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9301.97,"end":9302.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9302.33,"end":9309.01,"speaker":"Fr Stephen De Young","text":"Like standing on street corners and saying loud, long prayers or doing it in the cracker barrel. Wherever you do it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9309.01,"end":9309.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9309.25,"end":9351.98,"speaker":"Fr Stephen De Young","text":"It's still kind of the same thing. Wearing the tassels, you know, we could say wearing the Christian T shirts, you know, half of which are semi blasphemous anyway. Trying to be clever. Right. Those kind of things. That's not being a Christian in public. Right. Being a Christian in public is living your life the way you're supposed to be living it. For example, when you're in the workplace being humble, being kind, being compassionate. Right. Not joining in the office gossip, not joining in picking on and belittling people, not joining in resentment against the boss. Right. Being a Christian in the sense of following Christ in that place."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9352.78,"end":9353.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9353.58,"end":9393.92,"speaker":"Fr Stephen De Young","text":"And that kind of living among people and being a Christian is what then gives you the opportunity to do the key thing, which is to express the gospel to someone who might then be willing to listen to you about it. Right. Who might be willing to hear that from you and might not just assume you're trying to sell them Amway or some other. Okay, I'm not going to say this about anyway. Or a pyramid scheme, which I am not saying Amway is. Though their organization has a peak at the top, it is broader at the bottom. Definitely not saving this, but more of a ziggurat."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9394,"end":9394.4,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9394.64,"end":9409.21,"speaker":"Fr Stephen De Young","text":"Right. Or Mary Kay Cosmetics or whatever. Right. You're not trying to sell them on something. You're to trying, not recruiting for your group. Right. But you've shared part of your. Your life with them and now you're offering to share more of it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9410.17,"end":9410.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9410.61,"end":9413.77,"speaker":"Fr Stephen De Young","text":"That's a very different thing than trying to sell somebody something."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9416.17,"end":9417.93,"speaker":"Fr Andrew Stephen Damick","text":"Is that illuminating, Nicholas?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9420.25,"end":9438.94,"speaker":"Audience Member","text":"Very much so. Fathers makes a lot of sense. And would you. Would either of you have any reading assignments for me and anyone else listening? Maybe from church Fathers or."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9442.3,"end":9443.1,"speaker":"Fr Andrew Stephen Damick","text":"Boy, he."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9443.1,"end":9445.82,"speaker":"Fr Stephen De Young","text":"Was about to recommend his own book and then you said, no, no, no."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9445.82,"end":9447.74,"speaker":"Fr Andrew Stephen Damick","text":"I won't do that. I'm not going to do that."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9449.98,"end":9455.33,"speaker":"Fr Stephen De Young","text":"He's not going to call himself a church father, so now he can't. No, I'm not a church father."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9455.97,"end":9491.99,"speaker":"Fr Andrew Stephen Damick","text":"I'm not even a church weird uncle. Yeah. I mean, I think that, honestly, this might sound weird, but I think that saints lives, especially missionary saints, is the way to go on this question. Right. Because they're showing you what it looks like to be evangelistic in particular contexts. I mean, starting with the Acts of the Apostles, the first collection of saints lives all about evangelism. Right. So that. I mean, that's. That's where. Where I would go."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9494.07,"end":9525.4,"speaker":"Fr Stephen De Young","text":"Yeah. And their. Their missionary work was not. Is not incidental to their sainthood. Right, right. We. We don't recommend this because we'll see the saints. They're really good people. They're really spiritually wise people. So whatever they do, they're doing it the right way. That's not the perspective of this. It's. They became saints. They came to know Christ more deeply. They became holy. They came close to God. They became like Christ through their missionary work."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9526.12,"end":9526.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9526.92,"end":9531.96,"speaker":"Fr Stephen De Young","text":"To which they were called. That was the path they followed to find their salvation."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9533.33,"end":9533.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9533.57,"end":9554.77,"speaker":"Fr Stephen De Young","text":"And so how they did it and what they did is not just this incidental thing that's sort of baptized or blessed or made more authoritative by them being a saint, but it is actual their. Actually their participation in what God is doing. And it shows us then how we can also work out our own salvation by following a similar path in our own time and place."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9555.73,"end":9559.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What do you think? Can you follow that assignment, Nicholas?"}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9560.51,"end":9565.95,"speaker":"Audience Member","text":"Yeah, I think I can. St. Herman is actually the patron of our parish."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9566.67,"end":9567.47,"speaker":"Fr Andrew Stephen Damick","text":"He's a good one."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9567.47,"end":9569.31,"speaker":"Audience Member","text":"And my parents used to do Amway."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9571.55,"end":9572.27,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9572.67,"end":9573.47,"speaker":"Fr Stephen De Young","text":"No offense."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9576.51,"end":9577.23,"speaker":"Audience Member","text":"None taken."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9578.83,"end":9583.15,"speaker":"Fr Andrew Stephen Damick","text":"Amway bought him his breakfast cereal in the morning. Father Stephen, come on."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9585.15,"end":9586.27,"speaker":"Audience Member","text":"And my vitamins."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9586.98,"end":9588.02,"speaker":"Fr Stephen De Young","text":"And your vitamins."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9588.1,"end":9590.9,"speaker":"Fr Andrew Stephen Damick","text":"You gonna take vitamins out of his childhood? Come on."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9592.9,"end":9594.58,"speaker":"Fr Stephen De Young","text":"He said they used to sell it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9594.74,"end":9595.42,"speaker":"Fr Andrew Stephen Damick","text":"Used to. Yeah."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9595.42,"end":9595.94,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9596.66,"end":9604.74,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, time and space are delusions. So, anyway, well, thank you very much for calling, Nicholas. We. We appreciate it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9605.86,"end":9607.46,"speaker":"Audience Member","text":"Yes. Thank you, Fathers."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9607.94,"end":9638.26,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. All right, well, that wraps up this special second anniversary Q& A episode. We hope you've enjoyed all of our memories that we've played in the past. And thank you, everyone, for calling. That's our show for tonight. Thank you for listening. If you didn't get through to us live this time, we'd still like to hear from you. You can email us at LordOfSpiritsand AncientFaith.com you can message us at our Facebook page or you can leave us a voicemail@speakpipe.com LordOfSpirits Join us for our live."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9638.26,"end":9646.87,"speaker":"Fr Stephen De Young","text":"Broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. Except next time when there will be something special."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9647.59,"end":9663.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes, and if you're on Facebook, you can like our page. Join our discussion group, Leave reviews and ratings everywhere, but most importantly, please share the show with a friend. Word of mouth, word of mouth. Share it with your friends that are going to love it, people who are going to be astonished by it or even bored by it."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9664.88,"end":9674.88,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. That's all the AFR podcasters. You can't pick and choose."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9675.04,"end":9678.96,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Thank you, Good night. God bless you all."}
{"episode_id":"LOS - #051 - 2022-09-08 - Pantheon and Pandemonium V - Live Q&A September 2022","start":9685.68,"end":9722.9,"speaker":"Audience Member","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
