{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":0.96,"end":65.6,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":67.04,"end":79.68,"speaker":"Fr Andrew Stephen Damick","text":"Hey, everybody. It's March 14th. Some people call it PI Day, but if you know how to pronounce that letter in Greek, it's very different. So good evening to you giant killers."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":79.92,"end":88.97,"speaker":"Fr Stephen De Young","text":"You can't, you can't segue over into eating pie if you pronounce it the other way. That's correct. What are you going to consume if you pronounce it the other way?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":88.97,"end":90.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. See, that's why it's a problem."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":91.69,"end":99.53,"speaker":"Fr Stephen De Young","text":"That's why I think you're making it a problem. Sans pedantry. There is no issue here. That's all."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":103.13,"end":131.88,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yes. What podcast is this? That's right. It's the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And we are live. And if you're listening to us live and not listening to the recording, you can call us at 855-237-2346. Just like the voice of Steve just said, we're going to get your calls in the second half of the show and Elijah is going to be taking your calls."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":131.88,"end":137.64,"speaker":"Fr Stephen De Young","text":"So. And it's. He's a little out of control. He already did that little record scratch thing at the beginning of the intro. So."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":137.64,"end":138.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":138.51,"end":139.91,"speaker":"Fr Stephen De Young","text":"Who knows what's going to happen when it gets."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":139.91,"end":195.59,"speaker":"Fr Andrew Stephen Damick","text":"It could be a crazy night. So. Yeah. Yeah. So we've talked about the Torah probably in just about every episode of the podcast. And here we are now at episode number 87. How many thousands of hours is this podcast now? I've lost count. Until now, though, we have not discussed the Torah in any further focused and overarching way to talk about the Torah as the Torah. So one of the questions that we often get, and that frankly is often raised in Christianity, is this. What is the relationship of the Old Testament, especially the Torah, to the New Testament? What exactly did Christ mean when he said he came not to abolish the Torah, but to fulfill it? And what does that fulfillment look like? So level with me, Father. When Jesus said that he did not come to abolish the law, but to fulfill it, he basically meant that he was abolishing it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":195.59,"end":195.79,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":195.79,"end":198.67,"speaker":"Fr Andrew Stephen Damick","text":"I mean, no kosher. Am I right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":202.11,"end":202.51,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":203.79,"end":208.27,"speaker":"Fr Andrew Stephen Damick","text":"See, the thing is, you don't even know which no he's saying which part of that. He's saying no to."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":208.83,"end":216.35,"speaker":"Fr Stephen De Young","text":"Yes. A lot of no's. No, there is no kosher or no, he's not right or no, no, you do still have to worry about how your pickles were killed."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":218.83,"end":221.31,"speaker":"Fr Andrew Stephen Damick","text":"It's not. The killing of the pickle is not ritualized."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":221.95,"end":225.81,"speaker":"Fr Stephen De Young","text":"You especially don't want to eat a dill pick with its blood still in."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":225.81,"end":226.09,"speaker":"Avery","text":"It."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":228.89,"end":245.13,"speaker":"Fr Stephen De Young","text":"Nor make sure it's kosher. Dill. Yeah, yeah, that. I mean that. I don't want to go too far down this rabbit trail, but is. Is the Vlasic pickle stork Jewish? Is that what we're being led to believe?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":245.29,"end":255.78,"speaker":"Fr Andrew Stephen Damick","text":"If so. If so, he is almost certainly a litvac. Because the stork is the national animal of Lithuania. See, it all comes back around."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":256.02,"end":257.46,"speaker":"Fr Stephen De Young","text":"I played right into it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":257.62,"end":264.74,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Actually, around this time of year is when the storks start coming back. So it's very timely."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":266.02,"end":308.27,"speaker":"Fr Stephen De Young","text":"It's like the swallows coming back to Capistrano. So, yeah, we talk about the Torah a lot. We've said a lot of things about the Torah. We've even at least address the whole idea of abolishment versus fulfillment of the Torah before, at least in brief. But beyond those summary statements as you allude to, there's a question of what that looks like and getting more into specifics. So with tonight and next week's show and who knows what else, we're going to be sort of two weeks."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":308.27,"end":310.27,"speaker":"Fr Andrew Stephen Damick","text":"Don't get people excited. We're having a show next week."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":310.99,"end":312.15,"speaker":"Fr Stephen De Young","text":"No, in a couple of weeks."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":312.15,"end":319.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, a couple weeks. Yeah, yeah. Because people, they notice when we say these things, you know, and then they. They get crazy when we don't do what they."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":319.75,"end":328.91,"speaker":"Fr Stephen De Young","text":"Well, so I didn't say next week's show was going to be Lord of Spirits. Oh, okay, right. Like, who knows what kind of shows I'm putting on here in Lafayette. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":329.15,"end":329.79,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":333.29,"end":393.11,"speaker":"Fr Stephen De Young","text":"None in the first week of Lent, though. But with the next. Yeah, with at least these next few shows, we're going to be sort of gradually zooming down to very particulars, Right. Because it's one thing to say, for example, as I think I said, or something similar in Religion of the Apostles. I don't go back and read my own books either. That would be really weird. But I said something in the last chapter along the lines of every commandment of the Torah is still in effect in the Orthodox Church. Something along those lines. Yeah. And it's one thing to say that, and it's even one thing to kind of make a broad argument where people can kind of nod their head to that. But then, you know, so I can't eat an owl. Right. Like, when you get down to the, like super deep. I don't know why you want to eat an owl."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":393.99,"end":395.63,"speaker":"Fr Andrew Stephen Damick","text":"I mean, maybe an owl's all you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":395.63,"end":572.36,"speaker":"Fr Stephen De Young","text":"Got, but, you know, but getting into the weeds, right? We're going to get a little more. We're going to gradually get into the weeds. We're going to be. We're going to start sort of zoomed out over the course of tonight. We're going to zoom closer. And then in two weeks, in a mere fortnight, we will be zooming in even closer and getting into said hypothetical aforementioned weeds. But for tonight, right, we're starting with the broader view, the more zoomed out. So we've talked about before how the Torah is sort of the foundation stone of the canon of Scripture, that the Old Testament or the Hebrew Bible is the Torah plus additional books. That's why it's sometimes referred to as just the Torah and the prophets or the Torah, the prophets and the writings. But the Torah there is always present. We've talked about a lot at various times from various perspectives about how all the different Judaisms of the Second Temple period had somewhat different canons. Some of them very expansive, some of them very restricted. But there was one thing in common. All of them had the Torah. Yeah, yeah. Even in. So we've even talked about how there were certain groups that were deeply grounded in Enochic Judaism. Right. So the Book of Enoch, the Book of Jubilees and then other, you know, the Book of the Giants, other related Anakin literature form this sort of central. Occupied this central place in terms of their reading of Scripture. Places like Qumran, for example, and involved with that. So involved with parts of the Book of Enoch, there is a sort of Diminishment of the importance of Moses and even sort of a diminishment, one could say, of the Torah in a certain sense, at least in the sense of certain of the commandments. But even in those places, for example, in Qumran, yes, first, Enoch and Jubilees are the second and third most common texts there. But number one is Genesis, which lest we forget is part of the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":573.96,"end":575.08,"speaker":"Fr Andrew Stephen Damick","text":"The beginning of the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":575.16,"end":800.7,"speaker":"Fr Stephen De Young","text":"Yeah. So even Anakin Judaism, which in some ways was a rival to Pharisaic Judaism in the first century BC in the first century AD and therefore kind of a rival to the way in which Pharisaic Judaism planted itself firmly in the commandments of the Torah. It was still based and grew out of the Torah, just with a very different reading and understanding of it. So the Torah is at the core. Everything else is added to the Torah in the Old Testament or the Hebrew Bible. What we call the historical books or the former prophets are also called by scholars the Deuteronomistic history, because they describe the history of Israel through a lens and in terms and based on principles that are outlined in the book of Deuteronomy, which is the Torah. Everything is based on Torah. When we get to the New Testament, we find that the structures of the New Testament canon parallel and mirror the Hebrew Bible or the Old Testament in that we have the Gospels, which are presented in a certain way as a new Torah, not as a new Torah that replaces the old Torah, but as the interpretation of the Torah directly related to the person of Jesus as the Messiah. We tend to diminish in the Gospels. Jesus preaching, we've been taught to do this by a Protestant culture. All of Christ's preaching, all of his teaching, all of those kind of things are sort of the run up to his death and resurrection, Right? Mainly his death, but then also, of course, his resurrection. And you'll even see a lot of scholars point out, well, about one third of each of the Gospels is passion narrative is death and resurrection. And that's an outsized portion. Agreed. But the other 2/3 is other stuff which is important. And when you look at that other stuff, when you look at Christ's preaching and the parables, when you look at his interactions with the Pharisees and the Sadducees and the Herodians and the scribes, in all of the Gospels, those leading up parts, what they're talking about, what they're arguing about, what they're fussing to him about, the issues are all surrounding the Torah and its interpretation, Right? They're all surrounding the Torah and its interpretation. And when we get to the epistles in the New Testament, the epistles are taking the Hebrew Scriptures as read through the Gospels. Right. Not the literal text of the Gospels, but what is presented in the Gospels in terms of the life of Jesus the Messiah and applying that, putting it into application in the lives of the recipients of the different letters. So even the New Testament is fundamentally grounded in the Torah. I would and have argued that if you have the Torah as a Christian, you actually have all the basis you need for Christian theology."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":802.38,"end":802.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":803.02,"end":804.22,"speaker":"Fr Stephen De Young","text":"Just in the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":804.54,"end":856.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It'll be hard to test this thesis, but my sense is that almost every error in theology is an error of either not knowing the Torah or, as I think you've said before, believing that God is in some way not free or some combination of the two. Yeah, you know, that, that, that. And I mean, honestly, I think a lot of the ills of, of Christianity in here in the 21st century come from not knowing what is in the Torah. You know, it's. A lot of it is actually really straightforward, but we don't want it to be, you know, especially some of the stuff in Leviticus, for instance."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":856.6,"end":883.31,"speaker":"Fr Stephen De Young","text":"Right, right, right. And we, you know, there are any number of reasons why this is the case. Right. And some of them express themselves as fairly benign. Right. Like they'll want to embrace the fulfillment language and just say, well, you know, the New Testament explains all that, or Jesus is the fulfillment of that. So we could just read that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":884.27,"end":896.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's a sense of. Now we've got this other text that supersedes the first one. So it's nice if you can read that or know it, but really, all you really need are the writings of the New Testament."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":896.95,"end":904.44,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But this can lead us down really bad paths."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":905.64,"end":906,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":906,"end":934.48,"speaker":"Fr Stephen De Young","text":"So I once, years ago, I'm going to give no hints as to this was. But I had an orthodox clergyman say to me, well, all that stuff in the law, which is how he was referring to the Torah, all that stuff in the law isn't important anymore. Right. All that's important is that we love God with all our heart, soul, mind and strength and love our neighbor as ourselves. To which I replied, that's Deuteronomy and Leviticus."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":935.68,"end":944.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Yeah. A lot of the stuff that people think is introduced in the Gospels is simply a quote from somewhere in the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":945.04,"end":1016.89,"speaker":"Fr Stephen De Young","text":"Right, right. So when Christ is asked, what is the first and greatest commandments, he gives two commandments from the Torah and says, these are the most important ones. Right. So again, this is a discussion about the Torah. And so when we get to the famous passage in Matthew 5 that we've now alluded to many times but have yet to read, where Christ distinguishes between abolishing the Torah and fulfilling it, we have to come to it with all of that in mind, with the reality of what's in the Scriptures. Right. With the reality of how the Gospels are structured and what they contain and how they relate to the Torah, if we want to understand it correctly. Because if you go to any passage of the Scriptures, you read it, you read too small a part of it, and then try to take it at face value in some literal sense and then try to read everything else you encounter in the Scriptures according to what you think that one verse said, you're going to end up a Calvinist or something?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1017.37,"end":1022.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. There are no skeleton keys to the."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1022.13,"end":1042.3,"speaker":"Fr Stephen De Young","text":"Bible or many other things. Many other things. I just like to pick on Calvinists because some of my best friends are Calvinists, literally. But yeah. So we need to bring our understanding of the reality of the Scriptures to bear Right on how we interpret Christ's discussion in Matthew 5."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1042.7,"end":1064.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep, yep. Okay. So before I read it, I actually just want to say hello to. We have someone listening from Shanghai, which is. I think this is maybe the first time we've had someone actually in China listening. So that's awesome. Someone from Canada. We have someone from Germany, someone from Norway. And of course, we love all you Americans as well."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1064.78,"end":1065.05,"speaker":"Avery","text":"This."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1065.2,"end":1079.44,"speaker":"Fr Stephen De Young","text":"So that, you know, Kanakistan seems so much less impressive when you've got those others. We still love you Canuckistanis, but I mean, yes, you're barely a foreign country."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1079.76,"end":1093.08,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow. We're not even 20 minutes in. We're already getting. Already getting a little bit spicy. Of course, Canada is not really known for its spicy food, so. That's true. All right. Matthew, chapter."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1093.08,"end":1096.04,"speaker":"Fr Stephen De Young","text":"You'll never see poutine with jalapenos. Let me put it to you that way."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1096.04,"end":1098.52,"speaker":"Fr Andrew Stephen Damick","text":"I bet that's a thing. That's got to be a thing. Someone's doing that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1098.6,"end":1100.4,"speaker":"Fr Stephen De Young","text":"Some Canadian write us right now and."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1100.4,"end":1152.67,"speaker":"Fr Andrew Stephen Damick","text":"Send us pictures of their poutine with jalapenos in it. Okay. Matthew, chapter 5, verses 17 through 20. This is the Lord speaking. Do not think that I have come to abolish the law or the prophets. I have not come to abolish them, but to fulfill them. For truly I say to you, until heaven and earth pass away, not a Yod or Tymil will pass from the law until all is accomplished. Therefore, whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven. But whoever does them and teaches them will be called great in the kingdom of heaven. For I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven. So this is kind of the core text of what we're going to be talking about in this first half."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1153.07,"end":1164.99,"speaker":"Fr Stephen De Young","text":"Yeah. And the first verse of that and the last verse of that are the ones that tend to get broken off and used in weird ways."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1166.35,"end":1166.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1166.71,"end":1178.01,"speaker":"Fr Stephen De Young","text":"Not related to the context. So the first verse of that, of course, is the. Do not think I've come to abolish the law or the prophets, the Torah or the prophets. I've come not to abolish them, but to fulfill them."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1179.05,"end":1179.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1180.57,"end":1197.29,"speaker":"Fr Stephen De Young","text":"And that's, you know, when you're having a discussion, right, and you try to point to something in the Old Testament broadly, or the Torah in particular, and whoever you're talking to says, oh, well, that's the Old Testament."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1198.81,"end":1201.49,"speaker":"Fr Andrew Stephen Damick","text":"Right? We've all heard that. We've all heard that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1201.49,"end":1217.65,"speaker":"Fr Stephen De Young","text":"Well, Christ didn't abolish the Old Testament. They say, no, he didn't abolish it. He fulfilled it. Right. Like, quote that one verse. Yeah, but they're quoting that verse as if to say fulfilled, abolished. Right. I mean, fulfill sounds nicer, but."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1217.65,"end":1219.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1219.09,"end":1222.01,"speaker":"Fr Stephen De Young","text":"Either way, you know, you're throwing it out the window."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1222.01,"end":1225.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Oh, we have. We have a South African listening. That's."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1225.98,"end":1226.58,"speaker":"Fr Stephen De Young","text":"There we go."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1226.98,"end":1227.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1231.54,"end":1378.36,"speaker":"Fr Stephen De Young","text":"And then the other one that sometimes gets broke. Well, we'll start there. So the next few verses just like, put to lie that interpretation. Right? Because Christ goes on to say, until heaven and earth pass away. And this has not happened yet. Sorry, Preteris not. A Yod or a Tamil will pass from the law until all is accomplished. And a Yod, for those of you who don't know anything about Hebrew, kind of looks like an apostrophe. It's the smallest letter of the Hebrew Alphabet. And a timal is part of a letter that separates a chet from a Tet. So it's not the smallest letter, not the smallest part of a letter will pass from the Torah until all is accomplished. Right. So all is accomplished here is connected to heaven and earth passing away. So that includes now. Right. So none of those things are passing away. So fulfillment does not mean pass away for sure. And then the next verse takes it even farther. Whoever relaxes one of the least of these commandments and teaches others to do the same will be called least in the kingdom of heaven. But whoever does them and teaches them will be called great in the kingdom of heaven. So not only do they not pass away, but whatever Christ means by fulfilled by the Torah, being fulfilled by him means that we who are seeking to enter the kingdom of heaven, Christians are going to be doing them and teaching them. I don't see how you get much more clear than that. Yeah, those verses also kind of mess with the way verse 20 is sometimes broken off and used weirdly. And this is our Calvinist friends, they'll kind of split it off from the context and say, I tell you, unless your righteousness exceeds that of the scribes and Pharisees, you will never enter the kingdom of heaven. And they use that to say, ah, see, the scribes of the Pharisees, their righteousness is from the law, it's from the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1379.39,"end":1379.63,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1379.63,"end":1382.51,"speaker":"Fr Stephen De Young","text":"And you need Christ's righteousness, which is greater than that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1382.67,"end":1384.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Instead. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1384.99,"end":1410.53,"speaker":"Fr Stephen De Young","text":"And so here's the problem with that. The people who are being talked about here are people who will not enter the kingdom of heaven. And we're just told that the people who do and teach the commandments of the Torah will be called great in the kingdom of heaven. So if doing and teaching the commandments of the Torah excludes you from the kingdom of heaven, how can you also be great in the kingdom of heaven?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1412.29,"end":1413.89,"speaker":"Fr Andrew Stephen Damick","text":"Trying to do the math in my head here."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1414.37,"end":1420.61,"speaker":"Fr Stephen De Young","text":"Yes, yes. That math cannot be done. That circle cannot be squared."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1421.65,"end":1422.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1422.85,"end":1431.89,"speaker":"Fr Stephen De Young","text":"So I mean, again, like Calvinist friends, you may have a bunch of good points about this, but this verse should not be one of them, because that's not what it says. Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1431.89,"end":1432.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1436.68,"end":1453.32,"speaker":"Fr Stephen De Young","text":"Yeah. So very clearly here, Christ is saying, it's not abolished. None of it passes away, it's fulfilled. Not one stroke of a brush passes away. Not one commandment should be taught against. Or relaxed."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1455.88,"end":1456.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1456.28,"end":1511.82,"speaker":"Fr Stephen De Young","text":"Or relaxed. So again, fulfilled does not mean relaxed, because we tend to, and we talked about this a little in a very old episode, there's this idea that Christ sort of fulfills different commandments in different ways. Right. So when folks who want to use fulfilled to mean something like abolished, they'll say, well, Christ fulfills like the moral law because he keeps all the moral commandments in the Torah, but we still have to keep the moral commandments. Right. So he fulfills them because he keeps them, but we should keep them too."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1513.67,"end":1513.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1513.99,"end":1539.17,"speaker":"Fr Stephen De Young","text":"So I'm not even sure what fulfill means there vis a vis Us. But then they'll say, well, but Christ fulfills the sacrificial system by his sacrifice, and therefore we don't do those anymore. So in that case, Christ fulfilling it means we don't do it. Yeah, Right. And so there's."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1539.89,"end":1548.37,"speaker":"Fr Andrew Stephen Damick","text":"It seems like the whole idea is how do we work this out so we don't have to do the stuff that's in the Torah? That seems to be what it's about."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1548.45,"end":1580.55,"speaker":"Fr Stephen De Young","text":"Right, right. And. And as we're going to get into in the rest of this first half, this is not a wheel you need to reinvent. Right. People are trying to sort of reverse engineer Christian practice. Right. They're trying to say, okay, well, we, we do keep these commandments about sexual immorality, but we eat shrimp. Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1580.55,"end":1580.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1580.87,"end":1596.74,"speaker":"Fr Stephen De Young","text":"And probably somebody out there eats owls. Right. So, like, how do you explain that? And so there are all these attempts to reverse engineer, and that's a very bad way to interpret Scripture. Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1599.46,"end":1628.99,"speaker":"Fr Andrew Stephen Damick","text":"The presumption there is. Okay, okay, guys, I'm going to figure this out. And now we can apply all this the correct way. Who cares how this has been being done for all these now thousands of years? We got to figure it out for ourselves. We need to, you know, we need to figure out what exactly does fulfillment mean and how does this apply? And all these specific, like, come up with an, as you said, to reinvent the wheel, come up with a new system."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1630.03,"end":1760.24,"speaker":"Fr Stephen De Young","text":"Right, Right. And so in the pages of the Scriptures themselves, right, including the pages of the Torah itself, we have the tools to understand why things came to be the way they are in the Christian church vis a vis the commandments of the Torah. And that's a lot of what we're going to be getting into now for the rest of this half. So let's say we're successful, right, in talking through the Gospels and going through Matthew 5 like we just did, to show. And this is in the Sermon on the Mount. This is near the beginning of the Sermon on the Mount just to locate that part that we read, right? So Christ is teaching this, like right after the Beatitudes, right? So this is, this is part of the beginning. He's framing what he's about to teach. Everything he's about to teach about the Torah and the commandments, he's framing with. I'm not getting rid of nothing, right. I'm not even relaxing anything. This is going to continue to be done and taught within this. So even if we do our jobs well or people who don't know who we are and haven't heard this show. Just read the text in an honest and straightforward way and come to the same conclusion that this is what Christ is doing. There's still an issue that crops up because there's this whole swath of people. It's an interesting collection of people who have probably never been collected together before, who, even if they're willing to accept Jesus as a teacher of Torah and an explainer and interpreter of Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1762.72,"end":1763.08,"speaker":"Fr Andrew Stephen Damick","text":"Throw."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1763.08,"end":1764.64,"speaker":"Fr Stephen De Young","text":"In a Monkey wrench with St. Paul."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1766,"end":1834.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think the reason why. The reason why that gets done, or maybe I should say one of the big. Yeah, I need to flip it on the other side. One of the big consequences of why people think that there's this huge shift with St Paul is this idea that there was this religion called Judaism that was based on the Torah and that there's this religion called Christianity and St. Paul belongs to Judaism and he converts to Christianity, that they're these two different religions. Right. And so as we're going to see here, there's all kinds of reasons why you might want to say that. And one of the things that we're saying, and I think is a major, major theme throughout this. The hundreds of hours we've spent on this podcast now, is that the religion of the Old Testament and the religion of the New Testament, the religion of the Christian church, same religion, same religion. It's not two different religions. Right, so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1834.24,"end":1834.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1834.56,"end":1835,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1835.16,"end":1845.48,"speaker":"Fr Stephen De Young","text":"And that's especially connected in the case of Martin Luther. But some of the people we're going to talk about even precede Martin Luther. So this isn't just something he starts, but this is something he returns to."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1845.8,"end":1847.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1849.88,"end":1888.7,"speaker":"Fr Stephen De Young","text":"And so there has been, since a very early period in the history of the church, a bad way to read St. Paul. This may even be what St. Peter is referring to in second Peter when he talks about the people who talks about how there are some things in St. Paul's letters that are hard to understand and people twist them to their own destruction. Right. This may even be the particular reading he's talking about. St. Paul even sometimes seems to allude to people understanding him that way. Because when he does his rhetorical. Is this what I'm saying? No, of course I'm not saying that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1889.42,"end":1889.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1893.67,"end":1936.29,"speaker":"Fr Stephen De Young","text":"So there's been this bad way of reading St. Paul very early, probably from his. From some of his critics in his. During his lifetime, which is that he is speaking against Moses, against the Torah, saying, get rid of that stuff. Now we got Jesus. It's not important. Right. And this reading affects all kinds of things in big and small ways. Right. An obvious early example would be the Marcionite movements and the various Gnostic movements that adopted that position on the Old and New Testaments. Right, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1936.29,"end":1947.26,"speaker":"Fr Andrew Stephen Damick","text":"And they were really explicit about it too. Like the God of the Old Testament is a different God and he's evil. And then forget about that stuff, you know, the father of Jesus Christ is a different God."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":1947.9,"end":2019.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And sorry, dbh, but saying that you think the evil Old Testament God doesn't exist doesn't make you not a Marcionite. If the Gnostic shoe fits, you must wear it. So, yeah. And there's a whole swath of Gnostic groups then that had a reading of St. Paul. They tried to twist and use certain elements of St. Paul talking about the Torah to try to say, yeah, see, this is bad. Right. And to try to make this contrast with, with Christ, however they saw Christ. Because we're talking about Gnostic groups. So Jesus Christ, Logos, sometimes these are separate emanations of something. Right. You know, Gnostics, but. But who tried it everywhere drive this wedge. Right. But you know, and let me say before I name any other groups, these are disparate groups. These are an odd collection of disparate groups. I'm not saying these groups are all the same, but they do have this."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2019.57,"end":2020.97,"speaker":"Fr Andrew Stephen Damick","text":"One weird thing in common."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2020.97,"end":2023.85,"speaker":"Fr Stephen De Young","text":"They have this one weird thing in common, but they are not the same."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2023.93,"end":2024.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2025.37,"end":2043.11,"speaker":"Fr Stephen De Young","text":"So another group that does. Does this is dispensationalists, at least classical dispensationalists. Right. There's a lot of different versions. Right. Because there's no pope of dispensationalism anymore. Scofield died, so now everyone could do what's right in their own eyes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2043.19,"end":2045.83,"speaker":"Fr Andrew Stephen Damick","text":"A great disappointment to them all. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2049.03,"end":2215.15,"speaker":"Fr Stephen De Young","text":"But so dispensationalism, right? Will classically affirmed, yes. Jesus is talking about the Torah all the time. And so those things that Jesus teaches in the Gospels don't apply to the church. Those are going to apply to the Jewish people in the millennial kingdom when they return to Christ, when they return to Jesus as the Messiah. And so what St. Paul writes that's directed toward the church. And the church is for them innately non Jewish, innately gentile, not made up of a mix, just the church is gentiles. And so again, right. Though for very different reasons, they end up reading St. Paul in much the same way. Right. That St. Paul is this. There's this break in distinction between Christ and St. Paul and that St. Paul is arguing for forget about that Torah stuff. Right. We're doing a whole new thing now. Right. And frankly, there's at least a light strain of that, even outside dispensationalism in evangelicalism, in that when you look at issues like worship. Right. There's an assumption that as St. Paul is planting churches, he's essentially starting worship from scratch. Right. That none of the things with incense or sacrifice or any of that, even very much of the synagogue stuff is carried over into Christian worship. Christian worship is just this simple thing that happens in people's houses. Yeah, right. Where a few songs are sung and somebody reads scripture and preaches, which looks an awful lot like what folks are doing, you know, couple thousand years later, suspiciously being projected into the past. But there's sort of that assumption of starting from scratch, which is sort of a light version of this. Right. But still points to some kind of distinction where St. Paul is taking at least parts of the Torah and setting it aside. I'm going to go ahead and say it. This is going to sound like a cheap shot to some people, but I do not mean it as a cheap shot. Not that that disclaimer will help. And I will clarify after I say this too, what I mean by it. So there is this division, classically that comes out of John Calvin, but is in a lot of Protestantism and Evangelicalism, where you divide the law into these three parts, the civil law, the ceremonial law, and the moral law."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2216.19,"end":2216.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2218.68,"end":2237.16,"speaker":"Fr Stephen De Young","text":"And that's the bait for your. For your average evangelical or even confessional Protestant person. Some version of that is part of this explanation or reconstruction. So it's not like a Marcionite position where there's this total break. It's sort of a partial break."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2238.12,"end":2238.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2240.44,"end":2259.18,"speaker":"Fr Stephen De Young","text":"So just this is just a historical point. Historically, the first place where we see the commandments of the Torah broken up like that is in a Gnostic text from the late second, early third century called the Letter to Ptolemy."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2259.74,"end":2260.54,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2260.78,"end":2316.54,"speaker":"Fr Stephen De Young","text":"And that Gnostic text is deliberately trying to find, like a compromise between Marcionism and what the Orthodox Church was teaching. So he's deliberately trying. Now, I'm not saying that's where Calvin got it. In fact, I'm pretty sure Calvin never knew that existed. I'm not saying evangelicals are Gnostics. Right. Some of them probably are, but I'm not saying all of them are. I'm not. Right. I'm not saying that. I'm just saying historically, this is the first place where we see that kind of argument. And you can understand historically why in that historical setting, that kind of argument would emerge. And it's a species of this same kind of argument for a disjunction, either partial or total. But going back to people who thought there was a total disjunction, so far we've had gnostics and dispensationalists, and now we have Friedrich Nietzsche."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2318.46,"end":2319.1,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2322.7,"end":2384.76,"speaker":"Fr Stephen De Young","text":"All hanging out together at a party? What kind of playlist would we put together anyway? Looks exhausting. And Nietzsche took this in a way that's very counterintuitive, based on what we've already said about Scripture and based on subsequent theological and philosophical history. But Nietzsche thought there was this complete break between Christ and St. Paul, but he thought it went the other way. Meaning, from Nietzsche's point of view, Christ was an example of the Ubermensch. Right. He comes along, he revalues all values. He transforms everything, thinks completely outside the box through his preaching, calls into view a whole new world, a whole new way of ordering the world and possibilities and everything. And then for Nietzsche, St. Paul comes along and Judaizes it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2386.84,"end":2387.56,"speaker":"Fr Andrew Stephen Damick","text":"Wait, What?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2388.12,"end":2388.6,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2389,"end":2389.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2390.6,"end":2395.32,"speaker":"Fr Stephen De Young","text":"St. Paul comes along and just turns it, like, wrenches it back into this Jewish mold."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2395.64,"end":2398.76,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Well, he's a Pharisee, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2398.84,"end":2426.18,"speaker":"Fr Stephen De Young","text":"Yeah. So he's included here. Even though he's kind of the inverse. Right. He still has this break, this idea that there's this big break between what St. Paul is doing and saying and writing and what. What Jesus did. Next up is Islam. Yeah, Well, I mean, which means if we're, well, already with the dispensationalists, we couldn't have alcohol at our party, but now we definitely can't."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2426.42,"end":2426.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2428.66,"end":2523.1,"speaker":"Fr Stephen De Young","text":"So which means Nietzsche is going to be bored. But this is a major move, of course, within Islam. Right. Because Islam teaches dogmatically that Jesus is the Jewish Messiah. They believe in his virgin birth, and they believe he was a prophet. Now, however, they believe he was a prophet who taught Islam. So if they're going to say that, then they need somebody who came up with Christianity. So they pick St. Paul. Yeah, yeah, right. St. Paul made this up. And in some of the more advanced modern versions of this. And I say modern because, honestly, like, these aren't arguments you would have heard being made at the caliphate against St. John of Damascus. Right. These are modern arguments based on modern biblical scholarship in a lot of cases. But they've tried to revoke St Peter and St James into being totally different people than they're presented as by history or the scriptures in order to make them also kind of Islamic. Like, they're the real heirs of Jesus. And St. Paul comes and, like, stages this coup or something when he creates Christianity. But again, there's this huge divide. And then, of course, as I just kind of alluded to, modern scholarship does this all the time."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2524.3,"end":2528.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they're just trying to take the whole thing apart, frankly."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2529.18,"end":2550.04,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And having. Having done a lot of work in St. Paul recently, I have less and less appreciation for this, and I think it's dumber and dumber because, you know, the kind of things they point to are, like, linguistic things."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2551.24,"end":2551.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2551.72,"end":2557.56,"speaker":"Fr Stephen De Young","text":"Like, Christ talks about the kingdom of God a lot. St. Paul only uses that term a couple of times."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2562.36,"end":2563,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2563.72,"end":2567.24,"speaker":"Fr Stephen De Young","text":"Yeah. Like, it's that level of stuff that good, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2567.48,"end":2567.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2567.88,"end":2597.56,"speaker":"Fr Stephen De Young","text":"Like, St. Paul doesn't use the same words that Jesus did. So Jesus says, love the Lord your God with all your heart, soul, mind, and strength, and love your neighbor as yourself. The whole Torah is summed up in these two commandments. And St. Paul says, the one who loves keeps the whole Torah. See, he uses totally different words. They're totally at odds with each other."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2598.08,"end":2612.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So, I mean, you know, normally we reserve calls to the second half, but we actually have someone calling who has a question that is directly connected to what we're talking about right this moment. So I thought I would."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2612.84,"end":2613.92,"speaker":"Fr Stephen De Young","text":"Is it Bart Ehrman?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2614.24,"end":2616.16,"speaker":"Fr Andrew Stephen Damick","text":"It's. I. I don't think so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2616.24,"end":2622.4,"speaker":"Fr Stephen De Young","text":"Okay. It's not friend of the show Bart Ehrman, because if he calls in, if he ever calls it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2622.4,"end":2622.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2622.72,"end":2624.72,"speaker":"Fr Stephen De Young","text":"Doesn't matter what half he gets through. Let him in."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2625.29,"end":2636.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, let him in. Elijah, If Bartim calls in. No, no. This is actually Michelle from Florida. So, Michelle, welcome to the Lord of Spirits podcast. Are you there?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2637.29,"end":2639.29,"speaker":"Avery","text":"Oh, yeah. Hi. Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2639.29,"end":2644.33,"speaker":"Fr Andrew Stephen Damick","text":"Hi. Welcome. You are probably the first person ever to get in during the first half."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2645.21,"end":2645.69,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2645.85,"end":2648.89,"speaker":"Avery","text":"I'm flattered. I'm truly flattered. Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2649.29,"end":2651.43,"speaker":"Fr Stephen De Young","text":"You yourself have staged a couple."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2654.7,"end":2655.1,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2655.1,"end":2657.38,"speaker":"Avery","text":"Oh, you want my question? Obviously, yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2657.38,"end":2659.5,"speaker":"Fr Andrew Stephen Damick","text":"So what's on your mind? What's on your mind, Michelle?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2660.38,"end":2664.54,"speaker":"Fr Stephen De Young","text":"Unless you want to talk about WrestleMania. I'll talk about that if you want."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2665.74,"end":2727.04,"speaker":"Avery","text":"I have no expertise in that. I'm sorry. I'm just trying to understand why there was such limited Christian resistance to Hitler, given that the Jew, you know, we share the same commandments. Right. And it just seemed to me that, you know, we're kind of all Jews in spirit, if you want to use that term. And so I can understand. And it wasn't just one branch of Christianity. It was right across the board. I think the only objections I've ever read about were from the Greek Orthodox archbishops in Greece, obviously, and you know, Roddy Edmonds, who, whose famous phrase was we're all Jews here. And so I'm just trying to understand why was that? Is that because of what you were talking about earlier, that, you know, the strict Protestants really didn't, didn't see it that way? I'm sorry, I'm not phrasing that very well, but I just wondered if you had an opinion on that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2727.92,"end":2749.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I think the first thing I'll say is there certainly were plenty of Christians in Europe, including in Germany, who resisted what Hitler was doing to the Jews. You know, I think it wasn't it, Father. Wasn't it Dietrich? Was it? Dietrich Bonhoeffer was the one that, I'm."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2749.71,"end":2751.15,"speaker":"Fr Stephen De Young","text":"Blanking, tried to assassinate him."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2751.23,"end":2755.15,"speaker":"Avery","text":"Yeah, yeah, yeah. Dietrich Bonhoeffer."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2755.15,"end":2816.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So I mean, that definitely existed and certainly outside of Germany, right. There were, there were people who resisted that largely on the basis to say, like, look, these are human beings and human beings shouldn't be treated this way. But at the same time, I mean, there was a lot of people who agreed with Hitler. Right. And I, my sense, and now, mind you, World War II is not my, my area of history, so I'm not really an expert on this, but my sense is that when people maybe engaged in a little bit of Marcianism, that is to say this kind of rejection or at least marginalization of the Old Testament, you know, as part of this, it was largely to justify the way that they already wanted to behave. Much like, for instance, in 19th century America, people use passages from scripture to justify race based slavery."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2817.81,"end":2818.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2818.53,"end":2849.1,"speaker":"Fr Andrew Stephen Damick","text":"It wasn't because, like they had read the Bible and concluded, oh, we should be keeping slaves, you guys. No, it was, oh, we have slaves. And, and yeah, I'm still a good Christian. In fact, wait, here's a Bible verse. You know, I, I think that that's more the way that it went. I don't think that World War II era and previous antisemitism and, you know, the Holocaust and so forth was based on a reading of the scripture. I don't know. Correct me if I'm wrong about that, Father. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2849.26,"end":2854.06,"speaker":"Fr Stephen De Young","text":"So you're right in that, right? Ideas don't cause things."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2854.46,"end":2854.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2855.82,"end":2860.3,"speaker":"Fr Stephen De Young","text":"People do things and they generate the ideologies they need to justify them."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2861.5,"end":2861.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2861.82,"end":2891.23,"speaker":"Fr Stephen De Young","text":"To do work for them. And you have to, I mean, I don't want to pull up Putin here, but you have to go back a few centuries in Germany. And you have to look at Martin Luther. Sorry, Lutheran friends, I'm not arguing here that you are fruit of the poison tree or something, but we have to be honest about the historical person. Martin Luther. Yep."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2892.52,"end":2894.84,"speaker":"Avery","text":"Oh, yeah. The fifth book of Luther. Is that right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2896.12,"end":2896.68,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2898.04,"end":2903.08,"speaker":"Fr Andrew Stephen Damick","text":"Father Stephen, did we lose you? Oh, wow. This is like the old days when. Oh, there he is."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2905.16,"end":2930.28,"speaker":"Fr Stephen De Young","text":"Martin Luther. His continued existence after breaking with and being excommunicated from the Roman Catholic Church depended on the goodwill of certain German princes. And so I. Not so much theologically, but in matters related to it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2934.44,"end":2942.04,"speaker":"Fr Andrew Stephen Damick","text":"It'S kind of breaking up there a little bit. This is like the old days of Lord of Spirits. It's exciting."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2942.2,"end":2986.18,"speaker":"Fr Stephen De Young","text":"Peasant revolt. He justified and encouraged the princes to murder thousands of peasants. You can see this with the crushing of the Anabaptist movement, Germany. And he did this with on the Jews and their Lives, where he called for synagogues to be burned, Torah books to be burned, which was to justify what those German princes were doing in wanting to seize the wealth and land and holdings of Jewish people who had accumulated some wealth within Germany. And so they were otherized. Their things were taken, they were killed. Luther justified it in service to those princes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2986.42,"end":2986.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":2988.98,"end":3053.59,"speaker":"Fr Stephen De Young","text":"And so that ideology became baked into the German state as it formed. Hitler did not just come along and start anti Semitism, there were pogroms, there were outbreaks of violence against Jews for centuries. All through there, what Hitler was doing. And so the state Protestant churches in Europe had bought into that ideological superstructure by the time Hitler came along. When we're talking about the Roman Catholic Church, it's a little different. The Roman Catholic Church had gotten into bed with colonialism. One of the things people. There's some good books on this that have been published in the last decade or so, but one of the things people don't realize is Hitler formulated his plans was Germany didn't have any colonies, unlike Britain or France or Belgium."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3054.2,"end":3054.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3054.32,"end":3125.76,"speaker":"Fr Stephen De Young","text":"Or Portugal or Spain. And so his idea was to colonize the Slavic lands. His plan, his overarching plan was not even primarily focused on the Jews. Is primarily focused on. He wanted to kill 90% of the Slavs and enslave the rest and put them to work and make everything east of him greater a greater Germany essentially have. Have it as. As colonies. And all the stuff he wanted to do was the stuff that like Belgium had done in the Congo, that Britain had done in India, that Spain had done in various places, that the United States had done in Cuba at one point. And so the Roman Catholic Church along The way with the settlement of the New World. And these things had put similar elements of ideological superstructure in place that condoned that kind of behavior overseas."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3126.16,"end":3126.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3126.56,"end":3153.45,"speaker":"Fr Stephen De Young","text":"Condoned that kind of behavior in the colonies because of what now seem horrifically racist comments about the native populations. One of the heroes of the settlement of Central and South America is Bartel Omeo de Las Casas, who managed to argue the Pope into seeing the indigenous people of north and South America as human. But in the process, he sold out Africans."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3154.97,"end":3155.45,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3155.93,"end":3163.3,"speaker":"Fr Stephen De Young","text":"And gave his blessing to the Pope. Blessing the slave trade from Africa."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3165.62,"end":3181.7,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. I just want to add one other piece of context, which is that, I mean, you know, this. This episode is not about anti Semitism, although there's like, you know, Right. When you start to reject the Old Testament, then this question kind of gets raised to some extent."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3181.7,"end":3188.19,"speaker":"Fr Stephen De Young","text":"It is tied up in this. Yeah, yeah. When you read 19th century biblical scholarship from Germany, like, it's the. There."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3188.43,"end":3189.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. But I mean, I just."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3190.27,"end":3191.47,"speaker":"Fr Stephen De Young","text":"The Old Testament, like."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3191.47,"end":3200.75,"speaker":"Fr Andrew Stephen Damick","text":"Like, I know that. That, you know, sometimes, you know, Orthodox people sometimes like to point the finger at our Protestant and Catholic friends and say, look at these problems you guys have had. We."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3200.75,"end":3201.15,"speaker":"Fr Stephen De Young","text":"We're."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3201.15,"end":3202.23,"speaker":"Fr Andrew Stephen Damick","text":"We've never had that issue."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3202.23,"end":3206.59,"speaker":"Fr Stephen De Young","text":"Whatever. Oh, no. The reality under the czar, there were similar things."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3206.99,"end":3207.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3207.75,"end":3210.87,"speaker":"Fr Stephen De Young","text":"In place. About Jews in Russia. In the Russian lands. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3210.87,"end":3216.79,"speaker":"Fr Andrew Stephen Damick","text":"I mean, there were literally like. Like most of Russia, Jews were not even allowed to live during what was called the Pale of Settlement."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3216.79,"end":3217.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3217.27,"end":3220.47,"speaker":"Fr Andrew Stephen Damick","text":"You know, like, they only could live west of a certain line. And they were."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3220.55,"end":3220.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3221.19,"end":3224.71,"speaker":"Fr Andrew Stephen Damick","text":"Treated super badly. You know, but this was."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3224.71,"end":3229.43,"speaker":"Fr Stephen De Young","text":"This question was specifically about Hitler and about Hitler because he was after the Slavs."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3230.55,"end":3230.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3231.11,"end":3335.45,"speaker":"Fr Stephen De Young","text":"That made the Russians and the Russian lands his natural enemies. Right? Yeah, yeah, yeah. So. But. But so where I'm going with this is so the Roman Catholic Church also had that ideological superstructure in place that could be used to justify those things. And I think one of the things that happens after World War II is that just the level of those atrocities and the fact that those atrocities were committed in Europe, so they were in front of everyone. Right. People in Europe and the United States didn't see what was happening in the Congo. Yeah, right. They didn't know. They didn't really know. But when it. When it was sort of revealed in their faces and everyone knew and couldn't avoid it, that started to break down that ideological superstructure, and those things have become much less justifiable now. Right. Much less justifiable now. And so I don't think it's directly related that now people are sort of reassessing the relationship between Old and New Testaments and that kind of thing. I think that's more related to discovering the Dead Sea Scrolls, some other textual discoveries and that kind of thing. But it has certainly cleared some space. Right. It has made those kind of ideas that were used to justify that kind of thing much more unacceptable. And being more unacceptable now kind of a space has opened up."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3337.13,"end":3341.29,"speaker":"Fr Andrew Stephen Damick","text":"That was a long response, Michelle. Does that answer your question?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3342.17,"end":3381.09,"speaker":"Avery","text":"Yeah, no, no, I'm just super grateful. That was really helpful. I think it's interesting to note that the first thing that the Germans did when they invaded Poland is to round up all the Catholic priests in these small villages and send them to Dachau. I mean, I have relatives who were part of the Slavic Holocaust, so I mean, I understand. I mean, people don't probably know. Thank you, Father, for mentioning that 11 million Slavs died as well as the 6 million Jews. So, yes, that was really, really helpful for the context. And it does. Yeah, it answers my question. I'm sorry to have taken up so much time."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3381.49,"end":3384.37,"speaker":"Fr Andrew Stephen Damick","text":"No, no, I mean, we can always cut you off. So."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3386.61,"end":3391.35,"speaker":"Fr Stephen De Young","text":"You think on this show we worry about going long. Is this your first episode?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3392.63,"end":3400.07,"speaker":"Avery","text":"Oh, no, no, I'm a devotee. You know, I've also. I've done over 300 hours of your other podcast, so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3400.07,"end":3402.31,"speaker":"Fr Andrew Stephen Damick","text":"All right. A true fan."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3402.79,"end":3403.35,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3403.59,"end":3404.15,"speaker":"Avery","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3404.23,"end":3406.15,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling into."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3407.83,"end":3408.91,"speaker":"Avery","text":"All right, bye."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3408.91,"end":3412.47,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right. Okay. Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3415.04,"end":3415.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3415.36,"end":3420.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So interesting list. Gnostics, dispensationalists, Nietzsche, Islam, modern, you know."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3420.96,"end":3424.2,"speaker":"Fr Stephen De Young","text":"Biblical scholars walk into and, oh, by."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3424.2,"end":3428.08,"speaker":"Fr Andrew Stephen Damick","text":"The way, you know, state worshiping, anti Semites."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3428.08,"end":3429.04,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3429.68,"end":3459.62,"speaker":"Fr Andrew Stephen Damick","text":"All have this one weird thing in common. Yeah, yeah. They on some level reject the Old Testament and want to, you know, separate it from the New Testament in one way or another. But isn't that justified? Isn't that what St. Paul said? We actually had someone ask in one of the comments, like, wait, you said the religion, the Old Testament religion, New Testament of the same religion? Well, St. Paul, he doesn't say that in his letters. He says the opposite. I responded, well, keep listening."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3459.86,"end":3462.58,"speaker":"Fr Stephen De Young","text":"Because literally, which of those categories he was in?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3462.82,"end":3464.74,"speaker":"Fr Andrew Stephen Damick","text":"The next thing we're going to talk. Yeah, exactly."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3464.9,"end":3468.42,"speaker":"Fr Stephen De Young","text":"Are you a modern scholar, a dispensationalist, a Muslim?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3468.77,"end":3469.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3469.05,"end":3471.25,"speaker":"Fr Stephen De Young","text":"Agnostic? Are you Friedrich Nietzsche?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3471.73,"end":3474.61,"speaker":"Fr Andrew Stephen Damick","text":"So if you are, please call into the show."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3475.17,"end":3482.37,"speaker":"Fr Stephen De Young","text":"Are you that hologram that Jordan Peterson was talking to me about? Listening to the show and in the YouTube chat wow."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3484.13,"end":3485.65,"speaker":"Fr Andrew Stephen Damick","text":"That's a story for another time."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3485.89,"end":3487.49,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3487.49,"end":3495.88,"speaker":"Fr Andrew Stephen Damick","text":"So what does St. Paul say about this? Does he regard himself as making some kind of disjunction from the Old Testament, from the Torah? So."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3495.88,"end":3498.36,"speaker":"Fr Stephen De Young","text":"Well, other than continually saying the opposite."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3498.76,"end":3499.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3499.56,"end":3533.35,"speaker":"Fr Stephen De Young","text":"Over and over and over again throughout the Book of Acts, there's lots. I mean, this in and of itself. We could do a whole episode on just St. Paul's view of the Torah. Right. And who knows what lies of the future. But that's not tonight. But we have just a couple of examples. Right. A couple of examples of the way St. Paul talks about the Torah that kind of put the lie to. To this idea that he was somehow opposed to it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3533.99,"end":3596.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So exhibit a, Romans, chapter 2, verses 12 through 16. He says, for all who have sinned without the law. And we should understand, by the way, that law in the New Testament is referring to the Torah. So I'm going to actually just go ahead and say the Torah, because I think that makes it a little bit clearer for us. For all who have sinned without the Torah will also perish without the Torah. And all who have sinned under the Torah will be judged by the Torah. For it is not the hearers of the Torah who are righteous before God, but the doers of the Torah who will be justified. For when Gentiles who do not have the Torah by nature do what the Torah requires, they are a Torah to themselves, even though they do not have the Torah. They show that the work of the Torah is written on their hearts, while their conscience also bears witness, and their conflicting thoughts accuse or even excuse them on that day when, according to my Gospel, God judges the secrets of men by Christ Jesus. Yeah. So this is."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3597.91,"end":3636.54,"speaker":"Fr Stephen De Young","text":"In the past. I've done my list of people who the Bible says kept the Torah perfectly, which gets many people upset among our Protestant friends. But one of those groups on the list is, from what we just read, some Gentiles. Yeah, right, some Gentiles. Because St. Paul isn't presenting this as a hypothetical. Right. Hypothetically, some Gentile could just, you know, be a really good guy and keep all the commandments even though he hasn't heard the Torah. He's saying this happens."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3636.86,"end":3641.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't say if Gentiles do this. He says when Gentiles do this, do."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3641.86,"end":3761.14,"speaker":"Fr Stephen De Young","text":"This, they show that this is an actual thing. Right. And St. Paul is using this as an argument against the Jewish Christians who he's writing to in Rome. Right. St. Paul writes the Epistle to the Romans after the Claudian Expulsion of the Jews from Rome to try to help reconcile, which was for two years to try to help reconcile the Jewish and non Jewish Christians in Rome. Right? And so in chapter one of Romans, he's spent some time talking about how horrible the Gentile world was before the gospel came into it, how sinful, how wicked, how idolatrous, right? But then he also, in chapter two, turns to the Jewish Christians and says, now before you get all excited, right, you had the Torah, right? Did you keep it? Did you actually keep the commandments? Because as St. Paul says, it's not the person who hears it. It's not the person who goes to the synagogue and hears somebody read the Torah, who's justified, who's in the right. Right. Who's a righteous person. It's the person who actually does what it says. And he's holding up. You know, there are Gentiles out there who have never heard the Torah in their lives, never seen a synagogue, don't know what a Torah is, right? But who have kept it better than you because it's written on their hearts. And those Gentiles who never heard a word of it are going to be at a better place, as he says at the end, right? When God, through Christ judges the world, they're going to be at a better place than you are if you heard the Torah and didn't keep it. Yeah, right. But so where in here is he saying the Torah is bad?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3763.62,"end":3771.66,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the opposite. He essentially says even the people who don't have it, they have it if they do it. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3772.14,"end":3806.44,"speaker":"Fr Stephen De Young","text":"And the mark of them being righteous people and being found to be righteous people on the day of judgment will be that they have kept it even without having heard it. And the condemnation of Jewish people who haven't kept it is going to be by the Torah. And notice he says this condemnation stuff he's talking about is when Christ returns to judge the earth, when Christ returns to judge the earth, they're going to be judged according to the Torah, he."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3806.44,"end":3811.68,"speaker":"Fr Andrew Stephen Damick","text":"Says, because Christ is in a very real sense, the last word of the Torah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3811.68,"end":3828.49,"speaker":"Fr Stephen De Young","text":"Right? And so it's not that you are judged. In the past, you were judged according to the Torah and now you're going to be judged according to something else. Yeah, no, which is superseded it. Right, right. That's not what he says, that he's writing entirely to Christians here."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3829.29,"end":3830.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3830.97,"end":3841.37,"speaker":"Fr Stephen De Young","text":"Jewish Christians and gentile Christians. Galatians 5, verse 14 is what I quoted earlier when I was. I was joking about the different phrasing, right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3841.61,"end":3848.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where he says, you know, for the whole law is fulfilled in one word, you shall love your neighbor as yourself."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3849.93,"end":3854.57,"speaker":"Fr Stephen De Young","text":"Right. Totally different than what Jesus said because it's phrased somewhat differently in the Greek."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3856.17,"end":3856.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3857.77,"end":3900.26,"speaker":"Fr Stephen De Young","text":"And so. And we could go on and on and on. And again that these are from Galatians and Romans. Galatians and Romans are the two epistles where he supposedly is saying bad things about the Torah. Right. He tells El Sor, the one who loves, keeps the whole Torah. Right. Like he's taking the same approach to the Torah that Jesus did. He's taking the same approach to the Torah that Jesus did. But we have this fundamental fact that we've already mentioned that in the church throughout her history, the Torah has been seen to apply to Jewish Christians and Gentile Christians differently."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3902.73,"end":3902.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3903.53,"end":3918.73,"speaker":"Fr Stephen De Young","text":"At bare minimum. And the answer to why this is. Right. The answer to why I can enjoy a good crawfish boil here even during Lent is found in Acts, chapter 15."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3919.37,"end":3920.01,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3920.33,"end":3927.06,"speaker":"Fr Stephen De Young","text":"Which, interestingly enough, is another place people go when they're trying to say the law has been done away with. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3928.34,"end":3932.1,"speaker":"Fr Andrew Stephen Damick","text":"That's like, read the. Read the chapter, everybody."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3933.3,"end":3937.7,"speaker":"Fr Stephen De Young","text":"So what happens in Acts 15 is called the Council of Jerusalem."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3937.94,"end":3949.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the apostles getting together to talk about basically the big controversy about gentiles becoming Christians. Do they need to be circumcised?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3949.7,"end":3987.66,"speaker":"Fr Stephen De Young","text":"Do they need to be circumcised to receive the Eucharist? Too often that Eucharist part gets left out. Yeah. And calling it a council is kind of anachronistic and kind of not. It's anachronistic in the sense that we're using council the way we talk about later church councils. Right. And this is obviously before councils were a formal thing, but at the same time, the Council of Jerusalem really sets the paradigm and the structure, including the phrasing of the proclamation at the end that's going to be used in later church councils."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3987.66,"end":3996.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they'll all say, it seemed good to the Holy Spirit and to us. Which is literally a quotation from the Apostolic Council in Jerusalem."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":3996.14,"end":4018.89,"speaker":"Fr Stephen De Young","text":"Yeah. So this is sort of the UR Council. Right. This is like ecumenical council. Zero or negative one, I guess, minus one, if we're doing the Godzilla thing. So, Right. There is this issue. Right. There's this issue about circumcision and it relates to the Eucharist."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4020.17,"end":4020.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4020.53,"end":4037.37,"speaker":"Fr Stephen De Young","text":"Because within Judaism, there was not. Let me say this first. Right. Just as today there were not Jewish people going around trying to circumcise gentiles and get them to Become Jews in general."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4038.64,"end":4041.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was not a evangelistic."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4041.52,"end":4042.96,"speaker":"Fr Stephen De Young","text":"Right. This was not a thing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4043.68,"end":4044.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4045.6,"end":4338.6,"speaker":"Fr Stephen De Young","text":"Not a thing that happened. So when we see these people from the party of the pharisees in Acts 15, so we see Pharisees wanting to circumcise gentiles, that should trigger. Somebody should go, wait a second. Why? Why would they want to do that? Why would they think that was necessary? Well, if you go back in Exodus to when the Passover was given, right. I believe this is in Exodus, chapter 14, during one of the reiterations, right. It is stated that everyone who eats the Passover must be circumcised. That Gentiles, right. Sojourners, could come and live in the land of Israel and not become Israelites. Right. They didn't have to to live there, but if they wanted to eat the Passover, then they and their household had to be circumcised and become Israelites. So Christ, of course, institutes the Eucharist at the passage. And the practice of the Eucharist and the way it was seen, as we've talked about in the show, our episode on the Eucharist and other places, is deeply embedded in what's going on in the Passover. And so this was viewed, right, by the early Christians as a ritual sacrifice that's very closely connected to the Passover. And so the question really was, yeah, it's cool that these Gentiles are coming because of the Messiah to come and worship the God of Israel with us. This is wonderful. This is beautiful. This is something that was prophesied in the Hebrew scriptures. When the Messiah came, this would happen. But are they allowed to eat the Passover? Right. Are they allowed to eat the Eucharist if they haven't been circumcised? So this is a question about how does the Eucharist that Christ instituted, how does that relate to the very particular set of commandments and regulations in the Torah? So this is a Torah question. Okay. This is a Torah question. And so these people from the party of the pharisees, with the one view, come to the apostles, led by St. James, who ultimately issues the decision, not St. Peter. I don't know why I had to point that out, but yeah, yeah. What does that mean to get a ruling? Right. What is the ruling for our communities? Right. You're the leaders. What is the ruling for our communities in terms of how we apply that part of the Torah in terms of our practice? Right. And so this is how the issue is ultimately decided is St. James, in particular, who we know Even from outside of the scriptures, even from, like Josephus was this incredibly pious Jewish man who knew the Torah, who spent so much time praying in the temple. He had calluses on his knees so his legs looked like camel legs. Right? That's what we're told by Josephus, renowned among all the Jewish people, even those who weren't Christians, for his piety. Right. He makes a ruling, and he makes that ruling based on the Torah, not based on setting aside the Torah. Because if you go to chapters 17 through roughly 23, people disagree whether it ends in 23, 24, 26. Because you know, you got to publish papers about something. There's what is called in Leviticus, the holiness code. And most of the commandments within the holiness code are prefaced with God speaks to Moses and says, say to the sons of Israel, da da da, da da. Right? So chapter 19 has a bunch of food laws, right? Say to the. The sons of Israel of the owl, the nighthawk and the sparrow, thou shalt not eat. Right? Because of course, Moses spoke King James English, as we know."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4339.56,"end":4345.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What else? Speak in my house, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4346.85,"end":4452.77,"speaker":"Fr Stephen De Young","text":"So. But there are other places. There are other places like Leviticus 18, which gives the commandments about sexual morality, where God says to Moses, say to the sons of Israel and all of the strangers and foreigners who live in the land, and then gives the commandments, right? So there are some commandments in the Torah on a very literal reading, in fact, most of the commandments of the Torah apply to Israelites, and then there is a subset of those commandments that apply both to the Israelites and to anyone who is living in the land. Yeah, right. Anyone who's living in the land. And so what St. James does is he looks at this and says, okay, well, these are Gentiles, right? I don't see anything in the Hebrew Scriptures. St. Paul will agree with this. He'll say the same thing. Remarkable how St. James and St. Paul actually agreed, sorry, Muslims, that says that these people are going to stop being. When they come to worship the God of Israel, they're going to stop being whatever they were. They're going to stop being Greeks, they're going to stop being Egyptians. They're going to stop. Right. In fact, quite the opposite. Right. What those prophecies about the nations say over and over again is that those nations and their kings are going to come and make these offerings, right? Are going to come and worship the God of Israel. It doesn't say they're all going to become Israelites ever."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4453.57,"end":4457.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All the nations will Come and worship Israel's God."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4458.13,"end":4489.15,"speaker":"Fr Stephen De Young","text":"Right. And so St. James says, they don't need to become Jewish. And therefore, since they're not becoming Jewish, they are only responsible for the commandments that are directed toward those who live in the land. They're not responsible for. Therefore they can eat an owl. Right. They can't be sexually immoral. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4489.15,"end":4490.67,"speaker":"Fr Andrew Stephen Damick","text":"And no idolatry."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4492.11,"end":4515.54,"speaker":"Fr Stephen De Young","text":"Right, right, no idolatry. And if you look in the Holiness code, the reason I brought up the Holiness code in particular is that there are four places where the commandments are applied to everyone and they are sexual, immorality, idolatry, and in two places that you can't consume blood, which this is."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4515.54,"end":4519.5,"speaker":"Fr Andrew Stephen Damick","text":"Literally the list that's agreed upon in Acts 15."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4519.58,"end":4620.24,"speaker":"Fr Stephen De Young","text":"Yeah, right, Acts 15. Those are the four commandments. That's why I focused on the Holiness Code. Right. So he literally says, here's the four commandments that everyone has to keep. So these are the ones, these are the ones that you need to keep, by the way. Those are still part of Orthodox canon law. Those still apply to you, including the whole blood eating thing. But. Right, but the other ones, if you're not Jewish, do not apply to you. God didn't command you to do those things. Right. And this is what. So for example, In Galatians, when St. Paul says to gentile Christians, if you go and get circumcised, you have to keep the whole law. This is what he means. Right. You want to become Jewish, you're going to have to become Jewish. Now he'll go further. He'll say other things. Like he'll say, you know, right now you have these promises in Christ. And so if you go and get circumcised, you're basically saying, ah, forget about Christ, I'm going to go keep Torah. Obviously that's a problem. Right. That's what he means by cutting yourself off from Christ. But he also makes the point, right now you're bound to the whole law. And this is how Romans 2 can work, by the way. Because if, when we went through Romans 2, you might have been thinking, really there was some random Roman out there who somehow never ate shrimp. Never. Right. Did any of those things. Right, right, right. He wasn't responsible for any of those things. He's not an Israelite. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4620.48,"end":4621.84,"speaker":"Fr Andrew Stephen Damick","text":"Gentiles keeping kosher."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4622.72,"end":4624.16,"speaker":"Fr Stephen De Young","text":"Right. Like, why would they."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4624.8,"end":4629.28,"speaker":"Fr Andrew Stephen Damick","text":"Like what, what weird confluence of coincidence."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4629.28,"end":4630.6,"speaker":"Fr Stephen De Young","text":"Would that have to be that there."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4630.6,"end":4632.56,"speaker":"Fr Andrew Stephen Damick","text":"Was some gentile somewhere keeping kosher."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4632.72,"end":4633.92,"speaker":"Fr Stephen De Young","text":"Yeah, accidentally."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4636.62,"end":4636.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4636.78,"end":4684.47,"speaker":"Fr Stephen De Young","text":"But that's not required of him. Right. That's not required of him by the Torah, right? And this is not, by the way, just to be clear, this is not something like St. James came up with. This is not like, oh, man, this is a real problem. What are we going to do? Well, here, hey, have you noticed this in Leviticus, right? There was already. This was already firmly established in terms of Jewish interpretation of the Torah. And an example of this from the Second Temple period. So pre Christian, the second Temple period is in the book of Jubilees. And the way it's presented in the book of Jubilees is not in terms of the holiness code, but in terms of Noah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4687.36,"end":4687.6,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4687.68,"end":4889,"speaker":"Fr Stephen De Young","text":"Because after the flood, right, Noah's the father of everybody, right? Shem is one of his sons. And then one of those sons goes on. From Shem's line comes Abraham, from Abraham's line comes Israel, right? But Noah's everybody's dad, whether you're European, African, Asian, right? And so the book of Jubilees goes there and comes up with basically the same list, right? Basically. Now murder is added. But I think we were kind of clear on the murder being bad thing, right? I don't think St. James needed to reiterate that. Two Gentile Christians, by the way, no murder, right? Did after, you know, theft, right? They're, you know. Yeah, but so this was already something. This was already a known principle that. And this is why. This is why Israelites and later Jewish people didn't go out and try to convert Gentiles, convert them in terms of. Right? They're happy for them to give up idolatry and worship the true God, but didn't go out and try and get them to get circumcised or try and get them to keep kosher, right? Try and get their neighbors to stop eating pork, right? Because that's not how they understood it. They understood it as, no, we don't. And that's not given to them. And so what St. Paul is constantly doing, right? St. Paul is not trying to make overarching rules or lay down principles or construct this new religion, Christianity, because he doesn't think there is one. St. Paul was a Pharisee his whole life. He was Jewish his whole life. So are the other apostles, right? Not Pharisees, but Jewish, right? Their whole lives, they didn't think they had a new religion at all, right? But what St. Paul in particular is doing, because he's going out and planting church communities in these pagan gentile cities that have a membership that is part Jewish Christian and part Gentile Christians, he's constantly working to navigate between those two and bring those two groups together as one. And everything he says about the Torah is in that context. It's not in the context of what still applies and what doesn't for all Christians or morality among non Christians. He's not talking about any of that. Right. It's how do Jewish Christians and Gentile Christians who live differently in some ways but share a certain part of their life as Christians together, How do we keep them together? How do they live together? How do they function together? That's what he's doing. Yep. Yep."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4889.32,"end":4912,"speaker":"Fr Andrew Stephen Damick","text":"I also want to recommend everyone, by the way, if you want a really long and detailed description of what's going on in the Book of Romans. You know, Father Stephen has that on the whole Council of God podcast, so. All right. Well, it's been a good beefy first half. We're going to go ahead and take our first break, and we'll be right back with the next half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4912.8,"end":4929.11,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4951.91,"end":4981.7,"speaker":"Fr Andrew Stephen Damick","text":"Blessed are the legend makers with their rhymes of things not found within recorded time. J.R.R. tolkien since the very dawn of humanity, myth, legend and story have communicated history, meaning, identity, and the highest truths about the world, both seen and unseen."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4982.98,"end":4995.54,"speaker":"Fr Stephen De Young","text":"Who are we as human beings? Who is God? What is the true shape of our great cosmos? Who are the gods, the heroes, the monsters, the angels, the demons, the spirits."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":4995.78,"end":5020.87,"speaker":"Fr Andrew Stephen Damick","text":"That inhabit and touch our world? Both in ancient Israel and from when the Christian church arose in the first century, continuing to our own day, the people of God have not only told their own tales, but also recorded, preserved, rewritten, commented on, and found edification in the great epic tales of the pagan nations."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5022.39,"end":5036.26,"speaker":"Fr Stephen De Young","text":"No less a church Father than St. Basil the Great said that the prophet Moses studied Egyptian learning. The prophet Daniel studied Chaldean lore, and he demonstrated his own extensive familiarity with Greek paganism."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5036.66,"end":5039.02,"speaker":"Fr Andrew Stephen Damick","text":"Through this, he said, we can trace."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5039.02,"end":5042.34,"speaker":"Fr Stephen De Young","text":"The silhouette of virtue in the works of paganism."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5043.86,"end":5050.5,"speaker":"Fr Andrew Stephen Damick","text":"Have you ever wondered why the ancient myths and legends survived when their religions died out centuries before?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5051.14,"end":5053.54,"speaker":"Fr Stephen De Young","text":"Or what shaped Christian monster lore?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5053.78,"end":5056.98,"speaker":"Fr Andrew Stephen Damick","text":"Or why Saint Paul quoted pagan Greek authors?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5057.78,"end":5061.44,"speaker":"Fr Stephen De Young","text":"Or why the legend King Arthur, keeps being revived?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5064.08,"end":5080.8,"speaker":"Fr Andrew Stephen Damick","text":"I'm Father Andrew Stephen Damick. And I'm Richard Roland. In this video podcast, we'll read the myths, we'll recount the legends, and we'll ask how they point us in one way or another to the most high God and to his son, Jesus Christ."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5083.12,"end":5085.75,"speaker":"Fr Stephen De Young","text":"Welcome to the Great tales."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5090.15,"end":5104.31,"speaker":"Fr Andrew Stephen Damick","text":"Coming fall 2024 from Ancient Faith Radio. Subscribe now on YouTube or wherever you get podcasts."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5110.39,"end":5126.55,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5128.79,"end":5139.07,"speaker":"Fr Andrew Stephen Damick","text":"Everybody. It's one of my favorite commercials that we just heard. It's a nice long one. So. Yes, yes, go ahead."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5139.07,"end":5140.55,"speaker":"Fr Stephen De Young","text":"Sorry, I was taking a power nap."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5141.03,"end":5145.48,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wake up, Father Stephen. Get back to work. Yeah, yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5145.56,"end":5155.32,"speaker":"Fr Stephen De Young","text":"So you really, you really missed an opportunity there, you guys, to do the. I'm Father Andrew Steven Damek. And I'm Richard Roland. And we are."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5158.52,"end":5159,"speaker":"Fr Andrew Stephen Damick","text":"Wonderful."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5159,"end":5162.16,"speaker":"Fr Stephen De Young","text":"I don't know what you would have said because we are the Great Tales, right? Yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5162.16,"end":5162.8,"speaker":"Fr Andrew Stephen Damick","text":"No, it's just."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5162.8,"end":5167.24,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. You know, maybe we are the defenders of the earth. I don't know."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5167.24,"end":5195.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And this one is on YouTube, everybody. So look up the great tales on YouTube and you can, can, you can subscribe and check out the trailer. Last time we played this commercial, you know, I told everybody that one of my podcasts was going to die because this new one is being born later this year. And, and people got freaked out. They're like, wait, is it, is it Lord of Spirits that's dying? Is it, is it aman? Is it, is it the areopagus? Is it something else? And it has not yet been revealed what it will be."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5195.95,"end":5214.12,"speaker":"Fr Stephen De Young","text":"So I like the mental image that you just gave of each of your podcasts, beginning in this parasitic phase and then consuming one of your previous podcasts and leaving its withered, hollowed out husk behind as it emerges to life."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5214.6,"end":5220.44,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. I mean, there's only so much time one has in the day."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5222.92,"end":5229.78,"speaker":"Fr Stephen De Young","text":"Also, I will point out that every episode of this podcast is the last episode until the next one comes out."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5230.02,"end":5236.86,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Well, especially when the next one, when the next episode comes out, then the previous one becomes the last episode is even more so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5236.86,"end":5237.7,"speaker":"Fr Stephen De Young","text":"The last episode."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5237.7,"end":5242.42,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. So that, you know, that last episode we did, that was our last episode."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5242.74,"end":5243.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5244.26,"end":5245.3,"speaker":"Fr Andrew Stephen Damick","text":"Now we're on this one."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5245.78,"end":5246.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5246.22,"end":5266.27,"speaker":"Fr Andrew Stephen Damick","text":"So, yes. So we're talking Torah, Torah and Torah or Torah, Torah, Torah. And I think we actually do have some. I'm not sure. It looks like there's some calls coming in, but let's do this. Yeah, that's Right. So is there anybody we could connect with now?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5266.51,"end":5268.83,"speaker":"Fr Stephen De Young","text":"I'm going to Leroy Jenkins this first call."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5269.15,"end":5279.3,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. So, okay, well, we have Bob calling. His phone says it's from Massachusetts, but who knows? Where is Bob? Where are you, Bob?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5280.58,"end":5281.78,"speaker":"Avery","text":"Can you hear me, Fathers?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5282.02,"end":5284.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome to the Lord Spirits podcast."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5285.62,"end":5293.7,"speaker":"Avery","text":"All right, outstanding. Yeah, I. I do normally live in Massachusetts. I'm in Korea right now, so it's. It's the morning show for me."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5294.18,"end":5296.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. You do sound like you're from Massachusetts."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5296.38,"end":5301.22,"speaker":"Fr Stephen De Young","text":"Yeah, I was gonna say I still hear a little Massachusetts. So they could take you out of Massachusetts, but not it out of you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5301.22,"end":5308.49,"speaker":"Avery","text":"You can't. You can't take. I'm from the North Shore of Boston. You can't escape it. All right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5309.21,"end":5310.33,"speaker":"Fr Andrew Stephen Damick","text":"What's on your mind, Bob?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5311.69,"end":5330.97,"speaker":"Avery","text":"So I just had a quick clarifying question, Fathers. So I'm wondering. So my understanding is that we understand the church to be Israel, right? Am I correct in this before I continue?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5331.53,"end":5332.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5333.22,"end":5353.3,"speaker":"Avery","text":"All right. So I guess I'm just wondering, like, I. If we understand the church to be Israel and we are all, you know, full, you know, participating members of the church, which is Israel."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5353.78,"end":5356.1,"speaker":"Fr Andrew Stephen Damick","text":"You know, I'm not."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5356.82,"end":5371.86,"speaker":"Avery","text":"I'm not quite still understanding how even though we are Gentiles, we are treated according to the law and stuff, still like foreigners and sojourners. Does the question make sense?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5372.58,"end":5431.45,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure. Yeah. Well, I mean, there's a couple ways to understand it, right? Like, on the one hand, there is this, and this probably be a good future episode, I think, Father. But there's the sense that the church is the reconstitution of Israel because of Israel having been scattered into the nations. Right? Those. Those 10 northern tribes having been scattered into the nations. So there is this regathering of Israel. Right. But also that Israel is not the same thing as being Jewish. Right. I mean, the word Jewish or Judean refers to Judeans, but. But someone can participate in Israel without being Jewish. Like, that is an actual possibility. Right? So. Well, yeah, we'll talk more about that, but I don't know. Father, do you want to. You want to address this?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5431.93,"end":5613.74,"speaker":"Fr Stephen De Young","text":"Yeah. So the. One of the key things, and this really comes out of St. Paul is. Is that he doesn't see. Not only does he not see different. So I don't like. Even though the Latin word gentiles means nations, I don't really like Gentiles because it has these ethnic connotations now, but people from different nations, right? Because nobody's like, just a gentile right. We're from somewhere, right. We're something in particular. But not only does St. Paul not see people from all these other nations coming and becoming Jewish in order to enter the church, he also doesn't see everyone, including Jewish people, Greek people, Roman people, Ethiopians, Egyptians. Right? The people who St. Paul would have encountered. Samaritans, right. Syrians. He doesn't see them coming into the church and no longer being Egyptians or Greeks or Jewish or any of these things, right? So it's neither extreme. It's not sort of we come into the church and now we're just Christians and we're not any of those things anymore. And it's also not on the other side. Well, we all. We all become Jewish, right? And this comes out of the prophecies about the nations coming to worship the God of Israel that talk about the nations bringing their treasures, right? Bringing in their treasures to give to God and the understanding that those treasures are all of the uniqueness and all of the particularity of. Now we have a more expansive list of Greek culture, Italian culture, American culture, right. Mexican culture, Korean culture, Russian culture, right? All of. All of the best. All of the treasures of those particularities we bring with us when we become Russian Christians, Korean Christians, American Christians, Greek Christians, French Christians, et cetera, et cetera. And in terms of the sojourners issue, I think the way that's dealt with in the New Testament is not by. I mean, on one hand, St. Paul will say things like, you who were far off have now been brought near, right? And he's very much wanting to argue in Romans like, no, neither the Jewish Christians nor the Christians from the nations are second class citizens, Right? Neither of them are second class citizens. But the way that's resolved seems to me to be with what St. Peter says, which is we should all be living like aliens and sojourners in this world."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5616.14,"end":5616.7,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5616.86,"end":5639.37,"speaker":"Fr Stephen De Young","text":"That none of us should be seeking power and authority in this world. Right. None of us should be seeking to control institutions in this world. Right. That all of us should be living that way, whether Jewish or not, as Christians, because our actual homeland, our ultimate homeland, right. Is one that we will all share together."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5641.21,"end":5641.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5641.57,"end":5647.45,"speaker":"Fr Stephen De Young","text":"In the. In the new heavens, the new earth and the life of the world to come. Does that make sense?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5648.57,"end":5650.17,"speaker":"Avery","text":"Yes, it does, Fathers. Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5650.81,"end":5652.65,"speaker":"Fr Andrew Stephen Damick","text":"All right. Thank you very much for calling."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5654.41,"end":5662.53,"speaker":"Fr Stephen De Young","text":"I wonder if you can get Dunkin Donuts coffee in Korea. If not, I feel for the man. He might go into withdrawal."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5662.77,"end":5676.33,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's. I can't even. I Think it's gotta be sometime in the morning there in Korea. I'm not sure what the time zone is there, but yeah, we've got people except Antarctica. We have people on every continent listening tonight. That's cool."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5676.33,"end":5678.85,"speaker":"Fr Stephen De Young","text":"If you were at the Russian research station, call us now."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5679.25,"end":5694.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we will have, I don't know, some kind of crazy record or whatever. But, yeah, yeah. So. All right, thank you very much for calling us by, Bob. We're going to go ahead and take one more question before we move on. This one comes from Daniel. So, Daniel, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5696.83,"end":5698.27,"speaker":"Avery","text":"Hi, fathers. Can you hear me?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5698.59,"end":5701.15,"speaker":"Fr Andrew Stephen Damick","text":"We can hear you. What's on your mind?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5702.43,"end":5737.52,"speaker":"Avery","text":"All right, so my question was about Noah, and he took, you know, it said that he took two of every kind of animal and seven of every kind of, you know, clean animal on the ark. And so I was wondering, well, you know, he's not Jewish. That's not a thing yet. And so what's up with there being a difference with clean and unclean animals? At least one that, you know, he knows about, that he can appreciate."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5739.28,"end":5751.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What's with that? I mean, it seems kind of anachronistic. You know, the, the, you know, the clean and unclean stuff hasn't been given yet. So what. What's that about? F. Stephen so the."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5753.34,"end":5790.73,"speaker":"Fr Stephen De Young","text":"There are a couple pieces here, but we have to remember Genesis is. Is the prologue to the Torah. Right? It's part of the Torah. The narratives are part of the Torah sometimes. This is one of the reasons why I think it's better to just go back to calling it the Torah instead of using the word law, because when we hear law, we just think about commandments. Right. There's a lot of stuff beyond just commandments. And so there are a lot of things in Genesis that, you know, I mean, starting with chapter one, in the beginning of chapter two, God creating the world in seven days and the whole thing with the Sabbath. Right. And then the Sabbath commandments aren't given until Exodus."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5792.41,"end":5793.77,"speaker":"Avery","text":"Right, Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5793.77,"end":5913.7,"speaker":"Fr Stephen De Young","text":"Even though they're sort of presented in Genesis as being built into creation. So in terms of clean and unclean animals, there are a couple things going on there, and we're actually going to get into this more. I'm going to answer your question. I'm not punting, but we're going to get into this more in our next episode. We're going to be particularly talking about the concept of clean and unclean in our next episode in some depth. But to answer the question now, with animals, the primary distinguisher between clean and unclean in terms of eating is what we would call domesticated animals versus wild animals, with a few exceptions. Donkeys, for example, being one of those exceptions, but one of the primary. So, and then there are certain classes of animals, like scavengers, predators. Right. That are unclean. Right. For different, you know, you might be obvious why they're unclean. Right. They prey on other scavengers, eat dead bodies, and dead bodies are unclean. Right. So you can't eat a bug or a vulture. Right. And so because that is based on something about the animal itself. Right. That means that something that Noah could take into account even if he didn't necessarily see it in clean and unclean terms, the same way Leviticus would lay it out, there are certain animals. Clean animal. Clean animals could be used for sacrifices, for example, because they could be eaten. Right. So the idea is he's. He's taking animal. More of those animals with him so that they're animals. He didn't have permission to eat them yet. Right. In general, but the offer is burn offerings. Right. That kind of thing. There needed to be more of those. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5913.94,"end":5914.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5915.7,"end":5916.26,"speaker":"Avery","text":"Okay."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5916.9,"end":5921.86,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, Daniel, thank you very much for calling in. And stay tuned. We're gonna."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5921.86,"end":5922.26,"speaker":"Avery","text":"Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5922.34,"end":5954.87,"speaker":"Fr Andrew Stephen Damick","text":"You know, in a future episode, I think the next episode, we're going to talk a lot about more. A lot more about that clean and unclean stuff. So. Because I know that's something that people think about a lot. So. All right. Okay, so in this half, we're going to begin talking about some of the basic principles of what the Torah is about and talk about exactly what it means that these are fulfilled by Christ as. As the New Covenant. Right. So how does that actually work out? Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5954.87,"end":5955.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5955.23,"end":5961.19,"speaker":"Fr Andrew Stephen Damick","text":"Again, we don't need to reinvent the wheel. We. We know. We know how this works out. So."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":5961.59,"end":6033.39,"speaker":"Fr Stephen De Young","text":"So, yeah, so first half, we were zoomed way out and just talking about the Torah as such. Right. And now we're zooming in sort of halfway, and we're going to zoom in tighter on a few things next time. But so in these last two halves, we want to lay out a couple of sort of core principles that run all through the Torah and talk about how those core principles that run through the Torah run straight through into the New Testament and into the life of the church. Right. And then next time we'll be getting into more particulars. So the first sort of core principle that we're going to talk about in this half, Right. Is this idea of the Torah as a Series of structures, sometimes literal structures, sometimes more figuratively, that allow God to dwell safely among his people. Right. So we've talked before on the show about death by holiness."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6034.19,"end":6035.39,"speaker":"Fr Andrew Stephen Damick","text":"The other dbh."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6036.11,"end":6058.86,"speaker":"Fr Stephen De Young","text":"Yes. May they not cross paths. I'm in a feeling generous and charitable. So there is. There's this danger, not for God, for us, for humans, for sinful humans. Presented by God's holiness."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6060.38,"end":6060.7,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6060.7,"end":6153.24,"speaker":"Fr Stephen De Young","text":"By the holiness of God, by God's complete otherness, by his goodness. Right. By his. And I don't know how much I want to go down this rabbit hole. I won't go down this rabbit hole too much. But again, as we've talked about before the show, we are talking about the divine energies here. Right. So. And that's really how to understand this. Right. There's imagery used in the scripture. Most common imagery is fire. God is a burning fire, a consuming fire, a fire consuming the unworthy. Yeah. But what this is getting at is, for example, one of the divine energies is justice, Right? Meaning God is continually, eternally putting things. Right and putting them in order. Right. Well, if you are a profoundly unjust person, then for you to encounter God, putting things in order is going to be a painful experience. Yeah, yeah, right. Or God being good and therefore driving out evil. Right. If you are evil, this is going to be a bad experience. Right. And this is what we see even when we're not talking about death by holiness, like where Isaiah comes into the presence of God. Right. And doesn't jump up and down happily. Right. And say, oh, wow, this is so cool. I get to see God."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6153.64,"end":6158.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it's. I'm a man of unclean lips from people of unclean lips. Like, oh, I'm undone. This is not good."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6158.88,"end":6162.52,"speaker":"Fr Stephen De Young","text":"Yes. It's tearing your clothes. It's woe is me."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6162.92,"end":6164.76,"speaker":"Fr Andrew Stephen Damick","text":"Even though he's a righteous man."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6165,"end":6295.55,"speaker":"Fr Stephen De Young","text":"Yes. He's one of the righteous and that's his experience of God. Right. So. Right. That's. That's what we're talking about here. And so nevertheless, God loves his people and wants to live with them and among them and share his life with them. Right. And so certain structures need to be put in place to allow that to happen. Right. In a way that will be beneficial to humanity rather than the opposite. Right. Because God doesn't want to inflict excruciating pain on his people all the time. Right? So we see this problem already laid out in Genesis, Right? Because as we were just saying to Daniel, right. Genesis is the prologue to the Torah. It's setting things up for the Torah and one of the things that sets up is the problems that the Torah is aimed at. Right. The rest of the Torah is going to be aimed at that what's given at Mount Sinai is aimed at. Right from the beginning. We see this right away in Genesis, chapter three, the expulsion from paradise. Right. Adam and Eve are cast out of paradise because having become sinful, having come to know evil, they can no longer exist in a positive way in the presence of God. And remember, this is why God gives them mortal flesh. This is why death comes into the world as a mercy. Right. God said it is not good for them to live forever, eternally in this state knowing evil. Right. Much less that they would live eternally in that state in the presence of God, which would be torment, which would be hell. Yeah, Right. Which God does not want for them. And so he expels them Right. From Paradise. And the cherubim is put there with the flaming sword. Right. Why is he there? He's not there to protect God from people."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6295.95,"end":6299.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not to prevent, you know, breaking and entering or whatever."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6299.15,"end":6331.38,"speaker":"Fr Stephen De Young","text":"It's. It's to stop people in their sinful state from trying to draw close to God. Yeah. Right. So it is another example, this cherubim is another example of how God has allowed for physical death as a means to help humanity avoid spiritual death, which is far worse. Remember, physical death is the separation of the soul from the body. Spiritual death is the separation of our soul from God."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6332.02,"end":6370.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it calls to mind the thrice holy hymn where the angels sing, holy, holy, holy, Lord of hosts. It's not just saying God is awesome, but it's really that sense that God is set apart, is separate, is utterly different from mankind. And so it is a praise of God, but it's also kind of a warning to a sinful creation. Holy. You know, that's why we call it death by holiness. So, you know those throne guardians, the cherubim and seraphim singing that song."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6372.65,"end":6372.81,"speaker":"Fr Stephen De Young","text":"To."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6372.81,"end":6381.33,"speaker":"Fr Andrew Stephen Damick","text":"Say, this is a dangerous place. Powerful place. Dangerous also, you know, so I'm."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6381.33,"end":6392.25,"speaker":"Fr Stephen De Young","text":"I'm not sure because I was told over and over and over and over and over again that our God is an awesome God. Oh, man. So, wow."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6394.89,"end":6396.73,"speaker":"Fr Andrew Stephen Damick","text":"Kicking it old school tonight, huh?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6396.81,"end":6398.41,"speaker":"Fr Stephen De Young","text":"So moving on in Genesis."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6402.22,"end":6404.14,"speaker":"Fr Andrew Stephen Damick","text":"A lot of triggered people listening right now."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6404.14,"end":6414.1,"speaker":"Fr Stephen De Young","text":"Oh, yeah, yeah. Sorry, folks. It's not just that they're triggered. It's there are people out there who are going to have that stuck in their head all night."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6414.1,"end":6414.54,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6414.54,"end":6441.99,"speaker":"Fr Stephen De Young","text":"For that, I apologize. That is a fate none of you deserve if you listen to this show. So moving on. In Genesis, the next place we see this play out is the Flood. Right. Preceding the Flood, what does God say? I can abide with men no longer. Right. You got 120 years left and then it's over."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6442.31,"end":6448.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which doesn't mean, by the way, like, I can't take you people anymore. It's literal."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6448.71,"end":6458.33,"speaker":"Fr Stephen De Young","text":"Right. His presence because they've become so evil. Right. The text says that their every thought was always evil all the time."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6458.81,"end":6459.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6461.21,"end":6491.64,"speaker":"Fr Stephen De Young","text":"Which, you know, I've been pretty bad at various points in my life, maybe all of them, but I don't think I've ever been quite that bad. Have a good thought once in a while. Not my own. Right. Comes from somewhere else. But. But so because humanity has come to that state, God can't dwell with him anymore. And God's presence ends up destroying humanity in the flood, which, as we've talked about before, is basically uncreation."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6492.52,"end":6493,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6493.8,"end":6510.29,"speaker":"Fr Stephen De Young","text":"And then a recreation on the other side of it. And so God then sets his bow like a bow and arrow in the clouds. He says, I will not make war against humanity again. And then we see In Genesis chapter 10, the whole cycle starts again."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6510.69,"end":6511.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6511.01,"end":6599.68,"speaker":"Fr Stephen De Young","text":"We get Nimrod, like the giants. We get see all of these things coming up to the tower of Babel. And so God is not going to destroy humanity again. And so he withdraws. He withdraws. So his presence is no longer there. Therefore it's no longer dangerous. The problem is God withdrawing. God's presence no longer being among humanity doesn't make things better for humanity. Yeah, right. Things are bad. They stay bad. And so when we get to Abraham In Genesis chapter 12, this is the beginning of the story of God drawing near to his people again. And we aren't told. Right. We were told at the flood, Right. That Noah is righteous among his generation. Like he's. There's this one guy, right. Who is not. His thoughts are not always evil all the time. Right. And that's why God saves and preserves him. But we're not told that about Abraham. We're not told about Abraham. Oh, hey, you know, there's. Even though things are pretty bad, there's this one guy in Ur who's got it all together, right. Who's one of those Gentiles who just was doing what he was supposed to be doing, even though he hadn't heard anything from God about it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6600.16,"end":6604.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and if you follow the life of Abraham, you know, he needs some work."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6605.04,"end":6720.47,"speaker":"Fr Stephen De Young","text":"Yeah. He has an ark, an Arc of growth as a person in his. What is literally described as a friendship with God. But God comes and appears to him. Right. And this is a key thing here in the Torah is that it's not that humanity repents and all becomes righteous. And God says, okay, well, now I can draw near to you again because now it's safe. Right. God chooses to draw near to humanity, even though we're still talking about sinful humanity. Right. But there is still this problem that plays out. It plays out in a really subtle way. You got to really be paying attention as you read the patriarchal narratives of Abraham and Isaac and Jacob and Joseph and the rest of Jacob's sons. But there is this descent, there is this ongoing problem. And one of the very subtle things that a lot of times people don't notice is God appears in person to Abraham and comes and sits and eats with him. Right. Appears to him over and over again. He appears at a couple of points to Isaac. He comes and he appears to Jacob a couple of times. One of those times they get in a fight. Yeah, right, yeah. And he gets renamed Israel. So you go from, you know, hosting God for dinner to wrestling him to the ground. Right. Things are changing. And then by the time you get. By the time. By the time you get to Jacob's sons, God doesn't appear to any of Jacob's sons. Joseph has dreams and interprets dreams."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6721.59,"end":6724.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's. It's less. It's more distant."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6724.71,"end":6728.51,"speaker":"Fr Stephen De Young","text":"Right. And so God can only draw so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6728.51,"end":6728.79,"speaker":"Fr Andrew Stephen Damick","text":"Close."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6730.79,"end":6752.2,"speaker":"Fr Stephen De Young","text":"To sinful humanity without it becoming dangerous. And so when G D gives the Torah at Sinai, a major element of what's going on in the Torah is going to be okay. Here's how God can now draw close to a sinful people, live and dwell among them, share his life with them and have it be safe for them. Yeah. If they follow this, which they won't."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6752.92,"end":6761.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Yeah. Like this is what you need to do so that when God draws close to you, you don't. You don't die."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6762.52,"end":6769.24,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. And so when I said sometimes this involves literal structures, I mean, like the tabernacle."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6770.13,"end":6807.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And, and, and just to remind everybody what the tabernacle is, I think sometimes they think, you know, it's a. It's a building. It inc. No, it's actually not a building in the sense that we think of buildings. Like, it's a sort of a big fence. Right. And there's a big open space in that fence. And inside there there's a tent. A big tent. And Inside that tent, there's a smaller tent, Right? So you've got these layers of. Of enclosed. Enclosedness. Enc. Where most people are outside completely most of the time. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6807.47,"end":6808.39,"speaker":"Fr Stephen De Young","text":"Outside the fence."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6808.39,"end":6814.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. They don't even get to go inside the fence. Only the priests go inside the fence. If I remember correctly, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6814.75,"end":6836.28,"speaker":"Fr Stephen De Young","text":"There are priests and Levites inside the fence. There are priests who, during their time of service, go into the outer tent of the tabernacle. And then the high priest, once a year goes into the inner tent, right? The Holy of Holies once a year. Just the high priest, Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6836.52,"end":6836.92,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":6839.72,"end":7000.94,"speaker":"Fr Stephen De Young","text":"So there are these sort of concentric circles, right? And really, the fence is not the last one. The edge of the Israelite camp is the last one, Right. Or later, when we're talking about the temple, the borders of Israel is the last one. Or Judah, Right. Judea. Right. Is the last sort of concentric circle. And the closer you go in within those concentric circles, the higher of a level of holiness and purity is required of the human person. Right? So this is part of why we have not. Part of why this is the primary reason why we have. The division we were talking about in the first half between commandments given to the Israelites and commandments given to everybody else is that God was not dwelling in Egypt in the tabernacle, right? God was not dwelling on Crete in the tabernacle. He was not dwelling in Damascus in the tabernacle, Right. He was dwelling in Israel in the tabernacle. And so the Israelites in that most outward concentric circle had to maintain this level of holiness and purity, higher than the people of the other nations, right? And then the Levites and the priests who were going to go into the courtyard of the Tabernacle had to maintain a higher level. They had to engage in more ritual washings. They had to eat different foods. The priests, during the time of service, when they went into the outer tent, right. They would have shifts. They would have days where they would do it. And during those days, they had to abstain from their wives. There's a whole other. Right. They had to take everything to another level. And then finally, the high priest on that one day had to go to this very highest level and had to create this cloud of incense so he wouldn't see God and die and had to enter with blood and had to offer these sacrifices for his own sins first before he could even start the rest of the ritual. And on and on, right? This highest level, the closer you were going to go in the higher level of Purity, someone had to maintain. There are two main kinds of purity when we're talking about the Old Testament. And this will come up again in our next episode when we're talking about clean and unclean. But those two kinds of impurity or kinds of purity are moral purity and ceremonial purity."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7001.9,"end":7003.9,"speaker":"Fr Andrew Stephen Damick","text":"Not the same thing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7004.14,"end":7047.47,"speaker":"Fr Stephen De Young","text":"Right? Not the same thing. And if you don't understand that these are different things, you will not understand the Torah at all. So if you became morally impure. Right. You were also ceremonially impure, meaning you murder someone, you are now morally impure. You are also ceremonially impure, meaning you don't need to be going into the tabernacle after you murder somebody. That'll have a bad result if you try to draw close to God immediately. Right. Without purifying purifications."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7048.35,"end":7057.23,"speaker":"Fr Andrew Stephen Damick","text":"Ceremonial impurity is about not being ready to go into the tabernacle or in some cases, near it. Right, right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7057.23,"end":7058.91,"speaker":"Fr Stephen De Young","text":"To whatever level you were allowed or."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7059.55,"end":7082,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And, and there were things that could make you ceremonially. Ceremonially. Easy for me to say, impure, that were not moral impurities. So like touching a Torah scroll or touching a dead body, going to the bathroom. Like, these were things that made you ceremonially impure. So you couldn't, you know, you couldn't."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7082,"end":7085.64,"speaker":"Fr Stephen De Young","text":"Go into the tabernacle until you washed and were purified. Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7085.64,"end":7096.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You had to be purified first. But these are not moral impurities. It's not a sin to touch a Torah scroll. It's not a sin to bury your dead grandfather. Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7096.84,"end":7099.64,"speaker":"Fr Stephen De Young","text":"Yeah. But in fact, quite. Quite the opposite."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7100.37,"end":7100.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7100.93,"end":7132.35,"speaker":"Fr Stephen De Young","text":"Some of the good works were seen as the greatest good works. Right. From the perspective of the Torah, were things that required a person to contract ceremonial impurity on behalf of someone else. Yeah. So if you want an example, Tobit in the Book of Tobit. Right. The great good thing he does before God is he goes and he buries the dead who have been left unburied. While doing that requires you to touch and handle dead bodies."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7133.95,"end":7139.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So unclean does not equal sinful, bad."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7139.79,"end":7241.46,"speaker":"Fr Stephen De Young","text":"Right. And in fact, being willing to do that, meaning you're not going to be able to enjoy the full communion. Right. Of the rest of the people and with God for a time until you're purified. Being willing to do that for the sake of helping someone is seen as this great, great, good thing you could do. This is in the background of the parable of the Good Samaritan. This is why the priest and the Levite pass by on the other side of the road. Because they're more concerned about preserving their own ceremonial purity than they are about helping someone in need because that person is bloody and beaten. Whereas the Samaritan is already, by virtue of being a Samaritan, ceremonially unclean. Right? And so he goes and he helps, right? He goes. This is in the background there, right? And this dynamic, this dynamic of being willing to become unclean for the sake of someone else is also something that's going on. And I'm not going to elaborate on this right now just because it's a whole other thing. But elsewhere, at some point we'll discuss this more. This is part of what's going on in the understanding of Christ's incarnation as a descent for our sakes. But we'll get into that. But so, yeah, ceremonial impurity, not sin, Right. Even though sin also makes you ceremonially impure."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7242.66,"end":7246.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. One causes the other, but the other doesn't cause the one."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7246.98,"end":7289.37,"speaker":"Fr Stephen De Young","text":"Right. And we're going to be focusing in more on moral purity and sin in the third half coming up here. But so there may be some folks who think, well, okay, yeah, but right, we don't have the tabernacle or the temple anymore. Right. So that's, that's all gone now. So I guess this just sort of doesn't apply now. This is one of those things, right? Ceremonial law. We could just toss, toss all that stuff out related to the temple, because God's presence isn't just in this one place with concentric circles around it and stuff and all that. And I say to you, not so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7289.37,"end":7289.73,"speaker":"Announcer","text":"Fast."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7293.65,"end":7302.69,"speaker":"Fr Stephen De Young","text":"Because that's not, that's not what the New Testament does with this principle."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7303.25,"end":7316.87,"speaker":"Fr Andrew Stephen Damick","text":"No, I mean, number one, there are washings that we see in the New Testament and washing that we see in liturgical practice of the Church, you know?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7317.43,"end":7317.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7317.83,"end":7324.71,"speaker":"Fr Andrew Stephen Damick","text":"And on the other side of those washings is entering in to a holy place to do a holy thing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7325.03,"end":7369.54,"speaker":"Fr Stephen De Young","text":"Yes. And remember Matthew 5, right. It's not even that this is relaxed. It's not even that these commandments are relaxed. In fact, if anything, they're heightened in a certain way. Right? Because the presence of God doesn't go from being in that one locale, right. Within that one tent or that one building to being everywhere and. Or nowhere. Right. But according to the Book of Acts, right, that presence of God, the Holy Spirit comes to dwell in each human, right. Who is baptized and receives the Holy Spirit."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7369.94,"end":7395.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is demonstrated at Pentecost. Right. And when you look at Pentecost, you need to remember how the presence of God descends Into the tabernacle and the First Temple, right? This is what it's doing. It is descending again now. But now it's in the church, right? That's what happens at Pentecost in Acts, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7395.55,"end":7405.35,"speaker":"Fr Stephen De Young","text":"It's in people, right? Like Soylent Green. The temple is now people. Not like Soylent Green."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7405.35,"end":7408.51,"speaker":"Fr Andrew Stephen Damick","text":"Not. No. Yeah. Or like Green Day."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7408.99,"end":7415.71,"speaker":"Fr Stephen De Young","text":"Yeah. I don't even know what that metaphor would be, but. Okay, I get it. You tried to do a band reference. I'll acknowledge it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7415.87,"end":7421.47,"speaker":"Fr Andrew Stephen Damick","text":"You don't know that Green Day is actually named after a banner in that film that says Soylent Green Day?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7422.35,"end":7441.95,"speaker":"Fr Stephen De Young","text":"Oh, no, I didn't know that. I actually learned something today. Hey, I got one. Everybody write it down. I knew a pop culture reference in Father's Team. I'll have to go back and watch it. I rewatched it a couple years ago with Charlton. Charlton Heston thing. I watched Soylent Green. I watched Omega Man. I watched like a whole bunch of them. But go back again."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7442.75,"end":7444.51,"speaker":"Fr Andrew Stephen Damick","text":"Any Planet Apes in there?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7444.91,"end":7453.18,"speaker":"Fr Stephen De Young","text":"Omega man is. I continuously watch Planet of the Apes movies. I can't wait. There's a new one coming out that looks amazing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7454.94,"end":7455.42,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7455.98,"end":7531.2,"speaker":"Fr Stephen De Young","text":"But. Oh, yeah, Omega Man. By the way, worst adaptation of Richard Matheson's I Am Legend ever. Of the three, the one that's actually closest to the. To the book is Last man on Earth, starring Vincent Price. Second is Will Smith's I Am Legend with the original ending that you get as a bonus feature. Then that movie with the theatrical ending, then Omega Man. Omega Man. Not even really in the right. It's. You know, I was going to say it has the same title, but it doesn't even have the same title. It's, like, vaguely related, even though it says based upon in the credits. But anyway, enough of I Am Legend, but. So I think a lot of times when we look at the Day of Pentecost, right, and we celebrate the Day of Pentecost, we don't see that that sense of danger has been maintained or should be maintained."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7534.08,"end":7534.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7537.68,"end":7661.68,"speaker":"Fr Stephen De Young","text":"I've never heard at a baptism, Right? Okay. Now the Holy Spirit is going to come upon this person and they are in grave danger. Right? No one does that. But the scriptures do go out of their way to point that out because there's this pattern, right, that St. Luke follows in at the end of Luke and the beginning of Acts, which is a pattern. He's getting out of Leviticus. So if there's. If there's a tertiary takeaway from tonight's episode, it's go read Leviticus everybody. But so in Leviticus, they build the tabernacle, they purify the tabernacle and all its accoutrements with blood, and then the presence of God comes down and fills the tabernacle. Right. The Holy Spirit fills the tabernacle. And then in the next chapter, after the presence of God comes and fills the tabernacle, Aaron's ne' er do well. Sons Nadab and Abihu go in drunk to offer strange fire at the wrong time in terms of incense in the tabernacle, and fire comes out and kills them. Right. This is the first instance in the Scriptures of someone being on fire with the Holy Spirit. We use that term differently now. That's part of my point. Glory not to connote danger. Right. And so St. Luke. Right. Because all of the New Testament authors assume that their readers are thoroughly familiar with the Torah. They assume it. And this is part of our problem in reading and interpreting the New Testament well, is that we by and large, aren't."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7662.63,"end":7662.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7664.71,"end":7681.11,"speaker":"Fr Stephen De Young","text":"Because he does this very subtly. But St. Luke's gospel ends with the Christians, the disciples, all continuously in the temple praising God. Have you ever noticed that?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7682.23,"end":7682.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7683.35,"end":7687.67,"speaker":"Fr Stephen De Young","text":"And then you go over to the beginning of Acts and they're hiding in a room."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7689.49,"end":7689.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7689.73,"end":7690.85,"speaker":"Fr Stephen De Young","text":"Waiting for the Holy Spirit."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7692.37,"end":7692.93,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7693.09,"end":7694.45,"speaker":"Fr Stephen De Young","text":"Ever struck anybody as odd?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7694.69,"end":7695.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7697.65,"end":7768.69,"speaker":"Fr Stephen De Young","text":"So, right. What was just before that? What was just before that was the story about the road to Emmaus. Right. Emmaus being the climactic battle of the Maccabean revolt. You can read about this in First Maccabees, after which they rededicated the temple. Right. So the idea that St. Luke is telegraphing by that ending to his Gospel is the rededication of the temple is coming. And it has to do with the temple being filled with Christians. Right. So he's teasing it. Teasing Volume two. So when we get into volume two, we have the Christians. They have been purified by the blood of Christ through his death, and now the presence of God in the Holy Spirit descends upon them and fills them. And then what happens afterwards? We get this story about Ananias and Sapphira, two people, again, who come to the apostles, who come to the church, who come to the people who are filled with the Holy Spirit."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7769.76,"end":7770,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7770.16,"end":7816.41,"speaker":"Fr Stephen De Young","text":"And they lie. And St. Peter says, you have lied to God, you have lied to the Holy Spirit. And what happens? They fall over dead and people carry them out, just like Nadab and Abihu. All right, so St. Luke uses that pattern to very deliberately communicate. Oh, no, no, no, no, no, no. Right. This is still a dangerous thing. The presence of God in us is still a dangerous thing. And this becomes the basis for everything St Paul is going to say about, in various places, about our body being a temple of the Holy Spirit and the Holy Spirit dwelling with us and within us, not quenching the Holy Spirit."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7817.93,"end":7827.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just like a neat, beautiful little metaphor. It's really about, well, how do you treat the temple? How do you treat the tabernacle? What are you supposed to be doing?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7828.42,"end":7841.46,"speaker":"Fr Stephen De Young","text":"Right, Right. And this is why he has this. He's not just a prude. This is why he has this emphasis on sexual immorality in precisely this concept in this context of our body being a temple of the Holy Spirit."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7841.94,"end":7843.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7844.58,"end":7974.63,"speaker":"Fr Stephen De Young","text":"And being defiled. And so. So this principle, now we've seen, right, we did it. It's kind of a quick run through, but we did this kind of quick run through of this from the Torah, Right. And then into the New Testament. Right. And so there's a lens, there's a refraction point there as we move from the Torah to the New Testament, where something shifts. How would we describe that shift? I would describe that shift as a move from external to internal. Right. So the Israelites are given this structure external to them. Right. You have to go to the tabernacle, and you can only go so close. Right. Or you have to go to the temple. It is external. It may be far away. Right. But through the way you approach, like, literally physically approach this literal, physical sanctuary and the way you treat it and the purity and the holiness that you have to maintain, this is sort of preparatory to understanding what it's going to mean to have the Spirit of God, God himself come and dwell in your heart. And what that means in terms of the holiness, the purity that has to be maintained, the dedication that has to be maintained of yourself now, of yourself, not just of a building over there. Yeah. And this also gives us an image that that refraction point, that lens, gives us a better idea of what St. Paul means, for example, when he says that the Torah was a teacher. It gave this external thing as a way to help humanity understand this spiritual, internal thing so that we would be prepared for the fullness that comes in Christ."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7977.91,"end":7983.66,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're going to go ahead and go to our second break. And we'll be right back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":7984.14,"end":8000.38,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of spirits, give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8005.74,"end":8080.91,"speaker":"Fr Stephen De Young","text":"Ancient Faith's Lampstand Institute is an introductory media training forum for Orthodox Christians aged 18 to 23 who are interested in learning skills in digital media and applying them to the service of the church. At Lampstand, a group of 10 students will gather to learn the essentials of podcasting and video production and the why and how of Orthodox media ministry. Students will execute their own digital media projects under the direction of Ancient Faith staff and network. Upon the program program's conclusion, participants will leave with foundational ministry experience, technical and creative skills, and career mentors. The weekend will include sessions on podcasting, audio production, live radio, video making, marketing and media ministry, plus open work sessions for recording radio material, refining a personal project, and preparing a live radio broadcast. The Institute will take place at the Ancient Faith Ministries headquarters in Chesterton, Indiana on July 18th through the 21st, 2024. Programming will begin Thursday, July 18th at 6:30pm and conclude with Divine Liturgy and lunch on Sunday morning. For more information and to apply, please visit ancientfaith.com that's ancientfaith.com."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8088.04,"end":8104.04,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8105,"end":8147.98,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. So I should say, you know there at the end of the second half, I had someone dispatch dispute my claims about the origins of the band's name for Green Day and said that it has to do with a certain plant that people like to put inside pipes and cigarettes and so forth. But I will say, having done some very fast research on the interwebs during the break, that this is a contested issue. So I am going to stick with the ancient legends that were given to me in the elder days. But but yes, it is a thing. It is a thing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8147.98,"end":8148.3,"speaker":"Fr Stephen De Young","text":"Both."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8148.3,"end":8162.62,"speaker":"Fr Andrew Stephen Damick","text":"Both ways. Yeah. The marijuana thing. I mean, that's just not anywhere near as interesting as as you know, Tuesday is Soylent Green Day as it says on on the signs in the film. So just throwing that one out there."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8163.18,"end":8178.96,"speaker":"Fr Stephen De Young","text":"I'm happy to have to consider for my own purposes the way in which the weed explanation fits into my all rock songs are actually about heroin theory. Every single one of them. I do not have the time to."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8178.96,"end":8180.04,"speaker":"Fr Andrew Stephen Damick","text":"Listen to you wine."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8183.4,"end":8185.12,"speaker":"Fr Stephen De Young","text":"About nothing and everything all at once."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8185.12,"end":8197.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. At the end of this episode we'll say, I hope you had the time of your life. Anyway, so we actually do have a caller on the line who is probably just getting irritated and annoyed at listening to us go on about this stuff."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8198.68,"end":8200.68,"speaker":"Fr Stephen De Young","text":"So we're going to go ahead and talk to Avery."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8200.68,"end":8204.2,"speaker":"Fr Andrew Stephen Damick","text":"So, Avery, welcome to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8205.4,"end":8206.36,"speaker":"Avery","text":"Father's bless."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8206.84,"end":8207.88,"speaker":"Fr Andrew Stephen Damick","text":"God bless you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8209,"end":8250.27,"speaker":"Avery","text":"Thank you. I will say I just finished my main line of Lord of Spirits podcasting starting in September and ending now, and I'm glad I was able to call in before the impending end of the the show. I'm very happy about that. I did have a question about. I know you've talked about how the gentiles fulfill the 10 tribes, the lost tribes of Israel, but my question is how do the two remaining tribes fit into Christianity, and then how do they operate with the Torah in that way?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8251.87,"end":8255.07,"speaker":"Fr Andrew Stephen Damick","text":"All right, that's nice and clear. I'm going to go ahead and punt it directly to you, Father."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8255.07,"end":8255.47,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8256.59,"end":8258.35,"speaker":"Fr Andrew Stephen Damick","text":"Because I know you have something to say about this."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8258.67,"end":8398.7,"speaker":"Fr Stephen De Young","text":"This is one of the most controversial things I ever say, and since I'm longing for cancellation, I love an opportunity to say it as publicly as possible. So if we're talking about individual Jewish people converting to Orthodox Christianity, right. There's a fundamental problem with the idea that they would fully keep Torah in that to really keep Torah fully, you have to keep it in community. So this is a practical issue, right? Like if I have a Jewish person come and join my parish, right. And if I were to say to them, okay, you need to keep kosher because you're Jewish, that would just mean he couldn't eat with the rest of us, Right. That would be excluding him from our community. Right. So that is not a burden that the church places on individual converts like that. And I don't think that that's the controversial part. Here's the controversial part. I think as I hope and pray will one day happen, and I'm going to talk about this more in my concluding comments, that one day we will have a mass conversion of Jewish people entering the Orthodox Church. The day that I think would be wonderful would be the day that the Patriarchate of Jerusalem is just so overwhelmed by Jewish converts, including the High Rabbinate, that we end up with a Jewish patriarch of Jerusalem again for the first time in 1970 years. And if that happens, by God's grace, and we have whole churches and communities of Jewish Christians, then I would expect that that Jewish church, just like the Greek church or the Russian church or any other church of a people and a nation, would keep their own ways. And I suspect that such a church would keep Torah in a way more reminiscent of the Christian. The Jewish Christians of the first century."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8400.78,"end":8403.18,"speaker":"Avery","text":"Wow, that would be amazing, wouldn't it?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8403.5,"end":8403.98,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8404.86,"end":8409.5,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we're just sitting here speculating a bunch of gentiles on microphones, so. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8411.34,"end":8416.62,"speaker":"Fr Stephen De Young","text":"Well, I'm going to comment more on that at the end here. I think there are things we could do to help that along."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8417.34,"end":8418.58,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, absolutely."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8418.58,"end":8419.98,"speaker":"Fr Stephen De Young","text":"If we really want to see that happen."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8420.54,"end":8421.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8422.06,"end":8440.74,"speaker":"Avery","text":"Well, thank you. I do want to say quickly that this podcast has not only changed my face, but it's really changed the way I see community. And hopefully it's working its way to change. Not that it's bad, but the way my parachute. Community and the otherness. So I do thank you for that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8441.46,"end":8443.22,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Avery. Thanks for listening."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8444.26,"end":8444.74,"speaker":"Avery","text":"Thank you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8444.74,"end":8444.98,"speaker":"Fr Andrew Stephen Damick","text":"Bye."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8444.98,"end":8445.3,"speaker":"Avery","text":"Bye."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8446.02,"end":8448.66,"speaker":"Fr Andrew Stephen Damick","text":"All right, I have to admit, go ahead."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8449.14,"end":8455.54,"speaker":"Fr Stephen De Young","text":"For a second there, I dared hope that that was going to be Avery Brooks, but I'm pretty sure it wasn't."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8456.02,"end":8456.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8456.74,"end":8458.9,"speaker":"Fr Stephen De Young","text":"I mean, that's pretty distinctive voice."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8459.3,"end":8467.19,"speaker":"Fr Andrew Stephen Damick","text":"Is a pretty distinctive voice. Yeah. He didn't ask about flying cars once, so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8467.19,"end":8469.67,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8470.55,"end":8477.99,"speaker":"Fr Andrew Stephen Damick","text":"That's the big question I associate with Avery Brooks is where are the flying cars? Okay."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8479.19,"end":8486.95,"speaker":"Fr Stephen De Young","text":"I personally really liked the interview he did with William Shatner where he just sat there and plinked around on a piano for half the time. Yes, yes. Fascinating."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8487.19,"end":8492.7,"speaker":"Fr Andrew Stephen Damick","text":"William Shatner, who has probably been on more documentary films than any other human who has ever lived."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8493.1,"end":8496.94,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah, agreed."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8498.22,"end":8527.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. First half, we talked about Torah in general and how it relates to the church. Second half, we started to zoom in and we talked about one of the core principles of the Torah, which is how to live in such a way as to be compatible with the presence of God so that we don't have to suffer dbh. Death by holiness. That is. In the third half, we're going to zoom in a little more. So what's on the menu now?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8527.99,"end":8747.84,"speaker":"Fr Stephen De Young","text":"Yes, so now we're zooming in a little more on moral impurity, specifically sin, to put a finer point on it, and the way in which the Torah functions as a sin management system. Right. So to start with, we have to make sure we're keyed in on our a correct understanding of what sin is, because I know for a lot of us, based on cultural things, sin is breaking a rule, specifically one of God's rules. Right. And then God is mad or God has to punish it or however you view that. Right. But that's not how the Torah sees sin. We'll just start with that, right? That's not how the Torah presents sin. And there are sort of two valences, I guess, in terms of how sin is presented in the Torah. The first is sin is described as sort of like a biological entity, meaning like a bacteria or a virus, like a disease. Now, of course, they didn't have the idea of bacteria or viruses at that time in history, but they saw diseases, right? And how diseases worked and how they spread and how they brought about death if not treated and not dealt with. And so sin is portrayed very much in that sense, but there is sort of a reality to it, right? And the ways of dealing with sin and moral impurity are very closely related to the way that disease was dealt with, right? Things like quarantine, like you have to set. The sinner is separated, right? Until he can be purified by various means, he's separated from the tabernacle, from other people, right? And then that purification and healing is required. And we've mentioned before, it was way back in the long ago time. I won't even guess which episode. It's a dim memory fading off into the sunset, because I'm an old man. But we talked about Christ's healings in relation to this at one point, right? That one of the reasons why Christ performing all of these healings of physical diseases is so prominent in the Gospels is that this is an image of healing, forgiveness, restoration from sin. And often in the story of Christ's healing, these two things are tied together, right? Which is easier to say to this paralyzed man, your sins are forgiven or rise up and walk. Right? And so the physical healing and the forgiveness of sins is sort of tied together in this way, sometimes very explicitly. And that's related to this understanding of sin. And then relatedly, this isn't really another concept. It's more of another valence or another sort of slightly to the side perspective that sin leaves a kind of metaphysical taint. It leaves a kind of stain or."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8747.84,"end":8748.52,"speaker":"Announcer","text":"A spore."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8751.24,"end":8757.32,"speaker":"Fr Stephen De Young","text":"In the world and in people and on people and on even physical objects."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8757.48,"end":8757.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8757.88,"end":8759.96,"speaker":"Fr Stephen De Young","text":"Places get tainted, right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8760.36,"end":8796.2,"speaker":"Fr Andrew Stephen Damick","text":"I. I was gonna say, I've just been reading the. The Oedipus literature from ancient Greek mythology and stuff. And, you know, if you guys know about the life of Oedipus, you know, he was pretty messed up. But yeah, I mean, he shows up like in Oedipus at Colonus, which is one of the plays by Sophocles, he shows up and people are like, get out of here. You know, like this guy is cursed by the gods, you know, get out, you know, and that's exactly this idea that there's this sort of evil that messes up places by an evil person or a cursed person just being around, you know."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8796.92,"end":8837.18,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And, of course, first example of this in scripture is Genesis 3, when Adam is told, cursed is the ground because of you. Right. That what Adam has done is not just going to affect him or his relationship with God, but it's going to affect the ground that he has to work to get his food from. So there's going to be thorns and thistles and an effort. Right. So there's this taint left. And of course, this is, you know, the day of atonement ritual. The blood that's taken in the sanctuary is used to purify the physical objects. Right. The Ark of the covenant, the altar of incense. Right. The physical objects in there, not people."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8837.58,"end":8842.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What did they ever do? Nothing. But it's the sin that kind of got on them, so to speak."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8842.78,"end":8919.51,"speaker":"Fr Stephen De Young","text":"But the language is you have to go in and atone for the altar. Right. It has to be purified again with blood from. And of course, that's done in the sanctuary because that's the place where it's most dangerous, because that's where God is. Right. When you're. When you're outside the camp. Right. Sin's still a problem, and sin is still sin. Right. But that. That residue, that stain, that taint, doesn't. It doesn't present the same danger. Right. As it does the closer you are to the presence of God. And so the usual way in which this is dealt with, in addition to that quarantine idea, is that once the person is quarantined and separated, the way that you deal with the sin, the disease and its residuum, is through the cycle of daily sacrifices, the daily sin offerings. And then, as we just mentioned, the annual Day of Atonement ritual, which not only takes away the sin of the people. Right. And again, here sin has this metaphysical reality to it because you can take it and you can put it on a goat and the goat can carry it away. Yeah, Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8919.99,"end":8927.09,"speaker":"Fr Andrew Stephen Damick","text":"And for lots more on that, everybody check out our episode called the Priest Shall Make Atonement. We go do incredible detail in that."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8927.17,"end":8932.77,"speaker":"Fr Stephen De Young","text":"Yeah. But that's a very particular way of seeing sin. Right. You can't take a series of rule violations and put it somewhere."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8933.81,"end":8934.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8934.93,"end":8991.26,"speaker":"Fr Stephen De Young","text":"Right. And so there. But in addition to. In tandem with that cycle of daily sin offerings and the annual day of atonement There is also what we today, thanks to Latin call penance. There was restitution, there was repentance that consisted of concrete actions that had to also be done. Right? So if I go and I steal something from my neighbor, I go and steal money from my neighbor. I can't just go and partake of that day's sin offering and be like, cool, we're all good, right? I have the Torah prescribes. Okay, here's how you do that. I have to go and pay back five times what I stole. Then go participate."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8991.66,"end":8992.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":8992.22,"end":9096.05,"speaker":"Fr Stephen De Young","text":"Make it right in the sacrifice. And then I am healed, Then I am restored. Right. See Psalm 50, Psalm 51. If you're not using the Orthodox study Bible, right, With David, then shall I offer bullocks on thine altar? Yeah, right. Not sacrifices aren't important at all. God doesn't care about the blood of bulls and goats. Right. It's that God doesn't just want that. I'm not going to bribe him with that. He wants me to have a broken and a contrite heart about what I've done. And then once I've been restored, then I go and offer the bullocks. Right. Then I go and offer the sacrifices. Right. And so one of the things that's very commonly misinterpreted, and it's weird. Let me say this. It's weird because this is an idea I only encountered relatively recently, like within the last 10 years. I've been studying the Bible for a lot more than 10 years, but over the last 10 years, I've been running into this idea over and over and over and over again among certain Old Testament scholars, only certain ones, and I don't even have a good idea of what connects them to give me an idea of why they might be reading this this way. But there's this idea now that people put forward that sacrifices in the Old Testament couldn't deal with voluntary sins. The sacrifices, the daily sin offerings and the day of atonement only dealt with involuntary sins."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9096.45,"end":9105.01,"speaker":"Fr Andrew Stephen Damick","text":"But, but I mean, there's. There's explicit things in there that you can't, like, accidentally do."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9105.81,"end":9133.45,"speaker":"Fr Stephen De Young","text":"Yeah, well, that's the thing. That's it. So just so people know, right, when we talk about voluntary and involuntary sins, what we usually mean is that if I throw a rock at someone's head and it hits them and kills them, that was a voluntary sin. If I throw a rock over a fence and I don't realize there's a person there and the rock hits them and kills them, that's an involuntary sin."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9133.85,"end":9134.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9134.89,"end":9180.05,"speaker":"Fr Stephen De Young","text":"Right. Meaning I had no intent to sin whatsoever. I was just negligent in some way or careless or incautious. Right. And so, yeah, even though people say this all the time, not, not everybody, but a certain group of people says this over and over and over again, like it's just a fact. It doesn't really make sense when you read the Torah, because, like, how do I involuntarily steal? Yeah, right. Like if I steal from my neighbor deliberately, like, there's no way to atone for it. I'm just done. But if I accidentally steal something, I have to pay back five times."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9180.45,"end":9183.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like. No, it's like when you accidentally pocket a pen at the bank."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9184.29,"end":9187.93,"speaker":"Fr Stephen De Young","text":"Right. Like, then I guess I have to go and give the bank five pens."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9187.93,"end":9188.77,"speaker":"Fr Andrew Stephen Damick","text":"Five pens."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9188.85,"end":9196.34,"speaker":"Fr Stephen De Young","text":"But if I deliberately steal the pen, there is no forgiveness for me. Right. That. That doesn't seem to be what the text is saying."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9196.74,"end":9198.3,"speaker":"Fr Andrew Stephen Damick","text":"No, right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9198.3,"end":9206.74,"speaker":"Fr Stephen De Young","text":"It just doesn't seem to be what the text is saying to me. I don't understand how that's tenable. Right. And I don't understand how there would have been any Israelites left."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9208.1,"end":9208.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9208.74,"end":9224.36,"speaker":"Fr Stephen De Young","text":"After a relatively short period of time. Yeah, right. Because all you would have to do is commit one voluntary sin and you're done. Because there's no forgiveness for you. There's no way to be reconciled according to this view."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9225.64,"end":9228.36,"speaker":"Fr Andrew Stephen Damick","text":"And you know, David."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9229.24,"end":9237.16,"speaker":"Fr Stephen De Young","text":"Yeah. Just, you know, there are lots of people in the Old Testament who commit voluntary sins and yet somehow are reconciled and offer sacrifices."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9237.32,"end":9238.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9239,"end":9274.34,"speaker":"Fr Stephen De Young","text":"So it just doesn't work. And I'm. I'm not sure because a lot of these people are like smart, very intelligent people and well educated and I respect them, but I don't know where they've gotten this idea or how they think that works. What you actually see in the Torah and the place to look for this is in everybody's favorite book of the Bible, the Book of Numbers. Once you're done with reading Leviticus, read numbers. Call it a challenge or something like an ice bucket challenge."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9274.42,"end":9287.26,"speaker":"Fr Andrew Stephen Damick","text":"I was told you would not be math. Yeah. So numbers, chapter 50. By the way, people, if you haven't read numbers or you haven't read in a while, it's not just a bunch of census taking. There is some narrative in there."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9287.26,"end":9288.9,"speaker":"Fr Stephen De Young","text":"It's not just numbers, despite the name."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9289.14,"end":9320.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Yeah. So numbers, chapter 15, verses 30 and 31. But the person who does anything with a high hand, whether he is native or a sojourner, reviles The Lord and that person shall be cut off from among his people because he has despised the word of the Lord and has broken his commandment. That person shall be utterly cut off. His iniquity shall be on him. So what's that high hand thing? Is that like someone waving, hey, look at me, look at me."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9320.89,"end":9332.83,"speaker":"Fr Stephen De Young","text":"Right, well, so this, this can't mean again, voluntary sin, because the punishment for this is being cut off from the people, meaning death or exile."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9334.35,"end":9334.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9335.63,"end":9351.15,"speaker":"Fr Stephen De Young","text":"And the Torah doesn't commit the death penalty for everything. Right, that's clearly. You could eat an owl and not get the death penalty. Okay. My go to example is owl eating. Yeah, I know. The owl eating episode."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9351.31,"end":9359.51,"speaker":"Fr Andrew Stephen Damick","text":"Someone asked in the YouTube discussion whether we had already passed owl fair week, so. Afraid so. Afraid so."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9359.51,"end":9377.19,"speaker":"Fr Stephen De Young","text":"Yep. No owls for you. Now I'm petrified someone's gonna show up with like some kind of cooked owl at pasta church. And I'm in Cajun country. So somebody catches an owl, they're gonna cook it up. But on the other hand, it'll probably be delicious."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9377.35,"end":9377.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9377.67,"end":9407.98,"speaker":"Fr Stephen De Young","text":"I mean, I don't think I regret to admit it. Yeah, yeah, that's. But so the. The right. You don't get the death penalty or exile for everything. And again, if you did, there would not be any Israelites for very long. Right. So let's talk about something else. What does it mean to hold your hand up high? What is that referring to? That's referring to taking an oath."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9409.37,"end":9412.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in other words, I'm committed to this."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9413.05,"end":9438.59,"speaker":"Fr Stephen De Young","text":"Right, Right. And so this isn't deliberate sin. This is unrepentant sin. So it's not that it's deliberate before the fact, which most sin is, it's that it's unrepentant after the fact, which an unfortunate amount of sin is. Right. So the idea is. Right, Yeah, I did it. Yeah. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9438.59,"end":9439.83,"speaker":"Fr Andrew Stephen Damick","text":"And I'm gonna keep doing it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9440.07,"end":9442.55,"speaker":"Fr Stephen De Young","text":"Yeah, keep doing it. There's nothing wrong with it."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9442.87,"end":9443.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9443.99,"end":9458.15,"speaker":"Fr Stephen De Young","text":"Right. And if you think about that for a second, Right. And think about some of the people again in the Torah who suffer being cut off from among the people."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9461.44,"end":9461.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9462.64,"end":9464.8,"speaker":"Fr Stephen De Young","text":"And this describes them. Think about Korah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9467.44,"end":9467.84,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9468.8,"end":9471.36,"speaker":"Fr Stephen De Young","text":"Why does he get to be the high priest? He's no better than me."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9472.08,"end":9473.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's what he said."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9473.6,"end":9595.56,"speaker":"Fr Stephen De Young","text":"I should be a priest too. Right. Or think about Achan and Joshua. Not only does he take the gold and the treasure and he hides it, but when it's found out that someone has it, and so the wrath of God is upon all the people, he doesn't repent, he doesn't fess up, he doesn't confess what he did. Right. They have to go find it. He's unrepentant, he gets cut off from among the people. Right? So this not only makes sense as just a reading of this text, but it makes sense of the Torah. Right? Of how it fits into the rest of the Torah, the rest of the Old Testament, how it was, how it was practiced. Right. But notice that this fact, right, we're told as that passage in Numbers continues for this kind of person, for this high handed person who sins with a handheld high, this person who is unrepentant, you can't offer any sacrifices for him, right? You can't offer sacrifices to this guy because he's not repentant. So there's not going to be forgiveness, there's not going to be healing. If he's unrepentant, it doesn't matter how many bulls and goats you offer to God, right? The guy's unrepentant. This is related to what St. John is talking about in one John when he talks about the person who sins unto death, who you shouldn't pray for. Right. It's the same kind of idea. This is the sinner who is not repenting. If someone is sinning completely unrepentantly, and I pray for God to forgive those sins that they haven't repented of, God is not going to forgive those sins until and unless they repent. Now I could pray to God and ask God that he will do something to move them to repentance. That's different, right? That he will, he will and bless them and do other things for them. Right? But God isn't going to forgive someone's sins that they aren't repenting of."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9596.29,"end":9638.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think this is important to underline that there is a difference between being a sinner and being an unrepentant sinner. And I think a lot of errors are committed when people just collapse those things into the same thing. You know, I've heard it said one time, and I believe this very much, that it's not sin that keeps us out of the kingdom of God, it's lack of repentance that keeps us out of the kingdom of God. Because we're all sinners. We're all sinners, but if we don't repent, that's where we have the problem."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9639.38,"end":9660.32,"speaker":"Fr Stephen De Young","text":"And there are a lot of people who we think of as sinners, who we think of as the bad people maybe who are doing Horrible things to themselves and even other people. But the reality is these are people who are deeply lost and literally, from their perspective, struggling to survive every day."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9661.68,"end":9662.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9662.48,"end":9702.87,"speaker":"Fr Stephen De Young","text":"Right. And what they need is not to be sort of vilified and identified as sinners, but what they need is they need the way out presented to them, the way out of repentance. Right. That that is possible and that healing is possible. Right. Because even though they look unrepentant to us in the sense that they're not changing and they may be justifying horrible things that they do because from their perspective, they have to do those things to survive. Right. And we interpret that as unrepentants. Right. But in a lot of cases, it's because they don't know or think repentance, transformation, healing is actually possible for them."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9703.38,"end":9710.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And God knows whether they are repentant, Right. Or even trying to be."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9711.94,"end":9802.44,"speaker":"Fr Stephen De Young","text":"But so. So the fact that, right. The sacrificial system of the. Of the Torah, the fact that you can have this problem, right. Of, well, we're doing the sacrifices, but people aren't repenting. And so the purpose, the ostensible purpose of those sacrifices in terms of reconciliation and healing and restoration isn't working because the people aren't repenting points to a certain problem of externality. Right. The fact that sort of like we saw with the sanctuary, the actual offering of an animal and the eating of the parts of the animal, is this thing external to people. Right. That was intended to help teach them about repentance. Right. And transformation. Right. And so this is another place where we see that lens we talked about in the last half of something moving from external to internal. And when we say there's this move to internal, we don't mean that forgiveness is purely an internal thing. Like, I go, I say I'm sorry to God, I'm healed from it internally in some way. Right. Because the repentance part is still accomplished externally."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9802.68,"end":9806.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can't just say, well, I said I was sorry."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9808.05,"end":9808.25,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9808.25,"end":9813.25,"speaker":"Fr Andrew Stephen Damick","text":"You know, even if you say it, like in a heartfelt way, like, okay, you're sorry now make it right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9813.81,"end":9886.11,"speaker":"Fr Stephen De Young","text":"Right. So there's confessing sin, there's correcting, becoming faithful to God, ceasing from repeating to do it. There's making restitution, healing, and restoring the damage you've done to yourself and other people through that sin. Right. But what we don't have anymore is that purely external offering of animals. Right? And also when we say that it's internalized, we're not saying that this was purely external in the Torah. And here's what I mean by that. Sometimes people will read what Jesus says when he's teaching Torah in the Gospels as, oh, well, Christ is cranking this up and making it more severe. Right, right. You know, it used to be just you couldn't commit adultery. But then Christ says, if you look at a woman with lust in your heart, that's just as bad. See? So he's ratcheting it up. Right. I hate to tell you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9887.88,"end":9888.12,"speaker":"Fr Andrew Stephen Damick","text":"Or I."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9888.12,"end":9908.76,"speaker":"Fr Stephen De Young","text":"Hate to break it to you, but in the Torah, it was already bad to lust after women in your heart. That's not something new that Jesus is adding, you know, especially I chose that example because, you know, there's the commandment, do not commit adultery. There's also that whole thing about not coveting your neighbor's wife."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9910.36,"end":9915.79,"speaker":"Fr Andrew Stephen Damick","text":"There it is. Right? That's in the top 10, by the way, everybody."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9915.95,"end":9918.11,"speaker":"Fr Stephen De Young","text":"Yes, right. Like that's it there."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9918.11,"end":9918.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":9920.19,"end":10021.47,"speaker":"Fr Stephen De Young","text":"And this is, you know, folks, read Deuteronomy. See, now I'm going to have you read the whole Torah. We got Leviticus, numbers, Deuteronomy. Read Deuteronomy. Deuteronomy over and over again. It's like, yes, you're circumcised in the flesh. Is your heart circumcised? That's not some later metaphorical thing like, oh, circumcision was literal, but then later we talk about it metaphorically. That's right there in the Torah. The same Torah that talks about physical circumcision talks about circumcision of the heart. Right. What Christ is doing is he's re internalizing it because that danger of externality had really set in. You get to the point in the prophets where God tells Israel, stop offering the sacrifices. You honor me with your lips, but your heart is far from me. You aren't repentant. Stop killing the goats. Let the goats live. Right? Because it's not fulfilling any purpose because you're not repentant. Right. And this is one of those things that Jesus is always going after the Pharisees about is about what they're super concerned about and what they're less concerned about. For example, you tithe of mint and dill and cumin, you go to your little spice garden and you go and you cut out 10% of these little herbs in your herb garden so that you can tithe and make sure you give 10% of everything. Right? He says, how about justice? Yeah. Are you meticulous about that?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10021.79,"end":10025.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Justice, mercy, faith, like compassion."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10025.47,"end":10044.99,"speaker":"Fr Stephen De Young","text":"Right. Are you so deliberate about that as you are about tithing from your herb garden. Notice though, what Jesus says. He said these things you should have done while not neglecting the others. Also, he doesn't say, don't worry about tithing from your herbs."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10047.5,"end":10047.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10048.22,"end":10147.66,"speaker":"Fr Stephen De Young","text":"He says you should be just as concerned, right, about keeping these very important internal commands and demands of the Torah as you are about these external ones. So that said, as we move into the New Testament, right, The sin offerings, right? And the day of atonement get taken up in Christ's sacrifice. Because Christ's sacrifice enacts this cosmic day of atonement, which was spoken of in various pieces of Second Temple Jewish literature. Second Enoch is a good example. This cosmic day of atonement, meaning atonement for the cosmos, right? For the creation. The whole creation is purified by the blood of Christ from the residuum of sin, right? The taking away of sin that happens, right? Christ's own offering of himself to the Father is a sacrifice. And so now the climax of our repentance as God's people is not going and participating in the daily sin offering and not participating in an annual once a year day of atonement. The climax of our repentance is now participating in the Eucharist, which is a participation in Christ's sacrifice. Yeah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10147.66,"end":10172.17,"speaker":"Fr Andrew Stephen Damick","text":"So I mean, the pattern is the same and the climax in a sense is the same in that it is about communion with God. But now instead of the temporary animal sacrifices, it is the sacrifice of Christ himself. The meal has gotten much higher, as high as possible, because we're eating the very body and blood of God himself, right?"}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10172.49,"end":10279.63,"speaker":"Fr Stephen De Young","text":"And we still have a type of quarantine. There are times when we've, when we've committed certain types of sin, right, where we have to separate ourselves from the Eucharist, from the community. The repentance needs to happen, the healing and the transformation needs to happen. And then that culminates in receiving the Eucharist again. It is the same principle from the Torah at play. And notice that it's not just the Eucharist. I mean, it is the Eucharist. Receive the Eucharist, right? The remission of sins. But there are a number of sacraments that bring with them forgiveness, right? Absolution, obviously, right after confession, but holy unction, the anointing with oil, right? St. James says, Gather the presbyters, gather the priests. They'll anoint him, pray for him, he will be healed, his sins will be forgiven. Right? There again, physical healing tied together with the forgiveness of Sins. Baptism is for the remission of sins. Right. And that all makes sense if we understand again what healing is. If sin is a disease that leaves a taint and a spore. Right. Then forgiveness of sin is reconciliation, healing, restoration, purification, cleansing."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10280.99,"end":10281.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10281.87,"end":10308.44,"speaker":"Fr Stephen De Young","text":"And a restoration of right relationships between us and God and between us and other people. And so, of course, all of the sacraments, all of the ways in which we receive God's grace, all the ways in which God works in our life brings with us healing, restoration, reconciliation. Right. And so that all of them bring, in that sense, forgiveness in one way or the other."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10312.6,"end":10336.22,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. All right, well, we've reached the end of our third half now, and surprise, surprise, everybody. This is not the last episode of the podcast, although when there's another episode, this will be the last, as we said earlier. Anyway, we can't do that joke too many times anyway."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10336.86,"end":10343.98,"speaker":"Fr Stephen De Young","text":"So that is the good thing about Sisyphus jokes, though, is that you can tell them over and over again, that is. And they get funnier each time."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10344.22,"end":10917.06,"speaker":"Fr Andrew Stephen Damick","text":"That is true. Yeah. So next time we will continue more on some of these same themes. So there will be. There will be another episode in a couple of weeks, but just to try to wrap up this one, you know, I said earlier, but I think it's worth bringing this thought back around because it's difficult when you've been raised to think that there's these sort of very almost discrete stages where there is this Judaism thing in the Old Testament and then there's this Christianity thing in the New Testament. Right. Which is definitely the way that I was raised. I was raised in contexts that were very much shaped by dispensationalism. And I think that a lot of Christians in America, even if they're not part of a dispensationalist group, have this sense in one way or another. And so the theme that I wanted to reiterate is the idea that there's not this religion in the Old Testament and then there's a separate, different new religion in the New Testament, that it's simply one. And I thought this was very beautifully expressed in what you wrote, Father, at the beginning of your book, the Religion of the Apostles, where you start out with the question, was St. Paul a convert? There's a certain sense in which the answer to that question is, yes, he converts to Jesus Christ, for sure, who speaks to him directly. But does he convert from one religion to another? No, absolutely not. Jesus didn't found a new religion. Right. It is simply that St. Paul realized, wait a minute. My hope as a Pharisee is coming to fruition right now. It's come to fruition. I didn't realize that it was happening right now. You know, he realized, wait a minute, I'm at a different point on the timeline that I've always believed in, that that time of fulfillment had come, that the Messiah had come. Because you can't really believe that Christianity is a new religion and also say that Jesus is the Messiah. We talked about a little bit this. A bit. Was it the previous episode or two before? I'm blanking now. But you know, the one that we. Where we talked about Jesus is the Christ, right? The son of the living God. You can't say that he's the Messiah and also say that he's started some new religion, because calling him the Messiah means that he fits into this existing story that has been being told all this time. Right? And so to say that there's this new story and that we don't need to pay attention to what's been being told contradicts that very idea that he is the Messiah means he's the Messiah of Israel, right? It means that the church is Israel. This is very much a big paradigm shift if you're not used to thinking this way. And I, I don't mean to say, oh, you know, Christians don't like to read the Old Testament, although I'm sure that's true for a lot of them. But, but, but to say that that means actually that we have to take the actual content of the Old Testament itself very seriously. We can't just look at it as being sort of a long prologue that now, now the prologue's over and now we've got, you know, kind of the real story. No, it was leading up to Christ, and, you know, our eyes are fixed on Christ, but to understand who Christ is, we need to know the Torah and the rest of the Old Testament, but especially the Torah, because why? He's the one who gave it. He's the one who spoke to Moses on Mount Sinai. It came from him. Right? He's the lawgiver. Moses receives the law from him, but he's the lawgiver. He's the Torah giver, right? To use the more precise language. And when we begin to take the Old Testament, especially the Torah, much more seriously, number one, it means we're going to read it a lot more, which I very much recommend everybody does, especially in the Orthodox Church, let's face it, a lot of ignorance about just the contents of the Old Testament, to say nothing about how to understand it, but just the contents, like, who are the characters? What are the stories? There's a lot of ignorance about that within the Orthodox Church, and certainly I know that in other groups as well, that can often be true. But also that as we read it and begin to understand it better, then I think what it does is it vivifies our experience of being Christians. We see how deep the roots go. We see where we are in the story. There's something profoundly kind of unhistorical about trying to ignore or marginalize or even reject the Old Testament. People say, oh, that was the Old Testament. We're. We're in the new one now. No, no, that's not what that means. As, as Orthodox Christians, we are profoundly historical people. And by that, I don't just mean that our church is really old. I mean that it is rooted from Genesis 1 and you can't uproot it. You can't say, well, I've got the flower, so you know the rest. Who cares? That's not how this works. That's not how this works. It's all connected. It's all one thing. It is the same God. It is the same Lord the whole way through. And I know that there are parts of the Old Testament that can be difficult to understand. You know, we joke about that a little bit sometimes. You know, Leviticus and numbers especially can be difficult for people, and Joshua is another one that can be really difficult and so forth. But this is worth wrestling with. You know, as grownups, we've got all got things in our lives that we wrestle with that we know it's worth it. I wrestle with this because it's worth it, because this needs to be part of who I am. I need to be part of this. This is really worth it. And I think a lot of times people won't wrestle with what's in the Old Testament because they don't actually think it's worth. Is worth it. The apostles wrestle with the Old Testament in their lives and in their writings. The holy fathers that follow them do the divine services of the church, are constantly engaging with what's in the Old Testament. Constantly. And, you know, if you're looking for a place where that's true, you know, come to the services next week, the first week of Lent that are happening in the evening. The great canon of St. Andrew of Crete. That is a deep, deep engagement with the Old Testament. And if you don't know the Old Testament, a lot of this stuff is just going to kind of fly by. I'm Sorry to say that doesn't mean you should skip those services. If you're not there yet, go and begin to have a kind of index for what you need to be working on. So, you know, as I said earlier, I'm going to say again, one of the most important themes of this show, and I don't mean just this episode, I mean the Lord of Spirits podcast, which we started in 2020 and we're barreling on down towards, you know, our completing four years. One of the most important things is that this is all one scripture. It's one faith, one Lord. All of it is together. All of it is together. And the more that you let that sink in, I think the more that your experience of our Lord Jesus Christ, the more that your faithfulness will increase. All of these things I think will become vivified and therefore enable us to be living the way that we're supposed to live, to live in faithfulness and repentance, not as a high handed sinners that we read about in numbers. Don't be that guy. You know, when you sin, put your hand down and say, okay, I've sinned, forgive me, I'm going to live differently now. And not just don't sin, but do good. Because we are created for good works, as the scripture says. And part of the way we understand what those good works is, is precisely in a deep engagement with what's in the Torah and the rest of the Holy Scriptures. Father Stephen."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":10922.42,"end":11020.16,"speaker":"Fr Stephen De Young","text":"So in my ongoing quest for cancellation, as I teased to that color, let's talk about the Jewish people. How could this go wrong? I've been, I've been doing a lot with St. Paul lately, as I mentioned, and the Jewish people were St. Paul's own people. They're not my own people. I've done the DNA. I have no Jewish blood in me, if that means something. But St. Paul has this deep concern on a number of levels and I think it develops over the course of his life. Starts out as sorrow that so many of his fellow Jewish people haven't embraced Jesus as the Messiah. And I think in the later Epistles of St. Paul, it transforms into something that was even more sorrowful for him because I think he saw the beginning of something that unfolded over the next few centuries, helped along by Roman violence, which was, I think he saw the movement surrounding Jesus, the church, leaving the Jewish people behind. What do I mean by that? Meaning the very earliest phase, not only was Christianity profoundly Jewish, it was a Judaism."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11021.36,"end":11021.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11022.56,"end":11059.65,"speaker":"Fr Stephen De Young","text":"It was as much claim to being Judaism as any other Judaism. In the first century A.D. the leadership, the apostles, were Jewish. The main bodies of every church he planted were Jewish people from the synagogue who embraced Jesus as the Messiah and didn't quote, unquote, convert because it wasn't a new religion, as Father Andrew just reminded us. But he saw more and more that gentile Christians, Christians from the nations, were coming in. They were embracing Jesus as the Messiah."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11061.95,"end":11062.19,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11064.11,"end":11141.67,"speaker":"Fr Stephen De Young","text":"Past a certain point, his fellow Jewish people were not. At least not in the same numbers and not at the same rate. After his death, of course, the Romans destroyed Jerusalem, they de judified Judea, they cracked down. Even the patriarchate of Jerusalem from 70 A.D. on, frankly, is a gentile entity because it had to be, because the Jewish people, including Jewish Christians, had all been expelled. And that certainly hasn't come back. In the first half, we talked about just some of the horrors and atrocities that came to Jewish people from outside over the centuries. And I'm not going to do the thing where we infantilize the Jewish people and act like they're just these pure, innocent, childlike victims of everyone else. That's not true either. Plenty of Jewish people have done plenty of atrocities, sometimes to their own people, sometimes to other people. That's continued to this very day. Let the listener understand."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11142.74,"end":11142.98,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11144.82,"end":11450.43,"speaker":"Fr Stephen De Young","text":"That'S not the issue. Some people will come and will say on social media where this won't get them banned, they will say, well, Jews hate Jesus or Jews hate Christ. Probably a lot of them do. So do a lot of atheists, so do a lot of pagans. So do a lot of other people for various reasons. That doesn't mean we stop caring about those people. Right. That doesn't mean we write those people off or those people become irrelevant. So what do we do in our present day within the Orthodox Church about the Jewish people? If we want to see Jewish people come and embrace Jesus as the Messiah after all these years, and if we want, as I said, I do, you know, if we dream of a day when, you know, an actual Jewish patriarchate might be reconstituted because of the waves of Jewish people accepting Jesus as the Messiah within the Orthodox Church, which would be a great and wonderful day, is there anything we can do to help bring that about? I am not going to suggest that what we need to do is a bunch of proselytizing, meaning going and finding Jewish people and trying to preach at them and preach the gospel at them. Not only has that happened a lot throughout the centuries in some really dark ways, and when I say really dark ways, again, there May be some people get defensive about that. But think of the way, for example, that certain Protestant missionaries in Orthodox countries have treated Orthodox people trying to proselytize, right? When we're the ones on the receiving end of the proselytism, it feels a certain way. And I would suggest that since it feels that way, we should not adapt those same procedures toward other groups and other people. But what I am going to suggest is that it is very possible for us to try to go back to something that was very much present in the early church. And I don't just mean the first century in St. Paul, though St. Paul is a great example of it. The reality is Judaism and Christianity, like Rabbinic Judaism and Christianity, were not really two separate things until around AD 500. I won't go into all that now, but I can back that up. Even in when we're talking about in the 5th century, they're not completely separate. And a concrete part of what that means is that there was a conversation going on. There were people who knew each other and shared social bonds. And those social bonds are the arena in which a lot of those conversations were happening, where people were talking about the Torah, the Hebrew Scriptures, the part of the inheritance we have as Christians that is also part of the cultural inheritance of the Jewish people. There's an overlap in that Venn diagram. It includes, but is not limited to the Hebrew Scriptures. It includes, but is not limited to the Torah. And that overlap presents a place for conversation, a place for discussion, a place for trying to move people, right? Not in a proselytizing way, but in an ongoing way of seeking to understand the text and present and communicate that understanding, right? And bring more people to our understanding of the text. That's why St. Paul always started in the synagogues. He would go to the teachers, right? He'd go to the rabbis and he would sit and he would discuss the Torah with them. He would talk about interpretations and traditions of interpretation with them. And some of them, a lot of them, he didn't persuade, but some of them came to see what he saw and ended up becoming part of, part of the Christian movement. And so if we threw St. Paul and a Tardis and we brought him to the present day and he ran into a rabbi, I guarantee you, I know what he would do. He would start talking about the Torah with him and he would try to say, jesus, the Messiah has come. And I know so, because look here in the Torah, that's what he would do. And they would argue. They'd argue a lot because that's how Jewish theology works. Right."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11450.43,"end":11450.79,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11451.27,"end":11658.95,"speaker":"Fr Stephen De Young","text":"But out of that argument and those disagreements, that discussion, things would happen, right? So if I'm saying this is what we want to try to restore, how do we do that? Well, here's the step one. Step one, right. Is we need some Orthodox Christians who actually know the Torah, who can actually speak that language. And that's something we've left behind. That's something we're now unfamiliar with. We can't have that discussion with Jewish people to try to show them the right way to read the Torah that leads us to Jesus as the Messiah. If we don't know the Torah, and if we don't know how to have that discussion and we don't know how to reason from the Torah. So we need Christians who can do that. We need to prepare ourselves. Even if you're not going to be right, I'm not suggesting every listener to this is going to put in years and be able to sit down with a rabbi and talk about it. Right. Okay, I know, right. But everyone who's listening to this can get to the point where they could have a constructive conversation with a Jewish person who showed up at their parish. You can get that far. It'll take some work. It'll take some time, but you could get there. Right. And some of us can work on that even more and potentially do even more. There's a big obstacle. I'm gonna be honest about this too. Right. Most. The more religious a Jewish person is, the less likely they are to be willing to talk to you as a Christian. There's a lot of barriers. There's a lot of reticence. Right? But the only thing you and I can do to try to break down that reticence is to prepare ourselves to have the discussion, to prepare ourselves to have that discussion in a constructive way. Right. This requires work on our part. And everything Father Andrew said in his closing comments about all the benefits of us understanding the Torah. Right. You get all those, too. Even if you do what I'm suggesting and you never meet a Jewish person in your whole life, you still will have gained all those things Father Andrew was talking about. But maybe also if we do this, we can be part of the generation or the generations or the beginning of something that could result in something truly glorious of the Jewish people turning en masse to their Messiah. Right? To embracing a faith that really originally belonged to them, that we share with them. Jewish people like St. Paul came and the early missionaries and the fathers came and shared the truth about God, the truth about Christ with my ancestors. I think it's about time that we prepared to do the same with those people's descendants."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11664.07,"end":11694.53,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. That is our show for tonight. Thank you very much everyone for listening. If you didn't happen to get through to us live this time around, we would still like to hear from you. You can email us@lordofspiritscientientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or need help finding a parish, head over to orthodoxintro.org and join us."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11694.53,"end":11706.02,"speaker":"Fr Stephen De Young","text":"For our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. There I was, completely wasting, out of work and down all inside. It's so frustrating as I drift from town to town."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11707.94,"end":11716.34,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, which remind everybody Father Stephen's not, so you could try to call him out in the group and he won't appear if."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11716.34,"end":11717.3,"speaker":"Fr Stephen De Young","text":"You are on Facebook either, though."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11719.46,"end":11737.07,"speaker":"Fr Andrew Stephen Damick","text":"If you are on Facebook, you can follow our page, you can join our discussion group, you can leave reviews, ratings, all those places and share the show with a friend who's going to benefit from it. Also, by the way, if you happen to be listening and it's still March 14th, you can get Lord of Spirits, the book at 50% off just today only."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11737.95,"end":11750.11,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support help make sure we and lots of other AFR podcasters stay on the air. Feel as though nobody cares if I live or die. So I might as well begin to put some action in my life. You know what it's called."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11751.8,"end":11754.12,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless you."}
{"episode_id":"LOS - #088 - 2024-03-14 - Torah! Torah! Torah!","start":11770.6,"end":11807.82,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
