{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":0.4,"end":65.06,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":67.7,"end":251.48,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the Lord of Spirits podcast. A happy new year to you all and a blessed feast of the Nativity to our listeners on the old calendar. It was just a few days ago for you and we just wrapped up theophany on the new calendar and so we're ready for everything that is about to come on. I'm Father Andrew Stephen Damick on the edge of Pennsylvania Dutch country in Emmaus, Pennsylvania and with me is my co host, Father Stephen DeYoung broadcasting from a gigantic pot of gumbo in the middle of Cajun country in Lafayette, Louisiana. If you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346 and we are going to get to your calls in the second part of today's show. So what are we doing tonight? Well, here's the question. What is a body? Human beings are body and soul. We take that as axiomatic. What that means is foundational to Christian theology. And what exactly a body is is foundational to how we understand and experience the world. Our general conception of the human person goes like this and this is how we kind of see it in the modern world. I am an immaterial soul and my soul is housed invisibly inside my body. My body is a kind of temporary material shell that changes and decays and I will lose it when I die, when it will become a corpse and get put in the ground. And from this common conception, theologically, God does not have a body except when the Son of God becomes man. He now has A human body, but he did not have one before. But what if this is wrong? What if I am in fact a body? And what if God had a body even before the incarnation? And what if bodies in general are actually not what we think they are? So what does that mean? Well, to understand that, first we have to talk about God's body. That's actually the title for our show tonight because God is first. He is the creator, he is the one whom we image. So if we're going to understand bodies, we begin not from our created experience and cast our eyes heavenward and try to figure out God from there. Now, next time we're actually going to talk about human and angelic bodies. And I know a lot of your questions that you've sent to us already have been about that, but just be patient while we lay out the groundwork in this first episode because this, this is going to be a two parter. Okay. And I'm going to warn you now that this one is going to be a bit of a brain bender. So you will probably want to listen to it more than once. But this is what happens when you have to kind of reconsider such a foundational basic concept like this. So let's ask the question, what is a body? I mean, Father Stephen, what is a body? And welcome by the way, good to talk to you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":252.28,"end":259.88,"speaker":"Fr Stephen De Young","text":"Well, and as you said, I think some people's brains after this may go into recovery mode from taking in so many high level ideas."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":260.36,"end":263.52,"speaker":"Fr Stephen De Young","text":"But we'll definitely did with mine actually."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":263.52,"end":266.76,"speaker":"Fr Andrew Stephen Damick","text":"When we were doing our pre show prep. So."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":267.16,"end":289.15,"speaker":"Fr Stephen De Young","text":"But we're gonna. This is important and I think as we talk about it, we'll see why it's important and why it's worth the time to try to wrap our, wrap our mind around it. So when we think of what we think of body, we think of, you know, meat, like an object."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":289.55,"end":293.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This physical stuff that I'm sitting in that is sitting in my chair right now."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":294.27,"end":294.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":295.07,"end":322.47,"speaker":"Fr Stephen De Young","text":"And, and so, you know, we, and we even refer to sometimes the, you know, angelic beings as bodiless powers. Say God is a spirit and being a spirit means you don't have a body. That's sort of our shorthand. Those two things are opposite each other. But that's not how ancient people understood bodies or what they meant when they talked about something's body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":323.11,"end":323.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":324.55,"end":336.45,"speaker":"Fr Stephen De Young","text":"What they meant when they talked about something's body was. And we came up with a couple of different phrases. We'll see which one catches on and becomes a meme."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":338.13,"end":340.13,"speaker":"Fr Andrew Stephen Damick","text":"Get those memes ready, boys and girls."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":341.33,"end":353.33,"speaker":"Fr Stephen De Young","text":"A nexus of potentialities or a collection of powers or energies or abilities. And I know that makes about zero sense, but that's why we're going to talk about this more."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":353.65,"end":362.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I kind of like so all you meme makers. I'm leaning towards nexus of potentialities because there's a lot of Star Trek possibilities there."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":363.09,"end":364.45,"speaker":"Fr Stephen De Young","text":"There are, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":365.73,"end":367.33,"speaker":"Fr Andrew Stephen Damick","text":"So get William Shatner out."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":368.77,"end":371.81,"speaker":"Fr Stephen De Young","text":"Anything that William Shatner is good, automatically."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":372.29,"end":372.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":375.01,"end":392.21,"speaker":"Fr Stephen De Young","text":"But so, so what does that mean? Right, That a body is a sort of a nexus of potentialities. Well, to give some examples, we'll talk about body parts. Right, so when we talk about eyes, we're thinking about the gushy things in your skull."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":392.61,"end":393.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, eyeballs."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":394.21,"end":401.33,"speaker":"Fr Stephen De Young","text":"When, when they're talking about eyes in the ancient world, they're talking about the power of sight."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":402.21,"end":436.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is a huge distinction. It's in, rather than talking about a kind of thing, an object, the term refers to what you're doing. You know, it's dynamic versus being a thing to be put under a microscope and examined, you know, so, yeah, so eyes refer to the power of sight, not to, you know, what in my wife's family is the last part of the lamb that you eat."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":437.56,"end":439.24,"speaker":"Fr Stephen De Young","text":"Right, There you go."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":441.01,"end":504.72,"speaker":"Fr Stephen De Young","text":"And likewise with ears. Right, Ears. It's not talking about your lobes, it's not talking about the tiny bones in your skull, your tympanum. It's talking about the ability to hear. So when Christ says, he who has ears to hear, let him hear. He's not saying, you deaf people, don't worry about it. But the rest of you who have physical ears, you should listen to what I'm saying. He's talking about those who have the ability to hear what he is saying need to hear it. He's talking about the ability to hear. And then, you know, feet is a reference to the capacity for movement. Arms, especially right arm, since most people are right handed, is a reference to strength or power or might. And face, reference to a face is a reference to the ability to communicate."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":505.52,"end":544.56,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And I think it's important, and we're going to talk about this more when we start talking about how these words apply to God. But I think it's really important just to come to state right here, that what we're not saying is they're not objects. These are metaphors and the objects are being used to set out these metaphors. Right? You know, like, like saying, oh, you know, you need to have spiritual eyes or the eyes of faith. Meaning? Meaning, okay. You understand things and see things, but it's like having eyeballs, you know, That's. That's not what we're saying. Because again, like, this is the show where we tell you that the things that you thought were metaphors are not metaphors."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":544.72,"end":545.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":546.23,"end":558.55,"speaker":"Fr Stephen De Young","text":"So our, you know, the round, gushy orbs in our skull. Right. Those eyes are the instrument which we use to see."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":559.51,"end":559.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":559.91,"end":563.03,"speaker":"Fr Stephen De Young","text":"The instrument through which we exercise that power."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":563.83,"end":576.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in a sense, eyes include the eyeball. In the sense that eyes need the eyeball to do the thing that they do for us. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":576.3,"end":578.74,"speaker":"Fr Stephen De Young","text":"For us, it's what we use to do that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":579.22,"end":579.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":579.66,"end":593.38,"speaker":"Fr Stephen De Young","text":"Not necessarily, but. But that doesn't mean that something can't have the power of sight, the power of hearing, the ability to communicate without having a meaty, fleshy organ that we have."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":593.94,"end":595.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":597.86,"end":602.4,"speaker":"Fr Stephen De Young","text":"So again, this is probably still super weird and confusing."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":602.56,"end":604.16,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":605.6,"end":611.92,"speaker":"Fr Stephen De Young","text":"And so to help with this, we're gonna. Again, we're talking tonight about God's body in particular."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":612.64,"end":613,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":613,"end":627.25,"speaker":"Fr Stephen De Young","text":"And so when we read in the scriptures and we read things, talking about some body part of God. Right. That, you know, God defeated Pharaoh with."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":627.25,"end":628.49,"speaker":"Fr Stephen De Young","text":"His strong right arm."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":629.29,"end":632.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's not a metaphor. Right. Or."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":632.41,"end":643.13,"speaker":"Fr Stephen De Young","text":"Or God's eyes go throughout the cosmos. Right. Go throughout the world and see everything. Or when we read about."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":643.77,"end":644.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":644.97,"end":645.13,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":645.13,"end":651.53,"speaker":"Fr Andrew Stephen Damick","text":"Like Moses speaking to the Lord. Face. I mean, this is the language in scripture. Face to face as a man speaks with his friend."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":652.22,"end":666.46,"speaker":"Fr Stephen De Young","text":"Right, right. And the face of God is referred to all the time. And when someone says that they want to see God's face, he doesn't say, don't be silly. I'm a spirit. I'm like a ghost. I don't have a face. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":666.46,"end":666.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":667.9,"end":668.94,"speaker":"Fr Stephen De Young","text":"He says, you can't."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":668.94,"end":669.86,"speaker":"Fr Andrew Stephen Damick","text":"I have a face."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":669.86,"end":680.34,"speaker":"Fr Stephen De Young","text":"But you can't see it and live. So if I show it to you, you'll die. Right. If I try to communicate with you directly. Right. You won't be able to bear it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":681.06,"end":758.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the problem, of course, is that as modern people, when we see these references, like, for instance, God in the Garden of Eden, he's walking in such a way that they can hear him. It makes a sound. There's that kind of thing. This language is used for God. And so because we have this idea that God doesn't have a body, God is immaterial. And obviously, we're going to unpack what all of that means and kind of how we got to where we are now. But what happens then is as modern People who are faithful Christians, we want to believe what the Bible says. We look at that and say, well, that's metaphorical language for God. God doesn't have an arm. He. He doesn't have a nose, he doesn't have eyeballs. Because we're used to thinking of a body as being an object or a collection of objects. Then when those kinds of words are used to talk about God, we say, well, God doesn't have that. He's not limited like we are. So it's just a metaphor. He accomplished this through some other means that the biblical writers were just trying to come up with ways of talking about."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":758.81,"end":761.24,"speaker":"Fr Stephen De Young","text":"And so, yeah, and this is what."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":761.24,"end":761.88,"speaker":"Fr Andrew Stephen Damick","text":"They came up with."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":762.44,"end":765.48,"speaker":"Fr Stephen De Young","text":"The term that's applied to that is anthropomorphism."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":765.48,"end":765.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":765.88,"end":771.48,"speaker":"Fr Stephen De Young","text":"Anthropos, meaning a human. Right. And morph, form, shape."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":772.2,"end":777.96,"speaker":"Fr Andrew Stephen Damick","text":"So we're giving a human shape to God in order to try to understand him better, bring him down to our level."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":778.12,"end":794.28,"speaker":"Fr Stephen De Young","text":"Human beings can understand God. God is distant and remote and unintelligible. And so we kind of just explain him and describe him in human terms. That's how they'll. That's how people will generally talk about those references in the Scriptures."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":794.52,"end":795.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":795.88,"end":798.84,"speaker":"Fr Stephen De Young","text":"And we're here to say that's exactly backwards."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":800.44,"end":801.8,"speaker":"Fr Andrew Stephen Damick","text":"Yep, that's right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":802.92,"end":812.04,"speaker":"Fr Stephen De Young","text":"Exactly the reverse of the truth. That the way the Scriptures see it is that humans are theomorphic."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":812.92,"end":813.32,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":813.4,"end":817.16,"speaker":"Fr Stephen De Young","text":"Humans are in the image and likeness of God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":818.19,"end":818.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":818.91,"end":837.47,"speaker":"Fr Stephen De Young","text":"So God is the paradigm. And then humans are a sort of weak and diminished version, and our powers are a weaker or diminished version of his powers. Not we take our powers that just sort of project them to giant size and attribute them to Him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":837.71,"end":890.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know, and correct me if I'm wrong about this, but like an obvious parallel seems to me wherein, if I recall correctly, it's Ephesians chapter five, that passage that gets read at weddings in the Orthodox church where St. Paul talks about how men and women are, you know, husbands and wives are supposed to relate to each other within marriage. And then he says, but I am speaking of Christ and His Church. And so a lot of times the way that that gets read is people say, oh, oh, the relationship between Christ and His church is like human what? Marriage. But as I've pointed out many times to couples, as I was preparing them to get married, saying, no, no, no, no, your marriage is like the union between Christ and His church. Am I off base here or no?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":890.33,"end":897.57,"speaker":"Fr Stephen De Young","text":"That's right. And thank you for choosing the least controversial possible example you could have taken from Ephesians 5."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":899.81,"end":901.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":901.89,"end":903.49,"speaker":"Fr Stephen De Young","text":"This could have gone a whole different way."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":903.65,"end":905.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're like, wait, what is he about to say?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":908.69,"end":923.17,"speaker":"Fr Stephen De Young","text":"But yeah, so God is. I mean, God is eternal. God is. So what we call seeing is sort of a very weak version of what it means that God is able to see."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":923.65,"end":924.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":924.61,"end":949.04,"speaker":"Fr Stephen De Young","text":"And so what we call eyes is. Is this weak material, fragile, subject to corruption version of God's eyes. His ability to see, his ability to communicate, his powers, the divine energies. We have a human energy which is obviously much weaker."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":950.8,"end":952.24,"speaker":"Fr Stephen De Young","text":"But is in the."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":952.24,"end":957.13,"speaker":"Fr Stephen De Young","text":"Image of the reality that is God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":957.93,"end":962.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's the original. We're the icon of that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":963.05,"end":963.41,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":963.41,"end":966.57,"speaker":"Fr Andrew Stephen Damick","text":"You know? Yeah, right. The much lesser version."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":966.89,"end":1002.02,"speaker":"Fr Stephen De Young","text":"Right. And so going back to that example of God having a face, Right. And him not denying that he has a face, this is something that gets masked in most of our English translations all the time in the Old Testament, we read about the presence of God, the presence of God in the temple, the presence of God in general. Right. So Jonah gets told to go to Nineveh, to the Assyrians, and he knows that the Assyrians flay people alive. So he's like, nope. And it says that he flees from the face of God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1002.58,"end":1002.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1003.54,"end":1007.3,"speaker":"Fr Stephen De Young","text":"Because the word presence there was translated as presence is the word face."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1008.99,"end":1009.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1010.11,"end":1036.59,"speaker":"Fr Stephen De Young","text":"He flees from God's face. And we talked about face representing this power of communication. So when it says that Jonah is fleeing from the face of God, it doesn't mean, well, God's over here, this particular geographical locale, and he's running away from it. It's more like he's putting his fingers in his ears and going, na, na, na, na, na. I can't hear you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1037.28,"end":1038,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1039.12,"end":1042.88,"speaker":"Fr Stephen De Young","text":"And taking off in the other direction."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1044.72,"end":1045.12,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1046.96,"end":1065.68,"speaker":"Fr Stephen De Young","text":"That fear we mentioned, you can't. That where God says you can't see his face and live. That's what's going on. When the people of Israel come to Mount Sinai and they hear God communicating in the thunder on Mount Sinai, and they're terrified that they're going to die. And they say, moses, don't let God talk to us directly. We'll die."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1067.09,"end":1069.25,"speaker":"Fr Stephen De Young","text":"They say, you go, right? You go up there."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1071.25,"end":1081.53,"speaker":"Fr Stephen De Young","text":"And interact and talk to him and communicate with him for us. So that language of face is actually."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1081.53,"end":1083.97,"speaker":"Fr Stephen De Young","text":"Probably the most prevalent one of these."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1084.85,"end":1088.93,"speaker":"Fr Stephen De Young","text":"Even though it's hidden by translation in the Scriptures."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1089.41,"end":1204.76,"speaker":"Fr Andrew Stephen Damick","text":"And again, it's so tempting. Like Jonah fleeing from before the face of God, like, oh, that's a metaphor. Like, you know. But again, where exactly is God's face that he could run away from it, you know, so it doesn't, it doesn't make sense in that way. And again, nowhere in there does it say, this is a metaphor. Like you said. God doesn't say, well, I don't really have a face, but I'll let you say that I have a face because it makes sense for you. And this speaks to. One of the sort of critiques of Christianity is that man makes God in his own image, but that's actually not the Christian teaching, although some Christians effectively seem to think that it is, because this is what we're talking about, that we say, oh, well, we do use this human language for God. It's anthropomorphic language for God, but he doesn't really have that. There's kind of an apologetic side to this as well. Could say, no, no, no. Actually, no. This language that we use for God refers to something real. And the human version of it is the kind of, you know, much lower, lesser version of that. So even though I understand sight by virtue of what I'm doing now, you know, the things that I have that are. There's eyelids blinking on the outside of that's just a, a small sliver of what God is able to do. I shouldn't assume that his sight is just like mine, but bigger. Right. There's something else going on there. Especially because he doesn't need eyeballs to do it. He sees in some other way that I don't understand, but he nonetheless does see. Nothing can hide from him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1205.39,"end":1211.07,"speaker":"Fr Stephen De Young","text":"Yeah, he doesn't. He doesn't need and won't ever need the cheap Walmart reading glasses I need now that I'm always breaking."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1211.31,"end":1216.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which I'm getting close to probably getting a set for myself since we're about the same age."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1219.23,"end":1220.75,"speaker":"Fr Stephen De Young","text":"So you get like five packs."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1220.75,"end":1222.03,"speaker":"Fr Stephen De Young","text":"So when they break, you just move."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1222.03,"end":1222.71,"speaker":"Fr Stephen De Young","text":"To the next one."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1222.71,"end":1224.43,"speaker":"Fr Andrew Stephen Damick","text":"Just flip. Yeah, right. Exactly."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1227.23,"end":1255.02,"speaker":"Fr Stephen De Young","text":"So, Right. And yeah, so our powers. And this is key. I'm tempted to go down this rabbit hole, but I won't. I'm sure we'll talk about it more in the future. But this is key to all kinds of things in terms of how we think about God, where understanding that we're not. He isn't like us. Right. We're becoming like him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1256.06,"end":1257.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1259.33,"end":1264.29,"speaker":"Fr Stephen De Young","text":"And those are. Those are very different sort of ways of, of proceeding. So."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1264.29,"end":1333.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So. So, you know, to kind of summarize this piece of it, you know, when we talk about a body being a nexus of potentialities, a collection of powers or energies, you know, it's not a kind of object. It's rather the. The abilities that we have to do. You know, not just we, but the ability that anything that has a body has to do all these things. And God has these abilities. Right. Scripture talks about him this way. So that's what a body is. So if that's what a body is, then then how does that differ from our concept of the body? And then what do we do about the fact that we have all this language, especially in the New Testament, about flesh? Right. I mean, I think most of us tend to think that body and flesh are just synonyms. I mean, that's the way we use it in English. Right. That flesh is just kind of a nice poetic, archaic way of referring to the same thing that we mean when we talk about bodies. So I know St. Paul makes this distinction."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1334.04,"end":1334.52,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1334.92,"end":1345.41,"speaker":"Fr Andrew Stephen Damick","text":"What does St. Paul say about the difference between body and. I know that in Greek, body is soma and flesh is sarx. Those are the two words we're dealing with in Greek."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1346.05,"end":1363.17,"speaker":"Fr Stephen De Young","text":"And this is the biggest place where you can easily go completely wrong with reading. St. Paul is missing the nuances of the way he uses. He distinguishes between his usage of similar words."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1363.57,"end":1364.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1364.61,"end":1405.87,"speaker":"Fr Stephen De Young","text":"So when he talks about Judeans, it's usually translated in English as Jews. That's not the exact same group of people he's talking about. When he talks about Israel, he doesn't just use those interchangeably. And this gets really granular to the point that St. Paul, when he refers to dead without a definite article, is referring to a different group of people than when he refers to the dead with a definite article, even though both get translated as the dead in English. So in most English translations, you can't even tell. So this is how nuanced he could be. So the same is true."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1406.35,"end":1408.27,"speaker":"Fr Andrew Stephen Damick","text":"I think we need a new study Bible, Father."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1410.67,"end":1426.15,"speaker":"Fr Stephen De Young","text":"The same is true with the way he uses body and flesh. Right. We can read over it very quickly. And there is, for example, a gnostic reading of St. Paul that reads these both the same."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1426.79,"end":1427.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1427.75,"end":1443.75,"speaker":"Fr Stephen De Young","text":"Because as you'll see, even just casually reading one of St. Paul's epistles. And this is true outside of St. Paul as well. It's just very clear in St. Paul. But St. John and his epistles and other New Testament authors use these terms the same way, basically."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1444.15,"end":1446.32,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so it's consistent across the New Testament."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1446.55,"end":1448.79,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It's just St. Paul is sort of Exhibit A."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1448.79,"end":1450.47,"speaker":"Fr Stephen De Young","text":"It's sort of the easiest place to see it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1450.71,"end":1451.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1453.43,"end":1484.13,"speaker":"Fr Stephen De Young","text":"St. Paul has a lot of negative Things to say about the flesh. Yeah, Right. And its inability to inherit the kingdom of God, for example. And ties. It seems to tie it very much to sinfulness and to the passions and desires. And again, if you read that as meaning, okay, well, our body is sinful, and then our soul, which is this other thing."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1484.85,"end":1485.25,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1485.49,"end":1489.65,"speaker":"Fr Stephen De Young","text":"Is not. You can very easily go in a gnostic direction."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1490.13,"end":1498.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. Where the material gets opposed to the spiritual. Right. Yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1498.9,"end":1541.2,"speaker":"Fr Stephen De Young","text":"And so body for St Paul and for the ancients in general is this overarching category of this nexus of potentialities. And we'll dig deeper into what he says in 1st Corinthians 15 next time. But there, for example, he talks about how angels and men and animals have different types of bodies, all within that big category of body. They all have powers, they all have the ability to interact with the world. They all have these potentialities. Flesh is then a subcategory. It's a smaller circle within the big circle of bodies is flesh."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1543.44,"end":1543.84,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1546,"end":1563.81,"speaker":"Fr Stephen De Young","text":"Flesh is a type of body that for St. Paul, in the other New Testament authors, is weakened, is corruptible, is changeable, is mortal. It's an even more limited version of the original human body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1564.53,"end":1704.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's, it's, it's, it's the way the human. I mean, we're going to talk about Adam and Eve for just a second. Maybe we should introduce that. So Adam and Eve, they have the original human body, and then. And then it changes because of sin. And God gives them this change. It doesn't just sort of come out of nowhere on purposes. Yeah. For reasons which we're going to go into a lot more next time. So write down the phrase garments of skin, everybody. But this is not that episode two weeks from today. But just to cover this briefly, though, God gives them what are called in Scripture, garments of skin, which doesn't mean that he gives them nice leather suits. It means that their bodies are altered, so they now become fleshly bodies. Right. And I kind of like that as a sort of adverb or, you know, I don't know if it's adjectival. Yeah, I guess it's adjectival. But fleshly bodies, and then they function in a fleshly way. So it's not only just a kind of way that their body is changed as sort of a thing, but also the way that they function, because again, a body is a collection of powers and abilities and so forth. And so what that means then is that our bodies, when God gives mankind the garments of skin, our bodies change in Such a way as to become limited and corruptible and deathly. We're going to talk next time about why that was actually good from God's point of view. So we're giving all kinds of teasers. But I think it's really important to understand that this change happens. It's not that they were exactly the same before and now, oh, boom, now you can die. That's not all that that happens. You know, that they. Again, if a body is a kind of collection of powers, a nexus of potential potentialities, then then that means that the powers themselves change. So they presumably lose some abilities and gain some abilities."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1705.4,"end":1765.49,"speaker":"Fr Stephen De Young","text":"Weirdly enough, there are powers that are lost. Yeah, they're lost completely. And potentialities that are lost. There are powers and potentialities that are weakened like the noose, the mind. And so there are capacities that are weakened and attenuated. And then there are new potentialities that are gained like mutability and changeability and mortality. Right. That are taken on by them at the point of that change. So if you think about a being's body as sort of a circle that includes. Right. Or like a bubble that includes all these powers and potentialities. Right. The change that happens is that some of those leave, some of those diminish, and then new ones sort of come into the membrane."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1766.13,"end":1766.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1768.61,"end":1770.13,"speaker":"Fr Stephen De Young","text":"Now I sound like an originist because."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1770.13,"end":1771.57,"speaker":"Fr Stephen De Young","text":"I've got a spherical body, but."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1774.29,"end":1777.91,"speaker":"Fr Andrew Stephen Damick","text":"That'S a good. That's a good name drop for a lot of the super nerds out there."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1777.91,"end":1780.99,"speaker":"Fr Stephen De Young","text":"Yeah, send your written condemnations too. Afr."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1782.83,"end":1839.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or I mean, like another way. And this is just a metaphor, people, but it's just something that occurred to me right now. But another way of thinking about it is almost that our. If we could think of our bodies as having DNA. And again, I'm using body in that sense of the nexus of potentiality is not DNA like the way we think of the modern idea, but DNA, of course, is the kind of code that tells our flesh what to do, how to shape and function and so forth. We could imagine in a sense that the DNA of our collection of powers gets rewritten because now it does different things functions differently. Again, this is a metaphor. I don't know. Does that work in terms of rewriting the code, so to speak? I don't know. No metaphor really, really works. But, you know. Yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1839.17,"end":1840.77,"speaker":"Fr Stephen De Young","text":"But hopefully one of those at least."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1840.77,"end":1843.13,"speaker":"Fr Stephen De Young","text":"Will help people start to wrap their head."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1844.73,"end":1846.37,"speaker":"Fr Stephen De Young","text":"And once you have that in mind."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1846.37,"end":1854.81,"speaker":"Fr Stephen De Young","text":"Though, you can see that play out. Right. So St. John doesn't say the Word took a body. He says the word became flesh."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1855.53,"end":1856.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1856.69,"end":1905.06,"speaker":"Fr Stephen De Young","text":"It's more specific than that because just saying the word took a body wouldn't mean the same thing. We're talking about the incarnation, Christ being made man. And when Christ after the resurrection says a spirit has not flesh and blood, as you see that I have, he doesn't say a spirit doesn't have a body. He says a spirit doesn't have flesh and blood. So yeah, the human flesh and animal flesh is also flesh. But we'll get more into that next time. But a fleshly body is a type of body. It's not synonymous with. This is always what a body means."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1905.86,"end":1956.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And we're going to go to a break in just a second here. But another thing, you know, we're just going to give people all kinds of hooks to save for next time because this is what we do on this show. But another one to think about is, you know, when Christ rises from the dead, as you were just talking about, he still has flesh and bone. So that means that his body still has flesh, you know, that there's something about it that is still quite human, you know. And obviously we're going to talk about that more the next time. But clearly it works in a different way. After the resurrection, he's no longer mortal, for instance. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1956.27,"end":1959.87,"speaker":"Fr Stephen De Young","text":"Well, he technically wasn't before. Yeah, we'll get into that next time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1959.87,"end":1962.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, exactly. Sorry. Sorry. Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1962.35,"end":1962.91,"speaker":"Fr Stephen De Young","text":"All right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1962.99,"end":1977,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, all that being said, we're going to go ahead and take a break and please call. We would love to hear from you and talk to you, even though this is a very mind bending version mind bending episode of the Lord of Spirits. So let's go ahead and go to break and we'll be right back in just a second."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":1977.48,"end":1995.25,"speaker":"Announcer","text":"Fr. Andrew Stephen Damick and Fr. Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-23723. That's 855-AF-RADIO."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2000.29,"end":2040.91,"speaker":"Announcer","text":"Are you struggling in your walk with Christ? Do you want to rediscover your reason for living? The person you were created to be? Renewing you, a priest, a psychologist and a plan gives you the keys to unlock areas of your life that hold you back from fully experiencing the renewal and transformation God has in mind for co authored by a priest and a psychologist, Father Nicholas and Dr. Roxanne Lowe, renewing youg combines principles of spiritual growth with psychological tools to help you become your best self fully connected with God's purpose. For you to purchase this book, please go to store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2045.16,"end":2061.16,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2063.08,"end":2144.47,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second part of the show, and it's where we begin to take your calls. We would love to hear from you. You can reach us just like you heard from the voice of Steve at 855-AF-RADIO. 855-237-2346. And we would love to talk to you. So. All right, we in the first part, we talked about what is a body, and also a bit about what it means that, that God has a body. And also we touched very briefly on what happens to Adam and Eve's bodies after they sin. But in trying to begin to rewrite the way that we think about this stuff and bring it into line with what the scripture says, which is embedded in this ancient way of thinking, we need to talk a little bit about how it is we got to the way that we think now. And actually the seeds for that are sown in the ancient world. Right. But it doesn't come from scripture. It comes from pagan Greek philosophy who they begin to ask the question, does God have a body? And the answer that they come up with is, no, he doesn't. Right. So how did they get to that? And what does that all kind of mean?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2145.11,"end":2153.04,"speaker":"Fr Stephen De Young","text":"Yeah. And really, what I mean, we're particularly obviously talking about Greek philosophy here."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2153.04,"end":2153.36,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2155.44,"end":2181.12,"speaker":"Fr Stephen De Young","text":"When the Greek philosophers start to address this question, what they're really doing is sort of philosophically dealing with and encoding what was already the general pagan view. We talked about this in a previous episode, how after what is described as the Tower of Babel event in Genesis 11 that we see in cultures all."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2181.12,"end":2181.88,"speaker":"Fr Stephen De Young","text":"Over the world."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2183.88,"end":2211.64,"speaker":"Fr Stephen De Young","text":"That the most high God, the creator God, the highest God, sort of becomes distant and is seen to be disconnected and removed from the world. And human beings interact with these sort of lesser gods and spirits, but not with the, the greater gods. And so the Greek philosophers don't substantively differ from that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2212.36,"end":2212.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2212.84,"end":2223.64,"speaker":"Fr Stephen De Young","text":"But they do speak about it, obviously, in a different and philosophical way that will especially deal with it in terms of, of having a body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2224.28,"end":2224.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2224.68,"end":2234.94,"speaker":"Fr Stephen De Young","text":"So if you look at, for example, Aristotle, they were going in reverse order by talking about Aristotle and then Plato."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2235.9,"end":2239.5,"speaker":"Fr Stephen De Young","text":"How dare you Sir, I know people."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2239.5,"end":2240.86,"speaker":"Fr Stephen De Young","text":"Are offended all over the place."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2241.66,"end":2243.5,"speaker":"Fr Stephen De Young","text":"You could have started with Parmenides, but."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2243.5,"end":2244.86,"speaker":"Fr Stephen De Young","text":"Then people would really fall asleep."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2247.74,"end":2256.22,"speaker":"Fr Andrew Stephen Damick","text":"I just remember pre Socratics like Thales, who supposedly thought everything was made of water. That's what I remember from that bit of undergraduate introduction to philosophy."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2256.7,"end":2299.29,"speaker":"Fr Stephen De Young","text":"I'm not taking your bait, sir, and getting into that. So for Aristotle, we usually refer to Aristotle's quote unquote God or quote unquote Most High God is the prime mover because we're getting it kind of filtered through Thomistic theology. But the way he describes this being like in Metaphysics Lambda is he describes this being as noicios, which is something like thought thinking itself, right?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2299.29,"end":2299.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2300.05,"end":2322.81,"speaker":"Fr Stephen De Young","text":"Or just like pure thought. But key to that is the idea that because it is the highest being, it is the being of beings. It is completely unaware of anything else that exists because for it to think about anything other than itself, it would have to lower itself."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2323.77,"end":2384.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, there's this, right? And so then this is the beginning of like, you know, Gnosticism kind of branches off from this idea that the true God, the unmoved mover. Right. Is so pure, so perfect that it can't even pay attention to anything. It just be perfect sort of self contemplation. Because without that then it's sort of lowering itself. Right? So, yeah, so before we get too much deeper into that, which we certainly will, we actually do have someone calling in. So we have Alec who is calling from Florida and he has a question about what happens to our body in the next life pertaining to theoses. So Alec, can you hear us?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2385.26,"end":2389.5,"speaker":"Alex","text":"Yes, Fathers Alex with an X from sunny Orlando, Florida."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2389.5,"end":2390.14,"speaker":"Fr Stephen De Young","text":"I can hear you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2390.78,"end":2396.61,"speaker":"Fr Andrew Stephen Damick","text":"Alex with an X. Excuse me. Well, welcome Alex, to the Lord of Spirits. What exactly is your question?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2397.33,"end":2439.45,"speaker":"Alex","text":"Yeah, so it's a bit convoluted, I guess, but the glorified saints, I would think, take part in the divine council. So to an extent, I don't know how much they share in God's, I guess their powers of omniscience are enhanced, their bodies are glorified. Speaking of Christ's body as an example, first fruits. And I was wondering if you could tie that into the concept of the nous. And to what extent in the church experience, in the church's experience, do saints in their earthly life achieve, you know, these aspects of clairvoyance, you know, knowing things that they couldn't humanly know, things of that nature?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2440.09,"end":2536.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, that's a great question. You know, I'll just say one thing and then and then Father Stephen can correct me or add to it or whatever. Actually. Actually. Yeah, yeah. So, you know, part. And we're going to cover this a lot more in the next episode, but just to answer a little bit this time around, you know, part of what happens, or I should say what happens in theosis, you know, this process of becoming adopted sons of God and becoming more like him and participating in his glory, is that our body begins to become. To reflect more the likeness of God. Right. And so that's why the, the. The saints have the abilities that they do is they're. They're actually. They're becoming what human beings were meant to be. Right. But that's not, you know, human being. Right. Human beings are not. Are not independently sort of powerful. It's their participation in God that makes them what it is that they are. And have these, from our point of view, what looks like extraordinary abilities, but actually is kind of ordinary. They're normal. The rest of us are abnormal, right? In a sense, yeah, exactly. Exactly. So, I mean, that is at least what I would say about that. I don't know. Father, do you have anything you wanted to add or adjust or correct or."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2536.98,"end":2540.18,"speaker":"Fr Stephen De Young","text":"Whatever I'll add, this is."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2542.66,"end":2616.25,"speaker":"Fr Stephen De Young","text":"Like we've been saying, we'll get into this a little more next time, but this is pertinent here because I think what we're talking about tonight, what we're going to talk about in two weeks as we go on, hopefully you'll see if we do a good job of explaining it, that this is the nexus where a whole lot of our theology and our belief all comes and fits together. And so specific to theosis, we have these sort of different moments we think about or talk about when we talk about theosis, we think about, like, glorification and the transfiguration of the body, Christ's transfiguration. Some of the saints who have shown with the uncreated light of God at the times of their deaths or at other times in their life. And we also think about participation in the divine energies, right? The energies of God, God's activities and his power in the created order. And we have these as sort of. These separate things and the purification of the noose. We have all these things as separate, but this is really where those come together. Because if we come to participate in God's energies, right, we don't gain, like, God powers, right?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2616.33,"end":2618.53,"speaker":"Fr Stephen De Young","text":"Like we don't get some power he."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2618.53,"end":2623.65,"speaker":"Fr Stephen De Young","text":"Has, but we participate in His. He acts through us when, when we're."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2623.65,"end":2626.77,"speaker":"Fr Stephen De Young","text":"Imaging him like a conduit Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2626.77,"end":2652.31,"speaker":"Fr Stephen De Young","text":"And so that is transforming then of our powers and therefore of our body. So the idea of transfiguration and glorification, that's where that comes together with the idea of participating in the divine energies. Right. Because our body then becomes the instrument for God's energies and powers and activity."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2654.95,"end":2657.99,"speaker":"Fr Stephen De Young","text":"Similar to the way nature. Yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2657.99,"end":2667.75,"speaker":"Fr Stephen De Young","text":"So similar to the way that I was talking about that, you know, the gushy things in our skull, the gushy orbs, are the instrument that we use for the power of sight."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2669.61,"end":2669.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2670.81,"end":2682.25,"speaker":"Fr Stephen De Young","text":"We as persons become instruments of God's love or peace in the world. And then that's transformative."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2683.29,"end":2687.09,"speaker":"Alex","text":"And for that reason, among others, the church is called the Body of Christ."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2687.09,"end":2688.25,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2690.89,"end":2691.77,"speaker":"Alex","text":"Love in the world."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2692.17,"end":2692.53,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2692.53,"end":2709.89,"speaker":"Fr Stephen De Young","text":"That's what St. Paul's getting at when he talks about the body in 1 Corinthians 13, that the way in which Christ communicates to the world is through the church, the way that Christ has brought to the world his feet, his hands. Right. That's the Church."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2710.45,"end":2736.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, we're going to flesh that out, pun intended. A lot more. Sorry, I couldn't help myself. Yeah, yeah, yeah. A lot more in two weeks. But we just kind of realized when we were going over this, or actually, I should say, Father Stephen just informed me, look, this is going to take a couple episodes. I was like, great. Yeah, right, exactly. There's a lot more."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2736.96,"end":2737.84,"speaker":"Alex","text":"Thank you, Fathers."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2737.92,"end":2740.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thank God. Thanks for calling in, Alex."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2740.48,"end":2741.12,"speaker":"Greg","text":"Thank you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2741.6,"end":2844.48,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah. So, all right, let's talk a little bit more about the God of the philosophers, if we can put it this way. Right. So there's this idea that it's the unmoved mover, that this God doesn't even pay attention to. To anything other than itself. Right. You know, it does not communicate, does not see, does not hear. Right. So what the philosophers are denying is that God has body in this ancient sense of being, this nexus of potentialities, collection of powers and abilities. And as I was trying to imagine what that could be like. Right. Because there's still this. There's still some kind of, like, interaction with. With the rest of. With creation. You know, you still have, you know, like it's the unmoved mover. Right. But it's moving. Like, I thought about the Force in Star Wars. Right. I mean, it's not a perfect analogy, but. But the Force in Star wars is similar in that, you know, it doesn't talk to you. Although, I mean, obviously, depending on which one of the films you're watching, the Force seems to have A will. But there's not, you know, the force doesn't step out and say, hey, Luke, I have something that you need to know. You know, that's not a thing. But there's still this sort of influence there. But it's impersonal, Right. Would it be correct to say that the philosopher's God is not a personal God? What do you think, Father? Well."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2844.56,"end":2870.97,"speaker":"Fr Stephen De Young","text":"Well, because we have this idea of prime mover, we might be deceived into thinking that that means, well, he's moving everything else. Right. That he's sort of actively, you know, he's somewhere in some other realm turning a crank. And that causes everything else to move, you know, starting with the sun, moon and stars and then working its way down."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2871.13,"end":2871.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2872.33,"end":2901.54,"speaker":"Fr Stephen De Young","text":"But that's actually sort of the opposite of how it works. The way it actually works is that everything else sort of sees the unmoved mover, sees thought thinking itself and motivated by love and sort of awe of its perfection, attempts to imitate this sort of impersonal but perfect being."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2901.7,"end":2907.62,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I see. So it's almost an unmoved inspirer rather than mover. Exactly. Does that. I don't know."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2909.22,"end":2962.15,"speaker":"Fr Stephen De Young","text":"They move out of desire to be like it and to be closer to it. So it's sort of like the whole cosmos stands, the prime mover. And, like, must, you know, try to be closer to it. And that's not a place where Aristotle differs from Plato. So Plato has basically the same thing in that he has the good, and the good is sort of in perpetual stasis. Doesn't move, doesn't change because it's perfect. So how could it. Right. If it changed, it wouldn't be perfect anymore. So the heavenly bodies, which are sort of the next most perfect thing, move in circles because going in a tight circle is the closest they can get to imitating that sort of perfect stasis."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2962.31,"end":2963.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2964.31,"end":2974.95,"speaker":"Fr Stephen De Young","text":"And that's why Plato, in the Timaeus in particular, comes up with this demiurge, this lesser divine being who's going to create everything else."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2975.35,"end":2975.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2975.91,"end":2989.03,"speaker":"Fr Stephen De Young","text":"And he sort of looks at the good and looks at it admiringly and sort of tries to create everything else based on that. That admiration and sort of inspiration."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2989.35,"end":2989.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":2991.03,"end":3001.27,"speaker":"Fr Stephen De Young","text":"That it draws. So this is. This is a God that doesn't have a body in the ancient sense that we've been talking about."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3002.84,"end":3003.08,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3003.48,"end":3008.2,"speaker":"Fr Stephen De Young","text":"It doesn't communicate, it doesn't act, it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3008.2,"end":3008.68,"speaker":"Fr Stephen De Young","text":"Doesn'T."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3010.44,"end":3025.08,"speaker":"Fr Stephen De Young","text":"Speak, it doesn't hear. It doesn't see anything else right outside of itself. And that gets, as you mentioned, Already brought over into Gnosticism fairly directly."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3025.16,"end":3025.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3027,"end":3061.92,"speaker":"Fr Stephen De Young","text":"When we found the Nag Hammadi library, sort of the biggest collection we found of the Gnostic texts, Plato's Timaeus was in there as part of it, sort of as their Old Testament. So they had this Plato creative story. And you see in various Gnostic systems, they have this God with a capital G who is remote and unknown and unknowable, and then this whole series of emanations sort of working their way down until you get to material things in. In that direction."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3062,"end":3279.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And. And it's, you know, it's easy to see then, you know, that this God of the philosophers who has nothing directly to do with us, you know, it's really easy to see how people can morph that into, for instance, Deism, which is a little bit closer to us, right? The. The. Is the idea that God created everything and then walked away from it. You know, the. The cosmic watchmaker, right? Wind up the watch and now just let it tick away. And then there's not much distance from that to. To our disenchanted world, which is a major theme of everything we talk about in this podcast. Because if God is not present to us by means of his body, right, the body that we've been talking about, his collection of powers, nexus of potentialities, the ways that he interacts with mankind, if he's not present to us in that way, then it becomes all the easier not to believe that he's there at all or that if we do believe that he exists, he's kind of not an everyday thing. You know, he's out there somewhere, right? And, you know, we wish once in a while that a miracle might happen. Boom. Oh, he stepped in. Thank you, God. But this is the origin of the kind of disenchanted way of understanding the world of secular materialism, because this is the God that doesn't have anything to do with us. This is the God that can't interact with us or won't. Right. However you want to perceive what. You know what that is. I mean, obviously Plato and Aristotle are describing a God who can't interact with us, because that would be against his nature. Right. Modern man looks up, sees nothing, shouts at the sky, and gets no answer back. And so he assumes, well, God, if you're out there, obviously you don't care, you know, but they're just kind of different permutations, different ways of essentially seeing God in the same way. I mean, this is kind of pastorally huge and theologically huge, right? You know that the God of Abraham, Isaac and Jacob, the God and father of our Lord Jesus Christ, is not the philosopher's God. The philosopher's God has no body. He's remote. It. I should really say it, really. Right. It is remote and distant because he implies this kind of personal reality, you know, and so we can't know him. And the idea that Jesus Christ would make him known, as we're going to talk about in a second here, that doesn't make any sense at all. And the way that that kind of makes its way down through history, is that eventually you get what's referred to as the God of the gaps. There's these scientific things happening that we can't explain. So we'll just say, well, that's God. But then as science gets bigger, then, well, we don't really the God of the gaps anymore. So, boom. Secular materialism eventually is. Is kind of where that way of thinking goes. And so it's. It's interesting that there's a direct line between saying God does not have a body and ultimately secular materialism, atheism, all of these modern problems that we have now."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3279.93,"end":3286.13,"speaker":"Fr Stephen De Young","text":"Right, right. And you, you sort of start with gnosticism, you cut out all the middlemen, and. And you're left with agnosticism."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3286.13,"end":3301.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yes, there are a lot of middlemen along the way. I mean, I'm just sort of, you know, just sort of, you know, skirting over 15, 16, 1700 years of history there. But as one does. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3301.97,"end":3323.56,"speaker":"Fr Stephen De Young","text":"So, yeah. So this comes up, as you mentioned, in terms of how we understand who Christ is. And it comes up at an event that I think a lot of people have probably heard of, at least vaguely, but may not know what it was actually about."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3324.04,"end":3333.56,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. When we were reviewing, when we were reviewing this, I had only the barest outline I remember, like, oh, yes, this is something where someone said something bad about St. John Chrysostom."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3333.88,"end":3341.61,"speaker":"Fr Stephen De Young","text":"Right. And if it's dealt with in terms of what it was about, what you usually get is, well, this was really just about church policy politics."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3341.61,"end":3342.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3344.09,"end":3353.85,"speaker":"Fr Stephen De Young","text":"But we're talking about the Synod of the Oak, which is when St. John Chrysostom was condemned and exiled for the first time in A.D. 402."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3354.41,"end":3354.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3356.33,"end":3361.77,"speaker":"Fr Stephen De Young","text":"And, you know, it is like, there was a lot of church politics involved. This was motivated by that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3361.85,"end":3362.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3362.41,"end":3369.22,"speaker":"Fr Stephen De Young","text":"But that is, there was an actual accusation made against him of heresy at this synod."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3369.61,"end":3370.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3370.25,"end":3374.41,"speaker":"Fr Stephen De Young","text":"And so what we want to talk about here is the nature of that accusation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3374.65,"end":3383.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's very pertinent to everything that we've been discussing. And we'll say from the outset that it was a false accusation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3384.17,"end":3385.77,"speaker":"Fr Stephen De Young","text":"Yes, yes, yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3385.93,"end":3386.33,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3386.73,"end":3396.73,"speaker":"Fr Stephen De Young","text":"Yeah. But so if you've read anything about the Synod of the Oak, you'll probably know that they accused St. John Chrysostom of being an Origenist."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3397.08,"end":3397.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3398.44,"end":3415.16,"speaker":"Fr Stephen De Young","text":"Now, Origen is. It's a very flexible accusation. It can refer to lots of things. You could be saying somebody's a universalist. You could be saying that they think that resurrected bodies will be spherical. You could be saying that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3415.4,"end":3417,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's my favorite."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3420.84,"end":3421.24,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3422.2,"end":3434.6,"speaker":"Fr Stephen De Young","text":"But in this case, what they were saying made St John Chrysostom an Origenist was that they accused him and the tall brothers, who he'd sort of given aid and comfort to from Egypt."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3434.6,"end":3437.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Who are a group of monks, by the way, these tall brothers."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3437.84,"end":3443.6,"speaker":"Fr Stephen De Young","text":"Yeah, right. He was accused of being an originist because they said. He said that God didn't have a body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3444.72,"end":3446.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. They're saying that he said that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3447.12,"end":3475.88,"speaker":"Fr Stephen De Young","text":"Right. They accused St. John Chrysostom of saying that God doesn't have a body. And a group of monks were sent who are referred to as anthropomorphists because they believed that God had a body. Right. And so sometimes if anyone even gets into the details of the accusation, they look at it as kind of silly because they say, well, of course God doesn't have a body because they're thinking of body in the modern sense."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3475.88,"end":3476.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3477.64,"end":3479.8,"speaker":"Fr Stephen De Young","text":"Not as we've been talking about it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3479.8,"end":3480.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3480.77,"end":3488.93,"speaker":"Fr Stephen De Young","text":"So the accusation at the time actually was an accusation about St. John's Christology, primarily."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3488.93,"end":3498.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think it's important especially to know that part of the frame for this is that it's actually a guilt by association accusation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3498.45,"end":3498.89,"speaker":"Announcer","text":"Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3498.89,"end":3520.15,"speaker":"Fr Andrew Stephen Damick","text":"It's not from something that he himself ever said or wrote. Right. It's just you're from this town and they have bad Christology over there. So you therefore must as well, because we all know how people from Antioch are, don't we? Nudge, nudge, wink, wink. You know. Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3520.15,"end":3527.55,"speaker":"Fr Stephen De Young","text":"And it's. It's Antioch. And there are other Antiochen writers whose Christology was later condemned."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3527.71,"end":3528.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3528.43,"end":3537.55,"speaker":"Fr Stephen De Young","text":"Like Theodore of Mapsuesta, Theodore d'. Seir. And it was not coincidental that they were condemned alongside Origen."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3537.55,"end":3537.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3538.53,"end":3541.25,"speaker":"Fr Stephen De Young","text":"Because there is a connection that we're about to talk about."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3543.49,"end":3543.89,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3546.21,"end":3572.7,"speaker":"Fr Stephen De Young","text":"The idea is they were condemned for a Christology that was Nestorian, meaning they were condemned because they said that their view of Christ had some kind of separation between Christ's humanity and his divinity. And the particular way that worked was based on a certain view of Christ as a divine person."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3573.18,"end":3573.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3574.54,"end":3601.11,"speaker":"Fr Stephen De Young","text":"If you take. And again, we won't get into whether this is even actually what Origen believed, but Origen was thought and said to have accepted this philosophical notion of the divine nature, that God has no body in this ancient sense. This ancient sense that God doesn't communicate directly to his creation or act directly in his creation, that he can't."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3601.35,"end":3616.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now would it be correct to say, I know that, you know, the word is developed a lot much later, but it would be correct to say that these are the energies of God we're talking about? Is energies of God synonymous with the body of God?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3618,"end":3624.64,"speaker":"Fr Stephen De Young","text":"I wouldn't say synonymous, but there's certainly some. There's some overlap here."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3624.64,"end":3625.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Yeah, okay."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3625.76,"end":3656.51,"speaker":"Fr Stephen De Young","text":"Yeah. When we talk about God's powers and his. Yeah, okay. So for him, God, capital G, they held that for origin God, capital G is like the God of the philosophers and is disconnected. And then for Origen, they held. Right, they held that Origen said that then the Logos is sort of a lesser divine being who serves as an intermediary."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3656.51,"end":3658.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3660.51,"end":3698.37,"speaker":"Fr Stephen De Young","text":"So if you imagine for a minute that we're thinking about Christ, we have Christ is humanity, but then you believe that divinity, including Christ's divinity, is bodiless in this sense is detached, is infinite, and, you know, unaware and unable to interact with creation. You end up having sort of this human being, Jesus, who is in some way attached to or connected to a divine person in some kind of unique way."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3698.61,"end":3700.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the force."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3701.81,"end":3706.41,"speaker":"Fr Stephen De Young","text":"Sorry, right. Midi chlorians, I don't know, is really."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3706.41,"end":3707.57,"speaker":"Fr Andrew Stephen Damick","text":"Strong with the force."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3707.89,"end":3735.57,"speaker":"Fr Stephen De Young","text":"Yeah, in some way. But it's not one person. Right, Right, it's not one person. And so that understanding of God is incompatible with orthodox Christology. Right. You can't have. If God is that way, you can't have a meeting with a person. And so that was the accusation, the incorrect accusation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3736.05,"end":3770.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if I recall correctly, Nestorius solution to this problem, because this was his view, Nestorius solution to this problem is to say that the divine Christ is joined to. To the man Jesus by goodwill. Right. Wasn't that true, you know, Evdoki or whatever? Yeah, by goodwill. Conjoined. By goodwill. So you have two persons who are conjoined. And it's made necessary for him to say this because he has this sense that God does not have a body in this ancient sense of having a body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3770.99,"end":3784.67,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. So the way this Ends up getting resolved, surrounds. And now we're going to use some fancy Greek and Latin words. In case everybody's not."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3786.35,"end":3790.47,"speaker":"Fr Andrew Stephen Damick","text":"We haven't lost everybody. We still have like maybe five or six people listening still."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3790.47,"end":3808.28,"speaker":"Fr Stephen De Young","text":"Yeah. In case there's anybody still hanging with us, this should take care of it. And that's this phrase in Greek, kyriakos anthropos, or in Latin, homo dominicus, which both translate roughly to sort of lordly man."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3808.44,"end":3809.64,"speaker":"Fr Andrew Stephen Damick","text":"Lordly man, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3811.64,"end":3816.44,"speaker":"Fr Stephen De Young","text":"That phrase in its original use was heretical."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3816.6,"end":3821.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Because it came from Apollinarius. Right, right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3821.56,"end":3842.61,"speaker":"Fr Stephen De Young","text":"And so the Apollinarians had a view of where the way you get one person for Christ is that he sort of has some human. Some human aspects and then some divine aspects. And when you put them all together, you get one person."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3842.69,"end":3882.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or the way I've often heard it described is that you swap out his human soul or mind for the divine Logos. And if I recall correctly, it was this particular problem, actually, that was what inspired St. Gregory the Theologian to say what is not assumed is not saved. In other words, if there's any part of human nature that. Any element of human nature that. That the Son of God does not assume in the Incarnation, then that we can't be saved. Right. So if he doesn't have a human mind, then our minds can't be saved and we're in big trouble, you know? Yeah, yeah, yeah. So you get sort of human parts, God parts, stick them together and you have the Apollinarian Christ."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3882.88,"end":3885.6,"speaker":"Fr Stephen De Young","text":"Right. And so that obviously is wrong."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3885.68,"end":3886.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3886.48,"end":3918.45,"speaker":"Fr Stephen De Young","text":"And Saint Cyril of Alexandria, when he was arguing against Nestorius, was accused of, at certain times of being an Apollinarian because he was insistent that there's just one person. And so they said, oh, well, you must be an Apollinarian and must, you know, have pieces if you say there's just one, one subject. And so he, in rejecting that charge, sort of condemned that term. Nonetheless, that term got resurrected by St. Mark the Ascetic."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3918.61,"end":3919.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3919.73,"end":3929.57,"speaker":"Fr Stephen De Young","text":"Or St. Mark the Monk. It's ascetic, not aesthetic. It wasn't that he was just really good looking or an excellent dresser."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3929.97,"end":3933.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he was probably a terrible dresser being a monk. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3934.53,"end":3938.41,"speaker":"Fr Stephen De Young","text":"But he took this term and redefined it and reused it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3938.41,"end":3938.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3939.09,"end":3945.57,"speaker":"Fr Stephen De Young","text":"And he used it to talk about Christ's body apart from the Incarnation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3946.13,"end":3948.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or before the Incarnation, maybe."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3948.21,"end":3950.21,"speaker":"Fr Stephen De Young","text":"Right, well, both."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3951.49,"end":3951.89,"speaker":"Fr Stephen De Young","text":"Time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3952.61,"end":3954.05,"speaker":"Fr Stephen De Young","text":"Time, Right, you know."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3954.05,"end":3955.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3955.21,"end":3966.2,"speaker":"Fr Stephen De Young","text":"God's outside of time, so. Yeah, before it gets tricky. Anyway, so to talk about the divine person Christ who pre existed. Incarnation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":3966.28,"end":4000.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in this case, then, you know that phrase lordly man, Lord, obviously hearkening back to the Old Testament reference to God, to Yahweh, the lordly man. There is by way of analogy, because we're talking about in as much as he's not man, you know. Right, yeah, yeah, exactly. Before he becomes man, even and apart, you know, whatever. So it's not that there is this man, this lordly man, who then joins with the human man, you know. Right, right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4000.12,"end":4017.57,"speaker":"Fr Stephen De Young","text":"But it's to say that the divine person, the Son of God, the Logos. Right. The word of God had a body in this ancient sense. Right, right. Meaning he had a will, he has energy."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4018.29,"end":4018.69,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4020.13,"end":4046.02,"speaker":"Fr Stephen De Young","text":"And this understanding then becomes the source of some of the later ecumenical councils where we'll say that Christ has two wills, divine will and a human will. Two energies, divine energy, human energy. Right. Because he has these capacities already. He is not cut off from creation in his divinity before. Before the incarnation."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4046.26,"end":4063.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, well, before we go to our next break, we have another call that has come in and this is Greg, who is calling from Texas. So, Greg, are you there?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4064.82,"end":4065.38,"speaker":"Greg","text":"I am."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4065.81,"end":4066.25,"speaker":"Fr Stephen De Young","text":"Good evening."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4066.25,"end":4072.77,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, good evening and welcome to the Lord of Spirits podcast. Greg, what is your question or your comment?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4074.77,"end":4101.65,"speaker":"Greg","text":"Short comment. Been listening to your podcast for a while. It is awesome. I'm also engaged on your Facebook group. I cannot thank you enough for the research and effort and everything you're putting out there. It is tremendously helpful to me, who is not at all orthodox and not at all from an orthodox background. I come from charismatic background, etc. So this is mind blowing to me and I love it. Thank you, thank you, thank you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4101.97,"end":4102.93,"speaker":"Fr Andrew Stephen Damick","text":"Well, welcome, Greg."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4102.93,"end":4158.7,"speaker":"Greg","text":"My question, my question, let's call it the God body. What kind of God body do the fallen sons of God have? And my question is specifically with an eye to the New Testament. I think it's a New Testament idea that the off the spawn of the fallen sons of God, you know, the spawn of the Nephilim, after they've died, et cetera, et cetera, the demons or the unclean spirits that are floating around, they seem to need or they seem to look for a physical body to inhabit. So that's why I'm trying to get some more knowledge around. What did they have when they die? What, like, what kind of body do they have? And why is there that need for them to, quote, unquote, find a human body or a physical body to inhabit?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4159.18,"end":4161.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we can't get away from giants."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4161.58,"end":4164.62,"speaker":"Fr Stephen De Young","text":"Father, who would want to."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4164.7,"end":4168.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. People get excited when you talk about giants."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4168.74,"end":4169.18,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4169.42,"end":4169.9,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4170.38,"end":4172.7,"speaker":"Greg","text":"I have a little giant episode once a week."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4175.65,"end":4259.74,"speaker":"Fr Stephen De Young","text":"So literally listen to it religiously. Yeah. So we're going to talk a little bit more about exactly what an angelic body is next time. But in terms of your question, we talked of course about the 5ish falls of Angelic beings. The angelic beings proper who fell still have an angelic body, though it's their fall has changed it in certain ways. So that's what we'll be talking about more next time. But the nephilim, the giants who died, those are the spirits of dead folks. So they don't have bodies currently. Their body went into the ground and decomposed. And that's why those are the spirits who will possess humans will indwell idols in temples, interactive. They don't have a body, strictly speaking right now and therefore can't really interact outside of outside of that. Now their bodies will be resurrected along with everybody else's on the last day and they'll go to their final condemnation. But we'll be talking about the bodily resurrection more next time too."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4259.74,"end":4262.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So does that help, Greg?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4263.62,"end":4267.94,"speaker":"Greg","text":"That helps tremendously. Thank you very, very much, fathers. Again, keep up the great work."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4268.26,"end":4282.54,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for calling in. All right. Well, that wraps up the second part of our episode this evening. We're going to go ahead and go to break and when we get back, we're going to actually talk about the way that the Old Testament talks about God's body. So let's go to break."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4282.86,"end":4299.58,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4300.06,"end":4303.76,"speaker":"Fr Stephen De Young","text":"Ray."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4306.07,"end":4359.05,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice. Prayer, Fasting and almsgiving. Books now available@store.ancientfaith.com and the title, once again, his toolkit for spiritual growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4363.61,"end":4379.77,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4382.5,"end":4453.47,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of the Lord of Spirits here on Thursday night, January 14th of 2021. We're glad to be with you. All right. We've just been bending your minds and definitely mine, I'm sure Father Steven's had this stuff well in hand for years now about talking about the body of God. And, you know, in the third part of the show, we want to talk specifically about some of the ways that the Old Testament shows that God does indeed have a body. Right. So, you know, let's talk about some of those. We have a few examples. There's actually piles of examples that we could give, but we just selected a few that kind of show that God is interacting bodily with his creation, with mankind. And perhaps the most common kind of thing that we see. We see, for instance, in Genesis chapter 15, when it says the word of Yahweh came to Abraham in a vision, or as it often gets translated as the word of the Lord came to Abraham in a vision. So, like he's seeing something. Right. That's a physical experience. Right. That's actually a material experience. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4454.51,"end":4458.67,"speaker":"Fr Stephen De Young","text":"That's actually the episode where he first receives the promises."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4459.07,"end":4459.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4459.87,"end":4494.35,"speaker":"Fr Stephen De Young","text":"Right. So what's presented there is not that there was a movie with who was it? Was it F. Murray? Abraham? I think maybe there was some Bible movie where he played Abraham. I think it was him. And he went out, sort of looked at the desert outside of a CGI ur and there was sort of this voice on the wind that came and spoke to him, and that was the word of the Lord coming to him. But it actually says the word of Yahweh appeared to him in a vision and told him these things."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4494.43,"end":4534.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. There wasn't a. OO yeah, yeah, yeah. All right, we've got some more. Another one having to do with visions. Right. So this is from First Samuel or First Kingdoms. I always get this mixed up. Chapter 3, verses 1 through 21. The word of Yahweh was rare. There were not many visions. Samuel did not yet know Yahweh, for the word of Yahweh had not revealed himself to him. And this is the part that really gets me. Yahweh came and stood calling, as at other times, he stood next to him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4535.64,"end":4552,"speaker":"Fr Stephen De Young","text":"Right? Yeah. So we're told there's this poverty of the word of Yahweh, and that doesn't mean, like, oh, well, there aren't prophets. Right. No one's committing anything. We're told there's not many visions, meaning nobody's seen him in a long time. He hasn't appeared to anyone in a long time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4552.16,"end":4552.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4553.2,"end":4562.32,"speaker":"Fr Stephen De Young","text":"And we're told that the reason Samuel didn't know Yahweh, the God of Israel yet, is that he hadn't revealed himself to him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4562.4,"end":4562.88,"speaker":"Scott","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4563.44,"end":4577.88,"speaker":"Fr Stephen De Young","text":"And then there's this whole episode where he calls out to him at night, and Samuel keeps thinking it's Eli the priest calling him. So he keeps running over and being like, hey, what do you want? Eli's like, I didn't call you. Go back to bed, kid."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4578.12,"end":4579.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4579.8,"end":4605.74,"speaker":"Fr Stephen De Young","text":"And this happens like three times. And then finally Eli says, well, hey, maybe it's the Lord. Right. So next time just ask him what he wants. And so that's when we get this, that. That the word of Yahweh comes and stands next to his bed and calls out to him the way he had the other time. So this isn't, again, a disembodied voice."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4605.9,"end":4656.45,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. And then another one. And this is very not disembodied. This is quite embodied. Jeremiah, chapter 1, verses 4 through 9. The word of Yahweh came to me. And here we go. Yahweh stretched out his hand and touched my mouth. Yeah. Stretched out his hand and touched his mouth. You know, making him a prophet. Right. Giving him the words to say. But again, he touches him. It's not a metaphor. Like, it's an actual experience that he's having. And then another one. This is probably one of the most famous. And let's explicate this one a little bit. That encounter at the Oak of Mamre. Right. Where Yahweh comes to Abraham and shows up. As you know, there's three men that show up and talk to Abraham. So what's going on there? Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4656.45,"end":4658.61,"speaker":"Fr Stephen De Young","text":"One is identified as Yahweh."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4658.61,"end":4659.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. One of the men."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4660.05,"end":4661.49,"speaker":"Fr Stephen De Young","text":"The other two are angels."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4661.57,"end":4662.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4663.01,"end":4684.26,"speaker":"Fr Stephen De Young","text":"And because we read the Bible in bits and pieces, in individual stories, we don't necessarily get this connection that this encounter at the Oak of Mamre, the hospitality of Abraham, happens immediately before the whole episode surrounding Sodom and Gomorrah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4684.26,"end":4686.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. So the angels go down. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4687.34,"end":4701.68,"speaker":"Fr Stephen De Young","text":"Right. So Yahweh these two angels come, and Abraham has Sarah go and make them a bunch of food, and they lay out a spread, and they sit and eat and converse."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4702,"end":4702.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4703.12,"end":4718.4,"speaker":"Fr Stephen De Young","text":"And then we're told that Yahweh sends the two angels down to Sodom to get Lot, and he stays and talks to Abraham. So again, this is not a disembodied voice."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4719.6,"end":4722.88,"speaker":"Fr Andrew Stephen Damick","text":"There's someone staying there to talk to him. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4722.88,"end":4737.13,"speaker":"Fr Stephen De Young","text":"And conversing with. With Abraham. And then as that unfolds, we get these two episodes, and you can. And you can read these. The first one where Yahweh talks to Yahweh."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4738.09,"end":4744.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yep. Yeah. Yeah. And then."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4746.41,"end":4770.18,"speaker":"Fr Stephen De Young","text":"Where he says, we're told that Yahweh said, shall I hide from Abraham what I am about to do, seeing that Abraham shall surely become a great and mighty nation, and all of the nations of the earth shall be blessed in him, for I have chosen him that he may command his children and his household after him to keep the way of Yahweh by doing righteousness and justice so that Yahweh may bring to Abraham what he has promised him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4770.74,"end":4773.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. So which Abraham overhears."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4774.18,"end":4782.13,"speaker":"Fr Stephen De Young","text":"Right. So Yahweh is standing there talking to him, and then Yahweh talks to Yahweh. Right, right. About him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4782.21,"end":4782.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4784.61,"end":4806.62,"speaker":"Fr Stephen De Young","text":"And then even more tellingly, once Lot is safely out of the way, that's in Genesis 18, verses 17 through 19. Then in chapter 19, verse 24, after Lot is safely out of the city, we're told, then Yahweh rained down fire on Sodom and Gomorrah from Yahweh from heaven."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4806.7,"end":4807.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4808.14,"end":4813.82,"speaker":"Fr Stephen De Young","text":"So Yahweh, who's still standing on Earth, calls down fire from Yahweh in heaven."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4813.82,"end":4844.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which underlines, by the way. I mean, we haven't spent a lot of time on this, but underlines, by the way, that the idea that God is a single Unitarian, Monotheistic God is not a thing. It's not a thing in the Old Testament. Because here you've got Yahweh talking to Yahweh, Yahweh calling down fire from Yahweh in heaven. Like, clearly, at least there's two. At the very least, there's two. Right. You know?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4845.27,"end":4847.91,"speaker":"Fr Stephen De Young","text":"Yeah, Right, right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4847.99,"end":4849.99,"speaker":"Fr Andrew Stephen Damick","text":"And then. Okay, and then. Yeah, go ahead, go ahead."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4850.63,"end":4859.27,"speaker":"Fr Stephen De Young","text":"Well, I was just that guy who gets pointed out very clearly in. Over the course of a few verses in Exodus, which I think you were about to read."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4859.27,"end":4887.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. So Exodus, chapter 33. You know, Moses speaks to God face to face as a man speaks to his friend. I love that. And then later, God says, no one can see my face and live. I mean, so like, well, which is it God, you know, can you speak to Moses face to face or can you not see your face? Obviously there is the face of God that Moses is talking to, and then there is another person whose face that no one can see and live."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4888.88,"end":4893.04,"speaker":"Fr Stephen De Young","text":"Right. And these are when you say later, this is 12 verses later."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4893.12,"end":4896.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. It's in the same passage. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4896.64,"end":4902.56,"speaker":"Fr Stephen De Young","text":"12 verses later. Yeah. You've been talking to me face to face. You can't see my face and live."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4902.88,"end":4903.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4904.24,"end":4924.85,"speaker":"Fr Stephen De Young","text":"Over the course of those few verses. So. And as you said, there's 100 or more examples we could give in various parts of just the Old Testament. And this kind of gets summed up by St. John at the end of the prologue to his Gospel."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4924.85,"end":4925.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4926.53,"end":4964.33,"speaker":"Fr Stephen De Young","text":"Where John 1:18, he says, no one has seen God at any time, but the unique God who is in the bosom of the Father has made him known. And when St. John says that, he's not like retconning the Old Testament. Right. He's not saying, oh, hey, you know all that stuff you read where you thought that was God appearing to people or they saw God, that never happened. Right. That's not what he's saying. He's saying the opposite. He's saying the person that they saw, the person who they saw is the Logos who I've been talking about in this prologue."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4964.33,"end":4968.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes. In the beginning, the Logos and the Logos was God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4968.95,"end":4990.31,"speaker":"Fr Stephen De Young","text":"That second Yahweh, the one who was standing there talking to Abraham, the one who Moses talked to face to face, the one who touched Jeremiah, the one who stood next to Samuel. That's the word of Yahweh, as it said in Samuel and in Genesis, that's the Logos."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":4990.39,"end":5004.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we actually have a very relevant question specifically about this. So Scott is calling from Alabama. Scott, can you hear me?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5005.96,"end":5008.12,"speaker":"Scott","text":"I can, Father. Thank you for taking my call."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5008.36,"end":5013.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. So, Scott, you have a question that's pretty much about what we were just talking about. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5015,"end":5023.17,"speaker":"Scott","text":"Well, I was worried you wouldn't take my call because this sort of is the answer, I think, to my question. So longtime listener, first time caller, love the show."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5023.65,"end":5024.21,"speaker":"Fr Andrew Stephen Damick","text":"Yay."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5025.73,"end":5079.32,"speaker":"Scott","text":"The as you were speaking of this and giving the examples from Jeremiah talks about the Word, but then you're talking about Yahweh. You're talking about in previous episodes or maybe in some of your blogs you've talked about, you know, The Lord, I guess Yahweh hiding his face or you can only see my backside, right. As he says to Moses, you said before, this is actually God the Son that people are experiencing directly and having this, this direct relationship with. And so in this, this episode, I really was seeking some clarity on like who. Who are we interacting with? We, we mutually in the Old Testament, as we read. Who are we interacting with? And putting ourselves in the mind of. Are we interacting with God the Father? Are we interacting with God the Son? I've never heard God the Son referred to as Yahweh."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5081.08,"end":5082.36,"speaker":"Greg","text":"Your wife would like you to know."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5082.44,"end":5086.6,"speaker":"Alex","text":"Your wife would like to also talk about the Holy Spirit as you talk about the body."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5087.16,"end":5087.88,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5089.16,"end":5090.6,"speaker":"Scott","text":"It's a family affair here."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5090.68,"end":5099.16,"speaker":"Fr Andrew Stephen Damick","text":"Leave nothing out. Hey, everybody. It's like the old time people gathered around their radio. This is great."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5099.48,"end":5103.8,"speaker":"Scott","text":"We are absolutely, absolutely. You should see the kids. They're actually bored. But that's okay."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5105.24,"end":5107.8,"speaker":"Fr Andrew Stephen Damick","text":"You'll understand this later, kids, and you're going to love it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5108.44,"end":5109.8,"speaker":"Fr Stephen De Young","text":"Yeah, maybe."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5109.8,"end":5111.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, maybe not."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5111.52,"end":5116.04,"speaker":"Fr Stephen De Young","text":"When you're teenagers. When you're teenagers, you roll your eyes, but then you'll get older again and then you'll dig."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5116.52,"end":5125.48,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. Yeah. Go ahead, Father, tackle this massive, try to logical question that he's got here."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5126.05,"end":5126.37,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5126.61,"end":5168.37,"speaker":"Fr Stephen De Young","text":"And manage not to get. Let's just add some more heresies people can accuse me of. So, yeah, we're talking about, we're talking about as you mentioned, you know, as we were already saying, that this is God the Son, this is the Logos, who we see in the Old Testament. So Yahweh is treated by the church not as a personal name, but as a title. And here's what that means. Yahweh is not the name of one of the three persons of the Trinity."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5168.53,"end":5168.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5169.57,"end":5206.97,"speaker":"Fr Stephen De Young","text":"It's not the personal name of the Father or the personal name of the Son, or the personal name of the Spirit, Yahweh. I don't know how before I want to go down this rabbit tail getting granular with Hebrew grammar, but the word Yahweh is a form of the verb to be. That in Hebrew, it's in what's called the hyphel binyan, which means basically that it's causative. So it literally means the one who causes things to be. He who causes things to be, or the Creator. That we're not the Creator. Yeah, the idea of creation, that things are not, and then he causes them to be to exist."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5208,"end":5208.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5208.96,"end":5245.31,"speaker":"Fr Stephen De Young","text":"And this is important in understanding a lot of places, especially in the prophets in the Old Testament, where he will say, then you will know that I am Yahweh. Right. And it's like, well, they've known your name for a while. Right, right. But what he's saying is, for example, Israel will be destroyed and be bones in a valley. But when I breathe new life into those bones and bring them back to life, then you will know that I am Yahweh. Then you will know that I am the one who causes things to be."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5245.31,"end":5246.83,"speaker":"Fr Andrew Stephen Damick","text":"Because only he could do that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5246.91,"end":5305.21,"speaker":"Fr Stephen De Young","text":"Right, right. And so what that means is this is Saint Dionysus the Areopagite tells us that the titles of God are the names of God are his energies. This is one of the powers, obviously, as the creator that is possessed by all three persons. So we could talk about Yahweh the Father, Yahweh the Son, Yahweh the Spirit or the Spirit of Yahweh, the word of Yahweh and Yahweh. That's a perfectly appropriate way of speaking. And we actually say it's hidden in our English translations, some of which are extraordinarily bad. But at the end of every vesper service, in the dismissal, we say the name Yahweh and identify Christ as Yahweh. It depends on how it's translated. We're both Antiochian, so most of our texts have Christ our God, the existing one."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5305.21,"end":5319.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in Greek it's Hohn, which is the Greek translation of, well, sort of Yahweh. Right. But I've also heard it as Christ our God, he who is. But it's really he who."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5320.11,"end":5368.82,"speaker":"Fr Stephen De Young","text":"He who is Christ our God sometimes, which really confuses it. Right. But we're saying that name and we're saying that's who Christ is. We're saying Christ is Yahweh in that blessing at the end of every vesper service. So that's that question. But in terms of. And this is a good clarification too, in terms of the Spirit and the Father with bodies, we're not saying that Christ has a body in this ancient sense. And the Father and the Spirit don't. Right. We're not saying the Father and the Spirit don't interact with the creation. Right. God the Father is not the God of the philosophers. And then we've got Christ as an intermediary. They all do."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5369.94,"end":5382.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, in Genesis. Right. In Genesis you've got, for instance, the Spirit of God hovering over the face of the water. That's a very, you know, that's movement. Right. That's a bodily action. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5382.37,"end":5424.54,"speaker":"Fr Stephen De Young","text":"And one of the things that unites the three persons of the Holy Trinity is that they have one energy. Right. So that they're united in these things. So. And we'll be talking more particularly next time about the Incarnation and the way in which Christ obviously, because he also has human nature and a human body, how that then is different than the other two persons. But it's not a case that Christ interacts with the creation and the other two persons don't, or that they only do it through Christ, because we clearly see that's not the case in the Scriptures."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5426.11,"end":5430.83,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense? Scott and Mrs. Scott. Sorry."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5432.11,"end":5433.95,"speaker":"Scott","text":"Scott and Megan. Yeah, thank you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5433.95,"end":5434.59,"speaker":"Fr Andrew Stephen Damick","text":"Scott and Megan."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5434.59,"end":5435.07,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5436.03,"end":5436.55,"speaker":"Fr Stephen De Young","text":"It does."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5436.55,"end":5472.02,"speaker":"Scott","text":"It helps. And I guess I hope to hear more clarity on this because God the Father, in my teaching, what I've been taught has always been the originate Creator. And maybe incorrectly, I've been taught that he creates and he sends his energy into the world through Christ and through the Holy Spirit, as is, you know, metaphorically two arms. So any further correction on that, I would love to hear in now and future episodes. Thank you."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5472.74,"end":5485.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, like Father said, they have one energy, so. So it's not like God the Father operates independently of the Son and Spirit, you know, or sort of uses them, you know."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5485.55,"end":5494.35,"speaker":"Fr Stephen De Young","text":"Right. And that language is the through language from and through and to and. Yeah, and we'll get into that at a future date."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5494.35,"end":5494.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5495.31,"end":5502.5,"speaker":"Fr Stephen De Young","text":"Because that's going to be a topic in and of itself. The way St. Paul uses those prepositions, that gets granular. But we will get to that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5502.5,"end":5570.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, thank you very much, Scott and Megan for calling in from Alabama. Great to hear from you. All right, let's move forward now, and we're going to try to wrap this up with some of my favorite stuff. Yeah. We're going to talk about a little bit about paganism and also about worship in particular, and how a lot of this kind of plays out there as well. Right. So we've already established that St. John in John chapter one is not talking about multiple gods. He's talking about the one God, Yahweh, you know, Yahweh the Father and Yahweh the Son. Right. That's what's going on there in the prologue. Right. So how then, how is this different from the way. And we kind of touched on this a little bit when. When I think it was Greg called in talking about giants. But how then is this different from the way that pagans Interacted with their gods. What kind of bodies do their gods have? Right. Like, how does that work?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5571.54,"end":5572.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5572.42,"end":5573.54,"speaker":"Fr Stephen De Young","text":"Just to take a little bit of."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5573.54,"end":5585.57,"speaker":"Fr Stephen De Young","text":"The heat and hate mail off myself. Father Andrew did just say that pagan worship is his favorite thing. One of my favorite topics. One of my favorite topics."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5585.57,"end":5586.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5586.13,"end":5586.61,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5589.33,"end":5598.93,"speaker":"Fr Andrew Stephen Damick","text":"Well, I am. Yeah, I am suspicious now because I am taking a. I have just started a master of arts program in language and literature, which I'm particularly looking at ancient pagan myths."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5598.93,"end":5600.61,"speaker":"Fr Stephen De Young","text":"So there we are. So who knows?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5600.61,"end":5601.41,"speaker":"Fr Andrew Stephen Damick","text":"Who knows what I'm."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5605.09,"end":5631.35,"speaker":"Fr Stephen De Young","text":"So, yeah. So when we're talking about pagan gods, ancient pagans believed that any given God had a whole bunch of bodies. And you can come at this from a couple ways. One of them is really granular. And I'm not going to get into right now maybe in a blog post at some point. And that's types of bodies that they believed their gods had."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5631.35,"end":5632.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5632.39,"end":5640.64,"speaker":"Fr Stephen De Young","text":"But for now, we're talking about multiplicity in terms of one God having a whole bunch of bodies."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5640.8,"end":5645.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is totally a thing in the ancient world, people."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5645.92,"end":5667.12,"speaker":"Fr Stephen De Young","text":"Right, Totally a thing. This happens primarily through what we call idolatry. This is an important part of how idolatry worked as a way of localizing a God. Right. But one God could be localized in a whole bunch of different places at the same time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5667.2,"end":5668.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5669.28,"end":5679.28,"speaker":"Fr Stephen De Young","text":"And so as an example, one of the examples I use is you look at Re in Egypt, the sun God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5679.28,"end":5689.09,"speaker":"Fr Andrew Stephen Damick","text":"Whom you know, is called Ra in most English sources. But I did look this up, and it is Ray or Re. I've seen it. I've seen it. Apparently in some languages it's re as well, which is interesting."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5689.49,"end":5692.29,"speaker":"Fr Stephen De Young","text":"It's re with like an umlaut over it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5692.45,"end":5695.49,"speaker":"Fr Andrew Stephen Damick","text":"So I do love a good umlaut."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5696.05,"end":5729.02,"speaker":"Fr Stephen De Young","text":"Yeah. So in fact, it's probably not an umlaut when it's over in E. But anyway, we digress. So for the Egyptians, the sun in the sky. Right. Like the actual solar disk in the sky is one of Ray's bodies. But at some periods of Egyptian history, in some sense, the pharaoh is Re on Earth."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5729.74,"end":5730.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5730.38,"end":5740.62,"speaker":"Fr Stephen De Young","text":"And at the same time, they've got temples to Re in different places that have statues that are bodies of re."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5741.18,"end":5741.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5743.02,"end":5765.9,"speaker":"Fr Stephen De Young","text":"And sometimes these will get the names of a particular place. This is why it's referred to as localization, sort of attached to them. And they'll look at it a little different. But when someone went to communicate with or commune with or worship or sacrifice to Re in a particular temple, the sun didn't disappear out of the sky. Pharaoh didn't cease to exist."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5767.33,"end":5767.57,"speaker":"Fr Stephen De Young","text":"Like."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5770.13,"end":5774.85,"speaker":"Fr Stephen De Young","text":"It wasn't that Ray was running around. It's sort of like, oh, man, I got to get over to Thebes fast."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5775.17,"end":5775.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5776.93,"end":5806.94,"speaker":"Fr Stephen De Young","text":"So I've got to sacrifice at 12. That's not how they viewed it. They viewed it as having multiple bites. Because, again, bodies, it's not talking about the physicality. It's talking about these points of communication, communion, interaction with the world and with people. And so there's tons of them. And because it's the peculiar form, as we've talked about before on the show, that idolatry takes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5807.34,"end":5807.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5807.7,"end":5824.94,"speaker":"Fr Stephen De Young","text":"This is human initiative going and creating a body for the God so that the human can interact with the God and communicate with the God and get the God to do what they want in that particular place, to sort of draw them down."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5825.18,"end":5825.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5825.66,"end":5827.58,"speaker":"Fr Stephen De Young","text":"And trap the God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5828.22,"end":5829.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a God trap."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5832.7,"end":5835.58,"speaker":"Fr Stephen De Young","text":"Put them in that. It's a death trap, a suicide rap."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5835.58,"end":5835.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5836.14,"end":5861.4,"speaker":"Fr Stephen De Young","text":"You put them in the statue. And now they're localized. So as we talked about, also, when you come to the Torah and the Torah forbids idolatry, it's aimed at forbidding, not just making a statue. This is how many of our Protestant friends interpret it, is that idolatry is just making a picture. Right. Or making a statue."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5861.56,"end":5864.68,"speaker":"Fr Andrew Stephen Damick","text":"No, no. It's using the image in a particular way."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5864.92,"end":5866.28,"speaker":"Fr Stephen De Young","text":"In a particular way to try to."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5866.28,"end":5869.24,"speaker":"Fr Andrew Stephen Damick","text":"Trap and provide a body for your God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5869.8,"end":5877.5,"speaker":"Fr Stephen De Young","text":"Right. And manipulate the God and exert power and control over the spirit that you're. That you're worshiping."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5877.58,"end":5877.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5878.3,"end":5890.26,"speaker":"Fr Stephen De Young","text":"And so what we see. That's why what we see in response in the Torah is not just, hey, don't make statues, except for the few I tell you to make on the Ark of the Covenant and that kind of thing. But other than that, don't make any."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5890.26,"end":5892.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. By the way. Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5893.34,"end":5948.02,"speaker":"Fr Stephen De Young","text":"It's not that. It's. It's. What it's coupled with is you're only going to come and worship Yahweh in one place. That's going to be the tabernacle and then the temple. There's just going to be this one place where you come to interact with Yahweh, to commune with Yahweh, to hear from him, and it's going to be the place. It's referred to all through the Torah as the place I will choose that God is going to choose that place. Actually. First it's the top of Mount Sinai, then it's the tabernacle, but it's the place where God chooses to come and be present. That's the place where God's body is. Is the place where he chooses to come and make himself present. And that's the place where all of the Israelites have to come to hear from him, to communicate with him, to interact with him, to sacrifice to him, to worship Him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":5948.02,"end":6012.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if you think about that just even in a psychological way, like, there is a difference between if you can summon someone to you versus you have to go to them. Right. And idolatry is really about. Because you could set up your idolatrous temple anywhere you like. And the point is, you're summoning the God to you, but God, Yahweh is saying, no, no, no, no, no. I've picked a place. You come to me. Right. And this helps to underline what kind of God he is. He's not like. And I mean, this is one of our frequent themes. Who among the gods is like unto thee, O Lord? Right answer. None. And the fact that one place is chosen by him and it's only one place such that it becomes a kind of polemic later against the Samaritans, like, you guys are worshiping on the wrong mountain. This is so important because it underlines the who God is that you have to go to him. Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6012.59,"end":6022.71,"speaker":"Fr Stephen De Young","text":"And this is why there was so much opprobrium towards the Samaritans, because of that. It wasn't just like, oh, hey, you guys are worshiping in the wrong place. You're digging in the wrong place."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6023.59,"end":6025.59,"speaker":"Fr Andrew Stephen Damick","text":"You guys are idolaters. Look what you're doing."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6026.15,"end":6035.82,"speaker":"Fr Stephen De Young","text":"Right. That was idolatrous. That was heretical. To go and build a temple there on Mount Gerizim. Yeah. And worship there."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6035.9,"end":6036.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6036.86,"end":6037.26,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6038.54,"end":6054.42,"speaker":"Fr Stephen De Young","text":"And we see this connection between the body of God and the temple in a bunch of places. One of the primary ones, or at least one of the ones that I think of as primary because I wrote my dissertation about the Day of Atonement. Is the Day of Atonement."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6054.42,"end":6054.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6056.22,"end":6112.87,"speaker":"Fr Stephen De Young","text":"Because part of it that gets left out when we talk about the Day of Atonement in our modern Christian world, we're almost always talking about the goats because everybody wants to argue about atonement theories. And so it's what's going on with the goats. We miss sort of other key elements of the ritual, a main one of which was the high priest. This was the one day a year when he would go into the holy of Holies where the Ark of the Covenant was. Before he did that, he would have to make a bunch of sacrifices for his own sins, then he could enter. And as he entered, he was required to offer this huge amount of incense to make this cloud of incense. And the purpose of the cloud was to cover. And there's kind of a wordplay there, because the word for cover is the same word as the word for atonement."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6113.27,"end":6113.59,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6114.07,"end":6126.15,"speaker":"Fr Stephen De Young","text":"To cover the fact that Yahweh appeared there on that day. And so if that smoke wasn't there to cover it, he would see Yahweh and die."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6126.31,"end":6126.87,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6127.99,"end":6162.03,"speaker":"Fr Stephen De Young","text":"And so he did that. He had to offer the incense so that he wouldn't see directly Yahweh when he appeared. And then he would come in with the blood of the goat that was for Yahweh, and use it to purify the Ark of the Covenant and its cover so that. And then the rest of the tabernacle and later temple, so that God could continue to live in the midst of his people for another year without consuming them in fire because of their sins."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6163.23,"end":6175.22,"speaker":"Fr Andrew Stephen Damick","text":"And as I recall, the reason why this is done is because this is the day that God has chosen to make himself known. It's not because doing this ritual makes God show up, right?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6175.22,"end":6181.7,"speaker":"Fr Stephen De Young","text":"No, you're not doing the ritual to make God appear, because you can't do that."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6181.7,"end":6183.34,"speaker":"Fr Andrew Stephen Damick","text":"He's not that kind of God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6184.3,"end":6188.54,"speaker":"Fr Stephen De Young","text":"That's the day when God is going to appear in the temple."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6188.7,"end":6189.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6189.42,"end":6195.37,"speaker":"Fr Stephen De Young","text":"He's going to appear in the Holy of Holies. And so you have to do the ritual to make that safe."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6196.01,"end":6250.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And of course, there's an interesting sort of modern analog to that. It's not identical, but as an analog, which is that we have the miracle of the holy fire that appears in the Church of the Holy Sepulchre on Holy Saturday. Again, it's not that we've called him down. It's that this is the day. This is the appropriate day when, you know. And it's funny, like, there's even that historical instance where the holy fire appeared. Even though the services were not allowed to be done at some point in history, you know, it still appeared and cracked one of the pillars nearby, which I gather you can go see. I've never seen it, but I've talked to people who have. Yet God himself still chooses to appear. Now, why don't they have to do a massive, gigantic cloud of incense? Although I'm sure probably they do have some incense, you know, in order to. So. So people don't see that happening. It's okay to see it happening. People see it happening."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6251.72,"end":6264,"speaker":"Fr Stephen De Young","text":"Right. And that's because Christ's atonement has now purified the world. He's done the covering and this is, you know, see the whole book of Hebrews."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6264,"end":6264.36,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6264.6,"end":6265.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6265.88,"end":6287.02,"speaker":"Fr Stephen De Young","text":"That's a lot of what Hebrews is getting at. So it's now safe to. To approach God. And you see this similar idea of God's body enthroned in the temple in the visions, the vision that Isaiah has when he's called to be a prophet, where he sees him enthroned with the altar as his footstool."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6287.02,"end":6289.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Here am I, Lord, send me. I love that bit."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6290.82,"end":6336.24,"speaker":"Fr Stephen De Young","text":"And then Ezekiel sees a very similar thing, but then he sees God Yahweh at his chariot, throne in the temple. But then before the temple is destroyed, he leaves. Right. That's what Ezekiel sees. And so when he leaves, the temple is destroyed. And we'll probably get into this a little more in the next episode. But as a semitease, the reason why we don't have just one place where we worship now is that any place where God's body is, say, in a tabernacle, say on an altar, becomes a temple."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6336.8,"end":6577.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Wow. Cool. Very cool. Yeah. Christ becomes the new temple. And, you know. Yeah. And, you know, and as the kind of the final teaser. Right. That I think would be helpful for next time in two weeks, is so if the Son of God has a bodily existence apart from the incarnation, and then he also has a bodily existence by virtue of being human, does that mean that Christ has two bodies? Tune in next time, we'll talk about that. But yeah, so before we close, having gone through this bind, bending experience now twice for me, I wanted to just give some of my own impressions about this and then, Father Stephen, you can close us out. Yeah. I think one of the big takeaways, for me, I mean, there's two big takeaways. The first is the stuff we've just been talking about, which is how the. The truth that God has bodily existence, that he interacts with the world, that he has a nexus of potentialities, powers, however you want to put it, that that is what. Where he is, whom we're interacting with in worship. Like, if he really was the God of the philosophers, then he wouldn't be available. Like, he wouldn't show up, he wouldn't reveal himself. He wouldn't do that. Right. And then connected to that, then my other big takeaway is how important it is that we understand the biblical language about God's bodily existence. Because if we don't Then we're not worshiping the God of Abraham, Isaac and Jacob. We don't have a God who loves us. We don't have a God who cared enough to create us. Right. The God of the philosophers had to have not even an emissary, if he's even aware of him. Right? But this kind of, you know, this demiurge, this intermediary, right? And a number of heretics, over time, they accept that model and they identify Christ as being that intermediary, you know, but he's not. He's not some lesser creator being that the unmoved mover, you know, is only kind of tangentially connected to or whatever, you know. This is the God who loves us. This is the God who reaches out to us. This is the God who touches the mouth of Jeremiah, you know. This is the God who stands next to Samuel's bed. Right. We don't have to be embarrassed by that language. It's in scripture and it means something. It may not mean exactly the same thing when I stand next to a bed, but that doesn't mean it didn't happen or that it's just some kind of metaphor. It's not. Again, the scripture never says, you know, and Yahweh became present in a manner like unto a man stands next to a bed. It doesn't even say that, just that he stood next to the bed or that he ate. I mean, how bodily can you get? How much more bodily can you get? He ate with Abraham. Right. And you know, our February episodes are going to be all about sacrifice and worship, everybody. So hold onto your hats for those. That's going to be really cool. But I mean, it's just. I don't know. It's astonishing. I know I use that word a lot on this show, but it just really is astonishing. And it's okay to take this stuff seriously and not think that we're anthropomorphizing God. We're not. Again, remember, like we said at the beginning, it's the opposite. We are theomorphized. We are like God. We're much smaller, lesser corrupted, limited imitations, but we are like God. He's not like us. We're like Him. Right. We have to keep that in the right order. So those are my big takeaways from this conversation, Father."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6578.33,"end":6587.93,"speaker":"Fr Stephen De Young","text":"Yeah. So there's a place in the scriptures where St. Paul talked to a bunch of those philosophers we were talking about, about their God."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6588.09,"end":6589.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the areopagus."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6589.93,"end":6600.02,"speaker":"Fr Stephen De Young","text":"Yeah. I think you're vaguely familiar with that. Yes, I'm a fan of one of my favorite things. And when he speaks to them."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6601.94,"end":6602.34,"speaker":"Alex","text":"He."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6602.74,"end":6670.39,"speaker":"Fr Stephen De Young","text":"Certainly repeatedly condemns idolatry. But he also speaks to this philosophical notion of God, that he's remote, that the Most high God has distanced himself and is now sort of gone. And maybe we can content ourselves as much as we need with these idols and these lesser spiritual beings. But what St. Paul says to them in response to what they believe is that when God created all people and the most high God, Yahweh, the God of Israel, created the whole world. And he assigned to people their allotted places and times. That he did this. Not well, first, that he did it, but also that he did this not to push them away, not because they were lesser than him. And he didn't think about them or couldn't think about them or didn't care about them. Exactly the obvious. He did this, St. Paul said so that they should seek God and perhaps feel their way toward him and find Him."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6670.55,"end":6671.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6671.51,"end":6696.63,"speaker":"Fr Stephen De Young","text":"That he is actually not far from each one of us. For in him we live and move and have our being. So he's telling them this is a part of the Gospel, especially for these philosophers and how they're used to thinking about God, that God not only knows you exist."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6697.57,"end":6697.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6697.97,"end":6733.24,"speaker":"Fr Stephen De Young","text":"But he cares about you. He wants you to seek him and he wants you to find Him. He's here with you. He's around you. He's how you're taking your last breath and your next breath. He's the One who's giving you life and not only brought you into being, but is maintaining your being. And it's very easy for us in our sort of modern materialistic mindset, as we already talked about, to fall into this kind of accidental agnosticism where we don't doubt that God exists, but he's off somewhere, at least most of the time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6733.48,"end":6734.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6735,"end":6810.56,"speaker":"Fr Stephen De Young","text":"And he's not here with us. He's not close to us. He doesn't care. At least he doesn't care about the little stuff, maybe about the big stuff, maybe politics or something. He's involved, but not with me in my life and the things I'm worried about and paying my bills and all of these things. And the truth is that the God who created the universe is the opposite of that. We're told by the scriptures over and over again that God has done all these things for us out of his love. He created us out of his love. He created the cosmos out of his love. And he's done all of it so that we would seek after him and find Him. We're told that if we seek him with our whole heart, we will find him and so that he can share his life, which is an eternal life, with us in his kingdom that has no end. And so this is something that should it's not just I know on our episode we talked about the saints. I talked about how we're never alone in terms of having the saints and the angels around us and worshiping with us. God's here too. Christ is here with us too. The Holy Spirit is living within us and it's not far off somewhere."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6813.12,"end":6813.76,"speaker":"Scott","text":"Amen."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6814.48,"end":6840.81,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for today. Thank you very much for listening everybody. If you didn't get a chance to call in during the live broadcast, we would love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We read everything, but we can't respond to everything. And we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6842.17,"end":6852.09,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. If you're on Facebook, unlike me, like our Facebook page and join our Facebook."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6852.09,"end":6858.33,"speaker":"Fr Andrew Stephen Damick","text":"Discussion group, Leave reviews and ratings, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6859.21,"end":6866.82,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6867.06,"end":6871.3,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you always. We'll see you next time."}
{"episode_id":"LOS - #011 - 2021-01-15 - God's Body","start":6872.58,"end":6909.79,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard, heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
