{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":0.64,"end":65.27,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":67.11,"end":111.5,"speaker":"Fr Andrew Stephen Damick","text":"The show was impressive in scope, but easier to marvel at than to immerse yourself in. The staging was static and pacing strange, the long impressionistic streaks in the first half clumsily offset by the frantically plot heavy ending. The musical portions, as in all of West's religious projects, were competent and occasionally excellent. He uses music from his own catalog, judiciously bringing say youy Will and its orchestral coda in and out as a recurring motif, and finally, fixing wolves. And that was from Rolling Stone's review of Kanye West's 2019 musical opera Nebuchadnezzar, which I have to thank you for letting me even know that that exists."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":112.06,"end":116.86,"speaker":"Fr Stephen De Young","text":"I. I wish that that was our lead in instead of the other guy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":119.02,"end":120.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Should we fire the voice of Steve."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":120.94,"end":124.86,"speaker":"Fr Stephen De Young","text":"Who they're putting out there just to spite me, like they're putting him on?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":124.94,"end":125.86,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that. That guy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":125.86,"end":131.26,"speaker":"Fr Stephen De Young","text":"The guy that was before me. No matter how much I complain or how much shade I throw, they just keep doing it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":131.34,"end":133.9,"speaker":"Fr Andrew Stephen Damick","text":"I know they did it last time, too, as I recall."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":133.9,"end":138.44,"speaker":"Fr Stephen De Young","text":"That's what I'm saying. There's a pattern here."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":138.68,"end":139.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":139.56,"end":144.04,"speaker":"Fr Stephen De Young","text":"A pattern of abuse, ancient faith. I won't put up with this forever."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":145.08,"end":154.12,"speaker":"Fr Andrew Stephen Damick","text":"Well, since you say that, I'm Father Edrew Stephen Damick, and you are Father Stephen DeYoung. I'm sure you know that. I'm sure your wife tells you that most days."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":154.36,"end":156.64,"speaker":"Fr Stephen De Young","text":"And beginning."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":156.64,"end":171.46,"speaker":"Fr Andrew Stephen Damick","text":"We're beginning our sixth year of the Lord of Spirits podcast. And what a lot of people may not know is that there was a secret pact made between you and me. Is this not so? A secret pact which, sealed in only."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":171.46,"end":173.22,"speaker":"Fr Stephen De Young","text":"Now, is being revealed on First Contact."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":173.22,"end":190.82,"speaker":"Fr Andrew Stephen Damick","text":"Day, which is that you promised to do five years at least of the Lord of Spirits podcast. So that means from now on, since last time was our fifth anniversary episode, we're all on borrowed time. So you're on borrowed time, all you favorite giant killers and dragon slayers."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":190.98,"end":193.46,"speaker":"Fr Stephen De Young","text":"The show could end next week at the conference."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":193.81,"end":212.33,"speaker":"Fr Andrew Stephen Damick","text":"It could happen right next week. We are live though, and starting in the second half of our show, you can call us at 855-237-2346. And if you make it past the great gatekeeper Mike Merodoc Baladan de Gan with your, as he has requested on."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":212.33,"end":216.61,"speaker":"Fr Stephen De Young","text":"Topic question, that's your cue to not be anywhere near the topic."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":217.57,"end":261.2,"speaker":"Fr Andrew Stephen Damick","text":"We might even talk back. But first, a word from our sponsor. So this episode of the Lord of Spirits podcast is sponsored by the upcoming feature film El Tanto por Cristo. A Texas coastline, a brotherhood of monks inching their way towards sainthood. El Tanto pro Cristo is the first orthodox full length feature film made in America. A cinematic pilgrimage with one night only events in theaters across the country. The National Roadshow begins on October 6th in Dallas, Texas at the historic Texas Theater. From there, the film travels city by city, one night at a time. Executive producer Jonathan Pageau calls it dangerous in the best way. I feel like I should read that, like with a half French accent. Dangerous."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":261.52,"end":262.88,"speaker":"Fr Stephen De Young","text":"Je suis dangerous."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":263.44,"end":294.13,"speaker":"Fr Andrew Stephen Damick","text":"David Lowry. It looks like Tarkovsky by way of Texas. And Frederica Matthews Green calls it phenomenal. Truly a work of art from award winning filmmaker Josh David Jordan and Emmy nominated composer Michael Paraskevas. This tour is underway with new dates being added. So for tickets and showtimes, visit eltantoporcristo.com and if you'd like to bring the film to your own city, you can click the Host tab to learn more. That's el tantoporcristo.com you should probably spell."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":294.13,"end":297.69,"speaker":"Fr Stephen De Young","text":"That because a lot of these gringos don't know that there's not an H in Christo."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":297.69,"end":308.39,"speaker":"Fr Andrew Stephen Damick","text":"It's true. E L T O N T O P O R C R I S T O. I always want to say.com, like whenever I'm saying it in the voice of Homestar Runner."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":308.55,"end":312.63,"speaker":"Fr Stephen De Young","text":"Yes, Elton Topor Cristo. That's the oh no dot com."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":317.51,"end":325.15,"speaker":"Fr Andrew Stephen Damick","text":"So yes. So here we are out in the no man's land. Being in the five year mark, you."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":325.15,"end":326.23,"speaker":"Fr Stephen De Young","text":"And I were two of a kind."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":327.27,"end":330.07,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, I haven't thought about that stuff forever."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":330.69,"end":332.29,"speaker":"Fr Stephen De Young","text":"Going to find our way. Wow."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":333.09,"end":334.85,"speaker":"Fr Andrew Stephen Damick","text":"Sudden attack of nostalgia there."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":335.17,"end":336.77,"speaker":"Fr Stephen De Young","text":"The great Rick Schroeder."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":337.17,"end":346.37,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Silver spoons, man. That was. Was that early 80s. Early 80s we were talking about V earlier today, also early 80s show."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":346.85,"end":362.07,"speaker":"Fr Stephen De Young","text":"But like the, the, the main, like living area in the house on silver spoons, like no lie. Pretty much looks like my living room today. Really? Yes. Stand up arcade. The whole thing. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":362.15,"end":362.71,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":363.51,"end":365.39,"speaker":"Fr Stephen De Young","text":"It wasn't deliberate. Just worked out that way."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":365.39,"end":371.31,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. On their part as time travelers or on your part having this total nostalgia blend."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":371.31,"end":377.75,"speaker":"Fr Stephen De Young","text":"Turns out my dream living room is the dream living room of a 10 year old in 1985. Go figure."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":377.91,"end":381.59,"speaker":"Fr Andrew Stephen Damick","text":"A 10 year old multi millionaire in 1985."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":381.59,"end":382.87,"speaker":"Fr Stephen De Young","text":"Well, things are cheaper now."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":384.94,"end":386.54,"speaker":"Fr Andrew Stephen Damick","text":"Including stand up arcade machines."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":386.54,"end":389.34,"speaker":"Fr Stephen De Young","text":"Yes, yes. Much cheaper. Yeah, yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":389.5,"end":400.82,"speaker":"Fr Andrew Stephen Damick","text":"So we're talking. We're heading back to ancient, ancient Babylon, which I know this is always big with the fans. The fans love it when we do stuff that's at least 3000 years old or at least 2500 years old."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":400.82,"end":402.98,"speaker":"Fr Stephen De Young","text":"I was gonna say a lot of this stuff isn't 3,000 years."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":402.98,"end":406.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Not even quite. But some of it is, as you'll discover."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":406.94,"end":411.42,"speaker":"Fr Stephen De Young","text":"Yes, well, we always have to start a ways back from what we're actually talking about."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":411.42,"end":415.23,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. We keep rewinding. I feel like that's a lyric as well."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":415.71,"end":417.07,"speaker":"Fr Stephen De Young","text":"You've got to trace things."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":417.31,"end":418.75,"speaker":"Fr Andrew Stephen Damick","text":"Be kind, rewind."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":419.47,"end":420.91,"speaker":"Fr Stephen De Young","text":"Nobody knows what that means anymore."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":422.91,"end":427.71,"speaker":"Fr Andrew Stephen Damick","text":"So how about the old Babylon? Like OG Babylon. What was that all about?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":430.43,"end":431.47,"speaker":"Fr Stephen De Young","text":"What's up with that?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":431.71,"end":433.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, what's up with that?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":433.55,"end":441.56,"speaker":"Fr Stephen De Young","text":"Like you're doing a Seinfeld thing. What's the deal with. Well, it was coming up the pre show. It was coming up with pre show."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":441.56,"end":450.12,"speaker":"Fr Andrew Stephen Damick","text":"With Mike and Simon. Yeah, you know, so if that's a show about nothing. This is a show about everything."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":450.28,"end":454.28,"speaker":"Fr Stephen De Young","text":"Why do you keep pushing the elevator button? It doesn't make it come faster, guys."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":454.28,"end":455.08,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":455.48,"end":486.88,"speaker":"Fr Stephen De Young","text":"What makes Seinfeld's comedy so culturally important is the deep resonances. Not just the surface laughter, but the acute social commentary. Anyway. Yes, the city of Babylon. So as you might have gleaned or might not from our references to Kanye West's musical. And we also could have made a bunch of Matrix ship references or veggietales. Yeah, but veggietales is just referring to the Bible."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":487.84,"end":500.77,"speaker":"Fr Andrew Stephen Damick","text":"That's true, but at least there's veggie. There's a whole veggietale episode about Nebuchadnezzar, Nebby K, Nezzer, Rack Shack and Benny. Okay, Very formidable. So it's not me. Veggie Tales is a little too young for me."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":500.77,"end":503.69,"speaker":"Fr Stephen De Young","text":"Yeah, I was gonna say, I don't know, you know, but very formative for."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":503.69,"end":509.45,"speaker":"Fr Andrew Stephen Damick","text":"Our elder millennial audience, you know, or our Oregon Trail generation audience, I think."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":509.45,"end":609.81,"speaker":"Fr Stephen De Young","text":"I think this bit has died of dysentery. But anyway, so the city of Babylon is. Actually begins way before any kind of Babylonian empire, let alone the Neo Babylonian empire, which is where Nebuchadnezzar is located. But as is our want, we're going to start all the way back there. The first things we know about Babylon as a city, really moving from the settlement stage to the city stage, is back in the third millennium BC so think the mid 2000s BC like 25, 2600 BC. And so Babylon, in a lot of ways, when you think about it, pre. Really the original Babylonian empire, it's sort of like Byzantium in the sense that Byzantium was not a very significant city until St. Constantine came along and made it Constantinople. And then all of a sudden it became a very, very significant city. Same is kind of true of Babylon. So it was a relatively insignificant city in Akkad. We've talked about this in various episodes before on the show that Mesopotamia was divided into two sections. A generally southern section, Sumer, and then a northern section, Akkad. And that even though in some ways these two sides are culturally close, like you could talk about Mesopotamian culture in general, there are certainly lots of features that apply to both. You also have a great distinction culturally, specifically, as it regards language."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":610.05,"end":624.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, Sumerian and Akkadian are not. Not remotely related. You know, it's not like Hebrew and Arabic, which are right next to each other. Both Semitic languages, Sumerian, Akkadian are not, I think. Isn't Sumerian a language isolate? And Akkadian is a Semitic language."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":624.73,"end":626.45,"speaker":"Fr Stephen De Young","text":"Sumerian is not related to anything."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":626.93,"end":627.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":627.89,"end":636.05,"speaker":"Fr Stephen De Young","text":"It's just its own thing. And then Acadian is sort of the Ur level pun intended."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":636.69,"end":637.73,"speaker":"Fr Andrew Stephen Damick","text":"I see what you did there."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":637.89,"end":656.69,"speaker":"Fr Stephen De Young","text":"Semitic language, from which other Semitic languages are ultimately derived, sort of in the same way that Sanskrit is for Indo European languages. So. Yeah. The only way those two languages are related is that because Sumerian is older. There are some loan words. There are some Sumerian words."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":657.25,"end":657.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":657.45,"end":775.5,"speaker":"Fr Stephen De Young","text":"That sort of find their way into Acadian or that continue to be used by Acadian speakers. There's not a separate Acadian word for whatever that is. They just use the Sumerian word. But those are actually relatively rare. Almost everything in ancient Mesopotamia had an Akkadian Semitic word or name or title and then a Sumerian equivalent. And within the history of Mesopotamia, the influence of various cities in the region would rise and fall. And sometimes a city or group of cities in Sumer would become kind of dominant. Sometimes a city or cities in a cod would become dominant. And they. They sort of go back and forth. So we talked about, for example, when we talked about Abraham in that episode, we talked about how Abraham was born in Ur during what's called the ur3 period, even though there was no ur2 period. That was a period where the city of Ur in particular and its culture as part of the Sumerian renaissance came to prominence. And Sumer sort of that region became sort of dominant over Akkad a few centuries later. You get to that. We'll talk about more here in a minute. The original Babylonian empire, which was centered around Babylon, which is in Akkad. So that's one such shift that happened. And when we're talking about the third millennium B.C. when we're talking about before the Babylonian empire proper in the second millennium B.C. when we talk about the dominance of Mesopotamian culture or influence or Ur and Sumerian culture, or Akkad and Acadian Semitic culture, we're not talking about an empire like you would have later."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":776.06,"end":781.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's sort of a significant city state with kind of dependent countryside nearby."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":782.3,"end":802.28,"speaker":"Fr Stephen De Young","text":"Right. And certain cultural things. Right. So obviously, you know, the Sumerians invent writing. They invent cuneiform writing. Well, that takes off. Right. Everyone adopts that. So if you want a contemporary equivalent, think of the way American culture, American movies and pop culture stuff sort of shows up everywhere."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":802.76,"end":803.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":803.24,"end":899.01,"speaker":"Fr Stephen De Young","text":"Even in places where the US Military isn't bombing or occupying. There are a few of those, too. But even in the ones where we're not at all, there's still these American cultural things. So that's what we're talking about. Mesopotamian influence in the third millennium B.C. until you get to. That's sort of the genius of the original Babylonian empire is they kind of invent the idea of an empire. They're kind of the first ones to work out the logistics of being able to control a vast swath of territory, because you have to remember what's going on with travel at this point in history on foot and this sort of thing. Just administering anything that large effectively was previously sort of considered impossible until the Babylonians sort of figured that out and cracked that nut. And then, of course, the other major world power during that period was Egypt, which was already ancient by the time that the Babylonian empire starts the second millennium BC And Egyptian culture similarly had great influence, especially around the Mediterranean Basin. Mesopotamian influence was more within the Fertile Crescent, what we would call the Fertile Crescent. So that changes when, at the beginning of the second millennium bc, The Amuru, who we've talked about before, which means Westerner, who are a group of people living in Syria. Also, the original Bible is the Amorites."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":899.01,"end":900.29,"speaker":"Fr Andrew Stephen Damick","text":"The original Old West."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":900.61,"end":992.57,"speaker":"Fr Stephen De Young","text":"Yes. Known as the Amorites in the Bible, come and move east and invade and settle in and make the city of Babylon their heartland and their capital. And these folks have a knack for military strategy, for trade strategy, for logistics, and build the Babylonian empire. And of course, as we mentioned many times on the show, the most famous Amorite, the most famous one of these Amuru is Hammurabi in terms of prominent sort of the Old Babylonian empire of the second millennium BC at its peak. Under Hammurabi, people know about his law code, but there's far more than that. He sets up, literally consolidates a sort of world culture. He establishes the logistics for a world cultural exchange, for world trade, for being able to move military units in a way that wasn't possible before. He. And of course, this is called the Bronze Age because they master the smelting of bronze. And when we talk about the Babylonian empire smelting bronze, as we've mentioned on the show before, they're getting the copper from Cyprus. That's where Cyprus gets its name. And they're getting the tin from what's now Afghanistan."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":993.13,"end":1007.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so this exchange, you know, these trade networks that bring these two substances together essentially are the basis for a lot of the technology of the time. It's like, you know, they're kind of like rare earth metals are for us today in some ways."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1008.01,"end":1028.11,"speaker":"Fr Stephen De Young","text":"Right? Yeah. But that shows you the span from Cyprus to Afghanistan that they were able to utilize resources, you know, natural resources that are that diverse and that far apart. Right. Effectively, Hammurabi really liked the style of leather sandals that they wore in Crete, So he would get them imported to."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1028.11,"end":1030.55,"speaker":"Fr Andrew Stephen Damick","text":"Wear imported Cretan sandals."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1030.71,"end":1072.71,"speaker":"Fr Stephen De Young","text":"Yes. So this shows you just how interconnected the world was under the Babylonians. We tend to think that, you know, we talk about our modern technology. Oh, it's made the world so much smaller. You know, now we can go. But with Bronze Age technology, the Babylonians effectively did that with the known world at the time. And of course, then as we get toward the end of the second millennium bc, it all comes crashing down. You get the Bronze Age collapse. And the Bronze Age collapse is a product of A whole bunch of things. Most folks agree now that one of the core elements of it was climate change."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1073.75,"end":1074.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1074.15,"end":1076.31,"speaker":"Fr Stephen De Young","text":"Because people, even though they didn't have cars."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1077.03,"end":1091.35,"speaker":"Fr Andrew Stephen Damick","text":"Even though they didn't have cars. That's true, yeah. Because like, you know, areas that formerly were fertile were no longer fertile. And so the populations were living off of those now infertile areas moved and they often moved to where there were other people."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1091.83,"end":1092.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1092.19,"end":1095.75,"speaker":"Fr Andrew Stephen Damick","text":"And so that caused people want to."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1095.75,"end":1098.23,"speaker":"Fr Stephen De Young","text":"Survive and so they start fighting for resources. Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1098.23,"end":1099.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1099.59,"end":1159.58,"speaker":"Fr Stephen De Young","text":"You guys, mass migrations. We've talked before about the sea people's invasion that this triggers into Egypt. And so all of this infrastructure, all of these empires, all of these major powers collapse. It's not instant, but it's relatively quick. It's over the course of like a century that things really come, come crashing down. And we've used bronze as an example. But it's a good example for this too. Right. Once all of those trade routes and everything are broken and all of that logistical network is destroyed, it becomes basically impossible to make bronze because you can't bring together the copper and the tin from the other ends of either end of the world. And so during that period, I think we've mentioned this on the show before, and you see this reflected in the Bible. In the early Iron Age, they viewed things made of bronze as if they were like magic."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1160.22,"end":1160.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1160.86,"end":1181.26,"speaker":"Fr Stephen De Young","text":"Like quite literally, that's part of the subtext. When David meets Goliath and they describe Goliath's armor and weapons and they're all made of bronze. Like no one was able to even make bronze anymore. We found like in Philistine temples, we found like really dumb things made out of bronze, like chariot hitches and stuff."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1181.76,"end":1182.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1182.08,"end":1188.48,"speaker":"Fr Stephen De Young","text":"That are just like pegs, just bronze metal pegs. Found them in like the most holy part of the temple as like an artifact."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1188.88,"end":1189.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1190.08,"end":1270.31,"speaker":"Fr Stephen De Young","text":"Because that stuff all just becomes impossible. It's not called the Iron Age because iron was an improvement in technology. Iron is not an improvement over bronze really. It's much more brittle. When you get to steel, you're doing okay. But just iron itself, it rusts, you know, corrodes very easily. And so the early Iron Age, there, there is no real world empire. Egypt survives, but it survives basically because it repels like the sea peoples who settle on their border. So Egypt is kind of hemmed in. They're not able to exert power and control beyond Egypt. So the world of like Saul and David, as we've said before, is sort of a post apocalyptic world in a Sense. Right. They're living in the ruins of a civilization that has collapsed. So that includes the Babylonian empire. And Babylon is still a city, right? It's still there, but declines in prominence steeply. Elements of the city, like literal buildings and things, start to fall into disrepair. Babylon, as always, in general decline. So the next real empire that shows up on the scene is the Assyrians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1270.79,"end":1275.75,"speaker":"Fr Andrew Stephen Damick","text":"I feel like whenever we mention the Assyrians, we should have some kind of boo track, you know, boo."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1277.51,"end":1280.19,"speaker":"Fr Stephen De Young","text":"Some of the Church of the east people might, you know, mishear."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1280.19,"end":1282.55,"speaker":"Fr Andrew Stephen Damick","text":"Wow, okay. Ancient Assyrians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1284.55,"end":1287.19,"speaker":"Fr Stephen De Young","text":"I don't know why they would name themselves after the Assyrians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1287.27,"end":1293.98,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I've been spending a lot of time in Jonah lately, so of course, you know, that's big on the. On the radar there."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1293.98,"end":1342.04,"speaker":"Fr Stephen De Young","text":"Yeah. So the Assyrians, in a couple of ways, are kind of like the Romans later. And here are the couple of ways they resemble the Romans. Number one, brutality. So for the Romans, you can think about them salting the earth in Carthage. You could think of them, you know, crucifying people en masse to make a point. Using crucifixion in general to make a point. Right. Just brutality and cruelty as a tactic. When you read conquest accounts from the Assyrians, they'll talk about, like, after they, you know, destroyed a city, they'd stack all of the men's heads in one pile and the women's heads in another pile and the children's heads in another pile, and then measure how tall the piles were and report that information."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1342.6,"end":1350.82,"speaker":"Fr Andrew Stephen Damick","text":"Or my favorite is when. When their king decided to take the heads off of a number of his nobles and made those heads into a necklace and wore it around."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1351.54,"end":1407.86,"speaker":"Fr Stephen De Young","text":"Yeah, they would. They would skin people alive and hang the skin publicly for the next city to see. So these are the kind of people we're talking about. They make Pol pot look like Mr. Rogers. Right. Like, these are truly brutal folks. The other way in which they're kind of like the Romans is that the Romans kind of appropriated Greek culture. Right. Like you look at, like, the Etruscans. There are distinct, like, cultural elements and stuff there, but it kind of gets overpowered by a lot of Greek cultural elements in. And there's sort of an inferiority complex that I think the Russian, the Romans and the Greeks, it's. I think it's sort of like Americans and British people, like, where we think anybody with a British accent is smart."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1409.06,"end":1410.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes. It's a prestige thing."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1410.54,"end":1428.88,"speaker":"Fr Stephen De Young","text":"You know, there's just sort of this general, like, you know, and it's sort of the same thing with the Romans and the Greeks. Right. The Greeks just seemed really smart, you know, compared to the Romans. So they kind of had a complex. And so they, you know, bad sequels to their stuff, like Virgil did."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1428.88,"end":1449.76,"speaker":"Fr Andrew Stephen Damick","text":"There we go. You know what I love about you making that reference to the Aeneid is that it always gets our friend, the living Rick Roll gets his hackles up. Yeah. I mean, isn't it the case that Romans. I mean, we're kind of getting off track a little bit here. But didn't Romans a number of times kind of complain like, hey, we conquered those Greeks, and yet why is it that all the kids are into Greek literature?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1449.84,"end":1474.46,"speaker":"Fr Stephen De Young","text":"You know, aren't we superior culturally? They were conquered. Yeah, yeah, Right, right. And so the same is. The same is kind of true with the Assyrians. That's why we're bringing this up with the Romans and the Greeks. The Assyrians kind of co opt Mesopotamian culture. So Nineveh is another city that was basically nothing before the rise of the Assyrian Empire and then making it its capital. It's not even where they're from."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1475.18,"end":1475.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1475.74,"end":1477.5,"speaker":"Fr Stephen De Young","text":"They're called Assyrians because they're from Assur."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1477.82,"end":1482.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, Asur, Named after their main God, Ashur."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1483,"end":1748.22,"speaker":"Fr Stephen De Young","text":"Yes, yes. And so that's why they're called Assyrians. But they set up Nineveh as a capital. It's not even where they're from. I mean, Nineveh's in the area, but it's a different city and was sort of nothing until they establish it. But. So these are not cities that were prominent at some point in the past in Sumer. They're not in Sumer, but in Akkad even. But they sort of take over all of the previous Mesopotamian traditions and literature, sometimes literally. So we have a lot of the texts we have that are Old Babylonian texts, meaning from the original Babylonian Empire, the second millennium B.C. we have a lot of significant texts where the texts that we have at least cataloged aren't the original Old Babylonian versions. They're the Assyrian versions from the libraries at Nineveh. So at Nineveh, they not only collected all of these texts, but they translated them into the Assyrian dialect of Akkadian. At this point in history, at the beginning of the first millennium bc you start to get language families diverging in the Near East. So you get like, Hebrew and Ugaritic and some of these other languages emerging from old Canaanite around 1000 BC and separating. That's why when you read like Joshua and judges and even the first bits of First Samuel, like, everybody can understand each other. It's like, aren't they speaking different languages? It's like, well, sort of right now they're all speaking dialects of Old Canaanite, right? So there's a lot of overlap. And the same thing is happening in Mesopotamia with Akkadian. You start getting an Assyrian dialect of Akkadian, you're going to get a Neo Babylonian dialect of Akkadian that are still basically Akkadian. But you can tell, right, that there are certain things, certain ways of writing certain words, certain verb forms and stuff that mark it out as being the Assyrian dialect in particular. So they not only collect all that literature to have a library at Nineveh, but they put their tweaks and twists on all of it to sort of make it their own. Also, the Assyrians tried to establish a monoculture, Assyrianization orification. And we've talked about that before on the show. In terms of what happens to the northern kingdom of Israel, the northern tribes, how when Assyria conquers them, they deport all the people from that land from Samaria, take them over and put them somewhere else in Mesopotamia, and they take people from Mesopotamia and relocate them to that land in the. In the Levant. And then over a couple generations, the. The Hebrew names disappear. Like, they just get merged into the general Assyrian Mesopotamian population. And so this. This was deliberate on their part. This was part of how they manage their empire to try to prevent revolts is by homogenizing everybody's culture. So you're living and working on land that your family doesn't have any real connection to for any long period of time. You are not culturally different in what we would today, in modern terms, call an ethnic group, right? From your neighborhood whose family has been there for generations, right? It all becomes sort of this melting pot idea. And that worked okay for them for a while, but the Assyrians were mostly concerned, and this is why they used that strategy. Their concern was that they were going to have revolts out at the edges of the empire in newly conquered territory. Because we've got to remember at this point in history, you can only fight wars during a certain season. So there are no standing armies, no such thing as a standing army. There are generals who a king has, whose job is to muster and move and command troops. But the troops are just regular men of a certain age range who you call up."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1748.3,"end":1750.5,"speaker":"Fr Andrew Stephen Damick","text":"These are not professionals, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1750.5,"end":1752.14,"speaker":"Fr Stephen De Young","text":"And most of them are farmers."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1753.93,"end":1762.41,"speaker":"Fr Andrew Stephen Damick","text":"Because, you know, this is subsistence period in history. Most people are just working on making food. And if everyone's. If most people are not doing that, you die."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1762.65,"end":1809.59,"speaker":"Fr Stephen De Young","text":"You don't have food to eat. Yeah. So you can't just go and deploy your army for three years straight because that means no one's growing any crops. So not only can you not feed that army, you can't feed any of your people at home. This. I know this seems weird from a modern perspective, but literally, after the harvest was done, right. At a certain point, now's the time for war. We call everybody up, we march them somewhere, we make war, and then at a certain point, we've got to march them all back for the planting seasons. So, yes, timeout. And then everybody goes back to their respective quarters, grows their food for the year. And then after the harvest again, game on. And everybody comes, come back and attack."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1810.31,"end":1811.27,"speaker":"Fr Andrew Stephen Damick","text":"Just the reality."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1811.51,"end":1843.19,"speaker":"Fr Stephen De Young","text":"And so Assyria goes and brutally captures some. Some piece of territory. As soon as they march back, march out of there, what's to stop them from breaking away? Well, they've relocated all the people. Right. They took all the people from there back with them. And then the next season, they send the military out with the new settlers to help them settle. So they're concerned about the edges. What they weren't thinking about was that the call might come from inside the house. Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1843.19,"end":1846.39,"speaker":"Fr Andrew Stephen Damick","text":"That they could have an internal uprising."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1846.55,"end":1852.07,"speaker":"Fr Stephen De Young","text":"Yes. That things could happen inside. And spoilers. This is what happens to the Assyrians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1852.63,"end":1856.71,"speaker":"Fr Andrew Stephen Damick","text":"Guess who's back. It's Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1856.79,"end":1877.94,"speaker":"Fr Stephen De Young","text":"Yeah. Well, first. First. The first sign that maybe the Assyrian Empire isn't as strong as it once was. So we get into the early 620s BC the Assyrian Emperor is a fellow named Sin Shariskun, which blows trippingly off the tongue."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1878.1,"end":1879.7,"speaker":"Fr Andrew Stephen Damick","text":"Another one not to name your kids."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1880.02,"end":1882.34,"speaker":"Fr Stephen De Young","text":"Yes. No, this is definitely not a saint."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1883.38,"end":1883.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1884.26,"end":1895.83,"speaker":"Fr Stephen De Young","text":"This is definitely not a saint. Last night, the Bible study, we talked about what I'm sure was a lovely young woman in the Torah, but who was given the name by her father, Hogla."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1896.55,"end":1899.83,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that wouldn't work well here."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1900.23,"end":1904.39,"speaker":"Fr Stephen De Young","text":"Yeah, I said if you name your daughter Hogla, I will not baptize them. Hogla."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1904.39,"end":1904.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1904.87,"end":1925.36,"speaker":"Fr Stephen De Young","text":"If I do, someday they will kill you. And I will not blame them. But yeah. Sinchariskoon is not even eligible for David, your kid in the Orthodox Church. So he's the emperor. And the first sign of his overall weakness comes with another fella named Sin Sumo Lisher."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1926.16,"end":1928.08,"speaker":"Fr Andrew Stephen Damick","text":"Also trippingly flows off the tongue."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1928.08,"end":1939.36,"speaker":"Fr Stephen De Young","text":"Yes. So don't get Sin Charis Kun and Sin Sumo Lisher. Confused. These are two different guys. Okay. Sin Sumo Lisher was one of his generals."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1939.52,"end":1942.24,"speaker":"Fr Andrew Stephen Damick","text":"Man, I can't wait to see what the auto captioning does with those."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1942.48,"end":1944.16,"speaker":"Fr Stephen De Young","text":"Oh, this is going to be great. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1947.33,"end":1947.89,"speaker":"Fr Andrew Stephen Damick","text":"Militia."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1950.13,"end":1991.75,"speaker":"Fr Stephen De Young","text":"So Sinsu Militia is one of Sinchariskoon's generals, and he's one of the first ones to smell weakness around the emperor. So he stages a revolt to try to take the throne, leading to a minor and fairly short civil war because he has some partisans, some military partisans on his side, but he kind of gets ended. But just the fact that this happened, the fact that since Charizard had to take the time to put down such a rebellion, is taken by a bunch of people as a sign of weakness. And the most important of those is a fellow by the name of Nabopolasser."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1992.15,"end":1994.71,"speaker":"Fr Andrew Stephen Damick","text":"Another one not to name your kids. Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":1995.51,"end":2004.9,"speaker":"Fr Stephen De Young","text":"And Nabopolasser, his name in Babylonian dialect of Akkadian means Naboo protect this son."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2005.94,"end":2007.62,"speaker":"Fr Andrew Stephen Damick","text":"Nabu being a God."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2007.78,"end":2031.81,"speaker":"Fr Stephen De Young","text":"One of the gods. Yeah. Nabu is the eldest son of Marduk. We'll be talking about Marduk a lot in the second half. And Nabopolasser kind of comes from nowhere, but there's an interesting theory about where he comes from that we'll get to here in a couple of minutes. But in the one place where he mentions his parentage, he says he is a son of a nobody."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2032.85,"end":2044.17,"speaker":"Fr Andrew Stephen Damick","text":"That's a weird, weird self designation. I mean, almost everybody in the ancient world who's somebody or trying to be somebody claims to be like the son of a God, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2044.17,"end":2110.45,"speaker":"Fr Stephen De Young","text":"Yeah. Or at least just names their father. Right. Like even if he wasn't significant. Right. But he says he's a son of a nobody. We'll get to in a minute. The theory as to what that's pointing toward. And so Nabopolasser, seeing Sincharis Kun is weak, decides now's the moment for what begins with Nabopolassar as a sort of independence movement. He wants Babylon and the cities around it referred to as Babylonia, Right. The region of Babylon, to basically secede from the Assyrian Empire and become a separate unit. He doesn't directly attack Sin Sharuskun. He doesn't try to make himself emperor at this point. Right. He just wants to secede. And so he took control of the cities of Babylon, Uruk and Nippur. Uruk remembers the city Gilgamesh is from. Also remember Ur is the Sumerian word for city. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2110.45,"end":2112.89,"speaker":"Fr Andrew Stephen Damick","text":"We're going to see a lot of cities here with Ur Elements."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2113.05,"end":2185.83,"speaker":"Fr Stephen De Young","text":"Yes. So you have just Ur, right? Where. Where Abraham's from, but you also have Uruk. You have Nippur, Sippur, and that's the city of. And then the prefix which is often a God, a God's name. Right. The city of that God. Right. Babylon. Setting the Wayback Machine. We actually talked about this. Babylon's name actually is from Bob. Eli. Bob being the Akkadian word for gate, Eli being the plural gods. So it's gate of the gods. So he. He takes care of Babylon, Uruk, and. And Nippur. And after taking control of those cities and signaling their intent to secede, he was crowned the king of Babylon. As you might expect, Sin Char not cool with this. And so he counter attacked, and he managed to take Uruk back, and he took Nippur back, briefly leaving Nabopolasser with just Babylon and its environs. But before we talk about what happened next, brief pause about Nabopolasser's potential origin story."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2186.47,"end":2188.07,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Where is this guy from?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2188.07,"end":2200.47,"speaker":"Fr Stephen De Young","text":"Where does he come from? What does son of a nobody mean? Why is he doing this? Why is he after independence? Okay, so we have this tablet."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2202.63,"end":2203.03,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2203.35,"end":2236.07,"speaker":"Fr Stephen De Young","text":"The tablet is talking about an order issued by Sincharis Kun regarding a fella named Kaduru. Now, we're jumping ahead, but if you remember past times that we've talked about Nebuchadnezzar, where Nebuchadnezzar has popped his head up on. On the show, we've pointed out that his. His actual name in Babylonian is Nabu Kaduru Utser. So Kaduru is like the middle part of that and is how it was cut, would commonly be abbreviated."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2236.56,"end":2237.44,"speaker":"Fr Andrew Stephen Damick","text":"His nickname."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2238.08,"end":2266.46,"speaker":"Fr Stephen De Young","text":"Right. So if you were going to abbreviate someone's Babylonian name. So Nabopolassar, if there was someone who was friendly enough with him, maybe his wife or something, who was gonna call him like, a nickname, they wouldn't call him Nabo or Nabi or something like we would. They would call him Pola. And so the same way Nebuchadnezzar would be, you'd call him Kaduru. So it's possible that this person's name was actually Nebuchadnezzar?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2266.62,"end":2269.5,"speaker":"Fr Andrew Stephen Damick","text":"Well, we don't know, but that's a decent speculation."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2269.74,"end":2272.54,"speaker":"Fr Stephen De Young","text":"Right? Right. There's a fairly strong case for that. Okay."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2272.86,"end":2273.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2273.42,"end":2312.51,"speaker":"Fr Stephen De Young","text":"But whoever this guy was, he got on the outs with Shin Charis Kun, said some critical things, maybe made some critical moves. He was apparently part of and one of the ancient families of Uruk. So he's kind of a prominent citizen of Uruk who did these things, but then died before Sin Charis Kun could do anything about it. And so in the tablet, Sin Charis Kun decides he can still do something about it. So he, being the Assyrian emperor and being the kind of person who's the Assyrian emperor, sent troops to dig up his body, this Kaduru's body."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2312.83,"end":2313.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2313.95,"end":2319.07,"speaker":"Fr Stephen De Young","text":"And then have it dragged through the city until it disintegrated."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2319.84,"end":2326.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is basically how in this time place, cultural context, you damn someone to hell."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2327.12,"end":2401.55,"speaker":"Fr Stephen De Young","text":"Yes. You're kind of erasing them. The tablet mentions he has two sons. The one son whose name is intact on the tablet has a name that begins with Naboo. The second son's name also begins with Naboo. But the rest of the name is kind of cracked, broken out of the tablet. So we don't know if it says Nabopolasser or not. But based on the time the tablet is from, based on connections we've already talked about and some more we'll talk about the future between Nabopolassar and Uruk and his family in Uruk, there is a going theory. And this whole son of a nobody thing is that Nabopolasser was this Kaduru's son and that this being done to his father by Sinchariskun is what motivates him to then start this uprising. And if this Kaduru's full name was Nebuchadnezzar, that would explain why Nabopolassar is going to name his son Nebuchadnezzar also. Yeah, so after his now gone father, but he's son of a nobody because the Assyrian emperor has made him a nobody."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2402.38,"end":2408.3,"speaker":"Fr Andrew Stephen Damick","text":"So, so, so it's a lot of conjecture, but it happens to kind of fit the facts that we do have."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2408.3,"end":2418.5,"speaker":"Fr Stephen De Young","text":"It explains all the data we have, but we don't have any positive evidence to prove it's true. Yeah, it's just a good explanation for the evidence we have. Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2418.5,"end":2418.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2419.34,"end":2460.63,"speaker":"Fr Stephen De Young","text":"Back to our tale of woe. So Nabopolasser, he's down to just Babylon itself and its immediate environs. He's lost Uruk, he's lost Nippur back to Centurus Kun. And then what happens is he's not again the only one who I smell weakness around this Assyrian emperor. Right. Because now he had this civil war he had to put down. Now he's losing cities to Naba Palassar. And so another one of his officials whose name we don't know Because Sincharis kun blotted it out, tried to seize the throne while Sinchariskun was trying to deal with Nabopolassar."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2460.87,"end":2462.39,"speaker":"Fr Andrew Stephen Damick","text":"I mean, these are the Assyrians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2462.87,"end":2463.35,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2463.83,"end":2464.55,"speaker":"Fr Andrew Stephen Damick","text":"It only makes sense."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2464.55,"end":2465.99,"speaker":"Fr Stephen De Young","text":"Strike with the iron's hot, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2465.99,"end":2467.27,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2467.83,"end":2551.67,"speaker":"Fr Stephen De Young","text":"You want to be captain of a Klingon ship, this is how you do it. Right. So that's. So this attempted coup d' etat happens back home. Sin Sharaskun has to go back to Nineveh to deal with that. Right. So he has to withdraw his troops from Babylonia to deal with that. And that then allows Nabopolassar to take back Nippur. He doesn't get Uruk back, but he gets Nippur back once Sinchariskun has to withdraw. That is referred to by Sinchariskun after he puts it down. He blotted out the name. This is more of that making someone a nobody thing. Sinchariskun blotted out the name of the guy who tried the coup. So we don't know what his name was because he had all records of that person's existence destroyed after he put down the coup. But he referred to that as the Hundred Day Revolution. Right. Because he put it down in less than 100 days. He had dealt with it. But this allowed Nabopolassar to sort of consolidate his power by the time you get to 620 BC within Babylonia. He's sort of firmly in charge at this point and watching Sin Charis Kuhn have to go and retreat and having to deal with. He's running around having to put out fires. This emboldens Nabo Placer. Naboplaster decides, let's make Babylonia a little bigger."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2553.11,"end":2554.15,"speaker":"Fr Andrew Stephen Damick","text":"Needs breathing room."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2554.47,"end":2576.34,"speaker":"Fr Stephen De Young","text":"And so he starts heading north. By the time you get to 616bc, he's unified pretty much all of Mesopotamia under his rule. And the Assyrians are basically now confined to Syria in terms of where they have power now. The Assyrians at this time had made a peace deal with the Egyptians."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2577.22,"end":2582.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, mutual, let's not hurt each other. We've got bigger fish to fry. Kind of treaty."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2582.42,"end":2670.31,"speaker":"Fr Stephen De Young","text":"Essentially a non aggression pact. Right. Egypt needed to deal with trying to repel the Assyrians. The Assyrians had enough stuff going on. They didn't need to try and deploy the kind of military they'd need to try to conquer Egypt. That was just beyond what they could likely do. And so they just sort of agreed to border areas and a sort of the Levant was sort of a demilitarized zone in a way in that they both tried to project their influence over it, but neither of them would go in and invade and try to conquer it beyond the northern kingdom being gone. So the Egyptians, part of this deal, right, was sort of mutual, mutual defense. So if someone attacked Egypt, the Assyrians would come help. If someone attacked the Assyrians, Egypt would come help. So Egypt sent troops to Syria to try to help the Assyrians against Nabo Pilassers expansion and failed miserably. So Egypt's military force got significantly weakened through a series of losses and they eventually abandoned, for the most part, the Assyrians. Now all of this happening, right? So now Nabopolasser is shrinking and shrinking the Assyrian empire. Who else gets wind and smells weakness but the Medes? Oh, hey, the Meads, inventors of the Trapper Keeper."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2674.56,"end":2676.08,"speaker":"Fr Andrew Stephen Damick","text":"Everybody show your Gen X cards."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2676.24,"end":2736.11,"speaker":"Fr Stephen De Young","text":"Yeah, so. So the Meads, the Medes never really have their own empire. The Medes, if you want to think of the Medes, you have to think of the Medes, sort of like the Huns, I mean, under Attila the Huns, right. Or the other barbarian groups, the Vandals, right, who sacked Rome. Right. They were sort of more of a tribal group. They weren't into logistics and trade and rule and stuff. They were more into sort of pillaging. And so the Medes, throughout the second half of the first millennium BC essentially operate on a mercenary basis for other empires. And so the Medes, they'll get when, hey, these Assyrians, they're a pretty big empire. They got a lot of gold, they got a lot of nice stuff. And they're on the back foot. They're weak right now. And so the Medes start raiding and pillaging Assyrian cities sort of on their own at first."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2736.51,"end":2737.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2737.31,"end":2989.56,"speaker":"Fr Stephen De Young","text":"Throughout 615 and 614 BC and that includes them moving into even Assur, right. The Assyrian homeland, they're pillaging cities. And so the Babylonians see them doing this and say, hey guys, looks like we're on the same side here. So essentially the, the Babylonians and the Medes make a treaty. We'll talk about that more in a little bit here. But they make a treaty. And so the Medes fight for the Babylonians. They get to be part of the Babylonian military as it's marching on the Assyrians, they get to keep what they pillage and loot on the way, right? So it's a win win situation as far as the Meads are concerned. Right. They've got a lot of backup, they're getting stuff. It's easier for them to raid and capture stuff because they're with this other military force. And so in 612 BC, the medes and the Babylonian army lay siege to Nineveh. And they lay siege to Nineveh, the capital of Syrians for several months and end up pillaging and razing the city as part of that. According to ancient accounts, including Berossus, who we've talked about recently, they break the river walls and flood the city as part of the breaking of the siege level and pillage the place. Sin Charis Kun ends up dead. We're not sure who exactly is the one who killed him or how he died, but he ends up dead by the the end of the destruction of Nineveh. And Nineveh is just allowed to kind of rot. It remains in ruins from that point. With Sincharis Kun dead, his son Asher Uballat ii, who is a total loser, technically becomes the Syrian emperor. Yeah, I say technically because like the capital just got destroyed. They've lost all of their cities, they've lost their heartland. He's kind of the emperor of Jack and squat. And Jack left town, so he goes on the run, right? Because he knows the title he just technically inherited is his death warrant as far as the Babylonians are concerned, as far as Naba Pilaster is concerned. So he goes on the run and basically goes and hides with the Egyptians. He takes what's left of the Assyrian military, they run south to Egypt and say, hey, remember you're supposed to defend us, right? And so probably not because the Egyptians cared at all about Asher Uballat ii, right? Or the Assyrians, but probably more because they had considered the Assyrians a major threat. And that major threat just got wrecked. Meaning the Babylonians are now an even more major threat, potentially. Pharaoh Necho ii, the inventor of the wafer, goes out and Pharaoh Necho II went out to war with the Babylonians. And the big climactic battle, the big clash happens in 605 BC, the Battle of Carchemish, which happens in and around the area of Megiddo. That's where they meet up where the Babylonians coming in the one direction and the Egyptians coming up in the other direction, where they run into each other. And long story short, the Egyptians get wrecked, that's pretty much destroyed. And with the defeat of the Egyptians there and the retreat of the Egyptians back to their borders, the what's called the Neo Babylonian Empire, the new Babylonian Empire is established in there in 605 BC and right after that battle and the official establishment of the Neo Babylonian Empire, which is ruled over by the Chaldeans. The Chaldeans are an ethnic group. So Chaldean technically refers to the primary ethnic group of the Neo Babylonian Empire."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2989.8,"end":2994.71,"speaker":"Fr Andrew Stephen Damick","text":"And they kind of become like the ruling house sort of, although a little bit broader than that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":2995.03,"end":3055.62,"speaker":"Fr Stephen De Young","text":"Yeah. Remember we mentioned this back in the Abraham episode, that referring to Ur of the Chaldees was sort of a radical anachronism there, because there weren't any Chaldeans yet. Chaldean, properly speaking, refers to the Neo Babylonian empire. But that is one of those places in the Torah where we're getting, like, an update, like. Or. Or where. Right. Oh, the one in. Over in Mesopotamia. Right, That's. So Chaldea is how they would refer to that region later. But so a few months after that, the empire is established. Battle of Carcabish, big victory. And then Nabo Pilaster dies before the end of the year. So Nabopolassar is in certain ways like Alexander the Great in that he has this final victory of his conquest and then dies and never really rules over the empire he established, but his son does. Nebuchadnezzar, the second we finally got to him."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3056.02,"end":3060.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the one that is sort of the Nebuchadnezzar of the Bible."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3060.5,"end":3077.25,"speaker":"Fr Stephen De Young","text":"This is the Nebuchadnezzar of the Bible. The eldest son of Nabopolassar, he is, at the time of the death of Nabopolassar, he is officially crowned as the king of Sumer and Akkadian. Oh. And also the king of the universe."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3077.65,"end":3090.13,"speaker":"Fr Andrew Stephen Damick","text":"Nice, nice. I actually looked it up, and the original Babylonian king had the title of king of the four corners of. No, Hammurabi. Sorry. Yeah, Hammurabi, King of the four corners of the world."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3090.13,"end":3090.93,"speaker":"Fr Stephen De Young","text":"So, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3090.93,"end":3092.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're moving up now."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3092.53,"end":3112.55,"speaker":"Fr Stephen De Young","text":"So universe even is. Yeah. Leveling up includes the heavens and the seas. So as we mentioned earlier, Nabukaduru Utser is the actual original. This has caused certain pedants to want to say Nebuchadrezzar instead of Nebuchadnezzar when they're translating the Bible."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3112.87,"end":3113.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3113.67,"end":3115.35,"speaker":"Fr Stephen De Young","text":"Such people are to be watched closely."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3115.75,"end":3137.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. Yeah. So this name means Nabu, watch over this son or my heir. And there are apparently some people who say, I don't know the truth of this, but there are some people who say that Nebuchadnezzar versus Nebuchadrezzar. Nebuchadnezzar is some kind of Israelite joke, because it would maybe translate to Nabu protect the mule."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3138.42,"end":3140.5,"speaker":"Fr Stephen De Young","text":"Yeah, depending on how you vowel it. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3140.5,"end":3145.06,"speaker":"Fr Andrew Stephen Damick","text":"Which is, I guess, hilarious ancient Near Eastern humor."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3145.06,"end":3146.66,"speaker":"Fr Stephen De Young","text":"We're calling him a mule."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3147.22,"end":3148.94,"speaker":"Fr Andrew Stephen Damick","text":"I mean, mule's pretty."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3148.94,"end":3149.94,"speaker":"Fr Stephen De Young","text":"I mean, that's one of the most."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3149.94,"end":3152.18,"speaker":"Fr Andrew Stephen Damick","text":"Timeless kinds of joke references."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3152.18,"end":3153.14,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3153.14,"end":3167.24,"speaker":"Fr Andrew Stephen Damick","text":"You know, in Arabic, you call someone or. Yeah, you know, now I'm cussing on the. On the air in Arabic. But anyway, animal names, they're just animal words."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3171,"end":3196.84,"speaker":"Fr Stephen De Young","text":"Oh, so this is true story of Dutch life. When my dad was a little kid, his grandmother, my great grandmother, used to refer to him all the time as Dumer Frickeisel, as one does. And he thought it was some Dutch term of endearment or something. He only found out later that it's Dutch for dumb fat donkey."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3197.24,"end":3197.72,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3198.52,"end":3200.52,"speaker":"Fr Stephen De Young","text":"This is what Dutch families do to a man."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3201,"end":3202.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there are no feelings."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3204.84,"end":3207.8,"speaker":"Fr Stephen De Young","text":"None left after that. You know, your own grandma, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3208.04,"end":3211.64,"speaker":"Fr Andrew Stephen Damick","text":"That's right. So."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3215.79,"end":3226.83,"speaker":"Fr Stephen De Young","text":"So as we mentioned, he's Nebuchadnezzar ii. That is not based on the idea that Nabopolasser's father was named Nebuchadnezzar, though that is very possible. And that may be why he was named that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3227.07,"end":3229.23,"speaker":"Fr Andrew Stephen Damick","text":"Because he was not king of Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3229.39,"end":3286.52,"speaker":"Fr Stephen De Young","text":"Right. He is Nebuchadnezzar II because he is the second Babylonian emperor to have that name. The first one being one of the last emperors of the old Babylonian empire. Nebuchadnezzar I was in the 12th century, in the second half. I'll talk about him a little more. In the waning days and the collapsing days of the old Babylonian empire, Nebuchadnezzar I tried to sort of make Babylon great again, and it didn't go so swell. But. So he's at the 12th century BC, the very end. He's in the middle of the Bronze Age collapse. So that's the previous emperor, Nebuchadnezzar, Babylonian emperor Nebuchadnezzar, which makes him the second. While he was crown prince before Nabopolasser died, Nebuchadnezzar II did a couple of important things. Number one, his official position was he was the high priest of Ea. You may remember the. The God Ea from some of the flood stories we read last time."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3286.68,"end":3287.24,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3288.04,"end":3361.01,"speaker":"Fr Stephen De Young","text":"Who was the most high God in a lot of those Mesopotamian stories? But he was the high priest of Ea in Uruk. So this is another connection between that family and the city of Uruk. And this. This was fairly common. People don't realize how long this lasted in the ancient world. Like Julius Caesar's first significant position in Rome was a priesthood. That pagan priesthood was a government office essentially. So having the crown prince be a priest because remember that the king was also the high priest in these ancient empires. So the crown prince having a priesthood was fairly common, a prominent priesthood. He also, the other major thing he did is that Nabopolasser was not leading the army into battle at Carchemish. Nebuchadnezzar was. He as crown prince was the one actually on the ground at Carchemish, at Megiddo, leading his army into battle against the Egyptians and winning that decisive battle. So when he ascends to the throne, it's not just a biological claim. As Nabopolasser's son, he's also accomplished in his own right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3362.21,"end":3362.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3362.57,"end":3496.32,"speaker":"Fr Stephen De Young","text":"As he comes in to take the throne. He was also Nebuchadnezzar's wife. He was married to the daughter of Cyraxes. Cyraxes is not a Mortal Kombat character. Cyraxes was the king of the Medes. So when we mentioned a few minutes ago that Nabopolasser made this deal with the Medes, that's part of how they cemented that treaty. He married his firstborn son to the daughter of the king of the Medes to cement that alliance. So once, once Nebuchadnezzar comes to the throne and becomes the, the self styled king of the universe, he sets about consolidating the empire because the empire's just been won. So there's a lot of things that need to now happen. And the first of those that he sets about is firming up the borders. So having won the battle of Carchemish, he's sort of cemented Babylonian influence over the Levant and Syria, but hasn't really conquered it. Right. Has it really assimilated it into the Neo Babylonian empire. He's just kind of, I mean the Assyrians are gone and the Egyptians have been pushed back out of it. And so his first order of business in terms of consolidating the empire is to send troops in, march troops down to consolidate, make that to all that territory officially part of his empire. He first marches down the coast, down the Mediterranean coast. So he takes what was Philistia and goes all the way down to the border with Egypt in by 601 BC, has some skirmishes with Egypt that basically end with establishing, okay, here's the border between the Neo Babylonian empire and Egypt. They both push back and forth for a little bit and then kind of settle, resolve. And what this means is Judah which at this point, with the northern kingdom gone, is kind of a postage stamp. As we mentioned in a previous episode of A kingdom is tiny. It's not only tiny, but it's also surrounded."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3496.96,"end":3497.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3497.68,"end":3560.92,"speaker":"Fr Stephen De Young","text":"So the Babylonian empire is between them and the coast, meaning shipping's not really happening. Trying to ship overland, they got to go through Babylonian territory. And so the Babylonians become an immediately looming threat. And then it's not long before 587, 586, Jerusalem falls to the Babylonians, Temples destroyed, and the people are taken into exile in Babylon. And Judah, too, is added to the Neo Babylonian empire. The other thing Nebuchadnezzar does upon succeeding to the throne is he starts massive building campaigns, and this plays into a whole realm of Babylonian propaganda. Remember Nabopolassar? His father's whole movement started as this war of independence. It was about restoring Babylon to the greatness of the past. The Babylonian empire at this point, the height of it, was a thousand years before this."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3561.08,"end":3566.76,"speaker":"Fr Andrew Stephen Damick","text":"I know. It's just crazy to think about that, thinking, like, it was a millennium ago, you guys."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3567,"end":3590.66,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Like, that's what it was at its peak was a thousand years ago. I mean, the closest thing is the way people still to this day talk about, like, the glory of Rome. It's that kind of thing. Like, the Babylonian empire looms large, and they're the heirs of that because they're Babylon. Right. And so we're gonna. We're gonna rebuild, we're gonna restore, we're gonna get back there."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3590.66,"end":3596.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It would be like if Keir Starmer suddenly got up and said, hey, let's make things like they were back during the period of Alfred the Great."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3597.39,"end":3600.19,"speaker":"Fr Stephen De Young","text":"Yeah. Or William the Conqueror. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3600.99,"end":3602.27,"speaker":"Fr Andrew Stephen Damick","text":"We don't talk about that guy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3605.87,"end":3790.82,"speaker":"Fr Stephen De Young","text":"The president did the other day. I don't know why, but look it up. He was in the uk. He just starts talking about William the Conqueror and how cool of a name that is being William the Conqueror anyway. Well, that's what everybody calls him. So. But so the. The whole sort of race on debt that started this whole process that ends in there being a Neo Babylonian empire was the restoration of Babylon. And so that takes the form, first and foremost, of a bunch of building projects, the first and most important of which is the renovation of the Essequila, which I pronounced correctly this time. So the. The renovation of the Essequila. The Essequila we'll talk about more in the second half. But that's the original temple of Marduk in Babylon. Marduk Was historically the God of the city of Babylon, becomes the main God of the Babylonian empire. The sort of original temple in the city was the Essequila. The Essequila, of course, in the original Babylonian empire had become this massive great thing after the fall of the old Babylonian empire had fallen into various states of disrepair. But the central elements of that, of that temple, the Esagila, by the time you get to Nebuchadnezzar are 2000 years old. And so he's restoring this ancient 2000 year old temple of Marduk. Right. Because that's sort of the central aspect of civil, civil and religious life for Babylon. Getting that back on its feet is a big, obviously a big thing. Second thing he does, he completes the building of Edamananki, the great ziggurat of Babylon, the big zig, which was a ziggurat dedicated to Marduk that had started being built around 1400 BC in the old Babylonian Empire. So like 900 years or 800 years, 800 years before they had started building the ziggurat. And then the old Babylonian empire fell and they never finished it. It's Nebuchadnezzar who finishes it. But keep in mind, we've talked about in the past on the show the different connections between the story of the Tower of Babel and the Bronze Age collapse. And this is part of that. There was in the city of Babylon from like the period of time Moses would have lived until, you know, 600 B.C. there was a big, giant unfinished tower sitting in the middle of the city of Babylon. So when anybody heard a story about a tower that didn't get finished because God intervened, that was called Bob Billy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3791.38,"end":3791.78,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3792.26,"end":3796.34,"speaker":"Fr Stephen De Young","text":"They're going to be thinking of that big unfinished tower in Babylon, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3796.34,"end":3800.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, Babel, Bobili, Babylon, this is all the same name."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3801.3,"end":3818.13,"speaker":"Fr Stephen De Young","text":"Yeah, but so he finally finishes it and lo and behold, he didn't actually reach heaven. There was just an altar to Marduk on top of it. The remains of that also, by the way, are where they found that ritual bed we talked about when we talked about OG's bed. So special appearance by the giants. There we go."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3818.13,"end":3820.93,"speaker":"Fr Andrew Stephen Damick","text":"Hey, you mentioned the Amorites earlier, so."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3820.93,"end":3833.65,"speaker":"Fr Stephen De Young","text":"Yes, that's true. He also built the Ishtar Gate that was later rebuilt by Saddam Hussein, which was the warning sign that showed us all that the Rapture was going to happen in 1993."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3835.64,"end":3838.28,"speaker":"Fr Andrew Stephen Damick","text":"Or yesterday. Yeah, as the case may be."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3838.6,"end":3846.12,"speaker":"Fr Stephen De Young","text":"We all remember the rapture from 1993. Hey, I remember it from 1988 and how the great tribulation ended in the year 2000."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3846.44,"end":3848.28,"speaker":"Fr Andrew Stephen Damick","text":"In 19. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3849.56,"end":3860.88,"speaker":"Fr Stephen De Young","text":"So there are books you could go look online. There are books with like, Saddam Hussein's face and the Ishtar Gate on the COVID I know. Arguing that I'm not being physician. Those really existed. I mean, I am being."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3860.88,"end":3861.56,"speaker":"Fr Andrew Stephen Damick","text":"Takes me back."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3862.64,"end":3877.2,"speaker":"Fr Stephen De Young","text":"But the Ishtar Gate, the original Ishtar Gate had beneath the layer of blue lacquer with a critter on it. Which critter is a dragon, but a specific dragon who we'll talk about more in the second half. I think that lacquer is made of bricks."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3877.84,"end":3879.36,"speaker":"Fr Andrew Stephen Damick","text":"It looks like a tall weasel, though."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3880.24,"end":3880.88,"speaker":"Fr Stephen De Young","text":"Kinda."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3881.36,"end":3882,"speaker":"Fr Andrew Stephen Damick","text":"Kinda."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3882.08,"end":3884.88,"speaker":"Fr Stephen De Young","text":"It could be like a really deformed greyhound anyway."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3887.44,"end":3890.32,"speaker":"Fr Andrew Stephen Damick","text":"Or a chicken mink hybrid. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":3892.67,"end":4012.61,"speaker":"Fr Stephen De Young","text":"But the bricks under there were all stamped with Nebuchadnezzar's name, every one of them individually. And you could go see them to this day. It's still true. But also a bunch of them were stamped with the names of Assyrian kings, meaning Nebuchadnezzar sent people to tear down Assyrian monuments in and around Babylon, stamp those bricks with Nebuchadnezzar's name, and then use them to build his building projects. So he was enacting this sort of destruction and wiping away of the Assyrians in these restorations. The Ishtar Gate was the northern gate to the city of Babylon. And the reason it's important and the reason why it was so decorative as opposed to the other ones, is that it was the ritual gate. So when they did ritual processions for feasts and that kind of thing, the pagan feasts, ritual processions, they went through that gate. That's why it was so elaborately decorated. He also went to the far north, the northern edge of the Fertile Crescent, the northern edge of the Neo Babylonian Empire, because he was worried about barbarians coming and raiding things, which was always a worry. Right. Because it took so long, especially depending on what time of year it was to deploy troops that barbarians could raid a place and be gone, you know, before you could get anybody there to do anything about it. Right. So he built two massive border walls up at the north. As far as we know, he was not able to get the barbarians to pay for them, but he did build these northern border walls. He built a number of canals in and around the Euphrates. He built a canal connecting the Tigris and Euphrates. He built a canal from the Euphrates that ran through the city to irrigate things like the next building project we're going to talk About. So he masterminded these massive irrigation projects and he built the Hanging gardens of Babylon, one of the seven wonders of the ancient world."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4012.61,"end":4023.81,"speaker":"Fr Andrew Stephen Damick","text":"I have to say this. There's been a lot of talk in the chat tonight about Sid Meier's civilization. So this is where it all connects. Now, finally, everybody, the hanging gardens of Babylon, which you've all built, I hope."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4024.6,"end":4049.56,"speaker":"Fr Stephen De Young","text":"Yes. So the hanging guards of battle, which was essentially sort of a ziggurat like structure in that it had steps, but then each of the steps had garden on it. So the idea was it was supposed to be a reconstruction of the garden of the Gods on the Mountain of the Gods. And this required a feat of both building construction engineering and irrigation engineering."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4051.26,"end":4051.42,"speaker":"Caleb","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4051.42,"end":4128.79,"speaker":"Fr Stephen De Young","text":"Considering where it was to keep all of that alive. And apparently from what ancient visitors say, they felt like having been there and in it, that they had experienced being in the garden of the gods. So that's why it's one of the seven wonders of the ancient world, because it was apparently amazingly impressive for its day. And technologically it's still pretty impressive to this day. What he was able to do. So Nebuchadnezzar accomplishes all this. Nebuchadnezzar eventually dies in 562 BC, meaning he reigns for 43 years. This is really impressive because the Neo Babylonian empire does not last that long. So if you take as the starting point of the Neo Babylonian empire, the beginning of Nabopolasser's revolt, then it was around from 626 BC to 549 BC 77 years, if you take, which is probably more accurate, the battle of Carchemish to be the beginning of the Babylonian empire. And then it ends in 549. Then it was around for 56 years total. Babylon the Great and Nebuchadnezzar was the emperor for 43 of them."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4129.76,"end":4131.2,"speaker":"Fr Andrew Stephen Damick","text":"So he kind of is Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4131.28,"end":4170.25,"speaker":"Fr Stephen De Young","text":"Right? So yeah, he is it. Right. The Neo Babylonian empire kind of is Nebuchadnezzar because it's only around after he dies for 13 years. And then Cyrus the Great and the Persians take over, literally. When Nebuchadnezzar died in 562 BC, he was immediately succeeded by his son Amal Marduk. We know there were some issues around the succession. We don't know exactly what they were. Why don't we know what they were? Well, sort of like with the Assyrians, the guy who won rewrote the history."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4171.45,"end":4172.01,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4172.41,"end":4238.36,"speaker":"Fr Stephen De Young","text":"And so Abel Marduk, once he wins is like, it's the records are, yes, he was the chosen heir of his father, Da Da Da Da Da. But we know things like he wasn't the firstborn son of Nebuchadnezzar. And there seems to be some kind of chaos right around the time that briefly when Nebuchadnezzar dies and Amal Marduk ends up being the emperor of the Neo Babylonian empire for less than two years and then he's assassinated by one of his court officials. So not a very secure succession at all. And the the last few emperors doing during those other 11 years that the Neo Babylonian empire exists are not around for very long and are not biologically related, as far as we can tell, to Nebuchadnezzar or Nabopolasser. So once Nebuchadnezzar is off stage, the decline is swift in terms of the empire. So that's brief history of the Neo Babylonian Empire, Nebuchadnezzar. I have an interesting definition of brief."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4238.6,"end":4240.44,"speaker":"Fr Andrew Stephen Damick","text":"And we skipped a thousand years in between."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4240.92,"end":4248.76,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So in our second half, we're going to talk about Babylonian religion."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4249.24,"end":4258.68,"speaker":"Fr Andrew Stephen Damick","text":"I'm so excited. All right. Well, you've wasted a good, perfectly good 80 minutes of your life listening to this first half of this episode of Lord of Spirits. We'll be right back."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4259,"end":4275.34,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of of the Lord of Spirits. Give them a call at 855-237-2346. That's 8555-AF-RADIO."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4290.23,"end":4317.24,"speaker":"Fr Stephen De Young","text":"Centuries, Byzantine music has sustained Orthodox worship around the world. Now the St. John Cuckuzelis Institute of Liturgical Arts offers online classes in notation, theory and practice and free classes in liturgics with a faculty led by John Michael Boyer, author of the acclaimed book Byzantine Chant. The received tradition. Registration is open now for classes in September@cuckoozelis.net that's k o u K O U Z e l I s.net."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4320.28,"end":4336.44,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4337.72,"end":4370.78,"speaker":"Fr Andrew Stephen Damick","text":"As an emcee, West's line readings did not seem fully rehearsed. He sounded like an actor who was nearly, but not quite off book, suggesting the proper emotional intonations as often as he truly tried to sell them. This had an unexpectedly intriguing effect, perhaps because so many of the vocals on his recent albums have felt flat and disengaged another passage from the ancient text of Rolling Stone's review of Kanye West's Nebuchadnezzar. I don't know. This. This review is just the gift that keeps on giving, I think."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4371.19,"end":4373.19,"speaker":"Fr Stephen De Young","text":"I mean, at least he didn't name it Nebuchadrezzar."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4376.07,"end":4380.31,"speaker":"Fr Andrew Stephen Damick","text":"Should have called it Naboo. Protect the mule. Yes, See, I would have shown up for that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4381.03,"end":4387.83,"speaker":"Fr Stephen De Young","text":"Elaborate. That could be the great. I mean, that sounds like a show tune. Protect the mule."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4388.63,"end":4389.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4390.63,"end":4400.78,"speaker":"Fr Stephen De Young","text":"Like that has like show tune written all over it. But something about a bright Holden golden haze on the meadow, I don't know. And a mule."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4400.86,"end":4401.42,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4406.06,"end":4521.79,"speaker":"Fr Stephen De Young","text":"So yeah, religion. Now, not that we haven't talked about anything religious so far, because these things are not separate, but we're going to sort of focus on Babylonian religion. And the figure who for obvious reasons looms large over Babylonian religion is Marduk, who we've talked before. We have this idea today of pantheons, the Greek one being the one people are most familiar with, but then maybe Egyptian ones. We think of pantheons of gods and we kind of think of them like the Justice League or the Avengers or something. Right? Like it's a collection of these gods. They all have different abilities and powers and stuff and they team up and. And that pagans sort of worshiped this group of gods. And as we mentioned many times before on the show, that's not how any of this worked. That the reality is individual locations, locales, cities, villages, even just geographical features like springs and groves had spirits and gods associated with them by pagans. And so each locality has a God or two. Right. That they. They're involved in worshiping and quote unquote, pantheons are things that happen when you start getting larger socio political units than the city. So if. If you listen to the episode where I read everybody bedtime stories and you listen to the memphite theology, that was a good example. Right. So that's a text that comes from the period when Upper and Lower Egypt were united. And so the gods that were worshiped in the cities in Upper Egypt and the gods that were worshiped in the cities in Lower Egypt were sort of all brought together and said to be related to each other in various ways."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4522.51,"end":4523.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4523.55,"end":4909.53,"speaker":"Fr Stephen De Young","text":"The ones from more prominent cities became fathers and less prominent Cities became sons, etc. Connected cities became siblings. But that was a way, in sort of narrative form, in sort of myth form, to express what we would today call the socio political relationships. Not that that was a primitive way of doing it. They just saw everything and we're going to see this a lot in this half of the show. Everything that's happening on earth is connected to things that are going on in the spiritual realm on earth as it is in heaven, that they. They mirror each other. And so Marduk originally is not the head of a pantheon or the member of a pantheon. This is yet another problem with the goofy thesis we already tore apart in the storm gods episode, that Yahweh, the God of Israel, was at one point a quote unquote member of a pantheon. Right. That's not a thing. Marduk is none of that. Marduk is just the God who is worshiped in the settlement, then village, then city of Babylon. The name Marduk originally was Amarutu, which doesn't look much like Marduk or sound much like Marduk, but we'll explain here in a second. Amarutu is Sumerian and means a calf of utu. Utu, calf meaning like young bull. So, so the bull of heaven, we associate bulls with the divine. So the calf means the sun, right, of the bull God. And UTU was the Sumerian name for the sun God. The Akkadian Semitic name for the same sun God was Shemesh. And we have talked before, back at the Melchizedek episode, we talk about the fact that Shemesh, the Semitic sun God, is the God that was worshiped in Jerusalem before David took it and unfortunately after Solomon. Yeah, right. Until King Josiah. What's interesting about this is this is Marduk's original name, which associates him as the son of the sun God, who is this bull God. But in none of the later stories about Marduk is he associated in any way with the sun God, even though this is his original name. And so the going theory is that we know that very early in its existence, so we're talking about 3rd millennium BC 2000s BC that Babylon as a settlement and as a small city was kind of a dependency of the nearby city of Sippar. And Sippar as a Sumerian city was utu. Sumerian named Shemesh. The sun God is the God that was worshiped at Sippar. So that being his original name may reflect that relationship between Sippar and Babylon. That Babylon at that point as a small town is a dependency of the bigger city of Sippar. And so the God of that town is seen as the son of the God of the bigger city. And then that relationship obviously changes very radically as Babylon becomes a bigger city and becomes ascendant. And so that whole relationship gets lost to history. Right. But so Amar utu. Over time, we're talking about over the course of like a thousand years here. Amar, UTU becomes Mar Utuk. So the initial ah gets dropped. Right. So instead of Amar you have married. Instead of UTU, you have Utuk. Mar Utuk. That then becomes Martuk and then Marduk. So by the time we get to the time of Hammurabi, he's Marduk. So Babylon, as we mentioned, starts out as this sort of backwater town. Right. And Marduk was originally an agrarian God. He was a God of farmers at that time, and one of the primary symbols for him in that earliest period. But that hangs on even to when he is considered like the high God of the Babylonian and Neo Babylonian empire. He still has a spade as one of his symbols. You'll see spades in the iconography. Right. There were likely spades in the temple that were held on to from this. From this point of origin. Now, I said, to give another example of this, I said that that relationship with the sun God was kind of lost. It wasn't totally lost because even all the way down to the Neo Babylonian empire, when they did processions for Marduk, they had these sort of sun. They had this sun iconography that they carried on poles, even though Marduk was not a sun God. So what you find is religious ritual, including pagan religious ritual, was in the ancient world, one of the best ways of preserving these things, much better than like the histories, the annals of kings. Those get edited all the time, like deliberately. Whereas religious rituals and traditions. Everyone has the attitude in the ancient world that the more ancient they are, the better. So they're loathe to change anything, even if they don't understand it anymore. Because sometimes we have. You can see this with the Greeks. When you read, like, Plato and Aristotle's understandings of certain ancient religious things, like, we know they're wrong because we have. We have sources, they. From those ancient times that they didn't have available to them. And so it's clear that the original significance had been totally lost by the. By the 4th century BC among the Greeks. And they're just kind of. They've either heard some explanation that somebody made up for it, or they're making it up themselves. This happens all the time, by the way, still to this day in the Orthodox liturgy, I can't tell you how many amazing theological explanations I've heard for the fanning of the gifts."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4910.9,"end":4911.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4911.14,"end":4915.54,"speaker":"Fr Stephen De Young","text":"Which I hate to break all your hearts, but that was to keep bugs away."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4916.5,"end":4920.98,"speaker":"Fr Andrew Stephen Damick","text":"That's what they say. But I mean, it's I mean, there's nothing. But there's like nothing."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4920.98,"end":4922.98,"speaker":"Fr Stephen De Young","text":"Theological exposures are nice, that they're fine."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4923.06,"end":4930.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's nothing wrong with attaching these other. These other meanings. You know perfectly. A lot of the church fathers did that. Like, there's nothing wrong with that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4930.34,"end":4936.18,"speaker":"Fr Stephen De Young","text":"But my point is just that there was an original reason. That original reason gets lost, such that people don't know it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4936.42,"end":4937.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":4937.3,"end":5081.88,"speaker":"Fr Stephen De Young","text":"But they keep doing it. Right. Even though in some cases they may not know why they're doing it. And then these other explanations for it come up later. So that still happens with religious ritual. But religious ritual, because we don't change it because we want to keep the most ancient forms possible, it preserves all of these things through time amazingly well. That's one of the importances when you're studying ancient cultures of studying the actual religious ritual because you get more accurate windows into earlier stages than you do from histories that are edited and propagandized. Right. Later on. So all that said, so Marduk starts out as this agrarian God, the spade symbol. Right. He's about farms, he's about bringing the rain in its season, male fertility. So you get some storm God stuff. He's not a storm God proper originally, but he is connected with the rain and with crop fertility and what would later become the essequila that we mentioned, sort of the original temple for Marduk in Babylon is built around 2500 B.C. so 4500 years ago, 4500 years before present, give or take, There's a shrine built there for Marduk. So then we mentioned historically, the Umuru come in, they settle in and around Babylon, they build up Babylon, begin the old Babylonian empire. Babylon rises to prominence as a city, so does Marduk, therefore, among other gods. And we start to see certain transformations. So one of the earliest is that Marduk gets a wife whose name is either Zaparnitu or Sarpanet. There is was a village just outside of Babylon. As Babylon became a city, it had farming villages around it that were dependencies. And one of those dependent villages was Zarpan. And Zaparnitu was the goddess of that little village. And she becomes, because of the rise of prominence of Babylon and it being a dependency, she becomes Marduk's wife. In terms of the stories, I keep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5081.88,"end":5090.88,"speaker":"Fr Andrew Stephen Damick","text":"Waiting at some point for one of these names finally that somebody's going to meet some person or place is going to be named Zardoz, because it just. Oh, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5092.16,"end":5203.58,"speaker":"Fr Stephen De Young","text":"Anyway, it would be great, but. So Zarpan, Zarpanitu originally was a goddess associated with pregnancy. So they would go to the shrine in this village and make offerings of this kind of thing when women were trying to get pregnant or had a difficult pregnancy. Right? And this kind of thing. But as Marduk rises in prominence, becomes the most important God of the Old Babylonian empire, she also then rises in prominence and becomes very closely associated with divination. And remember the Amorites, who are the ones who are building really the. The Old Babylonian empire. Remember we've said many times on the show, here come some giants again, peeking their heads in that their claim to power was that they held the secret wisdom delivered by the gods before the flood. So it's not Marduk, the male God, who's seen as the repository of that wisdom. It comes to be his wife, Zapornitu. Remember in the Book of Enoch the women receive from the watchers, right. The wisdom, divination and all of these things. So the repository of this is Zapornitu, this goddess. And as the Essegila is expanded, right, Goes from being a shrine to being a temple, to being a big temple complex. And Zaparinitu has become Marduk's wife. She gets a section of that temple complex in Babylon. And her section of the temple complex is referred to as the house of the secrets of heaven and the netherworld."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5204.69,"end":5206.89,"speaker":"Fr Andrew Stephen Damick","text":"Wow. It's the name of my next album."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5206.89,"end":5213.93,"speaker":"Fr Stephen De Young","text":"Of my little side project, Band of Ugaritic Death Curse. That's the secrets of Heaven in the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5213.93,"end":5217.33,"speaker":"Fr Andrew Stephen Damick","text":"Netherworld, which is a T shirt you can buy for the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5219.25,"end":5250.65,"speaker":"Fr Stephen De Young","text":"I should say, by the way, that's the connection here. Right. That's her part of the. Is the repository, the one who's sleeping with Marduk. That's the repository for the secrets of heaven and the netherworld there in the temple in Babylon. Also during this time, they build a throne of Marduk in the Essegila and in the Esagila. What they enthroned there is what was already probably about a thousand year old idol of Marduk."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5250.81,"end":5251.29,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5251.53,"end":5263.4,"speaker":"Fr Stephen De Young","text":"And an already sort of ancient idol of Marduk, which was believed to be Marduk. And Marduk is there with his dragon palace Mushusu."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5263.88,"end":5267.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh yeah, the tall weasel Mushusu who's."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5267.64,"end":5278.48,"speaker":"Fr Stephen De Young","text":"All over the Ishtar Gate. That's Mushusu who's just asking to become a Disney comedy sidekick, I think. Like I can see it. Like, I feel like he is."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5278.48,"end":5279.56,"speaker":"Fr Andrew Stephen Damick","text":"Isn't he though? No."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5279.88,"end":5283.08,"speaker":"Fr Stephen De Young","text":"Like how they do some Hammurabi animated movie."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5283.24,"end":5293.52,"speaker":"Fr Andrew Stephen Damick","text":"I'm trying to remember the name of the dragon. The silly dragon sidekick in Now I'm blanking on the film with the brave Chinese girl."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5294.72,"end":5295.6,"speaker":"Fr Stephen De Young","text":"Oh, Mulan."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5295.92,"end":5306.32,"speaker":"Fr Andrew Stephen Damick","text":"Mulan. Yeah, yeah, I remember the name of the sound off in the chat there. Tell us, who's Mulan's dragon sidekick? Everybody. I'm sure you all know right off the top of your head. But."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5307.28,"end":5314.41,"speaker":"Fr Stephen De Young","text":"But remember, this is. This is a. A very common motif in ancient idolatry."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5314.65,"end":5318.09,"speaker":"Fr Andrew Stephen Damick","text":"It's Mushu. It is Mushu. It is Mushu."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5319.29,"end":5320.65,"speaker":"Fr Stephen De Young","text":"But not Mushusu."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5320.89,"end":5329.45,"speaker":"Fr Andrew Stephen Damick","text":"No, not Mushusu. But I mean, they could be related kind of close. Yeah, yeah. There's some kind of nerd working on those movies."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5329.53,"end":5349.02,"speaker":"Fr Stephen De Young","text":"Yeah. But this is a common motif in ancient idolatry where the God is depicted with a dragon or serpent as a representative of wisdom. This goes all the way down to. If you look at the early statuary of Athena in Athens, she usually has a serpent next to her."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5349.26,"end":5355.58,"speaker":"Fr Andrew Stephen Damick","text":"Well, and even, I mean, even the. The whole Asclepius imagery, right? You got the serpents twined around the staff. Yeah, yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5355.82,"end":5499.18,"speaker":"Fr Stephen De Young","text":"So this is even more ancient than Mushusu there with Marduk, right? This. This ancient dragon representing the. This ancient antediluvian wisdom. I hope, as we're describing this, right, you're making the connections and seeing some of the motifs and things we've talked about in the past and in the Bible and how the Bible inverts a lot of these things, right? So as Babylon rises in prominence and becomes sort of the locus of the old Babylonian empire, we see the usual pattern of assimilation, meaning other gods are sort of assimilated into Marduk. They say, well, the God of this city who's. Well, he's named that, but that's really Marduk. And then also assimilation in the sense of, like we just talked about with the family relationships. So, oh, well, this is. Naboo is Marduk's son. A is Marduk's father, who's sort of the ancient most high God, is the father of Marduk. And so that assimilation takes the form of the gods of all these various cities being put in place, right? So, you know, Uruk, they're worshiping Ea. Uruk is a more ancient city than Babylon, but now Babylon is more prominent. So Marduk becomes the son of the God of Uruk, who is now sort of ascendant as his father wanes off in old age, right? These kind of ideas, right, within the myth structure. And remember, Ea and Enki are two names. This is again Akkadian and Sumerian names for the same God. An interesting thing that happens in Babylon, in both the Old Babylonian Empire and in the Neo Babylonian Empire, is that when. When the emperors list their titles. We already talked about some of those titles, like Father Andrew mentioned, you know, Hammurabi is the king of the four corners of the world. Nebuchadnezzar is the king of the universe. They all use king of Sumer and Akkad. Right. Who have united Mesopotamia and all this. But the first title they always list, in the long list of titles, the first title they always list is Governor of Babylon, like governor of the city."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5499.18,"end":5506.54,"speaker":"Fr Andrew Stephen Damick","text":"Of Babylon, which seems weirdly limited. King of the universe, but Governor of Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5506.54,"end":5527.98,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. I also handle administrative duties in the city of Babylon. Yeah. And I rule the universe. But what that is is that is an ancient Babylonian tradition where they call themselves the governor of the city of Babylon because they hold that Marduk is the king of Babylon. Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5529.98,"end":5530.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5530.86,"end":5533.54,"speaker":"Fr Stephen De Young","text":"So the pagan God is the king of Babylon."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5533.54,"end":5538.54,"speaker":"Fr Andrew Stephen Damick","text":"And so the emperor of the universe is just the sidekick in Babylon proper."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5539.42,"end":5541.9,"speaker":"Fr Stephen De Young","text":"Right. To the God. Right, right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5542.06,"end":5543.5,"speaker":"Fr Andrew Stephen Damick","text":"Or his son or whatever."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5543.5,"end":5615.51,"speaker":"Fr Stephen De Young","text":"Yeah. And this. That sort of strategy and tradition you see reflected. We talked about this in Isaiah and Ezekiel in terms of the passages dealing with the fall of the devil. More on that to come here soon, where the Bible will talk about the human king as the prince, like, say, the prince of Tyre, and refer to BAAL as the king of Tyre. So that's a practice that gets picked up in the Bible to distinguish those two. Right. So Nebuchadnezzar, the first who we mentioned last time. So not our Nebuchadnezzar, but the first one in the 12th century BC, the one who's at the very tail end of the Old Babylonian empire we mentioned already. He was sort of the last gasp of trying to salvage and keep going the Old Babylonian empire as it was collapsing. And he was the last one to try and kind of reassert Babylonian culture. Things had gotten so bad by that point that the city of Babylon was sacked by the Elamites, who are a tribal group who ended up settling in Mesopotamia. But the Elamites had sacked Babylon and they stole the idol."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5616.47,"end":5620.55,"speaker":"Fr Andrew Stephen Damick","text":"Ooh, big humility from."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5622.31,"end":5660.01,"speaker":"Fr Stephen De Young","text":"The Essequila. So they made off with their God. Very embarrassing. If you're trying to keep the whole empire thing going. Not a good sign. But. But Nebuchadnezzar the first still gave it a go. He managed to defeat the Elamites and get it back. And there was a re installation. And there's a whole series of text and stuff from that reinstallation, we're sort of further aggrandizing Marduk, but they couldn't hold it together. And. And the Old Babylonian empire collapsed."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5660.25,"end":5660.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5662,"end":5705.56,"speaker":"Fr Stephen De Young","text":"So there's a few texts out there, and most of these texts, two out of three, which Meatloaf told us wasn't bad of them, we have in their Assyrian form. So be aware, that's reflected. The Assyrian attitude toward Babylon is kind of reflected in some of these. The first one and the one that folks listening may have heard of at some point is the Enuma Elish. The Enuma Elish is mainly famous because of stupid documentaries that claim that Genesis plagiarized the creation story from it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5705.56,"end":5705.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5707.08,"end":5716.7,"speaker":"Fr Stephen De Young","text":"We'll describe that creation story here. And you tell me if you think that that's just exactly like Genesis interacted with. Sure."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5717.1,"end":5718.54,"speaker":"Fr Andrew Stephen Damick","text":"Has dragons, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5718.78,"end":5719.9,"speaker":"Fr Stephen De Young","text":"Yes, dragons."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5720.14,"end":5720.5,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5720.5,"end":5802.71,"speaker":"Fr Stephen De Young","text":"It interacted with the story. Right. And inverted some things, in fact. But plagiarized is not just strong. It's ridiculous. Preposterous. But anyway, so there was a major Assyrian festival called the Akitu Festival that seems to have been taken over and repurposed by the Neo Babylonian empire during its short existence. But that is itself likely because the Assyrians stole it from earlier Mesopotamian cultures. As we mentioned, they kind of made a pastiche of Mesopotamian culture for their own culture. So in the Enuma Elish, we get a pretty good characterization of Marduk that's reflected in a lot of other smaller texts involving ritual texts and stuff that we have. Regarding Marduk, he is referred to as savage, yet relenting. So Marduk is savage. Like, he just likes killing things and wrecking stuff. That's really. He's very angry all the time, but every once in a while, he will relent. So I guess you could kind of say he's merciful in the sense that sometimes he calms down and doesn't go. You know, sometimes he just beats you half to death. Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5802.71,"end":5806.75,"speaker":"Fr Andrew Stephen Damick","text":"And then, wow, I mean, this is an abusive relationship."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5807.07,"end":5810.35,"speaker":"Fr Stephen De Young","text":"It reminds. It reminds me of my favorite old Don Rickles joke."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5812.11,"end":5813.95,"speaker":"Fr Andrew Stephen Damick","text":"I did not see that sentence coming."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5813.95,"end":5864.93,"speaker":"Fr Stephen De Young","text":"Yes. Don Rickles said. Used to say, frank, Frank Sinatra saved my life once. And they'd say, oh, really? How? And he'd say. He said, all right, boys, he's had enough. So it's that. It's that kind of thing. Right. Wow. That, you know. Yeah, he'll relent. So, like, when we find these prayer texts to Marduk, they're in the context of sort of anything bad happening in the world was because Marduk was ticked, right? Like, if to the point of someone is sick, someone is sick and maybe near death, that's because Marduk's mad and is just. He's killing them. Okay? And so literally the prayers to Marduk are like, please, for mercy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5865.89,"end":5866.21,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5866.21,"end":5868.13,"speaker":"Fr Stephen De Young","text":"Like, come on, man, he's had enough. Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5868.13,"end":5870.29,"speaker":"Fr Andrew Stephen Damick","text":"Like, please stop."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5870.61,"end":5877.94,"speaker":"Fr Stephen De Young","text":"We know you're mad, but, man, just calm down. We don't want no trouble. Like, it's all good. We'll offer you some sacrifices and stuff, Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5877.94,"end":5879.78,"speaker":"Fr Andrew Stephen Damick","text":"I was told all religions are the same."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5880.34,"end":5893.7,"speaker":"Fr Stephen De Young","text":"Yes, exactly. Yeah. So if your Christianity bears any resemblance to that, I have bad news for you. You're not a Christian. You're a pagan. Right? Like our first."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5893.7,"end":5895.38,"speaker":"Fr Andrew Stephen Damick","text":"Sorry Calvinists for the episode."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5895.46,"end":5899.62,"speaker":"Fr Stephen De Young","text":"I did not say that. You said that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5899.94,"end":5901.3,"speaker":"Fr Andrew Stephen Damick","text":"I. Well, you know."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5904.76,"end":5965.42,"speaker":"Fr Stephen De Young","text":"Right, but so, right. He is. Bardock is like a God of wrath who occasionally relents from his wrath. He is not a God of love. Right. Who disciplines and chastises. Right. As a loving father. Right. These are very different concepts of who God is. As we'll see as the story of the Enuma Elish plays out as well. So the Anuba Alish describes the creation of the world. So it starts out, there are two gods, two sort of primordial elder gods, Apsu and Tiamat. They're both dragons. They're also both oceans. Okay. Tiamat is the ocean above. This guy Apsu is the ocean below. Actually, that's reversed. Apsu is the ocean above. Tiamat is the ocean below. Like the sea. Right? Because she's chaos, primordial chaos. So Apsu and Tiamat, the heaven, the sky and the sea. Notice, no dry land."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5965.58,"end":5966.14,"speaker":"Caleb","text":"Okay."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5966.38,"end":5971.14,"speaker":"Fr Stephen De Young","text":"Do you see all the connections to Genesis? Like, there's the waters above, water below, no dry land. See, it's just like Genesis."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5971.14,"end":5972.1,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Just like that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":5972.1,"end":6005.41,"speaker":"Fr Stephen De Young","text":"Except dragons and to God. So that's. So Apsu and Tiamat fornicate and produce the other gods, the sort of regular gods. So they. They make. Make baby gods. And then Apsu decides these. These God kids of mine are making too much noise. They're super irritating. I've had enough of them. I'm going to kill them all. Do you remember that part of Genesis 1? Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6005.49,"end":6008.09,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely. It's my favorite bit."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6008.49,"end":6044.72,"speaker":"Fr Stephen De Young","text":"I'm going to kill them all. But Aya, he's back again. Gets the firstborn son of Apsu, gets wind of it and goes and kills his father first. Beautiful story. Think Kronos and Uranus. Think Zeus and Kronos. Right? We're drawing from the same wells here. Okay. And then a, of course, has a son, Marduk. Marduk decides to go and kill his grandma. Why? Because he's a savage, that's why."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6044.88,"end":6049.52,"speaker":"Fr Andrew Stephen Damick","text":"I mean, at least the Greek gods have the decency to just kill their dads and grandfathers and stuff."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6050.48,"end":6072.32,"speaker":"Fr Stephen De Young","text":"He goes after Grandma, who happens to be a chaos serpent, but still. Right, Still. It's still his grandma. But Marduk, being a savage, goes, kills Grandma, and then makes the dry land of the world out of her corpse, out of her carcass, and the drops of her blood form humans accidentally."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6073.84,"end":6074.48,"speaker":"Fr Andrew Stephen Damick","text":"Whoops."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6075.92,"end":6094.36,"speaker":"Fr Stephen De Young","text":"So, I mean, Genesis 1 almost exactly carbon copy plagiarism. Anyway, so the Enuma Elisheva then ends with marduk acquiring his 50 names."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6095.24,"end":6095.8,"speaker":"Fr Andrew Stephen Damick","text":"Ooh."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6097,"end":6123.49,"speaker":"Fr Stephen De Young","text":"And these 50 names are not just, you know, random titles of self aggrandizement, but these are the titles of other gods. And so in the text, these other gods voluntarily sort of hand over their titles. They're like, man, Marduk, that, that grandma killing was some of the best grandma murdering I ever seen. I, I, you could have my title, buddy."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6123.57,"end":6143.27,"speaker":"Fr Andrew Stephen Damick","text":"I just have to say, we have a lot of creative people who listen to this podcast. And so I'm just putting out a challenge for you creative people to take Paul Simon's there must be 50 ways to leave youe Lover and apply it to the 50 names of Marduk. Oh, and his, his grandma killing savagery. I mean, it's just got to work."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6143.83,"end":6150.31,"speaker":"Fr Stephen De Young","text":"I thought you were going for some kind of design for a Marduk Killed Our Grandma T shirt a little too."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6150.31,"end":6161.03,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I don't know. But no, I want, I want music. I want music. So putting that out there to the world. Yeah, there must be 50 ways to kill you. I don't know. But anyway."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6165.11,"end":6168.48,"speaker":"Fr Stephen De Young","text":"50 names for good old Marduk."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6168.48,"end":6173.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, 50 ways to name your Marduk. Yeah, I've got the chorus for you there."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6173.52,"end":6276.71,"speaker":"Fr Stephen De Young","text":"Right now, they just relinquish their titles, one of whom is Enlil. We'll get more to Marduk and Enlil here in a minute. But what's going on here, right, is what we talked about. So these other gods are the gods of the other cities that are in the Old Babylonian empire. So the idea is not that, like, Marduk has, you know, and Babylon therefore have enslaved these other cities. But no, Babylon is just so great, just so amazing that all these other cities want to be a part of it. And the gods of all those cities are just so amazed by how awesomely savage Marduk is. That they willingly. Right. Like, no, no, no, no, no, no, no, no. Worship him more. Right. Like he's, he's the. He's the guy. Right. So that's a way of encoding that right into this religious text. This religious text is read and recited at that Akitu festival that we mentioned. So the reading and reciting of this annual religious observance. Right. And feast related to Marduk. The second text we have that focuses on Marduk is also one associated with the Aikidu festival. This one is very clearly Assyrian edited, shall we say. That's. It is referred to as the Ordeal of Marduk. And it's all about how Marduk was sort of captured and imprisoned by the other gods, especially Asher."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6278.07,"end":6280.95,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, well, well."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6280.95,"end":6300.7,"speaker":"Fr Stephen De Young","text":"And so when the Assyrians read and enacted this story ritually every year at the Akidu festival, part of that was the subjugation of Babylon. Right. The idea that all of that stuff from old Babylon is now sort of their possession."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6301.26,"end":6306.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because what happens to the God is what's happening to the people who worship that God."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6306.7,"end":6400.07,"speaker":"Fr Stephen De Young","text":"Yeah. And there's. There's some evidence that there are some later, maybe Neo Babylonian versions of the story where Bardock ends up escaping that are probably related to the re. Ascendancy of Babylon and the Neo Babylonian empire. So why did I make that point about Enlil in particular, out of all the 50 gods? So Enlil was. If we're talking about the Old Babylonian empire or and the Neo Babylonian empire, Enlil was one of the previous most high gods who was sort of superseded by Marduk. Okay. And because Babylon came into prominence, Enlil drops off and is no longer the big guy. In Isaiah, the text we already mentioned about the fall of the devil that talks about where, where it talks about hill. Ben. Hello, Ben. Hello. Ben Shakar in the Hebrew, which famously St. Jerome translated into Latin as Lucifer, son of the morning star. Originally, hello. Ben Shakar was a reference to Enlil. So instead of how art thou fallen, O Lucifer, son of the morning. So originally, how art thou fallen? Enlil son of the. The morning star. Venus. Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6402.47,"end":6408.64,"speaker":"Fr Andrew Stephen Damick","text":"And you can see how Enlil would corrupt to Hillel. Hello. Yeah, yeah. Hello, Hello."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6411.44,"end":6487.79,"speaker":"Fr Stephen De Young","text":"So, yeah, so Isaiah there is using this Mesopotamian story. Remember he's writing in the Assyrian era. He's prophesying is. Is using this as an image of the fall of the devil in the same way that Enlil, right. Used to be the big guy who everybody thought was it now, right now is ignominy. And this is one of the big points that there's the famous verse that sometimes people, when we talk about the idea of monotheism, right, Where Isaiah says regarding Yahweh, the God of Israel, that Yahweh says, you know, before me there was none, and after me there will be no other. Right. That, that's not really a reference to polytheism there. That's a reference to the idea of succession, right? The idea that there, there wasn't another God who was the most high God before Yahweh, the God of Israel. And there's not going to be another one who comes along and displaces him. It's always an eternally him, unlike Enlil, unlike Marduk, unlike Zeus, unlike Kronos, unlike all of the baal, Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6488.19,"end":6488.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6489.21,"end":6537.59,"speaker":"Fr Stephen De Young","text":"You know, the succession myth, that's everywhere, right? So Enlil is the one who Marduk in particular displaces. And so that has that biblical relevance there. And so then last note, last text that deals with Marduk is a text called the Epic of Era. E R R A. And the Epic of Era tells this kind of weird story where this God, Era comes and kind of talks Marduk into vacating his throne and going and hanging out in the netherworld for a while. Like, hey, man, netherworld's great this season. Why don't you go take a break? Go check it out."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6537.83,"end":6538.71,"speaker":"Fr Andrew Stephen Damick","text":"It's cold outside."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6539.03,"end":6548.28,"speaker":"Fr Stephen De Young","text":"Yeah. So Marduk does, right? And while he's gone, Aera then sort of takes his throne and Era stinks at the whole God thing."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6549.16,"end":6549.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6550.04,"end":6558.08,"speaker":"Fr Stephen De Young","text":"Like everything is just bad on Earth. When Era takes over, there's like plagues everywhere and famines and stuff and everything kind of starts to collapse and fall."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6558.08,"end":6559.56,"speaker":"Fr Andrew Stephen Damick","text":"Apart straight of duties."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6560.04,"end":6592.38,"speaker":"Fr Stephen De Young","text":"And then sort of Marduk gets wind of how bad things are going and so he has to sort of come back and be like, era, come on, bro. Right? He has to like come back and take his throat again, right? And ready to get everything back in order. And what this seems to be is, it seems to be a mythic way of describing this sort of interregnum between the Old Babylonian and Neo Babylonian empire. Like, hey, where did Bardock go? Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6593.18,"end":6594.86,"speaker":"Fr Andrew Stephen Damick","text":"He was on vacation."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6596.86,"end":6688.32,"speaker":"Fr Stephen De Young","text":"And you saw how bad everything got, how much everything stunk when he was gone, right? So isn't it good that he's back? Right? You should all be extra happy. But the element here that's, that's important to point out is that is this then passage through the underworld that Marduk makes So you get a kind of chthonic Marduk here. And that's one of the things that helps because very late in the Neo Babylonian period and then in the post Neo Babylonian period. So Marduk doesn't have the same prominence under the Persians, but the Persians. And we're going to do an episode at some point here, maybe even the next one, that airs about Cyrus and the Persian empire, but the Persians took a very different approach to empire and that they let everyone in the territories they controlled keep their local traditions and religious practices. So even though Babylon is not the center of empire anymore, after the fall of the Neo Babylonian empire, Marduk worship in Babylon continues. Right. It continues to be a place. Right. Continues to practice these things down to remember Berossus, who we mentioned last time, who's writing in Greek and who is a priest, and he's a priest of Bel Marduk. Because what happens later at toward the end of the Neo Babylonian period is that Marduk and BAAL start to assimilate together."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6688.96,"end":6689.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6689.6,"end":6708.32,"speaker":"Fr Stephen De Young","text":"Bell being the form of the, the Babylonian dialect form of baal, as you can see, different vocalization, same consonants, and you get Bel Marduk. One of the things that facilitates that is the idea of a cathonic tradition associated with Marduk, just like there are cathonic traditions associated with, with baal."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6710.16,"end":6729.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, yeah, that's the end of the second half of this episode on that we have mentioned Nebuchadnezzar. So we're not completely sticking with our normal form of waiting until the third half. But, but this is the Nebuchadnezzar episode. So we're going to take our second break and we'll be right back."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6729.76,"end":6746.1,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part. Heart of the Lord of Spirits, give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6751.06,"end":6788.74,"speaker":"Fr Stephen De Young","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul disconnected from any historical reality. But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world. In St. Paul the Pharisee, Jewish Apostle to all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by DeYoung's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology by using words."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6788.74,"end":6794.5,"speaker":"Fr Andrew Stephen Damick","text":"And ideas grounded in 1st century Judaism. DeYoung hopes to unsettle commonly held notions."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6794.66,"end":6808.62,"speaker":"Fr Stephen De Young","text":"And help the reader reassess St. Paul in his historical context. Available now at store.ancientfaith.com Again, that is store.ancient faith.com we're back now with the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6808.62,"end":6823.49,"speaker":"Announcer","text":"Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6824.69,"end":6892.26,"speaker":"Fr Andrew Stephen Damick","text":"It's hard to overstate just how strange this will seem in the future. The most overexposed, over examined musician of the century who went broke clearing samples, then got rich again selling shoes, booking a famous outdoor venue to stage an opera that is more or less a straight reading of the Old Testament, during which he never appears in the flesh. It was not str speaking effective art. Too muddled and off the cuff to work as a narrative piece, too linear to read as a performance installation. Merchandise sales did not seem to be a focal point, as they have been at nearly all of West's other 2019 appearances. As the opera ended, some in the audience shuffled and texted and talked among themselves. Others held their arms in the sky in an extended moment of praise. West is not the first generational talent to pivot to religion mid career, but neither Dylan nor Prince's fits of religiosity were quite so strangely realized, so messily articulated. And that, once again, is the Rolling Stone review of Kanye West's opera Nebuchadnezzar. Did you go see that show, Father Stephen?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6892.26,"end":6896.9,"speaker":"Fr Stephen De Young","text":"I did. I am young, by the way, according to that commercial. I'm just young."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6897.38,"end":6901,"speaker":"Fr Andrew Stephen Damick","text":"The young, the young, the younger."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6902.28,"end":6907.24,"speaker":"Fr Stephen De Young","text":"I'm not de younger anymore. I'm rather old."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6909.88,"end":6911.56,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6912.12,"end":6912.6,"speaker":"Fr Stephen De Young","text":"Sad."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6913.08,"end":6915.32,"speaker":"Fr Andrew Stephen Damick","text":"So sad. Yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6917.08,"end":6918.52,"speaker":"Fr Stephen De Young","text":"Where's. Where's all the calls?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6919.32,"end":6920.6,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we had some."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6920.6,"end":6924.12,"speaker":"Fr Stephen De Young","text":"We got a lazy call screener who's just telling everybody they're off topic so he doesn't have to."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6924.12,"end":6925.8,"speaker":"Fr Andrew Stephen Damick","text":"You're off topic. You're off topic."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6926.04,"end":6926.52,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6928.65,"end":6929.21,"speaker":"Fr Andrew Stephen Damick","text":"Goodbye."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6929.61,"end":6933.21,"speaker":"Fr Stephen De Young","text":"You're fine. What gives? What gives? I'm calling people out."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6934.09,"end":6935.33,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6935.33,"end":6936.33,"speaker":"Fr Stephen De Young","text":"Somebody must have called."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6938.97,"end":6952.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep. We're not getting anything at the moment, but it's fishy. Well, you know, when we do the conference here in a week or so. Yeah, about a week. It's going to be live Q and A, so you'll get your fill."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6952.85,"end":6956.81,"speaker":"Fr Stephen De Young","text":"No, one week from now. Exactly. We will be doing the live Q and A."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6957.2,"end":6964.28,"speaker":"Fr Andrew Stephen Damick","text":"That is true. In person, in the flesh. They can throw rotten vegetables if they. Well, please don't do that?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6964.28,"end":6966,"speaker":"Fr Stephen De Young","text":"Actually, no, just throw money."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6966.48,"end":6968.24,"speaker":"Fr Andrew Stephen Damick","text":"I'm realizing that people would do that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6969.12,"end":6971.2,"speaker":"Fr Stephen De Young","text":"Preferably paper money. It hurts less when you throw."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6971.2,"end":6984.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. No, quarters, you know, paper money only. Right. So we just took a tour through Babylonian religion. How about some Bible? What do you think? This is kind of a Bible study."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6984.89,"end":6986.73,"speaker":"Fr Stephen De Young","text":"I'm dragging my feet. I'm hoping for a phone call."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6989.93,"end":6994.97,"speaker":"Fr Andrew Stephen Damick","text":"I still not see any of the call board people are. They're just too intimidated by your father."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6995.05,"end":6996.97,"speaker":"Fr Stephen De Young","text":"We have lines open, people."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":6997.61,"end":7005.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's just intimidated. Yeah. Anyway, so."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7005.85,"end":7053.59,"speaker":"Fr Stephen De Young","text":"Yeah, so. So this final. This third and final half of the show, we're going to be talking about all that stuff. We just talked about the first two halves. Places where that shows up in the Bible, other than the few that we kind of hit along the way. And there are a couple of places where the battle of Carchemish in 605 get mentioned in the. In the Bible. One of them is Jeremiah 46, verse 2, which is just kind of a bare mention that it happened. Right. But we get a little more pertinent info in 2nd Chronicles 35, verses 20 through 24."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7058.55,"end":7120.03,"speaker":"Fr Andrew Stephen Damick","text":"So in this, starting with verse 20, after all this, when Josiah had prepared the temple, Necho, there he is again. King of Egypt went up to fight at Carchemish on the Euphrates. And Josiah went out to meet him. But he sent envoys to him, saying, what have we to do with each other? King of Judah, I am not coming against you this day, but against the house with which I am at war. And God has commanded me to hurry. Cease opposing God who is with me, lest he destroy you. Nevertheless, Josiah did not turn away from him, but disguised himself in order to fight with him. He did not listen to the words of Necho from the mouth of God, but came to fight in the plain of Megiddo. And the archers shot King Josiah. And the king said to his servants, take me away, for I am badly wounded. So his servants took him out of the chariot and carried him in his second chariot and brought him to Jerusalem. And he died and was buried in the tombs of his fathers. All Judah and Jerusalem mourned for Josiah. Not a great ending for a pretty good king. One of the best, really."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7120.43,"end":7124.91,"speaker":"Fr Stephen De Young","text":"No, like he's one of the. Like he and David are like the two good kings."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7125.07,"end":7126.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, pretty much."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7126.99,"end":7170.93,"speaker":"Fr Stephen De Young","text":"Of Israel and Judah. There's some that are relatively good in various ways. Right. And some who repent and different things. Solomon repents before he dies. Manasseh, Hezekiah. But in terms of just like held up as sort of models. Josiah was kind of it for, for most of his life. He destroyed idols that had been in Jerusalem and in and around the temple since Solomon's day. He recovered the, the book of the law. All of these good things he did, but not perfect. And that ends up being how he meets his end. So what had happened is."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7172.83,"end":7173.31,"speaker":"Fr Andrew Stephen Damick","text":"Behind the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7173.31,"end":7224.81,"speaker":"Fr Stephen De Young","text":"Scenes, remember what we were talking about leading up. This is the battle of Carchemish. Leading up to the battle of Carchemish, remember the Assyrians and the Egyptians had had this pact, this non aggression pact that we mentioned, this treaty. And the Assyrians as we also mentioned, had destroyed the northern kingdom of Israel. And they had taken a shot at, remember at Judah and Jerusalem in particular and had most of their army slaughtered by the angel of the Lord overnight. Yes, that's the pre incarnate Christ who went, yeah, deal with it folks. That's how he shows up in Revelation too."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7227.37,"end":7238.65,"speaker":"Fr Andrew Stephen Damick","text":"So by the way, it looks like we are getting some calls coming in. I'm just going to see what they're all right. What they're so. Yeah, clearly. I mean this is the first time I carry call that you've actually are really like calling out the uncalling."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7239.05,"end":7255.23,"speaker":"Fr Stephen De Young","text":"Yes. So after that one attempt though there hadn't been further attempts. And the reason there hadn't been further attempts by the Assyrians to take Judah is that Judah had made certain treaties and agreements with Egypt."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7255.71,"end":7258.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, since you let me."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7258.11,"end":7258.91,"speaker":"Fr Stephen De Young","text":"Finish this and then we'll do it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7258.91,"end":7261.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay? Yeah, finish what you're gonna say. Yeah, go ahead."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7262.19,"end":7325.69,"speaker":"Fr Stephen De Young","text":"So God had told them not to do this, right? God had said, look, I'm the one who protected you from the Assyrians the last time, right? Not the Egyptians. You don't want to be making treaties with the pagan nations. Remember, that's what got Solomon into trouble in the first place. He says, you, you don't want to do this. Right? And this is going to be a problem all the way through the same. There's going to be the same problem when the Babylonians show up, right. That Jeremiah is going to have to deal with where they want to make deals with Egypt, right. Thinking Egypt will protect them. And God says no. And so this gets to the point where Josiah, because those, King Josiah, because those who is a saint in the Orthodox Church because of those agreements, he feels like he's sort of obligated by those agreements to go and fight with Pharaoh Necho, inventor of the wafer, at the battle of Carchemish. Right. I Don't know why I laughed at that a third time, but somehow it gets me every day. But."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7325.69,"end":7326.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7326.21,"end":7341.78,"speaker":"Fr Stephen De Young","text":"Like at the battle of Carchemish. And so in this passage that you read in 2nd Chronicles 35, God goes so far as to speak prophetically through the Pharaoh of Egypt to Josiah, this demon worshiper."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7342.02,"end":7342.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7343.14,"end":7377.88,"speaker":"Fr Stephen De Young","text":"So the pharaoh tells him, God is saying to you, do not come out and fight with me. Right. The guy who the agreement is with is telling him to stay home. Right. But King Josiah feels obligated, possibly by honor or something else, or fear of the. The Babylonians or the Assyrians, whatever. He goes out to fight anyway and ends up being killed in battle. And that ends up being the end of Saint and King Josiah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7378.44,"end":7379,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7379,"end":7380.28,"speaker":"Fr Stephen De Young","text":"Now who's our caller?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7380.36,"end":7393.06,"speaker":"Fr Andrew Stephen Damick","text":"All right, we have Caleb calling from. Well, I assume it's Michigan. It's Mi. And he. Caleb. Yeah. Why don't you just speak for yourself? Caleb, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7393.94,"end":7395.54,"speaker":"Caleb","text":"Hello. Hello? Can you hear me?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7395.94,"end":7397.62,"speaker":"Fr Andrew Stephen Damick","text":"We hear you. Can you hear us?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7398.9,"end":7410.58,"speaker":"Caleb","text":"I can hear you just fine. Yes, I am from. I am from the Michigan. I think, actually there was another Caleb from Michigan from one of your other episodes, but he's from the Upper Peninsula. I'm from the lower peninsula."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7411.06,"end":7413.62,"speaker":"Fr Stephen De Young","text":"You are a troll. You live below the bridge."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7414.72,"end":7415.36,"speaker":"Caleb","text":"That's correct."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7416.4,"end":7417.04,"speaker":"Fr Stephen De Young","text":"That's correct."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7417.04,"end":7418.4,"speaker":"Caleb","text":"Actually, I live next to a bridge."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7418.88,"end":7421.2,"speaker":"Fr Stephen De Young","text":"Okay. Close again."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7422.72,"end":7424,"speaker":"Caleb","text":"I take the troll toll."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7424.16,"end":7426.24,"speaker":"Fr Andrew Stephen Damick","text":"Even trolls move into the suburbs."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7426.4,"end":7429.36,"speaker":"Fr Stephen De Young","text":"Yes, there's various troll kin as well."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7429.92,"end":7431.12,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7432.88,"end":7433.68,"speaker":"Caleb","text":"Man. I don't know."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7435.52,"end":7437.04,"speaker":"Fr Andrew Stephen Damick","text":"What'S on your mind, Caleb."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7437.92,"end":7500.86,"speaker":"Caleb","text":"All right, so you. There may not be a much of an answer to this, so if you don't have it, just don't worry about it. But on an episode, I'll make something up. Don't remember because I've been. This sounds good. There's. I just. I've been listening to, like, dozens, more than dozens of episodes. I think I finally caught up on the entire show up to this point from starting, like, a few months back on one of the episodes a while back, the response to it, different question. Father DeYoung, you mentioned that you had there. You mentioned off candidly, like, not in any kind of detail that the Bronze Age collapse might have something to do with the Tower of Babel, like, as well. I don't know. I was curious as to what that was. And I guess now that we're talking about Babylon, there might be. And I think you mentioned the Bronze Age collapse earlier, so maybe there's that. I don't know if you have any further explanation of that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7501.58,"end":7515.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, very on topic. I'm actually trying to get Father Stephen to do a whole episode on the Bronze Age collapse. Maybe we will. Yeah, so. So, yeah, I mean, lay it out, Father. What's, what's the deal with Babel and the Bronze Age collapse?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7515.9,"end":7713.42,"speaker":"Fr Stephen De Young","text":"So what I have suggested is that the Tower of Babel story in Genesis 10 and 11 is the story of the Bronze Age collapse from a spiritual perspective. So what, what do you have in the narrative in Genesis? You have the story of how after the flood, right? So we have the things that happened before the flood that brought about the flood, right? Involving the Nephilim, involving all those things, so evil and the wickedness. And then Genesis tells us that after the Flood, this begins again. The, the, the named person who seems to be one of the new giants is Nimrud, which etymologically is the same name as the Mesopotamian God Ninurta. So there's a connection to Mesopotamia there. This global civilization that's described then, that is building towards the same level and kinds of evil that were going on before the flood, culminates with the building of this tower, this ziggurat, in a place called Babel Bab Eli, Babylon. And that tower never gets finished because God comes down and disperses the nations, breaks up that world civilization and disperses it. Okay, so that's the story we get told in Genesis. Historically, when we're talking about the Old Babylonian empire, we have a worldwide empire that's facilitating worldwide trade named Babylon that was building a ziggurat that they never managed to finish at a Menankee that claimed to be the repository, claim to still possess the quote unquote wisdom from before the flood, to be recreating the pre flood civilization they claimed that ruled over by people identified biblically, the Amorites, as giants, who then have their global civilization smashed and never finished their tower. Right? So it seems to me there's a very, very direct correspondence between the story Genesis is telling and what we know historically happened to Babylon in the Bronze Age collapse and all of these very direct points of connection. But what Genesis is doing is it's giving us the spiritual perspective on this historical events, that it wasn't just happenstance, it wasn't just climate change or the migration of peoples or mismanagement or whatever that caused the fall, that it was God's doing to prevent the world from becoming as evil as it had once."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7713.42,"end":7713.74,"speaker":"Fr Andrew Stephen Damick","text":"Before."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7716.14,"end":7784.3,"speaker":"Fr Stephen De Young","text":"And that therefore the loss of the Old Babylonian empire, just like the loss of the pre flood civilization was not this great loss to humanity and this thing to be mourned and this thing to attempt to recreate over and over again in the future, but rather something that was terrible and horrible and was destroyed in judgment by God. And this is why Babylon still has the resonance it does in. In the New Testament as the apostles are looking at Rome and seeing Rome is old Babylon happening again, which is the pre flood civilization happening again. Right. All of this has happened before, and all of this is happening again. Right. It's Babel. They call it Babylon. Right. They call Rome Babylon. St. Peter does. St. John does. Right. So, yeah, that's what I was alluding to and suggesting. I think fleshed out here a little more and very on topic because we were kind of talking about that."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7784.3,"end":7789.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, very much, Very much. So does that. Does that clear things up for you, Caleb?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7790.07,"end":7790.71,"speaker":"Fr Stephen De Young","text":"It does."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7791.19,"end":7794.87,"speaker":"Caleb","text":"I have, like a slight amendment. It may not be an answer to this one either. So just."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7796.31,"end":7798.79,"speaker":"Fr Andrew Stephen Damick","text":"Is that right? Go ahead for it. Go for it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7799.83,"end":7810.23,"speaker":"Caleb","text":"What do you think about, like, the. The whole Gods confusing their language, that sort of thing? Is there some kind of particular correlation you can think of there, or."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7811.27,"end":7825.62,"speaker":"Fr Stephen De Young","text":"Well, that's the. So that's about the dividing of the nations. So like when Deuteronomy 32 refers back to the Tower of Babel, they talk about when God divided the nations. And one of the things that divides the nations is that they all have different languages."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7827.3,"end":7828.82,"speaker":"Caleb","text":"Yeah, that makes sense, I guess."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7828.98,"end":7841.38,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. So, all right, thank you very much for calling. We're going to take another call. We have Caesar calling from the frozen, frozen north up in Alberta."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7841.73,"end":7845.41,"speaker":"Fr Stephen De Young","text":"So are we going to be pedants and say his name should really be pronounced Kaysar?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7845.65,"end":7849.81,"speaker":"Fr Andrew Stephen Damick","text":"Caesar? I don't know. How do you pronounce it? Caesar? Welcome to Laura Spears podcast."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7850.69,"end":7855.65,"speaker":"Caleb","text":"Hello, Father. Thank you for taking my call. Yes, Caesar. I mean, depends on the language."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7855.65,"end":7862.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Caesar in German or whatever, or Kaiser in Latin. Kaiser."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7862.29,"end":7874.91,"speaker":"Caleb","text":"Kaiser in Latin. Yeah, yeah, but Caesar or Cesar in French or. It's all good. I know, I know. I know myself. So I'll recognize you calling me Cesare."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7879.79,"end":7880.91,"speaker":"Fr Andrew Stephen Damick","text":"So what's on your mind?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7882.03,"end":7973.29,"speaker":"Caleb","text":"Yeah, thank you for taking my call. Just, I mean, this subject is not an easy one, so I'm pretty sure you don't have a straight answer for it, but I was like, continually. When I read the Bible, it's always this pattern of the victim played. Those who have been colonized, in this case the Jews, they play the victim and then vice versa. And when I, when I read History. It's always when someone gets colonized, they play the victim. And that victimization lasts for like, hundreds and hundreds of years within the community. And it seems like they don't get over it until they get their revenge. And I'm like, okay, like, I was reading Hosea today, and yes, all this criticism over the harlotry, but then I'm like, it's. The pattern will come anyways. Like, they're gonna play the victim, and it's gonna last for hundreds and hundreds of years until it's returned to the. Like, they can dig their revenge somehow. And like, I'm like, okay, but I don't know, like, what do you think about. Like, it's. It's this constant pattern that's like this patient that God has over his people. I'm not sure. Like, I don't know. Do you have any say to say about that?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":7974.25,"end":8164.46,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the. The pattern that we see in the Old Testament is that. And God says this to Israel, basically, things are going to be okay as long as you're faithful to me, as long as you obey the Torah, right? And it says this in the text. When they become disobedient to that God brings judgment. And the point of the judgment is not to, you know, beat them over the head because he's mad. It's to chasten them and bring them back to faithfulness. Right? And so certainly along the way, you get lamentations that things have gone very badly and so forth. But, you know, there are moments when Israel returns to faithfulness under leaders like Josiah that we just, just mentioned. So, you know, what we should bring from that is not okay. You know, this is what I. This is my opinion of the nation of Israel in the Old Testament, rather. Right? But. But rather that when. When bad things happen in our own lives, whether it's overwhelming or, you know, the relatively minor things that happen to most of us, that our response to that should be, okay, this is God chastening me so that I will come to repentance, right? So, you know, it's important when we read the Scriptures to. To look at them in and ask the question, how do I use this that I'm reading for my repentance? Not how do I use this that I'm reading for my opinion about somebody else, but. But rather for my own repentance. You know, like, even when. So, like, you know, we see that pattern in the Old Testament, but even, for instance, when the city of Constantinople fell to the Ottoman Turks in 1453, the response that you See, from church leaders at the time was God has brought this upon us because of our sins, right? So they took it as repentance. And there are, you know, laments and so forth that are written, amazing stuff written in Byzantine chant to express this at the time. And so that's the proper response is, is to receive any kind of disaster or suffering or whatever it might be as being a, frankly, a gift from God for our repentance. Now, that doesn't mean that suffering is good in and of itself. It's not. It's just that we tend not to repent unless we're experiencing suffering. That's just who human beings are. So, so yeah, I mean, that's what we should draw out of that. You know, it. If you want to just ask the question of, okay, well, how do, what do we think about what Israel is doing at these various points? You know, when they're, when they return to faithfulness, that's good. And when they don't, then it's an example for us of how not to be. So. Yeah. Father, you have anything you wanted to add to that?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8164.46,"end":8391.89,"speaker":"Fr Stephen De Young","text":"Yes, specifically on the angle of sort of the revenge of the colonized. This is why the canonical Bible, right. Is stands opposed to the traditions of zealotry that evolved. And we did, we did an episode, the third episode we did on the history of Israel where we talked about the Hasmoneans, we talked a lot about this. So the Judea, the Judeans, right, are the victims of the colonial violence of the Greek Seleucids. They respond with the Maccabean revolt and a lot of violence and revenge taking and establish an independent Judea. But part of them establishing an independent Judea, such that the Greek Seleucids don't reinvade, is they make peace treaties, including with Rome. And that treaty with Rome ends up getting them colonized by Rome, right. And the oppression starting all over again and becoming worse. And then by the time you get to the New Testament, you have zealot groups that are opposing Rome, trying to take revenge, trying to liberate themselves through violence. And two of the two of Christ's 12 disciples were members of Zealot groups. One of them, St. Simon the Zealot, is a saint, the other one, Judas Iscariot, definitely not. That's Paul. Paul was a zealot. That is zealot phase. He got radicalized early on and then repents of it. Because what does that lead to? Well, what does it lead to in the first century? It leads to the destruction of the Temple, the destruction of Judea, the expulsion of the Jewish people. Right, completely from Jerusalem and the surrounding area. So the perspective of the canonical scriptures is that responding to colonial violence with revenge taking just continues a cycle of violence and revenge taking. Whereas as Christ says, when you don't repay evil with evil, but you overcome evil with good, then it is transformative. Right. That the Hasmonean way, right, the zealot way is a way that just, you know, you live by the sword, you die by the sword. It's just a way that creates more violence and destruction in the world. And so the counter examples, right, we've got first Maccabees, but you've also got second Maccabees about the Maccabean martyrs, right, who stay true and faithful to God to their deaths. They're not willing, they're not willing to kill. They're willing to die. The apostles were not willing to kill. They were willing to die. Christ himself was willing to die. Right. And so that is the way that the canonical scriptures describe our response to colonial violence or any oppression, anything of that sort is a willingness to die for what is true and good and beautiful, not a willingness to kill for it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8394.21,"end":8396.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Does that make sense?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8396.57,"end":8399.17,"speaker":"Caleb","text":"Caesar, follow up just one thing."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8399.65,"end":8400.05,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8402.91,"end":8465.68,"speaker":"Caleb","text":"So the other sub question to that is those who are willing to go on the road of repentance instead of playing the victim for hundreds of years from generation to generation and try to put like anger within the family or those who are willing to repent and adapt and just get away with all that anger and all that, they have no choice but to kind of adapt to the colonizer culture in a sense as a, as a option B. And that's also a problem by itself because then they have to kind of deal with other problems. And then if they don't want to go A, neither B they want to stay like in between. They will. Yeah, like it's going to be like a self isolation in a sense. And yeah, it will lead to martyrdom, which is extremely difficult to, to be in that position. But yeah, that's my final thought on it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8466.48,"end":8482.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Martyrdom is, is a heroic path. But yeah, that's the, that's what was required of the Maccabean martyrs. Right. They would not literally eat pork. They would not, you know, they would not hew to Greek Hellenic culture."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8482.83,"end":8628.45,"speaker":"Fr Andrew Stephen Damick","text":"And so yeah, and I mean there's, there's also some ways, there's also it like, it also kind of depends. Like to repent is to be faithful to what God has commanded. Right. And you can be faithful to what God has commanded in many different cultural, you know, expressions. So a good example, I would say from history is that, you know, when the Middle east was almost completely Christian. Right. There are many different cultures that were represented there. You had Greek speaking culture, you had Syriac speaking culture, Persian speaking culture, et cetera, et cetera. Eventually you get the, the Muslim invasions that come in and take over the whole region. And then, you know, there had been some Arabic present, but eventually Arabic becomes the language almost everywhere. And the Christians that are there adopt the Arabic language. There's nothing sinful about that, not remotely. You can be absolutely a faithful Christian and speak Arabic. I know many, many. And yet at the same time, they did not, I mean, some did apostatize, but you know, there are faithful Christians who remained faithful to that. So they did not take on all of the culture of those who had conquered them. They, you know, took on the language and maybe some customs. I'm not an expert in those things. But you can be faithful in the midst of that experience. And there are some kinds of adaptations that are perfectly fine and then there's some that are not perfectly fine. Right. So one has to be discerning and not simply say, well, I have to be com. It's not just A or B. You know, one can be faithful within the midst of whatever is going on. And if martyrdom is required, then martyrdom is required. But it's also possible to be, you know, the leaven that leavens the whole lump. God willing. Christianity changed the Roman Empire, pagan empire, demon worshiping empire, and Christianity did that by being faithful even in the midst of persecution. And, and Christians had many cultures, even in the early Roman Empire, and yet remained faithful to Christ. So it is, it is possible, although not easy, for sure. So thanks very much for calling. We're going to take one more call."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8628.77,"end":8629.85,"speaker":"Fr Stephen De Young","text":"One last little note."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8629.85,"end":8631.01,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, go ahead, Father."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8632.29,"end":8655.34,"speaker":"Fr Stephen De Young","text":"Victimhood is an attitude one chooses to take upon themselves. I know people who have faced legitimate persecution and hardship and difficulty and hatred, etcetera, in their life who do not view themselves or portray themselves or conduct themselves as if they were victims."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8655.98,"end":8658.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8658.3,"end":8693.9,"speaker":"Fr Stephen De Young","text":"On the other hand, a week or so ago, I saw a video in which the pastor of a very large church in North Carolina was talking about how conservative Christians are marginalized and hated. And I'm like, bro, you're a, you're a wealthy conservative Christian man in North Carolina. Okay. You are one of the least persecuted people on earth."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8693.9,"end":8694.54,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8694.54,"end":8724.2,"speaker":"Fr Stephen De Young","text":"Like, yeah, you have like all the cards Bro, like, yeah, you're fine. Okay. You are not a victim. Okay. But you can. It doesn't matter. You could take that upon yourself. Yeah, okay. Like a conservative Christian pastor, Protestant pastor in North Carolina is sort of like a white woman in a Starbucks inside a Target. Okay. Like, wow, you are in your place. Okay. You are in your."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8724.84,"end":8725.32,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8726.16,"end":8727.48,"speaker":"Fr Stephen De Young","text":"This is your revenue that's going to."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8727.48,"end":8728.72,"speaker":"Fr Andrew Stephen Damick","text":"Cancel you, Father Stephen."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8731.44,"end":8732,"speaker":"Fr Stephen De Young","text":"Sorry."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8732.48,"end":8733.6,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, all right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8733.76,"end":8735.68,"speaker":"Fr Stephen De Young","text":"They hate me because I tell them the truth."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8736.48,"end":8756.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is that why? Okay. All right, we're going to take one more call. And we have Adrian calling from Illinois. And Adrian wants to know, Father, about what you refer to as the quote unquote, pre incarnate Christ. So, Adrian, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8757.93,"end":8791.32,"speaker":"Caleb","text":"Good afternoon, Fathers. I updated my question a little bit because I actually went and opened the Bible and read it. And I don't know if this is like a Berenstein. Berenstein Bears thing, but I'm not seeing angel anywhere in Exodus in the Orthodox study Bible. So I don't know if this is some bad information, bad translation I was given for several years and I just never went back and corrected it, or if there's something else I'm. I'm missing here. I'm sure you guys can obviously enlighten all of us a little more."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8791.64,"end":8793.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay, lay it out, Father."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8794.52,"end":8796.72,"speaker":"Fr Stephen De Young","text":"Exodus. What passage are you looking at it?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8796.72,"end":8804.12,"speaker":"Fr Andrew Stephen Damick","text":"Exodus. He's talking about the. The. Are you talking about the killing of the firstborn? Is that what you're referring to, Adrian, or something?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8804.36,"end":8807.91,"speaker":"Fr Stephen De Young","text":"I was talking about the killing of the ascendant Assyrian army. Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8807.91,"end":8809.67,"speaker":"Caleb","text":"Oh, well, I was way off."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8809.67,"end":8811.35,"speaker":"Fr Stephen De Young","text":"Where they laid siege to Jerusalem."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8811.35,"end":8811.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8811.71,"end":8812.87,"speaker":"Fr Stephen De Young","text":"With Sennacherib."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8813.19,"end":8815.07,"speaker":"Caleb","text":"Yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8815.07,"end":8818.79,"speaker":"Fr Andrew Stephen Damick","text":"Although Christ does. I mean, Christ does show up in the Exodus."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8818.95,"end":8824.87,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I mean, there is an angel there, right? The angel in whom God places his name."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8826.71,"end":8832.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's fighting against the Egyptians directly. And then when they're at the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8832.51,"end":8845.66,"speaker":"Fr Stephen De Young","text":"When they're at the Red Sea. Yeah, that guy who was on before us was talking about this, I think, where they're at the Red Sea, getting ready to cross the cloud and the angel go behind them. Like between the Israelites and Pharaoh's forces."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8846.14,"end":8846.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8846.78,"end":8855.5,"speaker":"Fr Stephen De Young","text":"So there is an angel there. Right. Who we identify with the pre incarnate Christ. But that's not what I was talking about earlier. What I was talking about earlier was the Assyrian siege of Jerusalem."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8857.74,"end":8859.26,"speaker":"Fr Andrew Stephen Damick","text":"Does that clear things up, Adrian?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8860.06,"end":8863.61,"speaker":"Caleb","text":"I jumped to the more common, you know."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8864.17,"end":8864.65,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8865.45,"end":8869.29,"speaker":"Caleb","text":"Sunday school story then, as opposed to what we're actually talking about."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8870.33,"end":8875.05,"speaker":"Fr Andrew Stephen Damick","text":"It's okay to. It's okay to admit that. You mean, you know the movie the Ten Commandments with Charles and Heston."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8875.05,"end":8884.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. They haven't done a good movie about the Assyrian siege of Jerusalem, to be fair. Or any movie. I would say, like, that would be."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8884.85,"end":8888.33,"speaker":"Fr Andrew Stephen Damick","text":"Like NZ 17 + +."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8890.17,"end":8892.01,"speaker":"Fr Stephen De Young","text":"Well, the question is what you do with the rat."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8893.73,"end":8894.37,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8895.33,"end":8923.74,"speaker":"Fr Stephen De Young","text":"Because there's there was a. So what it says in the text is that the angel Lord came there at night this year camp and wipes everybody out. Right. Josephus, when he's talking about that episode in Antiquities, says that rats came up from the city like the sewer and, like. And ate all the bow strings."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8925.82,"end":8926.1,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8926.1,"end":8977.17,"speaker":"Fr Stephen De Young","text":"The Assyrian troops so they couldn't make war. And so the interesting hypothesis that a lot of biblical scholars have is that what happened is because we also read that when they're laying siege to Jerusalem, they stopped up all the. They stopped up the water supply. And so when they stopped up the water supply, rats Right. Came up out of the. The drainage system. And there was a plague outbreak. And so the way that God killed the Assyrians in the camp was through the plague, like the bubonic plague or something similar. So. But that. So it's what you do with the rats in the movie."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8977.49,"end":8979.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8979.57,"end":8988.37,"speaker":"Fr Stephen De Young","text":"So do you just go for the CGI angel of the Lord taking everybody out, or do you. Rats. Thousands, yes. Anyway."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8989.09,"end":8996.39,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thanks for calling, Adrian. Yeah, yeah. All right, well, let's continue on our journey."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8996.47,"end":8998.95,"speaker":"Fr Stephen De Young","text":"I am sated by our interactions with the."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":8998.95,"end":9002.87,"speaker":"Fr Andrew Stephen Damick","text":"All right, all right. Thanks for calling, everybody."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9005.59,"end":9092.06,"speaker":"Fr Stephen De Young","text":"Back to Nebuchadnezzar in the Bible. I've got rid of all of the white women who are listening and all of the Protestant pastors in North Carolina. So next place Nebuchadnezzar comes up, of course, is in second kings or fourth kingdoms, chapters 24 and 25. And that, of course, is the story of Nebuchadnezzar coming up and coming in and wrecking Judah and destroying the temple and capturing Jerusalem and starting to deport people into exile. And there it's portrayed pretty clearly as Nebuchadnezzar is coming as sort of the agent of God's judgment against Judah for their faithlessness, sending them into exile. But also, it's important in Second Kings that Second Kings portrays it as, hey, you guys brought this on yourselves. Sort of in the way I was talking about to the caller about the Hasmoneans making that deal with Rome that backfired on them real good. In Second Kings 20 verses 12 through 19, it talks about how King Hezekiah, super genius, invited the Babylonian delegation to come and see all the cool treasures he had in the temple."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9092.38,"end":9095.74,"speaker":"Fr Andrew Stephen Damick","text":"I know. Check out my sweet treasures, guys."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9096.86,"end":9136.86,"speaker":"Fr Stephen De Young","text":"Yes. After which Isaiah points out that he's an idiot and tells him, you realize as a result of this, the Babylonians are going to come back and take all of this. Right? Like you, you see, you see that coming, right? And are you ready for how that passage ends? Hezekiah is happy because Isaiah tells him that the Babylonians are going to come back and do this after he's dead. So he's just happy. Well, there'll be peace in my lifetime."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9137.02,"end":9138.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sorry, kids."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9139.9,"end":9235.7,"speaker":"Fr Stephen De Young","text":"So Hezekiah, not the sharpest tool in the shed, right? As Second Kings 20 presents him, at least he's wicked and repentant, but through it all, not the best leader, right? From just a practical perspective. So Nebuchadnezzar also, of course, has a prominent role, albeit in the background, as a looming threat in the book of Jeremiah. And that is because he is looming as a threat. He is preparing to invade Judah and lay siege to Jerusalem. And, and Jeremiah, being the true prophet of God, is informed by God that Nebuchadnezzar is going to win, that he is going to conquer, he is going to destroy the city, and he's going to do that because of the wickedness of Israel, chapter 21, for example. Right. Jeremiah is informed of that and pronounces that Jeremiah 25,9 is another place where Nebuchadnezzar is mentioned, where Jeremiah makes clear that this is again God's judgment coming upon the people of Judah, and that Nebuchadnezzar is the instrument of that judgment. It gets even more explicit in Jeremiah 27, verses 1 through 8, where Yahweh, the God of Israel, literally calls Nebuchadnezzar his servant."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9236.1,"end":9320.7,"speaker":"Fr Andrew Stephen Damick","text":"Again, a demon worshiping God king. Yes, Just have to point that out again. Okay, so this is what it says, starting with verse 1. In the beginning of the reign of Zedekiah the son of Josiah, king of Judah, this word came to Jeremiah from the Lord. Thus the Lord said to me, make yourself straps and yoke bars and put them on your neck. Send word to the king of Edom, the king of Moab, the king of the sons of Ammon, the king of Tyre, and the king of Sidon, by the hand of the envoys who have come to Jerusalem, to Zedekiah, king of Judah, give them discharge for their masters. Thus says the Lord of hosts, the God of Israel, this is what you shall say to your masters. It is I, who by my great power and my outstretched arm have made the earth with the men and animals that are on the earth, and I give it to whomever it seems right to me. Now I have given all these lands into the hand of Nebuchadnezzar, the king of Babylon, my servant. And I have given him also the beasts of the field to serve him. All the nations shall serve him and his son and his grandson until the time of his own land comes, then many nations and great kings shall make him their slave. But if any nation or kingdom will not serve this Nebuchadnezzar, king of Babylon, and put its neck under the yoke of the king of Babylon, I will punish that nation with the sword, with famine, and with pestilence, declares the Lord, until I have consumed it by his hand. Man, that's probably hard to swallow for."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9320.7,"end":9342.92,"speaker":"Fr Stephen De Young","text":"A lot of people, to say the least. Right? So not only is he speaking to Zedekiah, the king of Judah, but he invites emissaries from Edom, Moab, from all the neighboring Ammon, Tyre and Sidon, the Phoenicians. Right. All the neighboring countries to see this, too. God has him put a yoke on."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9344.04,"end":9344.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9345.48,"end":9347.4,"speaker":"Fr Stephen De Young","text":"Physically, Jeremiah puts on a yoke."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9349.62,"end":9349.78,"speaker":"Caleb","text":"And."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9349.78,"end":9392.18,"speaker":"Fr Stephen De Young","text":"Comes and delivers this message, like wearing this yoke. Right. That either you can. That God has decided to give Nebuchadnezzar for a certain period of time, all of these lands, and so he's going to have them. So you guys can either surrender them to Nebuchadnezzar and we can do this the easy way, or you can try and resist Nebuchadnezzar, which will be resisting God, and therefore you will get wrecked. Right, Right. Sword, famine, pestilence. Right. That's. It's. It's all going to go very badly. Okay, so as you mentioned, this was received somewhat poorly."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9393.54,"end":9393.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9394.9,"end":9411.77,"speaker":"Fr Stephen De Young","text":"By the people. And part of what's going on here in this whole section of Jeremiah is Jeremiah is of course telling the truth. Right. It is a true prophet of God. But there are these other people, these false prophets who claim to be prophets of Yahweh, who are saying the exact opposite."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9412.01,"end":9412.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9413.45,"end":9463.98,"speaker":"Fr Stephen De Young","text":"Okay. And saying what people want to hear. So of course the king and everybody else are believing those people who are telling them what they want to hear, not Jeremiah, who's telling you what they don't want to hear. And they're labeling Jeremiah as a traitor. Right. Why are you saying they're going to win and they're going to beat us. You're on their side, right? You're a Babylonian shill. You're paid off by Nabu Soros to spread this propaganda, right? So they're pinning all this on him. And so in chapter 28, right, the next chapter, Hananiah, one of these bogus prophets, takes the yoke and breaks it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9464.86,"end":9465.58,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9467.26,"end":9503.57,"speaker":"Fr Stephen De Young","text":"Yes. And says, thus says Yahweh, the God of Israel. So he's got some chutzpah, this Hannah. In two years, I will break the yoke of Nebuchadnezzar. And, you know, you will be victorious and everything will be fine. Right. And so then in verses 1 through 14, this unfolds, sort of the end of that verse 12, 13, 14, Jeremiah says, oh, no, no, no, no. The yoke of Nebuchadnezzar is a yoke of iron. It don't snap so easy now, like, you're done, Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9504.05,"end":9504.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9505.73,"end":9588.44,"speaker":"Fr Stephen De Young","text":"And so in the rest of Jeremiah, things don't go so well for Jeremiah. They end up throwing him down a well. And then he gets taken to Egypt against his will. Shades of Joseph. But. But yeah. So Nebuchadnezzar there is the sort of looming threat. Ezekiel. So Ezekiel is prophesying within the context of exile. So Jerusalem is already done. He's in one of the early deportations to Babylon. But he issues prophecies in chapter 26 against Ty, and in chapters 29 and 30 of Ezekiel against Egypt, in which God is sort of threatening both Egypt and Ty with Nebuchadnezzar. Right. That Nebuchadnezzar is sort of presented as this weapon that God has in his arsenal to use to execute judgment against these wicked nations and kings. But of course, if we're talking about Nebuchadnezzar, the place where Nebuchadnezzar is the most prominent in the Bible, the place where he shows up in person and people interact with him and he interacts with them is primarily the book of Daniel."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9589.24,"end":9590.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9590.52,"end":9841.44,"speaker":"Fr Stephen De Young","text":"Because Daniel has a personal relationship with Nebuchadnezzar. That's because in exile, he's become a young official of the Babylonian court. And so that sort of starts in Daniel, chapter two. Daniel, chapter two is where Nebuchadnezzar has had a dream and he wants it interpreted. But Nebuchadnezzar is no dummy. So he goes to all of his diviners and astrologers and all priests and the other usual suspects in Babylon, and they say, oh, yeah, we can interpret your dream for us. Tell us about Your dream. And he's like, no, why don't you tell me what my dream was and then tell me what it means? Yeah, so he's no dummy, right? He's like, if you guys can really tell all this stuff, then you should know, right? Like whatever I foresaw, you should already know about. From the stars or from entrails or whatever it is you're reading, you should already know about it, right? Anybody can come up with some interpretation if I tell it to them, right? Make something up. And of course, so none of them can without hearing it. But Daniel is given a prophetic vision by God. And so he comes and not only tells Nebuchadnezzar what his dream was, he then interprets it. And this is the dream, of course, where Nebuchadnezzar saw the statue like the, the idol of a king of an emperor. And the, the pieces of it as you descend from the, from head to foot, are made of different substances. So it goes from gold to silver to bronze to iron, to the feet being iron mixed with clay, right? And Daniel interprets this as a succession of world empires with the neo Babylonian being the gold. Then you get the Persians, then the Greeks, then Rome, and then finally a weakened Rome. And then a stone is carved out, not by human hands. That stone is thrown and smashes all of those empires, smashes the statue at the point of the iron mixed with clay, and the stone then grows and becomes a mountain that fills the earth like the mountain of God. So this stone, not made with human hands, that becomes the mountain of God, the kingdom of God, the rule of God through all the earth is the Messiah, right? So this is a messianic prophecy that's telling us that guess what? He's going to come in the Roman, during the Roman Empire. And this is, this is how Jewish folks read it at the time. This is one of the reasons there was so much Messianic fervor in the first century AD is they were understanding a bunch of the prophecies in Daniel to be pointing to that time period as the time when the Messiah would come. And Christians of course, held on to that interpretation of those prophecies. Other non Christian Jews held on to other interpretations of those prophecies, but this is certainly one of them. So this is a place where again, by virtue of doing this, Nebuchadnezzar is impressed with Daniel's wisdom, spiritual insight, etc. And so he finds Nebuchadnezzar's favor, he advances in his court, he gets some leeway as do his three friends of various names, Rashak and Benny. Yeah, Shadrach, Meshach and Abednego, if you want their Babylonian names, Azarias, Misael and what's the third one?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9843.12,"end":9847.04,"speaker":"Fr Andrew Stephen Damick","text":"Ananias, Azariah, Mishael."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9847.44,"end":9996.1,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so those three friends that become important in chapter three, which again involves Nebuchadnezzar, the famous story that we read on Holy Saturday of the Tri Utes, where a giant idol is constructed of Nebuchadnezzar. Because remember, the king is not only the king and the high priest, he's also divine himself and so is an object of worship. He receives worship due to his divinity and being seen as sort of, in this case, an embodiment of Naboo, the son of Marduk. And so the command is given that, you know, we're going to set it up and at a certain time when a group of musical instruments are played, it's very repetitious, as you know, if you've heard it read on Holy Saturday, enlisting the instruments over and over again. When all those instruments play, when the signal pray plays, when the signal is given, everyone's going to bow and pray and offer worship and glorification to the the image of Nebuchadnezzar. And of course Daniel's three friends will not do this. And so when they refuse to do this multiple times, they are thrown into a superheated furnace, heated so high that the people who throw them in die from the heat, collateral damage. But they of course are preserved and are joined in the furnace by a fourth man. Here's our pre incarnate Lord Jesus Christ again who is with them in the flames. And the flames are to them as a dewy breeze, as one of our hymns say. I do have to say I miss the old translation of this story that we used to use in the Antiochian Archdiocese. I think it was in Hapgood on Holy Saturday for one main reason. That was the translation of the list of instruments."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9996.58,"end":9998.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, it included sack butts."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9998.02,"end":9999.54,"speaker":"Fr Stephen De Young","text":"It included the sack butt."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":9999.7,"end":10000.5,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10001.06,"end":10024.83,"speaker":"Fr Stephen De Young","text":"And if you have never been around 10 year old altar boys at the end of a holy week when they're all tired for them, for these people the word sackbutt is the most hysterical thing. It's pretty great that has ever been said. And it gets said like five times. And the trigon during the reading and those, the kids are falling out, they're almost falling out."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10024.83,"end":10031.79,"speaker":"Fr Andrew Stephen Damick","text":"I mean, sackbutts are basically trombones sort of, which is a pretty funny instrument."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10031.95,"end":10040.67,"speaker":"Fr Stephen De Young","text":"For a 10 year old boy, especially not on a lot of sleep. Sackbutt is just the greatest word ever composed by humanity."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10041.15,"end":10041.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10043.79,"end":10072.17,"speaker":"Fr Stephen De Young","text":"Right. And so Nebuchadnezzar here though, you get this element of him being this pagan king who is himself an object of worsh, considers himself divine, and you get his sort of reticence because these are people who have found favor with him in the past. But the duties of kingship, you can't just cut someone slack. Right. It's not a thing you could do. Remember what happened when the Assyrian emperor started to show any kind of weakness whatsoever?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10074.09,"end":10077.81,"speaker":"Fr Andrew Stephen Damick","text":"I mean, Marduk, you know, chills out once in a while. I mean, come on."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10077.81,"end":10116.81,"speaker":"Fr Stephen De Young","text":"Yeah, once in a while. Very rare. Mostly savagery. Savage. Yeah, savage sword of Marduk. So, and then the passage that we won't spend a ton of time on this one, we are going to read through it and comment a little. But the other big one, and this is major for Nebuchadnezzar because he is the protagonist really of this chapter is chapter four, which is the story of his temporary madness. The reason we're not going to spend a ton of time on it now is I think it's our second Halloween episode."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10117.93,"end":10120.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, second or third maybe."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10121.37,"end":10169.46,"speaker":"Fr Stephen De Young","text":"We spent a lot of time on this passage talking about Nebuchadnezzar, this. So we're gonna, we're gonna go back to it, we're gonna touch on some things here. But if you wanted, like deep, deeper dive on his madness of the idea of madness in general, how that connects to figures like Enkidu in the Epic of Gilgamesh as sort of a madman or a wild man. You can go and, and read all, or hear all that there, or read it in the transcript. I think there's a transcript. But you could also hear our dulcet tones as we describe it to you and say. Right. 57 times. Right, that's. But for now, we'll move kind of quickly in chapter four, starting around verse four. We've dropped some verses out here too, so we're going to be kind of just moving through it, noting some pertinent things. Yep, yep."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10169.46,"end":10230.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I, Nebuchadnezzar, was at ease in my house and prospering in my palace. I saw a dream that made me afraid as I lay in bed. The fancies and the visions of my head alarmed me. At last Daniel came in before me. He who was named Belteshazzar, Baal to Shazar, after the name of my God, and in whom is the spirit of the holy Gods. And I told him the dream, saying, o Belteshazzar, chief of the magicians. Because I know that the spirit of the holy gods is in you and that no mystery is too difficult for you. Tell me the visions of my dream that I saw and their interpretation. The visions of my head as I lay in bed were. I saw and behold, a tree in the midst of the earth. And its height was great. The tree grew and became strong, and its top reached to heaven and. And it was visible to the end of the whole earth. Its leaves were beautiful and its fruit abundant, and in it was food for all. The beasts of the field found shade under it, and the birds of the heavens lived in its branches, and all flesh was fed from it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10231.31,"end":10232.83,"speaker":"Fr Stephen De Young","text":"So I saw there a second."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10232.91,"end":10233.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10234.51,"end":10278.87,"speaker":"Fr Stephen De Young","text":"So Daniel, like Shadrach, Meshach, and Abednego, is given, because he's functioning as a court official, is given a Babylonian name, which, as Father Andrew mentioned, is a. Is a theophoric Babylonian name that has bell in it. Right. Baal. And. And in the text, Nebuchadnezzar says Belteshazzar after the name of my God. Right. And so this is written in the first person, as you may have noticed. Like, this is the story about Nebuchadnezzar is being told by Nebuchadnezzar as it's presented in Daniel chapter four. And so we're getting these things from his perspective. So he sees Daniel as the chief of the magicians. Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10278.87,"end":10279.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10279.35,"end":10289.67,"speaker":"Fr Stephen De Young","text":"Of all those advisors, of all those magi. Right. All those wise advisors, he's the. The most prominent of them. Why? Because he was able to interpret that other dream and even tell him what it was."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10290.31,"end":10290.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10290.75,"end":10322.26,"speaker":"Fr Stephen De Young","text":"Right. And so he knows that he has divine spirits within him who are in touch with him. Right. So we're getting this filtered, right. Through Nebuchadnezzar's sort of pagan worldview. Right. But part of what we're going to see unfold is about how maybe that worldview gets changed and. Right. Shifted. And so he starts, just. This time, he doesn't make Daniel tell him the dream. He starts telling him about the dream and about this tree. Okay, now verse 13."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10322.83,"end":10329.31,"speaker":"Fr Andrew Stephen Damick","text":"All right. I saw in the visions of my head as I lay in bed, visions of sugar plums dancing."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10329.31,"end":10329.79,"speaker":"Fr Stephen De Young","text":"Sorry."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10330.35,"end":10338.83,"speaker":"Fr Andrew Stephen Damick","text":"And behold, a watcher, a holy one came down from heaven. A lot of people get excited when we mention the watchers."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10339.07,"end":10349.15,"speaker":"Fr Stephen De Young","text":"Well, yeah, this is the passage in the canonical scriptures. Right. So of course, the watchers are in the book of Enoch, but that mentions watchers as a class of angels."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10349.38,"end":10393.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, go ahead. Yeah. He proclaimed aloud and said, thus chop down the tree and lop off its branches, strip off its leaves and scatter its fruit. Let the beasts flee from under it and the birds from its branches, but leave the stump of its roots in the earth, bound with a band of iron and bronze amid the tender grass of the field. Let him be wet with the dew of heaven. Let his portion be with the beasts in the grass of the earth. Let his mind be changed from a man's, and let a beast's mind be given to him, and let seven periods of time pass over him. The sentence is, by the decree of the Watchers, the decision by the word of the holy ones to the end that the living may know that the Most High rules the kingdom of men and gives it to whom he will and sets over it the lowliest of men."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10393.97,"end":10482.27,"speaker":"Fr Stephen De Young","text":"Okay? So notice here. This is described as the decree of the Watchers, right? So this is God's angelic counsel, right? This is presented as they have ruled, like, as. As a group, they have ruled on this. That they're going to issue this judgment upon the tree which spoilers. Right? Is Nebuchadnezzar himself, right? And the Neo Babylonian empire that he personifies, right? That he sums up in his person, right? That these things are going to happen to him. And why? The purpose is that the living, so not just Nebuchadnezzar, not just the Israelites, the living, all people, right? Would know that it is the most high. God knows. Most High is the title that angelic beings use to refer to Yahweh, the God of Israel, that he's the one who rules the kingdom of men and gives it to whom he will, meaning Nebuchadnezzar has power and authority over the world because Yahweh, the God of Israel, has given it to him. Not Marduk, not He seized it for himself through his own shrewdness, etc. Think about what Christ says to Pontius Pilate. You would have no authority over me if it had not been given to you from above, right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10486.03,"end":10579.69,"speaker":"Fr Andrew Stephen Damick","text":"All right, continuing on verse 19. Then Daniel, whose name was Belteshazzar, was dismayed for a while, and his thoughts alarmed him. The king answered and said, belteshazzar, let not the dream or the interpretation alarm you. Belteshazzar answered and said, my Lord, may the dream be for those who hate you and its interpretation for your enemies. The tree you saw, which grew and became strong so that its top reached to heaven and it was visible to the end of the whole earth, whose leaves were beautiful and its fruit abundant, and in which was food for all, under which beasts of the field found shade, and in whose branches the birds of the heavens lived. It is you, O king, who have grown and become strong. Your greatness has grown and reaches to heaven and your dominion to the ends of the earth. And because the king saw a watcher, a holy one, coming down from heaven, this is the interpretation of king. It is the decree of the Most High which has come upon my lord the king, that you should be driven from among men, and your dwelling shall be with the beasts of the field. You shall be made to eat grass like an ox, and you shall be wet with the dew of heaven. And seven periods of time shall pass over you till you know that the Most High rules the kingdom of men and gives it to whom he will. And as it was commanded to leave the stump of the roots of the tree, your kingdom shall be confirmed for you from that time that you. From the time that you know that heaven rules. Therefore, O king, let my counsel be acceptable to you. Break off your sins by practicing righteousness and your iniquities by showing mercy to the oppressed, that there may perhaps be a lengthening of your prosperity."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10581.45,"end":10705.07,"speaker":"Fr Stephen De Young","text":"Oh, so, yeah, so notice that this same judgment is referred to as the judgment of the watchers, the judgment of the Most High, right of God himself and heaven, right? Notice also the subtle shift, right? So that the angel in his dream said, watcher's dream said, so that the living may know, Daniel says that this. This madness that's going to come upon you will last until you know, you, Nebuchadnezzar, know, right, that it's the Most High who rules the kingdom of men and gives it to whom he will. Okay? So this language of the decree of the watchers, of the council, being the decree of God himself, being the decree of heaven, sort of the whole government, right? This is all kingly language that God is using. God is here. Try speaking to Nebuchadnezzar in language that a king would understand, right? But the idea here is Yahweh, the God of Israel, is the great king, right? And you, Nebuchadnezzar, are a vassal to whom the great king, the Most High, has given a certain dominion for a certain time, right? And perhaps you ought not think more highly of yourself than that. And so then notice Daniel adds at the end of what Father Andrew just read, right? When he's giving him counsel, he's giving him advice. He says Break off your sins by practicing righteousness and your iniquities by showing mercy to the oppressed, right? He doesn't just say, hey, here's a list of sins you're committing. Stop."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10708.38,"end":10708.62,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10709.5,"end":10755.86,"speaker":"Fr Stephen De Young","text":"He says, here are the things that you need to do as opposed to what you've been doing, right? And when you do those things, when you become a good king, right? Then you as a good king will be a true vassal. Because a true vassal of the great king represents the great king perfectly in his rule, right? You're like a vicar, right? On earth. And so you need to represent, you need to be an image of the rule of the Most High, of the great king, right? And then this judgment would not be necessary. So go ahead, continue."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10756.74,"end":10771.19,"speaker":"Fr Andrew Stephen Damick","text":"All this came upon King Nebuchadnezzar. Immediately the word was fulfilled against Nebuchadnezzar. He was driven from among men and ate grass like an ox, and his body was wet with the dew of heaven till his hair grew as long as eagle's feathers and his nails were like birds claws."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10772.63,"end":10775.43,"speaker":"Fr Stephen De Young","text":"So he at the end, like full Howard Hughes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10778.71,"end":10827.06,"speaker":"Fr Andrew Stephen Damick","text":"At the end of the days, I, Nebuchadnezzar, lifted my eyes to heaven and my reason returned to me. And I blessed the Most High and praised and honored him who lives forever. For his dominion is an everlasting dominion, and his kingdom endures from generation to generation. All the inhabitants of the earth are accounted as nothing. And he does according to his will among the host of heaven and among the inhabitants of the earth. And none can stay his hand or say to him, what have you done? At the same time, my reason returned to me. And for the glory of my kingdom, my majesty and splendor returned to me. My counselors and my lord sought me, and I was established in my kingdom. And still more greatness was added to me. Now I, Nebuchadnezzar, praise and extol and honor the king of heaven. For all his works are right and his ways are just, and those who walk in pride, he is able to humble."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10830.66,"end":10876.6,"speaker":"Fr Stephen De Young","text":"Notice that line. He does according to his will among the hosts of heaven and among the inhabitants of the earth, right? So he's not only a God to the humans, right? The little humans on earth, but he is a God to the gods who Nebuchadnezzar's been worshiping, right? They are to him as humans are to them, right? And what we have here ultimately is a confession of repentance and faith from Nebuchadnezzar, which is never in Scripture taken back because we don't, we don't really see him again after this in Scripture."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10876.76,"end":10877.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10877.2,"end":10887.88,"speaker":"Fr Stephen De Young","text":"So there's, there's not any inkling in the canonical scriptures that he turned his back on this somehow and forgot this lesson or became a pagan again?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10888.2,"end":10892.37,"speaker":"Fr Andrew Stephen Damick","text":"May. Yeah. Might we see him in the kingdom of heaven? Who knows? Who knows?"}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10892.93,"end":10906.93,"speaker":"Fr Stephen De Young","text":"And, and keep in mind, right, what's required of someone who's not a king of Israel. Right. He didn't have to go get circumcised to keep kosher. Right. Like that's not expected of him."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10908.37,"end":10908.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10909.01,"end":10913.25,"speaker":"Fr Stephen De Young","text":"This is the kind of thing that's expected of him to be a righteous Gentile."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10913.49,"end":10997.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think, you know, and we've covered a pretty huge swath of history here and some, you know, world sweeping stuff. I think that as, as we look at the life of Nebuchadnezzar and then all the ways that he is used in the Bible, you know, he's a kind of symbol of God's judgment. He's the tool of God's judgment. He himself is judged by God. And a lot of this, a lot of the themes here, of course, are about rulership and sovereignty and, you know, conquest and all this stuff and power and might. I think one of the things that I take away from a lot of this is that a big piece of the Christian life is about truly knowing that, that God is the Lord, that He is the Lord of all. And so many sins I think we commit because we don't know that deep down, like sins that we commit in private that we think no one's going to see. I mean, there's a lot of warnings in the Bible about people who think."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":10997.97,"end":10998.33,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11000.09,"end":11404.42,"speaker":"Fr Andrew Stephen Damick","text":"God is Lord of all. He sees everything you do. He knows every thought that you have. He knows every time a thought that's suggested to you by a demon that you welcome it in, that you entertain it. He sees all the things that you do. And if you had a sense of his presence with you, probably a lot less likely to sin. That's certainly true for me. But then also it's not just the sins that you commit because you think no one's watching, but it's also the failures to trust in the love of God. Right? God is love. It says this in the scripture. Everything that we see him doing in the stuff that we just talked about is his provision for the repentance, the salvation of every person involved. And a lot of the sins that we see Israel commit are about not trusting God. We're going to take care of this ourselves. Whatever it might be, whether it's victory in war, whether it's, you know, hunger and thirst, whatever it might be, things go badly when you don't trust in God, which includes obeying the things that he said. Like, we saw how it kind of ended badly for even St. Josiah. Good, good king. When he decided to go out to battle, when that was not what God told him to do. And in our own lives individually, but then also in the lives of our communities, it is trust in God that should drive much of what we do. Not that long ago, I actually had a conversation with a bishop, and he was asking me my opinion. I was kind of surprised. He was asking me my opinion about a number of practical matters in the church. And there's one point where I said, probably wanting to sound wise, well, it's difficult to get money for this or that. And he said, if we need money for something, we'll just ask God for it and he'll give it. Which really struck me because this is not, you know, this is a bishop with many years of experience. Many, many years of experience. That doesn't sound to the world like a practical thing to say, but this is actually how God operates. If something is what God wants and we trust in him and we are faithful to him, he'll give. What it is that's needed may not be what we think is needed, but it is what is needed. And all of this comes within an acknowledgment and not just acknowledgement. Like, okay, I agree that that's true, but a deep knowledge that God is the Lord, that God is the Lord. And this is different from the way that pagans saw their gods as lords. You know, like Marduk, as we saw, is this violent maniac most of the time. And so acknowledging him as Lord is about like, please don't hurt me, you know, And a lot of religion, frankly, goes that way, some of it even going by the name of Christian. But that's not the God of the Scriptures. That's not the God of. Of Abraham, Isaac and Jacob the Father, the Son and the Holy Spirit. That's not our God. Our God loves us and is always, always, always acting in love for us. And so His Lordship, his sovereignty in our lives is always so that we might be saved. It would have been perfectly logical for his judgment of Nebuchadnezzar to crush him, to destroy his kingdom and that. That would be it. But instead, what you get is. I mean, it's tough. What he goes through is tough. Very difficult. Living essentially like a beast in madness for a long time. But it's for his repentance, it's for his salvation. God didn't. It doesn't want to just, you know, it's not about punishing like you did a bad thing, Nebuchadnezzar, so you know, you got what you deserve. Rather, it's about bringing him to the point where we left him, where he's acknowledging the sovereignty of God and acknowledging that he is. He is the true king of everything and that Nebuchadnezzar is not the king of the universe. Notice the last thing he says now. I, Nebuchadnezzar, praise and extol and honor the king of heaven. In other words, it's not me, Nebuchadnezzar, I'm not the king of heaven. I'm not the king of the universe, the king of heaven. He's the one who does everything that he wills among the hosts of heavens, among the inhabitants of the earth, and no one can call him to account. There are many ways, I think, to motivate oneself in the Christian life, many ways to be motivated towards faithfulness. This is one. This is one of them. To know that God is the Lord, that He is ruler over all, that he is almighty, as we say in the creed, and that he loves us and he's exercising that lordship for us, for us. In this judgment of Nebuchadnezzar, he's described as this great tree that shelters and provides food and all this kind of stuff. And that's not bad. That's what a king should be, right? And so if Nebuchadnezzar is that properly, because he's returned to that position, then he is that because he's imaging who God is. God the king, overall, the one who provides everything, the one who is himself, the tree of life, Right? So that's why the road to that. Because it might be difficult, you know, to really know deep down that God is king of all and Lord of all. But the road to that, I think. I think the surest road is the road of. Of gratitude. Now, the good thing is the scripture never says, in everything, feel thankful."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11406.18,"end":11406.46,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11406.46,"end":11477.87,"speaker":"Fr Andrew Stephen Damick","text":"Rather in everything, give thanks, which is an action you can take no matter what your emotional state is. You don't have to feel that God is Lord. You don't have to feel thankful. You might, and it's nice, you know, if you do. But to give thanks, to acknowledge, to confess with our lips that God is Lord, and to give thanks to him in the ways that are proper, both with our words, in our. Our worship and our actions. Because if you. If you know that God is Lord and that he, everything belongs to him, then that means you'll also be generous. And you can be generous no matter how you feel, because it's an action that you take. So we exercise that gratitude, we exercise that generosity. These are really, in some ways, they're kind of the same one thing. And in so doing, then we come to know that he is our king and that he does truly love us and exercises his kingship for us. So that's what I have to say about Nebuchadnezzar today."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11480.75,"end":11484.03,"speaker":"Fr Stephen De Young","text":"Many ways to motivate yourself and 50 ways to leave your lover."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11484.91,"end":11486.59,"speaker":"Fr Andrew Stephen Damick","text":"50 ways to name your Marduk."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11486.83,"end":11488.99,"speaker":"Fr Stephen De Young","text":"That's what we call in the biz, a callback."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11489.39,"end":11489.87,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":11490.91,"end":12015.55,"speaker":"Fr Stephen De Young","text":"So if you believe certain reformed Baptists with YouTube channels, we. We Orthodox are a mean lot because we think everyone who's not an Orthodox Christian is going to hell. And probably a lot of Orthodox Christians too, because we're just Ron teaching that works righteousness and such folk will not listen to our protestations otherwise either. But I think what we see in Nebuchadnezzar is one of the basic biblical building blocks of the actual teaching and tradition of the Church on this subject, which is that not only is it possible that God is working in the lives of people outside of the church, and by the church, I mean the Orthodox Church just got to be honest and above board here. Not only is it possible, not only is it likely, not only is it just true that he is working in the lives of people outside the Orthodox Church, he is working in the lives and hearts and souls of every human being. Every human being has a relationship that could probably be described as personal in some sense with God and with Christ. There is no one who doesn't. It may not be a good positive relationship, but it's a relationship, right? They may be resisting what he's trying to do in their life, maybe resisting his voice, may be resisting his calls to repentance, to faithfulness, maybe suppressing the knowledge of him from their minds and their hearts and their souls, but he's still there. He's still there. They live in his creation. They live in his world. To me, I think that's a through line through everything we talked about tonight. Whether it's these events, these sort of world events of a bygone world that are very similar to events that play out over and over again in our world. Whether it's Nebuchadnezzar himself by his own first person testimony, whether it's him as a figure looming on the world stage, God is involved in all of this. God is active in all of this. Scriptures are just revealing the ways in which he's active and acting in and through these events. How it is that he is related to them, how it is that he is related to Nebuchadnezzar. And in that final section we read Nebuchadnezzar coming to be aware of his relationship with the God who created him and everything else. This is true for everyone. There is no one of whom it is not true. Even a giant, even the most despicable person you'll ever meet, God still desires that that person should not perish, but turn and live. God is still calling that person to repentance and faith. As I've pointed out in Bible studies, even when Christ is calling Herod or the Pharisees, he calls Herod literal slurs in the original Greek, calling the heresies, snakes, whitewashed tombs, viper, everything under the sun. Even when he's doing that, Christ is still talking to them. He's still trying to get their attention. He's still trying to get them to listen, trying to get them to repent. If he didn't care, if he didn't have a relationship with them, he wouldn't be talking to them. He just let them perish and their hypocrisy and their sins and their wickedness. But he doesn't. He still talks to them and he uses whatever kind of rhetoric he needs to try to get through to them. And why this is important to know. It's not just to affirm. Important to affirm so that, oh, those people online will know that. No, actually us Orthodox people are nice people after all. The reason it's important for us to know is that this gives us an important window to an aspect of what love is, what it means to love another person, especially people who we might not find innately lovable in terms of how they, as a person in their present state and I as a person in my present state, do or do not interface well, do or do not get along well. What it means, ultimately, from one perspective at least, to love a person is to find the ways in which God is working in their life, the ways in which God is speaking to them, the things that God is calling them to and join in that call, support that movement of God in their life, encourage it, nurture it, do everything we can to facilitate that person following the calling of God in their life. We see again and again in the scripture, whether it's Nebuchadnezzar the emperor of the world, or Cornelius the centurion in Acts, or Naaman the leper. Right? That even though these people have very limited knowledge of who the true God is and what he wants from them, when they gain a little, they're faithful to it and God gives them more. In the case of Nebuchadnezzar, he sends Daniel to facilitate that name in the leopards. The Prophet Cornelius at St. Peter for a whole bunch of people you've met will meet. No, it's you. You're the one who's there in that person's life to give them the more, to help continue the process. And it's in the process of you participating in that. God doesn't need you for it, but you participating in that, you being the one who God works through to continue to reach that person and transform them, is how you're going to find and work out your salvation. That's part of how he's going to speak to you and part of how you're going to answer the call that he's giving to you, how you're going to experience the change that he's bringing to your life. Nebuchadnezzar was this big important person, but Daniel was maybe more important because he was important to Nebuchadnezzar. You don't have to be a big important person. You can be some kid in exile, you can be some Galilean fisherman is probably illiterate. You can just be you. But you can be a part of the most important things that are happening in the world right now, which aren't the things everybody's talking about on social media. Isn't the things that's going that are going on in the news channel. It's what God is doing in the lives of people. So that's. That's my commentary."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12016.83,"end":12017.47,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12017.63,"end":12019.07,"speaker":"Fr Stephen De Young","text":"Good old Nebuchadnezzar."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12019.39,"end":12046.73,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you very much for listening, everybody. If you didn't happen to talk to us tonight live, we'd still like to hear from you. You can email us@lordofspiritscientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity, you need help to find a parish, go to orthodoxintro.org join us for."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12046.73,"end":12056.37,"speaker":"Fr Stephen De Young","text":"Our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern. 4pm Pacific Riddle Me this my brother. Can you handle it? Your style to my style? You can't hold a candle to it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12057.41,"end":12071.67,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, you can join our discussion group, Leave those ratings and those reviews, but share this show with a friend, family member, or an enemy who might love it, hate it, or, I don't know, be indifferent to it."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12072.23,"end":12083.03,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. Steal from the rich and I'm at Robin Banks Given to the poor and I always give thanks."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12083.67,"end":12085.91,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless you all."}
{"episode_id":"LOS - #125 - 2025-09-25 - Ye Wrote an Opera -","start":12089.92,"end":12126.97,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
