{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":0.48,"end":65.15,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the. The union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":65.79,"end":94.51,"speaker":"Fr Andrew Stephen Damick","text":"Hey. Greetings, giant killers and dragon slayers. You are listening to the 125th episode of the Lord of Spirits podcast. Why would you put yourself through this? Nevertheless, I am Father Andrew Steenman Damick, and with me is the only person who has ever broadcast live on ancient faith radio from the inner sanctum of his water closet, the one and only father Steven DeYoung. And together we are still tired from the Lord of Spirits conference. At least I am."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":94.83,"end":108.83,"speaker":"Fr Stephen De Young","text":"Speak for yourself. Having escaped with my life, I find myself enervated, though my spirits are somewhat dampened by once again having to go on after the inane ramblings of that poltroon who they keep putting on before us."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":110.59,"end":116.31,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true. I don't understand how it is that that guy is still. I mean, I told him to remove."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":116.31,"end":128.07,"speaker":"Fr Stephen De Young","text":"That show, but I mean, it's cheap content, but other than that. Yeah, yeah, it's good filler. It's like episodes of Ridiculousness on MTV2. Right? Like, you just. We got a hold of the schedule, you know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":128.07,"end":135.51,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I forgot about MTV2. Man, MTV. Let's celebrate 15 years of music and."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":135.51,"end":138.35,"speaker":"Fr Stephen De Young","text":"Then 30 years of something, right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":138.67,"end":159.44,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. The M doesn't stand for anything. But we are live. We are live. And. And starting in the second half of the show, if you're joining us live, you can call us at 855-237-2346. If you make it past the great gatekeeper Mike Massagetan Degan with your on topic question, we might even talk back. Or we could just listen."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":159.68,"end":164.88,"speaker":"Fr Stephen De Young","text":"If your question's A little off topic. Just lie. Wow."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":165.68,"end":168.56,"speaker":"Fr Andrew Stephen Damick","text":"See, that's because there's no deontological ethics on this show."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":168.56,"end":171.04,"speaker":"Fr Stephen De Young","text":"Right. Can't even do that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":172.33,"end":182.25,"speaker":"Fr Andrew Stephen Damick","text":"We are continuing in the theme of ancient empires that show up in the Bible. And tonight it is all about Persia. So quick, poll. Father Stephen, Cats or rugs?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":183.53,"end":187.29,"speaker":"Fr Stephen De Young","text":"Those who are in the know know that the correct answer to this question is actually chandeliers."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":188.09,"end":190.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Ah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":191.21,"end":193.13,"speaker":"Fr Stephen De Young","text":"My peeps in LA know what I'm talking about."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":193.93,"end":195.13,"speaker":"Fr Andrew Stephen Damick","text":"Bold. Bold."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":195.29,"end":197.13,"speaker":"Fr Stephen De Young","text":"Channel 18. Farsi programming."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":197.52,"end":223.12,"speaker":"Fr Andrew Stephen Damick","text":"Wow. You know, when I lived on Guam, we got Los Angeles TV because this was back in the late 80s, and we would get. There was a Los Angeles cable station that would record their. All their programming and then ship it over to Guam on VHS tapes and they would all get played a week late. So, like, when you're opening up the Disney Channel schedule, you always add like +7. So it's like being old calendarists, you know, except for cable tv, there was."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":223.12,"end":225.16,"speaker":"Fr Stephen De Young","text":"No Internet to spoil things for you. So it was."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":225.16,"end":246.36,"speaker":"Fr Andrew Stephen Damick","text":"There was not. There was not. There was very few, really, like satellite live tv, but a lot of people were absent from school on Super Bowl Monday. So that was one thing that we did have. But I. I mean, I remember watching, you know, ads for kcop. Los Angeles. Yes. There on Guam, which I'm sure you did too. So there we go. Our. Our childhood's connected in this."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":246.68,"end":247.4,"speaker":"Fr Stephen De Young","text":"Well, they had this."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":249.01,"end":249.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":249.73,"end":270.29,"speaker":"Fr Stephen De Young","text":"But, yeah, there was a channel 18 that was like the catch all channel for Middle Eastern and Asian immigrants. It was a uhf. For those of you old enough to know what that even means anymore. Aside from the Weird Al Yankovic movie, that was a UHF channel. So it was on the dial that went like, brap when you turned it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":270.37,"end":271.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":271.53,"end":284.14,"speaker":"Fr Stephen De Young","text":"And then you had to fiddle with the fine tuning forever. Channel 18 would have, like, a block of Farsi programming and then like a block of, like, Korean programming and then a block of Chinese programming."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":284.14,"end":316.3,"speaker":"Fr Andrew Stephen Damick","text":"Like our local alcohol distributor, beer distributor right here in Emmaus is owned by a Persian guy. And one time our mutual friend Dr. Jenkins went in there and said, are you Persian? He says, yes, yes, I am. He says, are you Muslim? He says, yep, I am. And he says, and you. You own this place that sells alcohol? He says, we don't sell alcohol here. We sell heavenly beverages. I guess I should have added that to my poll. Heavenly beverages as well."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":316.54,"end":322.62,"speaker":"Fr Stephen De Young","text":"Ask him if he has a chandelier. Trust me. Trust me on this one. Ask him if he has a chandelier."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":323.02,"end":334.12,"speaker":"Fr Andrew Stephen Damick","text":"Someone in the YouTube chat claims that Bart Ehrman flew over his house. I don't know what that means, but did you see his video? I don't know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":334.84,"end":342.12,"speaker":"Fr Stephen De Young","text":"I'm trying to decide if this person is suffering from psychosis or if he just lives near Bart Ehrman."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":342.2,"end":345.88,"speaker":"Fr Andrew Stephen Damick","text":"Another person claims that Bart Ehrman is walking his dog in their neighborhood."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":347,"end":351.56,"speaker":"Fr Stephen De Young","text":"So he's now like Elvis or Bigfoot or something. We're gonna have Bart Ehrman sighting."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":351.8,"end":354.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it's totally a thing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":355.32,"end":362.04,"speaker":"Fr Stephen De Young","text":"Okay. Well, I hope he steers clear of certain of our listening audience."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":362.12,"end":364.68,"speaker":"Fr Andrew Stephen Damick","text":"So tell us all about ancient Persia, Uncle Steve."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":367.24,"end":370.12,"speaker":"Fr Stephen De Young","text":"All about. We're mostly talking about one particular guy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":370.28,"end":374.2,"speaker":"Fr Andrew Stephen Damick","text":"Actually, and particularly how Persia connects with the Bible."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":374.68,"end":586.19,"speaker":"Fr Stephen De Young","text":"Right. And so this episode is a little different than the last one where we were talking about Nebuchadnezzar in that, as we talked about that time, Nebuchadnezzar kind of was the Neo Babylonian Empire. Right. Like, yeah, his dad started the thing rolling. And yeah, there was a quick succession of emperors over a handful of years after him, the last of which we're going to meet this evening. But he was kind of it. And the Neo Babylonian Empire, frankly, wasn't around for that long. So we kind of talked about the whole thing. Whereas the Persian Empire, the original Persian empire, the one we're going to be talking about tonight, is started by the guy who we're mainly talking about tonight, Cyrus the Great, but actually goes on for a fair spell until Alexander the Great shows up. And with the exception of a couple bits in Daniel and obviously the events of Esther, there's not a ton of Old Testament literature from the Persian period per se. Most of the Old Testament books that you find in, for example, Orthodox and Roman Catholic Old Testaments and Oriental Orthodox Old Testaments actually come from the Greek period. So while the Persian period is longer than the Neo Babylonian period, there isn't as much to talk about once you get past Cyrus. So Cyrus, who we're talking about tonight, we're going to talk about him. We're going to talk about the founding of the original Persian empire because there's another one later. But we're not going to talk about its whole history. We're not really going to talk about his successors because what we're aiming at, which of course we won't get to until the third half, is the importance of Cyrus in the Bible. And Cyrus is important in the Hebrew Bible. Pretty much as important, I would argue, as Nebuchadnezzar, despite differing historical situation. So, yeah. So roughly what we're doing tonight is like what we did last time, but roughly it's going to differ in some respects. That said, so the Persian Empire we're talking about, like we said, is the, the original Persian Empire, the first one, which is known as the Achaemenid Empire. We'll get into why here in just a second. The other Persian Empire that you will read and hear about is the Sassanid Persian Empire. The Sassanid Persian Empire is post Christian period. So it rises up when the eastern part of the Roman Empire starts showing weakness and it sort of comes into being and that's where you get the wars. Like if you were in church last month now already for the Feast of the Exaltation of the Cross and you paid attention to like the Cynic Sarian and stuff and it talked about the Byzantine emperor or the Roman emperor, sorry guys, fighting the Persians. That's the assassinated Persian. That's the later versions."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":586.35,"end":589.95,"speaker":"Fr Andrew Stephen Damick","text":"That's the like third to seventh century ad."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":590.91,"end":609.07,"speaker":"Fr Stephen De Young","text":"Yeah. So that's post Christian era. And they get wiped out basically by the Muslims. But tonight we're talking about the original one, Achaemenid Empire that gets wiped out by the Greeks. So key difference was Alexander a Greek."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":609.07,"end":611.99,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, just wanted to mess with a certain."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":611.99,"end":621.51,"speaker":"Fr Stephen De Young","text":"You're going to start this Macedonia stuff, aren't you? There you go. Just stir that pot. Call in and tell Father Andrew what you think about that Macedonian Greeks."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":622.43,"end":628.27,"speaker":"Fr Andrew Stephen Damick","text":"I'll just go home and you can listen to some very angry people rant at you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":629.39,"end":686.76,"speaker":"Fr Stephen De Young","text":"So, so we've, we've talked about. Because we're talking about the Neo Babylonian Empire last time and how they kind of took over the Assyrian Empire in its waning days. And of course we know a little bit about the Greeks. Obviously we think about the Roman Empire every day, if you're like me. But the Persian Empire historically is in a very different category than the Assyrian and Neo Babylonian empires. This is an empire in a different sense. So both the Assyrian and Neo Babylonian empires are empires in the true sense of the term empire, which means they consist of conquered territory. So they are empires. But especially in the Assyrian Empire, there wasn't a lot of infrastructure. Like the taxation was more like extortion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":687.48,"end":687.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":687.8,"end":701.8,"speaker":"Fr Stephen De Young","text":"Was your city needs to send this much tribute or we're going to come and, you know, raze you to the ground kind of thing. Not sort of an advanced system of taxation. There was not a lot of emphasis on establishing trade and commerce routes among the Assyrians."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":702.32,"end":702.76,"speaker":"Fr Andrew Stephen Damick","text":"I mean just."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":702.76,"end":704.16,"speaker":"Fr Stephen De Young","text":"That was just not their thing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":704.96,"end":713.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah, I'd call it Kleptocracy but that's not quite what that word means. But it was an empire based on stealing and pillaging and whatever."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":713.28,"end":824.31,"speaker":"Fr Stephen De Young","text":"Yeah. Now Nebuchadnezzar wanted, clearly had aspirations to more. Right. I mean the Neo Babylonian Empire, its whole sort of raison debt was we're going to re establish the Babylonian empire of old, of the Bronze Age. And we've talked about that original Babylonian empire, the level of global commerce it facilitated and all of that. Right. And that's what Nebuchadnezzar wanted to recreate. But the Neo Babylonian empire fundamentally wasn't around long enough and did not have any talented people after Nebuchadnezzar to actually pull that off or even really begin to get there. But the Persian empire that Cyrus is going to found is going to accomplish that at its height, at its furthest extent, which is under Darius or if you're being fancy in British, Darius the Second. I prefer Darius because, you know, we don't want to call the guy Hootie the, the that farthest extent. Under Darius the second, the Persian empire controlled Egypt and Ethiopia, in Africa, all of Asia Minor and into the Greek coast and the Balkans, in Europe, all the way across what's now Afghanistan and Pakistan, up into what's now Uzbekistan and Kazakhstan, all the way into India. Not up to India, into India, the western chunk of India. And this was, you know, we're Talking about the 6th century and the beginning of the 5th century BC that they controlled this territory."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":824.55,"end":836.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if anyone wants to know, see that on a map, there is a good map on the Wikipedia article of the Achaemenid Empire and you can just see how much territory it was. I mean it's pretty, pretty huge."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":837.47,"end":839.15,"speaker":"Fr Stephen De Young","text":"Yeah. Like the portion of the globe."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":839.39,"end":843.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like all the way Libya and Egypt. Yeah. I mean it's crazy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":844.11,"end":939.08,"speaker":"Fr Stephen De Young","text":"So that that level of territorial control is even beyond the first Babylonian empire and isn't going to be seen again until sort of the peak of the Roman Empire. Alexander's going to conquer pretty much all of that, but he's not going to ever rule it and it's going to get chopped up by his successors. But as impressive as the amount of territory is the fact that the Persians set up an administrative state that actually governs all that bureaucracy, trade routes, they're moving things around. Right. And so that level of infrastructure again is the kind of thing that hasn't hadn't been seen in the world since the original Babylonian empire. And again you got to go to the Romans doing stuff like building the aqueducts and this kind of thing before you see this kind of thing again. So, as promised. Why is it called the Achaemenid Empire? So it's called that because the dynasty that Cyrus the Second, Cyrus the Great was a part of was started by Achaemenis. So it's literally just named after a dude, and he is this founder figure who, as each generation goes past, looms larger and larger to the point that even though most of the later emperors are not going to be biologically related to him, they're all going to want to prove that they're biologically related to him."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":939.56,"end":955.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Apparently his name in Persian might be pronounced something like Hexamanish, which I don't know. That sounds a little bit more metal than the Achimenes, which is definitely a Hellenized version of the name."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":955.48,"end":956.44,"speaker":"Fr Stephen De Young","text":"Yeah. Helenized version."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":956.44,"end":962.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yes. Ach. Don't name your kids that, though, people."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":963.08,"end":965.72,"speaker":"Fr Stephen De Young","text":"Yeah, no, this guy's a pagan. This is not."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":966.12,"end":967.08,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":967.16,"end":968.84,"speaker":"Fr Stephen De Young","text":"Not even that prominent of a pagan."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":969.56,"end":970.76,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":971.68,"end":1005.63,"speaker":"Fr Stephen De Young","text":"So he becomes this kind of legendary figure, like a Greek hero or like a demigod or what are the gibborim. Right. He becomes one of those figures who sort of looms large as the one with the royal blood. Right. That gets passed down. And so he was the king of Parsifan, which was the sort of main city in the region of Pars on the Iranian plateau, Pars being where, like, Parthian and Persian come from, and Parsi."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1006.11,"end":1008.75,"speaker":"Fr Andrew Stephen Damick","text":"For those who want to go down that particular rabbit hole."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1010.35,"end":1132.61,"speaker":"Fr Stephen De Young","text":"And so he then, though. Even though he is that, he then becomes. There's a larger city in the region called Anshin. He became the king of Anshin also, and then King of Anchin, until Cyrus ii, Cyrus the Great, King of Ancin, becomes the title that the dynasty uses. I know that doesn't sound impressive to us because we don't know where Anchin is. Anson mounts, plays Captain Pike. But he was not alive yet. But the King of Anchin becomes sort of their primary title. And so the sort of succession goes from a fellow named Tyspes to Cyrus. Who's Cyrus the First? Not our Cyrus yet. Cyrus I to Cambyses the First his son. And then Cambyses the First his son is Cyrus ii, who becomes Cyrus the Great. And there's a bunch of debate about whether that was his given name originally or whether he took that name when he became king or some kind of title or. Yeah. How all that worked. But either at his birth or at the point where he becomes, you know, prince regent or what have you. He's named after his grandfather, Cyrus the First. Yeah. And so his family, up to him basically are the rulers of the Iranian plateau. To their immediate west is the kingdom of the Medes. So remember last time we talked about one of the ways that Nabonidus. Not Nabonidus, Nabopolasser. We'll get to that. Nabopolasser. Another one of those Naboo theophorics. Nabopolassar, who was Nebuchadnezzar's father. Right. One of the ways that he was able to overcome the Assyrians was by making a treaty with the king of the Medes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1134.26,"end":1134.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1134.58,"end":1299.07,"speaker":"Fr Stephen De Young","text":"So the Medes, who had been operating sort of as mercenaries, sensing weakness, they started sacking Assyrian cities. And so Nabopolasser cut this deal with them to fight with his army. And that's how helped him defeat the Assyrians. And so in return, they were given territory on the eastern end, basically to the east of the Neo Babylonian empire proper. And from the perspective of the Medes, right. Hey, it's territory. King of the Medes, I got my kingdom now. Right. I got my territory where I'm the boss kind of independence. They're not part of the Neo Babylonian empire. But from the perspective of the Neo Babylonian emperors, if you get into the history, and we've only touched on this here and there, I know, but the history of Mesopotamia, of Sumer and Akkad, they were constantly getting invaded from the east by the Elamites and by other people. I think in our Abraham episode, we talked about this a little, some of the invasions leading up to the ur3 period, anyway, so they're constantly getting invaded from the east. And so from the perspective of the Neo Babylonian Empire giving the Medes this territory, the Medes now are sort of this buffer state. Right. Although they're not really a nation state. I know, but there's sort of this buffer region between any potential invaders from the east and the Neo Babylonian Empire itself. Right. They're going to have to go through the Medes to get to the Neo Babylonian Empire, giving them time to call up an army, et cetera, et cetera. And the Medes are no slouches at fighting. So that's sort of the deal on that side. And so that represented a fairly potent check on the early ambitions of these Persian kings before Cyrus. To get to most of the rest of civilization, where things are sort of happening at that point in history, they'd have to go through the meads, which they're not going to do. And then to their east and their north, you got a lot of nothing. You got a lot of sparsely populated tribal lands. And if you go far enough east, you run into India. And India was established enough at this point that they weren't going to be taking any territory from India yet, at least in their mind. So these early kings, before Cyrus II are not super ambitious territorially. They're not really trying to start an empire yet."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1299.47,"end":1302.27,"speaker":"Fr Andrew Stephen Damick","text":"They're a couple steps above warlord."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1302.83,"end":1324.02,"speaker":"Fr Stephen De Young","text":"But, yeah, they have cities, they have a domain. It's just not a big domain. And there's not really room for them to easily expand until Cyrus II comes along and he's the son of Cambyses the first. So in terms of what his name means."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1324.42,"end":1329.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm sure that there are dissertations and many journal articles. Oh, yes, etymology."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1329.94,"end":1389.87,"speaker":"Fr Stephen De Young","text":"So a lot of the stuff we're talking about tonight, and we're going to try to indicate, like, different sources on different things. A lot of stuff we're talking about tonight, our primary historical sources on a lot of this is Greek historians. Now, we also have some actual old Persian inscriptions and stuff. Right. We're going to talk about some of those. So we have those, and those help us with dates and different things. So we have these benchmarks beyond just what the Greeks say. We have these kind of benchmarks, benchmark dates that clue us in a little bit on this and help us orient what the Greeks are saying. But some of the stuff the Greeks say seems unreliable, shall we say. Yeah. In the sense that they were deeply fascinated by this figure of Cyrus because of course, they're going to come into contact with his. Some of his successors with the Persians. Go watch 300. It's a documentary. It's totally."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1392.43,"end":1416.35,"speaker":"Fr Andrew Stephen Damick","text":"It's like the reason why, of course, is that Persia, just to reiterate, this was this massive, complex, stupefyingly huge state, you know, and with armies of like, when the Persians went up against the Greeks, I mean, they had like hundreds of thousands of troops on the ground, which was just boggling."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1418.43,"end":1427.29,"speaker":"Fr Stephen De Young","text":"Part of 300. That's exaggerated but not false is the fact that. That they would bring like Indian and African elephants."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1427.69,"end":1428.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1428.81,"end":1437.93,"speaker":"Fr Stephen De Young","text":"Right into battle. So, like, the Persians show up with these monstrous creatures. Right, right. Which, you know, the Greeks had never seen before."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1438.49,"end":1443.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Like these are monsters that they have clearly summoned from the underworld or something."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1443.29,"end":1474.69,"speaker":"Fr Stephen De Young","text":"Yes. For the far quarters of the globe, because even the Greeks knew it was a globe. Right. So, yeah, this was incredible. And Alexander the Great. Cyrus was his role model. Cyrus the Great was his role model. Like, he did everything he could to find out everything he could about Cyrus. That's who he patterned himself after. The Greek writers you could tell look at Cyrus with, like, kind of this fear and awe and reverence. Right. Which means stories about him get distorted in a couple of ways."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1474.77,"end":1475.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1475.65,"end":1492.5,"speaker":"Fr Stephen De Young","text":"Like, sort of. He's sort of like Paul Bunyan or something, like Superman. You get those kind of distortions. But you also get these sort of like, horrifying, monstrous distortions too. Like. Right, we'll give you an example here in a minute."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1494.74,"end":1499.62,"speaker":"Fr Andrew Stephen Damick","text":"Larger than life. Larger than. Larger than life. Double, triple xl. Than life."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1499.7,"end":1529.13,"speaker":"Fr Stephen De Young","text":"That's what I mean when I say, you know, we have these Greek accounts, but we also have these. These other inscriptions from the Persians at the time and stuff that kind of are a check on some of the excesses of some of those accounts. Right. And let us know that they. They may be excesses. Right. But so that also means things like what his name means. The Greeks, of course, tell us ancient etymologies are famously unreliable, especially from ancient Greeks."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1529.6,"end":1530.88,"speaker":"Fr Andrew Stephen Damick","text":"But so fun."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1531.2,"end":1534.4,"speaker":"Fr Stephen De Young","text":"Plato gives bogus etymologies all the time."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1535.04,"end":1535.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1535.44,"end":1542.8,"speaker":"Fr Stephen De Young","text":"Like as arguments. Oh, well, you see, this word comes from this word which means da, da, da. And it's like. No, it literally does not."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1543.68,"end":1563.61,"speaker":"Fr Andrew Stephen Damick","text":"But to their credit. To their credit. And this made. This may surprise a lot of people. Persian is an Indo European language. I mean, that's part of the Indo. Part of the whole thing. Yeah. Like Greek or like English or, you know. Yeah. Most of most European languages are in the same language family that Persian is in. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1563.69,"end":1573.21,"speaker":"Fr Stephen De Young","text":"And that helps because that means when they look at old Greek roots, sometimes those old Greek roots are related to the old Persian roots."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1573.69,"end":1592.78,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, there's some stuff that's cognate, too. Like, my wife actually took Persian for a while in undergrad and she told me about a joke that they were making in the class that was playing off of the fact that the Persian word for mouse is moose. Right away you can hear that it's similar. So there's even cognates between English and Persian. How about that, everybody? Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1593.26,"end":1599.42,"speaker":"Fr Stephen De Young","text":"And so we get Cyrus. So Cyrus is a Latinization of Kairos."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1600.22,"end":1602.46,"speaker":"Fr Andrew Stephen Damick","text":"Kyros. Yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1602.7,"end":1603.9,"speaker":"Fr Stephen De Young","text":"Kyro. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1605.58,"end":1606.38,"speaker":"Fr Andrew Stephen Damick","text":"Kyros."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1607.02,"end":1607.58,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1608.3,"end":1614.07,"speaker":"Fr Andrew Stephen Damick","text":"Might be like from kuros or. That's how I heard a Persian say it. Kudos Khouresh."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1614.95,"end":1678.8,"speaker":"Fr Stephen De Young","text":"So this is one theory which is basically the word for sun, like the sun in the sky. And the Greeks all endorse this, because I know you're thinking like Elios, but there is an older. There is an archaic Greek term for the. The sun, that is kairos, not kyrios. Kyros. So if that's the case, then Cyrus would probably actually be derived from Kurvash in old Persian, which would mean the one like the sun. You are my sunshine, as it were. And this would probably fit, especially in terms of, like, his grandfather, because at that point, it seems very likely we're gonna get into this more to the second half, but you're dealing with early. You're dealing with still the pagan phase of Persian religion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1679.04,"end":1695.53,"speaker":"Fr Andrew Stephen Damick","text":"By the way, I just looked this up because I was really curious. So Helios, which you mentioned, is actually cognate with the Persian quarrel or whatever, how it's pronounced. So they are ultimately from the same proto Indo European root."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1696.01,"end":1696.49,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1696.81,"end":1697.69,"speaker":"Fr Andrew Stephen Damick","text":"So there you go."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1698.65,"end":1703.05,"speaker":"Fr Stephen De Young","text":"So, yeah. So at least this only requires the Greeks to be aware of their own language group."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1703.13,"end":1704.93,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1704.93,"end":1706.41,"speaker":"Fr Stephen De Young","text":"And not Egyptian or something."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1706.57,"end":1707.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. Not related."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1708.01,"end":1721.86,"speaker":"Fr Stephen De Young","text":"But of course, we don't have anything that proves that. It just kind of makes sense. It's probably the majority opinion. We're going with it. If you want to go and read any of the countless journal articles suggesting other possibilities."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1723.62,"end":1724.26,"speaker":"Fr Andrew Stephen Damick","text":"Enjoy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1727.14,"end":1752.19,"speaker":"Fr Stephen De Young","text":"But, so Eddie's born circa 600 B.C. like, 600, 599, somewhere in there. We know about that because we know when he succeeds to the throne and we know how old he was when he succeeded to the throne and he was married off to. Well, there's. There's no way to get around it. Listen up, Game of Thrones fans. He gets. He's married to his aunt."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1752.83,"end":1756.31,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is not super uncommon."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1756.31,"end":1788.67,"speaker":"Fr Stephen De Young","text":"In that day and age. It really. It really wasn't at that time, because remember, the Achaemenids, like, it's the royal blood, right? So he's. He's married to basically his aunt, to one of the daughters of Astyages, the. The king of the meads. Her name was Kassandani. Apparently. He really loved her. And I know you're like, okay, he loved his wife. Well, you know, this was very clearly an arranged marriage. He was married to his aunt, who happens to be the daughter of the king of the Medes, the neighboring king."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1788.67,"end":1788.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1788.99,"end":1827.18,"speaker":"Fr Stephen De Young","text":"Like, but he. Much later, when. Spoilers. He had conquered Babylon when she died, he instituted this ridiculously long period of enforced public mourning on, like, the whole population over her death. And this is considered evidence by all the ancient people that, like, wow, he really loved her. Which was Kind of rare for, you know, royal arranged marriages. So he had two sons with her, his son, Cambyses the second, also named after his grandfather, who would become the emperor after Cyrus the Great."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1827.58,"end":1832.38,"speaker":"Fr Andrew Stephen Damick","text":"And I guess he would be then not only his son, but also his."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1832.38,"end":1834.3,"speaker":"Fr Stephen De Young","text":"First cousin, kind of."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1834.3,"end":1835.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1836.54,"end":1856.6,"speaker":"Fr Stephen De Young","text":"We're gonna run into somebody here who's their own grandpa. I know it. And then a second son, Bardia, and then three daughters. And I love the names of these three daughters because the three daughters are named Atossa, Artistone and Roxanne. Roxanne."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1857.16,"end":1859,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, just can't help it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1859.24,"end":1862.84,"speaker":"Fr Stephen De Young","text":"So like two very Persian names and then Roxanne. So there you go."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1863.8,"end":1865.88,"speaker":"Fr Andrew Stephen Damick","text":"I mean, which is probably also a very Persian name."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1866.2,"end":1868.2,"speaker":"Fr Stephen De Young","text":"Yeah, but these are not saints, so."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1868.28,"end":1871.96,"speaker":"Fr Andrew Stephen Damick","text":"No, don't name your kids. Once again. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1873.56,"end":1880.76,"speaker":"Fr Stephen De Young","text":"So Herodotus. Just, just so the audience knows, I have been pre censored on telling this story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1881.6,"end":1881.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1882.48,"end":1887.6,"speaker":"Fr Stephen De Young","text":"By Father Andrew. You are going to get the expurgated, baudelairized version of this story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1887.92,"end":1888.72,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1889.68,"end":1906.88,"speaker":"Fr Stephen De Young","text":"If you want the real deal, you'll have to go read some Herodotus. But. So Herodotus has this story about the birth and early childhood of Cyrus ii. Cyrus the Great. That is fascinating."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1908.46,"end":1911.26,"speaker":"Fr Andrew Stephen Damick","text":"So it is. It is wild to say the least."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1911.5,"end":1917.5,"speaker":"Fr Stephen De Young","text":"Yes. Okay, so here is the version that Father Andrew will allow me to tell you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1917.82,"end":1920.38,"speaker":"Fr Andrew Stephen Damick","text":"That's right. As the official censor."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1920.7,"end":1922.7,"speaker":"Fr Stephen De Young","text":"As the representative of the man."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1923.26,"end":1926.86,"speaker":"Fr Andrew Stephen Damick","text":"That's right. It's the. The. The Grand Inquisitor."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1927.9,"end":1943.36,"speaker":"Fr Stephen De Young","text":"As the power in Fight the Power. Anyway, so Astyages, King of the Medes, his daughter Mandane is about to become Cyrus ii. Cyrus the Great's mother, as in she's pregnant with him."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1943.84,"end":1944.4,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":1945.6,"end":2089.8,"speaker":"Fr Stephen De Young","text":"This is going to be his grandson, Cyrus ii. So this is Cyrus's maternal grandfather has a vision that. From his daughter's vision, his dream. Right. So he's having a dream. And within the dream he has a vision. And that from his daughter's body flow a great flood of water. And then grapevines filled with clusters of grapes. So he wakes up, is vaguely disturbed by this, knows it must mean something. So Astiges calls together his magi, as it were, and says, hey, here's this dream I had. Can you interpret this dream for me? And he said, oh, this is a dream about the son who is going to come forth from your daughter's body. The flood represents the fact that he's going to wipe out you and your rule and take your throne. But then once he does, the grapevines and the clusters of grapes represent the fact that they will be successful and prosperous to the kingdom and bountiful. Right. Once he takes over. Now, Astyages, being a bit selfish, doesn't like this prospect. He doesn't care about prosperity. He wants to stay king. So he calls his main general, military general Harpagus, and tells Harpagus, look, take my pregnant daughter, Mandani. You need to take her and you need to end the life of the baby. So he sends a dude, Harpagus. He doesn't. He doesn't have the. He doesn't have the heart to do this, to kill this unborn baby. And so he takes her to a bunch of shepherds. And these shepherds apparently have ways of aborting children. And so he gives her to the shepherds to take care of the issue. So when this happens, the shepherds also don't have the heart to kill this woman's child. But it so happens that one of the shepherds wives has a stillborn baby."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2090.44,"end":2093.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, a lot of this is kind of similar to the Oedipus story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2093.64,"end":2098.29,"speaker":"Fr Stephen De Young","text":"Yes, there's details including the shepherd, but. And a couple of other things in here."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2098.29,"end":2099.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2100.05,"end":2132.35,"speaker":"Fr Stephen De Young","text":"So she goes and gives her stillborn child to Harpagus, says, see, look, we took care of the baby. And then shepherd family adopts baby Cyrus when he's born. So all goes well until Cyrus is like a little kid. He's playing some game with some nobleman's son. And he loses the game to the nobleman's son. And Ezone does he orders that nobleman's son beaten."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2133.63,"end":2134.67,"speaker":"Fr Andrew Stephen Damick","text":"How dare he."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2135.15,"end":2157.96,"speaker":"Fr Stephen De Young","text":"This causes a big kerfuffle because how dare some shepherd's kid order a nobleman's son be beaten. So there's an investigation and a little trial thing unfolds. And it turns out, oh, no, this is baby Cyrus now. Kid Cyrus ii. Right? He's. He's going to be the king here soon."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2159,"end":2163.16,"speaker":"Fr Andrew Stephen Damick","text":"The question is, did. Did they have the kid beaten as a result of what?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2164.04,"end":2169.64,"speaker":"Fr Stephen De Young","text":"Anyway, so. Yeah, and apparently his imperiousness was just in the royal bloodline, like."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2169.72,"end":2171.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2171.12,"end":2235.97,"speaker":"Fr Stephen De Young","text":"Have him beaten. So Astyages now finds out. Oh, dang it. My whole scheme fell apart and the kid was born, and now I'm doomed by the fates. And so he decides what he needs to do is get revenge on Harpagus for not having taken care of this for him. And so Astyages calls for Harpagus firstborn son, his general's firstborn son, Astyages, king of the beads, kills Harpagus firstborn son, and cooks him. He boils parts and he grills parts. Herodotus doesn't tell us which parts are which. And then has a big feast and serves Harpagus his own son. And then at the end of the dinner, he says, you've been punked. You were eating your own kid. And brings out a tray with his son's head, hands and feet to confirm that, see it was your son you were eating."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2236.45,"end":2247.09,"speaker":"Fr Andrew Stephen Damick","text":"You know, it's kind of uncanny how many stories from the pre modern world have that particular element in it. The I am going to feed you your own kid element."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2247.57,"end":2250.29,"speaker":"Fr Stephen De Young","text":"Yes. Never go full Titus Andronicus, folks."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2250.45,"end":2254.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yes. Also shows up in the Volsinga saga."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2254.94,"end":2255.26,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2255.34,"end":2260.46,"speaker":"Fr Andrew Stephen Damick","text":"Right before a woman lights the entire place on fire. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2261.5,"end":2264.46,"speaker":"Fr Stephen De Young","text":"So what's all that story about?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2265.66,"end":2270.14,"speaker":"Fr Andrew Stephen Damick","text":"Well, I think glorious origin story of Cyrus ii. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2270.3,"end":2278.42,"speaker":"Fr Stephen De Young","text":"I think we know now this is an overly elaborate story, but remember what I said about things getting exaggerated based on their impression they have of Cyrus."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2278.42,"end":2278.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2279.34,"end":2345.93,"speaker":"Fr Stephen De Young","text":"Okay. So with that kind of story in mind. So Cyrus II becomes Cyrus II in that he succeeds to the throne and he becomes the king of ancient in 559 BC at age 40. And his first order of business when he ascends to the throne is to go take out his grandpa Kigestyages and the Medes and take their territory. That's the first thing he does. And how does he do this? Because we said the previous kings didn't really have a good line on expansion. Right. They didn't really have the military power to go up against the Medes and they didn't have a lot of other directions to expand. Well, Cyrus made a deal with Harpagus, Astyages general, who is an actual historical person. And Harpagus turned on Astyages and took the Median army. Joined with Cyrus and his Persian army, they got rid of Astiges and took Media and he became the king of all media."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2348.09,"end":2349.53,"speaker":"Fr Andrew Stephen Damick","text":"Much like myself today."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2351.21,"end":2351.69,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2351.93,"end":2353.53,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, I just had to throw that one out there."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2353.61,"end":2363.96,"speaker":"Fr Stephen De Young","text":"I can't count the number of ways you remind me of Howard Stern. So he's going to call in now and just yell Baba Booie. Baba booie. That that's what's going to happen."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2364.12,"end":2365.12,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Thank you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2365.12,"end":2382.6,"speaker":"Fr Stephen De Young","text":"Or if they weren't before, they will now that I said that. So that's how it starts. So I think my theory here, and I don't think this is that far fetched, is that Herodotus story is essentially a way of trying to explain that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2383.4,"end":2389.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Why is it that he kills his grandfather. Well, you know, wipes out his his rule and teams up with."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2390.53,"end":2394.13,"speaker":"Fr Stephen De Young","text":"Yeah, why does his top general flip sides on him?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2394.29,"end":2396.73,"speaker":"Fr Andrew Stephen Damick","text":"But it's not asparagus, it's Harpagus."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2396.73,"end":2398.61,"speaker":"Fr Stephen De Young","text":"Yeah, why, why is Harpagus."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2398.69,"end":2399.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2399.49,"end":2429.15,"speaker":"Fr Stephen De Young","text":"Why does his top general flip on him? I mean that seems weird. Like normally you don't become somebody's like top general ahead of the military. Like if you're a king, that's got to be a guy you trust a lot because military coups are a whole thing. Like this guy's the commander of your military. He could just stab you in the back and take over kind of anytime he wants to. So normally this is like your most trusted guy. And he flipped on a Stygis. Yeah, that seems weird, right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2429.15,"end":2429.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2430.59,"end":2549.39,"speaker":"Fr Stephen De Young","text":"And Cyrus just decides to white take kill his grandfather and take his kingdom, like first order of business after becoming king. That seems a little odd. Also his father in law. So the whole thing seems a little weird. And so I think Herodotus comes up with this story probably based on some rumors and things he heard, and elaborates it out to come up with what would generate the kind of animosity toward Astyages, right. From these two men that lead this. And, and certainly if Herodotus story were true, that would generate enough animosity to make the two of them want to kill him and get rid of him. But so regardless of, you know, the actual reasons that happens, Cyrus though doesn't stop. So even if, if his initial motivation is some kind of revenge for something on Astagis, he doesn't stop there. They keep rolling and they roll northwest. So he does not immediately go after the Neo Babylonian Empire because again, he's now he's got the army of the Medes, he's got his own Persian army, but he's not ready to go up against the Neo Babylonian Empire yet. And so he goes north and west across the top of the Fertile Crescent and he conquers Lydia and then goes over into Asia Minor, what's now Turkey, and conquers all of Asia Minor. And the only place where he faces real military resistance is when he gets to the, the very western end of Asia Minor where there are a whole bunch of Greek city states. So people forget this, that Asia Minor in the first millennium BC is kind of split east and west. They're actually a whole bunch of different people groups in Asia Minor."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2549.39,"end":2552.15,"speaker":"Fr Andrew Stephen Damick","text":"I mean, aren't the Hittites are from Asia Minor."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2552.23,"end":2568.23,"speaker":"Fr Stephen De Young","text":"Right, Right. And in general, now we've talked about the Greeks being Sort of the last ancient Near Eastern culture. But the west end, the very west end of Asia Minor was Proto Hellenic in culture. Right. That's where Troy is."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2568.87,"end":2569.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2569.83,"end":2584.29,"speaker":"Fr Stephen De Young","text":"Whereas the eastern portions, like where the Hittites were, those sections are very clearly ancient Near Eastern in culture in the sense that there's cultural curtsy going back and forth with the Luvians and the Hittites and the Hurrians."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2584.29,"end":2584.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2584.57,"end":2589.09,"speaker":"Fr Stephen De Young","text":"And the Phoenicians and the Syrians. Right. Like that's their sort of world."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2589.17,"end":2598.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. And Hittite, everybody, is an Indo European language as well, which is also crazy to think about, but it is probably the. One of the very oldest that we have tested."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2600.13,"end":2616.21,"speaker":"Fr Stephen De Young","text":"So. But when he hits that resistance, it's at the Greek city states and they sort of form a league. They bond together as Greek city states were. Want to do when invaded. And it was led by a certain king, Croesus. As in riches Croesus."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2616.77,"end":2617.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2619.09,"end":2675.05,"speaker":"Fr Stephen De Young","text":"A phrase that I know you've all heard, all of you zoomers just all the time you're talking about people being rich as Croesus. I know when you're sulking like Achilles in his tent, you sit there and think, would that I were rich as Croesus. But the actual historical Croesus got wrecked by Cyrus ii and he ends up taking all of Asia Minor. But then he stops, still doesn't feel like he's ready to go after Babylon. So he heads back home. And then the next set of campaigns, he heads east and he makes his way all the way into and makes vassals out of a whole series of cities in the western part of India. So he already has this vast swath of land now."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2675.53,"end":2675.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2677.05,"end":2690.02,"speaker":"Fr Stephen De Young","text":"And if you're the Neo Babylonians, you're getting nervous now because you are bordered on the north, on the west, and on the east by this new Persian empire."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2690.82,"end":2693.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is just again, colossal."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2694.02,"end":2701.78,"speaker":"Fr Stephen De Young","text":"Yeah. Like if you're looking at a map, it's like hanging over them, sort of the way West Virginia hangs over the top of Virginia. Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2702.18,"end":2704.58,"speaker":"Fr Andrew Stephen Damick","text":"West Virginia is the rest of Virginia."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2704.58,"end":2899.45,"speaker":"Fr Stephen De Young","text":"Like, looming, looming like the sword of Damocles above their. Above their heads, waiting to drop. And so in 540 B.C. 19 years after he's become king. So in 19 years, he accomplishes all that. 540 B.C. cyrus feels like, okay, now I'm ready to start making moves against the Neo Babylonian Empire. And so he moves west a little bit from the Iranian plateau and takes Elam and Susa. Susa is later going to be the capital of the Persian Empire. So he takes Elam and Susa in 540. But he's got one major obstacle. So if you remember last episode, we talked about how one of the things Nebuchadnezzar did was he built these walls, these border walls. And we said we didn't know if he made the Lydians and the Medes pay for it. Um, but he built these border walls. One of those was the Median Wall, which was called the Median Wall because it was kind of. Even though they were technically allies, remember what we said about them being a little paranoid about being invaded from the west, invaded from the east, coming west into their territory, they put a wall there too, that was referred to as the Median Wall. And so in order to mount any kind of military attack against the Neo Babylonian Empire, Cyrus had to find a way around the Median Wall. Because even with an army that outmatched the Neo Babylonians, which we're not totally sure, he had them completely outmatched in terms of numbers, if they're defending a wall, this isn't going to go well for you. And so he found a way around it. He found the city of Opis. Opis, which was a little bit north of Babylon on the Tigris River. It was at a ford of the Tigris River. And if he could ford the river and take it, he could essentially go through Opis and go around the Median Wall and then invade sort of the heartland of the Neo Babylonian Empire, the main cities. And so he marched his army toward Opus. Neo Babylonian army also marches towards Opus, led by who would become the last Neo Babylonian Empire, Nabonidus. The battle of opus happens in 539, and nabaditis and his Babylonian army get wrecked, just obliterated by the Persians. And we're going to find out some reasons here in a minute. That's why that may have been. But once the Neo Babylonian army is routed at Opus, Cyrus and his Persian army march south. They march into Sippar. You remember that city that we talked about last time? March into Sippar. And took it without resistance on October 10th, 539 BC. Hey, that's right, kids. Tomorrow is the 2, 564th anniversary of Cyrus marching into Sippar."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2900.17,"end":2902.49,"speaker":"Fr Andrew Stephen Damick","text":"You gonna do anything special for the holiday or."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2902.49,"end":2925.98,"speaker":"Fr Stephen De Young","text":"Well, there's a bigger one. There's a bigger one. Because then on October 12th, which will be Sunday, this Sunday will be the 2564th anniversary of this he marched into Babylon. So Sunday is 2564th anniversary of Cyrus taking the city of Babylon, marching to Babylon and took Babylon with no resistance."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2927.02,"end":2932.3,"speaker":"Fr Andrew Stephen Damick","text":"Which strongly suggests that the Babylonians are like, yeah, come on."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2932.3,"end":2976.23,"speaker":"Fr Stephen De Young","text":"Nabaditis stunk. Yeah, he was bad. There were a series of weak bad emperors, as we mentioned last time after Nebuchadnezzar, in fairly quick succession. Nabaditis was one of them. Didn't have. And this is probably why they got routed so badly. He probably didn't have the confidence and loyalty of his troops. Because when we say no resistance. Right. This means that Nabaditis was trying to rally more troops and couldn't get any. And like, the nobles and the priests and stuff in these cities were just like, hi, Cyrus, how you doing? We look forward to your leadership. Like, how bad do you have to be ruler when your own people are just like, woo. Glad that's over. Who's the new guy?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2976.23,"end":2976.71,"speaker":"Fr Andrew Stephen Damick","text":"You know?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2977.16,"end":2995.96,"speaker":"Fr Stephen De Young","text":"But we have an inscription from this event 2564 years ago Sunday, where Cyrus left a little cylinder inscription. And this is a tiny cylinder. You hear cylinder inscription. You think it's gonna be some big standing monument. These. These cylinders are tiny."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2997.72,"end":2999.48,"speaker":"Fr Andrew Stephen Damick","text":"Like the size of a hand or finger."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":2999.48,"end":3002.44,"speaker":"Fr Stephen De Young","text":"Like a third the size of a highlighter."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3003.51,"end":3003.83,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3005.27,"end":3077.6,"speaker":"Fr Stephen De Young","text":"With tiny inscriptions on them. They are very small, but. So there is a cylinder that was found, called the Cyrus cylinder in a fit of creativity that was found in the depths of. In the bottom of the Essequila. Remember that from last time. The main temple of Marduk in Babylon, like the ancient temple, they already thousands of years old at this point. Temple of Marduk. At the center of Babylon, we find this cylinder from this date when he took Babylon in which proclaims Cyrus, or Cyrus is proclaiming himself, but he probably didn't write it himself. The king of Babylon, the king of Sumer and Akkad and the king of the four corners of the world. And then just a ton of smack. Talk about Nabonidus and how happy everyone was that he came and took over, including the God. Marduk was just super happy to greet Cyrus. Nice. And get rid of that nabonitis cloud. Like, you got to feel a little bad for the guy. You just found out one day that he had no friends. Like, no one liked him."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3078.08,"end":3082.4,"speaker":"Fr Andrew Stephen Damick","text":"Do you want to be liked by Marduk? I'm just. I guess you kind of want to, but."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3083.84,"end":3088.2,"speaker":"Fr Stephen De Young","text":"Well, I mean, just. It would be nice if Naboditis felt like somebody was still his pal."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3088.2,"end":3088.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3088.48,"end":3093.03,"speaker":"Fr Stephen De Young","text":"You know, like there's somebody who felt bad about him not being emperor anymore, you know?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3093.03,"end":3093.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3093.99,"end":3102.95,"speaker":"Fr Stephen De Young","text":"And it's not like Cyrus has this long record as an emperor. Right. Like, they're basically favoring an unknown quantity over him, you know, that's got a sting, that's all I'm saying."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3104.55,"end":3108.15,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Is that empathy, Father Stephen? I've never. I have."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3108.15,"end":3110.23,"speaker":"Fr Stephen De Young","text":"I have sympathy for nabonitis."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3110.55,"end":3113.19,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow. Wow."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3113.59,"end":3131.33,"speaker":"Fr Stephen De Young","text":"It seems tough, man. It seems tough. You know, I mean, if, God forbid, I was transferred to another parish and when the new guy showed up, like, just everyone in the parish was like, we don't know who you are, but we're so glad you're here. That would be a. That'd be a kick in the teeth, you know, you'd feel a little bad."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3131.89,"end":3135.93,"speaker":"Fr Andrew Stephen Damick","text":"Huh. That's been known to happen once in."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3135.93,"end":3153.66,"speaker":"Fr Stephen De Young","text":"A while, but it'd be a little rough. But so not too long after this, right? This happens at 539, October 12th. 539. In 530 BC, Cyrus dies. And he dies doing what he loved. He's in battle, conquering stuff."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3153.98,"end":3156.06,"speaker":"Fr Andrew Stephen Damick","text":"So went out with his boots on."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3157.1,"end":3211.02,"speaker":"Fr Stephen De Young","text":"We're not sure exactly the exact spot where he was when he died. We know that this group of people called the Massagetae, who lived somewhere in what is modern day Kazakhstan and Uzbekistan. And they may have been kind of nomadic Central Asia. Yeah. Either revolted against Persian rule or attacked Persian territory. It's unclear. It's partially unclear because we don't know just how much control Cyrus had at that point, that deep into Asia, because this is around what would have been the border, right. This is around the limits of his control. So are these people who are technically in Lancy controlled who are revolting, or are these people from just outside who are moving in? It's not totally clear."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3211.1,"end":3211.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3212.22,"end":3265.3,"speaker":"Fr Stephen De Young","text":"But he goes to fight them. And he fights them, the ancient sources say, at the headwaters of the Sir Daria River. We know it wasn't the literal headwaters of the Sardaria river because that's way too deep in Asia. But the word that's translated, headwaters, could just mean upriver, basically. So when they say upriver, like how far up river, we don't know. But it's somewhere around the Sir Daria river, which flows through that part of Asia. Right. For miles. But somewhere in there, in battle against the massacre day, he's killed and his body is brought back to pass our gadday. Right, which is the city over which Achaemenes was king, sort of the Achaemenid city. And he's put into a limestone tomb that is still there to this day."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3266.18,"end":3268.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is crazy. That's Crazy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3268.58,"end":3276.1,"speaker":"Fr Stephen De Young","text":"I don't necessarily recommend taking a vacation. Vacation in Iran right now, but if you were to, you could go see."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3276.1,"end":3287.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And you know, kids, if you want to look up what this looks like, this limestone tomb, there is in fact a Wikipedia article. It's called, like, the Tomb of Cyrus or Tomb of Cyrus the Greatest, something like that as a photo."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3289.11,"end":3306.87,"speaker":"Fr Stephen De Young","text":"So, yeah, that tomb is still there. Now, Herodotus, this inscription is not still there, but Herodotus again tells us that there used to be an inscription on it that said, roughly, I am Cyrus. I conquered the four quarters of the world. Do not begrudge me this small piece of land for my burial."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3307.68,"end":3311.12,"speaker":"Fr Andrew Stephen Damick","text":"I mean, reasonable. A reasonable request."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3311.92,"end":3324,"speaker":"Fr Stephen De Young","text":"Yeah. And we also know that when he conquered Persia, Alexander the Great spent a bunch of time there at the tomb, probably trying to do some pagan equivalent of grave soaking."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3324.16,"end":3326.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was going to say he's going to soak up his anointing or whatever."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3326.72,"end":3335.22,"speaker":"Fr Stephen De Young","text":"Yeah. No, you see, you're telegraphing the third half. That's what you do with Cyrus's anointing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3335.22,"end":3335.62,"speaker":"Dan","text":"Huh."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3336.42,"end":3337.06,"speaker":"Fr Andrew Stephen Damick","text":"Welcome."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3337.38,"end":3380.07,"speaker":"Fr Stephen De Young","text":"So, sort of some last notes here. As we draw the first half to a close, it's important to note some of the differences between the Persian Empire and preceding and even a lot of succeeding empires. So one of those is the fact that there's a series of tensions. Right. So one of these is that Cyrus, unlike all previous empires and pretty much all later empires, frankly, does not try to impose Persian culture as a hegemonic culture upon his realms. Yeah, he does the opposite."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3380.47,"end":3391.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, like, you worship those gods. Keep doing that. That's cool. Or even, you know, you got a local mayor and town council, governors, whatever, that's cool. Just run things, make sure you send some tax money."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3392.4,"end":3416.6,"speaker":"Fr Stephen De Young","text":"Yeah. So he allows every region to continue to practice its own nomos, its current nomos, as long as they acknowledge him and pay tribute. And in terms of their religion, he lets them practice their religion. He just says, hey, whatever God you worship, offer some sacrifices to him or her for me as the emperor. Otherwise, do what you like. Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3417.08,"end":3420.12,"speaker":"Fr Andrew Stephen Damick","text":"Weirdly tolerant. For the ancient world. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3420.44,"end":3485.67,"speaker":"Fr Stephen De Young","text":"This is unheard of. Right? This is unheard of. We saw the Assyrians certainly weren't this way. Babylonians aren't this way. Greeks aren't going to be this way. They're going to try to Hellenize everything. Romans aren't this way. So this is a very different, almost cosmopolitan approach to what he's doing. And it's part of the success of the Persian Empire when you do that. Turns out you get less revolts because everybody's kind of allowed to do their own thing as long as they sort of acknowledge your authority. And this is part of why we don't get that much literature in the Old Testament from the Persian period, the 5th century BC, the 400 BC is pretty peaceful. In Judea, Jewish people are just kind of allowed to do their thing for 100 years. There's no one really bothering them there. You talk about the Esther stuff. That's mostly in Persia and in the Babylonian Jews, but it's pretty peaceful."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3485.67,"end":3485.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3485.95,"end":3508.72,"speaker":"Fr Stephen De Young","text":"It's not until the Greeks come and the Greeks then try to Hellenize the culture that you get the Maccabean revolt. And yeah, everything we find out about in those, those Christian Old Testament texts. But Persian Empire is pretty peaceful now. That said, they also introduced, though a common language. This is not Persian, which is not Persian."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3508.96,"end":3511.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, not Persian. Not Persian."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3511.44,"end":3514.16,"speaker":"Fr Stephen De Young","text":"So they have a language to facilitate trade and everything."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3514.8,"end":3515.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3515.52,"end":3519.99,"speaker":"Fr Stephen De Young","text":"And the administration of the empire, but they don't impose their own. It's actually Aramaic."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3520.23,"end":3572.23,"speaker":"Fr Andrew Stephen Damick","text":"Aramaic. And if you want to know the story of exactly how that weirdness came to be, there's a great book called Empires of the Word by Nicholas Osler, I think it is. And what he says in that book essentially is that the kind of native Aramaic speakers or these nomadic traders, mercantile types, and they keep kind of getting pushed around the empire. And because they keep getting pushed around, everyone everywhere wants to do business with them. And so they learn their language and before you know it, it's to be very, very anachronistic about it, the lingua franca of the Persian Empire, and so that's the official language of the court, is not Persian, but Aramaic, this Semitic language belonging to these wandering businessmen. It's wild. It's cool story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3572.23,"end":3581.51,"speaker":"Fr Stephen De Young","text":"Yeah. And Aramaic persists in the East. That's why people are still speaking Aramaic in the New Testament period in Judea and Galilee."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3582.07,"end":3582.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3582.55,"end":3583.15,"speaker":"Fr Stephen De Young","text":"And Samaria."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3583.15,"end":3583.91,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for the Persians."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3583.91,"end":3592.55,"speaker":"Fr Stephen De Young","text":"But it continues further east than that. So the Persian Empire is long gone at this point. Right. But they're still speaking Aramaic in what's now Pakistan."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3593.91,"end":3594.79,"speaker":"Fr Andrew Stephen Damick","text":"That's crazy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3595.58,"end":3641.45,"speaker":"Fr Stephen De Young","text":"That's why St. Thomas could go there. There are ancient churches and stuff in Pakistan with inscriptions in Aramaic. So, yeah, Aramaic was a lingua franca before Greek was. So there's that. And we also get interestingly now, obviously in the Persian Empire, there's not a separation of church and state, but you get the first inkling of some kind of concept like that in the sense that, as we mentioned, there is no attempt to impose Persian religion. But to understand how significant this is, we have to compare it again. Right. So when the Neo Babylonian empire rises to prominence, they take that to mean Marduk is now the supreme God in the world."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3642.33,"end":3642.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3642.97,"end":3667.93,"speaker":"Fr Stephen De Young","text":"Because he's the God of the Babylonians and Babylon rules the world and all other gods are either assimilated into the Babylonian religion or demoted into the side of it. Right. But everything, the religion of everyone within the Babylonian empire is expected to be redone to fit. And that's why you have the things happen that happen in Daniel, like people getting thrown in furnaces."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3669.21,"end":3669.61,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3670.17,"end":3680.43,"speaker":"Fr Stephen De Young","text":"This kind of thing, because they will refuse to accommodate the Jewish people, refuse to call it Babylonian religion. That kind of thing happens again with the Greeks, as we mentioned in Maccabees. That doesn't happen with the Persians."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3681.23,"end":3682.03,"speaker":"Fr Andrew Stephen Damick","text":"It's wild."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3683.23,"end":3695.47,"speaker":"Fr Stephen De Young","text":"So there's something fundamentally different there in terms of religion that leads us into when we come back in our second half, we're going to discuss Persian religion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3696.27,"end":3701.63,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, on that cliffhanger, we're going to take our first break and we'll be right back."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3702.03,"end":3714.85,"speaker":"Announcer","text":"Father Andrew, Stephen Damek and father Stephen DeYoung will be back in a moment to take your calls on the next part of of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3715.09,"end":3786.46,"speaker":"Announcer","text":"That's 855 AF radio. Poised between east and West, between Orthodox and Catholic Lithuania, the last of Europe's pagan nations did not forget its ancient tales such as that of the giantess Neringa Eglay, Queen of Serpents and the iron Wolf. Rather, they fulfilled and enriched them with legends like the hill of Crosses and the miracle working icon of Our lady of the Gate of the dawn in the Wolf and the Cross. Father Andrew Stephen Damek and Deacon Seraphim Richard Rowland take a very personal pill pilgrimage into a land where history and legend have met and fused, where Orthodox Christians have lived as a minority for nearly seven centuries, their faith founded upon the blood of martyrs and the witness of dozens of saints. To find this book and others like it, you can go to store.ancientfaith.com again, that is store.ancientfaith.com or."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3789.81,"end":3805.81,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3806.77,"end":3814.57,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. So Father Stephen, did you Get a copy of my new book that I co wrote with Deacon Sayre from Richard Rawlins."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3815.13,"end":3816.73,"speaker":"Fr Stephen De Young","text":"You did not give me such a book."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3817.05,"end":3819.21,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, you didn't give me one of yours either."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3819.61,"end":3828.25,"speaker":"Fr Stephen De Young","text":"Despite the stirring introduction I gave to Deacon Cherubim, if that is his real name. He did not give me a copy either."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3830.41,"end":3857.56,"speaker":"Fr Andrew Stephen Damick","text":"Well, what can I say? We are back and we're going to be talking now about Persian religion probably. If people know anything about Persian religion, they know about Zoroastrianism or at least the name. And so they might assume that Cyrus was a Zoroastrian and then maybe that's why he was so tolerant of other religions. Is that true? What's that all about?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3858.12,"end":3860.68,"speaker":"Fr Stephen De Young","text":"I'm once again disappointed in the lack of calls."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3861.08,"end":3867.58,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. People are. Maybe they're just listening so closely that they just don't have anything to say."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3867.66,"end":3870.62,"speaker":"Fr Stephen De Young","text":"They gotta have some Cyrus related questions. Come on, man."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3871.9,"end":3876.62,"speaker":"Fr Andrew Stephen Damick","text":"Some kuroshiosity. Yes, thank you, thank you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3876.94,"end":3878.94,"speaker":"Fr Stephen De Young","text":"We'll. We'll see. We'll see."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3880.22,"end":3881.66,"speaker":"Fr Andrew Stephen Damick","text":"I'll keep my eyes peeled."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3882.54,"end":3889.82,"speaker":"Fr Stephen De Young","text":"So like I said, you. You can lie to. You can lie to Mike about what you're gonna ask. Just, you know, call it ask whatever."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3889.82,"end":3909.91,"speaker":"Fr Andrew Stephen Damick","text":"I don't recommend though, communicate with us. We have someone actually in the, the YouTube chat who is going by the moniker of Christopherus the Varangian, who writes, man, oh man. Been waiting for discussion from you fine gents on Zoroastrianism. So I guess this is his moment."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3909.91,"end":3911.15,"speaker":"Fr Stephen De Young","text":"Okay, this is."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3911.15,"end":3913.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Woo."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3913.47,"end":3928.2,"speaker":"Fr Stephen De Young","text":"Okay. So yeah, thank you for that woo. So a little bit of woo on this show. Was Cyrus a Zoroastrian? Maybe."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3929.64,"end":3931.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't super know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3931.64,"end":3937.64,"speaker":"Fr Stephen De Young","text":"The answer is maybe. So there's a number of parts to this."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3937.88,"end":3938.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3938.24,"end":3975.36,"speaker":"Fr Stephen De Young","text":"In terms of even assessing this question, Zoroastrianism internally claims to go back to the Bronze Age. It's a little dubious. It's a little dubious, the Zoroastrianism as such. Now there are probably religious traditions contained within Zoroastrianism that do. As we're going to see when we get into the meat here of talking about Zoroastrianism and its origins. It is a sort of revision or reformation of much older, basically pagan religious forms."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3975.84,"end":3996.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The idea that what exists now is the same thing under that name that has always existed for, you know, 2000, 2500, 3000 years or whatever, that's just not true. But the roots of what is being practiced now certainly do extend this far back. Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":3996.95,"end":4031.36,"speaker":"Fr Stephen De Young","text":"And so the place where we first have records of Zoroastrian religion is the 6th century BC which may sound familiar because that's when Cyrus lived. So it's contemporaneous with Cyrus. In favor of him, maybe being Zoroastrian is the fact that we have the names of some of his advisors and stuff. And some of those names are potentially related to Zoroastrianism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4032.08,"end":4034.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Rather than like the usual pagan theophorics."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4035.44,"end":4043.36,"speaker":"Fr Stephen De Young","text":"Yeah. And you notice I'm being vague because even when you say that it's like, when does the term for fire become a technical term?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4044.56,"end":4045.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4045.44,"end":4118.12,"speaker":"Fr Stephen De Young","text":"What is it? A Zoroastrian technical term. But what does it just mean fire? You know, like. So it's easier with a theophoric, it's easier to demonstrate. But as we're going to see, Zoroastrianism is not really going to have theophorics in the true sense. It's going to deal more with concepts. And so it's hard to know whether, okay, this word or concept is included in somebody's name. Does it carry within their name the specifically Zoroastrian religious relevance? Hard to know at this point. Against him being a Zoroastrian is as we mentioned, his weird for the time views of religious tolerance. Because Zoroastrianism was not that, as we mentioned and as we're going to talk about now in its origins, Zoroastrianism was a reform movement of previous paganism. And so it was not particularly tolerant of old style paganism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4119.08,"end":4135.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it seems to be. I mean, is it correct to say that it seems to be like some of this kind of axial age philosophizing, you know? Yeah, formalizing kind of thing that's going on elsewhere in the world."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4135.53,"end":4207.55,"speaker":"Fr Stephen De Young","text":"Right, right. That it represents a sort of elevated version of Iranian, which is ultimately Indian Hindu, meaning paganism in a different way than like Brahmanism or Buddhism, but still essentially doing the same thing. And although even comparing it to Brahmanism, in some ways it's going to be a rebellion against a kind of Brahmanism. But so because of that, because it self consciously exists as a rejection of certain other religious practices, the idea that it would sort of then tolerate those religious practices in an imperial setting seems weird. It's also true that Cyrus did not make Zoroastrianism or any other religion the religion of the Persian Empire that he founded. It's his successors who made Zoroastrianism the official religion. That said, the idea that, okay, we have an empire, we need to make up a religion, that doesn't happen."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4210.12,"end":4210.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4211.32,"end":4260.84,"speaker":"Fr Stephen De Young","text":"That dog don't hunt, so that's not a possibility either. So it's not like Cyrus didn't know anything about Zoroastrianism and then his successors just invented this religion and rolled it out. That doesn't work either. So Zoroastrianism, the most likely explanation is that this is a religious tradition, probably a minority religious tradition over against the sort of general run of the mill Iranian paganism that already existed and had existed for some period of time. We can't know exactly how long before Cyrus, Cyrus is aware of it, but it only becomes ascendant and the official religion under his successors."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4264.46,"end":4271.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it makes sense that he would not be a practitioner of it because it's, as you said, it's in. It's an intolerant religion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4272.38,"end":4272.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4272.74,"end":4273.06,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4273.06,"end":4288.46,"speaker":"Fr Stephen De Young","text":"Well, and Cyrus, I think the most likely explanation for his general religious, weirdly religiously tolerant attitude, his seeming lack of concern for establishing any kind of religious base for his newly established empire."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4289.72,"end":4289.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4289.96,"end":4293.96,"speaker":"Fr Stephen De Young","text":"Etc. May just be that Cyrus wasn't all that pious."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4294.76,"end":4297.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just wasn't that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4297.04,"end":4349.47,"speaker":"Fr Stephen De Young","text":"He just wasn't a very religious guy. That, that's, that stuff didn't resonate with him so much and so he didn't have a problem. Obviously he's not an atheist or something who wants to abolish religion, but he's just sort of doesn't care about it that much. So he just kind of lets people do. Do whatever they want in that regard and considers it all good. I think that's the easiest and most likely explanation. So Zoroastrianism gets its name, and that name being the Hellenization of its name from Zoroaster, which is the Hellenization of the name of the prophet of Zoroastrianism, Zarathustra."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4351.15,"end":4354.51,"speaker":"Fr Andrew Stephen Damick","text":"Zarathustra or something like that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4354.91,"end":4356.63,"speaker":"Fr Stephen De Young","text":"I'm going with Nietzsche anyway."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4356.63,"end":4359.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I don't know how to pronounce Persian. Not even a little bit."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4360.75,"end":4410.15,"speaker":"Fr Stephen De Young","text":"So Zarathustra is this prophetic figure who is going to be basically a reformer against the previously existing Iranian religion. Sort of parallel again, sort of similar to the Buddha. So in regard to Hinduism. So that's obviously since that's Hellenized, that's not what Zoroastrians call themselves. So the Zoroastrian name for Zoroastrianism is Mazda. Yasna, which. Yasna is the word for like worship. So it literally means the worship of Mazda."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4410.79,"end":4411.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4412.87,"end":4414.39,"speaker":"Fr Stephen De Young","text":"Not the car manufacturer."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4414.79,"end":4416.07,"speaker":"Fr Andrew Stephen Damick","text":"Right. Deity."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4416.71,"end":4422.95,"speaker":"Fr Stephen De Young","text":"Nobody worships Mazdas to be like worshiping a Yugo. Sorry. Sir."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4423.51,"end":4433.55,"speaker":"Fr Andrew Stephen Damick","text":"Wow. All the mia. So it's all the Miata owners out there really, really scraping at the moment."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4435.23,"end":4443.47,"speaker":"Fr Stephen De Young","text":"They were such a big deal. Like in the year like 2000, the Mazda Miata, like the convertibles, like, you know, our."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4443.87,"end":4450.47,"speaker":"Fr Andrew Stephen Damick","text":"Five years ago, our mutual friend Michael Landsman, when I met him, he was driving a Mazda Miata."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4450.47,"end":4451.79,"speaker":"Fr Stephen De Young","text":"That totally checks out."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4452.03,"end":4452.83,"speaker":"Fr Andrew Stephen Damick","text":"Gave it up."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4453.23,"end":4455.39,"speaker":"Fr Stephen De Young","text":"Yes, that so checks out."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4455.71,"end":4456.23,"speaker":"Fr Andrew Stephen Damick","text":"Gave it up."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4456.23,"end":4460.99,"speaker":"Fr Stephen De Young","text":"When he got married, that would have been what, like 2000, what, seven?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4462.75,"end":4468.19,"speaker":"Fr Andrew Stephen Damick","text":"No, no, it hasn't been that long. It hasn't been that long actually. But yeah, okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4468.19,"end":4487.82,"speaker":"Fr Stephen De Young","text":"But yeah, that's. Yeah, I won't go any further out of respect for the man of lands. But. So the, the, the other term that Zoroastrians use for their own religion is bedin, which means the good religion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4488.86,"end":4489.42,"speaker":"Fr Andrew Stephen Damick","text":"Hey."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4489.74,"end":4492.22,"speaker":"Fr Stephen De Young","text":"Which is the good religion over against paganism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4492.78,"end":4494.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4494.02,"end":4552.63,"speaker":"Fr Stephen De Young","text":"So this is what we were talking about a minute ago. And so pre Zoroastrianism, like the Ur level of Persian religion is basically Vedic religion. So it's Hinduism as you find it in the Vedas. Right. So the, the related. Remember, religion is not a separate thing from culture and everything. So there was also apparently a very rigid caste system in Persian culture before Zarathustra. And the highest cast was the cast of the priests. And according to the Zoroastrian story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4553.51,"end":4557.11,"speaker":"Fr Andrew Stephen Damick","text":"That sounds pretty good. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4557.11,"end":4567.2,"speaker":"Fr Stephen De Young","text":"Are you going to do a Plato? You know, put the philosopher kings your priesthood? Yeah, I don't want to be a priest king. You can, you can go ahead with that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4567.2,"end":4568.12,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no, no."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4568.28,"end":4570.2,"speaker":"Fr Stephen De Young","text":"Lugal, Andrew over there, just."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4570.68,"end":4578.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I know. It's so funny. People scream about theocracy. I'm like, no, that's a bad idea. It's a bad."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4578.76,"end":4614.66,"speaker":"Fr Stephen De Young","text":"Build your cigarettes. Anyway, see how the highest cast were the. Were this priestly class and they were guilty of two primary crimes in oppressing the lower classes. The first was they demanded what were apparently exorbitant numbers of animal sacrifices. So they're basically plundering all the wealth of the people, the poorer people, by demanding all of their animals for sacrifices. And of course the priests are eating the meat of the sacrifices."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4614.74,"end":4615.46,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4616.18,"end":4639.8,"speaker":"Fr Stephen De Young","text":"This is a way of talking about greed. Right. They're exploiting their religious position. Basically both of these are going to revolve around they had this monopoly on access to the gods and religion. And therefore. And they exploited that for their own benefit. So one way was plundering their wealth through animal sacrifices. And the second thing was they controlled all the Homa plants."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4641.08,"end":4641.56,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4642.84,"end":4646.93,"speaker":"Fr Stephen De Young","text":"Which these Plants had a derived hallucinogen."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4649.17,"end":4651.29,"speaker":"Fr Andrew Stephen Damick","text":"I feel like I read used, that."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4651.29,"end":4664.45,"speaker":"Fr Stephen De Young","text":"Was used for spiritual visions and they were the only ones who had access to it, which meant they were the only ones who could access the spiritual world and these visions because only they had the plants."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4664.93,"end":4666.53,"speaker":"Fr Andrew Stephen Damick","text":"It's like a Frank Herbert novel."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4669.34,"end":4672.94,"speaker":"Fr Stephen De Young","text":"Yes. Or like another novel, as you pointed out."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4673.26,"end":4679.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right. Yes, actually, it's true. Yes. I should look at my own notes in front of me here."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4680.54,"end":4684.46,"speaker":"Fr Stephen De Young","text":"Yeah, Haoma, I mean, you write all these things out and then you don't even look at them."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4684.86,"end":4748.73,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, it's really tempting to just kind of take a nap while you monologue, but no. So Haoma, it turns out that this word which refers to this sort of hallucinogenic drink or, or whatever, however they ingest it, that the word is cognate with the Vedic Sanskrit word soma, not, which is not related to the Greek soma, meaning body, but soma, for those who are Aldous Huxley readers, I won't say fans, I don't, I don't know. Yeah, aficionados. Yeah, yeah. If you read Brave New World, you know that the, the happy drug that everybody's taken in there, that keeps everybody, you know, docile, it's called soma. So. So, yes, yes. I mean, there's all kinds of weird, weird stuff going on in here, but yeah, I mean, it's like this kind of like they control the plant that gives you visions. Right. That the connection to the divine and so forth, like the spice must flow. But only for the navigators of the starships kind of thing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4748.73,"end":4781.98,"speaker":"Fr Stephen De Young","text":"Yes. So they've got this sort of chokehold on all the means of accessing the divine and they're exploiting it. And so Zarathustra comes along to end that. Right. And so he's going to reform religion on a number of levels. So one of those is going to be the attacking the first problem, which is this sacrificial system to the Vedic gods. They're demanding all these sacrifices for all these different gods."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4782.38,"end":4783.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4783.58,"end":4820.24,"speaker":"Fr Stephen De Young","text":"And over against that. Right. Over against those Vedic gods, like you say the Rig Veda, which are basically parallel to the Hindu gods he's going to talk about. So there are a couple of words that already exist for gods, as we've talked about. Most languages, especially most Indo European languages, have two different words that could be used for gods. One that means like higher tier gods and one that means like lower tier gods and spirits. We've talked about this before."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4820.88,"end":4821.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4821.36,"end":4941.24,"speaker":"Fr Stephen De Young","text":"Right. So Latin has This Greek has this, right? And so does Old Persian. And so there is a word ahura, derived from Asura that means God, but that's a higher tier God. And we're gonna see there's another word for sort of lower tier gods and spirits. But Zarathustra is going to talk about Ahura Mazda. So which means the God Mazda. As we said, their religion is called the worship of Mazda. So this Mazda, not a Miata, this God, pretty clearly in the way this God is described, is sort of taking the Vedic gods, Mitra and Varuna and smooshing them together, right. The way they're talked about, like in the Rig Veda, you take the two of them, you kind of roll them into one and you get something like Mazda, like a Hera Mazda. And so Ahura Mazda is basically the divine embodiment of all the good stuff. He creates the whole universe out of light and he's the one responsible for maintaining justice. And this is a concept of justice. So for, for the Persians it's called asha, Right. But we've talked about this in different cultures. Like in Egypt, it's Ma' at mishpat in Hebrew, right? This idea of cosmic order where everything is at its place and doing its thing and functioning properly. That sort of order of justice, they have that same concept. It's a Hura Mazda who created everything out of light originally and who then maintains that justice. Now, if you've read a little bit or heard a little bit about Zoroastrianism, you've been misinformed probably on this next."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4941.24,"end":4941.6,"speaker":"Fr Andrew Stephen Damick","text":"Point."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4943.92,"end":4976.97,"speaker":"Fr Stephen De Young","text":"Because you've probably, if you've gotten the super brief summary of Zoroastrianism, you've been told, oh, it's a dualistic religion, right. And specifically that there's like a good God and an evil God and that's it. They just have two gods, a good one and an evil one. That is not true about Zoroastrianism. That is more true, not totally true, but more true about Manichaeanism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4977.77,"end":4981.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, which is a much later development, much later thing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":4981.53,"end":5046.21,"speaker":"Fr Stephen De Young","text":"Manichaeanism is an Eastern, like Far Eastern, like Persian and Chinese and Central Asian primarily, although it went into Europe and even Western Europe and Africa. Form of Gnosticism that is sort of a blending of Gnosticism and Zoroastrianism in the post Christian period. And Manicheanism does have a good God and an evil God. Zoroastrianism doesn't really. So the quote unquote evil God that people talk about is the Angra manyu not the angry menu, Angra Menu, which is Ahura Mazda's shadow. And the reason it's described as a Hura Mazda shadow is precisely because they don't want to say it's a separate being that is like co. Equal with. With Ahura Mazda."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5046.69,"end":5047.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5047.25,"end":5088.87,"speaker":"Fr Stephen De Young","text":"Angra Manyu is his shadow. So if you have light, that light sort of cast shadows. Right. It's like necessitated by. Right. Don't go too young on this either. I know there's some of you Peterson heads out there who are already trying to do this whole Carl Jung embrace your shadow thing. It's not that either. But it is essentially the answer to well, hey, if. If Ahura Mazda is all the good stuff, where does all the bad stuff come from? And the bad stuff is the stuff that lies in his shadow is the idea."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5090.79,"end":5091.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5092.79,"end":5105.94,"speaker":"Fr Stephen De Young","text":"You don't even want to over personify his shadow. Right. But nor is it just oh, he has negative qualities too. Right. It's sort of a thing that's kept separated but not a separate being."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5107.7,"end":5108.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5109.94,"end":5136.61,"speaker":"Fr Stephen De Young","text":"Now that said the other, right. Mitra and Veruna kind of gets shoved together into Hura Mazda. The other Vedic gods don't totally get. Get done away with. Right. The old pagan gods, they aren't just, oh, those are fictional. We're done with those. So there was already a Persian word yazada that was used for sort of lesser gods and like nature spirits and."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5136.61,"end":5139.49,"speaker":"Fr Andrew Stephen Damick","text":"Stuff sort of maybe."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5139.49,"end":5187.87,"speaker":"Fr Stephen De Young","text":"Yeah. Or like demones in Greek. And so they get those old Vedic gods and stuff get demoted right. To, to this status. Okay. Now there's sort of phases in how they're talked about within Zoroastrianism. So it seems pretty clear that in the earlier phases, in the most ancient phases, they weren't really seen as separate beings from Ahura Mazda. They were seen as being some kind of powers or emanations from Ahura Mazda."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5192.03,"end":5192.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5192.51,"end":5210.84,"speaker":"Fr Stephen De Young","text":"What we might even call energies of Mahara Ahura Mazda or something. They, they take those things that used to be worshipped as gods that were independent entities and make them just kind of functions or powers or attributes or elements of a Huro Mazda sort of de."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5210.84,"end":5221.72,"speaker":"Fr Andrew Stephen Damick","text":"Personified. Yeah. So, so related to that. Before we move to the next section in our notes, we actually have a call that's come in. Father, can you believe."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5221.72,"end":5223.04,"speaker":"Fr Stephen De Young","text":"Is it a Zoroastrian?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5223.36,"end":5247.25,"speaker":"Fr Andrew Stephen Damick","text":"I don't actually know. I don't know. I don't know. His religion is not identified on the call board. Okay. But we, we do have Dan calling from Ontario, California. All right, Ontario. So I. E. Dan. Dan, welcome to the Laura Spirits podcast. Apparently you're from Father Steven's old stomping grounds."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5248.53,"end":5251.17,"speaker":"Dan","text":"Yes, I am. How are you guys doing today?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5251.73,"end":5252.69,"speaker":"Fr Andrew Stephen Damick","text":"Good, how are you?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5252.85,"end":5254.77,"speaker":"Fr Stephen De Young","text":"Is the Mills Mall still there?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5256.05,"end":5258.69,"speaker":"Dan","text":"Yes, actually, I live pretty darn close to it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5259.43,"end":5259.91,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5260.63,"end":5279.75,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow. You know, there's an Ontario in my background as well. There's Ontario, Ohio, which is right near where I went to high school, so. So we found something strange that we have in common. Father Stephen. All right, Dan, are you a Zoroastrian calling in to correct Father Steven and all these ridiculous things he's just said?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5281.59,"end":5285.76,"speaker":"Dan","text":"You know, in all honesty, I'm not sure if I am, and that's part of my question."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5286.32,"end":5293.2,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I mean, you would know if. Wouldn't you know if you'd been initiated into fire worship? I feel like you'd know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5293.28,"end":5298.24,"speaker":"Fr Stephen De Young","text":"Is, is this like a Vatican II anonymous Christians thing? Are there anonymous Zoroastrians?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5301.12,"end":5327.33,"speaker":"Dan","text":"I don't know. So as a Latter Day Saint, I decided to go to a Orthodox church and have a conversation with there and he called me a pagan. So now I'm very curious as to what is the actual definition of a pagan. And it is pretty sure it's not people against goodness and Normalcy."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5329.57,"end":5340.76,"speaker":"Fr Stephen De Young","text":"I don't know. Virgin. Virgin. Connie Swale would say otherwise. I am picking up what you are laying down. Nice."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5341.4,"end":5349.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, I don't, I don't know what this priest exactly had on his mind. There is."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5349.24,"end":5350.28,"speaker":"Fr Stephen De Young","text":"Other than his hat."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5354.76,"end":5488.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, so like the, the, you know, the Latter Day Saints. I mean, there's a certain level on which that religion is similar to ancient paganism. A certain level. Right, because there's multiple gods that can theoretically be worshiped. But when, when we talk about paganism on this show, we're, we're not referring to Mormonism, but referring rather to the religions practiced where, you know, initially there are kind of regional gods and then eventually you start getting imperial pantheons collected together. But the idea is that there are disembodied spirits that are particularly worshiped through embodiment in idols. And the worship is conducted primarily through offering food sacrifices to those idols. And then, you know, to use that to kind of manipulate the God and get what it is that you want out of them. And the reason why paganism is called paganism, where the word came from is it originally basically means, it's from Greek. And what it essentially means is hillbillies, pagos meaning hill. And the reason why that term is used that way is because it comes about, if I remember correctly, it comes about in the Christian period. The idea is, well, the people in the cities are much more Christians, but the people kind of out in the countryside, they're still, you know, practicing this older idolatrous religion. And so they just basically called them, you know, the, the hillbillies, effectively, really. So, yeah, so that's what I mean by paganism. I think that, as I said, I think that what Mormonism has in common with paganism is the idea that there are multiple gods that can be worshiped. But I mean, that is not the only thing that constitutes actual paganism. So, I mean, I wouldn't say to you as a member of the. I assume you're part of the Utah group, right? The Church of Jesus Christ of Latter Day Saints. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5488.49,"end":5490.37,"speaker":"Dan","text":"Not the fundamentals, but yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5491.09,"end":5543.89,"speaker":"Fr Andrew Stephen Damick","text":"I mean, there's dozens and dozens of LDS groups, but you're part of the big one. Yeah, I wouldn't say you're a pagan. I mean, I would say you are LDS or you're. I mean, I know that Mormon is not the word. I mean, maybe under your new prophet, president, as he comes in, Mormon will come back as a word you guys are allowed to use for yourselves. I don't know, but that's what I would say. I would talk about your particular thing. But yeah, I mean, paganism is, like I said, it's a very broad term that refers to a lot of different religious traditions, but they tend to all have this in common, that there's idolatry at the center, the use of images to trap and control spirits and offering sacrifices to those images in order to have this relationship with the God. So I don't know. That's my kind of short, somewhat rambly version of what paganism is. Is there anything you might add to that, Father Stephen, or."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5544.37,"end":5563.96,"speaker":"Fr Stephen De Young","text":"Well, I mean, when we, when we use it on the show, we're usually talking about. Yeah, religion. Religions that involve the sacrificial worship of. Of gods, goddesses, usually involving idols."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5564.28,"end":5564.84,"speaker":"Fr Andrew Stephen Damick","text":"That's."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5565.08,"end":5623.36,"speaker":"Fr Stephen De Young","text":"That's what we mean by, by paganism. And that's why we say there's sort of. In the ancient world, sort of all you have is paganism. I agree with Father Andrew. He probably meant more like polytheist, you know, which you could argue that Alias in various ways is polytheistic, not just because there's a heavenly father and a heavenly mother, but because there are in existence multiple heavenly fathers and heavenly mothers. That is polytheistic. You know, the church fathers sometimes use the term polytheistic, very rarely Use the term pagan. They usually just talk about the Greeks. Yeah, the Greeks, even the ones who were Greek and are writing in Greek, refer to what we would call pagans as the Greeks. So I think we should go back to that and just make all the Greek Orthodox people mad."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5627.76,"end":5631.28,"speaker":"Fr Andrew Stephen Damick","text":"Does that clear things up a bit for you, Dan from Ontario, California?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5632.72,"end":5644.25,"speaker":"Dan","text":"Yeah, it does clear up the pagan part, but I'm not quite sure what you mean about how LDS worship multiple jobs. That's something I've never been."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5645.05,"end":5696.46,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, so my understanding, correct me if I'm wrong here, is that, you know, the people on Earth all have. All share one heavenly Father and Heavenly Mother, and you would worship the Heavenly Father, but, you know, there are potential multiple heavenly fathers that could be worshiped. But, you know, it's sort of. Well, you have your local one, but there's, you know, a potentially infinite number. So that's where the, you know, the. The polytheism aspect of it comes into play. It's not so much that, according to my understanding that the LDs practice worship of all of those beings, but that they are all worshipful. And in other contexts, they certainly could be and maybe have been worshiped. So is that not so?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5696.46,"end":5703.38,"speaker":"Dan","text":"I've never heard. I mean, I understand the possibility of, you know, other heavenly fathers who."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5703.62,"end":5705.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5705.14,"end":5714.98,"speaker":"Dan","text":"Came before, but I've never heard of anybody worshiping any of it. It's the one. Just been the. One of this world thing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5714.98,"end":5716.42,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah, I mean, of."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5716.42,"end":5727.71,"speaker":"Fr Stephen De Young","text":"Right. But that's understanding. That's not required for polytheism. So, like, the ancient actual pagans who we call polytheists, didn't worship all the gods."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5728.67,"end":5730.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they just mainly worshiped."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5730.35,"end":5765.48,"speaker":"Fr Stephen De Young","text":"They just worshiped one or two. Right. The gods of their city. Right. Or their area where they were. The place where they were. They worshiped those one or two. And then they acknowledge the existence of, you know. Well, yeah, those folks over there have theirs and they have theirs and it's. So Mormonism would be like that or letters. Is it? Be like that, but just on a, like, intergalactic scale rather than on a, like, local scale. We're not talking about, like, the next city. We're talking about, like, another planet."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5766.04,"end":5779.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So. All right, well, thank you very much for calling, Dan. Okay, well, rolling on one final bit in this half of the Lord of Spirits episode."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5780.07,"end":5787.71,"speaker":"Fr Stephen De Young","text":"Not a Zoroastrian, not a Zoroastrian. Whatever else our friend may be, he is not a Zoroastrian."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5787.71,"end":5790.47,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, so we're going to talk about some specific practices I wanted to say."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5790.47,"end":5799.35,"speaker":"Fr Stephen De Young","text":"Well, before that I wasn't quite done with the. So we're talking about the old Vedic gods. Right. Getting kind of demoted."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5799.99,"end":5802.07,"speaker":"Fr Andrew Stephen Damick","text":"Those long pauses that throw me father."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5802.79,"end":5838.07,"speaker":"Fr Stephen De Young","text":"In the earliest phases. Well, that's why they get edited out, I guess. I mean, I could. So the earliest phases, we were saying, they're kind of seen. They're turned into sort of emanations or qualities or aspects of a Hura Mazda. But they're still talked about. I mean, they have personal names. They're still kind of talked about in language not that dissimilar from the way they were talked about in the Vedas until you get to. Especially the Muslim period."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5838.63,"end":5839.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5839.83,"end":5887.95,"speaker":"Fr Stephen De Young","text":"So the second Persian empire that we mentioned before the Sassanids get invaded and that empire gets wiped out by Arab Muslim armies. And so in order to try to keep functioning under Islamic rule. Because if there's one thing Islam doesn't like, it's idolatrous paganism. If it's two things they don't like, it's that. Well, okay, I'm not gonna say what I was about to say. Even I pulled back from that. Anyway, so they shift to saying, okay, well those, those Vedic gods now they're like angels."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5889.39,"end":5889.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5890.35,"end":5967.01,"speaker":"Fr Stephen De Young","text":"So there's kind of a shift to put it into terms more amenable to the Muslim mind. Right. So that. Right. So they're trying to cat. Sort of cast themselves as monotheists, right? No, we just worship the one God, Mazda. See, we're monotheists and they're. These other beings we talk about are just. They're. They're like angels. Right? Like you guys got angels. Yeah, right. So, yeah, see, they're like angels, but that seems to be a sort of. Not the original idea. There seems to be a lot more carryover of their old divine status in the original concept. But you can also see in that idea of there being this multitude of emanations of Ahura Mazda. You can see how. And in some of the other things we've said, you could probably see some connection points already to Gnosticism that will explain how Manicheanism ends up coming and coming to exist later on. Yeah, Places where they link together. So then in terms of religion, in terms of religious practice, like what were Zoroastrians doing when we first meet them back in the 6th century B.C."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5967.57,"end":5967.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5967.93,"end":5992.3,"speaker":"Fr Stephen De Young","text":"In the original Persian Empire. So essentially the. The religion as such, the religious practices as such are aimed at a kind of what we would call spiritual warfare. So you're doing certain rituals and saying Mantras, which very clearly is related to mantras five times a day."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5994.38,"end":5994.74,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":5994.74,"end":6131.38,"speaker":"Fr Stephen De Young","text":"In order to help preserve the order of the cosmos that we were talking about, the order of justice that's put into the world originally by Herzamaza the Asha and to sort of perpetuate, keep the world going. So you have this series of rituals, you have these mantras that are pronounced five times a day and you're a part of this. And then you've got our friend Hauma coming back. You have the use of psychedelics to enter the spirit world now liberated from just that Brahman class, from that priestly cast, so that everyone could use it such that the. So water is important in Zoroastrian ritual at this point. And so there is a thing, there's an initiation ritual which involves water. It involves you going into the water. So clearly that's where we stole baptism. It has nothing to do with. With Jewish ritual washings or any of the ritual washings. Human religion clearly just stolen from the Persians. But you go into the water and then key element, you take Alma for the first time and you have your first trip, your first psychedelic trip. That's what initiates you sort of into the religion. That's what makes you then part of. Able to participate in these ritual processes that perpetuate the order of the world. And so there's sort of an annual cycle of festivals. In addition to the daily mantras and the rituals, there are fires that are tended in the old. So in the old Persian Empire, there were three primary fires in three different cities that were said to by burning, keep the world going. Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6131.38,"end":6140.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think. And there's this idea that the fires go back to a fire initially lit by Zarathustra himself."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6141.26,"end":6141.66,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6142.38,"end":6201.32,"speaker":"Fr Andrew Stephen Damick","text":"And actually, you know, a number of. A number of years ago I was in Toronto doing a speaking engagement and a friend of mine was taking me around the city and he said, oh, hey, there's actually a Parsi community here in Toronto. So if you don't know, folks, Parsis are a group of Zoroastrians who at some point a long time ago immigrated from Iran to India. And so they're Indian Zoroastrians. And there's not a lot of them. There's not a lot of them in the world. There's not a lot of Zoroastrians in the world, honestly. And they have a community up there. And so there's a Zoroastrian kind of community center and temple there. And so we pulled off and I'm always kind of Religiously curious. And so we came upon this young lady who was sitting down and reading on a bench, and she asked us who we were. She could tell that we weren't part of her group. And we said, hey, we're just curious. We want to know what it is that y' all do."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6201.32,"end":6201.58,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6201.65,"end":6294.71,"speaker":"Fr Andrew Stephen Damick","text":"And so she took us on a tour. And it was kind of a big sort of mansion and mostly essentially a community center, but they did have a room that was dedicated to their religious rituals. And she said, you know, this is our. I think she might have said, temple over here. She said, but you can't. You can't go in there. You can't step your foot in there. And so he said, okay, that's cool. But I said to her, you know, if I don't. If. As long as I don't go in there, if I don't put my foot in there, can I, like, peek my head in the door? Can I look around the. Look. Look inside just so I could see what's in there? Because the door was open. And she said, yeah, that's okay. And so I poked my head in the door, and it was, you know, rectangular room, not very ornate. Um, and then on one end of it was a sort of a raised platform, and in the middle of that platform was what looked like one of our infant baptismal fonts. You know, so like a big sort of kettle. And. And in it was a pile of ashes. It was not burning at that moment. But the idea, I think, is that, you know, wherever you go in the world, if you go to Zoroastrian temple and they've got their fire there, that it has this connection sort of like, you know, almost like apostolic succession or whatever, you know, that it goes all the way back to that original fire lit by. By their founding prophet himself."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6295.11,"end":6299.11,"speaker":"Fr Stephen De Young","text":"Because those three from the old Persian Empire are all out, but."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6299.19,"end":6300.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6300.87,"end":6303.35,"speaker":"Fr Stephen De Young","text":"Supposedly ashes from them have continued burning."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6303.43,"end":6303.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6303.79,"end":6305.99,"speaker":"Fr Stephen De Young","text":"In other places they've been transmitted. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6306.23,"end":6306.79,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6306.95,"end":6321.52,"speaker":"Fr Stephen De Young","text":"Yep. Yeah. And so the other. The other famous thing, potentially, if anything is famous about Zoroastrianism is their quote unquote, burials, which aren't really burials."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6322.88,"end":6323.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6323.52,"end":6353.46,"speaker":"Fr Stephen De Young","text":"Which sort of fly in the face of what every pagan in the world did with the dead. That's in that they actually would expose the bodies in an elevated place so that they would be eaten by birds. Like all the other pagans of the ancient world were desperately trying to stop that from happening. Like, that was the ignominious, cursed death that no one wanted. But."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6353.54,"end":6353.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6354.34,"end":6355.78,"speaker":"Fr Stephen De Young","text":"That's how they buried their dad."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6356.18,"end":6361.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, you know, big featured in the Iliad. Don't leave the bodies out to be eaten by animals."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6362.81,"end":6403.19,"speaker":"Fr Stephen De Young","text":"But so they would. And the idea was that because everything is created out of light, that includes people, the light is in some way an emanation of Ahura Mazda himself. And so by your body being devoured, that releases the light that's trapped within you to return to. Yeah, to their God. And again, you could see how Gnosticism dovetails into that. But you can also see shades of Brahmanism in that and other sort of traditions. Right, so this isn't. Zoroastrianism is not this completely foreign thing that shows up."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6403.59,"end":6404.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6405.03,"end":6412.87,"speaker":"Fr Stephen De Young","text":"But it is also its own unique sort of evolution and twist on these various traditions."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6413.03,"end":6414.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6414.47,"end":6459.08,"speaker":"Fr Stephen De Young","text":"That you find elsewhere, as we also mentioned, very intolerant religion, unlike Cyrus's policies. This would especially become apparent in the Sassanid Empire, which, as we mentioned, is post Christian, but absolutely brutal persecutors of Christians within the Persian Empire, like, well beyond even the stuff the Romans did to Christians. And you can read, if you go and read the stories of the Persian martyrs stuff you read volume one of the History of Christianity in Asia, there will be some. There are some stories in there to curl your toes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6459.8,"end":6460.36,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6460.84,"end":6472.32,"speaker":"Fr Stephen De Young","text":"There are also two Persian bishops at the Council of Nicaea. Nonetheless. So there were a lot of Christians who still continue to be Christians within that Persian Empire, despite Zoroastrian persecution."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6472.56,"end":6488.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, before we take our second break, I just wanted to, you know, drop this on all the fans out there who may not know this. The world's most famous Parsi Zoastrian of our time, Freddie Mercury, the lead singer of Queen."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6489.2,"end":6492,"speaker":"Fr Stephen De Young","text":"So on that have a sky burial."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6492.88,"end":6501.23,"speaker":"Fr Andrew Stephen Damick","text":"I. I don't. I don't think so. I'm not sure. Anyway, we're gonna take our second break."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6501.23,"end":6504.47,"speaker":"Fr Stephen De Young","text":"Remains of Freddie Mercury. And we'll be right back."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6505.19,"end":6521.51,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6528.67,"end":6598.22,"speaker":"Announcer","text":"Ancient Near Eastern texts such as the Baal Cycle portray the pagan God Baal as a rebel, the hero of a revolution, worshiped and glorified for his long string of victories. In the Baal book, A Biography of the Devil, Fr. Stephen DeYoung shows that the Hebrew Scriptures consciously turn the Baal story on its head, depicting him as a failed and defeated rebel who nonetheless tries to steal the glory that belongs to Almighty God. From these scriptures, the figure of the devil emerged within Jewish and Christian tradition. Father DeYoung works through the Old and New Testament passages that refer to various BAAL stories. And he surveys BAAL worship through followers, beliefs, religious, religious practices and liturgical life. In these pages we will see that the figures of BAAL and the devil, the Prince of demons, are one and the same. To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6598.22,"end":6613.29,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6614.65,"end":6620.33,"speaker":"Fr Andrew Stephen Damick","text":"You know the way that he pronounced baal in that, I mean, it's, that's probably closer to correct."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6620.41,"end":6622.17,"speaker":"Fr Stephen De Young","text":"You could do baal, you could do."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6622.17,"end":6626.41,"speaker":"Fr Andrew Stephen Damick","text":"Baal, but baal, it kind of ruins all the puns."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6626.97,"end":6631.45,"speaker":"Fr Stephen De Young","text":"Yes, baal. And he talks about BAAL worship, that people are going to think we're flat Earthers."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6636.78,"end":6645.26,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So someone wrote in and apparently, and I checked, Freddie Mercury was cremated. So I don't know, is that blasphemous? I don't know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6645.34,"end":6646.14,"speaker":"Fr Stephen De Young","text":"Pointing."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6646.78,"end":6661.42,"speaker":"Fr Andrew Stephen Damick","text":"It is kind of disappointing. There's some wild stuff going on in the chat, though. There's one fellow that's saying that Stonehenge was built by Phoenicians under the rule of King Solomon."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6662.14,"end":6665.74,"speaker":"Fr Stephen De Young","text":"So is, is this one of these Lebanese folks who just wants to take credit for everything?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6668.06,"end":6689.17,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I don't fault them for that. I don't fall for them for that. But also, I mean, he's also saying that some theory about Zoroastrianism arising under frankly, Jewish influence in the Persian empire, that it. I'm sure you've heard of that idea. What do you think of that?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6690.21,"end":6704.13,"speaker":"Fr Stephen De Young","text":"Well, no, that just seems to be an inversion of the. Yeah, that's a. No, you. Right. Like the common scholarly theory is that all this stuff in Second Temple Judaism came from Persian religion."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6704.13,"end":6704.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6704.61,"end":6706.29,"speaker":"Fr Stephen De Young","text":"And so that's just saying. No, you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6706.85,"end":6707.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6707.89,"end":6709.73,"speaker":"Fr Stephen De Young","text":"No, it actually all came from Judaism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6710.38,"end":6711.54,"speaker":"Fr Andrew Stephen Damick","text":"No, I mean, I don't see how."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6711.54,"end":6714.74,"speaker":"Fr Stephen De Young","text":"You get psychedelic drug use and all this other stuff from Judaism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6714.74,"end":6715.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6715.9,"end":6720.7,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, I see how you get it from Hinduism, but I don't see how you get it from Judaism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6720.7,"end":6729.34,"speaker":"Fr Andrew Stephen Damick","text":"I mean, just because things are similar doesn't mean that they're. One is derived from the other. You Know, correlation does not equal causation."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6729.5,"end":6731.42,"speaker":"Fr Stephen De Young","text":"And again, they're not even that similar."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6732.3,"end":6734.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6735.59,"end":6736.87,"speaker":"Dan","text":"Yep, yep, yep."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6737.35,"end":6744.47,"speaker":"Fr Stephen De Young","text":"I mean, to get to similar stuff, you have to really. You have to be like, well, rituals involving water."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6746.87,"end":6747.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6747.27,"end":6748.95,"speaker":"Fr Stephen De Young","text":"Annual cycle of feasts."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6749.35,"end":6753.95,"speaker":"Fr Andrew Stephen Damick","text":"I mean, everyone has rituals involving water. Everyone has annual cycle."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6753.95,"end":6758.67,"speaker":"Fr Stephen De Young","text":"You have to take it out to such a level of vagary that you're not really saying anything anymore."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6758.67,"end":6760.39,"speaker":"Fr Andrew Stephen Damick","text":"They eat bread. Wheat bread."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6760.79,"end":6769.91,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. You know who else ate bread? Adolf Hitler. So."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6769.91,"end":6775.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Good times, good times. Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6775.23,"end":6788.26,"speaker":"Fr Stephen De Young","text":"But we'll be talking a lot. I'm going to do a teaser coming soon. Not the next episode you're going to hear, which has already been recorded. There's going to be some timey wimey stuff happening with episodes, folks."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6788.26,"end":6788.82,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6788.82,"end":6794.34,"speaker":"Fr Stephen De Young","text":"Get ready for it. But coming soon, an episode about Mithras."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6795.3,"end":6795.94,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6796.42,"end":6803.38,"speaker":"Fr Stephen De Young","text":"Where you're going to find out that all those things that are like, the same as Christianity and Mithraism are phony."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6804.98,"end":6805.86,"speaker":"Fr Andrew Stephen Damick","text":"I knew it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6806.58,"end":6812.02,"speaker":"Fr Stephen De Young","text":"So get ready for it. Literally everything you've been told about Mithraism is wrong."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6812.9,"end":6815.38,"speaker":"Fr Andrew Stephen Damick","text":"Except my favorite thing is, like, wrong."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6815.38,"end":6821.83,"speaker":"Fr Stephen De Young","text":"Like a lie. Like a fabricated lie. Like not a little off base, made up."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6822.15,"end":6835.59,"speaker":"Fr Andrew Stephen Damick","text":"As I was telling you earlier today, I like the fact that the guys on. Or maybe just Tom Holland on the Rest is History podcast refers to Mithraism as basically the Freemasonry of the Roman Empire."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6836.79,"end":6839.27,"speaker":"Fr Stephen De Young","text":"Yeah, that is a little bit apropos."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6839.51,"end":6846.23,"speaker":"Fr Andrew Stephen Damick","text":"Bunch of guys gathering together in some secret place, making connections with each other. Secret hand."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6846.31,"end":6850.35,"speaker":"Fr Stephen De Young","text":"Although it was especially popular in the military, which is. Which I don't know that Freemasonry is."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6850.75,"end":6858.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, all right, We. We actually do have a couple of calls, so we're going to go ahead."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6858.71,"end":6860.91,"speaker":"Fr Stephen De Young","text":"Is one of the colors good and the other one evil?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6861.31,"end":6862.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I'm sure that's. Yes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6862.87,"end":6865.95,"speaker":"Fr Stephen De Young","text":"We have a mannequin half metaphysical dualism."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6867.15,"end":6878.58,"speaker":"Fr Andrew Stephen Damick","text":"We have. We have William, who is from a mountaintop in Tennessee. So he's called before. Welcome, William. Welcome back to the Laura Spirits podcast."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6879.62,"end":6883.7,"speaker":"Dan","text":"Thank you. Oh, King of Media, can you confirm."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6883.7,"end":6885.62,"speaker":"Fr Stephen De Young","text":"Killing a bar when you were only three?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6886.58,"end":6888.98,"speaker":"Dan","text":"I was actually five. That was slightly exaggerated."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6889.3,"end":6892.66,"speaker":"Fr Stephen De Young","text":"Okay, that happened. And you know, William was at."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6892.9,"end":6899.38,"speaker":"Fr Andrew Stephen Damick","text":"Was at Losercon Lord of Spirits conference this last weekend. So how are you doing?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6900.83,"end":6902.59,"speaker":"Dan","text":"I am doing very well, thank you."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6903.15,"end":6905.07,"speaker":"Fr Andrew Stephen Damick","text":"Yep. What's on your mind?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6907.87,"end":6931.83,"speaker":"Dan","text":"So I had two questions. One relating to Zoroastrianism, one relating to King Cyrus. On Zoroastrianism, you mentioned that it was not A very tolerant religion of other religions. Did it conceive of itself as a proselytyping religion, as a universal religion? And did it once it's devotees to become Uber mention?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6934.79,"end":6958.7,"speaker":"Fr Andrew Stephen Damick","text":"You know, I don't know the answer to that, but I do know that now this is my understanding you have to be born into it. And this is one of the reasons it's dwindling is that you can't convert. Although I think maybe some groups do allow some conversions, but mostly they don't. But I don't know if that's a, a later development or what do you know? Father, are they. Yeah, they're proselytizing Zoroastrians in the ancient world."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":6958.7,"end":7020.82,"speaker":"Fr Stephen De Young","text":"So no, they didn't proselytize per se. The Zoroastrian practitioners were performing their duties on behalf of the world. But the intolerance comes from. They thought that other people practicing these other religious forms interfered with like actively, were actively working against them. So Christians, by being Christians within the Persian Empire, their ritual life was actively working against what the Zoroastrian state religion of the Sassanid Empire was trying to do. And what they were trying to do was preserve justice and the world. Right, Right. So yeah, they viewed, they viewed Christians as this evil and malign corrupting element in society that needed to be eradicated and that's why they were so intolerant."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7023.14,"end":7024.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7024.66,"end":7041.65,"speaker":"Fr Stephen De Young","text":"And in terms of Uber mention, there seems to be literally no as as much as I love it and, and listen to it in audio form and read it both at least once a year. There seems to be no connection between Nietzsche's Zarathustra and the historical Zarathustra."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7042.53,"end":7046.29,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go. What's your other question, William?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7047.25,"end":7092.06,"speaker":"Dan","text":"This one is on King Cyrus. So you mentioned that he was a legendary figure that Alexander modeled himself after. But then after Alexander it seemed that he was the one that people including Caesar Augustus wanted to model themselves after. And this sort of mystic understanding of someone like an Alexander or Julius Caesar or King Arthur. How did the figure of Cyrus evolve or persevere from the classic Persian to the Parthian to the Sassanid and then into the Islamic and period and Renaissance era."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7093.26,"end":7095.9,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Could you just write a book about that, Father Stephen?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7098.22,"end":7100.3,"speaker":"Fr Stephen De Young","text":"I mean I got a long list."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7100.86,"end":7103.66,"speaker":"Fr Andrew Stephen Damick","text":"Cyrus through the Ages. Yeah, I mean that's huge."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7104.62,"end":7161.71,"speaker":"Fr Stephen De Young","text":"But he is so he does he obviously, as you mentioned, the Sassanids, etc. Are consciously trying in the same. Are constantly trying to consciously trying to revive Cyrus's Achaemenid empire when they formed the second Persian Empire before it's wiped out. But I think the places where you see his legend then crop up is more figures like Tamerlane and some of the other Central Asian. Right. I think that's sort of where his memory goes because, as you mentioned, Alexander the Great in the Roman imaginary, as much as I hate to use that term, and. And then the medieval and Renaissance Europe is hyper obsessed with Rome."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7162.35,"end":7162.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7165.15,"end":7210.1,"speaker":"Fr Stephen De Young","text":"And so in that area, it fades. But I think in. In Central Europe is where Cyrus continues to be seen as this sort of foundational figure, because he arises, you know, on the. On the Persian plateau, but he doesn't then go west. He's not a Westerner or whatever. He's not someone from outside of Asia who comes and conquers Asia like Alexander. He's an Asian who conquers elsewhere. Right. And remains Asian. So I think that's the place, really, where his. His status as a legendary and heroic figure more continues."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7210.66,"end":7227.86,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right, well, thank you very much for calling, William. Okay, we're going to take one more call. We have Barbara calling from Ohio. Is it Ohio? I see Post Falls. Is there a Post Falls in Ohio? I know there's one in Idaho."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7229.22,"end":7230.42,"speaker":"Dan","text":"Yeah, no, it's Idaho."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7230.42,"end":7234.66,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, you're in Idaho, Mike, come on. It's Idaho, not Ohio."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7234.66,"end":7237.7,"speaker":"Fr Stephen De Young","text":"Those are not the same place, state, geography, my friend."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7241.94,"end":7253.14,"speaker":"Fr Andrew Stephen Damick","text":"We should call out Mike on the air more often. I feel like he might do a better job. Barbara, hello. Welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7253.62,"end":7262.87,"speaker":"Fr Stephen De Young","text":"How often do people tell you they're coming to get you? I guess you don't get that reference. Never mind. Go ahead."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7263.35,"end":7283.32,"speaker":"Dan","text":"No, sorry. No. Dang it. But really quick, before I get to my questions, in your. I guess your new book that you're going to do on Cyrus, could you also continue that to his representation in the movie the Warriors? Because that would be great."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7284.04,"end":7292.52,"speaker":"Fr Stephen De Young","text":"Yes. I'll even include a chapter in this hypothetical book that you'll never see on Cyrus, the virus as portrayed by John Malkovich."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7293.96,"end":7296.92,"speaker":"Dan","text":"Okay, I don't even know that one."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7298.28,"end":7299,"speaker":"Fr Stephen De Young","text":"Con Air."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7299,"end":7346.81,"speaker":"Dan","text":"Okay, so I guess my question actually does have to do with another movie. I just got back from watching Ton Airs in theaters, and something I've noticed in, like, all the Tron movies is that there's this, like, connection that. That seems to be really similar to Zoroastrianism, where there's, like, a creator who created things out of light and he has clue. Right. Who's like his shadow who turns out to be the bad guy, even. And I think I was just curious about if you've noticed any connections between Zoroastrianism and the movies Tron."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7347.69,"end":7358.17,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I've only seen the first Tron movie and it was the 80s, I think when I saw it. I remember the Tron fights for the users."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7359.69,"end":7413.16,"speaker":"Fr Stephen De Young","text":"I first saw the movie Tron, the original Tron, at Uncle Howie's Pizza. Hey, projected onto a big screen, right? Like it was the actual film reels projected on big screen at Uncle Howie's Pizza. At a pizza party we had because we got second place in second grade. A yso soccer. Wow, thank you very much for the season. Got a silver medal and everything. But I have seen the other Tron movies. I haven't seen Aries yet, but I plan on it. But probably not till it goes to Disney plus because theaters are expensive and I'm Dutch. But I hadn't thought about it before, but I, I, I see what, I see what you're, I'm picking up what you're laying down. I see what you're saying here."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7416.88,"end":7417.04,"speaker":"Announcer","text":"And."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7417.04,"end":7453.77,"speaker":"Fr Stephen De Young","text":"I think, I think there are some elements. I think there are some elements there. See, I thought you were going to do this whole Pageau AI thing and I was going to have to poo poo it. But I will do no poo pooing because yeah, I think, I mean, obviously, you know, you could push it too far. There's no sky burials, right. And I guess they were kind of hallucinogens. There were drugs sort of in the second one. So yeah, there might, there might be something there. There might be something there."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7455.05,"end":7455.73,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7455.73,"end":7479.81,"speaker":"Fr Stephen De Young","text":"I don't know who wrote Tron. I don't know either, or any, or any of the sequels, but there are some elements there. Now there may. The tough thing would be differentiating what Zoroastrian, what's Manichean, what's just kind of gnostic. But there's a confluence of ideas there, I think in Tron that I think you're right about."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7483.17,"end":7488.77,"speaker":"Fr Andrew Stephen Damick","text":"Well, I hope that helps on some level, Barbara. It's an intriguing idea."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7489.49,"end":7497.25,"speaker":"Fr Stephen De Young","text":"I've been planning on doing a rewatch of the first two before I see Ares. So now I'm going to be thinking about this while I. So maybe I'll report back in a few future episode."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7497.25,"end":7505.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I have to give them all a watch. It's been many, many. It's probably been, I don't know, 40 years since I saw the original one."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7505.61,"end":7520.09,"speaker":"Fr Stephen De Young","text":"So this, the second one is the rare one where that digital de aging really works because they're supposed to be computer programs. Right, right. So the fact that it looks kind of cgie a digital like works should be that way."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7520.17,"end":7520.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7522.58,"end":7523.58,"speaker":"Fr Stephen De Young","text":"It shouldn't look perfect."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7523.58,"end":7524.1,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7526.1,"end":7527.62,"speaker":"Fr Stephen De Young","text":"Kenny Valley works in your favor."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7528.18,"end":7530.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling, Barbara."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7531.78,"end":7532.58,"speaker":"Dan","text":"Thank you, guys."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7533.14,"end":7538.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you're welcome. Well, we promised another messiah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7540.42,"end":7550.11,"speaker":"Fr Stephen De Young","text":"Well, you know, I wonder if she would have gotten the reference if I'd said it as, you know, they're coming to get you, Barbara. But now she's off the line, so she can't tell us."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7550.59,"end":7552.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I don't know."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7552.51,"end":7565.23,"speaker":"Fr Stephen De Young","text":"I mean, that's one of the classic movie lines of all time. And it's October. But anyway, I guess she's lived a charmed life not having, like, goons like me follow her around and say that in high school or something. So."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7565.95,"end":7566.59,"speaker":"Fr Andrew Stephen Damick","text":"Fair enough."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7568.59,"end":7595.47,"speaker":"Fr Stephen De Young","text":"So, yes, Cyrus, in the Bible, what we were actually going to talk about tonight. Let's get to it. More than two hours in. Yes, this is our want. So there are a few places where Cyrus pops up in the Bible. The first one is just mentioning one of the very important things he did, biblically speaking, and that's in second chronicles 36, 22, and 23."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7596.27,"end":7633.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is the very end of second chronicles, starting with verse 22. Now, in the first year of Cyrus, king of Persia, that the word of the Lord by the mouth of Jeremiah might be fulfilled. The Lord stirred up the spirit of Cyrus, king of Persia, so that he made a proclamation throughout all his kingdom and also put it in writing. Thus says Cyrus, King of Persia, the Lord, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah. Whoever is among you of all his people, may the Lord his God be with him. Let him go up. So I mean, this is the. Basically the end of the. Of the exile, right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7633.86,"end":7679.72,"speaker":"Fr Stephen De Young","text":"Right. So this is the end of the exile. But notice that this is the next thing we read is going to expand on this even more. But notice the motivation here is not just like, you know, oh, why did those pesky Babylonians, those meanies, make all these Jews come here to Mesopotamia? Let's let him go home. He's sending them back in order to rebuild the temple is how this is framed. Right. That's the purpose for which. So he's like, he what he literally says there is. Yahweh wants me, wants a temple built for him in, in Jerusalem. So, hey, any of you people who are from there who want to head back and do it, go for it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7680.44,"end":7682.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7683,"end":7701.16,"speaker":"Fr Stephen De Young","text":"So that's a little bit of a different causal chain than the way we normally think about it. It's not that he gets a petition, oh, hey, there's a new emperor. Let's petition him and see if he'll let us go home. No, it's God's doing, and it's for the purpose of building the temple. But this gets expanded upon at the beginning of the Book of Ezra."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7701.64,"end":7817.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which in a lot of Bibles is literally the very next thing in. In the Bible. Okay. Ezra, chapter one, verses one through eleven. In the first year of Cyrus, king of Persia, that the word of the Lord by the mouth of Jeremiah might be fulfilled. The Lord stirred up the spirit of Cyrus, king of Persia, so that he made a proclamation throughout all his kingdom and also put it in writing. This is almost exactly the same. Thus says Cyrus, king of Persia, The Lord, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah. Whoever is among you of all his people, may his God be with him. And let him go up to Jerusalem, which is in Judah, and rebuild the house of the Lord, the God of Israel. He is the God who is in Jerusalem. And let each survivor, in whatever place he sojourns, be assisted by the men of his place with silver and gold, with goods, and with beasts besides free will offerings for the house of God that is in Jerusalem. Then rose up the heads of the fathers, houses of Judah and Benjamin, and the priests and the Levites, Esther. Everyone whose spirit God had stirred to go up to rebuild the house of the Lord that is in Jerusalem. And all who were about them aided them with vessels of silver, with gold, with goods, with beasts, and with costly wares, besides all that was freely offered. Cyrus the king also brought out the Lord, vessels of the house of the Lord that Nebuchadnezzar had carried away from Jerusalem and placed in the house of his gods. Cyrus, king of Persia, brought these out in the charge of of Mithradath, the treasurer, who counted them out to Sheshbazar, the prince of Judah. And I would. I don't recommend naming your kid that. And this was the number of them. 30 basins of gold, thousand bases of silver, 29 sensors, 30 bowls of gold, 410 bowls of silver, and a thousand other vessels. All the vessels of gold and silver were 5,400. All these did Sheshbazar bring up when the exiles were brought up from Babylonia to Jerusalem. It is fun to say Shesh Bazaar, though."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7817.4,"end":7820.2,"speaker":"Fr Stephen De Young","text":"Yeah. All the kids calling him Shesh. What up, Shesh?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7820.6,"end":7821.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7821.64,"end":7828.92,"speaker":"Fr Stephen De Young","text":"So bad. Yeah. Popular last name among."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7830.76,"end":7831.4,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7831.4,"end":7832.72,"speaker":"Fr Stephen De Young","text":"Certain Middle Eastern folk."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7832.72,"end":7833.4,"speaker":"Fr Andrew Stephen Damick","text":"We know a few."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7835.4,"end":7835.8,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7837.56,"end":7837.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7837.92,"end":7869.01,"speaker":"Fr Stephen De Young","text":"As you noted, the beginning of Ezra is verbatim the end of First Chronicles or Second Chronicles. Confounding that even more. If you know the Greek Old Testament tradition, there's actually another book called First Ezra that is in between in the Greek. That is literally a chunk of the book of Ezra and a chunk of Second Chronicles smushed together. That is in there in addition to two Chronicles and canonical Ezra."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7869.54,"end":7872.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like they got together and had a baby."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7872.82,"end":7890.74,"speaker":"Fr Stephen De Young","text":"But that's a topic for another episode. Yes, there's another episode. We used to do that all the time. We'd be like, someday we'll do an episode. Well, we're starting that again, apparently, because you've already gotten promised a Mithraism episode and now I'm talking about doing a Books of Ezra episode because there's like four of them."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7891.3,"end":7892.26,"speaker":"Fr Andrew Stephen Damick","text":"That would be fun."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":7895.15,"end":8050.37,"speaker":"Fr Stephen De Young","text":"So. But we shall see. But for now, Right. Basically what we get here then is more detail that not only does he send them back to build the temple, but he hauls out all the stuff from the temple that Nebuchadnezzar stole and gives it back essentially, sort of officially by way of his treasurer to the heir to the throne of Judah. But again, the purpose is to build. Is to build this temple. Right. And he's sending them back to do it. And so the idea here is that Cyrus has been so moved by God that he wants the temple rebuilt so that sacrifices could be offered to Yahweh, the God of Israel, on his behalf. And we talked about how this was his general religious sort of paradigm, right. This was how he approached religions. So that's sort of the key historical importance for the story of the Old Testament, of Cyrus. He's the one who allows them to go back from exile. He puts an end to the exile. He not only permits but facilitates the rebuilding of the temple in Jerusalem. He does these things. So that's the historical element there. There's also then a theological element to this. And this comes from what is a fairly well known passage in Isaiah and Isaiah, it's the end of chapter 44, the beginning of chapter 45. Now, so a word about Isaiah before we read it. Okay, so this is in part of Isaiah that your rando Old Testament scholars will tell you is deutero Isaiah. Yeah, that may be just one of two parts of Isaiah or if they're really nasty, then there will also be a tritto Isaiah, a third Isaiah. Now, there's two elements to this, and we have to distinguish these."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8050.45,"end":8050.93,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8050.93,"end":8155.69,"speaker":"Fr Stephen De Young","text":"They don't necessarily, but we should. So there are features in the text of the Book of Isaiah, which is a very long book in the Old Testament in its canonical form. There are features that look like breaks of the text at the end of chapter 30, at least at the end of chapter 39, I think the other one is the one between quote, unquote, second and third Isaiah is more iffy. But there's definitely a disjunction at the end of chapter 39, beginning of 40. That's why they put the chapter break there. When they were putting in the chapter breaks, they were looking for things in the text where there are natural breaks or topic changes and that kind of thing. And they're just. There is a break there. Okay? And you can even take that break and say, you know, this looks like a significant break. And in the Book of Isaiah, if we take what the book of Isaiah actually says, right. Seriously, Book of Isaiah does not claim that Isaiah sat down and wrote it. The Book of Isaiah claims that Isaiah had disciples. The prophet Isaiah had disciples, that they wrote down all his prophecies, and after his death they collected them. And that the Book of Isaiah that we have now is his disciples collection of his prophecies. That is, that should be a problem for any Christian. Right. Because that's how the Gospels were written. Right. Jesus didn't write them personally. Right. Pen to paper."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8156.57,"end":8156.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8158.57,"end":8194.34,"speaker":"Fr Stephen De Young","text":"So that's just saying Isaiah came together like that. So the idea that at some point there were two different collections or even three different collections of Isaiah's prophecies and that they all got brought together into what is now the Book of Isaiah, again, should not be a big problem for us. Right. Like when you read the Book of Psalms, there are five books within the Book of Psalms. Like, we know that there were previous collections of Psalms that all got brought together into what we now call the Book of Psalms. It's not a big deal."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8194.5,"end":8194.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8194.98,"end":8212.9,"speaker":"Fr Stephen De Young","text":"That's cool. Right? So if that's true about Isaiah, that, that there is a quote, unquote, deutero Isaiah, because there were two different collections and those two were put together to make what we now call the Book of Isaiah. That's totally cool. Here's the other piece, though."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8213.78,"end":8214.34,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8214.98,"end":8268.9,"speaker":"Fr Stephen De Young","text":"The other piece is the reason most scholars want to talk about Deutero and Trito Isaiah is that they want to Say they were written at different people by different people at different times. And the reason they want to say that is not because of any internal evidence or even any external evidence. The reason they want to say that is because texts within Deutero and Tritto Isaiah predict things that hadn't happened yet when the first part of Isaiah was written. And they come to the text with the presupposition that this text cannot possibly predict the future. Right? Like it could guess. Right. Like it could say, you know, oh, you're doing great now, Babylon, but you're. You're gonna. One of these days."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8269.22,"end":8269.54,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8269.54,"end":8364.23,"speaker":"Fr Stephen De Young","text":"Like you could do that. Right. But for example, the text we're about to read, chapter 44 and 45, that mentioned Cyrus by name. Yeah. No, no, no. That you. That's not possible. That can't possibly have been written before, before he showed up. Therefore. Right. This part of Isaiah has to have been written in the Persian period, long after the original Isaiah was dead. And then based on that, they go looking for disjunctions in the text, right? To say, ah, see, here's a disjunction in the text at the end of chapter 39. See, this is a separate section. See, this was written later. And you ask him, well, what's your evidence that this was written later? What they point to is the disjunction in the text. But the disjunction in the text doesn't prove it was written later. It doesn't prove anything. It suggests that maybe there were two separate collections that were put together, but it doesn't mean anything in terms of the respective time in which those two sections were written. They could have been collected, written, collected at the same time, and then brought together at a later point. The fact that there were at 1.2 separate pieces does not mean that one piece was written centuries after the other. And the only thing that would suggest that it was written centuries after the other is if you assume the impossibility of predicting the future."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8367.51,"end":8367.91,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8369.51,"end":8455.46,"speaker":"Fr Stephen De Young","text":"So this is a basic problem. You can see this unfold over and over again in Old Testament scholarship. You bring some presupposition to the text. The presupposition of the text requires you to argue xyz. You find a posteriori. You find things which make what you want to believe based on your presuppositions possible. And then you argue from those things. You say that those things you found are arguments for your presupposition, even though the whole order of your logic was entirely opposite. And that's how you do bad scholarship. But so the text we're about to read from Deutero Isaiah is going to mention Cyrus by name and we're going to see is very specific about Cyrus, the Persian Empire, Persian religion, even very specific ways before the fact. Now the. The Jewish tradition is firmly that Isaiah wrote this, this was already around and that this was shown by exiles to Cyrus. And that reading this text with his name in it is what led Cyrus to make the proclamations we just read about."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8455.78,"end":8456.18,"speaker":"Fr Andrew Stephen Damick","text":"H."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8458.19,"end":8460.03,"speaker":"Fr Stephen De Young","text":"That's the Jewish tradition regarding it."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8460.35,"end":8461.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8464.91,"end":8492.44,"speaker":"Fr Stephen De Young","text":"Which kind of explains why the Jews in particular get sent back. Right? I mean the religious tolerance thing. Yeah, that was everybody. But he didn't go moving people around a lot. He didn't go endowing rando temples a lot. Right, but. So let's go ahead and we'll discuss it a little more. But and read this chunk of Isaiah, okay."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8494.36,"end":8536.78,"speaker":"Fr Andrew Stephen Damick","text":"Starting with verse 24 of chapter 44. Thus says the Lord your redeemer, who formed you from the womb. I am the Lord, who made all things, who alone stretched out the heavens, who spread out the earth by myself, who frustrates the signs of liars and makes fools of diviners, who turns wise men back and makes their knowledge foolish, who confirms the word of his servant and fulfills the counsel of his messengers. Who says, of Jerusalem she shall be inhabited, and of the cities of Judah they shall be built, and I will raise up their ruins. Who says, to the deep be dry, I will dry up your rivers. Who says of Cyrus, he is my shepherd, and he shall fulfill all my purpose, saying, of Jerusalem, she shall be built of the temple your foundation shall be laid."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8538.62,"end":8538.9,"speaker":"Fr Stephen De Young","text":"Now."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8538.9,"end":8595.81,"speaker":"Fr Andrew Stephen Damick","text":"Isaiah 45. Thus says the LORD to his anointed To Cyrus, whose right hand I have grasped to subdue nations before him, and to loose the belts of kings, to open doors before him, the gates may not be closed. I will go before you and level the exalted places. I will break in pieces the doors of bronze and cut through the bars of iron. I will give you the treasures of darkness and the hordes and secret places and that you may know that it is I, the Lord, the God of Israel, who call you by your name. For the sake of my servant Jacob and Israel, my chosen, I call you by your name. I name you, though you do not know me. I am the Lord, and there is no other besides me. There is no God. I equip you, though you do not know me. That people may know from the rising of the sun and from the west that there is none besides me. I am The Lord and there is no other. I form light and create darkness. I make well being and create calamity. I am the Lord who does all these things."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8600.37,"end":8617.33,"speaker":"Fr Stephen De Young","text":"Right? So you may have noticed a few things in there. So obviously there's the mention of Cyrus by name. Notice when he's first mentioned at the end of chapter 44, he's referred to as God's shepherd. Think about Herodotus story."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8620.93,"end":8621.17,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8624.77,"end":8787.05,"speaker":"Fr Stephen De Young","text":"And again, that in particular he's called to rebuild the temple, right? And then in chapter 45, right, when it says, thus says the Lord to his anointed to Cyrus, it literally says in the Hebrew, thus says Yahweh to his Messiah to Cyrus. Yeah, Messiah. The word for Mashiach. It's the word for anointed one, right? And we mentioned this, I think briefly in our episode on just the Messiah in general, right, that we as Christians, right, Because we're after the fact. We're like, well, there's one Messiah and it's Jesus, Jesus Christ. Jesus, the Messiah, right? But before that, Messiah was more flexible. We talked about how they believed in a priestly Messiah, a kingly Messiah, the Messiah, Ben David, the Messiah, Ben Joseph, Anointed one, right? These different traditions of anointed ones, right? And so here we see even Cyrus, right, Who did not convert to Judaism, right? He was not circumcised. He did not eat the Passover, right? Certainly allow the temple to be rebuilt. Certainly had sacrifices offered to Yahweh in his name, but was also having sacrifices to Marduk offered in his name. And right. Everyone else, he is anointed for a particular purpose, right? By God that is doing those things, right? Doing those things. And that God brings him into the position he's in so that he can then do those things. But notice also, right, when you get into down to verse five, starting in verse five of chapter 45, right, where he says, I am the Lord, I am Yahweh. There is no other beside me. There is no God, right? I equip you, though you do not know me. Talking to Cyrus. Cyrus does not know him, right? So this is not because Cyrus was a follower of Yahweh, right? But notice he says that people may know from the rising of the sun and from the west, right? From one end of your empire to the other, from the east to the west. There is none beside me. I am Yahweh. There is no other. And then notice specifically in verse seven what he claims, Number one, I form light and create darkness. What's that a reference to Ahura Mazda. Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8787.61,"end":8791.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I create light and create the other corrective."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8791.85,"end":8818.28,"speaker":"Fr Stephen De Young","text":"And then number two, and let me translate this. Right. Father Andrew, read a translation that says I make well being and create calamity. And that's a valid translation, but let me be more provocative in the translation. I make good and create evil. Another way of translating the Hebrew, although the word race that's translated there is evil, could also mean famine, like trouble, calamity."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8818.28,"end":8819.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Bad things."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8819.84,"end":8836.59,"speaker":"Fr Stephen De Young","text":"But the idea here being it's not Ahura Mazda and his shadow, it's all Yahweh, the God of Israel. Right. And then he says, I am Yahweh, who does all these things. There's not someone else doing any of this."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8838.03,"end":8840.19,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8842.27,"end":8865.67,"speaker":"Fr Stephen De Young","text":"He is at once sort of claiming Cyrus as his own God is. And repudiating. Right. Cyrus's sense of who Cyrus is. Right. Cyrus is not the king of the four quarters of the world."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8866.39,"end":8866.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8867.43,"end":8879.27,"speaker":"Fr Stephen De Young","text":"Cyrus is the servant of the God who rules the four quarters of the world. A God who he doesn't even know, but whom he's serving anyway."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8881.84,"end":8882.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8882.96,"end":8884.4,"speaker":"Fr Stephen De Young","text":"But whom he's serving anyway."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8884.8,"end":8885.2,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8887.84,"end":8901.68,"speaker":"Fr Stephen De Young","text":"One past explanation of this text, based on the Jewish tradition I mentioned, that they showed this to Cyrus to get to bring him back, is that this was fabricated by the exiles. By the Jewish exiles."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8902.08,"end":8902.64,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8903.28,"end":8917.44,"speaker":"Fr Stephen De Young","text":"That they inserted this to flatter Cyrus to get him to send them back. Right. But let me suggest, based on what we just read, if you really understand it, it's not actually flattering to Cyrus."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8918.32,"end":8920.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's. It's correcting him."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8921.04,"end":8926,"speaker":"Fr Stephen De Young","text":"Yes, it is. Demoting Cyrus to his proper place."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8928.56,"end":8929,"speaker":"Fr Andrew Stephen Damick","text":"Beneath."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8929,"end":8941.94,"speaker":"Fr Stephen De Young","text":"Yahweh, the God of Israel. So maybe having his name appear in the sacred books might, you know, impress him. But this is not the kind of thing you would fabricate if you were trying to ingratiate yourself."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8942.26,"end":8942.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8944.26,"end":8948.1,"speaker":"Fr Stephen De Young","text":"That doesn't work either. That doesn't work either."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8948.74,"end":8949.3,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8953.22,"end":8976.76,"speaker":"Fr Stephen De Young","text":"So if you, if you're just willing to accept that it's possible that the prophet Isaiah had something in the future like, like a name revealed to him, then there's a very simple explanation for all this. Otherwise, feel free to do all the mental gymnastics you feel like you need to. To try to explain this text and Cyrus's actions in history."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":8977.56,"end":9266.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So I think, you know, connecting both our previous episode, the Nebuchadnezzar episode, and this one, you know, both these are cases of. Of great kings who are used by God to accomplish things that. That God wants. Of course, in Nebuchadnezzar's case, Nebuchadnezzar gets radically humbled as part of what's going on there. And Cyrus doesn't have that experience, although there's a little bit going on of that, you know, in, in this last text that you these correcting going on. And I think for me, the through line, I mean, there's multiple possible through lines, I guess, but the through line that, that really comes to me at the moment is, you know, that God is always working to, to establish justice, to bring things in order to bring his people Israel, where they need to be in faithfulness to him. And of course, it's not just a story about that, something that happened in the past, but it's also a story about us. Right? So, you know, looking at these two Kings, we can see, okay, I think that this is who I am, what I'm doing in the world. And then here's this message from God that says, actually, you need to do this and this is not who you are. You're that. And I can take that as a correction and obey and become faithful. And I mean, my experience is that for a lot of the Christian life, most of it's relatively gentle like that. You know, you hear a sermon and it might convict you, but, you know, your priest is not going to come out and, you know, personally pressure you or make bad things happen to you if you don't obey. It's mostly going to be up to you to determine whether you're going to obey or not. It's up to you, when you hear the hymns of the church, to obey or not. Right? But then there's sometimes in life where you have to kind of experience a Nebuchadnezzar. Most of us are not transformed into a kind of, I don't know, werewolf sort of thing, but there certainly can be experiences of great, great humiliation, great humbling. And it seems like life has fallen completely apart. I mean, Nebuchadnezzar lost everything. He became like an animal for a long time. And we don't want that. Right? But I think it's one of the great themes of the orthodox Christian tradition, which is humble yourself or God is going to humble you, you know, and you have a choice. You can humble yourself, you can live faithfully, you can. You can always be examining the way you're living and ask, is this in alignment with what the scriptures say? Is this in alignment with what all the teaching and tradition of the church says? Or do I have some changes I need to make? I mean, it's true. God loves you just the way that you are you, he does. He loves you because he created you. And you are created according to his image. But the way that he loves you is not going to leave you the way you are. And it's up to you to accept that transformative love and to become in alignment with him, because love does that. Love is a relationship. There's a give and take going on. And so there's a transformation that occurs. God has already accepted to become human for our sakes. And so what we need to do in response is accept to become deified because of his great love for us. And what we see in these two kings, Nebuchadnezzar and Cyrus, is that no matter where you are, you can be at the very top of the most powerful thing in the world. And both of them were, and in their times, and yet you still are under God. God is still the one who's in charge. And the only reason that you have that position at all is because God has given it to you. And while probably no one listening to this podcast is the head of an empire, we all have things that God has given to us. And the reality is it can be taken away very, very quickly in one way or another. It could be a financial disaster, it could be natural disaster, it could be a health disaster. It could all go. So the question is really, what are you going to do with what you got? And, yeah, so those are my kind of main takeaways from these last two episodes."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9272.88,"end":9433.11,"speaker":"Fr Stephen De Young","text":"So Cyrus, who we talked about tonight, was the king of the world. Not in the my new girlfriend is about to shove me off a raft to drown sense, but in the literal sense. And accomplished a fair amount, shall we say, in his 70 years of life. Pretty much nobody, I want to say, pretty much nobody. I don't think even Alexander the Great can really match his list of achievements because he didn't get to rule over what he conquered. And yet. And yet now, as we're celebrating this, what was it, 2653rd anniversary of his conquest of Babylon on Sunday, there's only really one thing that he's remembered for by the vast majority of people in the world who have heard of him at all. And that's letting the Jewish people go back to Judah. And that's despite how that all turned out, which wasn't well, and how short lived all that ended up being. And that being just this one turning point in the story of Israel, God's people as a whole. It's that one thing. And as the prophet Isaiah presents it, the whole purpose for God creating him and God guiding him, and God appointing him to be the one who became the king of the world was so that he would be able to do that one thing. So that when the moment came, he could do that one thing that God had prepared for him to do. And not just me tonight, but St. Paul a long time ago said that the same is true for you and me. That there are good works that God prepared in advance for us to do, not in a general sense for me to do, for you to do that in God's providence."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9433.19,"end":9433.59,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9433.59,"end":9463.54,"speaker":"Fr Stephen De Young","text":"I was born at a certain time and God gave me certain gifts and certain experiences in my life and a certain education and certain things so that I would be in certain places at certain times to be able to do certain things that he wanted me to do and that were truly important. That were truly important. And the purpose of my life, what will give my life purpose."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9467.14,"end":9467.5,"speaker":"Fr Andrew Stephen Damick","text":"Is if."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9467.5,"end":9631.79,"speaker":"Fr Stephen De Young","text":"I take those moments and I do those things, God doesn't need me to do them. He can get somebody else to do them. But if I make him do that, if I opt out, they say it's not going to be God's problem. They'll still get done. But there goes the purpose, there goes the meaning in my life. And there's a lot of Sturman drawing from certain quarters of the Internet about meaning and finding meaning, feeling like we have meaning and purpose. And I think a lot of people are looking for meaning in some kind of philosophical sense or some kind of brain broad arc or some kind of career path or some kind of big thing. And according to scriptures and according to even the example of Cyrus, that's not where it's actually found. The whole thing may be found at one moment. Everything in your life may be preparing you for one moment where there's one thing you need to do, one thing you need to say, one place you need to be for somebody else. And you being there at that moment and doing it, that's what the meaning was, that's what the purpose was. And you say, well, that's not much of a purpose. That's not much of a meaning. Just one little thing at one time. But you see, there's a chain reaction of those little things because I'm in the right place at the right time and say the right thing to somebody else. And then that person, because of it, becomes equipped at some future moment with someone else to say or to do something that needs to be said or done. And through that chain reaction, that's how Christ's church grows in the world. That's how salvation spreads through the world. That's how the knowledge of God spreads through the world. That's how the world is redeemed. It's by a series of chain reactions from just regular people doing the things that God has prepared them and equipped them to do when the time comes. And so if you're one of those folks who's sitting around wondering or wondering, right, why am I here? What is this all about? Why am I still alive."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9634.19,"end":9634.51,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9634.51,"end":9742.38,"speaker":"Fr Stephen De Young","text":"What is the purpose? What is the point, right? You're not going to find it by sitting there wondering. You're not going to find it by musing philosophically. You're not going to be. You're not going to find it by having a long series of interminable philosophical discussions about it on YouTube, that's for sure. You're not going to find it by watching smart people talk about it incessantly on YouTube. Even if I'm one of those people you think is a smart person talking about it, you're not going to find it watching my videos. You're going to find it by going out and living your life. You're going to find it by going and using the gifts that God's given you, by being an active part of your family, your parish, your workplace, your school, and being on the lookout for those moments, those moments where you're the one who's prepared to help. You're the one who's ready to say what needs to be said or to listen or to do what needs to be done and then doing it. And you may not instantly know when you did it that, aha, there it was. There was the moment. Now my life has meaning and purpose, right? May take some time. May take some time for that chain reaction to loop back around and for you to see what's going on. But that sense of purpose, that sense of meaning, that's where it's found. So even though this may make some of the ancient faith people mad at me, stop listening to podcasts and go out there and live your life. Now, you just wasted, like, probably close to three hours, right? Go do some things."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9744.22,"end":9744.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9747.34,"end":9752.78,"speaker":"Fr Stephen De Young","text":"And you'll find what you're looking for in becoming the person who God created you to be."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9759.99,"end":9791.11,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's our show for tonight. Thank you very much for listening, everybody. If you didn't happen to get through to us live, we'd still like to hear from you. You can email us@lordofspiritsand ancient faith.com you can message us our Facebook page. Leave us a voicemail@speakpipe.com LordOfSpirits or, you know, show up to one of our conferences, which we just had this last weekend. If you have basic questions about Orthodox Christianity, though, or you need help finding a parish, which is where we actually do this thing called Christianity, head over to orthodoxintro.org and join us for our."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9791.11,"end":9802.59,"speaker":"Fr Stephen De Young","text":"Live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. I hopped off the plane at LAX with a dream in my cardigan. Welcome to the land of fame excess. Am I going to fit in?"}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9803.47,"end":9811.32,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, you can join our discussion group, leave reviews and ratings and and share the show with a friend."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9812.2,"end":9824.28,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. Jumped in the cab. Here I am for the first time. Look to my right and I see the Hollywood sign. This is also crazy. Everybody seems so famous."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9824.76,"end":9826.84,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. God bless you all."}
{"episode_id":"LOS - #126 - 2025-10-09 - The Other Messiah in the Bible","start":9829.96,"end":9867.2,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
