{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":0.64,"end":65.33,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":67.41,"end":150.25,"speaker":"Fr Andrew Stephen Damick","text":"Christ is risen. He truly is risen. Good evening. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855- AF-RADIO. That's 855-237-2346. Matus Khetruti is taking your calls tonight, which we will get to in the second part of our show. So the word blessing is probably one of the most nebulous religious terms of our time. People say God bless you when you sneeze and Christian celebrities showing off their wealth do so with blessed. A lot of the time the word blessings just seems to mean good stuff. What about cursing? Is that just bad juju? So what exactly is a blessing or a curse? Are these just religious sounding synonyms for good or bad things? What does it mean when God blesses or curses? What does it mean when the scriptures tell us to bless God? How does that even work? Do the blessings and curses of human beings actually do anything? Is this some kind of Christian magic? So this is what we're talking about tonight. And does this mean that especially since it's allergy season here in eastern Pennsylvania, this is the one episode where I'm allowed to sneeze on the air. What do you think, Father?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":150.89,"end":155.21,"speaker":"Fr Stephen De Young","text":"Yes, but. Oh, you're only allowed to sneeze twice in a row."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":155.53,"end":156.49,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":156.57,"end":165.13,"speaker":"Fr Stephen De Young","text":"If you see the third time or more, you're milking it and just trying to draw attention to yourself, then we have to Have a discussion about humility."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":165.54,"end":166.46,"speaker":"Fr Andrew Stephen Damick","text":"There are people who."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":166.46,"end":166.74,"speaker":"Fr Stephen De Young","text":"Who."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":166.74,"end":177.54,"speaker":"Fr Andrew Stephen Damick","text":"And I'm not one of them, but there are people who have, like, a huge number of successive sneezes in a row. Bam. Bam. You know, like. I don't know, but it is a thing. I'm not."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":177.54,"end":184.5,"speaker":"Fr Stephen De Young","text":"I'm not talking about that. Like, that. WOMAN ON. That's incredible. Right. With John Davidson and Fran Tarkington and. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":184.5,"end":184.86,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":184.86,"end":190.9,"speaker":"Fr Stephen De Young","text":"Like, who sneezed for, like, seven years straight or something? I mean, there are outliers."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":191.43,"end":193.75,"speaker":"Fr Andrew Stephen Damick","text":"Our first 80s pop culture reference for the night."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":193.91,"end":203.27,"speaker":"Fr Stephen De Young","text":"But your average local parishioner does not need to sneeze more than twice in a row. And if they really do, they can politely excuse themselves."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":203.67,"end":208.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, maybe I should have technical difficulties tonight."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":209.27,"end":210.07,"speaker":"Fr Stephen De Young","text":"That'd be different."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":210.47,"end":226.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we could try that. Sorry, Father Andrew's having technical difficulties while he goes and sneezes because of the pollen, so. All right, well, we are talking about blessings. So we're not starting with Genesis, though, this time, or, you know, Shuttle Hayek. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":227.6,"end":232.16,"speaker":"Fr Stephen De Young","text":"But Deuteronomy, I mean, not that we couldn't. We are going to hit up Ugarit."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":232.16,"end":234.32,"speaker":"Fr Andrew Stephen Damick","text":"Later on in the episode, as one does."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":234.96,"end":256.25,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But, yeah, not right here at the beginning. We're actually beginning at the end of the Torah. Not the end of the Bible, not beginning of Revelation. We're beginning at the end of the Torah In Deuteronomy, chapters 28 through 30."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":256.73,"end":257.29,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":258.25,"end":263.29,"speaker":"Fr Stephen De Young","text":"Which most people have not read or heard publicly a whole lot."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":263.77,"end":264.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":265.29,"end":286.58,"speaker":"Fr Stephen De Young","text":"But which everyone should hear more. And for our fellow clergy out there, it really preaches throwing out the. How it begins. When God says, today I lay before you life and death, blessings and curses. Right. Choose. I mean."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":286.58,"end":287.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":287.82,"end":289.9,"speaker":"Fr Stephen De Young","text":"That preaches. You can work with that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":290.06,"end":292.06,"speaker":"Fr Andrew Stephen Damick","text":"I think that would be good for a wedding sermon."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":293.02,"end":295.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right. Baptism."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":295.9,"end":297.66,"speaker":"Fr Andrew Stephen Damick","text":"Baptism. Yeah, exactly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":300.62,"end":331.2,"speaker":"Fr Stephen De Young","text":"But so there's sort of a hackneyed way this gets read or sort of shortened when it is read. And then there's sort of a deeper way. And hopefully we're gonna. We'll start out with the sort of hackneyed way. Right. We'll go a little deeper. So the hackneyed way is basically, if you obey the Commandments, good stuff will happen to you, and if you disobey the Commandments, bad stuff will happen to you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":331.44,"end":334.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this is. This is a narrative you see all over the Bible."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":335.2,"end":339.28,"speaker":"Fr Stephen De Young","text":"Well, yeah. Or at least the sort of hackney version of it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":339.44,"end":340.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. This is."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":340.76,"end":342.48,"speaker":"Fr Stephen De Young","text":"This is Job's friends. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":342.8,"end":343.16,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":343.16,"end":349.28,"speaker":"Fr Stephen De Young","text":"Right up and saying, hey, all this bad stuff happened to you. You must have done something awful, man, to deserve all this."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":349.44,"end":361.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right. So is it like, like that, like that tower that fell on people? Where was that? It said, you know, do you suppose that these are all worse sinners than everyone else in that city because the tower fell on them? Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":362.58,"end":369.86,"speaker":"Fr Stephen De Young","text":"I once knew a man who preached on that text. The Sunday after 9, 11 happened. Happened. And I said, you, sir."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":369.86,"end":370.34,"speaker":"Fr Andrew Stephen Damick","text":"Whoa."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":370.74,"end":409.88,"speaker":"Fr Stephen De Young","text":"Are bold. Wow. Not recommended, but wow. Right. Yeah. And so that is a way, and I say it's a hackneyed way, but you will find some very sophisticated biblical interpreters basically taking that skim on the Old Testament, right. Saying that's how the Old Testament works, right. If you do good stuff, good stuff happens to you. If you do bad stuff, bad stuff happens to you. This is basically the secret, right? You put good stuff out into the world and good stuff comes back to you, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":409.96,"end":410.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":411.88,"end":420.6,"speaker":"Fr Stephen De Young","text":"And bad stuff. And bad stuff. But that's not really what's going on, right, in Deuteronomy, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":420.6,"end":425.32,"speaker":"Fr Andrew Stephen Damick","text":"Because bad things do happen to good people and good things happen to bad people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":426.12,"end":429.32,"speaker":"Fr Stephen De Young","text":"Yes, yes. The rain falls on the righteous and the unreliable."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":429.99,"end":430.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":430.71,"end":433.67,"speaker":"Fr Stephen De Young","text":"That's not just a new revelation in the New Testament. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":433.67,"end":434.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":434.47,"end":512.79,"speaker":"Fr Stephen De Young","text":"Aforementioned Book of Job. Right. So we sort of ended up last time talking about the sense in which the commandments, the commandments of scripture have life in them. Right. And what that means, right, that, that it's by actually doing. Right, by putting the scriptures into practice, right. That we find sort of life and abundance. And this is the sense in which we see the blessings of the covenant, right? The, the blessings which come for keeping the commandments, right. Which come in relation to keeping the commandments is in this sense, right. That the commandments have life in them. And then the opposite then is what we find in the curses, right? So that curse is sort of, if, if a blessing is life, a curse is like anti life. Right. It's, it's the opposite. Right. So death, corruption, all of these things."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":513.19,"end":513.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":513.75,"end":542.73,"speaker":"Fr Stephen De Young","text":"And we, we see this in sort of one of the. I mean, these are always. We're not going to read all three chapters, but when you read these, right. One of the main contrasts, we're dealing with an agrarian society. So people are farming. And so in the forefront of the blessings is, you know, the, the rain will come in its season, the ground will be fertile for your crops. Right. Things will grow, there will be life. Right? In that sense."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":543.05,"end":557.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And that's why people often read this as if you do good things, then good Things happen to you. Because like this, that is a reading, it's a very flat reading. But, but it is like that those connections are being made, but that having."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":557.85,"end":561.61,"speaker":"Fr Stephen De Young","text":"A life in good order sort of produces then life."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":561.85,"end":563.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":564.41,"end":575.21,"speaker":"Fr Stephen De Young","text":"And so then that's contrasted in the curses with, with this curse situation of the sky being like iron in the ground being like bronze."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":575.45,"end":581.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is just great imagery for, for, you know, farming not working. Yeah, yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":581.81,"end":648.34,"speaker":"Fr Stephen De Young","text":"Flat gray sky, bronze, nothing's growing out of it, no rains coming from it. And so that is the way in which death and corruption sort of spiral from bad order. Right. Or false order. Right. It's not a complete descent into chaos, but there's actually a sort of negative order or an evil order, a tyrannical order, like slavery. Yeah, right, yeah. And that kind of order does not produce life. It produces corruption and death. It produces the opposite. Yeah, right. And so these are the two, these are the two sets of images, Right. That are set up here. And you can see from that example we just gave about the crops and the sky and the ground. Right. That this has to do with the relationship between humans and the cosmos. Right. The, the world, the universe, the creation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":649.55,"end":650.35,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":650.35,"end":668.19,"speaker":"Fr Stephen De Young","text":"That this is about how humans live in creation and that human activity in creation then bringing about either this abundance of life or this sort of corruption, the sort of anti life corruption."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":668.43,"end":685.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, which just connects back to the, the mission that God gives Adam and Eve in Genesis, you know, to fill the earth and to cultivate it. That's the task. So they can either cultivate it well or they can mess it up, but either way, humans are going to affect the world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":687.07,"end":699.23,"speaker":"Fr Stephen De Young","text":"Right, right. And so the good order that humans can produce is an order that's in harmony with the order of the cosmos as God created it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":700.84,"end":701,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":701,"end":708.84,"speaker":"Fr Stephen De Young","text":"And that's, that's what's found in keeping the commandments. This is a way to live in the world which is harmonious with the order which God put into the world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":709.4,"end":709.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":709.96,"end":730.16,"speaker":"Fr Stephen De Young","text":"And therefore is conducive of life. And then of course, the opposite is true. Right. When. When human activity operates against the order which God has put into creation, it's destructive both of humanity and of the rest of the created order."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":730.64,"end":734.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because around human persons, man is not an island."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":736.48,"end":750.8,"speaker":"Fr Stephen De Young","text":"Right. And so later on in the scriptures, when it talks about the curse of the law, it's talking about Deuteronomy 29 and 30. Because remember, the law here is the Torah. The curse of the Torah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":751.04,"end":752.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":752.24,"end":770.79,"speaker":"Fr Stephen De Young","text":"This is it here at the end. Right. The curses of the Torah, which have come upon humanity through humanity, not keeping the commandments. Right. And these are actual consequences. Right. This isn't just, well, everything's fine from our perspective, but God is really mad."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":771.43,"end":796.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not like we've been somewhere declared guilty because, you know, we, like. It's an actual existential harm that's being done. You know, like living against the. The way that the Torah says you should live actually does hurt you, and it does hurt the world. It's. It's like you said, it's not just God being mad that you broke his rules that don't actually do anything or connect anything."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":797.65,"end":838.96,"speaker":"Fr Stephen De Young","text":"Right, Right. It's that this is. This has produced this state of corruption and. And death in ourselves and in the world around us. Right. Through our. Our wickedness and our evil activity. And so a person who is in this state of curse. Right. Is a person who is then alienated, right. From. From the rest of the creation, from his community, from his family, from himself, from God. Right. Because all of those things represent at least a potential harmony. And so when. When our actions are disharmony, we alienate ourselves from all of those things."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":839.44,"end":840,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":840.88,"end":878.76,"speaker":"Fr Stephen De Young","text":"And so we talked before about how everything in creation is connected in this web of relationships. Right. And that's what sort of gives it its identity. Right. And so when that web of relationships is fractured and that harmony is broken, Right. Things become twisted and become other than what they are. Right. And so that part of what we're talking about, when we're talking about blessing, is blessing over against that cursed state. And so blessing always involves a certain level of reconciliation. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":878.76,"end":879.12,"speaker":"Brett","text":"Of."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":879.2,"end":884.96,"speaker":"Fr Stephen De Young","text":"Of reconnection, where those points of alienation have taken place."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":885.2,"end":887.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Putting things back in order."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":888.39,"end":893.75,"speaker":"Fr Stephen De Young","text":"Right. Because blessing is when those. That web of relationship is affirmed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":894.07,"end":894.39,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":894.39,"end":899.75,"speaker":"Fr Stephen De Young","text":"It is tight. And when everything's working. This is closely related to the idea we've talked about of justice."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":900.31,"end":901.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":901.03,"end":914.53,"speaker":"Fr Stephen De Young","text":"Where we talk about justice is sort of everything in the right place and working correctly. Right. Whereas blessing and curse focuses not so much on the overarching order, but on that web of relationships that makes it up, that constitutes it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":915.25,"end":915.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":915.57,"end":918.13,"speaker":"Fr Stephen De Young","text":"That constitutes the bigger overall order."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":918.37,"end":925.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's about harmony, not just order itself. It's about the harmony of the order, or the harmony is connected to the order."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":926.13,"end":929.77,"speaker":"Fr Stephen De Young","text":"Right. That makes. Yeah, that makes it up. That constitutes it. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":929.77,"end":930.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":930.69,"end":945.85,"speaker":"Fr Stephen De Young","text":"So it's like looking at, you know, looking at a salt crystal versus would be like talking about justice and looking at a salt molecule would be like talking about blessing and cursing in this web of relationships."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":945.85,"end":946.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":947.21,"end":955.21,"speaker":"Fr Stephen De Young","text":"That make up the crystal when they're in the proper. Right. In the proper portions and connected properly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":955.53,"end":963.85,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. Yeah. So I imagine that one question that some people might have would be, is this the same thing as natural law?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":964.9,"end":965.02,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":965.02,"end":976.18,"speaker":"Fr Andrew Stephen Damick","text":"Like there's this whole natural law tradition, particularly in. In Western Christianity. I mean, we're not. We don't need to go too deep into it, but I imagine probably some people are just thinking, okay, is that exactly what we're talking about?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":977.46,"end":977.86,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":978.26,"end":978.9,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":979.86,"end":1000.5,"speaker":"Fr Stephen De Young","text":"Yeah. So the. I, you know, I said. I said something nice about Thomas Aquinas last time, and I'm going to speak. No, this isn't really. But so before the natural law. The natural law concept is really a product of. Of Western Christianity."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1000.9,"end":1001.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1001.54,"end":1004.5,"speaker":"Fr Stephen De Young","text":"Because it's combining two previous concepts."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1004.82,"end":1005.38,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1006.1,"end":1011.3,"speaker":"Fr Stephen De Young","text":"One of those concepts is the idea of divine law."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1011.94,"end":1012.58,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1013.3,"end":1026.48,"speaker":"Fr Stephen De Young","text":"Which really arises in the west as such. We've talked about this before, about St. Jerome's translation of using the word lex to refer to the Torah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1026.56,"end":1026.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1026.96,"end":1040.36,"speaker":"Fr Stephen De Young","text":"Right. And so the idea of God then as lawgiver, as promulgating laws, that was combined with Aristotle's idea of natural."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1040.36,"end":1043.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay, so explain, explain that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1044.47,"end":1126.5,"speaker":"Fr Stephen De Young","text":"Yeah. That comes out of the Eudemian ethics. And Aristotle's idea of natural right is basically that there's an order in the world, in the cosmos. That order he sees primarily, but not exclusively as being teleological, as being what things are aimed at, the purpose. Everything has a purpose. Right. And everything has a purpose. Everything has sort of a mature form. Everything has. Right. So the acorn is growing into the oak tree. Right? Right. That there's sort of an aim and a goal and a purpose for everything, that all of those taken together constitute a harmony. And therefore, for any given thing. Right. But we'll use humans, right? So for a human, right? There is this telos, this end, this mature form of a human, of what a human could. Could be. And therefore, anything that a human does which aims at that and is conducive to that is sort of naturally right. It is the. The right thing to do. Right. And anything which pulls you away from that then is wrong."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1126.98,"end":1127.7,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1127.94,"end":1138.34,"speaker":"Fr Stephen De Young","text":"Right. So you could see how when you take that and the idea of God is law giver, you get natural law, Right. You get the idea that the law is sort of written into the nature of things."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1139.06,"end":1139.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1140.26,"end":1276.54,"speaker":"Fr Stephen De Young","text":"Right. But what we're talking about is not identical with, but more like what Aristotle was talking about in that there is this correct relationship based on the nature of any given thing. God created the nature of everything. That is so God created human nature. Right, right. And human nature has qualities to it. Right. That. And therefore, since it has qualities, those qualities have. Can be excellent or they can be deficient. Right, right. So, you know, a chair can be good at holding and supporting people or bad at it. And based on that, you say it's a good chair or a bad chair and how well it fulfills its role. Right. And so the same thing is kind of true with humanity. Human nature, of course, has this special destiny in God that we'll be talking about as we continue tonight. Right. So we're a little different than a chair or even than an animal. But the idea there is sort of the same, that humanity, a human person, is created to. To become something. And therefore the path that leads there is sort of the blessed path, the correctly ordered path. And so before we get more into blessings and sort of develop out more what we were just saying, we got to do a little ground clearing and a little bit of deconstruction on, as you mentioned in your. Your intro, some of the ways in which the term blessing and blessings gets used in our. Our modern culture. Not so much the sneezing thing. We'll leave that alone for now. Yeah, Covered that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1276.86,"end":1278.3,"speaker":"Fr Andrew Stephen Damick","text":"Hashtag blessed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1278.78,"end":1281.78,"speaker":"Fr Stephen De Young","text":"Yeah. Other ways. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1281.78,"end":1287.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Next time someone says God bless you to me after I sneeze, though, I think I am going to say hashtag blessed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1290.08,"end":1291.32,"speaker":"Fr Stephen De Young","text":"You do that. They'll grow."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1291.32,"end":1291.76,"speaker":"Fr Andrew Stephen Damick","text":"I will."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1293.12,"end":1295.12,"speaker":"Fr Stephen De Young","text":"They'll move on with their lives. They'll be okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1295.52,"end":1298.4,"speaker":"Fr Andrew Stephen Damick","text":"But it'll be a minor but slightly amusing joke."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1298.88,"end":1328.8,"speaker":"Fr Stephen De Young","text":"Yes. Okay. So, yeah, so blessings gets used a lot by some of our friends who have wittingly or unwittingly, desiringly or unawarely fallen into the prosperity gospel trap."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1329.36,"end":1331.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Come out from them."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1335.36,"end":1340.93,"speaker":"Fr Stephen De Young","text":"This includes more. I mean, there's a gross form of this that we've all seen. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1343.01,"end":1343.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1343.49,"end":1396.07,"speaker":"Fr Stephen De Young","text":"A. A person who shall not be named because he is deceased. And it would be mean to pick on him. Once on tbn, gave one of the greatest sermons of all time about the four horsemen of the Apocalypse. He said that he had had a vision and seeing the four horsemen of the Apocalypse and the Christ's return was near. And the four horsemen of the Apocalypse were getting ready to ride out in his vision. And they were, they were. They were chomping at the bit to ride out before Horsemen of the Apocalypse. And their. Their hooves were churning at the ground. They're churning at the ground in heaven. Heaven with the streets of gold. And as they're churning at the ground there and heaven in the streets of gold, flakes of that gold were falling down from heaven and landing in the checking accounts of people who donated to tbn."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1398.73,"end":1410.17,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is a thing, though. I mean, some of these preachers, like, they'll have these glitter bombs up in the rafters, you know, that are gold dust or whatever, you know, miraculous gold. I mean, we're not. We're not making this stuff up."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1411.61,"end":1414.05,"speaker":"Fr Stephen De Young","text":"So that's the gross version, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1414.05,"end":1414.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1415.13,"end":1423.37,"speaker":"Fr Stephen De Young","text":"And we can all look at that and say, like, what? Right, right. There are more subtle, way more subtle versions of this, though."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1423.86,"end":1425.06,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1425.3,"end":1441.54,"speaker":"Fr Stephen De Young","text":"Right. Where people kind of are like Job's friends. Right. And so if someone is, well, to do and successful at the moment, then, hey, they must be doing everything right. They must be holy people. Right. They must be moral people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1442.9,"end":1446.18,"speaker":"Fr Andrew Stephen Damick","text":"Marks of. Well, I was gonna say marks of election, as it were."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1446.9,"end":1455.29,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah, right. And the opposite is true. Right. If they've fallen on hard times, it must be because they're, you know, lazy or what?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1455.36,"end":1455.6,"speaker":"Fr Andrew Stephen Damick","text":"Whatever."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1455.6,"end":1467.36,"speaker":"Fr Stephen De Young","text":"Whatever. Whatever. Right. And this is not a new thing. This is not an American thing. This has been going on forever because St. John Chrysostom chews his people out about doing this."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1467.52,"end":1467.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1467.88,"end":1480.8,"speaker":"Fr Stephen De Young","text":"About judging the poor. So this. This has been a constant thing. And this is essentially what this boils down to. The whole problem is that it equates blessings with stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1482.43,"end":1482.67,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1483.39,"end":1491.31,"speaker":"Fr Stephen De Young","text":"Right. It used to be money. Right. Blessings with money. Now that we're in late, late stage capitalism, it's stuff, junk. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1492.03,"end":1495.23,"speaker":"Fr Andrew Stephen Damick","text":"So I can't. I can't count my blessings. Name them one by one."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1497.15,"end":1505.39,"speaker":"Fr Stephen De Young","text":"You could, hypothetically, but if it's a list of, like, objects you own in your house, then I might."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1505.39,"end":1506.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I might have a problem."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1506.23,"end":1538.82,"speaker":"Fr Stephen De Young","text":"Start over. Yeah. Start. Start your list over. Yeah. So, yeah. So blessings isn't stuff. Blessing, say. Blessing is. Is. Is a relational category, as we were just saying. It's a. It's a state in which you are blessedness. Right. You're in a state of blessedness. Right. Or. Or you are accursed, which no one wants to say, but. And you shouldn't go around saying it, probably."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1538.82,"end":1540.06,"speaker":"Fr Andrew Stephen Damick","text":"And not a popular hashtag."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1540.06,"end":1591.91,"speaker":"Fr Stephen De Young","text":"Anathematizing. Yeah. Hashtag anathematized. Yeah. So, yeah, you don't want to say that, but. Yeah. Because generally the people who are in that state don't necessarily realize it or don't want to admit it, but. So then what is the relationship with stuff? Because there is Right. There is this sort of. It's not really attention, but people will call it attention in the Bible where they'll point at figures in the Old Testament like Abraham or Job, who are described as having sort of all this wealth. Right. As sort of a mark of their favor with God. And at the same time, you get to the New Testament and Jesus doesn't say a lot of nice things about rich people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1592.71,"end":1593.11,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1593.75,"end":1615.93,"speaker":"Fr Stephen De Young","text":"Other than, you know, give all your money to the poor and come become one of my disciples. Right. And so people will just treat that as attention or what have you, or they'll say, well, that's a difference between the Old and New Testament. The Old Testament blessings were material and now they're spiritual or something. Something like that sort of quasi Marcionite kind of thing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1616.81,"end":1622.65,"speaker":"Fr Andrew Stephen Damick","text":"That's how you escape being, you know, in the prosperity gospel, you say, oh, it's just about spiritual blessings now."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1625.13,"end":1639.46,"speaker":"Fr Stephen De Young","text":"But so there's. There's kind of a chicken and an egg issue here. Right. So the problem is that the one side says, well, you've gotten stuff, therefore you're blessed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1640.58,"end":1640.98,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1640.98,"end":1666.12,"speaker":"Fr Stephen De Young","text":"Right. Whereas what we're talking about is, no, you're blessed. You're living a life keeping the commandments of Christ. You're living a life in harmony with God and your neighbor and your family and your community. Right. And because of that, there is life that's happening. Right. And sometimes that life includes stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1668.28,"end":1668.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1668.64,"end":1672.68,"speaker":"Fr Stephen De Young","text":"But life does not consist of stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1673.32,"end":1673.72,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1674.2,"end":1681,"speaker":"Fr Stephen De Young","text":"Right. And so. Right. The Lord giveth, the Lord taketh away. Blessed be the name of the Lord. Right, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1681.72,"end":1682.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1682.2,"end":1698.43,"speaker":"Fr Stephen De Young","text":"The. The stuff will. Can come and go. Right. But as long as you're. You're living in that harmonious state this is of what the Book of Job is about. Whether they come or they go, the stuff, that harmony."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1698.99,"end":1699.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1699.35,"end":1733.51,"speaker":"Fr Stephen De Young","text":"Remains. That state of blessedness remains. Right. And you can lose all your stuff and still be living in harmony with God and his creation and your fellow human beings. And then you're not cursed. Right. Or you could have all this stuff and be alienated from God and alienated from your family and alienated from your community and from the world, the natural world, and sit in your palace of stuff all alone and be cursed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1734.07,"end":1734.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1735.83,"end":1756.17,"speaker":"Fr Stephen De Young","text":"And it's interesting as. As technology and everything progresses in our contemporary world, it gets less and less hard for people to imagine how someone with all the stuff could be lonely and alienated and miserable. Sure."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1756.17,"end":1773.78,"speaker":"Fr Andrew Stephen Damick","text":"I mean, just think about people with the psychological problem of being hoarders. You know, they are surrounded with their stuff and yet they're destroying their relationships, they're destroying their lives. They got plenty of stuff, way more than they ever could use. It's all rotting on their shelves."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1774.02,"end":1778.18,"speaker":"Fr Stephen De Young","text":"But, you know, or even the celebrities, the rich guy."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1779.06,"end":1781.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly, exactly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1784.34,"end":1805.4,"speaker":"Fr Stephen De Young","text":"So. Yeah. So this is, and these bad understandings of what blessings are and what blessing is, what are the places where you really see the rub of that is that the sort of historic Christian understanding of asceticism makes no sense with it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1805.96,"end":1830.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Give everything up. Why would you do that? If blessings equals stuff, the most blessed person should be the person with the most stuff. And yet, like in orthodox tradition, most of our highest, highest saints were people who were utterly impoverished from the world's point of view, you know, and in many cases gave it all up very voluntarily."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1831.46,"end":1903.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But even, even, I mean, this isn't just, you know, I'm going to briefly defend our Protestant friends here. There are certain levels and types of asceticism that got jettisoned pretty fast. Right. I mean, old Luther went and married a nun. Right. But the, but if you look at, for example, the reform traditions, the Calvinist traditions, they were very strongly against the spending of money. You were to work hard and having success in your hard work was seen as a mark of God's favorite, even a mark of election. Right. In the Calvinist understanding. Right. But people who went out and profligately spent money on clothes, on houses, on cars. Right. That kind of thing. Right. Were, were. That was taken to be the opposite. That was taken to be a mark of. That profligacy was needed to be a mark of reprobation. Right. And so you did not do that. And that is a type of asceticism, Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1903.47,"end":1904.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. Of course."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1904.83,"end":1944.93,"speaker":"Fr Stephen De Young","text":"If you have a million dollars in the bank, but you're driving a 30 year old car and you own one suit that you wear to church on Sunday. That's a kind of asceticism. Yeah, right. That, that gets practiced. But so it's not just like, oh, Protestants don't get asceticism. But if you go, even in reform circles today, for example, you don't find as much of that as you used to. Like in the United States, for example, even the places where there was that kind of. And you find it, I mean, Baptist groups in the United States. Right. You don't drink, you don't smoke, you don't."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1944.93,"end":1945.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1945.13,"end":1946.73,"speaker":"Fr Stephen De Young","text":"There, there, there were certain."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1947.53,"end":1949.85,"speaker":"Fr Andrew Stephen Damick","text":"Don't smoke, drink or chew or date girls that do."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1950.33,"end":1957.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. If you're gonna, if you have to absolutely have to dance at gunpoint. You leave room for the Holy Spirit in between you and your partner."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1958.18,"end":1958.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1960.26,"end":1963.7,"speaker":"Fr Stephen De Young","text":"So. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1963.7,"end":1966.58,"speaker":"Fr Andrew Stephen Damick","text":"But, but again, it's all true, folks. It's all true."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1967.22,"end":1970.1,"speaker":"Fr Stephen De Young","text":"It's true. All of that is going away now."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1970.42,"end":1971.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":1971.02,"end":2004.69,"speaker":"Fr Stephen De Young","text":"All of that is going away now. And it's even getting like, in the United States, it's, I mean, it's mostly been bleached out of Roman Catholic life. Right. Fasting during Lent even. Right. And, and it's working on it in the Orthodox Church too. Like, no one's immune to this. And it's because fundamentally, again, good old late stage capitalism that we're experiencing now has sort of reduced what a human person is to just a desiring thing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2005.17,"end":2005.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2005.81,"end":2007.57,"speaker":"Fr Stephen De Young","text":"Just a bundle of desires."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2007.73,"end":2008.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2008.05,"end":2008.37,"speaker":"Fr Stephen De Young","text":"Which."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2009.97,"end":2040.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which works its way out in numerous ways. It's not just about stuff. Right. You know, like, like the great, like what is, I'm about to say, what is love? And then, you know, everyone's going, lady, don't hurt me. Yeah, exactly. Right. You know, but, but what is love considered to be? Right? It's considered to be authentic desire. You know, that's what it comes down to. Like, do I really desire this person? Do I really want them? Do I really want to be with them?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2041.42,"end":2042.86,"speaker":"Fr Stephen De Young","text":"You know, do they meet my needs?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2043.66,"end":2044.38,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2044.38,"end":2047.66,"speaker":"Fr Stephen De Young","text":"And of course, I mean the emotional needs or whatever other needs."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2047.82,"end":2074.86,"speaker":"Fr Andrew Stephen Damick","text":"And this is, this is part of what's behind so much of the confusion about, you know, gender identities and, you know, deviant sexuality. And I mean, all of this stuff is, is as you say, it's based in this idea that human beings are basically just desires. And so if you, if you are, then the key is to correctly identify your desires. And once you've correctly identified them, then go be that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2075.82,"end":2077.34,"speaker":"Fr Stephen De Young","text":"Well, then go consume that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2077.74,"end":2078.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2079.1,"end":2082.62,"speaker":"Fr Stephen De Young","text":"Consume that in a never ending quest to satisfy that desire."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2082.86,"end":2083.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2083.98,"end":2155.58,"speaker":"Fr Stephen De Young","text":"And, and the reason our culture has, has done that to humanity is it it serves the ends. Because once you're just a bunch of desires and consumption is the answer to those desires, then you can be marketed to. And that's what the entire advertising industry has done now for 75 years, is find ways to take whatever their product is and tap into some desire of yours and tell you that it will be fulfilled. And this isn't, again, this isn't something that just affects one political side or one political group. Right. There's sort of a lie that's told on both sides of the, the U.S. at least political spectrum. Right. On the, on the conservative side of liberalism, the lie is everyone can be rich, Right? And then once you're rich, you'll have all your desires met. But all it does is takes is hard work. You just go and you work hard and you'll be rich too. Right. And that's a lie, because Starbucks needs thousands and thousands of hourly baristas and they only need one CEO."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2156.3,"end":2156.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2156.78,"end":2157.9,"speaker":"Fr Stephen De Young","text":"It's just so."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2158.22,"end":2177.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Or as I got flayed one time because I actually said in a sermon, every kid cannot grow up to be president. We've had 40 some and we have hundreds of millions of people. It's just not a. It's not. The math doesn't work out. It just doesn't work. Right. But."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2177.09,"end":2214.97,"speaker":"Fr Stephen De Young","text":"So that's the answer at the end of the trail. You just work hard, hard enough, long enough, do all the right things. You too will be wealthy. And then once you're wealthy, you'll be able to satisfy all your desires that you can't satisfy now because you haven't worked hard enough for long enough yet. And then the flip side, the progressive side of liberalism, the lie is that everyone can have all of their personal desires satisfied and they'll never conflict with each other. Everyone can be completely sexually fulfilled. Everyone can be completely personally and emotionally fulfilled, and no one's desires will ever conflict with anyone else's desires."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2215.29,"end":2215.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2217.45,"end":2222.01,"speaker":"Fr Stephen De Young","text":"And that's. That's exploded, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2222.01,"end":2226.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's. Yeah. Pretty spectacularly late lately. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2227.27,"end":2245.59,"speaker":"Fr Stephen De Young","text":"Exhibit A, being. You know, the sexual revolution. And now me too. Right, right. So the idea that everyone could just satisfy their desires and then. Oh, wait, you can't do that without stepping on a lot of other people and consuming a lot of other people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2245.91,"end":2246.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2248.07,"end":2269.65,"speaker":"Fr Stephen De Young","text":"So both of those are lies, right? Both of those are lies. But. But you have to function with one of those lies in order to function in a system in which you're just a ball of desires. Right. And that's a fundamentally misshapen view of what it is to be human. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2269.65,"end":2270.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2270.05,"end":2273.05,"speaker":"Fr Stephen De Young","text":"That's reducing a human to a giant consuming mouth."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2276.09,"end":2278.49,"speaker":"Fr Andrew Stephen Damick","text":"We have images of giant mouths in Christianity."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2279.29,"end":2281.93,"speaker":"Fr Stephen De Young","text":"Yes. And the gaping maw of hell."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2282.37,"end":2286.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. It's. It's the way to the underworld. I mean. Yeah, yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2286.65,"end":2287.49,"speaker":"Fr Stephen De Young","text":"Right. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2287.57,"end":2292.21,"speaker":"Fr Andrew Stephen Damick","text":"I have an awesome icon here in my studio, which is exactly. The Hellmouth."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2293.25,"end":2378.17,"speaker":"Fr Stephen De Young","text":"Yeah. So we have to set aside. Right. Having seen that, that that just fundamentally doesn't work. Right. And isn't it's not only not real because it's not real. It's not what the Scriptures tell us. Right. And it's not what the. The. The church teaches us. Right. So the person who has their desire, desires fulfilled is not the blessed person, and the person who has their desires denied is not the cursed person. That's not at all right. Even though that's how many of us have been brought up through it in the culture and even church culture, to think. So getting back to what we were saying in the. In the introduction to this first half and going into the terms that are used for blessing in the scriptures, the Hebrew word, the verb is barak, to bless. The noun form of that is baruch, which is a name, given name. Often in the Old Testament, that means the blessed one, the one who is blessed. But barak, the sort of root, original meaning of it, is actually to kneel."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2379.05,"end":2379.61,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2382.33,"end":2388.41,"speaker":"Fr Stephen De Young","text":"So this makes a lot of sense when you think about the phrase, you know, bless the Lord, bless Yahweh."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2388.62,"end":2388.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2388.78,"end":2391.58,"speaker":"Fr Stephen De Young","text":"That would be to kneel before the Lord."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2391.9,"end":2410.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think a lot of times when we see it say bless the Lord, usually we have the sense of blessing is something that some. A higher person does towards a small. A lower person. And so when we hear stuff. Yeah, exactly. Giving stuff. Bless the Lord, I'm like, well, what does the Lord need from me? You know, I don't have any stuff to offer him."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2411.98,"end":2413.58,"speaker":"Fr Stephen De Young","text":"Yeah. And it's not stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2413.66,"end":2414.62,"speaker":"Fr Andrew Stephen Damick","text":"It's not stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2415.21,"end":2415.45,"speaker":"Brett","text":"So."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2415.77,"end":2420.81,"speaker":"Fr Stephen De Young","text":"But that gets a little trickier. The kneeling thing gets a little trickier when we talk about God blessing you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2421.37,"end":2422.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2422.33,"end":2424.65,"speaker":"Fr Stephen De Young","text":"Because that doesn't mean God kneeling before you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2425.69,"end":2426.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2426.57,"end":2428.89,"speaker":"Fr Stephen De Young","text":"It means more like God kneeling you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2429.69,"end":2432.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2433.61,"end":2445.66,"speaker":"Fr Stephen De Young","text":"If you think about. This is not. By the way, we're not trying to portray God as general Zod. I know that's what many of you are thinking. But that's not where we're going before. Yeah, sorry."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2448.14,"end":2455.98,"speaker":"Fr Andrew Stephen Damick","text":"Our second. Yeah, our second 1980s pop culture reference. At least that I'm aware of for the evening."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2459.9,"end":2478.28,"speaker":"Fr Stephen De Young","text":"So if you think about kneeling in a quite literal sense. Right. Kneeling is changing your posture or your orientation. Right. You are changing your posture. If you bless the Lord or bless Yahweh, you are changing your posture or your orientation toward God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2478.6,"end":2479.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2480.04,"end":2488.6,"speaker":"Fr Stephen De Young","text":"And if God blesses you, if God kneels you, he's changing your posture or orientation toward him."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2488.84,"end":2492.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's. It's like the difference between retiring and being retired."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2493.16,"end":2493.64,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2495,"end":2495.96,"speaker":"Fr Andrew Stephen Damick","text":"In short. Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2496.04,"end":2497.8,"speaker":"Fr Stephen De Young","text":"It produced the same result. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2497.8,"end":2502.18,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly. It produced the same. But one is done to you and the other you do yourself."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2502.66,"end":2546.43,"speaker":"Fr Stephen De Young","text":"Yeah. And ideally, they're both happening Right, Right. Ideally, they're both happening. And this is true not only when we talk about us blessing God, or God blessing us as humans, but when we in the church bless objects. Right. I know we've said this before on the show, but, you know, you bless holy water. You're not making it magic water to kill vampires. Right. And you're not making a material component for a third level cleric spell. You are. You're taking water and you're returning it to the correct orientation within the world. Right. You're returning it to where it belongs in that web of relationships we were talking about. Right. In the world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2546.83,"end":2547.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2547.23,"end":2588,"speaker":"Fr Stephen De Young","text":"Whatever it may have been used for before that, right now, it is going back to. We've talked before about, you know, the difference between the chalice and my Wrath of Khan collector's cup is not the material. It's. It's the use and the purpose. Right. The way it fits into that web of relationships. Right, yeah. And blessing houses, the same idea. Right. It's about putting things back into the correct orientation and relinking them. Right. Reconciling them within the web of relationships that makes up the order of creation. So the Greek word."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2588,"end":2590.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Also slightly surprising."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2591.4,"end":2610.42,"speaker":"Fr Stephen De Young","text":"Yes. Really interesting to nerds like me, at least, because before it's used to translate the Old Testament, this word is not, to our knowledge, used in explicitly religious contexts."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2612.26,"end":2615.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So, yeah, the word is evloya."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2616.5,"end":2617.62,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2618.82,"end":2621.7,"speaker":"Fr Andrew Stephen Damick","text":"Which. Hey, let's. Let's do a little etymology."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2622.1,"end":2627.46,"speaker":"Fr Stephen De Young","text":"Father Andrews, etymology corner."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2629.3,"end":2657.47,"speaker":"Fr Andrew Stephen Damick","text":"There you go. There's little baby Eleanor once again. Yeah, so you're right. Evlogia. It's, you know, that. That beginning ev or u, eu, epsilon, epsilon, which means good, right, or true. And then, you know, logia is from logos word. So it's. It's literally means a good word. But that's not how it. You know, that it doesn't. Doesn't just simply mean good word. Right. In. In the ancient world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2658.27,"end":2667.3,"speaker":"Fr Stephen De Young","text":"And it actually. It actually, Actually loy. Could also mean actions."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2667.62,"end":2672.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there you go. Yeah. That broader sense of logos."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2672.66,"end":2692.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, that's. That's important for all of you papias fans out there when he talks about St Matthew having written down the logia of Christ, that doesn't just mean the words. So get out of town with your Q theory. Anyway."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2694.79,"end":2697.99,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Throwing shade at a very specific set of people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2698.63,"end":2701.75,"speaker":"Fr Stephen De Young","text":"Yeah, I went down a little rabbit trail there, but now we're back."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2703.75,"end":2711.59,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. So, okay, so what does it actually mean in usage in the ancient world, especially prior to the Bible Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2712.6,"end":2714.44,"speaker":"Fr Stephen De Young","text":"It basically meant to endorse."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2716.2,"end":2716.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2717,"end":2721.88,"speaker":"Fr Stephen De Young","text":"To sort of co. Sign. Right. To imprimatur, which."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2721.88,"end":2732.76,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So, I mean, that lends us to all kinds of fun stuff. Like, you know, our modern English word eulogy comes from this quite directly. Right. Evloia."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2733,"end":2733.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2733.8,"end":2758.75,"speaker":"Fr Andrew Stephen Damick","text":"Which I mean, I'm just imagining now, you know, someone knowing this etymology, who is about to preach a sermon at a funeral and saying, I will now give the endorsement of this person who lies dead here before us. But, I mean, it is kind of correct, right? You're commending that person to God, which is. I mean, what is that? That's an endorsement, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2760.19,"end":2766.19,"speaker":"Fr Stephen De Young","text":"Yeah. And you could ask somebody to put in a good word for you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2766.27,"end":2859.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. So, I mean, we do have that expression in English, a good word. And that's. You know, I think that that's the only. There's kind of two ways that that phrase gets used in English. You know, to put in a good word is explicitly about an adornment, an endorsement. Then the other way that it gets used is if someone, you know, speaks a good word which just kind of means that they said something good to you or edifying or whatever, it might be a blessing. Yeah, just. Yeah, yeah. And then the other way that it gets used in the same matrix of. Of meaning. Right. Is that the word blessing is used in English for a sense of permission, but it's often permission that it's almost basically like an endorsement. Right? Like, so you get a woman's father's blessing to marry her, which is basically you're looking for his endorsement, which, you know, people don't always get that, and they sometimes get married anyway. So it's not just permission. Yeah, yeah. It's not just permission. They are looking for a kind of endorsement. And then. And then, of course, we also use the word blessing to refer much more explicit permission. And within, like, the Orthodox Church, we say, I need to get my priest's blessing for that or my bishop's blessing for that. And again, it's that. That sense of a word being spoken that is about, again, a kind of endorsement. Like, you are blessed to do this. You know, you have an endorsement to do this. So. So, like, it is in there in English, we just don't tend to think of the word blessing as meaning endorsement."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2859.97,"end":2860.37,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2861.01,"end":2864.29,"speaker":"Fr Andrew Stephen Damick","text":"But it's. We. We have all that within English. So."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2864.45,"end":2872.53,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah, it is there. So then the question becomes, well, how do we reconcile these two ideas?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2872.61,"end":2872.93,"speaker":"Brett","text":"Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2872.93,"end":2882.42,"speaker":"Fr Stephen De Young","text":"We have a word that in Hebrew means to kneel, kneeling. That gets translated into Greek with a word that means to endorse."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2883.14,"end":2884.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2884.22,"end":2921.15,"speaker":"Fr Stephen De Young","text":"Which don't seem to have a huge Venn diagram overlap, right? Meaning. Right. Well, so the place, the place where these come together is this idea of harmony, right. That we were talking about with kneeling. Right. With in terms, kneeling in terms of posture and orientation, being in this web of relationships harmoniously. If you think about endorsement, right. Or favor or co signing, right. There is always, there are always two parties involved."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2922.91,"end":2923.43,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2923.43,"end":2930.59,"speaker":"Fr Stephen De Young","text":"You have one party who is doing something or who is something and then you have the other party who is co signing that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2931.48,"end":2931.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2931.68,"end":2936.76,"speaker":"Fr Stephen De Young","text":"Who is giving their agreement with that. Right. Or endorsing that or recommending that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2936.84,"end":2944.04,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we use the word endorsed to really to refer to signing something. So like that's again, that's there in the way that we use these, these concepts in English."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2944.76,"end":2981.89,"speaker":"Fr Stephen De Young","text":"Right. And so these two come together in the idea of divine works, right? The divine energies, God working, right in creation. Right. God's blessing, right. Brings you into harmony with what he's doing in the sense of adjusting your posture and your orientation toward it. And also, right, there's that endorsement and co signing idea, that cooperation idea, where the two are brought into alignment. Right. And so that's the place where these two ideas sort of come together."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2983.98,"end":2984.14,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":2984.14,"end":3004.06,"speaker":"Fr Stephen De Young","text":"Terms of what's going on with blessing. Right. In the scripture. And there's a couple of other sort of phenomena within scripture regarding blessing that we need to talk about just so we can be exhaustive and exhaust everyone and have the first half of the show go over an hour."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3005.74,"end":3007.26,"speaker":"Fr Andrew Stephen Damick","text":"I'm pretty sure it's going to."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3008.31,"end":3009.91,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, we're there."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3010.39,"end":3010.79,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3013.75,"end":3027.91,"speaker":"Fr Stephen De Young","text":"The first is the idea of this kind of recursive way in which blessing is used. Blessing oneself, right. That you bless yourself. And we use this language to refer to making the sign of the cross sometimes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3028.31,"end":3029.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, bless yourself."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3029.23,"end":3054.49,"speaker":"Fr Stephen De Young","text":"Right. And so, you know, from what we've just said, the idea of blessing yourself would be the idea of bringing yourself back into a correct posture or orientation. Right. Getting yourself back on board. Right. With what, with what God is doing. But there's one particular place where, where this concept comes up that is kind of important to biblical theology."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3055.05,"end":3055.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3055.65,"end":3064.46,"speaker":"Fr Stephen De Young","text":"And by kind of important, I mean explains Pauline theology. Sorry, Calvinists."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3066.78,"end":3068.94,"speaker":"Fr Andrew Stephen Damick","text":"We could just say it's Genesis level stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3069.82,"end":3091.95,"speaker":"Fr Stephen De Young","text":"Yes. Because it's in Genesis. And so an example of this is in Genesis 12:3. This isn't the only place this happens with regard to Abraham, but this is one of them. So a lot of English translations of Genesis 12, verse 3 have something like in you will all the nations of the earth be blessed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3092.99,"end":3103.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which we did a sort of survey of almost every English translation we could find. And almost all of them said pretty much something exactly like that. In you will all the nations that you were."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3103.43,"end":3120.31,"speaker":"Fr Stephen De Young","text":"Some variation. So the Hebrew is actually more like all the nations will bless themselves in you. Right. Which is kind of a weird turn of phrase, right. That those different translations are trying to sort of figure out how to render that in English."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3120.63,"end":3165.04,"speaker":"Fr Andrew Stephen Damick","text":"And I would say so if I were going to speculate. I mean, I can't just lay out a history of every single English translation ever made over the last thousand years in, you know, in 10 seconds. But if I were to speculate as to why it tends to be, or almost always is this other way. Is that the idea of blessing yourself, that concept doesn't seem to exist in most of the culture, most of the English speaking religious cultures that are making translations. Right. Does that, if that makes any sense, the idea that you are putting yourself into harmony, into order. Because there's this idea that being blessed means receiving something good. And so why would you say that the nations are going to do that to themselves?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3165.52,"end":3165.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3165.88,"end":3173.33,"speaker":"Fr Andrew Stephen Damick","text":"The idea is God is doing this. So in you, Abraham, God is going to do this to them. Which of course is not incorrect."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3174.05,"end":3174.45,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3174.61,"end":3178.53,"speaker":"Fr Andrew Stephen Damick","text":"But that's not actually the most literal way of translating this verse."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3178.53,"end":3183.89,"speaker":"Fr Stephen De Young","text":"Right. And the idea of blessing yourself in another person also is kind of odd."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3184.29,"end":3187.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3187.57,"end":3205.5,"speaker":"Fr Stephen De Young","text":"And you'll get rearranges that the. As longtime listeners might not be surprised, the net Bible actually comes the closest to sort of reflecting the original, although even they punt a little because they have it as all the nations will bless each other in you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3206.46,"end":3208.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's trying to find a way."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3208.38,"end":3212.58,"speaker":"Fr Stephen De Young","text":"To bring out that recursive. So they have the nations blessing each other."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3212.58,"end":3214.62,"speaker":"Fr Andrew Stephen Damick","text":"Blessing each other, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3215.26,"end":3278.72,"speaker":"Fr Stephen De Young","text":"So the, the best place to understand what's going on here though, in terms of that original translation, other than just a weird Hebrew idiom, which is also a nice punt, just say, oh, that's a Hebrew idiom, is to see what St. Paul does with it in Abraham or in Romans, sorry, does with Abraham in Romans and this text and other related texts in Romans. And so we talked back at the beginning of this first half about the relationship between justice and blessing. Right. Blessing being about these connections in the web of relationships that make up the overall order of justice. So, and I'm pretty sure we've talked before on the show about how justification, the primary Meaning of justification in the Scripture is more like justification in Microsoft Word than like something that happens at a courthouse."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3278.83,"end":3281.71,"speaker":"Fr Andrew Stephen Damick","text":"Right? Being put straight, put in order, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3282.11,"end":3288.99,"speaker":"Fr Stephen De Young","text":"Left justified means it's lined up on the left side, right? Is on the right side, full is all around, right. It's all put in order."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3289.31,"end":3291.31,"speaker":"Fr Andrew Stephen Damick","text":"I'm always fully justified in my writing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3292.19,"end":3365.8,"speaker":"Fr Stephen De Young","text":"Right. So then you get those weird spaces in the middle of you. Anyway, so justification is a related concept, too. So when St. Paul wants to talk about how the nations, remember, Gentiles means the nations, it's one of those things we translate differently in the Old and New Testaments for no apparent reason. So when he's talking about how the nations are justified, how they're set, right. How they're put back in order, how they're reoriented, he goes to Genesis 12, three, right. And he goes to other related passages and says that this happens in Abraham. Right. They're just. And the way Abraham is justified. And so St. Paul makes this theological connection, right, between entering the state of blessedness and justification. Right. And he does it through Abraham and his understanding of what's going on in passages like Genesis. Genesis 12, verse three."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3366.28,"end":3367.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3367.16,"end":3386.78,"speaker":"Fr Stephen De Young","text":"And so this is key to sort of understanding what he's doing and how he's weaving those together. What he means when he quotes, blessed is the man who sins, not reckon against him. Right. And once you understand that, then all of the sort of juridical stuff falls away. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3387.02,"end":3389.98,"speaker":"Fr Andrew Stephen Damick","text":"It's about an actual state. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3389.98,"end":3390.38,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3390.38,"end":3395.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Okay, so what else?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3395.82,"end":3436.9,"speaker":"Fr Stephen De Young","text":"Certain lawyers who became reformers. So that reciprocal idea is not only present in this kind of idea of someone blessing themselves, but also that, as we talked about before, in our ideal situation, right. God is blessing us and we are blessing God. Right. That there's this cooperation within this state of blessedness. We're always blessing and being blessed. And that does it. Again, like everything, this isn't just an individual and God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3437.83,"end":3438.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3438.03,"end":3457.83,"speaker":"Fr Stephen De Young","text":"But this happens within a community. Right? So Christians as a community are blessing each other and are being blessed by each other. We're blessing the elements of creation. Right. And we're being blessed by God and blessing God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3458.47,"end":3493.55,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, this is simply the. This is. If we need to see a model for how that works, that's the life of the angels. I mean, that's just what they're. What they're doing. They are putting things in order. They are putting, you know, being ordered. They are. You know, all of that is happening. I mean, they're not dealing with it in Terms of sin the way that we have to. But still, it's. It's about. Because being put in order is not just about repairing a break, it's also about beautification. Right. Which is not necessarily about fixing something that's broken. It's. It's. You know, you can make things more and more beautiful by. By blessing them even further, you know?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3494.94,"end":3517.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And there's a. There's a nice Greek term in Scripture for this. This state. Right. Of. Of blessedness, of blessing and being blessed and of the community. And that's kinonia. And those of you who studied Greek in the Anglophone world will have to occasionally pardon our Greek pronunciation of the Greek."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3519.26,"end":3521.38,"speaker":"Fr Andrew Stephen Damick","text":"We're not going to say koinonia."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3524.1,"end":3527.22,"speaker":"Fr Stephen De Young","text":"The Greeks would come after us. They know where we live."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3528.26,"end":3528.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3528.74,"end":3550.28,"speaker":"Fr Stephen De Young","text":"So we cannot do that Erasmian stuff even if we wanted to. But. Yeah, and. And kinonia gets translated a lot of way. Fellowship being one of the communion. Yeah. And fellowship is a word that's been greatly sort of denuded in our Western church life. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3550.28,"end":3558.56,"speaker":"Fr Andrew Stephen Damick","text":"I mean, when I was growing up, it meant fried chicken and mashed potatoes and casseroles. People. Casseroles. Casseroles, yes. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3559.36,"end":3634.04,"speaker":"Fr Stephen De Young","text":"People hanging out. That's fellowship. Drink some coffee. Right. And it's not saying that that's not it or not part of it, but it's much more than that. Right. So this word, kennedia, that gets used in Scripture to describe this participation in communion with one another is the same word that, for example, Plato uses to describe the relationship between objects and the forms. Right. Like the eternal forms in the heavenly places, objects participate in them. Right. And that. That kidanea, that participation makes them what they are. Right. And so this is, again, this idea of this web of relationships, but now within a community between people. And again, as we've talked about before, it's those relationships and those roles and those functions as we all function together with one another that define our identity and define who we are. Right. Not some kind of isolated individual thing. And so then, last but not least, there is another word that is translated blessed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3634.68,"end":3635.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3635.64,"end":3638.04,"speaker":"Fr Stephen De Young","text":"In the New Testament. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3638.04,"end":3640.16,"speaker":"Fr Andrew Stephen Damick","text":"And even in the Old. If you're looking at the Greek Old Testament."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3640.16,"end":3643.24,"speaker":"Fr Stephen De Young","text":"Yeah. In the Greek Old Testament. And that is makarios."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3644.68,"end":3653.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is the first word in Psalm 1. Blessed is the man. We'll talk more about that a little bit later. Of course, it's a name too, right. Makarios."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3653.8,"end":3657.63,"speaker":"Fr Stephen De Young","text":"Yeah. And it begins the Beatitudes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3657.63,"end":3660.19,"speaker":"Fr Andrew Stephen Damick","text":"The Beatitudes, exactly. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3660.35,"end":3670.43,"speaker":"Fr Stephen De Young","text":"And so this is the point in the program where last time it was Hagel. Tonight, I say something nice about David Bentley Hart."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3670.75,"end":3679.39,"speaker":"Fr Andrew Stephen Damick","text":"See, this is going to become a running gag now, too, you know, along with our. Whatever. Friends, you don't want Father Steven DeYoung to say something nice about you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3681.31,"end":3687.93,"speaker":"Fr Stephen De Young","text":"Well, I'm going to say something nice about David Bentley art. And that's specifically about his New Testament translation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3688.09,"end":3688.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3690.57,"end":3716.35,"speaker":"Fr Stephen De Young","text":"Thanks, Yale, again for the review copy. Anyway, because it was free and I'm Dutch, but he chose to translate makarios as blissful, which I think is a great translation, and here's why. Because that word is used in other Greek literature to describe, like, the life of the gods."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3717.07,"end":3725.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, if you pull out, you know, your Liddell and Scott Greek lexicon that everyone should have on their shelf. Right. You can have the little size."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3725.47,"end":3726.43,"speaker":"Fr Stephen De Young","text":"Which size do you have?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3726.43,"end":3727.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, the little."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3727.03,"end":3727.27,"speaker":"Fr Stephen De Young","text":"Little."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3727.27,"end":3729.79,"speaker":"Fr Andrew Stephen Damick","text":"I have the middle little. I have the middle little. So there's the little."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3730.59,"end":3731.75,"speaker":"Fr Stephen De Young","text":"I have the full size."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3731.75,"end":3732.91,"speaker":"Fr Andrew Stephen Damick","text":"You have the Great Scott."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3733.39,"end":3738.2,"speaker":"Fr Stephen De Young","text":"Yes, I have the full on Oxford back when they published books."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3738.36,"end":3751.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I have the metal little, which is pretty good. Pretty good. I mean, if you look it up, it literally. It says this. It says of the gods or something like that. That's just the dictionary definition in the lexicon."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3751.96,"end":3757.64,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So this is eating ambrosia, Right? Eternal life hanging out. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3757.88,"end":3775.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Should we all be imagining those moments in Clash of the Titans with all the big fake beards and they're standing around some fountain there and, oh, Lord Zeus, you know, why. Why do the. Why do Greek gods have British accents in 1960s American films? I ask you this, that movie was."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3775.6,"end":3776.6,"speaker":"Fr Stephen De Young","text":"Made in the 60s."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3776.6,"end":3786.44,"speaker":"Fr Andrew Stephen Damick","text":"Was it? I know, maybe you're right. Yeah, that's right. 80s. I'm thinking of like, you know, Jason, the Argonauts and stuff like this. That, that, that era. Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3786.44,"end":3789.08,"speaker":"Fr Stephen De Young","text":"The Ray Harryhausen stuff. Now, there's a classic."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3789.08,"end":3794.91,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah, those are the kinds of films I was allowed to see when I was young, were largely films that have been made, you know, 20, 30 years before."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3795.79,"end":3796.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3796.39,"end":3798.11,"speaker":"Fr Andrew Stephen Damick","text":"Sword and. Sword and sandal epics."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3798.75,"end":3799.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3801.47,"end":3802.99,"speaker":"Fr Andrew Stephen Damick","text":"I don't regret a moment of it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3803.63,"end":3808.43,"speaker":"Fr Stephen De Young","text":"And you can see how that would have a. Right. It's obviously that it would be a blessed state."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3808.99,"end":3809.75,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3809.75,"end":3811.15,"speaker":"Fr Stephen De Young","text":"Sharing in the life of God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3811.39,"end":3811.79,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3812.35,"end":3863.85,"speaker":"Fr Stephen De Young","text":"Is a blessed state. Right. The Life of the Angels as we were just talking about. Right. So you can see how this idea is connected, too, and why it would get translated in the same or similar ways. Right. But so this is. This is One of the keys in understanding that, that the Beatitudes are actually about eschatology. They're about the eternal life. Right. And so, you know, especially if you look at St. Luke's version where he's got the woes, the, you know, when he says, blessed are you who are poor. Right. That the, the, the person who is poor is living this divine life. Right. Is already experiencing eternal life, whereas the person who's rich. Right. Woe to him."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3865.13,"end":3865.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3865.69,"end":3867.13,"speaker":"Fr Stephen De Young","text":"He's the one who's a cursing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3868.41,"end":3868.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3868.97,"end":3894.01,"speaker":"Fr Stephen De Young","text":"And, and all through they're these sort of inversions, right. To carry across the same idea that we've been talking about through most of this half that we're talking about a state. We're talking about sharing in the life of God. We're talking about communion with God and with your fellow creatures and with the creation, not about stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3894.09,"end":3901.45,"speaker":"Fr Andrew Stephen Damick","text":"Stuff, Right. All right. Well, having said that, we're going to go ahead and take a quick break and we'll be right back."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3902.69,"end":3915.33,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3915.65,"end":3947.32,"speaker":"Announcer","text":"That's 855-AF-RADIO. St. Ignatius, first century bishop of Antioch, called the God bearer and is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3947.48,"end":3947.84,"speaker":"Fr Andrew Stephen Damick","text":"Fr."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3947.84,"end":3963.7,"speaker":"Announcer","text":"Andrew Damick recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he wrote. Martyrdom, salvation in Christ the Bishop, the unity of the church and the Eucharist."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3963.94,"end":3984.53,"speaker":"Fr Stephen De Young","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense, which that can be challenging for us because, number one, he doesn't seem to have any reticence at all about going to martyrdom. Like there's no sense of, well, this is what I have to do, you know, I wish I didn't have to, but this is God's will for me. He is going to joyfully, gladly to."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3984.53,"end":3995.37,"speaker":"Announcer","text":"Find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":3995.37,"end":4010.19,"speaker":"Announcer","text":"Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-2372, 3, 4, 6. That's 8 5, AF radio."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4011.63,"end":4023.23,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the second half. Call in with your hashtags for blessings and curses. We want to hear from you. So. All right. We just talked about blessings, Father Andrew."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4023.31,"end":4026.51,"speaker":"Fr Stephen De Young","text":"Oh, I don't want to call you out publicly or anything."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4026.75,"end":4028.67,"speaker":"Fr Andrew Stephen Damick","text":"Oh, but go for it. You might as well."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4028.99,"end":4041.3,"speaker":"Fr Stephen De Young","text":"Well, I was just going to say that, you know, some folks, when they have a popular podcast, you know, and they have commercial breaks, they would use that to draw the attention of their audience to the works of other people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4042.34,"end":4044.02,"speaker":"Fr Andrew Stephen Damick","text":"Hey, I don't pick the commercials."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4045.22,"end":4045.78,"speaker":"Fr Stephen De Young","text":"Okay?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4046.26,"end":4059.78,"speaker":"Fr Andrew Stephen Damick","text":"I don't. But here's the problem. I was gonna say if, if I, if I, you know, if I told Trudy to play a commercial with one of your books, we know you run, you run out of the room and we, we, you know, we can't have you do that. You might knock something over. You might break something."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4061.64,"end":4067.24,"speaker":"Fr Stephen De Young","text":"I have enough technical difficulties as it is. Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4068.92,"end":4079.36,"speaker":"Fr Andrew Stephen Damick","text":"So anyway, well, you know, so welcome back, everybody. Thank, thank you for that call out. I do appreciate it. It's good for you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4079.36,"end":4081.4,"speaker":"Fr Stephen De Young","text":"I was just, you know, we just gotta."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4081.4,"end":4083.48,"speaker":"Fr Andrew Stephen Damick","text":"It's all good. Like I said, I don't pick the commercials."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4083.64,"end":4091.54,"speaker":"Fr Stephen De Young","text":"There are people out there thinking about it. So now you've been able to address the situation, you don't pick the commercials. Just a coincidence."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4091.7,"end":4100.98,"speaker":"Fr Andrew Stephen Damick","text":"Hey, look, it's the marketing, you know, it's the marketing department. They're like, you know, what can I tell you? I mean, it's just the way it is. It's not my."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4101.06,"end":4106.5,"speaker":"Fr Stephen De Young","text":"There are people out there with a desire to learn more. That's ain't Ignatius. And you're here to."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4106.66,"end":4113.3,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly, exactly. All right, so ugaritic death curses, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4114.58,"end":4117.31,"speaker":"Fr Stephen De Young","text":"Yes, ugaritic death curses. And you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4119.07,"end":4120.91,"speaker":"Fr Andrew Stephen Damick","text":"It's the title of your next self help book."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4121.47,"end":4135.47,"speaker":"Fr Stephen De Young","text":"Yes, yes. Because you don't want any of them ugretic death curses. So we're gonna, we're gonna actually talk about one. I briefly thought, hey, maybe we should read it. Then I'm like, nah, we shouldn't do that out loud. That's not good."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4135.95,"end":4136.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4136.63,"end":4137.15,"speaker":"Fr Stephen De Young","text":"We don't."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4137.15,"end":4138.43,"speaker":"Fr Andrew Stephen Damick","text":"We don't say those things on the."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4138.43,"end":4140.43,"speaker":"Fr Stephen De Young","text":"Air or any airwaves."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4140.43,"end":4143.57,"speaker":"Fr Andrew Stephen Damick","text":"Not don't read out. Yeah, don't read them out loud. Ever."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4143.81,"end":4151.73,"speaker":"Fr Stephen De Young","text":"Some guy somewhere in a cabin listening, his girlfriend would get possessed by a dead eye. It would all go sideways. So we're not reading it even in a recorded format."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4151.89,"end":4153.49,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4153.81,"end":4187.72,"speaker":"Fr Stephen De Young","text":"So but in perusing some ugaritic death Curses, not that long ago, as is my one. I found one that I think is the original evil eye, or at least the oldest one. We have the most reference to sort of an evil eye type of idea that we have. And this was a curse that you would put on somebody. And the curse is basically trying to attract the eye of Anat, our old friend Anat."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4188.6,"end":4190.2,"speaker":"Fr Andrew Stephen Damick","text":"Isn't she bails."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4190.2,"end":4191.48,"speaker":"Fr Stephen De Young","text":"Sister wife of baal."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4191.64,"end":4196.58,"speaker":"Fr Andrew Stephen Damick","text":"Sister wife of baal, yeah. Smashed her father's head in. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4196.58,"end":4199.26,"speaker":"Fr Stephen De Young","text":"If I remember correctly, threatened to threaten to smash her."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4199.26,"end":4200.66,"speaker":"Fr Andrew Stephen Damick","text":"Threatened to. Oh, excuse me."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4200.66,"end":4211.54,"speaker":"Fr Stephen De Young","text":"Well, there you are. If he didn't give BAAL a palace. Yeah. So. And then I would search them out and destroy them and all their stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4212.66,"end":4216.42,"speaker":"Fr Andrew Stephen Damick","text":"Come on, dad. Father in law, give him a palace."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4217.3,"end":4217.78,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4217.78,"end":4219.46,"speaker":"Fr Andrew Stephen Damick","text":"Or I will crush your skull."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4221.27,"end":4259.58,"speaker":"Fr Stephen De Young","text":"So the, the idea here is that the these kind of curses in the ancient world were invoking spiritual powers. Right. It wasn't that, you know, there's a person who has the whammy right and can put the whammy right. It's not like they're asking Danhausen to curse somebody for them. This was the. You're. You're invoking a spiritual power. Now they would, there were people who they would go to, to put curses on people, but those were people who are seen to have sort of pre existing relationships with these spiritual powers."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4260.06,"end":4261.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4261.22,"end":4271.42,"speaker":"Fr Stephen De Young","text":"Who are in some way already religious or magical functionaries related to these particular spiritual beings who would be the ones who would do the whammy. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4272.62,"end":4278.4,"speaker":"Fr Andrew Stephen Damick","text":"And so now I'm just, I'm thinking suddenly of that, that, that game show Press yous Luck. Do you remember that?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4278.4,"end":4279.32,"speaker":"Fr Stephen De Young","text":"Press yous Luck. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4279.48,"end":4282.92,"speaker":"Fr Andrew Stephen Damick","text":"No whammy. Yeah. Wow."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4283.08,"end":4283.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4283.96,"end":4287.96,"speaker":"Fr Andrew Stephen Damick","text":"They were actually invoking the eye of a knot. I had, I had no idea."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4288.76,"end":4306.47,"speaker":"Fr Stephen De Young","text":"Just don't ask me to explain to you the scientific basis of the whammy. So, and so these kind of curses were used in all kinds of situations. Right. Before you go into battle, you curse the other guy. Right. In commerce you curse the rival fears of the heart, you know."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4306.63,"end":4313.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Isn't this what, Isn't this what was Naim was trying to get Balaam to do to Israel? Like curse them so that I can beat them."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4314.39,"end":4338.94,"speaker":"Fr Stephen De Young","text":"Yeah. And we tend to think of it when it's used in affairs of the heart, we tend to have a very rosy romantic view of it where it's like, oh, get this, get my crush to fall in love with me. Right. It was usually more like kill my romantic rival, kill that person's spouse. So they're on the market again. It was sort of a lot darker than that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4338.94,"end":4355.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Because clearly, if you invoke a demon to kill another person, then they will be fine with being with you. After that, their spouse or their mate will be happy to be with you. Like, oh, well, you know, it's okay. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4355.23,"end":4358.83,"speaker":"Fr Stephen De Young","text":"Or at least. Well, maybe just they'll be too scared to."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4359.63,"end":4363.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that sounds like a loving relationship."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4363.71,"end":4401.42,"speaker":"Fr Stephen De Young","text":"Yeah. So. But. But of course. So that means that in this kind of cursing, right. Cursing someone isn't just a question of you as a human having ill will toward them, nor is it just a question of some evil spiritual power doing something to them. So malign spiritual power. But there's this participatory element, right. Where a human person is cooperating with this evil spiritual power in order to bring about this. This cursed state."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4401.66,"end":4402.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4402.26,"end":4405.18,"speaker":"Fr Stephen De Young","text":"In order to have this happen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4405.42,"end":4413.91,"speaker":"Fr Andrew Stephen Damick","text":"So. So having said that, we actually do have someone who is called in who has a question about all of this. So. Sarah, are you there?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4415.03,"end":4415.91,"speaker":"Brett","text":"Yes, I am."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4416.31,"end":4419.67,"speaker":"Fr Andrew Stephen Damick","text":"Hello, Sarah. Welcome to the Lord of Spirits podcast. Christ is risen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4420.63,"end":4492.74,"speaker":"Brett","text":"Truly, he has risen. So, yeah, my question, I guess, would be, you know, when it comes to blessing or cursing physical objects, you know, in our culture, especially popular culture, they kind of, I guess, sensationalize it, you know, so is there, in a way, I get what I'm gathering from listening, is that, you know, by participating in, like, the life of the church are. That's a. That can become. That's a blessing. I mean, I don't know if it makes sense, but is that kind of a blessing? But then if you become, you know, especially. I'm. I'm East Greek Orthodox, and, you know, they like to bless objects and certain things. And I think I've even discussed this before in the group page on Facebook, like, the evil eye type thing, you know, and people want to have them blessed, like when you get a kid baptized and things like that, but like, putting too much faith, I guess you could say, in those types of objects, could that be. Make itself become a curse? Like, that's what I'm. I'm curious about, like, the objects, especially with idolatry and things like that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4494.78,"end":4553.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So, I mean, we're gonna. We're gonna talk about this a little bit more. But I mean, to bless an object is to put it into the correct relationship to God that it should have. Like, it's full. Like, for instance, to bless holy water is to make water what it truly should be. Right? Yeah, but. But then to take it's Funny. You mentioned the evil eye amulets. The, the mati, right, in, in Greek and there's like other languages. I think it's called a nazar. And there's, there's various versions of this. But if someone, I mean, think about what they're doing, right? If someone asks that, that be blessed, say, with holy water, and then they use it as some kind of talisman against a curse from someone else, not putting their faith in the cross of Christ, not putting their faith in the life of the church. But, but if I have this magical thing because the priest put the magic on it, then they are effectively putting it in the wrong. The other relationship."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4554.84,"end":4556.28,"speaker":"Brett","text":"Okay, yeah, that makes sense."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4556.28,"end":4579.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's, that's, that's effectively what's, what's happening. We're going to talk more about what curses are and what they do. But, but yeah, I mean, certainly people can use objects in a cursed way, right? If you, if you use them in a way that's, that's contrary to God's intention for them, does that make sense? I don't know. Father Stephen, you have anything to add or correct with what I just said?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4580.68,"end":4656.54,"speaker":"Fr Stephen De Young","text":"Well, yeah, just. Just to add, one of the interesting things about that good old ugaritic death curse is not only one of the interesting things about it is that after it sort of puts the evil eye on the other person, it then concludes with an incantation to ward off the evil eye from the person giving the curse. Right? Because there's the idea that once you enter into that world, like, it can bounce back at you, right? Or someone else can attack you with it. And so to me, the big issue with using any kind of amulet like that against a curse like that is you're kind of entering into that world of tit for tat, right? And that is not advisable, Right. Because what the Scriptures are clear about is that it's, it's Christ who has defeated all of those demonic powers and therefore canon does protect us from them. We don't need to, you know, try and enter in and fight fire with fire, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4656.7,"end":4689.68,"speaker":"Brett","text":"Yeah, yeah. Try to take over, replace Christ with these objects, right? Because I remember growing up, like, for me growing up, this is in the 80s when dungeons and Dragons, I was Protestant. And, you know, obviously everybody thought it was Satan and, you know, satanic and things like that. And I remember being at a youth group meeting and they were explaining to us why it was, and they said, oh, these objects that you play with can actually come alive. And I'm not kidding, they actually Told us that at a youth group meeting."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4689.92,"end":4690.48,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4691.92,"end":4715.53,"speaker":"Brett","text":"But luckily, my parents. We were all sitting there. My parents were like, what? No, I don't think so. But, yeah, so I just, I, you know, I find it interesting because, like I said, you see this stuff and popular culture and it's so sensationalized that people don't think about it, like, oh, you know, nothing's gonna come alive in the middle of the night with dolls and things like that attacking."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4716.01,"end":4717.21,"speaker":"Fr Andrew Stephen Damick","text":"It's like Toy Story."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4718.17,"end":4725.69,"speaker":"Brett","text":"Yeah, yeah, well, Toy Story or puppet mask or anything crazy like that, you know, like. Oh, from Toy Story to Puppet Master."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4725.69,"end":4726.73,"speaker":"Fr Stephen De Young","text":"That's fun."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4727.13,"end":4748.14,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, you know, I mean, I. If. If I ever see. See. So, like, you sometimes see the little, you know, the, The. The. The blue and white eye amulets, Right. I mean, there's a really, really common. The mati. And then. And then especially amongst. Often with some Middle Eastern people have like a little blue bead or a little blue stone or whatever."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4748.14,"end":4748.58,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4748.58,"end":4754.42,"speaker":"Fr Andrew Stephen Damick","text":"And if I ever. I'll be honest, if any. If anyone brought one of those things, like, for a baptism, because you mentioned."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4754.42,"end":4754.54,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4754.54,"end":4755.86,"speaker":"Fr Andrew Stephen Damick","text":"They'll be brought to baptisms."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4755.86,"end":4756.42,"speaker":"Brett","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4757.17,"end":4763.17,"speaker":"Fr Andrew Stephen Damick","text":"If anyone brought one of those things to a baptism and they wanted, you know, that to be put on the child after baptism, I said, absolutely not."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4763.57,"end":4763.93,"speaker":"Fr Stephen De Young","text":"You."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4763.93,"end":4771.17,"speaker":"Fr Andrew Stephen Damick","text":"No, you may not. That is a cross. You might put an icon there. That's okay. But none of that. None of that amulet stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4771.73,"end":4775.33,"speaker":"Brett","text":"Oh, definitely. Yeah, I've seen that happen. Thank you so much."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4775.57,"end":4781.65,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. Thank you very much for calling, Sarah. Okay, well, we have one more caller that we're going to take right now, and that is Brett."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4781.81,"end":4790.38,"speaker":"Fr Stephen De Young","text":"I don't know. Now. Now that she brought up Puppet Master, I think we may just want to turn the rest of the episode into a meditation on the. The film works of Charles Band."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4793.1,"end":4796.3,"speaker":"Fr Andrew Stephen Damick","text":"It's not this podcast because we can."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4796.38,"end":4799.58,"speaker":"Fr Stephen De Young","text":"Segue very easily from puppet master to demonic toys."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4799.98,"end":4803.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that would be a monologue. I mean, it would be even. Yeah, it would be a monologue on your part."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4803.9,"end":4805.66,"speaker":"Fr Stephen De Young","text":"Doll man versus the demonic toys."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4805.74,"end":4811.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. No, no, we have Brett. Brett is waiting for us on. On the other line, so. Brett, are you there?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4813.84,"end":4815.04,"speaker":"Brett","text":"Yes, Fathers, I'm here."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4815.36,"end":4816.32,"speaker":"Fr Andrew Stephen Damick","text":"Christ is risen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4816.96,"end":4823.68,"speaker":"Fr Stephen De Young","text":"Did you remember your question? No, Father. Yeah, verily, he truly is risen indeed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4827.6,"end":4828.44,"speaker":"Fr Andrew Stephen Damick","text":"That'll cover it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4828.44,"end":4833.12,"speaker":"Fr Stephen De Young","text":"That'll about COVID it, I promise. Father Stephen, this question is not about furries."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4833.68,"end":4837.81,"speaker":"Brett","text":"Instead, my question is about how much."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4837.81,"end":4850.33,"speaker":"Fr Stephen De Young","text":"Do we need to worry about curses in today's aspect, especially particularly from. I Suppose a neo pagan mindset. I know a lot of popular idea."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4850.57,"end":4853.41,"speaker":"Brett","text":"Of neo paganism is to avoid cursing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4853.41,"end":4855.73,"speaker":"Fr Stephen De Young","text":"People, but you can't help but think."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4855.73,"end":4858.57,"speaker":"Brett","text":"Of the popular idea of the edgy."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4858.57,"end":4875.3,"speaker":"Fr Stephen De Young","text":"Goth witch teenager in the popular movie who makes a voodoo doll, puts a curse on the, you know, main character or the, the, you know, forgive my use of the slur, but, you know."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4875.3,"end":4877.38,"speaker":"Brett","text":"Gypsy woman who, you know, you bump."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4877.38,"end":4882.26,"speaker":"Fr Stephen De Young","text":"Into at the supermarket and, you know, she gives you a curse. How much do we need to worry."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4882.26,"end":4883.66,"speaker":"Brett","text":"About that and how do we protect."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4883.66,"end":4885.14,"speaker":"Fr Stephen De Young","text":"About it if we do need to worry about it?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4885.86,"end":4887.94,"speaker":"Fr Andrew Stephen Damick","text":"I'm gonna put that directly to you, Father Stephen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4888.51,"end":4903.63,"speaker":"Fr Stephen De Young","text":"Okay. He doesn't want anyone to drag him to hell, I guess, is what he's saying, or for him to get thinner. So, man, lots of horror movies this half. Who knew?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4904.03,"end":4915.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you did bring up ugaritic death curses, so that's true. We only started getting the calls after you said that. Just putting that out there."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4915.2,"end":4919.28,"speaker":"Fr Stephen De Young","text":"That's what the people want. I'm giving the people what they want. They want ugaritic death because they're just."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4919.28,"end":4922.2,"speaker":"Fr Andrew Stephen Damick","text":"Big balls of desire for ugaritic death."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":4924.44,"end":5070.16,"speaker":"Fr Stephen De Young","text":"So. Yeah, well, the answer is really that we, as Christians, we don't have to worry that much. It's not because that stuff's all hokum, right. And we're not superstitious. I mean, maybe a little stitches, but not superstitious. It's, it's, it's not that. Because that stuff is real. Now, whether any given modern human is doing the real thing or doing something goofy out of a book they got at Barnes and Noble, right, is beside the point. Just in the sense that we, we don't have to worry about it as Christians. Right? Yeah, there is a real thing. A lot of the sort of modern stuff outside of horror movies, it's not the real thing. It's kind of goofiness. That doesn't mean it's innocuous to the people who are dabbling in it or participating. But even if it is the real thing as Christians. And this is several of the psalms. I know we've talked about a couple of them on the show before, but several of the psalms specifically are talking about. Well, it's kind of sub rosa a lot. In the English translations, they're talking about particular, like demonic powers of disease or of famine or of death, like Psalm 91 or Psalm 90 in the Greek, and sort of enumerating them and enumerating them in order to say, like, none of them can touch you as long as you're. You're blessed by the Lord in the sense that we're talking about. Yeah, the. It's because we're talking about a state of blessedness and a state of cursedness. Right. If you are in a state of blessedness where you're correctly aligned and orientated toward God and toward your neighbor, then there's nothing you have to worry about from demonic powers. They can take your stuff. Right. Look at Job again. Right. But the stuff isn't the important thing, as we were saying."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5070.71,"end":5070.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5071.83,"end":5103.18,"speaker":"Fr Stephen De Young","text":"They could even take your health, like with Job. They could even theoretically take your earthly life. But again, if you're correctly oriented in these other ways, that isn't something you have to worry about because no one can harm the righteous man. Right. So, yeah, we shouldn't worry about it. You shouldn't get involved in it. Friends don't let friends use witchcraft. Yeah, but does that include bulk movies or. Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5103.18,"end":5181.49,"speaker":"Fr Andrew Stephen Damick","text":"I actually have a little story to tell related to what you just said, Father, so if Brett will, you know, humor me for a second. So there. This is actually a story that my wife tells, and I've heard her tell it a bunch of times, so hopefully she won't be unhappy with me passing it on. So there was one time that she was actually out, I think, with our children somewhere, this is several years ago, and she was somewhere. And. And in public, like at a store or something like that. And this woman approaches her who has kind of an odd look to her, and she turns out to be some kind of fortune teller or psychic kind of person or whatever. And she sort of made an offer to my wife, like, you know, would you like. Blah, blah, blah. I don't remember what it is she offered to her and my wife, you know, if you were. You guys. Father Stephen, you've met my wife, you know that she says whatever is on her mind to say, and she says it very clearly and boldly, you know, 99% of the time. And she turned to this woman and she said, we are orthodox Christians and my husband is a priest. And apparently the woman just sort of recoiled and kind of ran out of the room, which, I mean, just illustrates this, right? Like, you know, in the immortal words of, oh, I'm forgetting the name of the actress, but, you know, when she said to David Bowie, you have no power over me."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5181.89,"end":5182.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5182.45,"end":5187.93,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's. I mean, I can't think of her name. But anyway, another 80s reference."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5187.93,"end":5189.57,"speaker":"Fr Stephen De Young","text":"Are you thinking of Jennifer Connelly?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5189.57,"end":5217.64,"speaker":"Fr Andrew Stephen Damick","text":"Jennifer Connelly, that's right. Jennifer Connelly. At the end of Labyrinth. You have no power over me. But I mean, it's true. It's true. You know, as Christians, we are. We belong to the Lord, you know, and we're being protected by his angels and saints, so it's not a. Not a huge concern. Is that helpful to you, Brett? Did we lose Brett? I think we might have lost Brett. I'm sorry."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5217.64,"end":5219.28,"speaker":"Fr Stephen De Young","text":"Speak to us, Brett. Who did this to you?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5220.24,"end":5221.08,"speaker":"Brett","text":"Thank you, fathers."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5221.08,"end":5222,"speaker":"Fr Stephen De Young","text":"I do appreciate it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5222.72,"end":5231.45,"speaker":"Fr Andrew Stephen Damick","text":"All right, thanks for calling in. Okay, well, moving on. Not with ugaritic death curses, but something slightly else."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5231.85,"end":5233.05,"speaker":"Fr Stephen De Young","text":"But not unrelated."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5233.29,"end":5234.73,"speaker":"Fr Andrew Stephen Damick","text":"Not unrelated. It's all related."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5234.81,"end":5239.69,"speaker":"Fr Stephen De Young","text":"Yeah, it's all related to ugaritic death curses."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5241.53,"end":5251.25,"speaker":"Fr Andrew Stephen Damick","text":"So I don't recommend our T shirt maker make something really. I know we've said ugaritic death curses about 12 times, but I don't recommend you put that on a T shirt. Just putting that on."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5251.25,"end":5254.11,"speaker":"Fr Stephen De Young","text":"Ugaritic death curse would be kind of an awesome band name. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5254.34,"end":5255.3,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that is true."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5255.3,"end":5256.1,"speaker":"Fr Stephen De Young","text":"I have to say."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5256.42,"end":5257.38,"speaker":"Fr Andrew Stephen Damick","text":"That is true."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5260.02,"end":5298.3,"speaker":"Fr Stephen De Young","text":"So when we're talking about a state of curse, right now, we're going to the. The other side from the state of blessedness. So state of curse, then is this state of alienation, of being out of harmony. Right. Of being out of sync, being broken out of that web of correct relationships. Right. And that could be a human. That could be a thing. Right? Because if we say that when we bless water or a house or whatever, that we're putting it back into that correct web of relationships, right? Then that means it can be out of it. It could be in a state of curse."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5300.86,"end":5301.26,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5304.22,"end":5318.54,"speaker":"Fr Stephen De Young","text":"There are. That's talked about in the Old Testament in particular, but also in the New Testament in. In the ideas of impurity. Right. And impurity is divided into sort of two different types."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5319.18,"end":5323.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this. This is a really, really important distinction, everybody. So."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5325.5,"end":5337.84,"speaker":"Fr Stephen De Young","text":"So, yeah, and this is a big part of what confuses a lot of people, especially about the commandments in the Torah and how they relate to each other, is that there is moral impurity and there is ceremonial impurity."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5338.47,"end":5338.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5339.19,"end":5393.28,"speaker":"Fr Stephen De Young","text":"All right. And those are just categories. Those aren't categories that are internal to the Bible. So don't read too much into the words or anything. It's just a way of categorizing those two things. Right. And so moral impurity obviously has to do with actions. Right. With. With actions that are taken. Ceremonial impurity has to do with a state of uncleanness. Right. That results from something else. So moral impurity would be the result of, say, Murdering a guy. Right. Whereas ceremonial impurity might be from using the restroom. Right, right. Both of those render you unclean, but in different senses. Right. Like in radically different senses."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5393.44,"end":5393.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5395.76,"end":5436.09,"speaker":"Fr Stephen De Young","text":"And both of those have to be sort of taken care of. Those situations have to be taken care of. And both of those are kind of related to a state of curse, though there are differences in degree and that kind of thing that we're going to talk about more now. But this, like I said, this causes a lot of confusion. So we get, you know, it's a question that arises very naturally when you start reading like, Leviticus and it's like, you know, okay, well, these people are unclean because of fornication, and then these people are unclean because of, you know, going to the bathroom or a woman's time of the month or something like this. And those don't seem to be in the same category to me. Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5436.09,"end":5443.12,"speaker":"Fr Andrew Stephen Damick","text":"Like. Like it's not their fault, you know, or they were doing something they necessarily had to do, you know, like. Like somebody's got to touch the dead body. I mean, you. You can't just."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5443.28,"end":5444.24,"speaker":"Fr Stephen De Young","text":"To bury it. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5444.24,"end":5448.88,"speaker":"Fr Andrew Stephen Damick","text":"Leave it there. Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5448.88,"end":5568.59,"speaker":"Fr Stephen De Young","text":"And so here's sort of how this. How this sort of works out. Right. And it's part of our understanding of this state of curse, of the way that it affects the created order. Right. So. So what we're talking about when we're talking about moral impurity is we're talking about something very much like that ugaritic death curse in the sense that you have a human person participating in the actions of spiritual evil, spiritual powers. Right. We've talked about this before where we talked about demonization, sort of becoming partakers, having, as St. Paul says in First Corinthians, Kinonia with demons. So this kind of idea. So what we're not talking about again, when we talk, even though we use the word moral, the way we think about morality now, some people went straight to law again. Right. You did something that's against the rules. Right. That's not what we're talking about. We're talking about something. Something very different. And this is how we've been talking about sin pretty consistently on this show. And this comes out of the way. For example, St. Paul uses sin in the singular to refer to this kind of force out in the world. And the way the fathers talk about the passions, which are called passions because they make you passive. They act upon you and through you, but render. Render you passive. So when, you know, you're seized by anger, Right. The anger has control of you. Right. You're not like, consciously and actively being angry. Right. Lust takes hold of you. Pride. Right. Envy. These are things that take hold of you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5568.75,"end":5570.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're overcome."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5571.47,"end":5608.69,"speaker":"Fr Stephen De Young","text":"Yeah. So. And this is related to another distinction that we've talked about. We talked about last time. We were talking about the divine energies, this distinction in orthodox theology between God's essence and his energies. We talked about how people and things have essences and energies too. But this idea of energies, this idea of enria comes out of is sort of picked up by the Greek fathers from a distinction that's made going back to at least Aristotle."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5608.93,"end":5609.49,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5610.13,"end":5697.05,"speaker":"Fr Stephen De Young","text":"Where Aristotle in metaphysics Theta talks about this distinction between dynamis, which would be a power or a strength. Right. That is proper to a nature. We were talking about this a little bit earlier in this episode. So, you know, and that's different for different types of creatures. Right. So the nature of a raccoon, you know, a trash panda, has different powers than a human. Right. And then that is distinguished from inner. Yeah, right. Energy or energies. Which is. Which is the. The thing, the hypostasis. Right, the thing, the person exercising that power. So it's not just the exercise of the power. Right, right, it is. And we talked about. Yeah, right. We talked about this a little bit last time. So it's like we talked about how where we talk about the divine energies, we talk about God's energies. We're not talking about just things God does. Right. But we're talking about God doing things. Right. God loving. Right. Not just God's love, like separate from him, but God himself loving."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5697.37,"end":5697.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5698.89,"end":5743.71,"speaker":"Fr Stephen De Young","text":"And so it's when you are using your human energies, it's you exercising the powers of your human nature. Right. And so all humans have the same nature. Right. We all share human nature. Right. But what distinguishes you as a person from all the other human, you know, seven point whatever billion other human persons in the world today is our particular energy. Where and when and how, at what point in space and time and all those things. We are actually putting those various powers of human nature that we all share into practice."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5743.95,"end":5744.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5745.15,"end":5766.6,"speaker":"Fr Stephen De Young","text":"Actually exercising them. Because humans don't all utilize the same powers. Right, Right. But the dynamics, right. That are the powers of sin are not part of human nature. They're not proper to human nature as God created it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5766.6,"end":5789.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is a really important point. I mean, a lot of the fathers, especially the ascetical fathers, talk especially, particularly when they're talking about the passions. Right. But they specifically say that sin is alien to us. It is not a power of humanity to sin. But we do sin, so why do we. How is it that we are able to do that?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5789.97,"end":5809.09,"speaker":"Fr Stephen De Young","text":"Right. And so the demonic powers, one of the reason they're called demonic powers. Right. Is that when we sin, we're exercising, we're energizing. Right. We're actualizing a power that's foreign to our human nature."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5809.57,"end":5815.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's. It's a power. Exactly. When you sin, you're using demon power."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5816.5,"end":5818.1,"speaker":"Fr Stephen De Young","text":"Yes. And so scary."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5818.18,"end":5827.78,"speaker":"Fr Andrew Stephen Damick","text":"Scary. But, but, but I mean, it, it makes so much clear, you know, when you sin, you're using demon power because it's not a human power. God didn't created us, create us to sin."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5828.66,"end":5836.5,"speaker":"Fr Stephen De Young","text":"You know, in First John, St. John talks about Christ purifying the world from sin as destroying the works of the devil."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5837.44,"end":5837.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5839.28,"end":5842.64,"speaker":"Fr Stephen De Young","text":"Right. That he works through humans."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5842.88,"end":5843.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5843.6,"end":5873.05,"speaker":"Fr Stephen De Young","text":"As he further clarifies in First John when he talks about Cain, who we're going to talk more about a little bit here. Right. Cain does the works of the evil one. Right. And that makes him the son of the evil one, as we've talked about before, the son being the image of the, The Father. Right. But so because this sin, this simple demonic power is foreign to our, Our human nature is destructive and corrupting to our human nature."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5873.53,"end":5876.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's channeling something we're not supposed to channel."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5877.29,"end":5909.94,"speaker":"Fr Stephen De Young","text":"Yeah. And when we talk about curse as a noun, curse, as if it were stuff. Right. Stuff that needs to be purified out. Right. Talking about curse ontologically. Right. Like you could locate it in a place or on a person. We're pointing at that corruption, we're pointing at that rot or decay. Right. So this is why you'll see some of the fathers saying that sin doesn't exist. It doesn't have an ontological existence because it's just a corruption of something that exists."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5910.42,"end":5910.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5911.3,"end":5939.37,"speaker":"Fr Stephen De Young","text":"Right. So if you see an animal, a dead animal that's decaying. Right. The decay is not something that exists in and of itself that has been added to the animal. Right, right. Rather, it is just the corruption. The corruption and the falling apart of the animal. Right. Is the lack, the lack of life, the lack of, of wholeness, the lack of, of ability of the animal."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5940.06,"end":5940.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5940.34,"end":5950.78,"speaker":"Fr Stephen De Young","text":"And so this is why it's destructive to your human nature and destructive to. Through that web of relationships and destroying that web of relationships. It's also destructive to the creation around us."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5951.26,"end":5952.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which includes other people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5953.58,"end":5954.78,"speaker":"Fr Stephen De Young","text":"Which includes other people."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5955.02,"end":5955.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5955.98,"end":5988.93,"speaker":"Fr Stephen De Young","text":"And this, by the way, is why repentance from an orthodox perspective is not just saying sorry and getting the imprimatur. Okay, I won't hold, hold that one against you on the day of judgment. Right. It's not about guilt or innocence of a, of a crime or getting a pass on a crime. Real repentance is about, is restorative. Yeah, right. It's about trying to repair what we've broken and what we've destroyed and what we've corrupted and heal what we've damaged in ourselves and others."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":5989.17,"end":6005.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, I was gonna say and, and that's why repentance affects other people and why we even speak of repenting on behalf of other people is that that repair of the, of the web of relationships and bringing things into right order is communal because we're connected. We just are."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6005.99,"end":6015.91,"speaker":"Fr Stephen De Young","text":"Yeah, that and, yeah. And reconciliation is key to the whole thing of blessedness. Taking something from cursed to blessed is going from alienation to reconciliation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6015.99,"end":6080.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then, and then I was to say the, the. And so here's the beautiful thing. Here's the flip side of all that nasty stuff we just mentioned. When human beings cooperate with God, right? When we synergize with God, then we are making use of divine energies, right. They don't belong to us. They're not natural to humanity. But because they're from God, they heal and they bring us into right order. And it's why the saints can do things that are not natural to humans, because they're making use of God's energies because they're cooperating with him. Right. So there's a flip side. So this is part of what we mean when we talk about theoses and then, you know, demonization or whatever, you know, because it's again, even though they're not equal in opposite actions, right. To cooperate with the energies of God is not simply the opposite opposite of cooperating with the energies of demons. We can at least conceptually think of them as, as opposites."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6080.49,"end":6080.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6082.01,"end":6086.25,"speaker":"Fr Andrew Stephen Damick","text":"Even if existentially they're not simply the same thing, plus or minus."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6087.13,"end":6088.57,"speaker":"Fr Stephen De Young","text":"They're not equal opposites."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6088.57,"end":6119.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. They're not equal opposites. They are opposites, but they're not equal opposites. Yeah. And it's I think understanding this idea of co energizing, synergizing, cooperating is an understanding that we, that's not just something we can do with God, it's something that we can do with the dark powers as well. I think that that makes clear a lot of what it says in scripture about, you know, participating in, in God's works, participating in the works of the devil and what that does to you. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6121.72,"end":6128.84,"speaker":"Fr Stephen De Young","text":"Right. And. And we're seeing, we're able to do that with demons because they're our fellow creatures."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6129.8,"end":6130.04,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6130.84,"end":6146.2,"speaker":"Fr Stephen De Young","text":"Right. They are created beings that have become. That have become corrupted. Right. Whereas being able, we've been made partakers of the divine nature and are able to cooperate with the divine energies because of Christ's incarnation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6147.08,"end":6147.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6147.44,"end":6162.36,"speaker":"Fr Stephen De Young","text":"Because he becomes a creature in the divine person of Jesus Christ, taking on our shared human nature. He has united our shared human nature to God and made that possible."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6163.16,"end":6163.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6163.6,"end":6199.97,"speaker":"Fr Stephen De Young","text":"Opened up that possibility for us, which previously did not exist. And this is why in orthodox theology, the incarnation is so critically important to salvation, even more so than. Than some of the elements that are more focused on in the West. So all that is about what we called moral impurity. Right. And the state, that state of curse that's brought about by that. So then how is ceremonial impurity related to that? Right. It's not the same thing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6200.45,"end":6204.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. Why is it that some of the same words are used, you know?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6204.93,"end":6241.46,"speaker":"Fr Stephen De Young","text":"Right. So what happens, though, is in the world we live in, we become exposed. Even if we're living in a state of blessedness, we become exposed to the products of sin and death. Right. This is why touching a corpse makes you unclean. This is why you don't eat an animal that you find dead. This is why, like, bleeding makes you ceremonial unclean. Right. These are things that wouldn't happen or wouldn't exist if it weren't for the presence of sin and death in the world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6241.94,"end":6262.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So the one thing that occurs to me is that I don't. That is not obviously in this category that does make you unclean is if you touch one of the scrolls of the Torah, that makes you ritually, ceremonially unclean. What's. What's going on there? Why is that? You know, the Torah is not the product of sin and death in the world."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6263.87,"end":6267.15,"speaker":"Fr Stephen De Young","text":"Right? Right. Only in a very roundabout way."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6267.55,"end":6269.43,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Right, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6269.43,"end":6341.94,"speaker":"Fr Stephen De Young","text":"It's true. But, yeah, that's not why. And this is true with other holy things too. Right. If you get the sacrificial blood on your sandal, Right. As a, as a priest, even though it's sacrificial blood that is holy, when it hits your shoe, your shoe now has to go get burnt because it's unclean. And, and the reason for that is that when something is by its nature holy. Right. So once that blood becomes sacrificial blood. Right. Or once that Particular piece of vellum or parchment becomes a Torah scroll. Right. It is now by nature holy. And so if you do something that would defile that holy thing, it kind of rebounds on you is the idea. Right. So I can't by my will, right. Like defile the sacrificial blood now that it's sacrificial blood. And so anything I do that would defile it, like spilling it on my shoe, actually defiles my shoe and then by extension, me."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6342.42,"end":6343.14,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6343.7,"end":6373.38,"speaker":"Fr Stephen De Young","text":"Right. And so when I with my filthy sinner hands touch the Torah scroll, right. Or the gospel book or whatever, I can't corrupt it. Right. I mean, you could destroy it. So it's no longer a Torah scroll or no longer a gospel book, or no longer an icon, or no longer whatever it was. Right, right, right. But barring that right, it will remain holy and I will be the one defiled by my defiling activity."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6373.78,"end":6377.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So okay, well, that makes sense then."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6378.5,"end":6382.02,"speaker":"Fr Stephen De Young","text":"So that's. That's how. That's how that bit works."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6382.26,"end":6382.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6383.62,"end":6473.54,"speaker":"Fr Stephen De Young","text":"So in. In the scriptures as a whole, not just the Old Testament, because he comes up more than people at first may realize in the New Testament. I already mentioned once, in First John, we have sort of an archetypal person when it comes to curse. Right. There's an archetypal curse in one in. In scripture, and that's King, not Adam. We talked before about there being sort of multiple quote unquote fall events, even though that's all gotten balled up in the west into. Into Adam, that it's actually Cain. And while most people listening to this probably were at some kind of Pasca service at the end of last week maybe, and saw the icon of the Anastasis and saw Adam getting pulled up out of Hades, you notice you don't see King getting pulled out of Hades. These two are different cases. And so we see kind of that distinction made in the text of Scripture itself in Genesis 3 and Genesis 4, when we compare them, Adam, when he is cursed, he's told cursed is the ground because of you. Right, Right. So because of what he had done, he's now sort of alienated from the ground partially right now. It's good. The ground's going to bring forth thorns and thistles instead of food sometimes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6473.88,"end":6476.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's much, much harder for him to do agriculture now."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6477.32,"end":6561.96,"speaker":"Fr Stephen De Young","text":"Right. So there's this level of disharmony now between him and Creation and him and his wife and him and God. Right. That there was not before. But when we get to Cain after he Kills Abel, he is cursed from the ground, where he is sort of totally alienated from the created order and from his family and from everyone else. Right? Meaning he's told the ground will not bring forth food for him. Like agriculture becomes impossible. The sky is now like iron and the ground like bronze, as far as Cain is concerned, because of how corrupt he has become. And so it's not a coincidence that he has to find a way to live. And so he goes and he founds a city, right? And from that city he founds, grows. As we go across his genealogy and see his descendants, come civilization, comes technology. Right? And he can't live in harmony with creation. And so this is how he has to do it. He's going to have to. He can't grow food, so he's going to have to take food or he's going to have to trade for food or what have you. Right. And so his alienation produces this mode of life that then further alienates his descendants."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6562.68,"end":6563.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6564.12,"end":6638.7,"speaker":"Fr Stephen De Young","text":"And that technology includes not only what we would call technology, right, Things like metallurgy and that kind of thing, but also what you could call spiritual technology. All the way up through Josephus. Cain is always identified as the first heretic. Right. He teaches his descendants to follow his ways. He's sort of a founder, a civilization founder figure. And you find things like sorcery and witchcraft and seduction and those kind of things being created by his. His descendants, which is a sort of technology to be used just for sin, basically, is the idea for the participation in these things. And so this gets to a theme that we've talked about before, of this idea of the city versus the extended family that you see like with Abraham and Lot, when Lot goes down to Sodom and Abraham lives nomadically. Right. Where rather than like with the extended family or the village kind of model we've talked about, or the blessed community we were talking about in the first half, you now have the city as sort of the community of the alienated. Like everyone is alienated, and they've all gathered there in that place."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6639.42,"end":6659.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, think about the level of that now. I mean, that's. Even if that was true, you know, with Cain, it's amazing, you know, the sort of conglomeration of people that exists now, and yet they're even more isolated from each other because, frankly, because of the way that we use technology."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6660.34,"end":6663.62,"speaker":"Fr Stephen De Young","text":"Yeah. From each other and from God and from the creation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6663.7,"end":6664.02,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6664.02,"end":6678.26,"speaker":"Fr Stephen De Young","text":"The created world. Right. It's just this extended progress of further and further alienation and. And Atomization. And that state is what it means to be accursed."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6680.74,"end":6681.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6682.7,"end":6683.1,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6683.82,"end":6689.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. Well, on that depressing note, we're gonna take another short break and we'll be right back."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6689.58,"end":6690.7,"speaker":"Fr Stephen De Young","text":"Stay with us, folks."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6692.3,"end":6704.3,"speaker":"Announcer","text":"Damek and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6704.62,"end":6744.08,"speaker":"Announcer","text":"That's 8-55-Araid Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city, immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way. They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6744.4,"end":6752.64,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6752.64,"end":6756.8,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a tovarish you could count on."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6757.52,"end":6772.17,"speaker":"Fr Stephen De Young","text":"No one knew her son. They never bothered to look into her eyes. It surprised me that most of the church folks at St. Alexander the Whirling Dervish Parish didn't even know her name. It wasn't anything they thought about."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6772.89,"end":6782.25,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com again, that is store.ancientfaith.com."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6783.69,"end":6799.82,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6802.46,"end":6808.14,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. See, that commercial was not for one of my books. Father, does that make you happy?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6808.7,"end":6810.3,"speaker":"Fr Stephen De Young","text":"It does. We're sharing the love."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6810.62,"end":6822.47,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Yeah, it's a lovely set of short stories, actually. Um, it's. It's great. It's good stuff. Good stuff. We endorse it. See what I did there?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6822.47,"end":6823.51,"speaker":"Fr Stephen De Young","text":"We bless it, even."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6823.51,"end":6824.35,"speaker":"Fr Andrew Stephen Damick","text":"We. Exactly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6824.35,"end":6824.59,"speaker":"Fr Stephen De Young","text":"We."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6824.59,"end":6859.08,"speaker":"Fr Andrew Stephen Damick","text":"We bless the work of Father Steven Signiari. So. All right. Well, welcome back. We talked about blessings in our first half and curses and cursing in our second half especially. And now in the third half of the show because once again, this is a show and a half. We're going to talk about what it means to become a curse. Everybody remember that language from Scripture when it talks about our Lord Jesus Christ becoming a curse for us. So what does that mean in light of everything else that we just said?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6862.12,"end":6863.24,"speaker":"Fr Stephen De Young","text":"Well, it's A long story."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6864.76,"end":6866.04,"speaker":"Fr Andrew Stephen Damick","text":"So settle in, everybody."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6866.12,"end":6866.6,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6869.33,"end":6870.69,"speaker":"Fr Andrew Stephen Damick","text":"Get yourself another cup of something."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6871.57,"end":6878.93,"speaker":"Fr Stephen De Young","text":"We always give listeners their value for the dollar, at least in terms of quantity, if not quality."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6881.73,"end":6882.13,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6884.13,"end":6895.62,"speaker":"Fr Stephen De Young","text":"Yeah, so we're going to be talking now about the atonement again, as is my want in particular, but is as we've done on the show before. But coming at it from sort of."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6895.62,"end":6903.98,"speaker":"Fr Andrew Stephen Damick","text":"This perspective, I was suddenly reminded, you know, that meme we've seen in our Facebook group that says, I am once again asking to read Father Stephen's dissertation."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6904.7,"end":6907.5,"speaker":"Fr Stephen De Young","text":"Yes. Which is now available on ProQuest."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6908.14,"end":6909.14,"speaker":"Fr Andrew Stephen Damick","text":"So there you are, everybody."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6909.14,"end":6921.09,"speaker":"Fr Stephen De Young","text":"Access to the ProQuest dissertation database. You can find it on there now. And I think it is literally because the Amridge University Library was getting requests for people and they got sick of it. So they."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6924.13,"end":6925.17,"speaker":"Fr Andrew Stephen Damick","text":"Good job, everybody."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":6925.65,"end":7014.48,"speaker":"Fr Stephen De Young","text":"Shout out to Taron Sheridan, librarian there for. For doing that for everybody. So I don't know that he listens, but. So in terms of atonement and why we're coming back there, in understanding the death of Christ and the way that curse language is used there, we have to approach atonement and ask the question, what is the problem that's being dealt with here? So a lot of our friends in the west will say that the problem that's being dealt with here is God's justice, Right. Requires him to punish sin, or God's wrath against sin has to be appeased, or some variation of that. There's all kinds of nuances on that stuff. But I would submit that if we're approaching this from the perspective of especially the Old Testament and the Torah, what is the problem that is set up by the Hebrew Bible, by the Old Testament that is going to be solved by Christ in the New Testament? That problem comes down to curse, right? To curse and impurity in the two senses we talked about. Right. But with obviously the. The what we called moral impurity being the paradigmatic one, because if you take care of that, taking care of the rest of it is the ceremonial parts. Relatively easy, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7014.64,"end":7015.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7015.2,"end":7018.64,"speaker":"Fr Stephen De Young","text":"Because it results. The latter results from the former. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7018.8,"end":7019.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7019.36,"end":7055.66,"speaker":"Fr Stephen De Young","text":"So the state of curse, the state of corruption within the whole created order has to be dealt with. And so we see in the Torah the, The. The covenant at Sinai. Right? The covenant with Moses. This entire system of sacrifice of the day of atonement, of all these things is set up to manage curse, to manage this curse that infects and this rot that comes into this is why mildew and stuff are used as sort of object lessons for it, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7056.86,"end":7084.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's one of those things. It's like, yeah, there's commandments in the Torah for dealing with mildew and destroying walls that have been infected with mold. And I was reading that one time, I was like, what is this about? Why does God care about. I mean, I understand that God cares about everything, but it seems like a weird thing to kind of point out. But as you said, it's about the sort of infection and corruption and, and all that kind of leaven."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7084.31,"end":7118.15,"speaker":"Fr Stephen De Young","text":"Right. How it gets into everything and. Right, yeah. Active yeast cultures. So, but so this, this keeps coming up, right? You. You keep offering the sacrifices, but people keep committing sin. Right. And every year, then on top of that, you have to do the Day of Atonement. Right? And you're just constantly managing the situation so that God won't have to leave or God won't break out, his holiness won't break out and destroy the people in the camp or in the nation. Right. That's what ends up happening. Of course."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7118.63,"end":7121.67,"speaker":"Fr Andrew Stephen Damick","text":"It's like trying to keep a house clean when you've got small children living in it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7122.39,"end":7123.03,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7127.03,"end":7133.27,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. I'm reaching out to a huge segment of our listenership. They're like, yes, that's what it's like."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7136.08,"end":7144.64,"speaker":"Fr Stephen De Young","text":"So, yeah, but having. Having curse properly managed is not the same as being in a state of blessedness."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7145.12,"end":7146.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7146.24,"end":7155.36,"speaker":"Fr Stephen De Young","text":"It's not the same as participating in the divine life. Those aren't the same things. Right. It's like managing a chronic illness. Having it well managed is not the same as being healthy."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7155.76,"end":7158,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7158.56,"end":7221.74,"speaker":"Fr Stephen De Young","text":"And so that covenant, as St. Paul and as Hebrews are going to point out again and again, was never really aimed at solving that problem. It was aimed at managing that problem until the solution came. Right? So when we look at the Day of Atonement ritual itself, you've got the two goats, right? And the first goat, which is identified as the goat for Azazel. Right. That goat becomes a curse, right. It becomes a cursed in the sense that that moral uncleanness, that curse, that corruption that comes through the participation with the demonic powers, right? The sinful actions of the people is all put on and in that goat. And that goat carries it away, right? And he carries it back to Azazel where it came from. Right? Back to the demonic powers from which it came originally."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7222.06,"end":7222.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7222.54,"end":7253.08,"speaker":"Fr Stephen De Young","text":"Then the second goat, the goat for Yahweh, the blood, that blood is used to purify the ceremonial uncleanness, the residue, Right. The result of that sin on the physical objects within the Tabernacle, the holy place and the most holy place. Right. All of that is then purified from that sort of ceremonially unclean residue that came from that corruption and curse within the camp."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7253.48,"end":7276.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And let's say, everybody, if you're new to the podcast, and maybe this is one of the first episodes you're listening to, if you're interested in way more about everything we just said about the goats and so forth, there is an episode we did called the Priest Shall Make Atonement, which is all about the day of atonement. And for you longtime listeners, this is indeed the episode where we first started saying Christ is both goats."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7277.28,"end":7277.84,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7278.16,"end":7282.72,"speaker":"Fr Andrew Stephen Damick","text":"So, yes. To sort of hypertext one of our episodes to another."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7285.76,"end":7354.14,"speaker":"Fr Stephen De Young","text":"So I'll use hyperlinks. So this is. This is. Then this curse language is particularly connected to the mode of Christ's death, right? The idea that Christ dies hanging on a tree. Right. That. That Christ is crucified in particular. Right. So all the way back in, in Deuteronomy, where we started Tonight's episode, Deuteronomy 21, verse 23, we're told that cursed is anyone who is hanged on a tree. Right. And then they do this in Joshua with the king of I, they go and hang them on a. On a tree. Right. And so that happened to you, that that brings a curse upon the person, that. That sort of makes them a focus of the curse, right? This was done to the king of AI because he was the king of the city, Right. The head of a giant clan, right. Who. Who was responsible for this sort of corruption, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7354.14,"end":7356.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Hard to get more cursed than that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7357.78,"end":7375.62,"speaker":"Fr Stephen De Young","text":"Right. And so in Galatians 3:13, St. Paul then talks about. Cites this verse, and it's talking about Christ's mode of death, that Christ died in that particular way to take the curse upon himself. Allah, the first goat."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7375.78,"end":7383.22,"speaker":"Fr Andrew Stephen Damick","text":"That goat for Zazo. Right. So the sort of the transport mechanism that takes. Taking out the trash, as it were, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7383.38,"end":7390.42,"speaker":"Fr Stephen De Young","text":"Yes, yes. And then Christ then descends into Hades and returns it to sender, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7390.74,"end":7391.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7394.83,"end":7420.55,"speaker":"Fr Stephen De Young","text":"But also. Right, this is why this idea of curse and the purification of curse and replacing curse with blessedness, right. This idea of reorientation and reconciliation, Right. Also gets brought out when the New Testament talks about the cross of Christ. So John 12:32, after Christ refers to being lifted up the way the serpent was lifted up in the wilderness, right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7420.55,"end":7457.78,"speaker":"Fr Andrew Stephen Damick","text":"He says. He says this, this very famous line, and I, when I am lifted up from the earth, will draw all men to myself. And. And everyone knew that he meant crucifixion, because. Right. Because don't they say. Wait, wait, I thought that. What do you mean? The we. We're told that the Christ, you know, it stays forever. Yeah. You're going to. So they know he's talking about his death, they know he's talking about being crucified. But the result is everybody is going to be drawn into a right relation. They're going to be drawn to a right relationship with Christ. They're not all going to do it, but they're going to be drawn to a right relationship with Christ. Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7457.86,"end":7476.82,"speaker":"Fr Stephen De Young","text":"And he's pointing to in the Book of Numbers, when the Israelites are suffering from the venom of the serpents, Right. Which is killing them. And the way they were purified from that was by looking upward to the image of what was afflicting them."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7479.14,"end":7480.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7480.02,"end":7499.06,"speaker":"Fr Stephen De Young","text":"And so Christ becomes a curse. He becomes the image of what he's of from what he's purifying us. But that's John 12:31. Christ points to that, and then the result of that in verse 32 is this reconciliation, this drawing all men to himself."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7499.39,"end":7499.71,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7499.87,"end":7505.23,"speaker":"Fr Stephen De Young","text":"Right. And St. Paul does the same move in Romans 5, verse 10."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7506.67,"end":7523.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And a little bit more Pauline language, slightly more complicated. So just listen, everybody. For if while we were enemies, we were reconciled to God by the death of his Son, much more now that we are reconciled, shall we be saved by his life."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7526.44,"end":7561.12,"speaker":"Fr Stephen De Young","text":"Right. And so remember that that reconciliation is the same kind of idea St. Paul has been using throughout these early chapters of Romans, of being the one who is justified, the one who is blessed. Right. Reconciled to God, no longer alienated. Right. Reoriented, redirected, this blessed state. Right. That's happened through the death of Christ. And now being reconciled. Right. Salvation and life come. Right. The positive part. Salvation, life come through the blessed state."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7561.2,"end":7570.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now that you're sort of plugged back in like you should be, you can then receive what you should be receiving by virtue of that communion with God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7571.84,"end":7572.24,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7572.48,"end":7572.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7572.88,"end":7633.2,"speaker":"Fr Stephen De Young","text":"And so then that's, you know, goat one. Right, Right. And goat number two. Right. The goat for Yahweh, that blood is taken. And that blood is used then, as we said, to sort of purify away this curse. Right. The curse is wiped out by the blood. And so this is talked about in different ways in Scripture. But, you know, this blood thing is counterintuitive to us. Right. I've said before, I'm glad when I go and bless houses. I don't have to go in there and Throw sheep blood on over the. I think I'd get fewer invitations to bless houses if I did. And I don't think they think their house was particularly pure and clean after I was done either. Definitely wouldn't smell that way. So. But there are several places where this is talked about. One important one is in Hebrews 12, verse 24, which is. Yeah. Which is talking about actually the date blood on the day of atonement."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7633.75,"end":7649.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So then it continues on a previous sentence, but this is the next clause. To Jesus, the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7653.03,"end":7672.2,"speaker":"Fr Stephen De Young","text":"And Abel's blood shed by Cain is there in the ground, crying out for justice. Right, right. Crying out for the, the, the restoration. And so his blood being there in the ground and not in his body, and him being murdered is an emblem of the curse. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7672.2,"end":7672.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7672.56,"end":7676.12,"speaker":"Fr Stephen De Young","text":"Blood in the ground is the ground is not the way it should be."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7676.28,"end":7709.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's, and there's, there's some weird icons of this. Right? There's, there's these weird icons where you see, I think it's where, where Cain is speaking to God. Be. You know, after this. And you see what looks like a little man, a little naked man on the ground who is all red with his hands lifted up. And that's Abel's blood calling out to God from, From the ground for justice. So that's sort of the way that, that's sort of depicted iconographically. It's very strange. It's very, very strange. But it does exist in some icons."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7711.02,"end":7747.39,"speaker":"Fr Stephen De Young","text":"Yes. So and the parallel then is that Abel's blood is sort of the emblem of the curse. Right. Of what is wrong. Whereas Christ's blood purifies and restores and deals with the curse. Right. Therefore being better. Right. And so as we talked about in the Priest Shall Make Atonement episode aforementioned, the. The killing and exsanguination of goat number two are not ritualized."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7747.71,"end":7748.03,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7748.03,"end":7776.13,"speaker":"Fr Stephen De Young","text":"We're not told how they killed, how the blood was extracted exactly, just that it was done. And that means when something isn't ritualized, that means it's not important to the meaning of the ritual. Right. So what's important is what is done with the blood. Right. It's about the blood. In order to get the blood of the animal, you have to kill it and you have to remove the blood, drain the blood. But those are non ritualized, just sort of precursors. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7776.13,"end":7779.65,"speaker":"Fr Andrew Stephen Damick","text":"So do that. There's not specific prayers that go with It. Or."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7780.37,"end":7798.84,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right. And so the very brief version, the very short version of how this works is that we're told several places in the Torah that the blood of a person or an animal is their life."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7799.64,"end":7800.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7800.76,"end":7827.82,"speaker":"Fr Stephen De Young","text":"And we. So it's life stuff. And we just talked about curse, how curses, corruption and death stuff. Right. So you use life stuff to get rid of death stuff to purify from. From death stuff. And as it talks about in Hebrews, it compares, like the blood of bulls and goats to the blood of Christ. Right. Christ being God, his life is eternal."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7828.22,"end":7828.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7828.66,"end":7830.3,"speaker":"Fr Stephen De Young","text":"It's the life of God himself."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7831.5,"end":7832.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7832.02,"end":7832.46,"speaker":"Fr Stephen De Young","text":"Which is."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7833.5,"end":7841.46,"speaker":"Fr Andrew Stephen Damick","text":"Which has a much bigger effect. Not just bigger, a very different effect than simply with animals, the blood of an animal."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7841.46,"end":7867.36,"speaker":"Fr Stephen De Young","text":"Right. So that there's no comparison. Right, yeah, right, right. And so Christ's blood is therefore his death, and that his blood are able to do this once and for all, solve the problem, not just continue. Continue managing it. But this identification of blood is life is also, of course, why. And I think we've talked about this before on the show, too. There are all of these strict prohibitions against the drinking of blood."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7868,"end":7868.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7868.97,"end":7911.32,"speaker":"Fr Stephen De Young","text":"And the eating of animals with the blood still in them in the Old Testament and continued in the New Testament. Right. It's like sexual immorality, idolatry, and eating and drinking blood that the Gentile Christians are not allowed to do. Right. And so the reason for that is that you are making very direct and very clear and acting out life feeding on life. Right. Life feeding on life. And the Scriptures are putting forward another paradigm which is life destroying death."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7912.6,"end":7913,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7914.12,"end":7917.08,"speaker":"Fr Stephen De Young","text":"Which is pointing us to Christ, whose life destroys death."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":7917.4,"end":8006.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why the Eucharist in which we drink the blood of Christ does not violate this prohibition against the drinking of blood, because it's not life feeding on life, it's life destroying death. We are the ones who are deathly, and it's Christ's life destroying death in us. It's not us feeding ourselves with the blood of an animal. Right. So you have to understand this a little bit more deeply. And you can't just say we're not supposed to drink blood. You know, how can you have the Eucharist again? Remember, the Lord himself gives it. He says, this is my blood. Right. So we have to try to understand why he would say that and that he's not violating the Torah. He's actually revealing what the Torah was kind of always about, that it was always pointing ultimately to this, you know, that the Eucharist is, among other Things, a kind of. I don't know if inversion or subversion or reversal. I'm not sure which word we should use, but it's not the same thing, because as you said, it's Christ's life is. Is in that blood, which is a different kind of life than. Than created life, God's life. It's God's own life. Right, right, exactly. Exactly. And it's why, you know, you don't eat and drink the sacrifices of demons, because then you're feeding on demons and they destroy you."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8006.3,"end":8008.94,"speaker":"Fr Stephen De Young","text":"You're entering into kinonia with demons."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8009.02,"end":8027.98,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. I mean, that's literally the. Yeah, literally the word that St. Paul uses. I don't want you to have kinonia with demons. You know, you only have that with God. And we do that in Christ, and we do that, you know, in this life most intensely in the Eucharist. So. Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8030.46,"end":8039.93,"speaker":"Fr Stephen De Young","text":"So penultimately, by way of summary, we wanted to take a quick stroll through Psalm 1."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8040.25,"end":8049.77,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Which, as we mentioned earlier, starts out with the word, at least in the Greek psalms. Makarios. Makarios, anir, blessed is the man."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8050.57,"end":8058.82,"speaker":"Fr Stephen De Young","text":"Yeah. And so this will. I think we'll see here, summarized a lot of the things that we've been talking about tonight."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8058.82,"end":8064.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, pretty cool. Okay, we're gonna take. We're gonna take this verse by verse. So we're gonna break it down."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8064.34,"end":8066.58,"speaker":"Fr Stephen De Young","text":"Yo, straight out. J. Vernon McGinnis."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8068.74,"end":8071.06,"speaker":"Fr Andrew Stephen Damick","text":"It only took him five years to get through the Bible."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8072.66,"end":8075.94,"speaker":"Fr Stephen De Young","text":"I may finish by the end of this calendar year. It is not impossible."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8076.18,"end":8076.58,"speaker":"Fr Andrew Stephen Damick","text":"Really?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8076.58,"end":8078.7,"speaker":"Fr Stephen De Young","text":"12 and a half. 12 and a half, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8078.7,"end":8089.54,"speaker":"Fr Andrew Stephen Damick","text":"And then you'll loop around. You know, all these people are going to be ready for. For. Of course. Yeah. If you finish it by the end of this calendar year, it's going to be, what, next June or July? Before the podcast will."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8089.7,"end":8092.82,"speaker":"Fr Stephen De Young","text":"Probably before it actually. Yeah, before it even. Yeah, yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8093.06,"end":8133.99,"speaker":"Fr Andrew Stephen Damick","text":"Just tantalizing. Just be patient, people. Be patient. So, okay, Psalm 1, verse 1. Blessed is the man who walks not in the counsel of the wicked, nor stands in the way of sinners, nor sits in the seat of scoffers. So we've talked about that word, blessed a lot. Right? That it's this. And of course, in this case, it's not Evloitos, it's Makarios in the Greek, that. That blissfulness, life of the blissfulness of the gods. Right. You know, so. So we've covered blessedness. So, I mean, what about the rest of this verse? Like, how does that fit into this?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8134.96,"end":8139.8,"speaker":"Fr Stephen De Young","text":"Well, you know, there's the emphasis on walking, which means this is a way of life. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8139.8,"end":8140.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8140.04,"end":8143.68,"speaker":"Fr Stephen De Young","text":"This is not. If you do this, God will give you a blessing."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8144.16,"end":8148.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not about accomplished deeds. It's about way of living."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8149.04,"end":8154.2,"speaker":"Fr Stephen De Young","text":"Right. The person who lives in this way will be in this state of blessedness. Right. That."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8154.2,"end":8154.88,"speaker":"Fr Andrew Stephen Damick","text":"That will be."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8155.92,"end":8192.22,"speaker":"Fr Stephen De Young","text":"And you see that in this case, the state of curse, just like the state of blessedness is sort of communal. Right. Because it's about sharing in the council of the wicked, the way of sinners, the seed of scoffers. Right. This is about having kinonia, about having sort of communion with the wicked. Right. Which is what the. The blessed man does not do. He is therefore sort of correctly oriented as opposed to these others who are not. Right? Yeah. So that's verse one."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8192.38,"end":8209.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, so verse two. But. So this is in contrast. But his delight is in the law of the Lord, and on his law he meditates day and night. So law there. Right? That's the Torah. That's the commandments of God."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8209.9,"end":8211.82,"speaker":"Fr Stephen De Young","text":"Hebrew. It's literally the word Torah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8212.14,"end":8219.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So his delight is on the Torah of the Lord, and on his Torah, he meditates day and night. So basically he has to be a biblical scholar, huh?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8220.23,"end":8221.67,"speaker":"Fr Stephen De Young","text":"Yes, that's what it's saying."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8221.75,"end":8224.31,"speaker":"Fr Andrew Stephen Damick","text":"Just throwing that out there. We should all be on some level."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8224.87,"end":8260.32,"speaker":"Fr Stephen De Young","text":"Just the Torah though, right? Super literally. Super literally. Yeah. We have to remember this is one of those things. It's always translated law, even in an Old Testament verse like this. But it's literally the word Torah. Right. Which includes Genesis, which includes all the narrative parts of the Torah. So if. If. If someone wants to make a distinction between the Torah and the law, like they're two different things. You're going to first have to tell me what Hebrew word you're referring to as law and where I would find that. Because here it's talking about the Torah. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8260.32,"end":8260.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8260.6,"end":8263.6,"speaker":"Fr Stephen De Young","text":"Which means teaching, as we've said before. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8263.6,"end":8264.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8264.04,"end":8275.53,"speaker":"Fr Stephen De Young","text":"So rather than sharing this communion with. With the wicked. Right. He focuses on the commandments which have life in them."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8276.09,"end":8276.49,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8277.61,"end":8280.89,"speaker":"Fr Stephen De Young","text":"In the Torah. And this is his. This is his focus."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8281.29,"end":8281.69,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8281.77,"end":8292.33,"speaker":"Fr Stephen De Young","text":"And so he is living his life in his way and acting in a way of good order, which is going to bring forth life. One might even say life and that abundantly."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8293.76,"end":8355.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, I love how the word. I don't know what it is in the Greek or the Hebrew, but the word delight, his delight is in the law of the Lord. Like there's this. It's not, you Know, it's funny, following the following laws, we don't tend to think of it as delightful. It's so delightful to drive the speed limit. It's so. Like, we don't think of it that way. Right? But. But it is described as delight here because it's not just about obeying, you know, things that are in a law book. It's. It's. Yeah, it's this whole blessed, blessed way of life. Okay, so verse three, he is like a tree. So again, this is talking about the man who's blessed, right? He is like a tree planted by streams of water that yields its fruit in its season. And its leaf does not wither in all that he does. He prospers. So, you know, again, this is not. Now, this is not. This is not prosperity gospel. Prosperity. There it is. There it is. Prosperity. God is good all the time."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8356.98,"end":8414.15,"speaker":"Fr Stephen De Young","text":"Notice the chicken and the egg thing here, right? He's like a tree, right? But notice the tree is planted in a particular place, right? So it's not just a question of, wow, he's a really great tree. Because if you put the really great tree in a desert, right. It would not yield its fruit in its season and its leaf would wither. Right? So there is a question of a system of relationships here. Being in a certain orientation, being connected and in harmony with the rest of. Right. The greater order around him so that he yields the fruit and so that again, you have the unwithering leaf, right? This idea of eternal life, right? Ongoing life. Right? And then, so then because of that bringing forth of life, there is this prosperity. Right? But that prosperity is that again, the tree isn't collecting a lot of stuff."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8415.43,"end":8416.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's yielding fruit."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8417.59,"end":8420.07,"speaker":"Fr Stephen De Young","text":"The tree is successfully being a good tree."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8420.31,"end":8420.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8421.27,"end":8430.97,"speaker":"Fr Stephen De Young","text":"Growing tall and strong and producing fruit. Right. Like we talked about with the good chair and the bad chair, right? Like, it's fulfilling. He's fulfilling his purpose for which he was created."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8431.85,"end":8432.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8432.89,"end":8433.25,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8433.25,"end":8474.49,"speaker":"Fr Andrew Stephen Damick","text":"And. And, you know, I mean, thus this, this lights up statements like, you shall know a tree by its fruit. You can know that it's being a good tree because it produces the good fruit. So. Right, yeah. Okay, so verse four, the wicked are not so, but are like chaff that the wind drives away. So this is now talking about the curse, right? This is the cursed way of being. And it's interesting. It's not just that they're like dead stuff or whatever. It's. It's chaff, which is. Which is garbage in its very nature, right? You don't want it at all. It can't be fixed. It's. It's just bad."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8475.05,"end":8490.89,"speaker":"Fr Stephen De Young","text":"And it's been. It's been cut out. Right. It's been cut off from the ground. Right, right. It's been cut off from the fruit it was supposed to bear. It's the garbage part. It's the useless part, but it's been severed from everything and it's dead."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8491.29,"end":8497.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's this alienated and cut off everything threshing going on that makes the chaff blown away in the wind."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8497.53,"end":8502.17,"speaker":"Fr Stephen De Young","text":"Right. And the wind blows and it's gone. Because it's not connected to anything."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8503.93,"end":8561.85,"speaker":"Fr Andrew Stephen Damick","text":"No, it's not substantial. Yeah. Okay, Verse five. We're getting close to wrapping up the psalm here. Therefore the wicked will not stand in the judgment, nor sinners in the congregation of the righteous. So this is interesting because this is talking about that context of the communal life, and it uses a couple of different images. The judgment, the congregation of the righteous. I mean, this is the divine council, right. That comes together, they're assembled, they're presided over by the Lord, and they render judgment. Meaning they put things in order. Right. Because remember, everybody, that's what justice is, things being put in order. They render judgment. It's the congregation of the righteous. These are the people who are in tune with God, who are doing his will, who are being obedient to him. And this verse says that the wicked are not there, that sinners are not there."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8562.57,"end":8583.85,"speaker":"Fr Stephen De Young","text":"Right. They're the blessed community that's blessing and being blessed, that's sharing this participation in this community, this kinonia with each other and with God. Right. And the sinner, the wicked have cut themselves off from that. They have alienated themselves from that."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8584.27,"end":8584.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8584.51,"end":8586.03,"speaker":"Fr Stephen De Young","text":"And not been reconciled."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8588.03,"end":8619.01,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, the final verse, verse six. I think probably some people, as they listen to this, they remember that this is sometimes used as a communion hymn. Right. Blessed is the man. Yeah. And isn't it also used, I think, in a festal great vespers right towards the beginning? Yeah, yeah. Okay, so verse 6. For the Lord knows the way of the righteous, but the way of the wicked will perish. Emphasis there on the way."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8619.01,"end":8662.07,"speaker":"Fr Stephen De Young","text":"Right, right. And so it's the way of being in the world, the way of life, the way of living. Right. The energy, the right of these two groups. Right. I notice it's not two individuals, it's two groups, two communions to two communities. Right. One has one way, the other one has another way. Right. And the. The path away of the righteous. Right. The. The Lord is part of that. That's why he knows it. Right? He is a part of it. Right?"}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8662.07,"end":8665.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That knowledge of experience and communion together."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8667.91,"end":8668.11,"speaker":"Brett","text":"Right."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8668.11,"end":8681.99,"speaker":"Fr Stephen De Young","text":"And so the wicked have cut themselves off from that again. Right. And so it's just. It's curse. It's just corruption. It has no substance. And so it just gets wiped away. Yeah."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":8682.71,"end":9056.18,"speaker":"Fr Andrew Stephen Damick","text":"Cool. All right, well, some closing thoughts. I think we might have mentioned this. I know that you certainly have in other places, Father, but I think we've mentioned this on the podcast before, but I just wanted to underline it, especially in light of this episode about blessing and curses, which is, you know, this last word that we mentioned that has to do with blessing, makarios, which was this description of the blissfulness of. You know, in pagan religion, it's the blissfulness of the gods with their most high God. But it's used in the Bible to refer to this way that the angels and saints are with the Father, Son and Holy Spirit. And this gets used in the Beatitudes, right, where Christ gives this sermon, blessed are the poor in spirit, blessed are the meek. Blessed, you know, and there's a series of blesseds. And again, it's not the word evloitos, which, again, I mean, is related to. It's from Evloyia. Right. That it's this endorsement of the good word. So it's not wrong, Right? That wouldn't be wrong, but it does specifically use makarios, which is this word that refers to this communion of gods with God. Okay. So the Beatitudes get used in a couple of places that I think are important for us to just note. One is in a funeral. So in the orthodox funeral service, traditionally we sing the Beatitudes, and you might wonder why. Why is that being sung or read or however, whatever it is in a particular tradition, why is that there? It's because in the funeral service, what we are doing is commending, endorsing, as it were, to God, this person who has died. And what we're specifically commending them to God for is this blissful divine life with the righteous, this life as lowercase g, gods who serve the one God, the most high God, who is above all gods, King of Kings, Lord of Lords, God of Gods. Right. So it's speaking about handing them over to God, and our prayer is that they be received into that life. Right. So we use the Beatitudes in the funeral service for this purpose. The other place that it shows up, and probably a lot of orthodox Christians may not know this because their tradition doesn't always include it but especially for those who are more. More familiar with the Slavic liturgical tradition. But frankly, you know, if you go to. Even in the Greek liturgical tradition, if you go to a monastery, you'll hear this is the Beatitudes are used in the Antiphons at the beginning of the Divine Liturgy. Right. So, again, it's not a normal part of life if you're at a Greek Orthodox parish or an Antiochian Orthodox parish, some others, you know, normally. But it is included. It is the traditional. One of the traditional hymns that's sung towards the beginning of the liturgy. If you go to a church with a Russian tradition liturgical life, you're going to hear it all the time. You know, the Beatitudes that the Lord speaks. And so why is that in the Divine Liturgy? Why is that there? It's there because the Divine Liturgy, there's a lot of things we could say about it. I'm going to say this thing. The Divine Liturgy is an entrance into and a participation in that blissfulness, that divine happiness that the angels and saints share with the Father, Son and Holy Spirit, that blessed righteous community and communion that they participate in with each other. That's what's going on there. So when we participate in the Divine Liturgy, we are entering into that life. We are entering into. There's a reason that the priest at the beginning says, blessed is the kingdom of the Father, Son and Holy Spirit. It's because we're entering into that kingdom of God as we participate in that. Now, that doesn't mean that all the other services of the church don't also do that if they don't increase, include the Beatitudes. But there's something particularly powerful about the way that the Divine Liturgy does it that's kind of above everything else. And like I said, within the scope of the funeral, we're handing this person over, in a sense, to the eternal Divine Liturgy. That is what life in the Kingdom of God in the age to come is about. Right. And I wanted to point that out because one of our goals with this podcast is to always refer people back to our actual life in the church, you know, because that's where you actually do this stuff. You don't do it by listening to a podcast. As fun as it might be, you do it by participating in the life of the Church, which means especially its liturgical life and everything else that flows out of that. And I think to point out that this blessedness, as we described it, this blessedness is what is being sung about, particularly in those two contexts, but in so many others, as Well, I think that it helps to light up our experience of the liturgical life. That to me is one of the big experiences of all the things that I've learned in the course of doing this podcast is it lights up the liturgical life for me. I see things everywhere that I didn't used to see. It's such a delight, right. And it draws you more deeply in. So that's the stuff that I want to, to walk away with from this particular episode. And I think it's. Again, I'm just astonished at the, at the wonders and the richness and the depth of the knowledge of God that's given to us in his body, the Church. Father Stephen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9059.78,"end":9062.5,"speaker":"Fr Stephen De Young","text":"So insofar as."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9064.99,"end":9065.27,"speaker":"Fr Andrew Stephen Damick","text":"I have."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9065.27,"end":9500.54,"speaker":"Fr Stephen De Young","text":"A part in picking topics for the podcast and I had a part in picking this one, I often pick them based on things I'm currently thinking about. And in this case, part of the reason for our topic tonight is that someone who is not a Christian asked in my presence, semi rhetorically, what does Christianity have to say about alienation, Specifically about sort of the alienation of modern contemporary life? And as a non Christian who's been exposed primarily to and at a distance to certain forms of Western Christianity, the question kind of makes sense in the sense that for a person like this, Christianity seems to be primarily, at least any form of Christianity they would take seriously seems to be focused primarily on salvation aimed at an afterlife. The idea that Christianity is about what must I do to be saved? If I die tonight, where would I be? You know, where would I go? And if you're thinking of that type of Christianity, I don't know what that type of Christianity would have to say to someone who's feeling alienated and alone and cut off in this world, other than, hey, if you do xyz, whether it's pray this prayer, or whether it's join this particular church in particular sacraments or whatever, then you know, at least when you die, you'll have eternal bliss. And it actually gets far worse if you go down the road of our universalist friends, because that really lets you off the hook, right? Because, hey, starving children. Well, don't worry, you know, eternity of bliss awaits them, everyone else in the world. So all this stuff becomes super relative, right? You don't even have to do XYZ necessarily. And you know, then on the other side, in certain segments of, of modern Christianity and rebelling against that, they go in the opposite direction where they don't talk about that at all. They might not even believe that that even exists, that death Is just it. And so you have sort of vague social concern, and to be honest to history, not a social concern that's produced much actual good in the world at that. And it's really done anything to fight people's sense of alienation and loneliness and being cut off. So, you know, sort of what's. What's the answer then? And another weird habit I've developed for years now is I read Nietzsche during Lent, and it's helpful because it kind of beats up your intellect if you listen to. Amongst other things. But there's one place where Nietzsche talks about what's been called by people who interpret him the idea of the eternal return, which is where he says, you know, what would happen if at your darkest moment in life, a demon came to you and told you that essentially all of this has happened before and all of this will happen again right in on an infinite timeline. Everything that can happen will happen an infinite number of times. And so the idea being Nietzsche saying, the life you live now, you'll live over and over and over again, every bad part, every good part. But then he asked the question, what would that do in terms of how you live your life? And so I don't agree with Nietzsche that that's how it works. Obviously, I don't even know if Nietzsche agreed with nature, that that's how it really works. But the idea that eternal life, the eternal life that is talked about in scripture, you can especially see this in St. John's Gospel, begins now and is shaped by now and has as its model of the life we live now. I think Nietzsche unintentionally gives us kind of a way into that. That eternal life, that eternal life, that life of bliss, that blessed life, is not something that awaits us in a future if. If we keep the rules or do the right things now, it's something that has the potential to begin now. It's a life that can begin to burst forth now and then continue into eternity. And so I think what Christianity, what real Christianity has to say to the alienated person is that now, today is the beginning of the time to be reconciled, not just to be reconciled to God through some kind of religious procedure, but to be reconciled to God by being reconciled to your neighbor, by. To your literal neighbor, to your friends, to your family, to your community, to the world itself, and then through reconciliation to those things, to become truly reconciled to God and through being reconciled to come to participate in his life. As we read St. Paul's speaking about in Romans 5, and this isn't again an esoteric idea, right? This, this begins with picking up a phone and calling someone we haven't talked to in years and saying, you know what? The last time we talked I was a jerk and I'm sorry and I want to fix it. And I know it's weird that I'm calling you after all these years, but I don't like how we left it. Or calling the person who you just haven't talked to in years, who you have a sneaking suspicion might just need to talk to somebody or talking to the person you see every day and don't talk to, beginning to fix those things. Very simple things that any one of us can do because they don't cost any money. They cost us very little time. And we have more than enough of that that we're wasting on technology and trying to satisfy our desires. But those little steps that begin to lead to something that is beautiful and blessed and lasts forever. So those are my concluding thoughts."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9503.1,"end":9520.07,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Well, that is our show for today. Thank you for listening, everyone. If you didn't get through to us live, we'd still love to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9521.19,"end":9530.07,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific, which, Lord willing, will actually be live for a while now."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9530.23,"end":9541.6,"speaker":"Fr Andrew Stephen Damick","text":"Amen. If you're on Facebook, like our page, join our discussion group. Leave reviews and readings everywhere, but most importantly, share the show with a friend that you know or suspect is going to love it."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9542.48,"end":9550.48,"speaker":"Fr Stephen De Young","text":"And finally, be sure to Ancient go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9551.36,"end":9556.96,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night. God bless you. Christ is risen. He truly is risen."}
{"episode_id":"LOS - #042 - 2022-04-28 - Blessings and Curses","start":9574.33,"end":9611.38,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
