{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":0.56,"end":65.21,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":66.73,"end":106.08,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers. You're listening to Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. If you're listening to us live, you can call in at 855. That's 855-23-7-2346. Matus Katrudi is taking your calls tonight and we're going to get to those in the second part of our show. So tonight we're talking about baptism and I'm very happy to let you know that this is the first part of a series on the holy mysteries of the Orthodox Church. So this may be at least seven episodes, maybe more, maybe less."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":106.4,"end":110.64,"speaker":"Fr Stephen De Young","text":"This could be the rest of the show. We could just keep going."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":110.96,"end":150.67,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's true. I'm pondering that now. It's good. So, yeah, so what is baptism? How is it different from the ritual washings of the Torah? What does it do? How is it related to circumcision? Why is the water so cold? What does St. Peter mean when he says that baptism saves? Someone told me earlier that that makes them uncomfortable when someone is baptized. Is anything happening in the unseen world? All good questions that we're going to address. But first we're going to start with circumcision. We're not going to need a parental advisory though this time, right, Father?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":151.47,"end":163.95,"speaker":"Fr Stephen De Young","text":"Well, I am using alcohol and tobacco and firearms and that last one doesn't even make sense. Why would I do that during a live podcast?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":164.11,"end":170.43,"speaker":"Fr Andrew Stephen Damick","text":"But I can see my, my little Red phone is starting to ring over here in the corner. This is a."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":170.95,"end":190.15,"speaker":"Fr Stephen De Young","text":"There we go. Not unexpected and hate mail to Father Andrew Damick@ancientfaith.com. yeah, but we are going to start with circumcision. And we're not going to be describing the process in detail. No, that's."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":190.15,"end":191.51,"speaker":"Fr Andrew Stephen Damick","text":"You can look that up if you need to."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":191.75,"end":253.16,"speaker":"Fr Stephen De Young","text":"Not Germain. We're gonna be talking about what circumcision does in the Old Testament, starting in the Torah, how it's seen and the role it played in terms of ancient Israel and Second Temple Jewish community. And the reason we're doing that is that as we're going to see in a little bit, the ideas surrounding circumcision form the foundation for the understanding of baptism once we get into the New Testament and the New Covenant. So circumcision is sort of the foundational commandment, sort of the Ur commandment, the first layer, because it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":253.24,"end":254.44,"speaker":"Fr Andrew Stephen Damick","text":"God tells them to do."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":254.92,"end":257,"speaker":"Fr Stephen De Young","text":"Right. It's because it's given to Abraham."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":257.8,"end":258.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":260.6,"end":269.4,"speaker":"Fr Stephen De Young","text":"And so, I mean, you could say, yes, technically before that God tells him to go to Canaan, but that's not a commandment for anyone other than him."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":269.96,"end":275.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not an ongoing thing. It's not a foundational. Yeah, right, right, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":275.76,"end":328.07,"speaker":"Fr Stephen De Young","text":"So this is a commandment that's going to be practiced by him, by his descendants. Right. So it's a commandment in the sense of the commandments of the Torah, and it's the first one by a long shot. Right. In terms of sort of a direct and particular commandment. This also doesn't mean that it's the first ethical rule. Yes. Before this command was given. Murder still bad, Right? That's not what we're saying. Right. There was still good and evil before this, but this is the first commandment of that type, of the type that we're going to get many of later on in the Torah when the covenant is given through Moses. But it's worth noting that this one comes depending on your dating, at least 500 years before Moses."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":329.03,"end":329.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":329.99,"end":358.39,"speaker":"Fr Stephen De Young","text":"And so that means it. It has certain unique features as compared to those others. And it's given in Genesis 17. And the commandment is not just for Abraham to circumcise himself. Right. But to circumcise his household."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":359.99,"end":360.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":360.71,"end":368.23,"speaker":"Fr Stephen De Young","text":"Which means lot, his nephew, which means his herdsmen and shepherds, cousins, servants. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":368.47,"end":371.63,"speaker":"Fr Andrew Stephen Damick","text":"Now, this is before Isaac is born. Right. Or Ishmael."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":371.63,"end":409.82,"speaker":"Fr Stephen De Young","text":"Right, Right. This is all the males. And when they are born, they are circumcised. But the commandment Is. Is given here. And this commandment is so foundational that as we talked about back in our episode talking about priesthood, this is part of how the priesthood is taken away from Moses and given to Aaron. This is where leadership that will eventually become kingship and priesthood get separated is particularly related to obedience to this commandment."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":410.14,"end":463.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, you can see this happening in Exodus chapter four, right. Where Moses fails to circumcise his sons and his wife ends up doing it and is really mad about the whole thing, threatening to kill him. And it's not like spelled out in the text in the sense of. And so therefore God took the priesthood from him. Right. It doesn't say that, but right after the incident where Zipporah Moses wife responds to him in this way and does it immediately. What you see happen next is God begins speaking to Aaron in a completely different place. Aaron's not with Moses out in Midian at this point. And so there's a sense of God turning away from Moses in a certain way and beginning to deal now with Aaron. So that's. That's really. And Aaron then of course becomes the first high priest of Israel."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":464.29,"end":476.29,"speaker":"Fr Stephen De Young","text":"Right. And then in. In that previous episode, we then talked about how in the Golden Calf episode, sort of eldership gets separated from priesthood. Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":476.29,"end":476.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":476.61,"end":479.97,"speaker":"Fr Stephen De Young","text":"The priesthood gets given to the Levites. But we won't rehearse all that now."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":480.21,"end":480.57,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":480.57,"end":497.9,"speaker":"Fr Stephen De Young","text":"But the key is that that Abraham, when he's given that commandment of circumcision, he's also told to walk before God and be righteous. Right? To live in a righteous way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":499.58,"end":499.98,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":502.38,"end":534.88,"speaker":"Fr Stephen De Young","text":"The circumcision commandment is not just part of that, is not just sort of a sign of that. Right. Keeping that commandment itself, as we see with Moses, is a primary issue of obedience or. Or disobedience. Right. That it doesn't matter if Moses was trying to live a righteous life and just, oh, oops, I forgot to circumcise my sons or, you know, and himself, or he just got squeamish."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":534.88,"end":535.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":535.6,"end":542.32,"speaker":"Fr Stephen De Young","text":"And wasn't up to it. Right. This is treated as an act of disobedience to God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":542.56,"end":542.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":542.92,"end":546.15,"speaker":"Fr Stephen De Young","text":"This is a big deal at a very basic level."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":546.63,"end":547.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":549.27,"end":576.09,"speaker":"Fr Stephen De Young","text":"And so I'm not a prophet, nor the son of a prophet, but I know a lot of folks, and I know that there are some folks listening to this who think they know where we're going with this circumcision thing and why we're bringing it up on the baptism episode because they think we're going to say that baptism replaces circumcision. Right. At the end of this half, we are not."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":578.01,"end":584.17,"speaker":"Fr Andrew Stephen Damick","text":"Circumcision does not go away. But hold on, listen to the whole episode, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":584.17,"end":608.31,"speaker":"Fr Stephen De Young","text":"So this is not just like, hey, they used to circumcise kids and now we baptize kids, and it's the same thing. Right. And usually that kind of, shall we say, unnuanced argument happens among our Protestant friends when they're arguing about infant baptism. That's not at all where we're going."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":608.71,"end":609.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":610.63,"end":614.87,"speaker":"Fr Stephen De Young","text":"So we are. We are going to take a much more nuanced approach."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":616.15,"end":617.67,"speaker":"Fr Andrew Stephen Damick","text":"So stay tuned, everybody."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":618.23,"end":631.84,"speaker":"Fr Stephen De Young","text":"We're going to start by. I'm not going to do it. Digging a little deeper into circumcision. I wanted to make a really bad."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":631.84,"end":633.16,"speaker":"Fr Andrew Stephen Damick","text":"Pun, but you may not."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":638.12,"end":703.19,"speaker":"Fr Stephen De Young","text":"So part of that is then, since we're not doing that, just sort of. Oh, it replaces it. Switch. Right. The other place where circumcision comes up in the New Testament, maybe the most Protestant or Protestant most prominent place, if you're a Protestant, the most prominent place where it comes up in the New Testament. Aside from what we're going to go on to talk about in terms of the relationship with baptism, the most prominent place where it comes up is in this entanglement between St. Paul and certain parties. That's reflected in Acts 15. It's reflected in pretty much the whole. His whole Epistle to the Galatians. Right. And so a lot of discussions, Christian discussions of circumcision kind of just focus on this whole thing. Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":703.19,"end":703.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":704.03,"end":739.15,"speaker":"Fr Stephen De Young","text":"And on a particular reading of. Of Acts 15, sort of both the position taken by our Baptist friends that there's no relationship between circumcision and baptism and the position taken by our more sort of Protestant Reformation friends that baptism just replaces circumcision are both based on the idea that circumcision kind of gets dust binned along with the rest of the commandments of the Torah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":739.71,"end":743.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. We've talked about that relationship many times."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":743.47,"end":762.83,"speaker":"Fr Stephen De Young","text":"Yeah. And. And Acts 15 and Galatians are often the place where they go. This dispute is where they go to argue that it's dustbin. So this is part of a big part of the reason why we're going to end up at a different place than either of those positions. Because it wasn't dustbin."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":762.99,"end":773.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We believe that that's. That the. The Torah has been erased or, you know, nullified. Yeah, Yeah. I mean, that's what Jesus said."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":774.36,"end":774.76,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":775.08,"end":776.84,"speaker":"Fr Andrew Stephen Damick","text":"Wait a minute. That's what Jesus said."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":778.12,"end":796.77,"speaker":"Fr Stephen De Young","text":"Yeah. So to understand what's going on with that controversy. We have to kind of understand what it was about in the first place. And the way it's often presented, frankly, doesn't make sense historically."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":797.17,"end":797.81,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":798.45,"end":827.35,"speaker":"Fr Stephen De Young","text":"So the way it's often presented is that St. Paul is starting these churches in these different Roman cities. And in these churches, there are Jewish people and gentiles, non Jewish people, who become Christians. And the Jewish people in those churches think that the gentile people in those churches have to get circumcised."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":828.55,"end":829.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":829.83,"end":843.51,"speaker":"Fr Stephen De Young","text":"And that's what the fight's over. And then once it's presented that way, they say, well, the resolution of this controversy is that St. Paul wins the day and says you don't have to be circumcised anymore."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":844.39,"end":844.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":845.75,"end":858.08,"speaker":"Fr Stephen De Young","text":"And then when you get to St. Paul going and sponsoring sacrifices at the temple for people taking a nazarite vow or St. Paul having St. Timothy circumcised, people get really confused."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":858.24,"end":863.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that doesn't make any sense. Why would he. If St. Timothy's already done what needs to be done?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":865.28,"end":878.62,"speaker":"Fr Stephen De Young","text":"Right. And so. And on top of that, historically, Jewish people did not go around trying to get gentile people to be circumcised."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":879.5,"end":885.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, why. Why would they? I mean, which didn't. Don't they want everyone to be a Jew?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":885.58,"end":923.83,"speaker":"Fr Stephen De Young","text":"No. And that's. That's not part of. That's not part of the Torah. Right. This is a difference between what's outlined in the Torah. We've talked about this some before on the show. And many other religions. Not all other religions, but many other religions. Christianity obviously involves evangelism. Right. And Islam likewise involves. Right. But within the Torah. Right. We've talked about how there were sort of. Because God came to dwell among his."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":923.83,"end":924.11,"speaker":"Fr Andrew Stephen Damick","text":"People."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":926.35,"end":942.03,"speaker":"Fr Stephen De Young","text":"In Israel and then in Judah, that created these sort of concentric circles of how close you were to God's holiness. And so the nation of Israel was called to maintain a level of holiness higher than the other nations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":942.59,"end":942.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":943.31,"end":962.07,"speaker":"Fr Stephen De Young","text":"And then the priesthood to a higher level than that, and then the high priest to a higher level than that. Right. Because he was going to go into the most holy place once a year. And so they didn't think that the whole priesthood had to maintain the same level of holiness as the high priest. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":963.51,"end":967.59,"speaker":"Fr Andrew Stephen Damick","text":"Different standards is part of the way the Torah is actually laid out."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":968.07,"end":1032.2,"speaker":"Fr Stephen De Young","text":"Right. Because it's how close you are going to draw to God. Right. And so they didn't think that everybody had to maintain the same level of holiness as the priests. Right. The priests had to maintain a higher level of holiness during the time they were serving in the tabernacle or the temple than they did when they weren't. Right. The regular folks. Right. So there is no, like, hey, we need to go stop those Greeks from eating bacon. Right? Like, that didn't happen. They should stop. They thought they should stop worshiping demons and idols. Right. But they didn't think they had to become Israelites. Right. That's not a thing. Right. And it wasn't a thing in. In the first century. Right? In the first century. And I know we've talked about this on the show before. Most of the first layer of St. Paul's Gentile converts were what were called God fearers."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1032.6,"end":1041.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Gentiles who liked to hang around synagogues and study the Torah and. But not actually take on the whole life of being a Judean."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1041.56,"end":1049.96,"speaker":"Fr Stephen De Young","text":"Right. And the Jewish folks were not trying to persuade them to do that. In fact, they actively discouraged it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1052.44,"end":1055.32,"speaker":"Fr Andrew Stephen Damick","text":"Why would they do that? Why would they discourage them from doing that?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1056.44,"end":1104.86,"speaker":"Fr Stephen De Young","text":"Because they didn't think it was appropriate. They thought that the Jewish way of life was something given to them by their God for them, that separated them from and distinguished them from the other nations. And that didn't have to do at that time, primarily. See, again, we're approaching this from a Christian perspective where we're thinking about, right, like, well, you have to do this stuff to get into heaven. Right. That was not on the table at all. They weren't thinking that way. Right. They weren't thinking that these Gentiles need to come and get circumcised and follow the Torah or they'll go to hell. Like, that was not a thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1105.5,"end":1105.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1106.62,"end":1245.35,"speaker":"Fr Stephen De Young","text":"There were no Jewish people of the first century who thought that way. So this raises the question, when we see this group who Acts 15 says is from the party of the Pharisees, right. That there are these Jewish Christians who want the Gentile Christians in particular to get circumcised. So what is going on? Well, part of what reveals what's going on is the way in which this dispute was settled by St James, the Lord's brother, at what we call now the Council of Jerusalem. In Acts 15, when the apostles gathered to hear this. And what happens there is that St. James ends up taking a very literal and strict reading of the Torah, specifically of part of Leviticus that is called by scholars now the holiness code that starts in Leviticus 17 and runs to 23, 24. People argue, you got to write journal articles and dissertations. So they argue about where it ends. But this portion of the holiness code, the vast majority of the commandments, in it, Moses is told, say to the sons of Israel, this. This is what you must do. This includes food laws. This includes all these things. But in four places, it says, say to the sons of Israel and all those foreigners and aliens who live among you, all those sojourners who live among you, that they must keep these commandments. Right. So there's a subset of those commandments that apply to everyone and not just to Israelites. And those four places happen to be, not coincidentally, with Acts 15, sexual immorality as defined in Leviticus 18, idolatry, and twice about eating and drinking blood."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1247.19,"end":1251.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, as we've said before, has to do with idolatry."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1252.39,"end":1322.63,"speaker":"Fr Stephen De Young","text":"Right, right. And so Those are the four. Those are the four commandments that Acts 15 says apply to the Gentile Christians. Right. From the Torah. So how does that help us with. So that means they're being treated as sojourners. They're being treated as. They're still Gentiles, but they're gentiles who have come to live among us Jewish folks. Right. How does that help us with what the problem was in the first place? Well, in that same part of Leviticus where it's laying out, these are the things that the sojourners and the foreigners need to do. It says, unless. Actually, I think it says, but if. But if one of those sojourners, one of those foreigners, one of those gentiles living in Israel or Judah, if they want to eat the Passover, which is sort of the symbol of sort of full participation. Right. If you're eating the Passover, this means you're participating in the sacrificial system. You're participating. Right. If you want to do this, then that person has to be circumcised and become an Israelite."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1322.63,"end":1328.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you want to go all the way, then this is the. The process."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1329.19,"end":1329.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1331.03,"end":1349.88,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, so then the question that I would have based on that is, you know, given what we've said before about the Passover and Pascha being the same thing, that, you know, the Eucharist is essentially eating the Passover within the Christian context, why does that not apply to everybody then?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1351.8,"end":1354.68,"speaker":"Fr Stephen De Young","text":"Right. Well, that's. That's precisely what caused the disagreement."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1354.92,"end":1355.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1355.64,"end":1381.89,"speaker":"Fr Stephen De Young","text":"Right. Is that you now have within the Christian community. Right. So there was already a way of being settled in terms of the synagogue, of the Sabbath, in terms of Gentiles being in and around the synagogue. Right, right. But now we have this Additional layer on the Lord's day of gathering together to eat the Eucharist."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1382.13,"end":1382.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1383.01,"end":1403.79,"speaker":"Fr Stephen De Young","text":"Which is seen as the sacrificial meal, which is connected to eating the Passover. Right. And at those Christian meetings, Jewish Christians and Gentile Christians are coming together to the same table and participating in the same sacrificial meal. And so this is what engages the disagreement."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1403.95,"end":1410.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they're saying, look, you know, we're eating at the same table. Come on, you guys got to be circumcised, because that's how this works."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1411.07,"end":1443.96,"speaker":"Fr Stephen De Young","text":"Right. And so the real question that's being decided in Acts 15 is about the status of Gentile Christians. Right. By being Gentile Christians, have they become in some sense Jewish and therefore would need to be circumcised? Right. Or are they still Gentile Christians? Right. Are they gentile? Are they more like Gentile sojourners? Right. And the decision of the apostles is the second."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1446.17,"end":1446.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1447.29,"end":1482.18,"speaker":"Fr Stephen De Young","text":"Right. And so what this does, what this functionally does in early Christianity, Right. Is there is a new Christian way of life that is created for Gentile Christians. What do I mean by that? So before pre Christianity, we go to the third century B.C. right. You have Jewish people, Judean people. Right. Living as Jewish people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1482.74,"end":1483.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1483.78,"end":1493.62,"speaker":"Fr Stephen De Young","text":"Keeping the Torah, hopefully following. Right. Worshiping the God of Israel. And then you have pagans."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1495.47,"end":1495.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1495.59,"end":1545.75,"speaker":"Fr Stephen De Young","text":"You have Gentiles. So you have Greeks who are living as Greeks and worshiping the Greek gods and following Greek customs, which include things like sexual immorality and these other things. And so when Christianity comes along, what St. Paul helps forge is the idea that they can no longer live as pagans. Right. They can't keep worshiping the pagan gods. They can't keep participating in sexually immoral behavior. Right. They can't keep etc. Etc. Right. They can't keep doing that. But he's also not evangelizing Judaism. He's also not saying you need to become Jews."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1546.23,"end":1555.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, isn't this basically just a fulfillment of the Old Testament prophecies that talk about all the nations coming to worship Israel's God?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1555.65,"end":1564.05,"speaker":"Fr Stephen De Young","text":"Right, right. And so the contours and shape of what that looked like, that's what's being formed here in St. Paul's ministry."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1564.05,"end":1568.61,"speaker":"Fr Andrew Stephen Damick","text":"It's not the elimination of all the nations, it's the transformation of the nations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1568.77,"end":1584.06,"speaker":"Fr Stephen De Young","text":"Right. And this continues, I say it begins in St. Paul's ministry because this happens every time Christianity comes to another culture. Right. So we're seeing it in St. Paul's ministry coming to for Example, the Greeks and the Romans."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1585.26,"end":1585.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1585.66,"end":1625.37,"speaker":"Fr Stephen De Young","text":"But when St. Boniface brought the gospel to northwestern Europe, to my ancestors, they could not continue living as the pagans they were before, but they also did not become Jews or Greeks or Romans. Right. But within that evangelical ministry, a new way to be. This is anachronistic, but just for the sake of expression, a new way to be Dutch was formed. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1625.37,"end":1626.13,"speaker":"Fr Andrew Stephen Damick","text":"Why Dutch?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1626.45,"end":1632.05,"speaker":"Fr Stephen De Young","text":"We were still stingy, except with the church. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1632.05,"end":1633.09,"speaker":"Fr Andrew Stephen Damick","text":"Except with the church."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1633.41,"end":1658.6,"speaker":"Fr Stephen De Young","text":"Right, Right. But we had to cease with the pagan God worship. We had to cease. Right. So it wasn't. That stopped being who we were. Right. But what it meant to be who we were changed. Because what it means to be a Greek Christian is not the same thing that it meant to be a Greek pagan."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1659.72,"end":1660.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1660.71,"end":1716.31,"speaker":"Fr Stephen De Young","text":"And there were a first group of Greek Christians who St. Paul is writing letters to and trying to help sort that out, what that means, what can stay and what can go. So that was the core of that controversy. It was a controversy about Jewish identity and the particular commandments that are related to Jewish identity. Right. And those are the things that St. Paul, in his writings, is going to call the works of the law. The works of the Torah. Right. Not good works in general. Not keeping commandments in general. The works of the Torah are these things that were the boundary markers that made someone Israelite and then made someone Judean. Made someone Jewish. That's what he's talking about."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1716.76,"end":1717.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1717.32,"end":1729.48,"speaker":"Fr Stephen De Young","text":"And that's why he's so keen to say that salvation is not based on those boundary markers. Right. If it were, then that would be saying only Jewish people find salvation."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1730.44,"end":1731.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1732.04,"end":1764.96,"speaker":"Fr Stephen De Young","text":"Which St. Paul, of course, is not saying. Nor were any other Jewish people at the time saying that. Right. So the. The boundary markers, one of those issues, that's what's under debate and what's being discussed. And so circumcision comes into that as being one of the primary commandments related to those boundary markers. So aside from that role that it eventually played, what did circumcision do now? We're going back to Abraham."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1765.2,"end":1765.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1766.4,"end":1770.55,"speaker":"Fr Stephen De Young","text":"Right. To get some more pieces of what's going on. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1770.55,"end":1804.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's especially worth noting, you know, as we said earlier, we talked about the way the Bible sets up narrative, like what comes right after what. You know, it's not like a news. Like a news program where every event that happened. Yeah. Every event just has nothing to do with the one before it. Right. The Abraham story comes when? Right after the Tower of Babel story. Despite there being what how long between these actual events? Historically speaking? Maybe hundreds of years."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1805.74,"end":1816.78,"speaker":"Fr Stephen De Young","text":"Well, it depends. Potentially. Potentially, if I'm right, that this is about the rise and fall of the Babylonian empire. Abraham was kind of before."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1817.98,"end":1824.3,"speaker":"Fr Andrew Stephen Damick","text":"Interesting. There you go. But this is not a hill that we plan to duck on. Probably."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1824.38,"end":1858.44,"speaker":"Fr Stephen De Young","text":"But the point being, there is a very deliberate reason. I may be wrong about what it is. I don't think I am, or I wouldn't say it, but I could be. But there is a reason why we don't have any time lapse described between the Tower of Babel and Abraham. There is a reason. If you look at a lot of ancient Jewish literature, they noticed that and they combined the stories."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1859.96,"end":1860.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1860.6,"end":1879.24,"speaker":"Fr Stephen De Young","text":"They put Abraham into the construction of the Tower of Babel. Right. Which I think there was. That was based in part on a historical memory of the fact that the great ziggurat of Ur was being built during Abraham's day."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1879.89,"end":1880.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1880.29,"end":1897.81,"speaker":"Fr Stephen De Young","text":"And that's part of how those two things got mixed together. But people have noticed, that is to say for thousands of years, that there's no time markers there. Right. And so that means that these two things are being deliberately set next to each other for a reason."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1899.57,"end":1900.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. That these are related."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1901.57,"end":1967.27,"speaker":"Fr Stephen De Young","text":"Theorize about the reason. So Babel. Right. The nations are scattered and separated. The 70 nations are divided. Angelic beings are appointed to watch and shepherd over them. And that's sort of what we've described as sort of the third fall of humanity. This is sort of the last nail in the coffin of that. And so Abraham's story is the beginning of the solution. Right. This is the place where God again draws near to humanity to begin to dig our way out. Right. To begin to repair what was broken. And this is also the beginning of therefore, the creation of Israel. And notice. Got to do it. Sorry, Calvinists. God does not pick one of the 70 nations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1968.47,"end":1972.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's not an election in that sense."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":1972.79,"end":2150.73,"speaker":"Fr Stephen De Young","text":"Like he doesn't look at the 70 nations and choose one based on his own good pleasure. And that is Israel. Right, Right. He creates a new one. He creates a new one that did not exist previous to that. And that creation takes a lot of time because he starts with Abraham in his advanced old age, with Sarai, and it takes centuries to get to nationhood in the Exodus. But this is making something that before was not right, that did not exist. They were not a people. He made them a people. Right. As he reiterates several times in the Old Testament. And so what this means, though, is because this is a created Nation, Right. That he is bringing into existence, starting with one, with one man. Right. That the structure of it is intergenerational and family based. This is based on an extended family originally with Abraham and the patriarchs, Abraham, Isaac, Jacob, Jacob's sons. But also, even when Israel is a full blown nation, right. And Israel and Judah are two separate full blown nations, they're still structured according to extended families that are part of clans, clans that are part of tribes. And these units are intergenerational familial units. And this is one reason why circumcision, that is something done to sons, is a generational ritual. Right. Is particularly appropriate in demarcating it because of this familial. Familial structure. So this is just basic to circumcision. We've already talked about it as boundary marker, but as also as designating this family, forming this family that previously was not. This is done in part through circumcision. So it's not just accidental or because at eight days old you won't remember it or something that this has done to children, that circumcision happens to children. But notice also, right. Circumcision shows us something important, even though there is that familial relationship. So it's a father circumcising his son. Right. It's the head of the."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2151.21,"end":2151.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2151.65,"end":2166.81,"speaker":"Fr Stephen De Young","text":"The extended family who's performing the circumcision on the. The other males. Right. So there is this familial structure. The fact that there is this commandment means that it is not strictly a familial issue."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2167.69,"end":2169.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just dad making a decision."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2170.49,"end":2176.24,"speaker":"Fr Stephen De Young","text":"Right. And it's not just, hey, you happen to be born in this family and that makes you an Israelite."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2177.2,"end":2178.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2178.56,"end":2180.16,"speaker":"Fr Stephen De Young","text":"The commandment has to be kept."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2180.72,"end":2183.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a faithfulness thing going on there."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2183.6,"end":2218.04,"speaker":"Fr Stephen De Young","text":"Right. You have to be faithful. And so this is when St. Paul talks about Abraham and talks about circumcision. It talks about Abraham's faithfulness. And it really should be translated faithfulness, not just faith, but his faithfulness. Right. This is part of what he's talking about. Right. He's saying without the faithfulness, the biology, the biological descent doesn't matter. Without the faithfulness. Right. And he says this pretty directly in Romans 2."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2218.84,"end":2245.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Where he says, I mean, this is, you know, as St. Peter says, sometimes St. Paul is hard to understand, but this is what he says in Romans 2:25. For circumcision indeed is of value if you obey the law, but if you break the law, your circumcision becomes uncircumcision. So it's bound up with that notion of faithfulness. It's not. Yeah. It's only valuable if you're actually doing something."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2246.38,"end":2281.17,"speaker":"Fr Stephen De Young","text":"Right. Right. So if you know the fact that when you were eight days old, you were circumcised by your dad, if you proceed to live a life where you violate all the commandments of God, that ain't helping you. If you're breaking all the commandments of God, then you might as well be uncircumcised. Right. So the other obvious element of this, we're talking about boundary markers and this kind of thing is that women obviously aren't circumcised."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2282.13,"end":2282.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2283.49,"end":2333.22,"speaker":"Fr Stephen De Young","text":"So this is. So does that mean women are like the heathen? No. Quick answer. So the way. The way that this works is that someone who is. Right. The wife or other female member of a household. Right. Because we talked about servants. All kinds of folks are included in this. That person, that woman, that female adult human is made an Israelite or later a Judahite or a Judean by their relationship. If we talk about a wife by being the wife of a circumcised male."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2334.58,"end":2334.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2336.18,"end":2359.49,"speaker":"Fr Stephen De Young","text":"That makes him part of the household. Because the idea here is that the man, by receiving circumcision. Right. What he is doing is he is sanctifying himself, he is setting himself apart. Right. And we're going to get into that a little more here. So he's setting himself apart and he's doing that for. And with his family."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2360.21,"end":2382.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I think part of the reason why it might be hard for us to parse this is because modern people tend to think in individualistic terms. Right. That you're not a member of something by virtue of another relationship you have. You're either a member individually or not, you know, but that's not how it's actually set up in the Torah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2382.61,"end":2385.49,"speaker":"Fr Stephen De Young","text":"Right. And. Or the New Testament, for that matter."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2385.95,"end":2386.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2386.75,"end":2395.55,"speaker":"Fr Stephen De Young","text":"Right. Because St. Paul applies this same logic to baptism when he talks about people who are married to unbelieving spouses. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2395.71,"end":2401.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, I think you probably tend to read that as a. Well, maybe you'll influence them to make their own personal decision."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2401.79,"end":2403.71,"speaker":"Fr Stephen De Young","text":"Right. But that's not what he says."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2403.71,"end":2405.63,"speaker":"Fr Andrew Stephen Damick","text":"It's not what he says. Right, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2405.71,"end":2434.78,"speaker":"Fr Stephen De Young","text":"He says that the. The faithful spouse sanctifies, makes holy the other spouse and the children. And he there is applying it to baptized men and baptized women. Because most of the early Christians were women and slaves. So it was far More common in the community St. Paul is writing to for there to be a Christian woman married to a pagan man than vice versa."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2437.75,"end":2437.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2437.87,"end":2542,"speaker":"Fr Stephen De Young","text":"In fact, vice versa almost never happened because if the man became a Christian, the woman was going to be a Christian in that culture regardless. Right. So. Right. So he applies it in both. The same logic in both directions. So this isn't something that just goes away. Right. Christianity did not become individualistic in the New Testament. Christianity became individualistic in Western Europe in the 16th century. Send your hate mail to Father Andrew Damick@ancientfaith.com Some people think that's a good thing, though. Some people think the individual is a good thing. So why circumcision? Why this particular thing? Right. I mean, there are lots of visible things you could do. Right. You could have people wear beards or men wear beards or not wear beards. You could have men wear their hair in a certain way. You could have them, you know, cut off the last knuckle of their pink. Left. Pinky. Right, right. There's all these different things you could hypothetically do to indicate that a person is set apart. Right. Or. Or this kind of thing. So why this in particular? Right. Which is painful. Right. Which is, you know, definitely in our post Victorian age, seen as unseemly to even talk about in any detail. And you had a note on that from apparently something."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2544.57,"end":2544.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2545.29,"end":2547.05,"speaker":"Fr Stephen De Young","text":"Someone had suggested to you."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2548.81,"end":2579.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, someone asks. Sorry, I'm. I'm getting a little. A little lost here. Yeah, we're having issues. By the way, Everybody streaming on YouTube, of course, if you're hoping to find us on YouTube, you're not hearing me say this, so I don't know. But. But yeah, I mean, like some people might wonder about, you know, what's called female circumcision. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2579.75,"end":2581.27,"speaker":"Fr Stephen De Young","text":"Well, not where I was going."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2581.35,"end":2586.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Well, okay. Anyway, that was one of the notes that I had. But."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2588.39,"end":2589.83,"speaker":"Fr Stephen De Young","text":"That is not the same thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2589.99,"end":2591.27,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay. Well, we don't have to."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2591.35,"end":2593.43,"speaker":"Fr Stephen De Young","text":"I mean, we're not going to describe what that is."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2593.59,"end":2607.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, but I think. Yeah, we've. I mean, I think we've covered that in the sense of talking about how the relationship actually works in the Torah. You know, that's a completely separate thing that's not practiced in Israel. Yeah, Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2607.63,"end":2612.31,"speaker":"Fr Stephen De Young","text":"I think this was more. Somebody asked, you said somebody asked about the garments of skin."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2612.55,"end":2613.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2613.43,"end":2614.71,"speaker":"Fr Stephen De Young","text":"That had something to do with."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2614.79,"end":2684.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. Right. Yeah. We actually did get question about this in our Facebook group. Yeah. Thank you for reminding me which Was, you know, is circumcision a kind of ritual removal of the garments of skin which, you know, which we've talked about. Right. So God gives mortality to mankind in the wake of the, of, you know, the events of Genesis 3. And that mortality is given to him to enable him to repent. We talked about this in our Fall of Man episodes in the first one, I think. And the problem with seeing circumcision as the ritual removal of the garments of skin is that would mean you're ritually removing your ability to repent, which. Why would you then give all kinds of commandments in the Torah of how to repent if you've ritually removed your ability to do that from the get go? Right. So no, that's not what that is. But, you know, I mean, I can see why someone might, might think that, because is the removal of some skin, but no, it's not. It's not the garments of skin. So."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2684.63,"end":2687.55,"speaker":"Fr Stephen De Young","text":"Right. And the garments of skin are not a bad thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2688.11,"end":2689.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, no, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2689.35,"end":2694.07,"speaker":"Fr Stephen De Young","text":"The garments of skin are this enabling of repentance. So."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2694.07,"end":2695.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's a gift from God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2695.79,"end":2724.15,"speaker":"Fr Stephen De Young","text":"Sometimes, like, if you look at Gnostic sources, they talk about the garments of skin meaning to mean materiality or like having a physical body or a material body. Right. And just to be clear, that's not what we're getting at. Right. This is a beneficial thing, ultimately. A beneficial thing. As we talked about when we talked about death ultimately being given. If you read Genesis 3 closely, being given as a grace to humanity."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2724.39,"end":2724.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2725.35,"end":2738.91,"speaker":"Fr Stephen De Young","text":"Not as a punishment. Right. But so then you know why we're not talking about garments of skin, even though there's skin involved, there's skin in the game, as it were."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2741.07,"end":2741.47,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2744.91,"end":2748.91,"speaker":"Fr Stephen De Young","text":"Very clearly, circumcision involves something being cut off."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2750.51,"end":2751.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2753.07,"end":2762.35,"speaker":"Fr Stephen De Young","text":"And I've, I've been told that the first cut is the deepest. Okay, I did it. I'm sorry. Yeah, I'm not sorry."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2762.35,"end":2762.79,"speaker":"Fr Andrew Stephen Damick","text":"Fine."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2762.79,"end":2823.77,"speaker":"Fr Stephen De Young","text":"I won't lie on the air. I'm not sorry. But something is being. Something is being cut. So other than the obvious, what is being cut off? Well, this is given, remember, first to Abraham. And Abraham, remember, is called out of Ur of the Chaldees, is what we're told in Genesis, as we mentioned back in the Abraham episode, Ur of the Chaldees is an anachronism. The term Chaldean for Babylonian, Right. Comes from the Neo Babylonian empire, which is like 1500 years later. So why though is that anachronistic term used here in Genesis? Well, it's used to again, connect the Ur out of which. The city out of which Abraham is called to Babylon."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2824.41,"end":2825.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2825.77,"end":2852.13,"speaker":"Fr Stephen De Young","text":"As we're just talking about with the Tower of Babel. Right. And so there is a division, as we were talking about in the Torah, between the nations, the 70 nations, the world out there over against Israel. And Abraham is called out of these. These foreign nations that have been dominated by demonic powers."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2852.29,"end":2852.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2853.09,"end":2853.97,"speaker":"Fr Stephen De Young","text":"Where he came from."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2854.21,"end":2859.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's a ritual participation in coming out from the nations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2860.45,"end":2884.99,"speaker":"Fr Stephen De Young","text":"Right. And Joshua's final speech in Joshua, he makes it very explicit that even within Abraham's household, as he left Ur, many members of his household were still idolaters. Right. They were still kind of immersed in that. And we see things don't go so swell for lot. Like he kind of starts creeping back over into a city."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2885.71,"end":2889.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The wrong places too. I mean, like really idolatrous places."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2890.51,"end":2924.81,"speaker":"Fr Stephen De Young","text":"Right. And so we have a cutting off. Right. Which rep. Which. Which is enacting Abraham or Abram at the time, cutting himself off from the world and the world off from himself. Being separated from it. Right. Being separated from it. And that's, you know, holiness is about being separated from evil. Right. And so there's the cutting off. Why the genitals in particular? Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2924.81,"end":2928.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it seems a little sensitive."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2928.97,"end":2929.41,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2929.41,"end":2930.57,"speaker":"Fr Andrew Stephen Damick","text":"Like why. Why that?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2930.65,"end":2933.89,"speaker":"Fr Stephen De Young","text":"You know, why not the last knuckle of your left pinky."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2933.89,"end":2936.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, you could spare that maybe."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2936.89,"end":2957.13,"speaker":"Fr Stephen De Young","text":"Yeah. Or, you know, your ring finger if you're joining the assassins. But this is. This is because the genitals, very obviously, this is connected to that intergenerational familial character of what's being done."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2957.53,"end":2959.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's. It's a nation being made."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2960.04,"end":2992.99,"speaker":"Fr Stephen De Young","text":"Right. And it's. And it's being made in this context of families and tribes and clans and obviously. Right. This is where babies come from. Right. This is how they get made. And so that seems to be the connection there sort of ritually. Something that I don't think people have noted enough about circumcision, which ought to jump out at orthodox people, but I don't think does as much, is that circumcision was done on the eighth day."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2995.95,"end":2996.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":2996.83,"end":3056.72,"speaker":"Fr Stephen De Young","text":"The eighth day. And when you say. Normally when you say the eighth day to orthodox people, their eyes light up. But this is connected to that eighth day symbolism. Right. The seven days of creation. And there's the eighth day, the beginning of a new creation. And so the circumcised person becomes a new creation who is part of this new creation of Israel is made up of these newly created families, rightly designated families. And again, there tends to be in certain bad theology, this tendency to say, well, okay, this Old Testament stuff, this Old Covenant stuff, it's all about this physical material stuff. And then you get to the New Testament and this stuff gets spiritualized."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3056.96,"end":3062.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or like, you know, well, that was all works, righteousness. But then we're given the righteousness of Christ, you know."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3062.6,"end":3069.36,"speaker":"Fr Stephen De Young","text":"Yes. The spiritual. And so this is why we can dustbin circumcision and all those kinds of commandments and things. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3071,"end":3073.24,"speaker":"Fr Andrew Stephen Damick","text":"But no Gnostics. No."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3073.48,"end":3111.82,"speaker":"Fr Stephen De Young","text":"Yeah, but if you read, if you read the Old Testament beginning with the Torah itself, carefully. Right. So if you read, for example, Deuteronomy 10, 12, 17, Deuteronomy 36, and then the prophet Jeremiah returns to this in Jeremiah 4:4 and Jeremiah 9:26, those Jeremiah chapter numbers are in your non orthodox study Bible version of Jeremiah. Those passages talk about the circumcision of the heart."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3112.38,"end":3113.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3113.7,"end":3115.02,"speaker":"Fr Stephen De Young","text":"As being what's truly important."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3115.58,"end":3118.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Stop skipping parts of the Bible, people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3119.42,"end":3174.19,"speaker":"Fr Stephen De Young","text":"So this isn't some new spiritualized thing. In the New Testament, this was always true that the real circumcision was the circumcision of the heart. Your heart, your soul, being cut off from the world, the flesh, the devil. Right. And it being cut off from them and then being cut off from it. Right. It being kept holy and separate and apart. Right. Is always what the aim was of the be physical ritual. So when we get to Christ himself, though, we don't talk about it as much for reasons that are probably obvious. Again, post Victorian squeamishness. We celebrate the feast of Christ's circumcision on January 1st."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3174.81,"end":3177.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Also the feast of St. Basil."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3178.09,"end":3178.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3179.53,"end":3184.41,"speaker":"Fr Andrew Stephen Damick","text":"The feast when the kids look at the icon and say, why does that priest have a knife?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3185.37,"end":3190.05,"speaker":"Fr Stephen De Young","text":"Well, I've never been to a church that actually had that icon out. They always have the icon of St. Basil."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3190.05,"end":3201.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh. So we've got. So here in Emmaus, we have an icon that is both, like, it's got both St. Basil on it and I mean, they're sort of separate scenes, as it were."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3201.53,"end":3203.85,"speaker":"Fr Stephen De Young","text":"That would be weird if they inserted St. Basil."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3203.93,"end":3219.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that would be a little odd. But I mean, maybe that exists somewhere. I don't know. But yes, it's got him on there and it's got the scene of the circumcision of Christ. You see his mother holding him as a baby and you see the priest with a knife off to the side."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3221.55,"end":3252.12,"speaker":"Fr Stephen De Young","text":"And this Isn't just an incidental thing where somebody sort of did the math and was like, okay, wait, so if Christ was born on the 25th, then that would mean he got circumcised. Right. Like, we need another feast. Right. For some reason, this is because, as you know, if you've listened carefully to the epistle reading that's read at that service, St. Paul actually talks about Christ's circumcision."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3252.68,"end":3253.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3254.2,"end":3290.42,"speaker":"Fr Stephen De Young","text":"And so this is actually theologically important, Christ's circumcision to understanding all of these issues we've been talking about. So why is this relevant? Well, so in understanding one of the sort of trajectories, one of the ways in which St. Paul presents Christ's death, and it's not coincidentally that he presents it this way in his Epistle to the Galatians, which is where he's talking about this whole dispute about circumcision."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3290.58,"end":3291.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3291.14,"end":3300.42,"speaker":"Fr Stephen De Young","text":"It's not a coincidence. Is, for example, in Galatians 3, verse 13, where he talks about Christ becoming a curse."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3300.74,"end":3309.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. So he writes, christ redeemed us from the curse of the law by becoming a curse for us. For it is written, cursed is everyone who is hanged on a tree."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3310.56,"end":3328.48,"speaker":"Fr Stephen De Young","text":"Right. And as we've talked about before, back in the blessings and curses episode, the curse of the Torah here that we're talking about is, for example, in Deuteronomy 28:30, where the blessings and curses of the covenant are set out."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3328.72,"end":3332.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's. It's suffering the effects of sin."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3332.12,"end":3377.43,"speaker":"Fr Stephen De Young","text":"Right, the effects of sin. Right. These are the things that are going to happen when you don't keep the Torah, when you don't keep the commandments. Right. Here's what's going to all these bad things are going to happen. The sky is going to become like iron, the ground's going to become like bronze, meaning you're not going to be able to get any crops out of it, you're not going to get any rain. Right. All of these things that will happen. And so as St. Paul quotes there from Deuteronomy, everyone's hanged on a tree is. Is under a curse. And so Christ's crucifixion, in particular that he is crucified, points this reality of Christ becoming a curse, Meaning Christ voluntarily suffers the effects of sin."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3378.23,"end":3378.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3378.87,"end":3427.46,"speaker":"Fr Stephen De Young","text":"That cursed state that results from sin. Right. Christ takes that upon himself. And how is that ultimately described, that state of curse? Right. In the Torah and the rest of the Old Testament is being cut off from among the people. Right. You are cut Off. That's the number one way in the Torah in which the death penalty is described, Right. When someone is going to be stoned to death for some unrepentant sin that requires that it's they are to be cut off from among the people. And I think we've talked before on the show how when cut off from among the people occurs in those passages in the Pentateuch, it's not clear whether it's talking about death or exile, because those were seen as being the same thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3427.94,"end":3429.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's ambiguous."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3430.26,"end":3458.21,"speaker":"Fr Stephen De Young","text":"Right. But so Christ suffers the curse in being cut off, right. When he is crucified. But even though Christ is cut off in his death in the crucifixion, right. He is not cut off from God. Right, right. Because he is God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3458.21,"end":3462.29,"speaker":"Fr Andrew Stephen Damick","text":"He is God, Yeah. Sorry, bad readings of his comments on."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3462.29,"end":3469.53,"speaker":"Fr Stephen De Young","text":"The cross where he's quoting the psalm. He is praying a psalm. People read the rest of it anyway."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3469.53,"end":3470.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3470.74,"end":3520.53,"speaker":"Fr Stephen De Young","text":"He is not cut off from God. And so what does that mean? Right. Well, because Christ is not cut off from God and therefore not truly cut off from life, right. What happens is when he is cut off from the world is that the world essentially has cut itself off, right? It's like the world is sitting on the branch and it saws off the branch behind itself. Right. And this is the world as in that system. That world system. And St. Paul, not coincidentally, later in Galatians, sort of applies it exactly this way, right, in Galatians 6:14."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3524.13,"end":3556.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yes. Where it says, but far be it from me to boast. Yeah, this is a famous passage. Far be it. Well, these are all famous, really, but far be it for me to boast except in the cross of our Lord Jesus Christ, by which the world has been crucified to me and I to the world, right? So that's that, you know, again, that sort of being dead to the world, but the world is dead to me. At the same time. There's this. This, you know, distinction, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3556.87,"end":3629.93,"speaker":"Fr Stephen De Young","text":"That being cut off, right. And so this cut off, right, Rather than being truly a curse, right. Becomes a blessing, becomes essentially holiness, right. Becomes sanctification, right. Becomes this sort of holy separation. And then that carries with it, as St. Paul famously says in Second Corinthians 5:17, if anyone is in Christ, he's a new creation. The old has passed away, behold, the new has come. So that new creation element of the eighth day, right. Likewise comes into effect. And so this is what happens with Christ, Right. The crucifixion is therefore in this sense, St. Paul applies this language and understanding of circumcision to it. How is that benefit, that becoming a new creation? Right. How is that applied to those in, in the church, to those in the Christian community, especially those in the Christian community who are uncircumcised themselves."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3631.05,"end":3637.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's, I mean, not too far down the road and it's most of them. Right, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3637.54,"end":3646.74,"speaker":"Fr Stephen De Young","text":"So how does that come to them? Because St. Paul is arguing in Galatians that it does not come to them by those gentiles being circumcised."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3647.46,"end":3664.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, yeah. I mean, there's that, I think. Well, it's right here in our notes. But I mean, you know, so Second Corinthians 5:17. Right. If anyone's in Christ, he's a new creation. The oldest passed away. Behold, the new has come."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3665.07,"end":3665.63,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3665.79,"end":3676.35,"speaker":"Fr Andrew Stephen Damick","text":"So there's a difference that's happened on a fundamental level. You know, it's a new era in a real sense, you know."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3677.23,"end":3684.35,"speaker":"Fr Stephen De Young","text":"But the, the way that then gets applied, Right. To the Gentiles is explicitly for St. Paul through baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3684.51,"end":3687.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which, what do you know, is also there in galaxy."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3687.6,"end":3747.5,"speaker":"Fr Stephen De Young","text":"Yeah. Right. Where he says, in Christ Jesus, you are all sons of God through faithfulness. Right. So again, this idea of forming a family. Right. For as many of you as were baptized into Christ have put on Christ. Right. So you've received this through baptism. Right. Baptism, though, does not, any more than circumcision did, does not obviate faithfulness. Right. It's not that, oh, I was baptized. I don't have to worry about any other commandments any more than being circumcised cause you to not have to worry about any other commandments. Right. So faithfulness is still there. Right. But. But baptism is the beginning of that. Right. And he goes on to say in Galatians 3, there's neither Jew nor Greek, there's neither slave nor free. There's neither. There is no male and female. For you are all one in Christ Jesus. And if you are Christ, then you are Abraham's offspring and heirs according to the promise."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3747.82,"end":3755.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which puts it again, firmly back into that faithfulness definition of what it means to actually be part of the nation."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3756.14,"end":3786.33,"speaker":"Fr Stephen De Young","text":"Right. And so through. Through baptism and through faithfulness, like Abraham's faithfulness, that is the way in which these Gentiles, these Gentile Christians, become Abraham's off offspring. That is how they become part of the family of God. Not through being circumcised. Right. And becoming Jewish. And again, St. Paul points to more than once in Galatians and Romans that Abraham was prophesied to be the father of many nations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3786.73,"end":3801.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not just one nation that everyone's getting added to, but there's. I mean, it's dual. Right. So on the one hand, he's the father of many nations, but on the other hand, everyone who is his offspring."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3801.18,"end":3804.58,"speaker":"Fr Stephen De Young","text":"Is Israel is part of this family."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3804.82,"end":3806.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's part of the same time."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3806.74,"end":3816.74,"speaker":"Fr Stephen De Young","text":"Right, right. Right. Because for St. Paul, Judah or Judea and Israel are two different categories."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3817.46,"end":3818.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3818.18,"end":3858.26,"speaker":"Fr Stephen De Young","text":"Right. So when he talks about Judea and Judeans, which. The word that gets translated is Jews in a lot of our modern translations, English translations, is actually Judeans. And so when St. Paul talks about the Judeans, he's talking about Jewish people. He's talking about a particular group of people. Right. This particular group of people. When he talks about Israel. Right. He's talking about the whole family of God. Because remember, Judea, Right. Judah was not all of Israel in the Old Testament."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3858.42,"end":3859.22,"speaker":"Fr Andrew Stephen Damick","text":"One tribe."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3859.54,"end":3938.84,"speaker":"Fr Stephen De Young","text":"Right. Well, and it includes the nation of Judah, includes the Benjamites and some Levites. Right. But it's still a subset. The northern kingdom of Israel had the majority of the tribes. And we won't go into all this now future episode, it's in more detail, but the particular connection that St. Paul sees between the Gentiles and the northern kingdom of Israel. But the idea here is that Israel as the people of God is this larger, more inclusive category, whereas Judeans, Jewish people is a particular group. Right. They aren't just synonymous in the way he's using them in his letters. And so the baptized Greek, the Greek Christian in Corinth is still a Greek. He is not now Jewish. Right. He is still a Greek. He is a Greek Christian. Right. The difference is, has to do with how he lives his life, because as we said, there is this new thing forming, which is what it means to be Greek and Christian as opposed to Greek pagan."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3939.08,"end":3945.69,"speaker":"Fr Andrew Stephen Damick","text":"You can have both, both identities at once, but. But one of them is radically altered by the other. And that."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3945.69,"end":3946.05,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3946.37,"end":3952.61,"speaker":"Fr Andrew Stephen Damick","text":"The, the what we might think of as an ethnic designation is radically altered by being Christian."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3953.33,"end":3978.38,"speaker":"Fr Stephen De Young","text":"Right, right. And this, this is, this is reflected, for example, at the very end of the Book of Revelation, where the people from all the nations come into the new Jerusalem and they all bring with them the treasures of those various nations. While nothing, I was going to say."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3978.38,"end":3983.46,"speaker":"Fr Andrew Stephen Damick","text":"Reminiscent of the looting Egypt image."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3984.18,"end":3997.3,"speaker":"Fr Stephen De Young","text":"Yeah. But explicitly nothing unclean or impure can enter in. So all of the garbage of the various nations is all of the Sinfulness, all the uncleanness that gets left behind."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3997.78,"end":3998.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":3998.74,"end":4026.02,"speaker":"Fr Stephen De Young","text":"And the treasures. Right. The gold, the silver, what is pure, what is holy, that gets brought into. Right. The. The family of God. Right. And so there is a place that I already alluded to which occurs in the epistle reading for the feast of Christ, circumcision. It's actually Colossians where St. Paul really pulls all of these ideas we've just been discussing together all in one place."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4027.05,"end":4072.33,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yes. So Colossians, chapter 2, verses 8 through 12. St. Paul says, See to it that no one takes you captive by philosophy and empty deceit, according to human tradition, according to the elemental spirits of the world, and not according to Christ. For in him the whole fullness of deity dwells bodily. And you have been filled in him, who is the head of all rule and authority. In him also, you were circumcised with a circumcision made without hands, by cutting off the body of the flesh by the circumcision of Christ, having been buried with him in baptism, in which you were also raised with him through faithfulness in the powerful working of God, who raised him from the dead."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4074.25,"end":4087.37,"speaker":"Fr Stephen De Young","text":"And so here we have very clearly the benefits of Christ's circumcision are bestowed upon these Gentiles in Colossae explicitly through baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4088.33,"end":4112.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it sets up the same relationship as being the wife or daughter of a circumcised man in the Old Covenant, you know, because the Church is the bride of Christ, and so therefore the relationship in these terms is the same. Christ's circumcision counts for the church."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4113.4,"end":4136.09,"speaker":"Fr Stephen De Young","text":"And this is why Hebrews and several other places talk about Christ sanctifying himself before his crucifixion. And those are weird passages that people kind of don't know, like, why did he have to, like, Christ was holy the whole time? Right. Why did he have to sanctify himself? This is talking about that him being set apart so that that can be bestowed upon us."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4136.73,"end":4137.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4138.01,"end":4174.9,"speaker":"Fr Stephen De Young","text":"As his bride through his circumcision. And so this is the ultimate argument from St. Paul as to why Gentile Christians not only don't have to get circumcised to be able to receive the Eucharist and be full participants in Christian ritual life, but should not be because for St. Paul, by demanding that they be circumcised individually in the flesh, as he says, that would be replacing Christ's circumcision for St. Paul with their own."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4175.62,"end":4187.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it would be like if you were baptized in the church and then you decided to go get your own baptism somewhere else because you felt like it wasn't right. It wasn't. It didn't really do the job or whatever."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4187.46,"end":4191.84,"speaker":"Fr Stephen De Young","text":"You know, it would be saying, I'm not going to be made holy by Christ. I'm going to make myself holy."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4192.63,"end":4193.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4193.43,"end":4205.11,"speaker":"Fr Stephen De Young","text":"And this is why this context, St. Paul talks about people trying to establish their own righteousness. Right. Rather than receiving the righteousness of Christ through faithfulness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4205.43,"end":4230.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not about. Yeah. I mean, if you think about that, like, Right. People talking about him talking about people establishing their own righteousness. That's often, especially in, in Reformation framework, is read as, you know, stop trying to do good things. Christ has already done good things. But that's not what's going on. It's the establishment of righteousness. It's not just doing good things."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4230.63,"end":4233.67,"speaker":"Fr Stephen De Young","text":"Right. And that righteousness is received through faithfulness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4234.31,"end":4234.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4234.71,"end":4236.23,"speaker":"Fr Stephen De Young","text":"Which involves keeping commandments."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4236.55,"end":4236.99,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4236.99,"end":4239.99,"speaker":"Fr Stephen De Young","text":"If you love me, you will keep my commandments at all, which it says."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4239.99,"end":4241.51,"speaker":"Fr Andrew Stephen Damick","text":"A gazillion times in the Bible."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4241.59,"end":4242.07,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4242.87,"end":4263.98,"speaker":"Fr Andrew Stephen Damick","text":"Like, just do a word search, everybody, for love and commandments and see how many places they are paired together in the Bible. It's a bunch. A bunch. All right. Well, with that said, it was a good beefy first half. We're going to go ahead and take our first break. We'll be right back with the second half of the Lord of Spirits."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4264.38,"end":4280.63,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the of the Lord of Spirits. Give them a call at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4285.99,"end":4320.27,"speaker":"Fr Stephen De Young","text":"Jesus last words to his disciples were go and make disciples of all the nations. Unfortunately, many parishes are struggling to follow this commandment. In reclaiming the Great Commission, Father Evan Armitas offers a roadmap to help us get back on track. Relying on his 20 years of parish experience, Holy Scripture, and insights from research and his visits with churches across the U.S. he discusses how you and your community can implement changes that will transform, revitalize and renew your parish. You'll learn how to diagnose and remove the barriers you face, deal with resistance."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4320.27,"end":4322.74,"speaker":"Fr Andrew Stephen Damick","text":"To change, define what a healthy parish."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4322.74,"end":4341.72,"speaker":"Fr Stephen De Young","text":"Looks looks like, lead with purpose, and create a parish health plan. Written for clergy, council members, ministry leaders, small groups, and all committed parishioners, this book will help any church in its journey to reclaim the Great Commission. Purchase it today@store.ancientfaith.com."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4345.56,"end":4361.67,"speaker":"Announcer","text":"We'Re back now with The Lord of Spirits, the Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4363.35,"end":4413.05,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. Feel free to give us a call. We're talking about baptism tonight, and we actually got a question in email. Someone was asking about infant baptism. They were saying, you know, if baptism washes away sin, why would an infant who has never sinned need this? You know, and kind of related sort of questions that are, you know, in terms of seeing things in a Protestant way, for instance, like, shouldn't the person baptized first believe in God have the salvific power of baptism? Why is there no profession of faith and that kind of thing? And I think that those questions largely are answered by the foregoing, but we'll kind of flesh it out a little bit as we go. But I mean, these are important questions that people have."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4416.81,"end":4432.58,"speaker":"Fr Stephen De Young","text":"Part of that is a reductionist thinking. Yeah, right, Right. So repentance and the forgiveness of sins is part of, obviously, baptism. And we're going to get into that some more here. Right. But that's not all."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4433.3,"end":4436.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not all. It is. Scripture says it does a lot of."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4436.62,"end":4444.02,"speaker":"Fr Stephen De Young","text":"Things that doesn't exhaust. Right. What baptism is about is just me being forgiven of my personal sins."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4444.82,"end":4445.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4445.22,"end":4448.18,"speaker":"Fr Stephen De Young","text":"Right. Again, that's a very individualized approach."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4448.82,"end":4492.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we got another question which is related to this, too. Right. And it actually connects directly to what we were just talking about, the end of the first half, which is. I mean, it's kind of a sticky question, but it's like, you know, should people be baptized when they become Orthodox, even if they have been baptized before and, you know, if someone has been baptized and that's for the church to determine whether that actually has happened, then the answer is no. Right. Because of what we just said. You don't. You don't go and do it again. And while this is not a show about the canons and how to apply them, because I don't think there are."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4492.7,"end":4497.86,"speaker":"Fr Stephen De Young","text":"Enough bishops listening, so that would be irrelevant to our entire audience, pretty much."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4498.18,"end":4534.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But the truth is, is that if you actually do read the canons, they do not ever say, it doesn't matter at all what anyone's previous religious experience was. Baptize them all, no matter what they, in fact, the canons say, well, these people, we do this with them. These people, we do this with them. These people and so forth. Right. And it's largely kind of the question seems to be, do we consider what they had before a baptism or not. So. And that's because they're trying to be careful not to baptize somebody twice. That's the point."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4535.14,"end":4537.98,"speaker":"Fr Stephen De Young","text":"I don't think that's inaccurate, what you just said."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4538.14,"end":4538.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4538.46,"end":4546.46,"speaker":"Fr Stephen De Young","text":"But I don't even think we need to go that far. Right. What did we say about circumcision? It's an act of faithfulness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4546.86,"end":4547.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4547.46,"end":4556.78,"speaker":"Fr Stephen De Young","text":"It's an act of obedience. Right. And faithfulness and obedience doesn't mean I do what I think is right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4557.98,"end":4564.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. I know. What an irony, right, for people to come into church and say, look, this is how I want to be received."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4565.92,"end":4579.2,"speaker":"Fr Stephen De Young","text":"So this is basic, right? Like, this is an act of faithfulness and obedience. So. Yeah, yeah. That's that individualism rearing its ugly head again."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4579.28,"end":4581.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4582.32,"end":4586,"speaker":"Fr Stephen De Young","text":"And it's no good. It's very bad. No man is an island."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4589.37,"end":4593.89,"speaker":"Fr Andrew Stephen Damick","text":"All right, so here we are in the second half now."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4593.89,"end":4596.01,"speaker":"Fr Stephen De Young","text":"We're going to take you to the river and put you in the water."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4596.41,"end":4604.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. I mean, I'm suddenly I'm hearing my head. That great old song, went down to the river to pray. Studying about that good old way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4605.13,"end":4606.93,"speaker":"Fr Stephen De Young","text":"See, I was going for talking heads. But anyway."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4606.93,"end":4610.81,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, I know. And I was doing, you know, bluegrass, old timey music."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4611.21,"end":4611.69,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4612.57,"end":4626.05,"speaker":"Fr Andrew Stephen Damick","text":"Yep. That's the difference between real old fashioned. The irony is you're the one who lives in the deep South. I live up here in, well, Yankee land, I guess I am."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4626.13,"end":4629.17,"speaker":"Fr Stephen De Young","text":"I live in Cajun territory."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4629.33,"end":4629.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4631.17,"end":4633.73,"speaker":"Fr Stephen De Young","text":"I recently learned is very small."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4634.53,"end":4635.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4635.41,"end":4638.65,"speaker":"Fr Stephen De Young","text":"So like Alexandria and Shreveport. Suburbs of Dallas, apparently."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4638.65,"end":4639.93,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Wow."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4639.93,"end":4641.73,"speaker":"Fr Stephen De Young","text":"That's Lake Charles, suburb of Houston."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4642.55,"end":4681.97,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that's sharp. I was going to say this, though, about Emmaus, Pennsylvania. Here's a little bit of really obscure history. In the very first land grants that defined Virginia, where I live was actually included in Virginia, as was most of the United States, actually, and much of Canada. But after, I think about three years, the line got moved just southwest of me. Where I am now was Virginia. So I do sometimes claim to still be living in the state I was born in. So once upon a time, this was the South."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4682.45,"end":4688.13,"speaker":"Fr Stephen De Young","text":"I used to try to get people to call New York New Amsterdam, you know, the way they call Istanbul Constantinople."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4688.13,"end":4692.29,"speaker":"Fr Andrew Stephen Damick","text":"But yes, well, people just liked it better the other way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4692.69,"end":4693.81,"speaker":"Fr Stephen De Young","text":"It got the works."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4695.17,"end":4703.26,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. And you know, point out everybody, by the way, that that's not a song original to they Might Be Giants. No, it's originally the Four Lads."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4703.58,"end":4705.98,"speaker":"Fr Stephen De Young","text":"That is a klezmer music classic."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4706.14,"end":4711.42,"speaker":"Fr Andrew Stephen Damick","text":"There you go, that's right. Klezmer. Is that the first time we brought up klezmer on Lord of Spirits?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4712.38,"end":4713.1,"speaker":"Fr Stephen De Young","text":"Who knows?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4713.18,"end":4721.82,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. We should try to come up with that more often. Klezmer is a cool kind of music, everybody, if you're not into it. All right. Well, yes, speaking of John the Baptist."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4721.9,"end":4723.02,"speaker":"Fr Stephen De Young","text":"But we digress."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4725.18,"end":4728.54,"speaker":"Fr Andrew Stephen Damick","text":"We didn't really digress at all in the first half, so I feel like we're due a digression."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4729.01,"end":4735.57,"speaker":"Fr Stephen De Young","text":"Yeah, you know, I don't need permission to digress. I can digress freely, and it will."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4735.73,"end":4736.45,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4736.93,"end":4751.89,"speaker":"Fr Stephen De Young","text":"But yeah. So in this second half, we are going to be talking about St. John the Forerunner, St. John the Baptist, because how can you talk about baptism and not talk about St. John the Baptist."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4754.62,"end":4757.74,"speaker":"Fr Andrew Stephen Damick","text":"As he's Southern Baptist or Northern Baptist?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4758.78,"end":4769.46,"speaker":"Fr Stephen De Young","text":"Well, on behalf of my grandmother, I would have to say General association of Regular Baptists. You wanted irregular Baptist."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4769.46,"end":4776.86,"speaker":"Fr Andrew Stephen Damick","text":"I say, when will the G A R B age finally be ushered in? Sorry, it's an old joke from my childhood."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4780.25,"end":4787.53,"speaker":"Fr Stephen De Young","text":"So as St. John is affectionately known by my fellow Dutch people, It's more like St. John the Doper."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4788.25,"end":4794.89,"speaker":"Fr Andrew Stephen Damick","text":"Doper. I know this is really. And isn't like. Isn't it dope? D, O, O, P. Isn't that baptism in Dutch?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4795.29,"end":4799.05,"speaker":"Fr Stephen De Young","text":"Yeah, dope. I'm sure it's etymologically related to dip."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4799.21,"end":4803.85,"speaker":"Fr Andrew Stephen Damick","text":"It's dope somehow. It's very dope etymology."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4804.81,"end":4889.26,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, there are a bunch of obvious Amsterdam doper jokes that suggest themselves, but we'll just pass over them in silence. So St. John the Forerunner is in the wilderness. He's at the Jordan River. He starts baptizing people at the turn of the era. So what's he doing? Right. What would. How would the people at the time have understood what he was doing? Right. Because in a sense, this sort of comes out of nowhere, in the sense that there aren't people getting baptized, per se, in the Old Testament. Right. I say per se because we're going to see there are some things, but there are some incidents, you know, where people who are being healed are, you know, getting into the Jordan River. Those kind of things that are certainly connected. But the. The main context into which the baptism of St. John enters is into the idea of the various ritual washings that were common for various purposes in. In Second Temple Judaism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4889.26,"end":4890.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Of which there were a bunch."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4891.42,"end":4916.38,"speaker":"Fr Stephen De Young","text":"Yeah. Growing out of. Right. Growing out of the. The Torah itself. Right. So one thing we have to remember when talking about these is, despite how Sometimes it's treated in terms of modern readings. Uncleanness and sin are not synonymous."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4917.34,"end":4921.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Unclean. Unclean. I mean, you could be unclean just by having leprosy."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4921.98,"end":4926.06,"speaker":"Fr Stephen De Young","text":"Right, Right. Well, even far more simple things than that."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4926.46,"end":4927.26,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4927.42,"end":4928.7,"speaker":"Fr Stephen De Young","text":"Going to the bathroom."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4929.18,"end":4939.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. Touching a dead body. But even, like, things that might otherwise seem good, like. Right. Doesn't touching Torah scrolls render you ritually unclean?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4939.82,"end":4963.38,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Yeah. So any holy thing that's out of its original content makes you unclean. Right. It becomes unclean. So we have to divide between what are commonly called in the scholarly taxonomies ritual uncleanness and moral uncleanness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4964.02,"end":4965.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay. They're related, though, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":4966.1,"end":5009.42,"speaker":"Fr Stephen De Young","text":"They're related. Right, yes. So ritual uncleanness is the broader category. Okay, Right. So this broader category includes, like, the things we were just mentioning, going to the bathroom, bodily emissions for men and women. Right. Bleeding, touching a dead body, even if you're doing something good, like going to bury a family member. Right, yeah. But coming into contact to clean the body and prepare it for burial. Right. You've touched it, you're now unclean. All of these things, those make you ritually unclean. And the reason it's called ritual uncleanness is that then there is a ritual washing that you undertake."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5009.74,"end":5010.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5011.18,"end":5011.58,"speaker":"Fr Stephen De Young","text":"Before."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5012.3,"end":5026.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say because. Well, yeah, like you said, it has to be undertaken. But. And. And the reason is that the uncleanness is not just sort of a state of being bad or dirty or whatever. It's that something needs to be done."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5027.18,"end":5029.34,"speaker":"Fr Stephen De Young","text":"Right. It doesn't mean you're guilty of something."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5029.9,"end":5030.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5030.62,"end":5039.1,"speaker":"Fr Stephen De Young","text":"It doesn't mean you need to repent of having gone to the bathroom. Right. Again, this is not sin."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5039.9,"end":5042.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. But there's a washing that needs to occur."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5042.86,"end":5051.74,"speaker":"Fr Stephen De Young","text":"Right. And then that then remedies it. And you have to perform that washing before you go deeper into those concentric circles we were talking about."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5052.37,"end":5053.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Approaching God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5054.37,"end":5085.45,"speaker":"Fr Stephen De Young","text":"Right. And so if you're going to approach God, if you're going to go deeper into those concentric circles, you need to ritually wash to remove that uncleanness. Right. The other category is moral uncleanness, meaning subset. Right. You have committed sinful acts, and in addition to the way that those sinful acts have to be dealt with, they also make you ritually unclean."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5085.93,"end":5088.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there needs to be both repentance and washing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5089.13,"end":5101.77,"speaker":"Fr Stephen De Young","text":"Right. So touching a dead human body makes you ritually unclean. Making a dead human body by killing someone makes you morally unclean, which includes ritual uncleanness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5102.17,"end":5102.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5103.38,"end":5149.68,"speaker":"Fr Stephen De Young","text":"Right. And so that has that added element of repentance. Now, it is possible someone who is ritually unclean, who does not perform the ritual washings before going deeper into those concentric circles. Right. Can contract moral uncleanness by virtue of that. Right. So, for example, if you're Nadab and Abihu, Aaron's sons, and you're drunk and messing around and you go into the temple in that state, you're going to be on fire for the Lord and not in the good way that you want to be."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5150.48,"end":5154.8,"speaker":"Fr Andrew Stephen Damick","text":"It took me about two seconds for that joke to sink in, man."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5156.08,"end":5240.1,"speaker":"Fr Stephen De Young","text":"So. And not the way. Right. So it could become that. Right. But so obviously, the deeper in you are in those concentric circles, the more often you're going to have to participate in these ritual washings. So priests are having to do this much more frequently. Right. Because they're going to go and serve. Right. And they have to maintain this ritual cleanness. Right. Like all the time. And moral uncleanness obviously also as well. And the high priest then. Then most of all. And so because of the need for this. Right. We have, archaeologically, we found. So at the time, when you get to 1st century BC 1st century AD there are huge communal baths essentially in Jerusalem for pilgrims who are coming to the temple for Passover or for the other feasts. And when I say huge communal baths, this is what this looks like. Right. In terms of the excavations, imagine like an Olympic sized swimming pool. And on each of the long sides of the rectangle, there are stairs, stone stairs leading down to the bottom of the pool."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5241.08,"end":5241.48,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5242.36,"end":5251.64,"speaker":"Fr Stephen De Young","text":"So that pilgrims come in a group, go down the one side into the water and then walk up the stairs on the other side having, like, passed through it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5251.88,"end":5255.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the idea is to. So that lots of people can go through this all at once."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5255.6,"end":5274.65,"speaker":"Fr Stephen De Young","text":"Right. So when you have thousands of pilgrims, right. Coming off the road and whatever they've been doing and all that, and now coming to come into the temple courts. Right. They can pass through there and perform that ritual washing in an efficient way. Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5274.65,"end":5285.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because otherwise this is stuff that you would just do privately for various kinds of acts. But when you've got all these people coming at once, you need to figure this out logistically."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5286.33,"end":5294.33,"speaker":"Fr Stephen De Young","text":"Yeah. It's not like one of those places with one metal detector. Right. Where each person has to go and wash and you have to wait. Right. That would not be functional. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5294.33,"end":5295.33,"speaker":"Fr Andrew Stephen Damick","text":"Or like the airport."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5296.77,"end":5297.17,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5297.73,"end":5299.97,"speaker":"Fr Andrew Stephen Damick","text":"This is the TSA PreCheck Vert. No."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5302.69,"end":5323.84,"speaker":"Fr Stephen De Young","text":"And. And the idea here Right. At the core of it is that when one comes and presents oneself to God, you present yourself to God clean and whole. Right. And that whole is where, like, the bleeding and the emissions of those kind of things come in. Right. Because you're seen to be depleted."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5324.64,"end":5325.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5325.84,"end":5341.6,"speaker":"Fr Stephen De Young","text":"Right. And I mean, this is, in the case of bleeding, this is literally true. Right. Like, you bleed, you lose some blood. Right. And it takes time for that to. Right. Regenerate. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5341.68,"end":5342.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5343.12,"end":5361.1,"speaker":"Fr Stephen De Young","text":"But so that's the idea behind it. Right. And this is still in our tradition, if you pick up a copy, at least, of the Antiochian Archdiocese's priest guide. Right. There's hygiene rules for priests in there."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5361.74,"end":5372.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And I mean, you know, and there's even like, in some editions of the Liturgicon, you've got the commandments of St. Basil, the priest at the beginning, which relate to some of this stuff."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5373.66,"end":5377.42,"speaker":"Fr Stephen De Young","text":"Yeah. You know, there's the traditional clergy washing his hands."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5377.93,"end":5378.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5378.09,"end":5379.73,"speaker":"Fr Stephen De Young","text":"The bishop washes before the celebration of."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5379.73,"end":5411.87,"speaker":"Fr Andrew Stephen Damick","text":"The liturgy, the proskomedi, where we cut the bread and the wine. You know, cut the bread and pour the wine. There's a washing that happens before that. And. Yeah. I mean, you know, traditions about, for instance, clergy and traditionally, frankly, anyone who's going to receive communion, abstaining from marital relations the night before. So there's all these ideas of preparation and setting apart and the fasting rules connected with communion are related to this as well."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5412.75,"end":5416.75,"speaker":"Fr Stephen De Young","text":"Right. And again, this is not. Because there's something evil about those things."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5417.79,"end":5418.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5420.27,"end":5453.73,"speaker":"Fr Stephen De Young","text":"This has to do with how we come and present ourselves before God. Right. In worship. So in terms of what St. John is doing, in terms of, you know, pushing people under the water. Right. This is, you know, it's within this context of ritual washings. So the people who see him doing this are going to understand this within that context of ritual washings. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5453.73,"end":5454.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes, they've seen this before."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5455.33,"end":5472.17,"speaker":"Fr Stephen De Young","text":"But there are also features of what he's doing that separate it from just sort of the regular run of the mill. Right. Washings that. That we were just talking about. Right. I say run of the mill because they were happening continually. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5472.17,"end":5472.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5473.05,"end":5505.54,"speaker":"Fr Stephen De Young","text":"In the life of people who are trying to follow the Torah. So St. John is doing this out in the desert. And the immediate significance of that, that you might see is that the purpose of the ritual washings was to allow you to draw near to the temple. Right. To draw near to where God. He's actually having people do this. He's calling them further away in order to do this."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5505.94,"end":5507.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's weird."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5508.9,"end":5544.98,"speaker":"Fr Stephen De Young","text":"Right. So there is. In what St. John is doing, there is an inversion going on. What he's doing is inverting the way in which most Judeans would have at least wanted to see themselves, because he's calling the people out of Jerusalem and out of the other cities of Judea and Galilee and Samaria, calling them out to the Jordan. Right. He's calling them to remove themselves from the world. But the world here is Jerusalem and."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5544.98,"end":5553.02,"speaker":"Fr Andrew Stephen Damick","text":"These other Jewish cities, which. What does that say about what's Jerusalem's status and the status of the Temple there?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5553.66,"end":5563.02,"speaker":"Fr Stephen De Young","text":"Right. It's treating Judea as the place of sin. So it's treating Judea like Egypt in the Exodus, or like Ur, when Abraham is called."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5563.18,"end":5563.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5564.7,"end":5596.14,"speaker":"Fr Stephen De Young","text":"And Herod's Temple, which is the temple that's standing there at the time. Right. Is being treated not as the place where God dwells, shall we say, not as a holy place. And that is not unique in Second Temple Judaism, as we'll see here in a minute. Different groups within Second Temple Judaism had different relationships with the Jerusalem Temple."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5596.72,"end":5598.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5598.88,"end":5616.24,"speaker":"Fr Stephen De Young","text":"But the juxtaposition here is that they're being called out of what was supposed to be the holy city. This is supposed to be the holy city. The city that is holy and set apart. Right. Jerusalem, Mount Zion, city on a hill. The original."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5616.56,"end":5622.96,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Which, I mean, this light to the nations. Why? Why St. John was so unpopular with certain people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5623.77,"end":5624.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5624.33,"end":5628.09,"speaker":"Fr Andrew Stephen Damick","text":"Because what he was doing was a fundamental insult to the Temple."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5628.89,"end":5639.61,"speaker":"Fr Stephen De Young","text":"Right, to the Temple, to the priesthood at the time, which was the Sadducees to Herod. Right, To Herod. Realized that we could tell."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5640.09,"end":5642.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. This guy's a real rebel."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5643.13,"end":5666.07,"speaker":"Fr Stephen De Young","text":"Right. And so he's not only calling them out, but he's calling them to this baptism that is not just about, like. It's not about forgiveness of sins, just the sense of, like, hey, I committed a crime, God's mad at me, and I need to go and get baptized, and then I'm off the hook."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5666.55,"end":5667.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5667.39,"end":5683.76,"speaker":"Fr Stephen De Young","text":"So I go to heaven and don't go to hell. Again, that's not in view here. Right. This is. You need to be purified from the way of life you've been living. Right. And the residue that's been left on you."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5684.16,"end":5698.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which explains why it says in the Scriptures, when various groups come to St. John, they often ask him, what are we supposed to do? Like, now that I've come and done this, how is my life supposed to change?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5698.88,"end":5700.64,"speaker":"Fr Stephen De Young","text":"Right. I can't just Go back."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5701.21,"end":5703.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. He gives them specific commands."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5703.69,"end":5765.96,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. Go back to just doing things like I did before. Right. And he gives them what he says to them in terms of commands is ways to remedy. Right. That. That way of life. Right. And so we read about particular people in the Gospels who were sort of not interested in St. John's offer, who didn't take him up on it. And one of those groups is at least many of the Pharisees. There are particular examples of Pharisees who did receive St. John's baptism in the same Gospels. Right. But for the most part, the Pharisees were not interested. And you see that for example in Luke 7:30. Why were they not interested? Well, the word Pharisee, and this is not 100% certain, but this is pretty much every scholar's best guess comes from a word that means to be set apart, to be separated."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5766.28,"end":5769.08,"speaker":"Fr Andrew Stephen Damick","text":"They basically like, we're already separated."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5769.32,"end":5769.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5770.76,"end":5773.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we're separated the good way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5773.4,"end":5780.36,"speaker":"Fr Stephen De Young","text":"Right. And that's why when you hear Pharisees speak in the Gospels, they often refer to sinners as these other people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5781.17,"end":5782.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're not them."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5782.53,"end":5793.49,"speaker":"Fr Stephen De Young","text":"Right. So they have, from their perspective, they already have this ambivalent relationship with Herod's Temple. Right. This is what allows the Pharisees to survive the destruction of the temple."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5793.73,"end":5796.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They already defined themselves over against it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5796.13,"end":5820.13,"speaker":"Fr Stephen De Young","text":"In terms of later Judas. They already had this sort of ambivalent relationship with it. I say ambivalent because it's not like they never used it or wouldn't go near it or anything. But it was the temple. But they acknowledged that the Sadducees running it and the way it was being run was corrupt and needed to be purified. And there's good evidence they believe that the Messiah was going to do that when he came."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5822.45,"end":5823.33,"speaker":"Fr Andrew Stephen Damick","text":"They weren't wrong."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5823.89,"end":5826.13,"speaker":"Fr Stephen De Young","text":"Right, Agree."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5826.93,"end":5828.93,"speaker":"Fr Andrew Stephen Damick","text":"Hey, you guys got this one. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5830.05,"end":5863.05,"speaker":"Fr Stephen De Young","text":"But they had this ambivalent relationship already. And from their perspective, what being a Pharisee was already about was separating yourself from. Yes. That sinful way of life that unfortunately is going on in Judea. Right. But we're the ones who are separate. And therefore they didn't think they needed what St. John was doing. Right. They thought they had already sort of had that taken care of. Right. Many of them Sadducees, it might be obvious they weren't interested."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5863.05,"end":5864.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, they're the establishment."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5865.16,"end":5911.35,"speaker":"Fr Stephen De Young","text":"Yeah. Luke 20, verses 1 through 8. Right. This is where the Sadducees and some Torah scholars and some people come to Jesus to test him again. And he kind of throws a question back at them, which is always bad news for them. And they say, you know, by what authority are you doing these things you do? And he says, well, on what authority did John baptize? Right. Was it from human or was it from men or from God? And of course they're like, well, if we say men, then all the people will get mad at us. And if we say God, then they'll ask, hey, why didn't you go get baptized then? So they just kind of wander off. Right, right. But so this shows that, you know, they weren't. Right. Interested. But, I mean, they're the ones being denounced."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5911.99,"end":5913.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5913.43,"end":5917.65,"speaker":"Fr Stephen De Young","text":"This is the high priestly family. These are the corrupt people who he's talking about. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5917.65,"end":5918.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5919.17,"end":5943.57,"speaker":"Fr Stephen De Young","text":"And so, yeah, they're, number one, not super willing to accept that they're corrupt and evil and number two, not going to change their ways. So, yeah, that seems to be why. Why, why they weren't interested. So we also talked about. We did our episode just on St. John the Forerunner. Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5943.57,"end":5944.89,"speaker":"Fr Andrew Stephen Damick","text":"A while back, one of my favorites."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5945.37,"end":5957.05,"speaker":"Fr Stephen De Young","text":"And in that we talked about the whole idea of remnant theology, as it's called now in scholarship. But that idea that there's a faithful remnant always preserved within Israel."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5957.53,"end":5958.01,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":5958.01,"end":6001.19,"speaker":"Fr Stephen De Young","text":"And Judah, going back to the prophet Elijah after the showdown at Mount Carmel. Right. Where he says, I'm the only one who still worships Yahweh, the God of Israel, might as well just take my life. And God says, no, you know, there are all these who have not bowed the knee to Baal, right. That there's that remnant. Right. And how St. John, part of what he's doing is again reforming that remnant out there on the other side of the Jordan. Right. Putting that people, that family unit, Right. Together again so that he can then turn that over to Jesus as the Messiah. Right. And so this, of course, brings us to Christ's baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6001.91,"end":6003.91,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Finally."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6006.07,"end":6010.87,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So we move from Christ's circumcision to Christ's baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6010.87,"end":6020.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He shows up there at the Jordan at the beginning of the Gospels, depending on which one you're looking at. Yeah, but all four of them. Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6021.41,"end":6055.92,"speaker":"Fr Stephen De Young","text":"Right. Showing how important it is because there aren't a lot of things that are actually in all four, but this is one of them. And so. And we talked about this. We've talked about this a little bit before, too. But St. John, of course, protests at first. Right. Basically he says, I need to be baptized by you. Right. Sort of acknowledging like, hey, the whole forgiveness of sins part and being added to the faithful remnant and all this. Like, you don't need that. Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6056.24,"end":6056.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6057.52,"end":6065.92,"speaker":"Fr Stephen De Young","text":"You're already there. In fact, he says, I need to be baptized by you. Right. Meaning you're, like, above me. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6066.96,"end":6069.84,"speaker":"Fr Andrew Stephen Damick","text":"And you're the one through whom all of this is really happening."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6070.48,"end":6102.19,"speaker":"Fr Stephen De Young","text":"Right, Right. In the first place. But Christ says that he's going to do it to fulfill all righteousness. And so we see that there's another sort of inversion happening here that Christ, when it comes to. And again, we're going back to this sort of uncleanness category and this wholeness category. When Christ goes and touches a leper, he doesn't become unclean. The leper becomes clean."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6102.83,"end":6103.51,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6103.51,"end":6109.44,"speaker":"Fr Stephen De Young","text":"The leper is healed. When he touches a dead body, he doesn't become unclean. The dead body comes back to life."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6110.08,"end":6120.56,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right. Because uncleanness is about your relationship to God. It's about your ability to approach God. And he is God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6121.2,"end":6122.48,"speaker":"Fr Stephen De Young","text":"God approaching them."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6122.88,"end":6128.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He cannot become unclean because he's the goal of cleanliness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6129.28,"end":6140.59,"speaker":"Fr Stephen De Young","text":"Right, right. And so when Christ goes into the waters, Right. The waters don't make him clean. He makes the waters clean."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6140.83,"end":6141.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6142.27,"end":6182.64,"speaker":"Fr Stephen De Young","text":"And all the language. And again, like I said, we'll just do this briefly because we've talked about this on the show before. The waters are purified. All the language in the Feast of Theophany that we use about the waters being purified, the dragons there being crushed. Right. The spiritual powers of the waters. This is the. The. And all of the new creation language. Right. The eighth day, new creation language, the waters being cut off. Right. All of that language that we've been talking about tonight gets attached to sort of Christ's baptism as the beginning."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6183.12,"end":6183.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6184.49,"end":6188.65,"speaker":"Fr Stephen De Young","text":"Right. And so this also."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6189.85,"end":6190.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6190.57,"end":6235.8,"speaker":"Fr Stephen De Young","text":"This also is deeply connected to why St. John is doing this in the Jordan and calling a people out there out of the sinful world. Right. Is that Christ's name? Even though it drives me bonkers when people pronounce it the Hebrew way. Right. Gotta admit, people get mad at me when I say it. Right. The people who say Yeshua ha mashiach and stuff. It's like, bob, your grandfather's Norwegian. What are you doing? But Christ does have the same name. The name Jesus is the Latin version of Joshua."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6236.04,"end":6238.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The Latin version of the Greek version."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6239.08,"end":6244.86,"speaker":"Fr Stephen De Young","text":"Yes. Well, anything in Latin is stolen from the Greeks."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6246.86,"end":6247.82,"speaker":"Fr Andrew Stephen Damick","text":"Often. True."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6249.58,"end":6273.72,"speaker":"Fr Stephen De Young","text":"But the name Joshua. Right. And of course, when Joshua leads the people into the land, they do it through the Jordan, and the Jordan parts in front of them. Insert all the language about the Jordan turning back, which is lifted directly from Joshua in our celebration of the feast of Christ's baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6274.28,"end":6274.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6277.48,"end":6289.64,"speaker":"Fr Stephen De Young","text":"And so what Christ is enacting there at the jorn with St. John as he takes this group of people, this faithful remnant that St. John has gathered, is a sort of reconquest."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6291.56,"end":6293.16,"speaker":"Fr Andrew Stephen Damick","text":"Like the entrance into Canaan again."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6293.56,"end":6331.18,"speaker":"Fr Stephen De Young","text":"Right. The land has become like it was. Right. Because the leaders, the authorities have become corrupt. Right. Herod is like Pharaoh. He's going around killing innocent children. Right. This is. And so this reconquest has to happen. And as we talked about the understanding at the time, we have all these exorcisms in the Synoptic Gospels because they viewed those spirits as being the spirits of dead giants. Meaning they're the same beings who Joshua was driving out of the land."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6331.5,"end":6338.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so this is the new literally. Literally the new Joshua, who literally has the same name."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6339.34,"end":6363.74,"speaker":"Fr Stephen De Young","text":"Right, right. Who is now beginning this reconquest and the re. Sanctification of. Of the land by, again, this imagery of Christ sanctifying himself in order to pass that holiness on to the rest of us through our baptisms."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6363.82,"end":6395.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I don't think we can underline enough the significance of the place. Right. That this is the Jordan, that these same events that they continually celebrate. Right. In their liturgical life, that they hear in the Scriptures. Scriptures. This is where John is doing what he's doing, you know, as if to say, hey, it's all happening again, although it's really happening in the fullest possible way now, this time, this is the fulfillment of what Joshua was doing, ultimately."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6395.33,"end":6514.35,"speaker":"Fr Stephen De Young","text":"Right. And that fulfillment is right. Part of what's going on, that the story, in a lot of ways of the Old Testament, and Christians have traditionally read it as a story that's leading up to Christ. Right. Obviously, Jewish folks, not necessarily right, but we read it as a story later to Christ. Part of it is the story of God creating and then sanctifying this remnant of the people to prepare for the coming of the Messiah, the coming of Christ. And part of doing that is that throughout the history that we see unfold in the Old Testament is that these patterns are being elaborated, these rituals are being begun. These different things are created in order that when Christ comes, those who have been faithful to what was established will recognize him, will be able to understand him. Right. So when we talk about fulfillment, right. Like when we talked about atonement and we were talking about the day of atonement and connecting that to Christ, right. We're really asserting that the purpose of that day of atonement ritual and participating in it annually was so that when Christ offered himself as a sacrifice for the life of the world and for its salvation, the people would be able to understand what was happening. Because imagine if we didn't have that. Imagine if we didn't have the Old Testament for a second and Christ had just come and done miracles and healed people and then been crucified and then risen from the dead and ascended into heaven."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6516.36,"end":6525.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. It would. It would just be contextless actions. You know, that would be impressive. You know, but what would. We've been visited by a God."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6527.24,"end":6568.38,"speaker":"Fr Stephen De Young","text":"What would we do going forward to participate in that and celebrate that? How would we comprehend that? How would we find a way into that? Right. We couldn't. We couldn't. Right. And so that is when we talk about patterns in the Old Testament being filled up to overflowing in the New Testament, that's not a handy dodge or a weird principle or just, you know, symbolism happens or whatever. Right. We're talking about a sort of a concrete thing of God preparing people to be able to understand what he did in Christ and is doing in Christ. Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6569.03,"end":6578.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, we're going to go ahead and take our second break, and when we come back, we're going to talk about what it means for us to be baptized. So we'll be right back."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6578.71,"end":6595.03,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6601.83,"end":6603.03,"speaker":"Fr Andrew Stephen Damick","text":"I'm Joel Miller."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6603.59,"end":6605.03,"speaker":"Fr Stephen De Young","text":"And I'm Jamie Bennett."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6607.03,"end":6613.75,"speaker":"Fr Andrew Stephen Damick","text":"It's one of the last books of the Old Testament in terms of when it was written. And yet part of it is written in the style of the great King."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6613.75,"end":6632.72,"speaker":"Fr Stephen De Young","text":"Solomon, who is renowned for his love of wisdom. The church fathers loved this book. Jerome quoted it more than 80 times, and Augustine quoted it almost 800 times. The reason is actually pretty clear. Life in this world is a mystery."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6633.2,"end":6633.76,"speaker":"Announcer","text":"Worst."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6633.92,"end":6651.83,"speaker":"Fr Stephen De Young","text":"It's also tough. And because life in this world is tough, a book like the Wisdom of Solomon, which is the book we're talking about, helps explain what, what we're going through, why we're going through it, and also who we're going through it with."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6653.91,"end":6665.87,"speaker":"Fr Andrew Stephen Damick","text":"That's right. On our podcast, Bad Books of the Bible, we're talking about the Wisdom of Solomon this season. It's basically a Bible study on a podcast. Taking it a couple Chapters at a."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6665.87,"end":6668.31,"speaker":"Fr Stephen De Young","text":"Time, right here on Ancient Faith Radio."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6668.95,"end":6685.09,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6686.61,"end":6691.57,"speaker":"Fr Andrew Stephen Damick","text":"You know, hearing that ad makes me think that you should do a Bible study podcast. Father Stephen. Have you thought about it?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6692.93,"end":6710.06,"speaker":"Fr Stephen De Young","text":"Yeah. Believe it or not, last night. Last night, less than 24 hours ago, I finished my first pass through the whole Bible. You did it in real time 12 and a half years later."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6711.02,"end":6711.5,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6711.9,"end":6713.42,"speaker":"Fr Stephen De Young","text":"From Genesee to Revelation."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6716.94,"end":6724.14,"speaker":"Fr Andrew Stephen Damick","text":"Man, I could hear John Goodman saying that. Yeah, well, congratulations."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6724.7,"end":6732.75,"speaker":"Fr Stephen De Young","text":"Yeah. So now I gotta start over with Genesis because we didn't record Genesis last time, which is actually good because it would have been terrible back when you."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6732.75,"end":6733.79,"speaker":"Fr Andrew Stephen Damick","text":"Were still in your 30s."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6734.19,"end":6740.27,"speaker":"Fr Stephen De Young","text":"I would have. I would have pulled it down anyway. I didn't know anything 12 and a half years ago, but."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6740.35,"end":6746.35,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Yeah. I mean, on the podcast, for whole counsel of God, in terms of what's being released, it just started first, John."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6747.15,"end":6747.63,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6747.71,"end":6753.51,"speaker":"Fr Andrew Stephen Damick","text":"So I think we're, you know, maybe two or three months behind, I think, on the podcast."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6753.83,"end":6756.07,"speaker":"Fr Stephen De Young","text":"Probably. Yeah. Revelation took a minute."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6756.55,"end":6760.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'll bet you just tell everybody. Read St. Andrew of Caesarea."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6761.75,"end":6770.31,"speaker":"Fr Stephen De Young","text":"Basically. Yeah, you can just. Well, it's very disappointing because there's nothing about China in there, actually, or Moscow or."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6770.63,"end":6773.79,"speaker":"Fr Andrew Stephen Damick","text":"Or America's place in biblical prophecy stuff."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6773.79,"end":6779.11,"speaker":"Fr Stephen De Young","text":"Yeah, well, that actually is in there, but not in a way that anybody's going to like."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6781.97,"end":6783.97,"speaker":"Fr Andrew Stephen Damick","text":"Is that when Leviathan comes up out of the water?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6784.69,"end":6794.21,"speaker":"Fr Stephen De Young","text":"No, that's more like Babylon. That nice young lady drunk on the blood of the saints."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6795.97,"end":6825.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's exciting. All right, well, we're back. Feel free to give us a call. We will still take your calls. Now we're talking about Christian baptism. So first we talked about circumcision, and then in the second half we talked about the baptism of John, the forerunner in Baptist, and now we're talking about Christian baptism. So true to form. Right. You know, the thing that our episode is about, we finally get to it in the third half."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6826.18,"end":6835.9,"speaker":"Fr Stephen De Young","text":"Yeah. And that was circumcision in general, not Christian circumcision, because that's. You'd be hard pressed to find a Christian Moil. I think think it's true."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6836.86,"end":6838.14,"speaker":"Fr Andrew Stephen Damick","text":"Of course, now that I'm thinking I."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6838.14,"end":6838.78,"speaker":"Fr Stephen De Young","text":"Don'T know of any."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6839.18,"end":6840.86,"speaker":"Fr Andrew Stephen Damick","text":"That probably is a thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6842.3,"end":6851.98,"speaker":"Fr Stephen De Young","text":"Okay, now we need to find out if you're listening to this and you are a Christian Moyle. Email fatherandrewshanfaith.com."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6853.9,"end":6862.67,"speaker":"Fr Andrew Stephen Damick","text":"I'm googling Kristen Moyle right now. Yeah, Anyway, so."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6863.47,"end":6873.79,"speaker":"Fr Stephen De Young","text":"But yes, now we're talking about Christian baptism per se, because as usual, it is in our third half when we get to our actual topic."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6873.87,"end":6874.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6877.71,"end":6931.89,"speaker":"Fr Stephen De Young","text":"So at the core, as we've already seen, right. Like in St. Paul's writings about us being buried with Christ in baptism. Right. Dying with Christ in baptism, rising again to new life, that if we want to talk about what baptism is doing. Right, then at a very basic level, baptism is about a movement from death to life through water. And because of that, as we were just saying at the end of the second half, the apostles in the New Testament are going to look at these patterns that are established in the Old Testament as ways of understanding what's now going on in baptism into Christ."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6932.77,"end":6933.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6933.81,"end":6985.28,"speaker":"Fr Stephen De Young","text":"And so one of these that we talked about at length in one of our Pascha episodes has to do with the crossing of the Red Sea or the Sea of Reeds. Right. With Moses. And we talked about how the Sea of reeds in Egyptian stories was something that had to be crossed in order to get to the afterlife, and that they would offer sort of incantations and various ritual offerings to get the gods to sort of bring them across the Sea of reeds safely into the afterlife. There was the possibility of becoming entangled in the reeds and becoming one of the drowned ones, which was essentially their name for the damned."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6985.52,"end":6986.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":6987.2,"end":7041.28,"speaker":"Fr Stephen De Young","text":"And so both in the way the story is narrated in Exodus, but then especially the way it's Described in Exodus 15 in the song of the Sea, it is directly connected to these traditions and these stories. So this isn't right. Like, we're going to quote St. Paul in First Corinthians here in a minute. Who makes this comparison? St. Paul's just not coming up with an allegory or an analogy. He's definitely not saying the original thing didn't happen. Right, Right. But he's. He's reading what happened there in terms of what it originally meant, that this was for the Israelites a passage from death to life through water, that they were passing through the realm of death safely, unlike the Egyptians, who ended up being the drowned ones."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7041.52,"end":7043.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7043.44,"end":7059.06,"speaker":"Fr Stephen De Young","text":"And they were being. Right. Delivered in this. In this real sense. So the most prominent place where St. Paul refers to this, at least the most explicit 1, is in First Corinthians 10, right at the beginning of the chapter."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7059.06,"end":7078.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So verses one and two, for I do not want you to be Unaware, brothers, that our fathers were all under the cloud, and all passed through the sea, and all were baptized into Moses in the cloud and in the sea. Probably the phrase that's maybe weird to people is being baptized into Moses."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7079.3,"end":7079.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7081.78,"end":7087.47,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what? Yeah, like, I don't know. I don't know what's going on in the Greek there, but, you know, like."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7087.47,"end":7090.39,"speaker":"Fr Stephen De Young","text":"Wait, that's a pretty straightforward translation."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7090.71,"end":7093.59,"speaker":"Fr Andrew Stephen Damick","text":"Christ baptized into Moses."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7095.75,"end":7098.15,"speaker":"Fr Stephen De Young","text":"So St. Paul says many things that are hard to understand."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7099.11,"end":7101.27,"speaker":"Fr Andrew Stephen Damick","text":"I've heard that. Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7103.67,"end":7145.66,"speaker":"Fr Stephen De Young","text":"So we'll put a pin in the cloud part for now. The future Chrismation episode. Yeah, but the C part obviously is a little more clear. Right. So this baptized into. Into Moses part has to do with the way this is seen as sort of one event. Right. So the Passover, the Exodus out of Egypt and then coming to Mount Sinai and the receiving of the. Of the Torah are intimately connected."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7146.3,"end":7147.5,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7148.06,"end":7219.3,"speaker":"Fr Stephen De Young","text":"And this is similar to the way in which, for us as. As Orthodox Christians, and I think for most Christians who have any kind of, like, liturgical sense, the way that. That Pascha, that Easter, that Christ's resurrection and Pentecost. Right. Because remember, Pentecost originally was the giving of the Torah, the giving of the law. Right. The way those two events are sort of connected, right. They move together on the calendar. Right. They represent sort of their own cycle, right. Over against the fixed feasts, and they sort of form this. This unit together. So it was in the same way. Right. And as we. As we saw when we were. We were taking things St. Paul said about circumcision and baptism, he sees baptism is then immediately connected to faithfulness in the same way that circumcision going all the way back to Abraham, was immediately connected to faithfulness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7219.3,"end":7220.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7220.02,"end":7247.96,"speaker":"Fr Stephen De Young","text":"You're to circumcise and walk before me and be righteous. Right. And so he's connecting those who are baptized in the cloud and the sea. Right. To those who are then called to keep the Torah when it is given. And Moses is used there because Moses is sort of the mediator of that covenant to the people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7248.36,"end":7251.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's the instrument by which it's happening. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7252.4,"end":7289.26,"speaker":"Fr Stephen De Young","text":"So this is effectively about them being baptized into the Torah. Yeah, right. That this event establishes now this relationship. Right. And that's why in First Corinthians 10, if you go on past verse two, where we read St. Paul, the reason he starts this with, I do not want you to be unaware, brother. I'm reminding you guys that after that happened, those who were faithless died in the wilderness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7290.62,"end":7291.98,"speaker":"Fr Andrew Stephen Damick","text":"They were left behind."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7292.78,"end":7326.83,"speaker":"Fr Stephen De Young","text":"Right. And so he's saying to them, yes, you are all baptized into Christ, but if that does now, not now, become a life of faithfulness. Right. Then that baptism by itself isn't going to do you any more good than it did those who died in the wilderness in disobedience. Right. And so remember, the Torah contained both blessings and curses."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7327.07,"end":7327.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7327.79,"end":7341.08,"speaker":"Fr Stephen De Young","text":"Of that, of the covenant. Right. So baptism is the beginning. Right. In that sense of that, that life of faithfulness."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7341.48,"end":7344.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a new life, not just a badge."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7345.32,"end":7347.4,"speaker":"Fr Stephen De Young","text":"Right, right. Or a status."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7347.72,"end":7348.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7354.12,"end":7371.51,"speaker":"Fr Stephen De Young","text":"So the other, the other major sort of Old Testament pattern that gets brought forward as a way to help understand Christian baptism, and now we're going to go with St. Peter is the flood of Noah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7372.07,"end":7373.67,"speaker":"Fr Andrew Stephen Damick","text":"And that's because it's about water, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7374.15,"end":7375.67,"speaker":"Fr Stephen De Young","text":"Yes, that's it. That's the only."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7376.47,"end":7377.75,"speaker":"Fr Andrew Stephen Damick","text":"That's all there is to it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7378.15,"end":7381.39,"speaker":"Fr Stephen De Young","text":"So that means that anything with water in it, that's about baptism."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7381.39,"end":7384.39,"speaker":"Fr Andrew Stephen Damick","text":"Now all the people who died in the flood are being baptized."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7384.71,"end":7396.87,"speaker":"Fr Stephen De Young","text":"Anytime you see a stick of wood in the Old Testament, that's the cross, as Nietzsche joked. But no, that's not what we're saying."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7396.87,"end":7397.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7398.47,"end":7402.03,"speaker":"Fr Stephen De Young","text":"St. Peter is going to make a much more involved connection than that."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7402.03,"end":7461.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay, so, and this is actually the passage where we get the title for our episode tonight. So first Peter, chapter three, verses 18 through 22. For Christ also suffered once for sins the righteous, for the unrighteous, that he might bring us to God, being put to death in the flesh, but made alive in the spirit in which he went and proclaimed to the spirits in prison, because they formerly did not obey when God's patience waited in the days of Noah while the ark was being prepared, in which a few, that is eight persons, were brought safely through water. Baptism, which corresponds to this now saves you not as a removal of dirt from the body, but as an appeal to God for a good conscience through the resurrection of Jesus Christ, who has gone into heaven and is at the right hand of God with angels, authorities and powers having been subjected to him. There's a lot going on in that passage."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7461.68,"end":7466.08,"speaker":"Fr Stephen De Young","text":"Yeah. But I think it's pretty self explanatory, not difficult, like Satan."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7466.08,"end":7469.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay, good night, everybody. So."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7472.99,"end":7492.75,"speaker":"Fr Stephen De Young","text":"Right, so we're focusing, of course, on this baptism element, but it's important that we see that St. Peter has this whole narration before he says baptism, which corresponds to this."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7492.99,"end":7494.27,"speaker":"Fr Andrew Stephen Damick","text":"To this. Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7495,"end":7523.89,"speaker":"Fr Stephen De Young","text":"Right. So it's not just the last word of verse 20 is water and then 21, baptism, which corresponds to this corresponds to water. See? Water. Right. That's not what he's doing. Right. So he is telling the story of Christ's descent into Hades. Right. And in that descent into Hades. I know we've talked about this on the show before, but it's been a while."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7523.97,"end":7525.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7525.57,"end":7556.3,"speaker":"Fr Stephen De Young","text":"In that descent into Hades, he confronts these spirits who are imprisoned there. Right. And makes this proclamation to them. And we've talked about how this mirrors in the book of Enoch, Enoch's descent to the imprisoned watchers. Right. Where they kind of ask Enoch to help get them off the hook, not because they're actually repentant, but just they don't like being imprisoned. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7556.54,"end":7557.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7557.26,"end":7595.67,"speaker":"Fr Stephen De Young","text":"So they say, hey, can you make it? You know, God likes you, Enoch. You're a righteous man. Can you make an appeal for us, Right. To God? And so Enoch, being a good guy, does. And God sends Enoch back to tell them, nope. Right. You guys are staying here until. Until the end of days, when you'll get thrown into the lake of fire. Right. So you have that to look forward to. But this is the same kind of thing here. Right. Because which spirits are these who Christ makes the proclamation to? It's the spirit of the. The disobedient of the days of Noah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7596.71,"end":7599.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Though these are dead giants."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7599.71,"end":7658.44,"speaker":"Fr Stephen De Young","text":"Yes. These are Nephilim. These are watchers. Right. This is directly what St. Peter is referring to. And in second Peter, he. He refers to the Book of Enoch even more obviously than this. But so it's those particular spirits, right. That he makes this proclamation to of their doom. Right. And then. Right. Noah was sort of saved out of that world through water. Right. So notice after he says baptism, which corresponds to this, meaning, all of that, that whole narrative. Right. He ends the passage we read by talking about Christ having ascended into heaven with the angels, authorities, and powers subjected to him."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7659.08,"end":7659.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7660.44,"end":7674.76,"speaker":"Fr Stephen De Young","text":"So angelic beings are still closely in view. Right. In what. What St. Peter is talking about. So when we come to the baptism now saves you. Right. The correct question to ask is saved from what?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7675.8,"end":7676.44,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7678.35,"end":7678.55,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7678.55,"end":7684.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the. The frame here is definitely evil spirits and good spirits."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7684.99,"end":7692.43,"speaker":"Fr Stephen De Young","text":"Right? Right. And so what was Noah saved from? Noah was saved from those people."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7692.43,"end":7692.83,"speaker":"Fr Andrew Stephen Damick","text":"Who."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7693.07,"end":7700.91,"speaker":"Fr Stephen De Young","text":"Those people. Those beings. Those spiritual beings. Evil spiritual beings to whom Christ proclaimed their doom when he passed through the underworld."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7701.15,"end":7705,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which just underlines once again, that the gospel isn't good news for everybody."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7706.28,"end":7763.14,"speaker":"Fr Stephen De Young","text":"So Christ passes from death to life. Noah passes from this world of evil through water to life. Right. And now we also are saved from the powers of Evil Right. Through baptism and is then the beginning of. Just as after baptism, after he mentions baptism, Christ's story continues with his ascent into heaven and his enthronement. Baptism also for us is the beginning of our life of theosis, our life of becoming like Christ, being conformed to his image, which culminates in the enthronement of humanity. Right. Because as Hebrews says, it is not to angels that God has subjected the world to come."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7764.34,"end":7768.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, see also every reference to thrones and plural we've ever made."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7768.7,"end":7769.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7769.94,"end":7788.8,"speaker":"Fr Andrew Stephen Damick","text":"See also, you know, one of my favorite verses to quote, that we become equal to the angels, Luke 20:36. I mean, this is just everywhere, all this theosis language all over the scripture in terms of being enthroned with Christ and being stewards of the life of the world to come."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7789.76,"end":7795.2,"speaker":"Fr Stephen De Young","text":"Right. And so there is contained then within baptism this element of spiritual warfare."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7796.48,"end":7797.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7797.12,"end":7812.19,"speaker":"Fr Stephen De Young","text":"This idea of entering into a declaration of war against the evil spiritual powers. This is why, in Orthodox tradition, we spit on the devil. On. At. With the devil. Sorry, that was a Lutheran joke."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7814.35,"end":7818.43,"speaker":"Fr Andrew Stephen Damick","text":"In, with and under. Sorry."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7821.87,"end":7831.79,"speaker":"Fr Stephen De Young","text":"At the devil. Right. There is this element of when someone comes to be baptized, they are now entering into spiritual warfare."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7832.67,"end":7877.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which, I mean, it's underlined very much. For instance, the beginning of baptism in Greek is called the apotaxis and the syndaxis, which means basically, you know, coming away from the ordering in which you were and now being reordered along with Christ. You know, the idea is you're leaving behind the devil and his hosts and joining the Lord of hosts himself. I mean, it's. It's. I. I'm. I think that those are actually military terms. I'm not sure. But it often, of course, it's described as, you know, in sermons about it as being enlisted with Christ and. And all that kind of thing."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7878.31,"end":7880.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7881.75,"end":7882.15,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7886,"end":7888.4,"speaker":"Fr Stephen De Young","text":"A couple things before we end the episode."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7889.28,"end":7889.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7890.88,"end":7939.16,"speaker":"Fr Stephen De Young","text":"Related to baptism. First, another what baptism is not. And this stems from. This is also something that St. Paul addresses to the church in Corinth. Right. That baptism into Moses. Right. Mediator. There was a confusion, apparently, in the Corinthian church that was leading to some bad results in terms of how they viewed baptism and what baptism was doing. That's related to both of the things we just talked about, not just the idea of being baptized into Moses, but also the idea of sort of, you're now on this team in this fight."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7939.72,"end":7940.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7940.44,"end":7944.04,"speaker":"Fr Stephen De Young","text":"Right. And exactly how those teams are designated."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":7944.6,"end":8009.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, you know, this. We're just continuing on in first. Yeah, sorry, yeah. First Corinthians, chapter one. Yeah, yeah, this is earlier. Sorry. Chapter one, verses 10 through 17. And you'll recognize this, everybody. I appeal to you, brothers, by the name of our Lord Jesus Christ, that all of you agree and that there be no divisions among you, but that you be united in the same mind and in the same judgment. For it has been reported to me by Chloe's people that there is quarreling among you, my brothers. What I mean is that each one of you says, I follow Paul, or I follow Apollos, or I follow Cephas, or I follow Christ. Is Christ divided? Was Paul crucified for you, or were you baptized in the name of Paul? I thank God that I baptized none of you except Crispus and Gaius, so that no one may say that you were baptized in my. My name. I did baptize also the household of Stephanus. Beyond that, I do not know whether I baptized anyone else. For Christ did not send me to baptize, but to preach the gospel, and not with words of eloquent wisdom, lest the cross of Christ be emptied of its power."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8011.78,"end":8033.07,"speaker":"Fr Stephen De Young","text":"One of the reasons I really like this passage is that you can tell how close it is to St. Paul's dictation, right? Because he's literally like, boy, I'm glad I didn't baptize anybody except this guy and this guy. Well, okay, there was also that guy, right? Maybe this other. Okay, I don't know if I baptized anybody else. But anyway, you get my point, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8034.99,"end":8056.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, and he's. You know, this is a straightforward sense here, which he's saying, like, there's not sects within the church. There's not. I mean, we can have schools of thought on some level, but it shouldn't be teams, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8056.37,"end":8063.73,"speaker":"Fr Stephen De Young","text":"And Christ is the mediator, right, between God and man."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8064.37,"end":8083.98,"speaker":"Fr Andrew Stephen Damick","text":"Our loyalty is to Christ, not to any human teacher or leader or, you know, whether they have a high and exalted ecclesiastical position or a gigantic following on the Internets. You know, our loyalty is not to any of them as Christians."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8084.54,"end":8113.32,"speaker":"Fr Stephen De Young","text":"Right. And this is what St. Paul's getting at. I mean, it may sound weird at first when he says, for Christ did not send me to baptize, but to preach the gospel. Because your brain might go to Matthew 28, right, in the Great Commission, where Christ says, go make disciples of all nations, baptizing them. Right. Kind of sounds like he's sending the apostles to baptize, right? Yeah, but that's not what St. Paul's getting at. What he's getting at is that he wasn't sent out to make Paulians."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8114.12,"end":8114.6,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8114.6,"end":8141.61,"speaker":"Fr Stephen De Young","text":"Following Paul, he wasn't sent out. You know, Christianity and evangelism is not like Amway. Just to clarify, I'm not saying anything negative about Amway. It's just not like vaguely suggesting that if one were to diagram the structure of the organization on a piece of paper, it would be very narrow at the top and wide at the bottom. That's all I'm saying."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8144.33,"end":8146.53,"speaker":"Fr Andrew Stephen Damick","text":"That's like some shape we might have heard of before. I don't know."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8146.53,"end":8163.23,"speaker":"Fr Stephen De Young","text":"Send your emails to father andrew@ancientfaith.com and legal something that's not a real email address could go through him. But that's not. Right. That's not what it's about. It was not making followers for himself."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8163.71,"end":8164.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8164.99,"end":8167.07,"speaker":"Fr Stephen De Young","text":"But to preach the Gospel, which is about Christ."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8167.39,"end":8199.08,"speaker":"Fr Andrew Stephen Damick","text":"About Christ, yeah. Unfortunately, that's, you know, sadly, that's a thing amongst people who call themselves Christians and, you know, like, I don't think I've really seen this, but I hope that no one ever out there is like, well, I'm a lord of spirits, listener. And like, you know, like, you know, that's not a thing, people. That's not a thing. It's not what this is about. We're pointing you to Christ or pointing you to life in parishes. It's not about which team you're on or who you follow on. Whatever."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8199.64,"end":8205.2,"speaker":"Fr Stephen De Young","text":"Well, this is part of what was behind my stop simping rant a few episodes ago."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8205.76,"end":8206.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8208,"end":8252.39,"speaker":"Fr Stephen De Young","text":"And this is the real. It's not just that, like, oh, some. I hear somebody say they're a Father Stephen DeYoung Fan and I'm uncomfortable with it. I mean, I am, but that's not right. That's not what I'm getting at. The place where this rubber meets the road, and this happens all the time in the life of the Orthodox Church and pretty much all other Christian communities and non Christian communities, is people get put in this position of leadership or prominence or whatever it is, and people don't even realize they're doing it. They're starting to put their loyalty and their trust in those people. And the rubber meets the road. When those people let you down."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8253.36,"end":8253.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8254.08,"end":8255.84,"speaker":"Fr Stephen De Young","text":"When. When those people mess up."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8256.56,"end":8257.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8258.24,"end":8278.88,"speaker":"Fr Stephen De Young","text":"This is why I don't want simps. This is why I don't want people being like, I'm a Father Steven DeYoung fan. Because I will let you down. I will mess up. Right. Eventually I'll succeed at getting myself Canceled. Right. Eventually I will say something that offends you, right? Like maybe you thought I was great, and now I just took a shot at Amway for no reason."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8279.51,"end":8279.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8280.07,"end":8292.31,"speaker":"Fr Stephen De Young","text":"Right. But whatever it is, eventually it'll happen. And I don't want that to cause you to leave the Orthodox Church. I don't want that to drive you away from Christ. That's why I don't want it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8292.55,"end":8375.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's a flip side to this, too, which is that people who attach themselves to some figure in loyalty then are incapable of noticing when they do mess up. You know, they. They end up making excuses for all kinds of bad behavior. And then a kind of another flip side of it is like, well, when you see someone do mess up, then you kind of denounce their Christianity entirely. You know, like, well, he's just one of the bad ones because he did this one thing or said this one thing or whatever it might be. Because all of this is to absolutize individual people when it's Christ who is the absolute. And so then we can. If we have Christ as our absolute, then we can say, this is a good action or a good word. This is a bad action or a bad word, because it's all judged by Christ and not by which team you're on. It's such a toxic way to be. And we all do this, right? We all do it. Whether it's teachers in the church or on the Internet or politics. This happens all the time. I'm on this person's team or I'm this person's friend. And so therefore. Or I'm not on their team, not their friend, so everything they do is bad. That just shows that we need to reorient ourselves towards Christ whenever we behave that way. And we all do it, so let's all repent, you know?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8375.35,"end":8398.84,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. I hope that within my deluge of content I pour out continuously, there are things that are helpful to people. Right. But those are things that will be found amidst that content. That's not me as a person. Me as a person. Father Stephen DeYoung. I will become a stumbling block for you eventually."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8399.24,"end":8399.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8400.12,"end":8401.8,"speaker":"Fr Stephen De Young","text":"I'm not a very good person."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8403.96,"end":8404.24,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8404.24,"end":8416.69,"speaker":"Fr Stephen De Young","text":"Just accept that now. Right. But because God was able to speak through Balaam's ass, hopefully some good things for you will come out of me."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8417.25,"end":8429.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so, you know, the point here is that baptism does not make people. Do not put people into a sect. It's into Christ, who is the savior of the world."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8430.29,"end":8430.85,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8431.41,"end":8431.97,"speaker":"Fr Andrew Stephen Damick","text":"You know?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8432.37,"end":8432.93,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8434.85,"end":8435.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8435.25,"end":8456.62,"speaker":"Fr Stephen De Young","text":"And so sort of A summary of what we've been talking about now. Right. Because ritual does something. Right. It doesn't represent something. It's not a performance for you to view of something. It's not giving you food for thought. It's actually doing something. What does baptism do in summary?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8457.1,"end":8457.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8457.74,"end":8464.06,"speaker":"Fr Stephen De Young","text":"All the kind of concepts we've been talking about. Baptism removes a person from the world."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8465.4,"end":8472.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we should emphasize it's the sense of the world that we were talking about earlier. You know, the sort of the world system of evil and darkness and demons."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8473.16,"end":8473.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8473.72,"end":8475,"speaker":"Fr Andrew Stephen Damick","text":"Not the creation."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8475.56,"end":8478.36,"speaker":"Fr Stephen De Young","text":"Right, right. The world, the flesh and the devil. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8478.36,"end":8479.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That sense of world."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8480.2,"end":8554.56,"speaker":"Fr Stephen De Young","text":"Right. The source of sin. Right. Separated from that and therefore by that separation made holy, sanctified. Right. It is, as we were just saying, a declaration of spiritual warfare. It is the death of the person who went into the water and the new life of the person who comes out. The beginning of the life of the one who comes out. I tell people when I receive them into the church, whether it's baptism or Chrismation, however it happens, that there is no reason why the day after they've been baptized, they have to be the same person they were the day before. Anything they want to leave behind, they can leave in the water and start over. It is the beginning of membership in the family of God, the big extended family that includes all of us. And it makes us co heirs in Christ, meaning all of the promises of Christ he shares with us when we're baptized into Christ."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8555.2,"end":8555.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8555.92,"end":8578.79,"speaker":"Fr Stephen De Young","text":"Right. As we talked about all of these things. Right. And there's nary a one of them that infants don't need. Going back to that question at the beginning of the second half. Right. So after that summary, I feel we must include this brief appendix. Okay. About baptism for the dead."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8579.99,"end":8583.19,"speaker":"Fr Andrew Stephen Damick","text":"Baptism for the dead. Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8583.91,"end":8591.91,"speaker":"Fr Stephen De Young","text":"And of course, we're referring to what St. Paul refers to in First Corinthians 15 as part of his argument about the resurrection."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8592.31,"end":8596.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is a completely non controversial and totally clear verse."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8596.55,"end":8597.03,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8597.35,"end":8606.43,"speaker":"Fr Andrew Stephen Damick","text":"He says otherwise. What do people mean by being baptized on behalf of the. The dead? If the dead are not raised at all, why are people baptized on their behalf?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8608.99,"end":8622.67,"speaker":"Fr Stephen De Young","text":"St. Paul sometimes says things that are hard to understand. Right. So to give this a little context. Right. That chapter 15 of 1 Corinthians is really all about the resurrection of the dead."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8622.99,"end":8623.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8623.63,"end":8654.46,"speaker":"Fr Stephen De Young","text":"Right. And why is this something that St. Paul has to address? Well, as we were saying in the first half, the Christian community in Corinth has two types of folks. There's. There's Christians from a Jewish background. There's. There's Christians from a pagan gentile background. And for the. The pagans, the idea of the bodily resurrection was kind of ludicrous."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8654.86,"end":8655.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8656.06,"end":8790.78,"speaker":"Fr Stephen De Young","text":"I mean, literally, this is what happens at athens in Acts 17 with. With St. Paul. Like everybody's kind of vibing with him until he brings up the bodily resurrection, then they all laugh at him because that's just ridiculous. Why would you want that? Why would you want to be in a body? Again, right? On the side of Jewish Christians, while there were, like, for example, the Pharisees, there were prominent groups within Second Temple Judaism that believed in the bodily resurrection. There were also some that did not. Right. The Sadducees did not. Other groups didn't, or had different ideas about what an afterlife might look like that didn't include a bodily resurrection per se. So a subset of those Jewish Christians would be familiar with the idea of bodily resurrection, but not all of them necessarily. And so St. Paul, in this lengthy chapter, sets out trying to argue for it, right? And he argues for it on all number of bounds, right? Like if you deny physical resurrection, then you're saying Christ wasn't physically raised from the dead body. And then here's all the things that would result from that being the case. He goes at it from different angles. And so the verse you just read, 1529, is one of his many arguments that he has lined up where he refers to this practice that the community in Corinth at least is familiar with, that there were people who were being, as it's translated, their baptism on behalf of the dead. The Greek preposition there that translates on behalf of Greek prepositions are pretty flexible. This one can mean on behalf of it. Really the core of it is for the benefit of. Right. And so it's not that on behalf of is wrong. That's one way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8791.5,"end":8791.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8791.82,"end":8830.24,"speaker":"Fr Stephen De Young","text":"It could be used, but not the only way. Right. All we know is that the baptism of these people is somehow benefiting the dead or is somehow connected in a positive way from what they're doing to the dead in that direction. And then he follows that with if the dead are not raised, are all, why are people baptized on their behalf? So whatever this practice means, right. It would make no sense if the resurrection isn't real."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8830.8,"end":8831.2,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8831.52,"end":8843.76,"speaker":"Fr Stephen De Young","text":"Right. So to understand this, and I know I've talked about this distinction on the show before, but St. Paul is very particular about when he uses dead in the plural."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8844.15,"end":8844.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8844.31,"end":8900.43,"speaker":"Fr Stephen De Young","text":"Nakri. And when he puts the article in front of it. So in English, we would portray that as dead versus the dead. Right. When St. Paul uses it without the article, just dead, the plural, he means all the dead people, Right? Just dead people in general. Right. When, when he uses the article, which we would translate as the dead, the article in Greek is really still kind of functioning partially as a demonstrative pronoun. So you could sort of over translate it as these dead. Idea being he's referring to a specific group of dead people, not just to dead people in general. That's what the article does, right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8900.43,"end":8902.43,"speaker":"Fr Andrew Stephen Damick","text":"Makes it those dead."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8902.75,"end":8917.15,"speaker":"Fr Stephen De Young","text":"Right. So if you track when St. Paul uses it with and without the article, what you find is when he uses it with the article to refer to a specific group of dead. He's referring to dead Christians."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8918.27,"end":8918.71,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8918.71,"end":8973.26,"speaker":"Fr Stephen De Young","text":"He's referring to the dead faithful or the dead of the Old Covenant, the righteous dead of the old Covenant, but it's always sort of that category of the righteous dead. Right. So this isn't people being baptized on behalf of dead people in general, it's people being baptized on behalf of these righteous dead. Right. And, and dead Christians. Right. So that means it can't mean what our Mormon friends would want it to mean. Right? Because the, the Latter Day Saints practice is that people who are members of the the LDS are baptized for someone who wasn't with the idea that that makes them now baptized."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8973.58,"end":8982.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why they're super duper into genealogy to try to retroactively include all of their dead relatives in the LDS Church."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":8982.64,"end":9076.75,"speaker":"Fr Stephen De Young","text":"Right. And so it can't mean that. Right? Because then St. Paul wouldn't use the article. Right. So the fact that he's using the article, these are already faithful people. So these are people who presumably would be in paradise, would be in the positive afterlife. These are the people who St. Paul calls the dead in Christ. Right. Who are with Christ. So they don't need to be baptized. Right. So then what is this relationship that's being set up? This corresponds to the idea in Roman culture of patronage, Right. So when this is how people got educated, not just in terms of education the way we would think of it, maybe, but also like trade, like we would think of a trade school. Right. That kind of stuff costs money. Any kind of education in the Roman world costs money, right. Peasants didn't get any education. We're no public schools, Right. So, and so most people did not have the money they needed to go and do that. And so they would have a patron, right. Who would be an older established person, often established within that trade or within that Discipline that the person was pursuing, who would effectively sponsor them."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9078.11,"end":9078.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9078.83,"end":9233.8,"speaker":"Fr Stephen De Young","text":"Who would sort of sponsor them, guide them, pay for what they needed. And then in return, the person who was being patronized, pardon the pun, would the things he would do, at least for a certain period of time, at least while the patron was alive, would be done in that patron's name. Right, Right. So the closest thing we have to this in the modern day. Right. Is when you watch shows on PBS or listen to NPR podcast or something, they say this was made possible by a grant from. Right, whatever. Right. So you're kind of giving them credit for your work. Right. So if you were an artisan and you had a patron and you would create something and you would say, you know, this is by virtue of my patron. So. And so. And that would bring honor. Right. And sort of respect and glory to the patron. Right. And so the idea here that St. Paul is getting at is that there were people already, already at this point, and we're talking about 25 years after the death and resurrection of Christ, because there were already martyrs, etcetera, unfortunately, who were being baptized and who are taking the names of departed saints. Right. So he talks about there is a subgroup of people who are doing this. Everyone doesn't do this yet. Right. This is common practice now in the Orthodox Church that you take a patron saint. Right. But this is what St. Paul is referring to in his very earliest stage. And the idea being, obviously a saint in glory is more advanced on the path. Right. Of following Christ than I am by a lot. Right. And so you take this patron saint, you establish this relationship with that patron saint, and they both serve as sort of a guide to you and what you do within the church community, you are doing in. In their name. Right. There's this connection. So mystery unlocked. That's what's going on to First Corinthians 15:20."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9233.8,"end":9235.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's a fascinating."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9235.32,"end":9238.8,"speaker":"Fr Stephen De Young","text":"At least in a short version. I have a much longer version of that argument."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9238.96,"end":9846.36,"speaker":"Fr Andrew Stephen Damick","text":"You do? Yes. It's true. Yeah. I mean, I mean, it makes sense to me. So. Yeah. Yeah. All right, well, to wrap up our baptism episode this evening, and before we do that, actually, I just want to make a note to everybody that we, as I said at the beginning, we're doing a series now on the holy mysteries, the sacraments of the church. We're going to continue doing that with the next episode. The next episode, however, is going to be pre recorded, so you won't be able to call in next time. Although, as Father Stephen will Remind you, if you do call in, who knows what might happen. But we will not be on the other end of the line to talk to you, that's for sure. No matter what else might happen. But we're going to continue next time. So just a note that next time it'll be aired live, but it won't be us. It'll just be a pre recorded episode. So. Well, to wrap up our baptism episode, you know, one of the big pastoral questions that parish priests especially deal with, but I don't think it's just an issue for the pastor, it's really an issue for the whole community is that there are people who will come to the church and they'll especially have their child baptized, or they might come to the church because they're maybe going to get married or something like that and be baptized themselves. And then that's often the last time you see them. This happens a lot. In fact, I would be willing to bet that there are more, at least in the United States and probably in other countries too. But I'm pretty sure about the United States that there are more people who have had baptism in the church who are not in the church than are in the church. And it's a vexing issue. It happens all the time and we do all kinds of things to try to mitigate that, to try to prevent it from happening. When I was still pastoring, one of the things that I would do is I would tell people, especially who weren't part of the church community already, I wanted to see them come to church for a while before I would be willing to put the baptism of their child on the schedule. I would say, yes, we'll baptize that child, but this child needs to be raised in the church. And so show me that you're going to do that. You know, there's all kinds of ways that this gets done. And I think what this betrays is this idea that baptism is what we have talked about in other episodes as a kind of religious technique, which if you do it just the right way, then you get a particular result. Right? And if you don't do it the right way, then you're not going to get that result. And in other words, that it's a kind of magic. That it's a kind of magic. And I think that this way of looking at it is pretty rampant, actually. And it's not just evidenced by the fact that there are people who treat it like a magical spell that gets you into heaven or that gives you a membership or something like that, but it's also evidenced by the fact that there are a lot of debates that happen largely between people who are not actually qualified to have the debate, not just because they're not trained and knowledgeable, although that's often the case, but because they're not the ones actually making the decisions and not the ones actually responsible for the decisions about. And this was referenced in the question we got an email about, especially the reception of converts into the church, people with a Christian background who in many cases have experienced a baptism ritual within that previous Christian experience. And, and so there is a particular distortion, for instance, and I'm just going to come right out and say this because it is a distortion, absolutely distortion of so called corrective baptism. That is, people who have been received into the Orthodox Church, who a bishop received them, you know, usually through a priest, and they've been receiving Holy Communion, and then they go and get baptized by somebody else. Right. And there's all kinds of ways that that manifests. But this is a distortion because if you look at the actual history of the Church and the way that it has dealt with this question, there's not a single formula. And the way that we know that is by reading the actual canons of the ecumenical councils that say, receive these converts in this way, receive these converts in this way, receive these other converts in this way. And if you compile them all together and try to come up with some kind of mechanistic theory about how it's supposed to work, it just doesn't actually all work out in any kind of codifiable way. It doesn't. There's just no sort of machine that you can put together that is sort of the baptism machine, that it works this way and not this other way. And I think the attempt to do that is once again to treat baptism as a kind of religious technique, that it's a sort of magic and you have to do it in an exact, certain perfect way. And if you don't, then you know it doesn't work. There's simply nothing, you know, whatever that happened, it backfires or whatever. But as we've seen by all this examination we've had of scripture, the point of baptism, there's many things that it accomplishes, but one of the things that accomplishes is to bring you into the family of God so that you can live in righteousness. This goes all the way back to the covenant with Abraham and continues on. As we mentioned, it's the first commandment that is a kind of foundational. This is how you live commandment It's a commandment of faithfulness. And as we said at the beginning of I can't remember it was this half or the second half that for someone to say, well, this is the way I want to be received and not this way is to begin the whole thing with disobedience. To begin the whole thing being self willed and with individualism. And to judge the way that another bishop chooses to apply the commandments and the canons is again being self willed and individualistic, right? As it says in Scripture very explicitly, who are you to judge another man's servant? And worse, who are you to judge another man's master? Literally. But the point is to bring someone into this life of faithfulness. And at the end of time, we know that every person is going to be judged according to what he has done, according to what he has done. And that's why questions about, well, can someone really be saved if they have not received baptism at all or in a particular way betrays this kind of mechanistic religious technique approach to this holy sacrament and to all the sacraments in a lot of ways it's to turn it into a kind of materialistic, frankly, formula. And that's not what it is. Now by saying that, I'm not saying that the way that you do, it doesn't matter. I'm not saying that at all. But I am saying that within the, you know, two millennia long consciousness of the Church and how to bring people into faithfulness, that it's gotten applied in different ways, different places, different times, different groups of people. And to attempt to come up with a one size fits all approach to these things is to condemn whole swaths of church history and holy people. In fact, and that's not what we do as orthodox Christians. We don't do that. Instead, we enter into the Church as it is and we are obedient to the community that we enter into. And if we're not ready to be obedient within that, then we need to repent and become ready to be obedient. And the reason for all of that is, as we've said, that it's about entering into this life of faithfulness. Not a faithfulness to any particular theory, not a faithfulness to any particular preferred commenter or teacher or whoever. Not a faithfulness to a particular charismatic speaker or very smart person or whatever. It's faithfulness to Christ. Faithfulness to Christ. And we've seen that faithfulness to Christ can be done in a lot of different ways throughout the history of the Church. There's a consistency between all of them. There's a consistency between all of them, but it's not a consistency of technique. You know, that you have to get everything technically correct in a certain kind of way or else it just doesn't work. Instead, what we see is people orienting themselves towards Christ. And so I believe that baptism of course is a great place to talk about all of this because it's so full of so many things. You know, the summary that Father Stephen gave her there at the end, that brings all this stuff together, that to kind of try to reduce it down to some kind of formula or a technique is to really do violence to what is being joined to Christ, to what is becoming co heirs with Christ, to what is entering into that whole life in the family of God. And what an amazing and awesome, awesome gift it is from God to be welcomed into his kingdom."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":9847.96,"end":10012.65,"speaker":"Fr Stephen De Young","text":"Father Stephen yeah, to kind of kick off from that. The problem of individualism is very real and it afflicts all of us. Again, this is one of those things that's come into us from our culture, it's been built into us and just the, the way we see things in terms of how we see ourselves, how we see the church. Right. Our parish is a collection of people, the collection of individuals and it lends itself to a whole view of the Christian life that is very different than the view that's presented by the Scriptures. When I say the Scriptures, I mean old and New Testament as we've been seeing tonight. Those are not really all that far apart because we've kind of boiled down Christianity in a lot of our heads to here's a list of things I have to believe, meaning I have to give my assent to true false, test style. And then here are a list of moral rules I have to follow. And there are, among the moral rules there are big ones that are non negotiable and then some smaller ones that are maybe negotiable, but that's not, again, that's completely individualized. That's a view of religion. That's what's going on in my head. And what are the things that I'm not supposed to do as an individual. And that's totally foreign to what we get in the Scriptures, what we get in the historic Christian faith for I'll say most of its history. To be polite and breaking that down is very hard for all of us. Right? It's very hard for all of us. We look at church as right on one hand, well, this is a moral duty. I'm supposed to go to church. I'm supposed to go to liturgy. I mean, at least on Sundays. At least most Sundays, right. I'm supposed to. So I should. So I really should. If I don't, I'll feel bad, go to confession, confess not having come to church, not really."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10012.65,"end":10013.01,"speaker":"Announcer","text":"Or."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10013.09,"end":10227.2,"speaker":"Fr Stephen De Young","text":"And we look at it as well, I'm going to go. I'm going to receive communion, I'm going to pray. Hopefully I'll hear a good homily. But that's like flipping a coin a lot of the time. Hopefully I'll get. I will get something out of it, right? As an individual, if that. I find that part lacking. If I didn't do what I was supposed to do, so I'm not going to be able to receive Communion, or if I feel like I'm not going to get anything out of it, if the homilies are always not that great, I don't feel like I'm going to get anything out of it, then that will quickly overwhelm the duty part. And as Father Andrew was just talking about, we even view baptism in the beginning of the Christian life. That way is, what is it doing to and for me as an individual, and how do I have to do it and when should I do it to sort of maximize that benefit or make sure it's real, or make sure it takes. Make sure it does what I want it to do. Right. But baptism is entering into a way of life that is not individual. Even if you are living a very individualistic way of life before, that's one of the things that needs to die in the water. Baptism is entering into a way of life that involves others, that involves the rest of the Christian community, immediately the rest of the parish family into which you are baptized, and then into the broader, huge extended family of the whole church, and then even beyond that all through the ages, right? St. Paul in First Corinthians 10 says, Our fathers were baptized into Moses. And if you read a little further in that chapter, it becomes very clear he's speaking to former pagans. But they're now part of the family, so they're their fathers too, Right? That's the way of life that we enter into. And it is impossible to keep the commandments of Christ by yourself. You can't love your neighbor as yourself by yourself. You can't even love God with all your heart, soul, mind and strength by yourself. Because part of your heart and part of your soul and even your mind and even your strength has to do with what and who you love and who you care about and offering that to God as well. Those are the first two. We can go on and on, right? To show love, you have to have someone to love. Joy is shared. You can't be at peace alone because peace implies that there are other parties with whom you are at peace. You definitely can't be a peacemaker by yourself. All of what we are called to, all of the things that are constitutive of the Christian life, of the way of life that leads to salvation in all of its senses, require us to be living in a community with other people with whom we disagree about things, with whom we don't always get along, whose personalities rub us the wrong way."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10228.24,"end":10228.64,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10229.85,"end":10371.88,"speaker":"Fr Stephen De Young","text":"There's nothing heroic about loving someone who does nothing but flatter you and tell you how wonderful you are. There's nothing heroic about being with people who never actually need your help. There's nothing heroic about being part of a community that never stretches you in any direction in any way. And so if we're serious about becoming like Christ, who did not live as a hermit, who lived his life surrounded by people, pretty much all of whom did not understand him, a massive proportion of whom hated him, who ended up murdering him for various reasons, right? If we want to be like him, then we have to live the way he lived and we have to be with other people. That's how we find our salvation. Because it's not just in this life that we're here to support each other, to learn from each other, to struggle with each other, to strive with each other, to have the sharp edges of ourselves broken off in the rock tumbler that is a church community. It's not just here and now in this life, but it's when we stand before Christ. One day, we're not going to be standing there alone. We're going to be standing there shoulder to shoulder with these same people who we've lived our life with, to give an account for who we were to them and what we did and didn't do for them and for them to give testimony to who we are and what we've done in this life so we're not in this alone. That makes this harder in some ways. It makes it more beautiful in some ways, and it helps in some ways. But we are pursuing salvation together. And baptism is the beginning of that, being baptized and brought into this family."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10372.2,"end":10390.29,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's our show for tonight, everyone. Thank you very much for listening. If you didn't call us tonight, we'd still love to hear from you. You can email us@lordofspiritscientfaith.com you can message us at our Facebook page or you can leave us a voicemail email@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10390.85,"end":10402.05,"speaker":"Fr Stephen De Young","text":"And join us for a live broadcast of the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific, except Thanksgiving when we'll be talking about the Eucharist pre recorded and then after that baptism of fire."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10403.33,"end":10413.9,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can like our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, please share the show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10414.54,"end":10423.58,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to anxyfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. And remember, pain lies on the riverside."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10424.62,"end":10427.42,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless you all."}
{"episode_id":"LOS - #055 - 2022-11-10 - Baptism Now Saves","start":10444.31,"end":10481.36,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 thousand times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
