{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":0.32,"end":64.87,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":67.83,"end":151.78,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the Lord of Spirits podcast where we're going to be taking a voyage into the unseen world. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And joining me tonight is my co Host, Father Stephen DeYoung from Lafayette, Louisiana. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 8-55- and we're going to get to your calls in the second part of today's show. So William Shatner, who just turned 90 three days ago, is having video recordings of himself made so that when he eventually dies in a century or so, an AI driven interactive computer program will allow people to have conversations with him. The question then is raised, would that be the real William Shatner? What if everyone treated him as William Shatner? Would William Shatner be a human being anymore? Where and what would William Shatner even be? And while you ponder that question, we're going to start talking about what it means to be. You probably heard that therapeutic saying, you're not a human doing, you're a human being. Well, actually, you are a human doing, but that's because it's the same thing as being a human being. Are you a human doing or a human being? Yes, you are. But isn't this episode supposed to be about sacred geography? Well, Father Stephen, explain all that for the people in the back."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":152.9,"end":155.22,"speaker":"Fr Stephen De Young","text":"Well, or we could just keep talking about William Shatner."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":155.3,"end":156.02,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":156.1,"end":157.86,"speaker":"Fr Stephen De Young","text":"Perfectly happy to do that too."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":157.86,"end":161.62,"speaker":"Fr Andrew Stephen Damick","text":"That's right. His birthday is March 22nd. Major holiday."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":161.94,"end":165.3,"speaker":"Fr Stephen De Young","text":"Yes. At least his native Canadia. I know that it is."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":165.86,"end":172.54,"speaker":"Fr Andrew Stephen Damick","text":"And William Shatner, by the way, he is a Jew, but he is a Lithuanian Jew. I just wanted to put that out there. It's very true."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":173.66,"end":176.94,"speaker":"Fr Stephen De Young","text":"So, but the great William Shatner aside."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":179.18,"end":179.62,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":179.62,"end":183.42,"speaker":"Fr Stephen De Young","text":"We're going to be talking about a bunch of mind bending things."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":183.9,"end":184.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":185.18,"end":199.48,"speaker":"Fr Stephen De Young","text":"I would, I would go by Dr. Mindbender, but I don't have the mustache for it and I don't even own a monocle. So, so just, that's just a hey, buckle up, guys warning."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":200.12,"end":219.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Although I'll, I'll tell everybody it's going to start out harder and then, and I hope anyways get easier as we go. And, and, and I, I think, I'm not sure. We'll have to ask our audience whether we think by the end of this that this is going to be more or less mind bending than our, than our episodes on Bodies. So stay tuned."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":219.88,"end":224.45,"speaker":"Fr Stephen De Young","text":"Yeah, so, but you already started it with the to do is to be. To be is to do."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":224.85,"end":225.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":225.57,"end":228.85,"speaker":"Fr Stephen De Young","text":"Or as the great Frank Sinatra saying, do be doobie, doobie do."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":229.41,"end":231.49,"speaker":"Fr Andrew Stephen Damick","text":"And also I did it my way. Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":234.37,"end":262.62,"speaker":"Fr Stephen De Young","text":"So all that aside, 80% of kidding aside, we're sort of starting out with, as you said, what it means to be. And this may seem like a weird question because, you know, aside from certain former presidents who asked what the definition of is is, that's not a definition we think about a lot on a day to day basis. Right. Something either exists or it doesn't."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":263.26,"end":266.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's. This is a thing or it's, or it's not a thing."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":267.02,"end":280.67,"speaker":"Fr Stephen De Young","text":"Right. And, and we at least think we're, we're pretty clear on that. But, but that's because we've been enculturated in a certain idea of what it means to be."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":281.55,"end":281.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":282.59,"end":284.19,"speaker":"Fr Stephen De Young","text":"What it means to exist."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":285.23,"end":300.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this is really critical to look at because one of our core missions on this show is combating materialism. And this kind of cuts right. To the heart of at least one of the issues pertaining to materialism."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":301.91,"end":325.51,"speaker":"Fr Stephen De Young","text":"Right, right. And before we could get to talking about how a place is a place, we have to define what that is means. Right. What does it mean for something to be something? And so our idea of being being is sort of opposed to nothingness."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":326.07,"end":326.96,"speaker":"Fr Andrew Stephen Damick","text":"Nothingness, Right. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":327.76,"end":339.28,"speaker":"Fr Stephen De Young","text":"But even as we say that the English language has this tendency to reify things, Latin does the same thing. So nothingness, or just nothing is a noun."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":340.32,"end":343.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Thing. Yeah. Is a thing."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":344.32,"end":353.44,"speaker":"Fr Stephen De Young","text":"So we think of it like it's a thing. Right. Like there is nothing. We think of it as if there's something and that something is nothing. Right. Which is self contradictory."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":353.66,"end":367.9,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, exactly. And I think like when we think of this doctrine of creation ex nilo, creation out of nothing, like the idea that we have behind that is. Well, at first there was something called nothing, but then there was something called something."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":368.54,"end":373.5,"speaker":"Fr Stephen De Young","text":"Yeah, there were things. But instead of that nothing. Yeah, there were things."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":373.98,"end":383.99,"speaker":"Fr Andrew Stephen Damick","text":"Nothing is not a thing. Like literally it's not, it's not a thing, just a non thing. It's, it's not, it's not even it. You can't even like give it a pronoun."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":384.47,"end":397.67,"speaker":"Fr Stephen De Young","text":"Right. And so we, we think of what it means to exist for us because again we're coming from this materialist viewpoint is something exists if it has material reality. In particular."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":398.15,"end":400.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If there's atoms, you can spot molecules."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":401.43,"end":428.95,"speaker":"Fr Stephen De Young","text":"Right. Horses exist because there are horses made of matter that I could go and see. Right. There's one just down the block from me because I'm in Louisiana. But there are unicorns do not exist because there are not material unicorns that I can go and see and touch right. In the world. And so a horse is a unicorn isn't."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":429.11,"end":429.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":429.47,"end":449.92,"speaker":"Fr Stephen De Young","text":"Is how we look at it. And so then as you mentioned with creation. Xd, hello. If God made a unicorn, that would mean that he took this thing from non existent and then made a material one. Yeah, right. That would be sort of how we read that."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":450.4,"end":472.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then, and then there's this fun messed up place that people go is like. Well, it existed in the mind of God, you know, like, like whatever. You know what's. Yeah, right. How do you know what's in the mind of God? I mean, you know, setting aside all that wonderful theology from Saint Maximus the Confessor about the logia. Whatever, Whatever."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":472.44,"end":472.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":473.24,"end":478.6,"speaker":"Fr Andrew Stephen Damick","text":"That's not what people generally mean when they, when they talk about it. Right, yeah. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":478.68,"end":495.95,"speaker":"Fr Stephen De Young","text":"So I mean the logia are in thing. But anyway, we don't want to go down that rabbit trail. But yeah, that's not what St. Maximus was talking. Right, right, right. God has a brain. Like God has a giant brain and there are all these ideas floating around in it. Here's an idea that occurred to him at some point."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":496.35,"end":496.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":496.83,"end":497.71,"speaker":"Fr Stephen De Young","text":"He made up."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":498.27,"end":498.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":498.83,"end":499.19,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":499.19,"end":515.3,"speaker":"Fr Andrew Stephen Damick","text":"So the key then is to get to. Because we're Christians, the biblical doctrine of. If it can be said, a biblical doctrine of non existence or what? Or really? Really. Yeah, right. I mean here we go. Like we can't even not talk about it. Right, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":515.94,"end":516.42,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":516.5,"end":520.02,"speaker":"Fr Andrew Stephen Damick","text":"You know, so I Guess the big question then is what happens at the creation?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":520.34,"end":550.64,"speaker":"Fr Stephen De Young","text":"Right. So in the ancient world generally, and in the Old Testament in particular, and this is true of the New Testament also. But being is not opposed to nothingness or non being. Right. Which again, our English language wants to turn into a thing. Existing isn't opposed to being imaginary. Right. Or an idea for any ancient thinker. So being is opposed to chaos."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":551.84,"end":552.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":552.56,"end":614.88,"speaker":"Fr Stephen De Young","text":"And this takes various forms. So in Genesis 1, and we've talked about Genesis 1 a little bit on previous episodes that we're going to refer back to that a little bit here, not go through it all again. But you start out with primordial chaos. That's what the waters represent that are sort of there at the beginning of Genesis 1, that the Holy Spirit is hovering over. Right. Sort of brooding over the way a hen broods over her chicks or over eggs, you have this primordial chaos at the beginning. Right. And then creation is then setting things in order. Right. So to be means to be ordered as opposed to chaos. Now when we've talked about this before, we've gotten the emails, well, who created the chaos? Yeah, right. Who created the chaos? Where did the chaos come from? Right. Because when we're talking about these waters, we're not talking about H2O. H2O. H2O is an ordered thing. That's an ordered molecule."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":615.04,"end":615.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":616.08,"end":621.84,"speaker":"Fr Stephen De Young","text":"This is water as, as it symbolizes and represents chaos. Just utter chaos."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":622.41,"end":622.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":622.73,"end":634.17,"speaker":"Fr Stephen De Young","text":"So but the question who created chaos for an ancient person? Would be the same as the question, well, who created the nothing that was there before God created."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":634.65,"end":642.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. Or like it's, it's inherently contradictory in the ancient conception, it's like saying, who ordered the chaos? Well, once you ordered, it's not chaos anymore."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":642.81,"end":650.01,"speaker":"Fr Stephen De Young","text":"Right. If you created it that it wouldn't be chaos. It would be put in order because the act of creation would be putting it in order."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":650.41,"end":715.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's important to distinguish this. I mean, I don't know how many people we've got in our audience who know a lot about Mormon theology. But I'm just going to put this out here because it's actually a really important element of Mormon theology. Joseph Smith taught that all matter is uncreated. Right. And so everything is just rearrangements of pre existing matter. And that's why he can say, for instance, that human beings are, you know, what human beings are now. You know, God was just like, although he didn't put it in those terms, but that God was what we are. And you know, that we can become exactly what God is. Right. Because it's just pre existing matter that gets just rearranged and some of it gets elevated to be a God. This, what we're talking about is different from that because. Because that theology is predicated upon materialism. Right. It's predicated upon the idea that there's just a bunch of sort of building blocks out there in a big pile and. And then God started, you know, putting blocks together. Right. And. And making stuff out of those blocks."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":716.05,"end":723.33,"speaker":"Fr Stephen De Young","text":"Right. The important element of creation ex nihilo is not the idea of void."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":724.05,"end":724.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":724.53,"end":735.83,"speaker":"Fr Stephen De Young","text":"As the pre existing edition. The important part of Creation x nihilo what, what the Fathers are aiming at with Creation x elo is to say that there is no thing which is co eternal with God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":736.15,"end":736.87,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":737.11,"end":739.35,"speaker":"Fr Stephen De Young","text":"Matter or anything else. Matter, energy."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":739.67,"end":750.07,"speaker":"Fr Andrew Stephen Damick","text":"Right. Time, space, the created and the uncreated. There's a radical disjunction between them forever and always. You know, like. Yeah, always, Always. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":750.07,"end":757.79,"speaker":"Fr Stephen De Young","text":"But again, when we say nothing is co eternal with God, we don't mean that there is a thing called nothing that is co eternal with God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":757.79,"end":768.86,"speaker":"Fr Andrew Stephen Damick","text":"Right. I'm having flashbacks every time we say that. Every time you say use the phrase the nothing, I start thinking about the Neverending Story, which, I mean, I watched that again recently."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":768.94,"end":773.54,"speaker":"Fr Stephen De Young","text":"I'm like reliving the childhood trauma of the horse going into the."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":773.54,"end":778.06,"speaker":"Fr Andrew Stephen Damick","text":"It didn't. I mean, forgive me if there's fans out there. I felt like it didn't hold up."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":779.18,"end":779.58,"speaker":"Fr Stephen De Young","text":"Sorry."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":779.58,"end":782.62,"speaker":"Fr Andrew Stephen Damick","text":"I loved it when I was a kid, though. Oh, man. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":782.62,"end":788.5,"speaker":"Fr Stephen De Young","text":"Well, there's also the void for Sentry fans, but that's a deep cut. So we probably. It's not one."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":788.5,"end":789.5,"speaker":"Fr Andrew Stephen Damick","text":"I know, but okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":791.69,"end":801.69,"speaker":"Fr Stephen De Young","text":"So what it means to be created and therefore what it means to exist, because everything that exists has been created by God. Right, Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":801.93,"end":802.33,"speaker":"Fr Andrew Stephen Damick","text":"We."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":802.33,"end":811.85,"speaker":"Fr Stephen De Young","text":"We wouldn't say, as orthodox Christians, at least we wouldn't say that God exists. If by exists you mean the same thing as the chair I'm sitting in, exists."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":812.33,"end":824.96,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And even, even just linguistically it doesn't work because the word, I mean not the etymology, is everything. But this gives us a clue. The word exist literally means to have your being out of something. Existe. Right. So."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":824.96,"end":825.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":825.52,"end":830.48,"speaker":"Fr Andrew Stephen Damick","text":"You know, God doesn't have his being out of something. He is being."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":830.96,"end":856.57,"speaker":"Fr Stephen De Young","text":"Right. So everything we talk about existing, we're talking about created things. Right? Right. And so we can't even predicate that verb of God in the exact same sense as. As we do of the things he created. But so what it means to exist, then, is that God has created it, and that means he has set it in order and he has placed it within a web of relationships."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":856.97,"end":857.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":857.53,"end":913.73,"speaker":"Fr Stephen De Young","text":"So to exist means to be not only set in order internally. Right. As a thing, but to also be connected by this web of relationship to other things. Right. To the rest of the things in the world. And so we have an example, or at least I have a favorite example to use, which is that of a tower. So if you have a tower, someone builds a tower. This tower serves as a tower. The matter that makes up the tower is being a tower. Right. Centuries past, the tower crumbles. The tower no longer exists. There is no longer a tower. There is a pile of rubble. Right. And that pile of rubble contains most of the matter that was part of the tower."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":914.77,"end":915.13,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":915.13,"end":919.81,"speaker":"Fr Stephen De Young","text":"Right. But it's no longer a tower now it's being a pile of rubble."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":920.86,"end":921.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":921.66,"end":923.18,"speaker":"Fr Stephen De Young","text":"So being is a verb."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":923.66,"end":930.7,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Which is. Which is why throughout that whole human being, human doing thing at the beginning. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":930.86,"end":956.5,"speaker":"Fr Stephen De Young","text":"The matter is the same matter as now, being a pile of rubble. And someone could come and take stones and wood from that pile of rubble and go and turn it into something else, place it in a new order and set it up in a new set of relationships, and it could become a table or a wall or. Right. Or something else. Right. And then that matter. Same matter, will be being that. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":956.5,"end":957.62,"speaker":"Fr Andrew Stephen Damick","text":"We'll be being able."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":957.86,"end":958.82,"speaker":"Fr Stephen De Young","text":"Or a wall."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":959.06,"end":959.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":960.02,"end":964.5,"speaker":"Fr Stephen De Young","text":"That's what it will be doing. It will be being a. Whatever it is. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":964.74,"end":1215.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I. And I just have to throw a bone out there for those who think that this podcast has something to do with J.R.R. tolkien. You know, who you are up there in Minnesota. Yeah. So. So actually it's interesting, like, you mentioned the. The image of the tower and the pile of stones. Tolkien actually uses exactly that image in his essay called Beowulf the Monsters and the Critics, in which he. He's complaining about the way critics look at Beowulf, this epic poem in. In Old English, and they just want to look at sort of the parts and the influences and all that sort of thing. And. And for them, that's what Beowulf is. And he's like, no, no, no, no, no. Beowulf is this poem as it is. You know, that the. The bones that you put into the soup are. Are maybe interesting. But. But the point is the soup, Right. And, like, he. He talks specifically about a tower and how, you know, people came and knocked down the tower because they wanted to analyze which stones came from an old house nearby and which, you know, where, which those quarried from here or there. But he said, but he could see the, the ocean from the tower. You know, that. And so he's making the point. He's talking about storytelling and literature, but he's making the point in another way that, the way that this story functions by being Beowulf, that's what it is. Certainly we can look at all the influences that went into it and so forth, and that can, you know, maybe deepen our understanding. But if that's all we think it is, then we're missing the thing that it actually is. Like I remember, for instance, there's a great episode of Star Trek Next Generation where, where Picard and gang run into some aliens and they refer and they, they, they have to run them through some kind of translation matrix, and the aliens refer to them as ugly bags of mostly water, which is exactly a way of expressing this thing. It's like, well, human beings are not bags of water, ugly or not. We're human beings. Right? And, and so it's, it's, it's a. You know, the aliens were essentially analyzing humans according to their constituent pieces. Like that's what they are, is mostly water. Well, that's true. I do comprise mostly water, but that's not what, that's not what I am, you know, So I, I think, you know, it's, it's, it's a, it's a problem that we run into. Right? We think, we do think about it and we run into it in literature and some of this other stuff. But it's, it's. I think that the, the difficulty is that like, like you can hear it expressed, for instance, and we're going to get into this, but just to kind of tip the hand a little bit, people will say things like, well, the, the Church of the Holy Sepulcher there in Jerusalem. Is that really the place where Jesus rose from the dead? Is that really the spot? You know, and, and that is a materialist reading of this issue. Like, you know, because you're looking for, I guess, a piece of dirt or whatever, you know, I mean, you could even, you could even if you really want to analyze it out and be really super materialist about it, you can just say, well, the truth is, is that the planet Earth is not even in the same position it was when I began the sentence. So no place is the same place. You know, it's just, it's just not even. Or the fact that, you know, molecules trade out in everything. Is it the same thing? It actually is the same thing, even though the material is not exactly the same material. So, yeah, like you said, this web of relationships, you know, and it's fascinating to think about what that means in terms of creation, what creation is. It's really, you know, it's really vibrant, understood that way, really powerful. It's not the sort of static set of stuff, you know, and, you know, we're not. We're not animists, but you can kind of see where animism gets its sense. Right. There's this sort of life in everything as a result. So, yeah, I mean, it's, It's. It's not an easy. It's not easy to think about, but I think it's important that we at least spend some time trying to tease some of this stuff out anyway."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1215.88,"end":1222.8,"speaker":"Fr Stephen De Young","text":"Right. I like that you phrased it as Picard and the Gang, so sort of tng by way of Scooby Doo."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1225.99,"end":1226.19,"speaker":"Fr Andrew Stephen Damick","text":"Having."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1226.19,"end":1227.83,"speaker":"Fr Stephen De Young","text":"Some kind of wacky antics."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1228.55,"end":1230.79,"speaker":"Fr Andrew Stephen Damick","text":"Wesley is definitely the Scooby Doo of the."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1232.07,"end":1234.39,"speaker":"Fr Stephen De Young","text":"So he's more scrappy."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1234.39,"end":1236.63,"speaker":"Fr Andrew Stephen Damick","text":"I think he thinks he's crappy too. Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1238.07,"end":1256.51,"speaker":"Fr Stephen De Young","text":"So we've talked before about sort of the four main means we have of interacting with reality as humans. Those being language, art, music and ritual."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1257.31,"end":1257.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1257.71,"end":1268.03,"speaker":"Fr Stephen De Young","text":"And, you know, we've. We've kind of defined what those are before, but I want to hone in now based on what we're talking about, on what that interact really means."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1268.75,"end":1269.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1269.39,"end":1275.71,"speaker":"Fr Stephen De Young","text":"What these four things are is they're. They're four creative actions."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1277.2,"end":1277.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1277.4,"end":1346.63,"speaker":"Fr Stephen De Young","text":"They're ways by which we as humans place reality in order. Place it in order and then. And then put together these connections, this web of. Of relationships between things and other things. Right. Put them in order, put them in their place and establish their relationships with one another. Yeah, we do that through language. You know, we talked before about the naming of the animals and that being this putting in order and the Hittite iconography of kings naming animals to show this kind of ruler, dominion and justice and establishing order. We do this with art. Art we use to express the relationships between things and the. The web in which they sit. The same with music and the same with ritual. Ritual is making a time and a place that we're going to go deeper into this as we go tonight, but it's making a time in a place, be a particular time and place."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1348.47,"end":1349.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1350.47,"end":1353.63,"speaker":"Fr Stephen De Young","text":"When we celebrate rituals, you know, and."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1354.35,"end":1433.42,"speaker":"Fr Andrew Stephen Damick","text":"This is also probably the good moment where we can give a shout out to all of our friends who have joined Us via Jonathan Pageau, who talks about symbolism being inevitable. Right. And that's just another way of talking about what we're saying here is that recognizing patterns in the world is not just this sort of human act that's sort of arbitrary, but it is inevitable and it is what makes things what they are. Which might sound a little. That might be a little controversial to say, but how can we conceive of a thing without conceiving of it? Right. You know, or just the fact that even, like even. I don't know if it's. It's, you know, physicists now even say that, that material particles behave differently when they're observed versus when they're not observed. So even on the purely materialist, observable level like that, there's something going on there that has to do with human consciousness and the way that human beings organize their understanding of what's going on. We're not just observers in a detached. And like the detached observation is not even a possibility, you know?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1433.42,"end":1437.98,"speaker":"Fr Stephen De Young","text":"Right. Yeah. And. And I, of course, I'm going to double down even further."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1438.38,"end":1438.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1439.02,"end":1449.82,"speaker":"Fr Stephen De Young","text":"What we call the world is the product of human consciousness. It doesn't exist outside of human consciousness."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1450.38,"end":1454.38,"speaker":"Fr Andrew Stephen Damick","text":"Which is not solipsism. But why? Why is it not solipsism?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1454.78,"end":1506.71,"speaker":"Fr Stephen De Young","text":"Well, first of all, how we've just defined existence. Right, right. As being in order and being within this web of relationships. Right. That. That requires human consciousness. But let's give some examples. Right? So when I say the word bat, right. There's something it's like to be a bat, but you can't even know what it's like to be a bat. Right. So we have no access to what it's like to be a bat or what a what bat or batness means from a bat perspective. Right. I say bat and you think of a scary thing or a cute little baby thing you saw in a video from the dodo, or you think of, you know, getting vengeance for your parents, death against crime on the streets on Guam."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1506.71,"end":1508.19,"speaker":"Fr Andrew Stephen Damick","text":"They would eat them. They would eat them."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1508.27,"end":1508.99,"speaker":"Fr Stephen De Young","text":"You think? Food?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1509.47,"end":1512.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Fruit bats, not recommended. Actually. You could get some diseases."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1513.47,"end":1520.32,"speaker":"Fr Stephen De Young","text":"Right. But none of those things we just listed exist without human consciousness."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1520.88,"end":1521.28,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1522.08,"end":1541.28,"speaker":"Fr Stephen De Young","text":"Right. It's not scary unless it's scary to a human. It's not cute unless it's cute to a human. It's not food unless it's food for a human. Right. And if, if Bob Kane and Bill Finger had never written a set of stories or you weren't aware of them, you'd have no Idea what I was talking about. About fighting crime."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1542.45,"end":1542.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1542.85,"end":1555.33,"speaker":"Fr Stephen De Young","text":"In Gotham City. Right. So when Bob Kane and Bill Finger wrote those stories and put those stories together, they created something."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1556.37,"end":1556.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1557.09,"end":1562.45,"speaker":"Fr Stephen De Young","text":"That is now part of what a bat is for me and for everyone else who's heard those stories."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1562.93,"end":1563.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1563.57,"end":1565.73,"speaker":"Fr Stephen De Young","text":"And you can't unhear those stories."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1567.25,"end":1572.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Or one could also say, obviously, Santa Claus exists."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1572.24,"end":1577.12,"speaker":"Fr Stephen De Young","text":"Yeah. If one were so inclined. And unicorns."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1577.84,"end":1587.52,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Although, like. So to give a counterexample, before about 2500 years ago, the color blue did not exist."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1588.08,"end":1588.56,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1589.36,"end":1589.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1590.88,"end":1597.04,"speaker":"Fr Stephen De Young","text":"This is something that people will say, well, wait, the things that are blue now were blue then? Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1598.16,"end":1598.56,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1599.57,"end":1605.09,"speaker":"Fr Stephen De Young","text":"Like Lapis Lazuli was blue? Well, yeah, they were. But no one perceived the color blue."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1605.65,"end":1606.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1606.21,"end":1612.45,"speaker":"Fr Stephen De Young","text":"When you read ancient accounts, you know, Homer talks about the wine, dark sea. He looked at the Mediterranean and thought it was Burgundy."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1612.77,"end":1613.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1613.33,"end":1614.37,"speaker":"Fr Stephen De Young","text":"That's what he saw."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1614.61,"end":1615.89,"speaker":"Fr Andrew Stephen Damick","text":"And the sky. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1616.13,"end":1616.77,"speaker":"Fr Stephen De Young","text":"Is white."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1617.09,"end":1617.81,"speaker":"Fr Andrew Stephen Damick","text":"Is white."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1619.01,"end":1670.84,"speaker":"Fr Stephen De Young","text":"At dawn, it's red. At dawn and sunset, it's red. And during the day, it's white. There are still. You can go on YouTube and look this up. There are still tribes in Africa who don't have the color blue. They still say the sky is white. And researchers, anthropologists will show them, like, color swatches. And there will be, like, three. Three red and one blue square. And they won't be able to tell them the difference. They honestly will not see any difference. But then, if you keep watching the videos, they can be taught to see the color blue. And then once they've been taught to see the color blue, the color blue is immediately obvious to them. They can identify the blue square instantly, and they can't unsee the color blue. Now, blue things look blue to them."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1671.8,"end":1805.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I recently had a conversation with somebody in which. So I have. If you ever meet me in real life, which you have, and maybe some of your listeners have, I have an annoying habit which I constantly have to restrain myself from engaging in, which is, let's put it this way, enhancing other people's pronunciation of English. And the person I was having a conversation with said a word, and I was like, no, no, no. The word is pronounced this way. And then I suddenly realized what I had done. And it was. It was simply. It was a matter of stress. So I don't even remember what the word was. So, you know, I can't even think what the word was. So, you know, the person said it with, like, say, stressing the first syllable and then. And then unstressing the second, whereas it should have been the other way around. Right. So, like, for instance, the word. I don't know why this popped in my head, but dismay, right. They would have said dismay. You know, I. I was dismayed. And. And I said, no, it's dismay. And. And this other person said, that's the same. I was like, you don't hear a difference between dismay and dismay. And they said, you just said the same word exactly the same way two times. And I was just baffled at that. For whatever reason, they just didn't perceive that. They just did not perceive the stress in that word. And as you said, you can be taught to perceive things like that. And I think it's one of the reasons why it can be difficult, especially as an adult, to learn another language, because you just don't. You don't perceive what sounds important and different, you know, to speakers of that language. Or there's sometimes our perception is submerged. Right. So, for instance, a classic example in English is the words keel and cool. Well, if you feel what your tongue does at the beginning of each of those words, you can tell it's in a different place. But English speakers perceive those as starting with the same sound, whereas there are other languages which. Those are distinctly different consonants. Right. So as another example, you know, not visual, but in this case, aural. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1806.79,"end":1822.68,"speaker":"Fr Stephen De Young","text":"Father, it's great Lent, and it's time for us all to take an honest inventory of ourselves. I feel like you need to not make excuses and just embrace the fact that you've been a grammar Nazi for a good portion of your life."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1824.28,"end":1826.52,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's not all about grammar. You know, there's."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1827.24,"end":1834.76,"speaker":"Fr Stephen De Young","text":"Oh, yeah, I'm sure there's depths to plumb there, but I'm not your spiritual father, so you could address that with him."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1835,"end":1835.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1836.52,"end":1842.12,"speaker":"Fr Stephen De Young","text":"So. And so this one place where this becomes really important."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1842.76,"end":1842.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1842.88,"end":1893.58,"speaker":"Fr Stephen De Young","text":"I already brought up the bat. So we also don't know what it's like to be an angelic being. And how then angels perceive the creation is entirely different than how we do. But this is important, and I know we have. Some of our listeners aren't listening live right now because they're at their annunciation services tonight. We had them this morning, you and I, but this is all over the place in the liturgics of the Annunciation. What we find with. With spiritual events and spiritual realities in the Scriptures is that they are revealed. The language is of revelation, not of them becoming real or happening."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1894.85,"end":1897.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. So that's really important."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1898.45,"end":1922.53,"speaker":"Fr Stephen De Young","text":"One of the big examples, of course, is how the Scriptures can talk about the Lamb slain before the foundation of the world, and yet we still have time, space coordinates where Jesus Christ died on the cross outside Jerusalem. Right. At an actual time. Yeah, right. Well, how does that work?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1923.01,"end":1942.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, right, right. I mean, like one of the liturgical texts, and this was actually just being asked about in our Facebook group, you know, from Annunciation, from vespers, last night said something about the Archangel Gabriel revealing the pre. Eternal counsel of God to the Virgin Mary."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1942.53,"end":1942.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1942.89,"end":1951.54,"speaker":"Fr Andrew Stephen Damick","text":"And the question was like, well, how can something be before eternity, you know? Right, right, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1951.54,"end":1957.1,"speaker":"Fr Stephen De Young","text":"And this is the, this is the, the feast in Greek is actually the evangelism of the Theotokos."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1957.34,"end":1957.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1957.7,"end":1964.62,"speaker":"Fr Stephen De Young","text":"She's been literally, how can she hear about a victory of God that from her perspective, hasn't happened yet?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1965.02,"end":1966.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":1966.86,"end":2014.65,"speaker":"Fr Stephen De Young","text":"Because we look at it as the past no longer exists and the future does not yet exist. Right. Because we're thinking of existence in terms of this quote unquote coming into being. Right. It's not materially real yet. And so that means it doesn't, it doesn't exist yet. But the language over and over again in the Scriptures is that these events, these things, these truths are revealed. They enter into the realm of human consciousness at a particular time and in a particular place. They sort of intrude. Right. They intrude into the world of human experience, the world of human consciousness that we've been talking about."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2015.21,"end":2041.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which then makes you question, for instance, as a sort of shorthand, we talk about the pre incarnate Christ, you know, like, for instance, visions, visions of the Son and Word of God in the Old Testament. But what does it mean to be pre incarnate in these terms? Right. You know, it's that God is not."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2041.22,"end":2042.38,"speaker":"Fr Stephen De Young","text":"On a parallel track."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2042.86,"end":2044.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2044.38,"end":2048.22,"speaker":"Fr Stephen De Young","text":"And then like he jumps the track down to our track and then jumps back to his track."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2048.78,"end":2066.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Which is why then we can say that he's incarnate without change. That's not, that's not a sleight of hand. We're not saying, well, there was really a change. But, but you know, there's, there's also part of him that didn't change. Like, that's not, that's, that's not."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2067.07,"end":2075.47,"speaker":"Fr Stephen De Young","text":"Right, right. We're talking about Christ entering into the, the realm of human experience and consciousness at a particular period of time."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2076.03,"end":2076.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2076.91,"end":2104.22,"speaker":"Fr Stephen De Young","text":"And we're gonna, we're gonna go into some things related to this a little later on in the second half. But to tease that a little here, there's. Even though there's one sort of archetype, one archetypal point at which these events and these truths come into the world of human consciousness. They can also do so again both before and after."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2106.22,"end":2129.67,"speaker":"Fr Andrew Stephen Damick","text":"So you might almost put it in this way, that, for instance, that the incarnation of the Son of God affects both what happens from our point of view, after and before, which is among other, you know, to put it in sociological terms is why Old Testament saints can be saved. Right. For instance."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2130.39,"end":2135.27,"speaker":"Fr Stephen De Young","text":"And. Yeah, and like I said, we'll get into that more in just a little bit. We got a little more groundwork to lay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2135.65,"end":2135.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2136.13,"end":2137.09,"speaker":"Fr Stephen De Young","text":"Before we get there."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2137.25,"end":2158.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, well, let's, let's, let's, let's back it out a little bit then, and throw in a little bit of Greek philosophy, since we like to do that once in a while. Why not? Yeah, why not? And just for all those people like, oh, no, you're paganizing, like, no, no, no, no, no. This is just to help us understand the terms."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2159.73,"end":2168.64,"speaker":"Fr Stephen De Young","text":"I'll have you know, many of our orthodox brethren promote the spirit of Hellenism. So we're just doing our little bit here, right. I mean, today is the Greeks."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2168.8,"end":2173.76,"speaker":"Fr Andrew Stephen Damick","text":"March 25, 2021. So there you are. 200 years ago, something happened."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2175.12,"end":2192.72,"speaker":"Fr Stephen De Young","text":"So that is now we talk about what it means to be, what it means to exist, to be in order to be within this series of relationships. And that, that is something that is done within the realm of human consciousness as it is relevant to humans. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2192.72,"end":2193.28,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2194.24,"end":2209.24,"speaker":"Fr Stephen De Young","text":"And so now we're moving to the slightly to what does it mean for something to be what it is. Right, Right. Because it doesn't just exist, it exists as something Right. Is something right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2209.24,"end":2214,"speaker":"Fr Andrew Stephen Damick","text":"Which, which is a basic sort of obsession with ancient philosophy."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2214.4,"end":2216.64,"speaker":"Fr Stephen De Young","text":"Right. This is the, this is the big question."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2217.24,"end":2217.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2217.88,"end":2249.85,"speaker":"Fr Stephen De Young","text":"Of classical Greek philosophy is what makes a thing what it is? And this is. You go back to the pre Socratics, right? Heraclitus, famously, you never step in the same river twice, right. So we, we say that's the same river. But if we're talking from a material perspective, the water keeps moving, right? So the river, the Mississippi River, I can drive over and see right now isn't the same material river that was there if I went and looked yesterday or that will be there if I go and look tomorrow."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2250.49,"end":2250.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2250.89,"end":2257.45,"speaker":"Fr Stephen De Young","text":"And so Heraclitus perspective is that everything is flux, so everything is really still chaos."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2258.41,"end":2259.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Down."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2260.25,"end":2279.4,"speaker":"Fr Stephen De Young","text":"We just are sort of conventionally in order to operate and function, sort of putting, making assumptions and putting categories on things. David Hume takes this to kind of a ridiculous extreme when he says, you know, you walk out of a room and walk back in and you just assume that the furniture is all the same furniture. You can't actually prove that."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2279.96,"end":2284.8,"speaker":"Fr Andrew Stephen Damick","text":"I'm trying to write through now the Monty Python philosopher's song in my head to sort out all these various philosophers."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2284.8,"end":2289.64,"speaker":"Fr Stephen De Young","text":"But it's just not coming. Yeah. David Hume could out consume and drink you under the table."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2292.04,"end":2304.18,"speaker":"Fr Andrew Stephen Damick","text":"Yes, but. Right, okay. So, yeah, everything is fundamental chaos. I recall, you know, one of the pre Socratics Thales said that everything is water. But now, knowing what we know about water, that doesn't mean everything is liquid, right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2304.18,"end":2306.94,"speaker":"Fr Stephen De Young","text":"No, it means everything is in chain, in a state of change."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2307.02,"end":2307.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2307.98,"end":2315.5,"speaker":"Fr Stephen De Young","text":"Parmenides, then, is sort of the opposite of that. Who's sort of. It is what it is. Right. Like just things are right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2315.5,"end":2315.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2316.3,"end":2322.54,"speaker":"Fr Stephen De Young","text":"So this is, you know, if we want to go to a more modern person like Heidegger, talking about the brute facticity of reality."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2322.7,"end":2323.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2324.86,"end":2330.86,"speaker":"Fr Stephen De Young","text":"You're suddenly aware that you exist and there's this other stuff and there's nothing you could do about it. Right. It just is what it is."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2331.08,"end":2341.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, yes. And if you, you know, if you, if you can't handle that, then you go in the Jean Paul Sartre direction. The fact that there's other things that I hate that, you know."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2341.32,"end":2343.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Especially other people. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2343.28,"end":2343.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2344.84,"end":2374.87,"speaker":"Fr Stephen De Young","text":"So one of the, One of the sort of thought experiments that's used by many Greek philosophers to. To address this, to think about this, that was mentioned, WandaVision. If people have watched it, don't worry, we're not spoiling. We're not spoiling anything in WandaVision. If you haven't seen it yet, but it is referenced there. And so I said, hey, let's come at it from this perspective. Because people have heard of this now, Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2376.23,"end":2377.91,"speaker":"Fr Andrew Stephen Damick","text":"It's now a thing."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2378.55,"end":2383.19,"speaker":"Fr Stephen De Young","text":"And that is. Yeah, they've heard the story. So now they can't unhear it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2383.19,"end":2383.99,"speaker":"Fr Andrew Stephen Damick","text":"They can't unear."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2383.99,"end":2406.8,"speaker":"Fr Stephen De Young","text":"That's right. So it's the ship of Theseus. Right. And Theseus, of course, great Greek hero, they have his ship on which he took his famous voyages on display. Well, as anything made out of wood does, it starts to rot. And as the planks of wood start to rot, they replace them with new planks."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2407.28,"end":2407.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2408.4,"end":2415.6,"speaker":"Fr Stephen De Young","text":"Eventually you reach a point where none of the original wood is there. Is it still the ship of Theseus?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2416.64,"end":2419.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because he never stood on any of those actual planks."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2419.6,"end":2422.08,"speaker":"Fr Stephen De Young","text":"Right. Materially, it is a different Object."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2422.96,"end":2423.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2423.44,"end":2429.76,"speaker":"Fr Stephen De Young","text":"Right. So does it still have that identity as the. As the ship of Theseus? Okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2429.76,"end":2441.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And this works even on the, the very human bodily level too, right. Where every single atom in your body gets traded out. I don't remember how often it is every few years."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2441.66,"end":2443.06,"speaker":"Fr Stephen De Young","text":"It's every few years."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2443.14,"end":2445.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Literally. You are not the."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2445.14,"end":2445.42,"speaker":"Fr Stephen De Young","text":"What?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2445.42,"end":2448.18,"speaker":"Fr Andrew Stephen Damick","text":"Like I, I am literally not what I was when I was a kid."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2448.58,"end":2452.02,"speaker":"Fr Stephen De Young","text":"Right. None of the matter that was Chrismated is still in you."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2452.34,"end":2455.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that was, you know, 23 plus years ago now."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2455.94,"end":2474.21,"speaker":"Fr Stephen De Young","text":"Right. So I. Identity in that sense can't be a. Material things can't be based on a material definition. Now, nobody noticed it, which kind of saddened me. But when we titled the episode I said Boat of Theseus."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2474.53,"end":2475.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2475.33,"end":2480.45,"speaker":"Fr Stephen De Young","text":"And what I was doing, see, I changed one element of the name. Is it still the same?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2480.61,"end":2482.13,"speaker":"Fr Andrew Stephen Damick","text":"It's a little too subtle, maybe."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2482.29,"end":2514.36,"speaker":"Fr Stephen De Young","text":"Thought experiment. See what I did there, it's like an inception. No one saw what I did there. Okay, but so then how do we. How do we say. Do we just say, no, it isn't the ship of Theseus anymore. The ship of Theseus is gone. The ship of Theseus has ceased to exist. And now you have a replica. Right? That's one possible answer. That's the materialist answer, Right, Right. That this is a replica of the real ship of Theseus has rotted away and disappeared. That is going to cause a lot of problems when we come to the human body's matter all being replaced."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2515.16,"end":2515.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2515.64,"end":2521.32,"speaker":"Fr Stephen De Young","text":"Seven or eight years. Right. Because then that means you're not you, you're a replica. That's."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2521.64,"end":2548,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or yeah. And here's the thing. Like this is not only a problem in terms of questions of consciousness and so forth, but like, for instance, think about the legal ramifications, right? Like let's say someone assaults me in an alley and the police only figure out the identity of the person who does it 10 years, 10 years later. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2549.2,"end":2549.6,"speaker":"Announcer","text":"It."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2550.48,"end":2575.68,"speaker":"Fr Andrew Stephen Damick","text":"Is it right to try that person for assaulting a material being that no longer exists. Right? Right. So even our whole, everything we do is predicated upon different notions of identity than the one that tends to function in our head. It's predicated upon non materialist notions. Like there's something called Pennsylvania."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2576.16,"end":2576.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2576.96,"end":2578,"speaker":"Fr Andrew Stephen Damick","text":"I mean, what is that?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2578.48,"end":2609.33,"speaker":"Fr Stephen De Young","text":"Yeah. Right, Right, right. So the answer to this, right. The, the. From the, from the biblical perspective and from the perspective of orthodox theology and influenced by, in a lot of ways, Aristotle. And I won't go down a rabbit trail about Aristotle. And Saint Maximus or Saint John of Dominic, Damascus. But is that. Yes, that is still the ship of Theseus."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2610.53,"end":2610.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2611.49,"end":2652.22,"speaker":"Fr Stephen De Young","text":"Even when all the matter has been replaced, even if it's all been replaced two or three times, that's still the ship of Theseus. Why? Well, because to exist, and to exist as a thing means to be placed in order and placed in that web of relationships. So the ship of Theseus, that matter, it's a different set of matter, but that matter is, at that time, being the ship of Theseus. The people who come and see it, see it as the ship of Theseus. They experience it as the ship of Theseus. It's playing the role, culturally, societally, the role in human conscious experience of the ship of Theseus. So it is the ship of Theseus."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2652.62,"end":2653.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2655.19,"end":2675.75,"speaker":"Fr Stephen De Young","text":"And. And this is primarily a question, then, of what's called teleology, of purpose, of functions. Right, Right. So what makes it. What it is, is this idea of purpose and function and aim and goal, Right. As a particular sense of that web of relationships."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2676.15,"end":2723.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And what human beings do with or how they understand a thing is what makes that thing the thing, or I should say, is a significant element of that. Right. For. So, for instance, you know, the. The coffee mug that is currently in my hand, I did in fact drink coffee out of it. You could say it's a cup. You could say it's ceramic. You could say it's a painted piece of ceramic. But what makes a coffee mug is that's what I use it for. And, you know, I could smash in a million pieces and make a piece of art out of it. And it's not a coffee mug anymore. It's art, probably terrible art, because I'm not an artist, but. But coffee mug ness is not a thing, like an independently existing thing. It's. It's just. It's. As you said, it's teleological."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2724.2,"end":2758.11,"speaker":"Fr Stephen De Young","text":"Right. It's. It's the purpose and. And the use and the way it is situated in that web of relationships. If I take my old iPhone and drop it on an isolated island, right, and people who have never heard of an iPhone find it, it will not be an iPhone. It might end up being a mirror. It might end up being a curiosity. Right. It might end up being so much garbage, but it won't be an iPhone because it will not be functioning as an iPhone."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2758.59,"end":2758.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2760.68,"end":2762.92,"speaker":"Fr Stephen De Young","text":"In any. In any real sense. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2763.16,"end":2771.64,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah. So. So to kind of summarize some of this, you know, being nature, these are dynamic."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2772.2,"end":2777.72,"speaker":"Fr Stephen De Young","text":"Nature is in the nature of A thing. Not nature. Like nature outdoors. Like. Yes, nature of a thing."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2777.72,"end":2791.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yes, right. Nature, capital and. Yeah, like that. These are, these are our verbs. You know, being, you know, be, be being, be, be the being. No, you are a human doing."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2792.05,"end":2803.65,"speaker":"Fr Stephen De Young","text":"Yes, yeah, right, that, yeah. And so we've already, we, we touched on this a little when we were talking about bodies and we were talking about Christ's divine, inhuman natures."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2804.05,"end":2805.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2805.57,"end":2821.07,"speaker":"Fr Stephen De Young","text":"That these are powers of capacities, these are dynamic ideas. Right, right. Not if you, if you reify them, if you turn them into things. Right. His divine nature is one thing and his human nature is this other thing and they're related in some way. Congratulations, you're an historian."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2821.39,"end":2843.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, right. And then also, you know, another thing we've talked about is what it means to be in the image of God. And it's better maybe to put, to say that we are imagers of God because talking about the image of God, people tend to think like, okay, what parts of what human parts, what human aspects are like something that God has. But the point is to do the works of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2843.74,"end":2847.82,"speaker":"Fr Stephen De Young","text":"Yes. We are created to function as the image of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2848.14,"end":2848.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2848.94,"end":2851.26,"speaker":"Fr Stephen De Young","text":"So to image God, we are the."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2851.26,"end":2896.28,"speaker":"Fr Andrew Stephen Damick","text":"Image of God and we are made to be imaging God at the same time. And you know, right before we go to break, this actually has just to try to bring it down. Okay, so we've talked about kind of very rarefied metaphysical terms here. Okay. But just to bring it down to maybe a soteriological level, even though this show isn't about apologetics, we occasionally do make some comparisons with other kinds of theology. So here's the question. What does it mean to be a saint? Right. What does it mean to be, again, be a saint. So, and I'm going to super simplify here, so I'm sorry. And for those of you who haven't read, I actually have a 400 plus page book where I do a lot less simplifying about these kinds of things. But anyway, to super simplify a little."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2896.28,"end":2897.04,"speaker":"Fr Stephen De Young","text":"Plug. Plug."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2897.44,"end":2898.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, thank you."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2898.36,"end":2898.72,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":2898.72,"end":3006.05,"speaker":"Fr Andrew Stephen Damick","text":"I didn't name the book, but available@store.ancient faith.com so. So what does it mean to be a saint? Well, you know, most kinds of Protestantism, if you are a Christian, truly you are a saint, period, end of story. You don't need to do anything to become more of one or whatever. Like that's just what you are. You're that thing. Whereas the way that, that Roman Catholicism tends to function. So this is the debate between one of the debates between them, it tends to be that you aren't a seed until you've sort of reached a certain point, which is why then there's this whole theology of satisfaction and merit and all that stuff. Right. Whereas orthodox theology, having this understanding of being, that it is a verbal thing. Right. And by that I don't mean it's just words. I mean it's action, it is teleological. You are a saint, and you need to become a saint in maturity, perfection. You need to become what you are. Of course, this is what St. Paul says as well. Now, I know full well that many Protestants, many Catholics would agree with what I just said about orthodox Christianity and if so, great. But nonetheless, there is this sense of both a reality and an urgency at the same time, an actualization of those. That's probably not the right word and still becoming at the same time. That is really core to orthodox soteriology, what it means to be saved. So before we go to break, is there anything you wanted to add to that or."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3006.05,"end":3026.87,"speaker":"Fr Stephen De Young","text":"Correct. Yeah, let's just a little to minorly flesh that out. I won't take too long, but. Right. So this is if, if you. You've heard this talked about outside of, and maybe even within some orthodox circles, especially when it comes to the Bible and biblical studies, they'll talk about what's called the eschatological tension between the already and the not yet."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3026.87,"end":3027.87,"speaker":"Fr Andrew Stephen Damick","text":"Not yet. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3027.87,"end":3076.98,"speaker":"Fr Stephen De Young","text":"Right. Eschatology being the study of the last things. So there's this idea that because, you know, we're all reading the Bible and we're smart people. Right. So. So people could see that, yes, St. Paul will sometimes refer to people as saints, and then other times refer to those same people as those called to be saints. Right. So that's what this tension is like. In some sense, they already are. In some sense, they're not yet, but they're called to be that. And that tension then gets resolved in certain issues on certain ways. So I think what Father Andrew was. Was referring to here is particularly if you take the example of, say, justification, right. In the. The traditional classical, like Protestant Reformation understanding, right. You're declared righteous. Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3077.3,"end":3077.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3077.7,"end":3101.78,"speaker":"Fr Stephen De Young","text":"You're declared saved, you're declared a saint. And so you are a saint whether or not you actually become a saint in your life, Right. Whether there's any visible change in your way of life, even if you remain a sinner. You know, Luther referred this as being similar, useless epicador. At the same time, you're just and a sinner. Right. So he resolved that tension to the one side, to the already."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3102.5,"end":3103.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3104.18,"end":3173.47,"speaker":"Fr Stephen De Young","text":"Classical Tridentine Roman Catholic theology then resolved it in the other direction, in the direction of the not yet. That you are in the process of becoming that, but you only are a saint once that process is complete. Right. So you're. You're called to be resolving it in that direction. Whereas I think the orthodox solution to that and, and what I think St. Paul is really getting at is that your identity is your telos, your end, your purpose, your goal. And so you are a saint because you're called to be a saint. The fact that that is your end and goal is why you are that already, because that's how identity is formed. And then so. So both of those can. Can coexist at the same time. And this is why St. Paul's always talking about growing to maturity. All this language of telos, maturity, perfection, completion. That as. As this goal, it's not you become something different, it's what you are comes to its fullness and completion."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3173.71,"end":3231.29,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Exactly. So before we go to a break, which we're going to do in just a second, I just want to add this little kind of caveat off to the side, which is. I know that a lot of these concepts are difficult. They're difficult for me. Like, I've conceptualized a lot of them now, but that doesn't mean that I have the habits of thought that are not materialist. Right. We still have those habits of thought. And you can't just flip a switch and decide, I'm not going to think this way anymore. It doesn't work that way. But nonetheless, these habits of thought, they can introduce a lot of distortions in our understanding of what Christianity is. And even though we can't necessarily just sort of radically change them, we can at least kind of enter into criticism of them and correct ourselves and return back as much as we're able. So. Right. So that's a lot of what we were just now doing. And frankly, it's what a lot of this show is about. So. All right, well, let's go ahead and go to a break, and we'll be right back after this."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3231.85,"end":3248.17,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3253.29,"end":3255.29,"speaker":"Fr Stephen De Young","text":"Are you struggling in your walk with Christ?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3255.61,"end":3259.93,"speaker":"Fr Andrew Stephen Damick","text":"Do you want to rediscover your reason for living, the person you were created to be?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3260.43,"end":3265.03,"speaker":"Fr Stephen De Young","text":"Renewing you, a priest, a psychologist, and a plan gives you the keys to."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3265.03,"end":3266.75,"speaker":"Announcer","text":"Unlock areas of your life that hold."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3266.75,"end":3269.23,"speaker":"Fr Andrew Stephen Damick","text":"You back from fully experiencing the renewal."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3269.23,"end":3271.87,"speaker":"Fr Stephen De Young","text":"And transformation God has in mind for you."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3272.19,"end":3273.91,"speaker":"Fr Andrew Stephen Damick","text":"Co authored by a priest and a."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3273.91,"end":3277.07,"speaker":"Announcer","text":"Psychologist, Father Nicholas and Dr. Roxanne Lowe."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3277.15,"end":3282.55,"speaker":"Fr Andrew Stephen Damick","text":"Renewing youg combines principles of spiritual growth with psychological tools to help you become."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3282.55,"end":3286.32,"speaker":"Fr Stephen De Young","text":"Your best self, fully connected with God's purpose for you."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3286.4,"end":3293.92,"speaker":"Fr Andrew Stephen Damick","text":"To purchase this book, please go to store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3298.32,"end":3314.41,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3316.73,"end":3333.69,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much, Voice of Steve. Always happy to have you with us. All right, this is the second part of the show. We do want to hear from you. 855 AF radio. All right, so we took a trip into metaphysics and definitely bent my brain a little bit."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3334.49,"end":3336.49,"speaker":"Fr Stephen De Young","text":"The metaphysics of identity yet."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3337.06,"end":3350.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Exactly. Right. Okay. So let's start easing into place. Man, there's so many good puns possible with this stuff. Yeah, okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3351.78,"end":3353.74,"speaker":"Fr Stephen De Young","text":"Good pun is an oxymoron, for the."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3353.74,"end":3359.62,"speaker":"Fr Andrew Stephen Damick","text":"Record, but it's what so much of our hymnography is based on. It's punning."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3359.86,"end":3360.66,"speaker":"Fr Stephen De Young","text":"Just putting that up."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3360.66,"end":3361.1,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3361.1,"end":3361.62,"speaker":"Fr Stephen De Young","text":"It's true."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3362.49,"end":3362.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3363.13,"end":3367.77,"speaker":"Fr Stephen De Young","text":"Not every wordplay is a pun. But anyway, we're digressing radically at this point."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3369.13,"end":3390.87,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, let's talk about place because we've talked about what it means to be. What, what is being. You know, humans are human doings. But, but, but does that have to. I mean, is it just humans or. I mean, obviously we're seeing that everything has its own sort of teleology. Right. So, okay, so what, what, what is. How does this work in terms of place, then?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3391.27,"end":3431.04,"speaker":"Fr Stephen De Young","text":"Yes. So, yeah, the first half of the show was not just me getting excited because they mentioned something about philosophy on WandaVision going off on a digression. I promise it was like the ground for this. Now we're going to talk about place and sort of the place where, ha ha, where this rubber meets the road is the idea of God being in a place. I don't know if this has ever jumped out at anyone, but this is, this is something that's going on all through the Old Testament, for example, where we say, well, yeah, God's everywhere. Right. I mean, there's not a place where he isn't but then he's like, really in the tabernacle."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3431.68,"end":3432.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3432.4,"end":3438.4,"speaker":"Fr Stephen De Young","text":"Or he's really in the temple. Like, he's. He's there a lot or something."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3438.4,"end":3444.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I mean, you know, or like, was it. Wasn't it. Was it. Was it Jacob who built an altar and called it Bethel because."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3444.64,"end":3445.12,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3445.24,"end":3447.8,"speaker":"Fr Andrew Stephen Damick","text":"Those in this place. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3448.04,"end":3455.96,"speaker":"Fr Stephen De Young","text":"Yeah. Beit El, the house or temple of God after he saw. Here we go again, ruining your Sunday school. It's not a ladder, it's a ziggurat."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3456.2,"end":3456.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3457,"end":3512.75,"speaker":"Fr Stephen De Young","text":"With a Jacob ziggurat. But anyway, that's another digression. So. Right, so there are these places, right, where God, like, extra is or something. Right. And so this is what we're going to talk about now. What does it mean that God is somewhere in particular, in addition to being everywhere in general. Right, yeah. And you can't really separate space and time in this regard. And here's what I mean. Any time that The Old Testament, for example, we talk about this in the New Testament too, but we'll use. The Old Testament says that God is in a particular place in this special way. He's in that particular place in a special way for a particular period of time."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3513.55,"end":3514.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3514.43,"end":3523.15,"speaker":"Fr Stephen De Young","text":"Right. So, like, it wasn't that he just happened to live on Mount Zion, and David found him there when he captured Jerusalem."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3524.76,"end":3527.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. Oh, look, honey, God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3527.8,"end":3538.52,"speaker":"Fr Stephen De Young","text":"God came to dwell there. Right. He came to dwell there on Mount Zion. Right. And then Ezekiel sees him at the time of the exile leave."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3539.56,"end":3540.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3540.08,"end":3551.25,"speaker":"Fr Stephen De Young","text":"Right. So his presence was no longer there. So it wasn't just sort of a set of spatial coordinates, but it was also. There's like, spatial temporal coordinates."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3551.49,"end":3552.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3552.29,"end":3555.41,"speaker":"Fr Stephen De Young","text":"For all the fans of wibbly, wobbly, timey, wimey stuff."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3555.65,"end":3641.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And. And I mean, and. And just to give an example, a much smaller example of this. Right. You know, I've. I've lived in 23 different homes. And so my family has long had the weird little habit of whenever we happen to be visiting one of the towns we used to live in, we might go and drive by the old homestead. Right. And. But it's interesting, you know, in, in, in, in. With only one exception, I've never, like, gone up to the door and knocked on the door and said, hi, I. I used to live here. Would you let me inside? Although there. So the one exception is I actually drove up and I was sitting out on the curb in front of the house, just sort of looking at this house that I lived in when I was a kid, and then the owners came out. Who is this guy looking at a house, and I told them, and they invited me in, which was really great. But. But the point being that, like, so when I went in there, it wasn't my house. I mean, it was the house, but it wasn't my house. You know, it was no longer my home. It was no longer being my home. And there's a. Just a distance, you know, when it's no longer functioning in that way, my presence is no longer there. It doesn't belong there anymore. Right. Yeah. So obviously we're not. I'm not just. We're not just saying that. You know, when it involves God, it's much bigger. But. But at least it's a way that we can understand what we're talking about in some small way."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3641.78,"end":3656.9,"speaker":"Fr Stephen De Young","text":"And when. When we're within the Divine Liturgy and we say Christ is in our midst, we don't mean that when liturgy is over, he departs from us and is gone somewhere. And then when we come back for liturgy, he shows up again."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3657.99,"end":3658.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3659.43,"end":3673.35,"speaker":"Fr Stephen De Young","text":"This is not as opposed to absence. Right. This is. This is. This is a contemporary example in our ritual life of that presence at a particular place for a particular time."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3673.75,"end":3674.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3674.23,"end":3754.7,"speaker":"Fr Stephen De Young","text":"And this is where we're going to go deeper into what we started to get into a little in the first half in terms of this idea of. Of spiritual realities or heavenly realities or eternal realities, however we want to, whatever language you want to describe them, intruding into the realm of human conscious experience and becoming part of that web of relationships at particular points in time, as we refer to, as we mentioned, we were going to go deeper into it. So again, that example of Christ being the Lamb slain before the foundation of the world is Jesus Christ, who died on a hill, an actual hill outside the actual city of Jerusalem. Right. In, as we argued in the Christmas episode, 30 A.D. and so that's the point at which that event didn't become true or become real, but was revealed and entered into the realm of human conscious experience. And the. That event, as I mentioned, can then become present again."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3755.98,"end":3757.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3757.34,"end":3767.49,"speaker":"Fr Stephen De Young","text":"So another day in another place can become that time and place, and that happens through ritual."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3768.37,"end":3769.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3769.65,"end":3776.85,"speaker":"Fr Stephen De Young","text":"Right. Ritual makes the current time and place that time and place. And in terms of the cross, we're going to do this on Holy Thursday."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3777.73,"end":3778.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3778.81,"end":3781.41,"speaker":"Fr Stephen De Young","text":"That's why when. When we sing, we sing today."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3782.45,"end":3782.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3782.81,"end":3783.65,"speaker":"Fr Stephen De Young","text":"Not back then."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3784.45,"end":3784.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3784.81,"end":3788.83,"speaker":"Fr Stephen De Young","text":"Today, because we've made that day ritually the original day."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3789.23,"end":3899.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And like, I mean, as an example, you know, we made the mention about Hellenism earlier. You know, Today is the 200th anniversary of the, the Greek War of Independence. But actually it's kind of not because they were on the old calendar. Right. So, so, but I mentioned that because it still is. Right, because the Greek people are celebrating it. So it is the anniversary of their war for independence. It doesn't matter that the clock hasn't turned a certain number of times or whatever it is, because this is them doing it. I mean, even on a much more mundane example, my birthday is always a fast day. No exceptions. It's a single fast day. And so ever since I become Orthodox, largely speaking, if my birthday gets celebrated, it gets celebrated on some other day because, I mean, it's kind of a drag to celebrate your birthday on a fasting day. Does that mean that the celebration is false? It doesn't mean that my birthday becomes that moment. Even though the date on the calendar, we didn't, as part of the celebration, say, okay, today, now is that date. We don't do that. But that's why, for instance, within the Orthodox Church, we've got a multiplicity of calendars in function. It can be theophany on the new calendar, and if you're 13 days later, you're in an old calendar church, it is again theophany. It's not, not really theophany, or the early one wasn't really theophany. It is. It is, because as you say, you're richly participating in it. You're actually doing the thing. So. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3899.49,"end":3907.61,"speaker":"Fr Stephen De Young","text":"And you have there is for any of these things, any of these mysteries, a paradigmatic date on which it was revealed, an archetypal point."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3907.77,"end":3908.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3908.25,"end":3929.74,"speaker":"Fr Stephen De Young","text":"So for the crucifixion. Right, we talked about that. But let me, let me give another example, because this really cuts to the core of how worship, particularly ritual worship, is understood in the Scriptures. Right. So we'll take the piece Feast of Feasts, Passover. Right. So there's an event where the Israelites are set free from Egypt."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3930.3,"end":3930.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3930.86,"end":3942.06,"speaker":"Fr Stephen De Young","text":"And as we've talked about, they're set free from bondage to the gods of Egypt. That's an event that happens as we, we've talked about before. The ritual celebration of that is actually described before it happens."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3943.5,"end":3943.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3944.22,"end":3963.76,"speaker":"Fr Stephen De Young","text":"And when that ritual celebration happens later, they don't say, when asked by their son, how is this night different than all other nights? They don't say, well, X number of hundred years ago on this date, our ancestors were set free from Egypt."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3964.08,"end":3964.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3965.04,"end":3968.24,"speaker":"Fr Stephen De Young","text":"They say tonight is the night that we are set free from Egypt."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3968.8,"end":3969.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":3969.6,"end":4046.77,"speaker":"Fr Stephen De Young","text":"Us sitting here, wherever. In Babylon, in Rome, in Munich, in. Right. In Toronto, Brooklyn. Yeah. Right. We tonight are set free from Egypt because ritually, that original archetypal day has been made that day. Right. Part of what happens in the separation between Judaism, Rabbinic Judaism, and Christianity is a debate over which event is the archetypal Pasca. Is the archetypal Pascha event, the exodus from Egypt to which it refers back to, which would make Christ's Last Supper just an instance, the Mystical Supper an instance of that event projected forward? Or is the archetypal event the death and resurrection of Christ, of which freedom from Egyptian bondage was a retrojection into the past, was an intrusion into the past. The Christ event intruded into the past and into all those subsequent passed overs, and now into the future."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4047.81,"end":4048.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4048.85,"end":4056.78,"speaker":"Fr Stephen De Young","text":"And when I say there was a dispute, this dispute is enacted in the liturgics of Rabbinic Judaism."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4058.38,"end":4058.86,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4059.18,"end":4073.26,"speaker":"Fr Stephen De Young","text":"A lot of our non Orthodox Christian friends like to at some point go and experience or see or watch or reenact a Passover Seder, right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4073.26,"end":4076.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I have family members who do that."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4077.42,"end":4081.58,"speaker":"Fr Stephen De Young","text":"Yeah. And they generally react to it like, oh, wow, there's all this symbolism about Christ there."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4081.97,"end":4082.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4083.17,"end":4093.33,"speaker":"Fr Stephen De Young","text":"And this is an unfortunate historical misinterpretation because the way a Passover Seder is celebrated today is a product of Rabbinic Judaism, later Rabbinic Judaism."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4093.57,"end":4094.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4094.45,"end":4145.72,"speaker":"Fr Stephen De Young","text":"And there are things that are deliberately borrowed from Christian liturgics. Right. This is the bread of our suffering. Right. Says the. Says the. The Father when he holds up the bread. Okay. That was not in the Mystical Supper. That was not in Passover before about the third century AD that was taken from. This is my body. It went the other way. Wow. So the Passover Seder was restructured in Rabbinic Jewish liturgics to explicitly make the claim that the Exodus, Passover, the first Passover, is the archetypal and paradigmatic Passover of which the mystical supper isn't, is an instance, not the other way around."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4146.44,"end":4158.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow. Okay, so before we get deeper into that, we actually do have someone calling. So Austin is calling, and. Austin, are you there?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4159.97,"end":4160.45,"speaker":"Announcer","text":"Yeah, I'm here."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4160.45,"end":4216.82,"speaker":"Fr Andrew Stephen Damick","text":"Can you hear me? We can hear you. So, Austin, welcome to the Lord of Spirits podcast. What is your question? Your comment for us tonight. All right, so it's not really related to today's episode, but it was regarding sort of the life after, Well, I guess the world to come, I would say. And it's like. Is it like a. Or do we have a teaching? Is it the black and white to where everybody experiences, you know, the eternal condemnation the same, and everyone experiences the eternal life the same, or is there an idea of some sort of gradient differences so it's actually deeply related to what we're talking about? Does that make you happy to know."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4216.82,"end":4217.1,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4218.86,"end":4363.06,"speaker":"Fr Andrew Stephen Damick","text":"That does, actually? Yeah. Yeah. No. So here's how I would say it's related. So you're, you know, let me make sure I'm getting your question right. You're essentially asking if people who are among the saved, are they all having the same experience or some people having a sort of better experience than others, and then those who are among the damned, are some of them having a worse experience than others? Is that what your question is? Yeah, that's pretty much exactly it. Right. So here's how it's related. In my understanding. We started out by saying that the world as we know it is essentially a product of human consciousness. So that means that the orientation that you have towards God and towards participating in his works, or towards participating in the works of the demons, the orientation that you have is going to be the key thing in terms of what your experience of that participation is. Right. So why is it, even in this present life, that there are saints who experience the presence and the power and the love of God in a way that is way more intense than anything I've ever had in my life? You know, if you, if you believe what they say, they're clearly experiencing something that I'm not. And, and certainly there are people who have had much more demonic experiences in life than I have had. And it's the same, really, in the life of the age to come. It's because of the way that we orient ourselves towards it. You know, why is it that saints have these kinds of experiences? It's, you know, look at their biography and you're going to see a lengthy, usually and definitely intense dedication to prayer and to selflessness and to almsgiving and, you know, all of this kind of stuff. Right. They have oriented themselves to. To do the works of God, and so they experience God in a much more intense way than I do. And, you know, the life of the age to come is simply the fullness of all of that. Father Steve, am I getting that right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4364.42,"end":4373.3,"speaker":"Fr Stephen De Young","text":"Yeah, well, and we'll. I mean, eventually we're going to do an episode on the noose. And the noose is a means of perception and experience and spiritual experience."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4373.38,"end":4374.74,"speaker":"Fr Andrew Stephen Damick","text":"We loop back around to everything."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4375.16,"end":4395.4,"speaker":"Fr Stephen De Young","text":"Well, yeah, we'll. We'll get into that more deeply. But yeah, there's also firmly within The, The. The orthodox Christian conception, the idea that the saints in glory, which hopefully will include us, will continue to progress into. Into eternity. Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4395.56,"end":4396.92,"speaker":"Fr Andrew Stephen Damick","text":"From glory to glory."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4397.24,"end":4457.1,"speaker":"Fr Stephen De Young","text":"Right. That it's not just sort of this static state where you go to heaven and you're sitting on a cloud or everything's made of milkshakes or all you could eat frozen yogurt or whatever, that we're continually. We have a continually deepening experience of. Of God. There is not necessarily a corresponding teaching that all of those under condemnation, things will just get worse and were infinitely worse and worse, at least I don't see that anywhere. And in fact, there are a lot of clues, and we'll talk about a big one of those clues in our very next episode about the underworld. That, that they're. They're. In terms of the experience of. Of those who face eternal condemnation. That there is some differentiation there's."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4457.25,"end":4457.49,"speaker":"Fr Andrew Stephen Damick","text":"There."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4458.29,"end":4468.69,"speaker":"Fr Stephen De Young","text":"And that differentiation there is not that, oh, your sins were worse, so you're going to get punished harder. It's more of a. A distinction of mercy and grace being shown."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4469.57,"end":4470.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4470.05,"end":4473.09,"speaker":"Fr Stephen De Young","text":"But we'll get into that more fully in the very next episode."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4473.65,"end":4486.5,"speaker":"Fr Andrew Stephen Damick","text":"So does that help you out there, Austin? Yeah, that. Great answer. And I can't wait for the next episodes. Oh, boy, it's going to be so fun. So. All right, well, thank you very much for calling in tonight. All right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4486.5,"end":4487.58,"speaker":"Announcer","text":"Thank you for taking my call."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4487.98,"end":4507.18,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely. All right. So, yeah, I saw on the call board what his question was, and I was like, oh, this is cool. So, yeah, it's just another, like, it's another facet for looking at these things. Right. Again, this teleological understanding of what reality itself is."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4508.31,"end":4581.73,"speaker":"Fr Stephen De Young","text":"Right, right. And the, you know, continuing what we've been talking about, that this is what the Scriptures see as the primary work of the Holy Spirit. The Holy Spirit creates. Right. As we said, the Holy Spirit is hovering over the waters, hovering over the chaos, brooding over it. It's bird language in Genesis 1 and is involved in creation and then in recreation in the way that the New Testament authors speak of the Holy Spirit. But also the promise of the Holy Spirit in the prophet Joel and in Jeremiah and Ezekiel is of recreation being put back in order and having the correct web of relationships restored. Right. And both of those pieces are equally important. And then also metamorphosis and transformation. Yeah, right. Not coincidentally, this is how we understand what happens in the Eucharist in. In the Orthodox Church, that it's the Holy Spirit who makes the bread and wine to be the body and blood Of Christ."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4582.21,"end":4676.84,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah, yeah. So we actually have. We got a message with a related question. This was a written question. And I just thought this was a good one to put in here because I think it's a good transition to the next thing we're going to talk about. So Laura asks this. She emailed this to us, if I remember correctly. She says, how does the Celtic concept of thin places fit into these ideas of sacred geography? They're described as spiritually porous places where the barrier between the seen and unseen grows thin. Are some of these sites sinister and others good? In Scotland and Ireland, some of these were pre Christian pagan sites that later became sites of Christian churches or saints shrines. And I think that this feeds really. So thank you for that, Laura. I think this very much feeds in what we were talking about, especially when you. You mentioned the idea that God is sort of really present in some places at certain times. But then there's also this. There's this other side which is like, okay, if you go to this particular place, you're more likely to have some kind of experience of the other world, of God himself, of the saints. Is there something that's sort of stuck there about the materiality of that place, that it's become spiritualized? Or is it the fact that people go there or kind of, you know, porque no los dos as the. You know, why not both, Right. You know, like what's going on there with. With thin places? It's a cool concept."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4677.32,"end":4755.1,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah. And. And we got into this a little bit in our first episode on Sacrifice. Right, yeah. That the earliest ritual sites are places where there were encounters with spiritual beings. Right, Right. Unfortunately, some of these are, you know, negative spiritual beings. Right. Not just encounters with God like in the Old Testament, but also encounters with the demonic and other spiritual realities. And so these places were marked and became ritual sites precisely because, as we were saying, part of the function of ritual is to make a previous day today, to make a previous event recur, to participate in that event. Right. To realize it again, to represent it, not represent in some kind of disconnected way, but re. Present it. And so you see this a lot with some biblical examples. Right. You see this a lot with standing stones, stone monuments. So this isn't just something the Israelites did. This is something all their neighbors did. Right. You would. You would put a standing Joshua, you know, when they cross the. The Jordan, puts this standing stone there with an inscription on it saying, this is what happened here."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4755.9,"end":4756.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4756.94,"end":4775.67,"speaker":"Fr Stephen De Young","text":"And so the. These other places the same way, right? These places. And so a stone would be put there. And. And ritually we have a lot of rituals. Ugarit did this a lot. Right. So there were these places where. That was the place where something happened in the story of baal."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4776.15,"end":4776.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4776.87,"end":4803.89,"speaker":"Fr Stephen De Young","text":"Where one of these events in baal's was, you know, associated with this place. And there would be a standing stone there with an inscription, and they would go and anoint the stone as part of the ritual of making that event present again. Right. And then reenacting the story, sometimes grotesque stories, but reenacting those stories ritually to make that event present again to. To participate in it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4803.89,"end":4820.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting that even here, like, here in the US we have historical markers, but, like, why put those up to, to begin with if it's not in some way even very reduced, to try to ritually participate in the thing that happened there."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4820.53,"end":4820.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4820.89,"end":4821.25,"speaker":"Fr Andrew Stephen Damick","text":"You know?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4821.25,"end":4828.05,"speaker":"Fr Stephen De Young","text":"Right. And then there's some people take it further. They don't just go and read the plaque at Gettysburg. They get dressed up and go and reenact the battle."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4828.68,"end":4829.76,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4829.76,"end":4844.52,"speaker":"Fr Stephen De Young","text":"To participate in it themselves. Right. And. And connect. Right. And to try to re. President it again in. In. In this kind of ritual way. And this. So this is why these sites then become Christian sites, because this is, again, a recreative act."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4845,"end":4845.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4845.4,"end":4853.48,"speaker":"Fr Stephen De Young","text":"This place has been the place where BAAL did xyz. Now this is going to be the place of this martyr."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4854.37,"end":4859.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. This is the place where God put the smack down on this particular demon."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4859.33,"end":4869.57,"speaker":"Fr Stephen De Young","text":"Right. It's going to be put in a different order now and a different set of relationships. And so this place is now going to be a different place than this place was previously."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4870.05,"end":4881.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Cool. Cool. All right, so I know that our. The next thing that we're going to discuss is about the compass directions."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4881.1,"end":4887.66,"speaker":"Fr Stephen De Young","text":"Yeah, we're getting close to our actual topic. Yeah, we're closing in on the actual topic of the podcast."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4887.9,"end":4903.5,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Sacred geography. A lot of groundwork, as always, has to be laid before we get there. Yeah. Yeah. Okay, so cardinal directions. What's that all about?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4904.14,"end":4931.37,"speaker":"Fr Stephen De Young","text":"Right. Yeah. That's not the guy who tells you where things are at the Vatican gift shop. Cardinal directions. Oh, man, this is like Basil Exposition. These are the four main compass directions. Yeah, yeah. And these have clear associations. And when I say that the compass directions have associations, this means they're not identified with a particular place."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4932.73,"end":4933.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4933.53,"end":4944.96,"speaker":"Fr Stephen De Young","text":"No matter where you are, east is east and west is west. Right, right, right. And north is north and south is south. Unless you're at the north or South Pole, which ancient Israelites weren't, so they didn't have to worry about it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4945.68,"end":4951.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. What do you do? It's all south from here. If you're at the North Pole, I don't know."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4951.52,"end":4971.08,"speaker":"Fr Stephen De Young","text":"Yeah, right. Nowhere to go but down. So probably the most familiar one of these is. We'll kind of go from most to least familiar. Probably that's through these. Probably the most familiar is east, the association of east."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4971.4,"end":4973.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's where all the good stuff is."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4973.48,"end":4983.16,"speaker":"Fr Stephen De Young","text":"Right, Right. Christian churches are supposed to face east, but as we've been discussing, no matter what direction your church points, it points east."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4983.64,"end":4987.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Christian graves face east."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":4987.32,"end":5008.46,"speaker":"Fr Stephen De Young","text":"Face east. We have the, the hymn talking about the east of the highest that we talked about in our, our Christmas episode. And that is because we're told in Genesis 2 that when God plants the Garden of Eden, when he plants paradise, he does it in the east."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5009.42,"end":5009.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5010.06,"end":5024.99,"speaker":"Fr Stephen De Young","text":"And he doesn't say east of what? Yeah, he doesn't say east of blank. He planted a garden. It just says he plants it in the east. And you may say, well, that, that means east of Jerusalem. Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5025.15,"end":5025.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5025.79,"end":5035.07,"speaker":"Fr Stephen De Young","text":"Well, here's the problem later on, as we're going to talk about the third half, Jerusalem comes to be identified as the place where paradise was."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5035.79,"end":5036.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5036.59,"end":5038.19,"speaker":"Fr Stephen De Young","text":"So it can't be east of itself."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5039.07,"end":5039.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5039.63,"end":5048.92,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, it's just the East. The east is the place where paradise is. The east is the place where God dwells."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5049.48,"end":5049.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5050.12,"end":5054.68,"speaker":"Fr Stephen De Young","text":"So if you're gonna face toward God, you face east because that's where paradise is and where he dwells."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5054.76,"end":5071.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, interestingly, again, this points to a teleological reality. So facing east is a matter of facing east. You know, it's relational. It's relational. It's volitional, it's orientation. You're orienting yourself, literally orienting. Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5073.61,"end":5093.37,"speaker":"Fr Stephen De Young","text":"Toward the Orient. Yeah. So probably the next more familiar is north, which may not be immediately familiar to anyone, but north, which we think of north as up. Right. When we draw maps, north is pointing up at the top of the map."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5094.03,"end":5094.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5094.67,"end":5104.51,"speaker":"Fr Stephen De Young","text":"That wasn't the case in Ancient Near Eastern maps. Ancient Near Eastern maps, up was what we would call west. Up was the Mediterranean."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5105.55,"end":5106.19,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5106.35,"end":5115.87,"speaker":"Fr Stephen De Young","text":"Which means that north was to the left. So that already gives you a clue that there's something sinister about it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5116.03,"end":5118.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Literally, for those of, you know, a."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5118.43,"end":5128.48,"speaker":"Fr Stephen De Young","text":"Little Latin, it is the left hand side. And so the north is, throughout the Scriptures, the abode of evil."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5128.96,"end":5130.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5130.4,"end":5150.99,"speaker":"Fr Stephen De Young","text":"So BAAL and His council of gods met on Mount Zaphone. Zaphon is Hebrew for north, the mountain of the north. One of his titles was BAAL Zaphon. Right. BAAL of the North. And it wasn't just that there were a lot of BAAL worshipers in Lebanon, though."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5150.99,"end":5151.99,"speaker":"Fr Andrew Stephen Damick","text":"There were. Yeah, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5152.31,"end":5152.95,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5152.95,"end":5156.87,"speaker":"Fr Andrew Stephen Damick","text":"It's. It's not. Yeah, it's not about Lebanon as the abode of evil."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5157.19,"end":5190.11,"speaker":"Fr Stephen De Young","text":"Right, right, right. No, but this is the place of the north. So when we read the Resurrection Gospel in matins, we read it to the north. So we proclaim the Gospel of Christ's resurrection, the news of the defeat of the powers of evil. We proclaim it to them. Right. By. By facing toward them. And my understanding is that in Western liturgics, traditional Latin liturgics, they read the gospel all the time toward the north."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5190.43,"end":5195.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Not. Not now, but. But traditionally, that's the way it's done."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5195.51,"end":5203.07,"speaker":"Fr Stephen De Young","text":"Yeah, right. That they would always read the Gospel for the same reason. Right. You're telling them about Christ's resurrection to proclaim their doom."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5204.54,"end":5206.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. The gospel isn't good news for everybody."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5206.94,"end":5300.25,"speaker":"Fr Stephen De Young","text":"Right, so then that's north west, as we mentioned, would be the Mediterranean Sea. And the sea, as we've already talked about, the waters of the sea is chaos. Right. Chaos or destruction. And then south, then south is kind of interesting in that the south, when you talk about things in the south, the south is sort of always sort of the. The. The predecessor or precursor civilization, not in the BioWare RPG sense, but in the. In the. In the sense of. Of civilization is seen to come from the south to the north. So the Greeks believed their civilization came from Egypt. The Akkadians, Akkad, believe their civilization came from Sumer. And then importantly, in the Old Testament, there are all these texts that refer to as the Yahweh from the south. Passages where Yahweh, the God of Israel, comes up into. Comes to dwell on Mount Zion, but he comes from, like, Edom and Midian. And that's related to the fact that Moses learns about Yahweh from Jethro, the priest of God Most High, his father in law, who's a Midianite. The Edomites and Midianites had continued to worship Abraham's God, and Israel receives that worship back from them. Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5300.81,"end":5316.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. There's a sense that the south is kind of the ancient, the old school, the past. Right. You know, where I live, obviously, that would be Lancaster county, where all of the. All the Amish people live and the Mennonites and Stuff, so. Yeah, See, it works here in Pennsylvania, too."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5316.78,"end":5360.94,"speaker":"Fr Stephen De Young","text":"Yeah. And this is, you know, the Queen of Sheba who comes to visit. Solomon is the queen of the south. Right, right. Not just because the kingdom, or the Sabaean kingdom, the Saban kingdom, is, you know, in Ethiopia and Yemen, but that. It's this ancient. Right. This ancient civilization comes to see Solomon for his wisdom. Right. It's sort of a flip of the natural thing, right. You would expect Solomon, as the king of this sort of newer dynasty, to go and inquire of the ancients. But it's the sort of this reverse of that, right, where the ancients come to inquire of him because he is. He knows Yahweh, and so he has the true. The true sort of wisdom."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5361.42,"end":5426.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I should add here, by the way, that some of my Baltic ancestors, there was a legend among them that. That civilization came to them from. From Rome, that they. That the ancient Lithuanians were, in fact, Romans who made their way north at some point. So. But I mean, the same thing, like, even the same thing holds, like, within Norse mythology, right? Like, if you read the Eddas at the beginning of the prose Edda, which, I mean, the prose Edda is actually written by a Christian. So it's interesting that he puts it this way. Snorri Sturluson, he. He says that. That what the. The Norse worshiped as gods were actually heroes who had escaped from Troy. Right. So there's, again, this sense that. That, you know, what's way down south somewhere, that's the source of. Of our, you know, our civilization and order and. And all that kind of stuff. So, yeah, it's interesting how. How that. That theme, you know, gets reused over and over and over again. That south is where all the civilization comes from. So. Father Stephen, you still there?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5426.98,"end":5427.62,"speaker":"Fr Stephen De Young","text":"Yes, sir."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5427.94,"end":5431.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Just. I heard some crackling. I'm like, oh, no. Are we. Are we having those discussions?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5431.46,"end":5435.06,"speaker":"Fr Stephen De Young","text":"Yeah, no, I was just trying to prevent the. The Mexican radio station from."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5435.22,"end":5442.18,"speaker":"Fr Andrew Stephen Damick","text":"Oh, oh, good. That's civilization from the south breaking through it on you right now."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5442.34,"end":5442.82,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5443.77,"end":5446.69,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of good food from down there. So although you're in Louisiana, you have."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5446.69,"end":5451.77,"speaker":"Fr Stephen De Young","text":"A lot of good food there as well. Yes, yes. We have the easiest lens ever with all the seafood."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5453.53,"end":5455.25,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5455.25,"end":5455.77,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5456.01,"end":5518.57,"speaker":"Fr Andrew Stephen Damick","text":"So the way that this plays out is like, for instance, we have the tradition of praying towards the east, but it's towards the east, not towards, for instance, Jerusalem, in which you would have to adjust which direction. Which, I mean, by contrast with Muslims, Right. Who always pray towards Mecca. They try to figure out where Mecca is and pray in that direction. It's a kind of a materializing of the place of the direction of prayer. Right. There's a spot but ancient Israel and of course the church as Israel prays toward the east from wherever you are, it's always east. So, yeah, it's not towards a particular spot. It's relational. It's relational. So yeah. Yeah. All right. Well, the second half was actually relatively briefer because we didn't have to do as much metaphysics this time. So we're gonna get go ahead and go to break and we'll be back with the third half of the Lord of Spirits. So let's go to break."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5519.05,"end":5614.71,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice. Prayer, Fasting and Almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless. We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5617.75,"end":5665.58,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of the Lord of Spirits podcast. Before we get into talking about the mountain of God. Finally. Now here's the topic, right? One of the main topics of tonight's show, I just want to actually lay out for you. I put this in our in our Facebook group, but I just want to lay out for everybod everybody kind of roadmap for our next few episodes. So today we're introducing the idea of spiritual Geography of Sacred Geography. And now we're going to be talking about the Mountain of God. Next time, two weeks from today, we're going to be talking about the underworld. And then two weeks from then. Well, my unofficial. I will have to see if this passes muster with the brass. My unofficial title for that one is the Lord of Spirits Goes to Hell. But we're gonna help."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5665.58,"end":5668.06,"speaker":"Fr Stephen De Young","text":"You have the most metal posca ever."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5668.54,"end":5768.04,"speaker":"Fr Andrew Stephen Damick","text":"That's right, Absolutely. And then post Pascha. Not immediately right after, but the week. I think it's the week after that. So, remember, we're on the second and fourth Thursdays of the month, so the second Thursday of May, we're gonna be doing a Q and A episode, and it's gonna be just Q and A. So we actually had a couple of calls tonight that were not super connected to what we're talking about. So we told them that, you know, please call back later. You know, so we will be doing a Q and A episode. So that's going to be a lot of fun. And the other thing I want to kind of let everybody know about is that because we get questions about this, it seems like every other hour in our email or in the Facebook group in particular, is that he doesn't like to toot his own horn. But Father Stephen has a book coming out, and, God willing, it's going to be coming out right after Pascha. I mean, these timelines are always a little, you know, flexible because of the printing and all that kind of stuff. But it's called the Religion of the Apostles, and it's going to be covering a lot of the themes that we talk about in Lord of Spirits. And. And this is the main reason I mentioned this. One of the questions we constantly get is, can you give us some suggested reading for some of these topics? And you know what? There's going to be a bibliography. There's going to be a bibliography and a big index in the back. So it's. I've. I've seen the manuscript. Manuscript. You guys are going to love it. So it's just a tool again, to kind of help us to. To talk about and to. To understand some of these same topics better. It's called the Religion of the Apostles. So that's coming out, God willing, shortly after Pascha. So, all right, the Mountain of God. Here we are now, finally coming down."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5768.04,"end":5776.12,"speaker":"Fr Stephen De Young","text":"The mountain, and everyone has their own opinion. That's a reference you didn't get. But anyway, I don't know, it sounds."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5776.12,"end":5777.52,"speaker":"Fr Andrew Stephen Damick","text":"Biblical, so I'm going to laugh. So."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5777.95,"end":5788.51,"speaker":"Fr Stephen De Young","text":"Wasn't at all but anyway, quite the opposite, almost. So the. We're. We're talking about not just any mountain, but the mountain of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5788.67,"end":5789.95,"speaker":"Fr Andrew Stephen Damick","text":"The mountain of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5790.19,"end":5798.99,"speaker":"Fr Stephen De Young","text":"Right. And there is a mountain of God, but several mountains have been being the mountain of God at different points in time."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5799.47,"end":5809.35,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Have been being. Gotcha. Wait, the plut. The double Pl. Perfect. Pat. No, sorry. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5812.79,"end":5817.91,"speaker":"Fr Stephen De Young","text":"This is part of your penance as a grammar Nazi is having to be things like that to the English."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5817.91,"end":5818.39,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5821.59,"end":5854.64,"speaker":"Fr Stephen De Young","text":"So when we're talking about the mountain of God, we're talking about, first of all, the place where God dwells. But another biblical name for it is the mountain of assembly, which in Hebrew is har moid. Har is mountain and moed is assembly. That's. That's the same word for assembly that gets translated in the Greek Old Testament as ecclesia, which of course gets translated as church in the New Testament."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5854.72,"end":5855.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5855.76,"end":5865.62,"speaker":"Fr Stephen De Young","text":"And so sometimes our English translations obscure that. The idea that the church is the same assembly as the assembly we're talking about, which is God's divine council."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5866.34,"end":5866.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5866.78,"end":5908.66,"speaker":"Fr Stephen De Young","text":"Which meets atop the mountain. So. And. And so this isn't. I mean, you're probably immediately aware that the idea that. That God lives on a mountain and even that the divine council meets on a mountain. We've already mentioned mountains of phone in BAAL worship, but probably Mount Olympus springs to mind for a lot of people. Lots of gods beat on mountains. The Egyptian creation story, it starts on a mound. So this is kind of a universal thing that there was an understanding by everyone in the ancient world, a preserved memory that God lives on top of a mountain."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5909.3,"end":5916.51,"speaker":"Fr Andrew Stephen Damick","text":"Wait, is this. So why in the Psalms it says, I will look up unto the hills from whence cometh my help. Is that what it is?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5916.51,"end":5918.83,"speaker":"Fr Stephen De Young","text":"That's actually different than how we usually read it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5919.07,"end":5920.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right, all right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5920.15,"end":5934.35,"speaker":"Fr Stephen De Young","text":"That's actually just throwing that, actually. Yeah, yeah. I lift up my eyes to the hills. I'll go ahead and talk about. This is actually talk. That's one of the songs of ascent, when people are on their way to Jerusalem. And that reference to looking up to the hills, that's a reference to the high places of the pagan gods."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5934.67,"end":5936.59,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5936.59,"end":5952.09,"speaker":"Fr Stephen De Young","text":"That you have to go past on your way. And that's why the next thing is I lift up my own eyes to the hills from whence cometh my help. Oh, I gave you the old KJV there. From whence cometh my help. My help comes from Yahweh the Lord. Yeah, not from any of them."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5952.09,"end":5961.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, not exactly. It's a contrast. Okay. All right. Not those hills. But the hills. Right? Yeah. But the mountain. Right, Right. Don't settle for lesser hills. People."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5961.25,"end":5967.17,"speaker":"Fr Stephen De Young","text":"Yes. And so. Or mounds. Or just pumps, Barrows."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5967.41,"end":5967.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5971.09,"end":5978.45,"speaker":"Fr Stephen De Young","text":"So. And this. This, of course, is why we have ziggurats, step pyramids. Right, Pyramids."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5979.33,"end":5983.89,"speaker":"Fr Andrew Stephen Damick","text":"These are the hanging Gardens of Babylon, which all civilization players know about."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":5984.45,"end":6036.9,"speaker":"Fr Stephen De Young","text":"Right. Recreating the Mountain of God. Right. These are human recreations of the mountain of God as temple so that they can ascend it ritually. Tower of Babel. Right. That's. That's what's going on in the. In the Tower of Babel, the ziggurat of Babel. And then Hanging Gardens of Babylon being a really good example. There was seen to be a garden on top of the mountain. Right. In which the most high God and the divine council dwelt. And they dwelt in particular, intense on top of the mountain. And so this is going on in, for example, in Hebrews, when it talks about how. How Moses came into the sanctuary on top of Mount Sinai."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6037.06,"end":6037.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6037.5,"end":6059.62,"speaker":"Fr Stephen De Young","text":"And created the tabernacle as a sort of recreation and icon of the place that he experienced there. And the heavenly sanctuary on top of the mountain, that's literally the tent, the tabernacle, where God was dwelling and where the assembly was meeting on top of Mount Sinai. Because Mount Sinai was at that time the mountain of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6060.18,"end":6067.02,"speaker":"Fr Andrew Stephen Damick","text":"So when they moved around with the tabernacle, would they then try to erect it up on top of something? Or does it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6067.02,"end":6096.13,"speaker":"Fr Stephen De Young","text":"I mean, if they could. It was at the center of the camp. We actually get in the Book of Numbers, which I know is everyone's favorite, it actually describes the detail where each tribe camped, like, the exact layout of how the camp would be and how they would file in and how they would file out when they broke camp. So, yeah, it was in the center. So that even if it was on a flat, you still have this idea of this is the peak. Right. It's the center."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6096.13,"end":6097.13,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6097.13,"end":6119.61,"speaker":"Fr Stephen De Young","text":"Right. It's the. It's the focus. And so that's why I have a tabernacle. This is also related to why on the Mount of transfiguration, when St. Peter sees Christ meeting with the divine council of the persons of. Of the prophet Elijah and. And Moses, he says, let's build three tents."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6120.09,"end":6120.89,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6120.89,"end":6128.58,"speaker":"Fr Stephen De Young","text":"Right. One for you and one for Moses and one for Elijah, because he sees, oh, Mount Tabor here has become the mountain of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6129.46,"end":6129.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6130.02,"end":6139.54,"speaker":"Fr Stephen De Young","text":"This is. This is the place for us to dwell. And so the first Sort of instantiation we see in the Bible of the mountain of God is Eden itself."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6140.1,"end":6159.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Where you've got. And, and if I recall correctly, it doesn't explicitly say that in, in the Genesis text that it is on a mountain, but it does say there's four rivers flowing out from it, all in different directions, and they're all obviously flowing out from it. So that means they have to be going downhill."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6160.53,"end":6173.61,"speaker":"Fr Stephen De Young","text":"Right, right. So logically, we are at an elevated spot and those rivers are presented as the. The Nile, the Tigris, the Euphrates and."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6173.61,"end":6176.53,"speaker":"Fr Andrew Stephen Damick","text":"The Danube, which don't flow from any."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6176.53,"end":6226.8,"speaker":"Fr Stephen De Young","text":"Actual spot, actual geographical point. Right. But the idea is that the whole world is being watered, being nourished by this water that's coming out from the presence of God for the place where God dwells there in Paradise. And while the four rivers just sort of suggest that, if you read Ezekiel 28, verses 13 through 16, which is part of Ezekiel's prophetic recounting of the fall of the devil, he refers to there to Eden as a mountain. Yeah, directly. So this is the mountain of God presented sort of as itself and not directly associated with any particular physical location as much as History Channel documentaries would want you to believe otherwise."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6226.96,"end":6229.84,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like the archaeological search for Eden."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6230.08,"end":6256.59,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. So, so, yes, but, but going forward, mountains that are in the world and that you could go visit become the mountain of God for certain periods of time. Right. Temporal spatial coordinates. Right. As we said, one of them we already mentioned Mount Sinai."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6256.83,"end":6257.39,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6257.72,"end":6284.78,"speaker":"Fr Stephen De Young","text":"Right. Becomes the mountain of God. And Moses ascends. He enters into the council. He enters into the, the sanctuary, the tabernacle there, as Hebrews talks about. St. Stephen in his sermon in Acts also references this. I'm sure at some point we'll. We'll end up doing an episode where we talk about the law being given by angels, which is referred to several times in the New Testament and is nowhere in the Old Testament."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6285.01,"end":6286.85,"speaker":"Fr Andrew Stephen Damick","text":"It. Right, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6288.77,"end":6306.61,"speaker":"Fr Stephen De Young","text":"So. Right, so that's, that's our first one. Our second one then is Mount Zion. Right. Where. Where the temple is ultimately built. And as we mentioned, David didn't come into the city and find God there and say, oh, hey, I found the mountain of God."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6306.77,"end":6315.1,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, we got his address, we tracked him down. Hey, you guys, God lives here, Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6315.42,"end":6338.75,"speaker":"Fr Stephen De Young","text":"But Zion, when it becomes the place where God dwells, becomes the mountain of God, becomes Paradise. And so when the temple is built, all of the iconography of Eden, Right, the pomegranates, the. The fruit trees, all of the Decorations and iconography of the temple are built as a garden. Right. It's now a garden on top of a mountain."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6339.54,"end":6339.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6340.18,"end":6368.81,"speaker":"Fr Stephen De Young","text":"Because this is the place where God is going to dwell. Until, as we mentioned, Ezekiel sees. Right. It leaving. But the temple, the idea of a temple in the Scriptures maintains this connection to paradise. Right. So when Ezekiel prophesies a future temple, he describes it as having waters flowing from it. That water the whole earth. Right. Which is a clear reference back to Eden and the four rivers."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6369.37,"end":6371.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6374.09,"end":6382.05,"speaker":"Fr Stephen De Young","text":"Then when we move into the New Testament and some of our, some of our listeners are probably hearing this right now instead of us, if they're in."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6382.05,"end":6382.41,"speaker":"Fr Andrew Stephen Damick","text":"Church."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6384.65,"end":6394.69,"speaker":"Fr Stephen De Young","text":"Or they recently heard it, or they heard it this morning and last night. But the Theotokos coming to be described as paradise."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6395.01,"end":6430.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, exactly. There's, there's, you know, not only is there the image, of course, of, of the Theotokos as the eastern gate through which the Lord enters, but then, but then, you know, there's like, there's the, the, the, the hymn of the cut of his. He is the cross where we sing Thou art the mystical paradise. Right. Where she's described as a mystical paradise endowed with speech in some cases. Why? Because she's the place where God dwells. Right. And if she's the place where God dwells, then that makes her into paradise. Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6430.91,"end":6433.67,"speaker":"Fr Stephen De Young","text":"She is paradise. Well, God is dwelling within her. Yes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6433.67,"end":6437.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. That's what paradise is. It's the place where God dwells."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6438.19,"end":6470.88,"speaker":"Fr Stephen De Young","text":"Right. And the reason why we talk about. And last night at vespers, we read that section of Ezekiel's temple prophecy about the facing east. This isn't just a wild allegorical thing. Right, right. Allegorical detail. Right. It's because of the understanding, pretty much unanimously, the church fathers, because they're getting it from the New Testament that Christ is Ezekiel's temple. We especially see this in the Johannian literature."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6471.2,"end":6474.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right, right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6474.88,"end":6486.72,"speaker":"Fr Stephen De Young","text":"And St. John in his Gospel, makes this about his point about as bluntly as you can, because he presents the episode where Christ says, destroy this temple and I will rebuild it in three days."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6486.96,"end":6487.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6487.76,"end":6495.52,"speaker":"Fr Stephen De Young","text":"St. John adds the editorial note. He was speaking of the temple, which is his body. Right. Just in case you didn't write that together."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6496.2,"end":6548.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And it's interesting. Like, you know, it's funny, you could still read that as saying, and people do like, oh, he just, he just means temple is a kind of metaphor for his body. But, like, well, why would he pick the temple? Why not just say, a house or, you know, like, it's a particular. It's about temple. It's about paradise. He is the, you know, where he is is the mountain of God. You know, that even our churches, right, become the mountain of God. Why is it that ideally, altars within the sanctuary of the Orthodox church are placed higher than. Even if it's like our parish here in Emmaus, it's just one step up. Right. But there's others where there's a few steps up, you know, why is it always higher? It's not so everyone can see. Right. And it's why, like."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6550.63,"end":6552.15,"speaker":"Fr Stephen De Young","text":"But there's a tabernacle."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6552.47,"end":6553.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Literally, there's a tabernacle."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6553.95,"end":6554.19,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6554.19,"end":6575.31,"speaker":"Fr Andrew Stephen Damick","text":"Like, and it's not in it. Right, right, right. And. And it's. It's why also, like, for instance, I mean, I've seen this in some churches where. Churches that the seating is like in a stadium or like in a, you know, a theater where the. The altar is down at the bottom. And I'm like, no, this is exactly the opposite of the way that it should be."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6575.31,"end":6576.55,"speaker":"Fr Stephen De Young","text":"Don't have raked."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6576.71,"end":6583.83,"speaker":"Fr Andrew Stephen Damick","text":"Ah. If it's going to be raked, should be raked the other way anyway. And."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6583.83,"end":6600.38,"speaker":"Fr Stephen De Young","text":"And when Christ says that, he's saying that at Herod's temple, right? So he's deliberately making the point, right? There's this prophecy that the temple would be rebuilt, that there would be a new temple in Ezekiel. This thing Herod put up, ain't it?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6601.5,"end":6603.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it also means I'm it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6603.98,"end":6604.86,"speaker":"Fr Stephen De Young","text":"Christ is it?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6605.18,"end":6626.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's also why there's, like, there's certain Christians, dispensationalists, I'll just put it out there, who believe that there's going to be some prophetic moment where a temple gets built in Jerusalem on the Temple Mount, you know, And Ezekiel's temple. Yeah, Temple is referring that Ezekiel's temple material building."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6627.25,"end":6627.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6627.57,"end":6631.65,"speaker":"Fr Andrew Stephen Damick","text":"No, it's Christ. It's already happened. Christ is the new temple."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6631.89,"end":6640.61,"speaker":"Fr Stephen De Young","text":"Right. And the proof of that. The proof of that is that Ezekiel says that is the temple where God will dwell forever."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6641.09,"end":6641.65,"speaker":"Fr Andrew Stephen Damick","text":"Forever."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6642.05,"end":6657.88,"speaker":"Fr Stephen De Young","text":"Forever. When you get to, again, the Johannine literature, you get to Revelation, chapter 21. In the New heavens and the new Earth, there is no temple. St. John says, and he says the reason there's no temple is because God and the Lamb dwell with them."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6659,"end":6659.4,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6659.56,"end":6720,"speaker":"Fr Stephen De Young","text":"Because Christ is there, you don't need a building, Right? So if Ezekiel is talking about a physical material building, that building will have to get destroyed after it's built, which means God won't be dwelling there forever, which Means it's not what Ezekiel is talking about. Right. So that. That just doesn't work as an interpretation of Ezekiel. But if we accept that what Ezekiel is talking about is Christ, then this gate facing east thing makes perfect sense. East, that's where God dwells. So if God is going to come to dwell in a human body. Right, Body understood. In the ancient way. Right. If he's going to take a human body, a human nature. Right. He's going to come from the east where he dwells. Right. So the gate that faces east is the gate through which he will come. And it's Ezekiel who adds the details, that only the prince will come through that gate and no one else, and the gate will remain shut."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6720.96,"end":6728.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And. And it's also, then why we get all this cool imagery in Scripture of water flowing out from Christ?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6729.28,"end":6731.6,"speaker":"Fr Stephen De Young","text":"Because in the Johannes literature especially."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6732.23,"end":6743.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Now, you know, so you got the woman at the well, right? You've got her, you know, but, but even like when he stands up in the. The synagogue and reads, you know, if anyone is thirsty, let him come to."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6743.51,"end":6751.51,"speaker":"Fr Stephen De Young","text":"Me and drink on the last day of the feast. Yeah, yeah, yeah. I will give the water. And. And waters will pour forth from his belly."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6752.63,"end":6753.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6754.47,"end":6754.83,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6754.83,"end":6768.37,"speaker":"Fr Andrew Stephen Damick","text":"So believers become the mountain of God, right? Believers become, you know, don't you know that the kingdom of God is within you, the paradise is within you, you know? Right, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6768.37,"end":6772.89,"speaker":"Fr Stephen De Young","text":"Because the Holy Spirit comes to dwell within you and your body becomes the temple of the Holy Spirit."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6773.21,"end":6791.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And also, just to mention, you know, this. This awesome image from the prophecy of Daniel, the. The stone from the uncut mountain that smashes all of the idols and all the kingdoms of this world and then grows to fill the whole earth."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6791.73,"end":6793.21,"speaker":"Fr Stephen De Young","text":"Grows into a mountain. Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6793.21,"end":6794.61,"speaker":"Fr Andrew Stephen Damick","text":"He grows into a mountain, right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6795.33,"end":6797.21,"speaker":"Fr Stephen De Young","text":"Grows into a mountain that fills the whole earth."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6797.21,"end":6797.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6797.57,"end":6801.29,"speaker":"Fr Stephen De Young","text":"And the God comes to fill the paradise. Comes to fill the whole earth."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6801.29,"end":6802.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yep, yep."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6803.09,"end":6858.31,"speaker":"Fr Stephen De Young","text":"And so the last sort of element of this is that. That we get from scripture is that the. The holy mountain at certain points comes under siege, right? So one of these we've already talked about back in the Giants episode. So everybody get excited. The Amalekites, right. When they come to Mount Sinai, the Israelites come to Mount Sinai. Mount Sinai is being the mountain of God at that point, right? And. And so the Amalekites come and lay siege to them and to the mountain, right? And there's that passage where it says, the Amalekites have dared to lay a hand upon the throne of Yahweh, because it's become the mountain of God. That's where his throne is while he's there meeting with Moses. That's where his throne, his dwelling, enters into the realm of human conscious experience in that place at that time."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6858.63,"end":6859.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6859.51,"end":6861.11,"speaker":"Fr Stephen De Young","text":"And they lay siege to it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6861.35,"end":6872.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then that's why. Then Israel is sent to go and to take God's revenge against the giants, against the Amalekites."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6873.03,"end":6873.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6873.43,"end":6877.99,"speaker":"Fr Andrew Stephen Damick","text":"Because they attacked the throne of God, effectively."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6879.99,"end":6891.65,"speaker":"Fr Stephen De Young","text":"And this then happens again in Revelation. Again, this is Armageddon. Right. A lot of people, again, I'm sorry, History Channel documentaries, they really want this to be Megiddo."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6892.2,"end":6894.84,"speaker":"Fr Andrew Stephen Damick","text":"Are you really sorry? To the History Channel documentaries."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6894.84,"end":6932.85,"speaker":"Fr Stephen De Young","text":"Sorry, not. Sorry, not. Sorry, Documentaries. There's no aliens involved. And this isn't. This isn't Megiddo. This is. Armageddon is a Greek transliteration of Harmoade. It's an. It's an ayan. Is the A in moed, the A sound. And in its ancient pronunciation, that was pronounced like. Yeah, very close to a hard G sound. So, for example, Sodom and Gomorrah. The guh in Gomorrah is actually. It's actually an iron. It's actually this letter."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6933.41,"end":6936.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, if you speak Arabic, you know how to say the ain."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6936.69,"end":6997.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So it's. It's not Megiddo. This is Harbour 8. This is the Mountain of Assembly. All of the enemies of God, led by the dragon and the beasts, gather out like the Amalekites to lay siege to the Mount of Assembly, and then are defeated and. And destroyed in Revelation. But what this means is. What this means is that wherever, wherever God's paradise is, wherever the dwelling place of God is, that place is going to be under siege by the enemies of God, by the spiritual enemies of God. That includes within us. Right. This is part of the basis of our understanding of spiritual warfare. If the Holy Spirit is dwelling within us and we're the temple of God and we're the dwelling place of God, and we become paradise within and the mountain of God within, then that means there's going to be a siege. There's. We're going to be under attack by God's enemies."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6998.4,"end":6998.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":6999.76,"end":7015.44,"speaker":"Fr Stephen De Young","text":"And. And so this forms important basis deeply connected to our understanding of spiritual warfare. So, yeah, the. The Mountain of God is not only some physical. Physical mountains, but it's inside you. It's part of your internal geography."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7016.08,"end":7070.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. Well, to wrap up this first of our two episodes, or is it three, about spiritual geography, sacred geography, you Know, I'm. Especially on that last note, which I think. I mean, it's all fascinating, but I think that this last note in particular is one of the places, not the only place, but one of the places where the rubber meets the road. Right. The paradise is within you. The mountain of God is within you. And you're going to be under siege by the enemies of God. Not just because people get excited when we talk about Amalekites, I remember. And we just actually marked the commemoration of his passing just a few days ago. A priest that I knew, Father Alexander Addy. Was he the dean while you were at Saint Tikons, or is that after you? A little after."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7070.28,"end":7071.88,"speaker":"Fr Stephen De Young","text":"Yeah, I met him a few times, though."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7071.96,"end":7462.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So Father Alexander Addy, who, you know, passed away untimely from our point of view of cancer just a few days actually after Metropolitan Philip of the Antioch in Aristotle. So it was 2014, and it was, you know, later in March. So just, just a few days ago. I remember one of the things that he said to me one time, and this was in the context of giving advice. You know, he was a very experienced pastor. He was a pastor for decades at St. Michael's Church in Louisville, Kentucky. He said, make the place you're in into paradise. Right? And the specific context at the time was, you know, the. The parish where God has put you as a pastor. Make it as paradisaical as possible. Right? But. But that's not the only application of that. Okay? So if the kingdom of God is within you, and again, this emphasizes this sort of, as it's called, this eschatological tension of both now and not yet. So if you are a baptized Christian, then you are the place of paradise because you've put on Christ, right? As many have been baptized in Christ, have put on Christ. And if Christ is the temple of God, if he is the paradise, then it's within you. So if you've done that and you are the paradise of God, but you also are not yet, because we're still on the journey, right? It's both now and not yet become the thing that you are. That means that spiritual life is about making yourself paradisaical. This is one of the ways of talking about it. It's not the only way. And so how do you do that? Right. Well, what is appropriate for a temple? What is appropriate for paradise? What does that look like? What do you do there? Number one, you are there to be with God. You are there to commune with God, you are there to worship God. That's what a temple is. That's what paradise is. It's the place where Adam meets God and where he is one with God and he is in communion with God. And so that means that prayer and worship are utterly core to our. To who we are. It's not just sort of something that helps with spiritual life or something. I make sure I try to do that every so often. It doesn't help. It is who we are. Right? But also think about all these things we've talked about in terms of sacrifice in previous episodes and about purification of the temple of God and all of that. That also applies to you, to who you are. All of these things that are the way that a temple functions and is treated, and people go there and do those things. All of that is who you are. And even like this, this image of pilgrimage, right, we started, we started with that when we started talking about sacrifice. There is an internal pilgrimage that you make within which we participate in by making external pilgrimage. And by that I can mean, you can mean, you know, going on a long journey, but it also means simply the pilgrimage you take when you get up on a Sunday morning and go to your church, even if you live right next door to it, but also is the pilgrimage that you take when you wake up and you walk and stand in front of your icons, you know, in the morning and at night, you're making that pilgrimage to this holy place because you are paradise. And you are making yourself paradisaical by then going to, you know, another paradise, so to speak, within your home, within your community, with, you know, all of these things. You know, it's, it's, it's. It sort of stacks, you know, there's paradises upon paradise, right? And why do we go to the saints? Because the saints have become paradise. We go there because we meet with God there and we connect with God there and commune with God there, you know, so all of this reverberates just, just beautifully, beautifully, right? And if we, if we, even with these sort of difficult metaphysical concepts that we began with about, you know, being a human doing, you know that being is a verb, right? That, that figures into this very, very deeply. And if you, if you understand this the right way and you're oriented the right way, then you'll, then you'll know that it's not a matter of like, am I good enough? Have I done enough? Do I. Did I go to church enough? Did I love my neighbor enough? Or whatever. Because again, that's a very sort of quantitative approach to these things. The question Is how am I being? How am I being? Am I fundamentally oriented towards God and going to that mountain of assembly to meet with him? I sometimes tell people it's not a matter of progress or distance or arrival, it's a sort of vector, so to speak, to use a mathematical term. What direction are you moving in? And that's spiritual life from this particular angle. So I love this conversation on sacred geography. And the first place I go is this question that Laura talked about when I learned about the idea of thin places where I was like, whoa, there's places you can go where you can meet God. And the answer, of course is yes. But also thinking about that beautiful advice given to me by Father Alexander Addy, that the place I'm in can become paradise, that this studio that I'm talking to you from right now, it is paradise because here I meet with God and that's the purpose of this place. So my prayer is that all of this will help to contribute to your paradise, which is not a separate one from the paradise. It's simply participation in Christ himself, who is the paradise where we worship the one true God. Father Stephen."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7463.25,"end":7517.38,"speaker":"Fr Stephen De Young","text":"Yeah, and this is kind of obligatory, but I mean, as you said, you can find paradise anywhere. You can find it in Paradise City. You can find paradise by the dashboard light. Anyway, low hanging fruit. You know, I know we have a fair number of listeners who aren't necessarily Americans, but I think this may apply beyond America. But I could, I could say for us Merkins, our heroes are individuals, right? Our heroes are lone wolves. You know, the tough cop who plays by his own set of rules. You know, the, the, you know, you don't, you don't see a lot of TV shows and movies about people who do things by the book, you know, sort of do a solid job. You know, it's, it's."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7519.38,"end":7519.94,"speaker":"Fr Andrew Stephen Damick","text":"We all want."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7519.94,"end":7773.43,"speaker":"Fr Stephen De Young","text":"To be individuals and achieve like individual excellence. That's what we're oriented toward. But one of the consequences of everything we've been talking about tonight, but especially in terms of identity and the time we spent talking about identity and what makes something what it is, including what makes you and I who you and I are, is that it's not just about us being put in order. It's not just about us, right? It's not just an internal thing of being justified and set in order and properly arranged, though this tends to be the focus of a lot of our Christian life. And thought is, I need to get my stuff together, right? I need to get myself straightened out. I need to repent of my sins and get myself okay so that I go to heaven when I die. And I need to find salvation for myself. And, and that could even just be, I need to become a saint. I need to achieve some kind of spiritual excellence, some kind of spiritual level. But just being set in order, just being a certain thing, isn't your identity. Your identity includes and is dependent on that web of relationships. We were talking about, the way we fit into the rest of Christ creation, including our fellow humans. But going beyond our fellow humans to all of the rest of creation, having that set of relationships, those connections being right, being set right, being put in order and in their proper order. Without that, we can't be internally set right. This is why all through the scriptures, famously in first John, but all through the scriptures, right, you can't love God and hate your neighbor. You can't have things right with God. You can't be justified and have things be out of whack at the same time. I don't want to pick on him too much, but I'm sorry, Martin Luther, you can't be just and a sinner at the same time. You just can't. So we have to always remember, and especially now during great Lent, when we're really focused on this, we focus on repentance, that this is not just a move inward. Everything that we said about paradise being within you and the kingdom being within you is absolutely true. But that doesn't mean that you fold in on yourself and become a solipsist and become entirely self focused. Because finding yourself and finding what is within you is only going to happen through correcting that web of relationships. You're going to find yourself in other people. You're going to find God in other people. And when we're loving our neighbor and we're setting things right and we're making amends as part of our repentance. And we're putting everything around us back into order. That's what's going to cause all those things within us that are out of joint and out of place to slide back into place. That's where things are going to come together. And we're going to find out who we really are and what it really means to be a human. And thereby by discovering what it means to really be human, to discover what it is to be like Christ and to become like God, which is what we call theosis, and what salvation is really all about. It's about becoming a son of God, as we've said before, becoming like him, becoming like Christ, that doesn't happen for us all alone on our own. That happens for us as part of the church, as part of a community of the faithful, both those who are alive with us in this world now and those who have gone before. We all find salvation and restoration and paradise together."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7775.11,"end":7804.88,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, next time we're going to be following Orpheus and taking a trip into the other underworld, but that is our show for tonight. Thank you very much everyone for listening. If you didn't get a chance to call in during the live broadcast, we would love to hear from you, either via email email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything but can't respond to everything and we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7805.68,"end":7812,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7812.56,"end":7822.39,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, unlike Father Stephen, like our page and join our discussion group. Leave reviews and ratings everywhere. But most important importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7822.63,"end":7832.95,"speaker":"Fr Stephen De Young","text":"I was bad, so I don't get to talk about Facebook anymore. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7833.35,"end":7837.67,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you and may he give you a beautiful, beautiful Lent."}
{"episode_id":"LOS - #016 - 2021-03-26 - The Mountain of God and the Boat of Theseus","start":7853.36,"end":7890.41,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
