{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":0.32,"end":64.9,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":68.82,"end":236.98,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. I am Fr. Andrew Stephen Damick in Emmaus, Pennsylvania and with me via the Magic of Modern Technology is my co host father Stephen DeYoung in Lafayette, Louisiana. And if you are listening to this episode live, you can call in at 855-AF-RADIO. That's 855-237-2346 and we will get to your calls in the second part of today's show. In a June 1941 letter to his son Michael, Lord of the Rings author and Anglo Saxon professor JRR Tolkien included this passage. He wrote this there is a place called heaven where the good here unfinished is completed and where the stories unwritten and the hopes unfulfilled are continued. I remember the first time I read that passage and my heart leapt within me as I knew immediately that it was true. You see, even though I am a lifelong Christian, the sense of what it is that this earthly struggle is all for has not for much of my life been clear. Yes, we all want to go to heaven when we die, but I think that for many of us this just means that we prefer to go to the good place rather than the bad place. And therefore heaven is envisioned as a kind of permanent tropical vacation or perhaps a utopian city. And in its most insipid depictions, it's saints with glowing rings around their heads, sitting on clouds, playing handheld harps for all eternity. Yes, we all want to have the good end and not the bad one. But is heaven really a good end? For many it sounds kind of boring. And the dubious words of the talking heads heaven is a Place where nothing ever happens. Well, that's bunk. Tonight we're going to discuss what exactly all of this Christian life is aiming at. What does it mean to be saved? When we get to the other side of the resurrection, will we actually have anything to do? Last time on our Halloween special, we talked about doing combat with the forces of evil. The demons, the angels do it, the saints do it, and we are called to do it. But what about after their final defeat and what bearing does that have on life here and now? Well, you guessed it. We're going to start by talking about angels again. So like I said, last time, we talked about doing combat with demons. And so let's begin there. Father Stephen, take us in. Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":237.86,"end":271.75,"speaker":"Fr Stephen De Young","text":"So our last few episodes, actually, we've kind of been on this trajectory, talking about the angelic beings who are whom God created and with whom he shared his dominion and his rule over creation. We've read some quotes from ancient folks about how God has sort of a government or a commonwealth over his creation and that he assigned these beings to hold these different roles sort of in his administration."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":272.63,"end":273.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":273.27,"end":285.59,"speaker":"Fr Stephen De Young","text":"Over the. Over the cosmos. And we talked about how some of them at various points have fallen and how humans, as adopted sons of God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":286.47,"end":286.87,"speaker":"Fr Andrew Stephen Damick","text":"Who."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":289.83,"end":355.8,"speaker":"Fr Stephen De Young","text":"Have received that adoption by grace and that inheritance and have been glorified, then fill those roles, those job openings, as we said, that are left behind by those fallen spirits. And so we've kind of outlined this idea of the saints in Glory as being part of this sort of administration and this governance. And so there's another major element to the ministry that the saints in Glory have in this age and that we hope to share in the age to come in God's kingdom. And so it's that sort of that second role that we are going to be talking about and expanding on tonight, how those two things fit together as sort of this twofold ministry of the sons of God, of glorified humanity, and of the elect angels, as St. Paul calls them, the angels who have remained in their original righteousness and purity."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":356.57,"end":369.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that, you know, occasionally we get asked the question like, okay, you guys are talking about angels and demons, and next time we'll be talking about giants. Everybody's excited."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":369.93,"end":372.09,"speaker":"Fr Stephen De Young","text":"People get excited when I talk about giants."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":372.09,"end":505.73,"speaker":"Fr Andrew Stephen Damick","text":"There it is. That's Father Stephen DeYoung's catchphrase, everybody, but, you know, there's this question like, okay, well, that's all well and good, but does it have any kind of practical side? Right. And that's one of the emphases that we've tried to give over and over again. And I think that this might be one of the fuzziest spots in a lot of Christians imagination. Like is our participation in the divine council, is that practical or is it just some kind of like status or again, you know, the life of the age to come sounds kind of boring to a lot of people. Does it have anything to, to it? You know, and I remember when I was a kid and even now, you know, we read those passages in the scripture where it talks about that the saints will reign together with Christ. Right. You know, we will reign with him. And you know, there's, there's this language is in multiple places, especially in the New Testament. And I think that when I first saw that I thought, okay, we're going to reign with him. Great. What? I never really gave too much thought about what exactly that means. Like, okay, we're going to sit on thrones, I'm going to have a crown or that kind of thing. But not much in the sense of a kind of day to day reality. I think a lot of us have the sense of the life of the age to come being kind of static and there's not going to be sort of work to do. But tonight that's what we're discussing is all of that. In fact, there is in the scripture a robust image of what it is that the saints in glory and that's what we're called to be do in the kingdom of God. You know, there's actually something to do. Right. So you know, there's this kind of twofold ministry, right. That the, that the angels have. And last week we talked especially about their position as combatants in spiritual warfare and then how we joined last week, sorry, a couple of weeks ago, and how we join them in that. But there's another side to it, like you said. So let's, let's talk about that a little bit this evening."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":506.29,"end":537.98,"speaker":"Fr Stephen De Young","text":"Yeah. And this is the place where we see sort of our, our more active and direct relationship with the spirits of both angelic spirits and the spirits of the righteous who have gone before us. We had some questions last time about like well, okay, what, what does it mean to me if I live in Thessaloniki? Right. Like, what does it mean to me and about my life that Saint Demetrius is now in charge instead of Africa?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":538.14,"end":540.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it sounds cool."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":540.3,"end":563.47,"speaker":"Fr Stephen De Young","text":"Like, yeah, I guess that's better. But right, so this is, this is good. This is more at the level of interaction. Right. And a lot of times I think it's diminished. I think this is in terms of our Protestant friends who I don't want to be seen as picking on."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":563.87,"end":564.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":564.23,"end":589.92,"speaker":"Fr Stephen De Young","text":"Because they are our friends. I don't want to pick on them. But there is a nervousness and a diminishment due to, I think, the history with Roman Catholicism of wanting there to be any kind of active religion relationship. Right. Even. Even with our departed loved ones that, okay, well, they're in heaven now, so, okay, we'll see them later."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":590.16,"end":590.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":591.04,"end":630.51,"speaker":"Fr Stephen De Young","text":"And you don't want to be talking to angels. Right. And you don't want to be talking to saints that have gone before, because they're now gone and there's a separation. But in response to that, what we see in the scriptures and in the traditions surrounding the scriptures in ancient Judaism that we're going to talk about a little bit, the idea that there's this very direct relationship and that there's a role that they play not coming in between humans and God, but a role that we're going to define. I think you're going to hear the word intercession a lot tonight."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":630.51,"end":631.39,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":632.27,"end":656.69,"speaker":"Fr Stephen De Young","text":"Interceding, which is not mediating coming between, but interceding. And there are examples already, as I just mentioned in the scripture and in. In early Jewish traditions from the Second Temple period, of human beings seeking the intercession of angelic beings. And what that means concretely is seeking their prayers."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":657.09,"end":657.49,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":657.73,"end":660.45,"speaker":"Fr Stephen De Young","text":"Seeking their prayers to God on their behalf."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":660.77,"end":853.15,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I. And I think one of the problems that we have is because we live in this sort of flattened, secular, materialist world where we generally do not have what we might describe as spiritual encounters or that we don't acknowledge that we do. Right. Or we don't know that we do. The idea of sort of bringing in an angel or bringing in a saint sounds extraordinary and crazy and weird. And okay, we'll acknowledge that God breaks in. Like, this is what we talked about for the very first episode, right? You know, this idea of, like, okay, we're going to put brackets around certain supernatural things we're going to believe in. But. But it seems a little crowded when you start bringing in angels and saints, you know, But I think because it's. Because this is our experience of the world that we think of it as some weird extra thing. And like, why do you need to add that on? You know, can't you just talk to God yourself? Why do you need to get, you know, doesn't that get in between you and God? You know, as you said, like, this sense of. Of interfering. Right. And yet ancient Peoples had a constant sense of spiritual encounter. You know, they may not be having visionary experiences 24 hours a day, but they knew that that was the world they lived in, and they were having experiences more often than we are. And so, like, the idea of, like, well, I'm just not going to believe in that because that never happens. Like, no one would say that because it happened. And, you know, people knew that that was just part of life. Right. That the. The set of evidence that we're dealing with, which is, again, is mediated through our senses and through our perception, through our interpretation, is a different set of evidence than ancient peoples had, where encounters with spiritual beings were maybe not something that happened every second of every day, but enough that it was kind of normal, you know, And I think that that's a really, really important point to make here from the outset in terms of framing this. Like. Like, for instance, you know, if I. If I lived. So I'm up here in my studio right now, the building is basically empty except for me. If. If that was my experience every single day, and I never saw anybody else here ever, it might become easy for me to believe that I work here by myself, you know, that no one else works here. If I never saw anyone else. They might be on floors that I never go to. They might be in rooms that I never walk by. But if I never see them, then it's easy for me not to believe that they're there and to function like they're not even there. And then if suddenly the room that I become aware of all the people working in this building, and I start to hear them walking on the floor above me and I hear their voices and I see them in the elevator, it might feel really deeply weird and kind of crowded. And what are they doing here? This was my nice, quiet building. You know, that's the way that I think about this kind of issue. And especially for people coming into the Orthodox Church for the first time and they walk into a church and they see all these saints and angels surrounding them and the icons and constantly being referenced in the services and so forth, it seems a little spiritually crowded if you're used to just me and Jesus, you know."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":853.15,"end":868.98,"speaker":"Fr Stephen De Young","text":"Right, right. And we don't sort of apply that logic to the rest of our lives. Right, right. Very few of us. There are some people out there, but very few of us would say, you know, if you get sick, don't go to a doctor, just go directly to God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":870.1,"end":870.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":870.5,"end":871.14,"speaker":"Fr Stephen De Young","text":"You don't."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":872.82,"end":876.18,"speaker":"Fr Andrew Stephen Damick","text":"There are people out there, but not a lot. Yeah, Not A lot."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":876.26,"end":900.53,"speaker":"Fr Stephen De Young","text":"And. Because they don't last very long. But. And we don't. We don't say like, you know, if you have a problem, don't talk to your spouse about it. Don't talk to your family about it. Don't talk to your pastor about it, because you just take it straight to God. Don't talk to anyone else. Right. We all understand that, that God works in our lives through other people."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":901.17,"end":902.13,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":902.13,"end":994.3,"speaker":"Fr Stephen De Young","text":"He doesn't have to do everything just directly for it to be from him. And so that doesn't conflict with the fact that it's God who's doing it. And so in the same way, we feel perfectly comfortable asking people to pray for us. And we see that happening in the scriptures, for example. And this is kind of the prime example is in the Book of Job. The Book of Job. Of course, I'm not going to go through the whole thing, but the Book of Job, we've quoted it already, the beginning part where Satan has gotten permission to sort of test Job. And this testing is not testing like taking a test and you pass or you fail. This is testing like testing metal when you're doing blacksmithing. Right. This is to refine and purify Job. But so Job is being tested and he hasn't gotten a direct communication as to why from the human perspective. Just all these horrible things have happened to him. Right. His family members have been killed. He's gotten boils all over his body. He's lost everything. He's sitting on the community dung heap using potsherds on his boils to lance them. So things have gone very badly for Job. And he has all of his quote unquote friends coming up to him and saying, well, clearly we know what's going on. You did something bad and God's punishing you."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":995.01,"end":995.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":995.25,"end":1015.97,"speaker":"Fr Stephen De Young","text":"And. And Job is saying, no, that's not it. Right. Yeah, I don't know what's going on, but I know that's not it. And then his. His charming wife comes and says, well, God's just dealing with you unjustly, so curse God and die because she's a lovely person. And Job declines that also. It says, no, Right. I'm not doing that either."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1016.21,"end":1016.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1016.93,"end":1048.52,"speaker":"Fr Stephen De Young","text":"And so at one point, when he's speaking with one of his friends, one of his friends says, well, you know, if you're going to reject our answers, then you need to find out what's going on. So he says to him in Job 5, verse 1, to which of the holy ones will you address your case? And if we translated that holy ones, we've talked about this in previous episodes, but if we translated that the way we translate the same word in the New Testament, we'd say to which of the saints will you."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1048.52,"end":1048.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1048.84,"end":1070.2,"speaker":"Fr Stephen De Young","text":"Will you address your plea implying, well, are you gonna, are you gonna go to one of, sort of one of the people in God's administration and ask them to intercede for you and, and find out what's going on? Not that, oh well, just go and find a God, small G, and ask them to fix it for you since apparently the true God is angry at you."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1070.2,"end":1130.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting to me looking at that verse Job 5:1, as it gets rendered in the Greek translation of the Old Testament, which was done by Greek speaking Jews. So these were Jews doing a translation into Greek according to their own understanding of their own scriptures. And the way that the Greek, if you were to translate the Greek into English, it doesn't say the holy ones, it says, to which of the holy angels will you address your case? So it's interesting that when Jews, ancient Jews, pre Christian Jews, hundreds of years before Christ were translating their own scriptures into Greek, they understood that this reference to the holy ones or to the saints, if you're going to translate as we do in the New Testament in English is referenced to the angels. In other words, which angels are you going to talk to? Job? Which indicates that that is a thing."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1131.27,"end":1160.88,"speaker":"Fr Stephen De Young","text":"Yeah. They were disambiguating it to make it clear. He's not talking about finding a holy man to pray for him. Right. He's talking about angelic intercession. And we see this in, in Jewish traditional sources outside of or at the periphery of with this first one, the, the canonical Old Testament scriptures in 1st Enoch 15:2."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1161.68,"end":1162.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1163.28,"end":1204.66,"speaker":"Fr Stephen De Young","text":"At this point in, in the story, the, the imprisoned fallen angels who are in, imprisoned in the underworld have. Enoch has been taken on this tour and has sort of seen them imprisoned there and they ask Enoch to go, they say, well, God likes you, Enoch. He doesn't like us so much now why don't you go and pray for us and intercede for us with, with God and see if maybe he'll show some leniency, right. And, and let us out of this prison. Now they're not actually repentant, they're not sorry for anything they did. They just don't like the consequences and the punishment and want out of it. Right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1204.66,"end":1205.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1206.77,"end":1241.49,"speaker":"Fr Stephen De Young","text":"And so Enoch goes and, and does this and God basically gives him a message to take back to the imprisoned fallen angels and a major Portion of that message is Enoch telling them on God's behalf that you were to intercede for men, not men for you. So saying, why are you sending this human to intercede for you? You were supposed to be your. What part of your job was to intercede for human beings?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1241.81,"end":1242.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1242.37,"end":1260.45,"speaker":"Fr Stephen De Young","text":"Not just to govern and rule over them, but to intercede for them and. And bring their. Their prayers before God. And that's imagery that's also echoed in the book of Revelation, where we see the prayers of the saints in these incense sensors being brought before God's throne by the angels."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1261.08,"end":1261.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1262.28,"end":1285.88,"speaker":"Fr Stephen De Young","text":"This. This same. The same kind of idea. So what that's saying first, I think is that was understood to be. They weren't just watchers and governors, you know, as we've already described, but also were to have this intercessory role. They were supposed to be interceding and trying to lead human beings closer. Closer to God, closer to Christ."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1287.89,"end":1288.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1288.17,"end":1344.11,"speaker":"Fr Stephen De Young","text":"And then we had one more example, and this is. Now we've moved out another concentric circle to a text. And this gets. As I told you earlier today, this gets really complicated. There are dozens of books called Lives of Adam and Eve or Life of Adam or Book of Adam in different languages. They're all related, but. But scholars argue over how. Because you have to write a dissertation about something. And. But one of them in particular, which is one of the earliest versions of the text, that comes from the first century A.D. so this is the time of Christ, is the time of the apostles, the time when the New Testament is being written. It's referred to as the Greek Life of Adam and Eve or sometimes the Apocalypse of Moses, even though those titles do not seem to have anything in common."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1346.27,"end":1348.59,"speaker":"Fr Andrew Stephen Damick","text":"But that's a whole other episode, right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1348.59,"end":1348.99,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1349.39,"end":1349.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1349.83,"end":1363.87,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Disambiguating these texts. Yeah. So in this text, it's basically. It's describing the repentance of Adam and Eve after they've been exiled from paradise."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1364.35,"end":1364.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1364.83,"end":1395.5,"speaker":"Fr Stephen De Young","text":"And they. They realize that they've sinned and transgressed, and now they want to repent. And there are a lot of interesting things in the text. I'm sure we'll reference it at other times on the show, but for our purposes tonight, it describes that while they're undertaking these actions of repentance, they're doing these sort of penitential things involving prayer and fasting and vigils. While they're doing that, the sun and the moon and the stars and the angels are said to be praying and offering incense to God on their Behalf."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1395.9,"end":1396.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1396.5,"end":1402.82,"speaker":"Fr Stephen De Young","text":"Sort of praying and interceding with God for mercy for them while they're. While they're repenting."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1403.3,"end":1507.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And of course, as we've pointed out before, when you talk about the sun and the moon and the stars in Scripture, you have to read that as being involved with angelic beings. Yeah. And just to reiterate, maybe, because I think this is important because we just, you know, as you said, you just quoted from first Enoch and then from the Greek life of Adam and Eve, AKA the Apocalypse of Moses, that we don't regard these books as scripture, but like, Enoch is kind of scripture adjacent and this Greek life of Adam and Eve is kind of in the books that are being read at the time. And the point of quoting these things is not to say, oh, well, we're reading these books and we're drawing out doctrines from these that you won't find anywhere else, but rather, the point is that, look, see, these are simply witnesses to what's being believed at that time and the first century, especially when Christ is on earth and visibly and the apostles are being sent out by him and the New Testament is being written, the early church, this is there. This is in that tradition. And so we mention these texts, again, not to say that this is a source of doctrine, but it is a testament, a witness to what is being believed. And, you know, we already quoted from Job, so I mean, clearly this idea of the, the angels praying for us and even that you can ask them to pray for you is a thing in the Old Testament and definitely in the period of the New Testament as well. So. Right, Cool stuff."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1507.35,"end":1518.76,"speaker":"Fr Stephen De Young","text":"It's an issue of context. Right. Because there are a lot of things in the Bible that if we just isolate the biblical texts can be ambiguous, where you look at it and say, well, wait, what does that mean?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1519.08,"end":1519.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1519.88,"end":1535.72,"speaker":"Fr Stephen De Young","text":"You know, and so if we have other writings written by faithful Jewish people at the same time, they can give us a clue to at least how the original readers would have read it and understood it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1535.88,"end":1542.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. Rather than just supplying our lives here in the 21st century as the context in which you should read the Scripture."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1542.79,"end":1543.03,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1543.27,"end":1595.91,"speaker":"Fr Andrew Stephen Damick","text":"That's an important context in certain ways for application, but it's not the primary one because it wasn't written now, it was written then. And that's super, super important. And so it's, you know, from there then we get, as you see throughout orthodox tradition, that we, seeing that this has been a thing for a long time, we simply continue to do what had always been done by the people of God. And we ask the angels to, to intercede for us. We ask the holy ones to intercede for us, pray for us. But again, we don't understand that it's getting in between us and God. Or like, I can't talk to God directly, so I better, you know, get somebody who's near him to pass this message on. But, but rather that we ask them to pray alongside us, to pray for us. Just as in your own church, if there's somebody who's really, really good at prayer."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1595.91,"end":1596.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1596.15,"end":1642.03,"speaker":"Fr Andrew Stephen Damick","text":"Who's really dedicated to prayer, wouldn't you go to them and say, please pray for me? And it's. The thing is that that makes it more plausible for me to talk about that human person who's doing that thing and say, okay, I guess maybe then angels and saints. But actually it should be read in the other direction that that human in my parish who is really good at prayer is simply participating in this ministry that's always been taking place. They are continuing to do the same thing. So of course we're going to ask them. We just, you know, we just, in the Orthodox Church, at least on the new calendar, we just celebrated a few days ago the Feast of the Archangels. And we very explicitly, over and over again asked them to pray for us. You know, please pray for us. Michael and Gabriel and Raphael and all of them. And it's beautiful. Just really beautiful, beautiful, beautiful stuff. So. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1642.03,"end":1648.55,"speaker":"Fr Stephen De Young","text":"And it's key to hammer on. Pray for us doesn't mean pray so that we don't have to."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1649.03,"end":1649.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1650.07,"end":1657.98,"speaker":"Fr Stephen De Young","text":"They're not praying instead of us. Like, God's not going to listen to me, but he'll listen to you. So you pray. Right. That's not it. It's alongside and that's."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1657.98,"end":1663.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or like, I have better things to do. So could you, you know, take, take care of the prayer part for me there, please?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1663.98,"end":1709.4,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah, We've. We've got monks praying. I can go about my business. Yeah, no, but, but so we see that in that life of Adam and Eve example. Right, right. That Adam and Eve are very busy about repenting and the angels are praying alongside them. And so when going into that, this is something that we see all through the scriptures in the Psalms especially. Right. Praise him, all his angels, Praise him, all his hosts. Right. To the. O God. The psalms and the worship of Israel is constantly invoking the angels to join in and to worship and to pray alongside and at the same time and with us."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1709.73,"end":1739.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Especially those last few psalms that are so explicit about that. And I think, like, if I read that and I say, oh, that's not invoking angels, then that just means I don't take seriously what it actually says there. Like when it says, praise him, all ye angels, that's talking to angels and saying praise God. Like, it's simply right there. But if I approach it from the point of view of, oh, this is not a thing we do, then I just have to say, oh, well, it's just kind of poetic and not meant to be taken seriously."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1739.69,"end":1750.89,"speaker":"Fr Stephen De Young","text":"Well, and not only that, with Psalm 147 through 150, that's how we understand what it means. When the psalmist asks a bunch of inanimate objects, from our perspective, to praise God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1751.29,"end":1757.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's not talking to rocks and air. Yeah. He's talking to angelic beings."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1757.93,"end":1776.66,"speaker":"Fr Stephen De Young","text":"Right. Who are assigned to those. And this is something that's run all through our liturgical services at the Orthodox Church. When we make an entrance, we ask the angels to make the entrance with us. When we pray, we ask the angels to pray with us. When we sing, we ask the angels to sing with us."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1777.86,"end":1778.82,"speaker":"Fr Andrew Stephen Damick","text":"Can't just keep it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1779.54,"end":1821.29,"speaker":"Fr Stephen De Young","text":"This is a joining together, and this is part of their role. And we see in Scripture that those two things, the things we talk about in terms of ruling and reigning, that royal part and the priesthood part are supposed to be joined together. Right. Israel is supposed to be a kingdom of priests. St. Peter says that we are in the church, a royal priesthood. We have the example of Melchizedek, right. And Christ, Melchizedek priesthood that brings priesthood and kingship back together. When they're separated, they're separated as sort of a judgment because of a problem with sin. And when that's overcome, they're brought back together together."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1822.09,"end":1885.81,"speaker":"Fr Andrew Stephen Damick","text":"And it's. And it's interesting that even in, even in the pagan context, they, they're now obviously they're worshiping demons. But like the, the, the local pagan king was the guy standing in front of the altar as well. Like he had that task. I, I recall one time a conversation we had in which you talked about Alexander the Great and how he deliberately, as he conquered various nations and he did the work that it took, the ritual work that it took to become the son of whoever was their most high God. Like he became Pharaoh, for instance. Right. And that involved him offering sacrifices. Right. But in Israel, it gets divided, as you said, because of sin, that kingship and priesthood have to get divided because of sin. And part of the problem with paganism is that they are sinning, but they're not chastened by God as the way that Israel is chastened. And so they just keep sinning and they sin worse and worse and they're worshiping demons."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1887.57,"end":1913.89,"speaker":"Fr Stephen De Young","text":"And so when, as we've been talking about in the past couple episodes, glorified humans are glorified as sons of God. They come to share in God's eternal divine life. And they take these places vacated by the fallen angels. They take on not just the royal part of this ministry, but the priesthood. And I've got us a good old fashioned proof text to look at."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1913.89,"end":1917.81,"speaker":"Fr Andrew Stephen Damick","text":"Hey, all right, all right. Can I, can I read this one?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1918.13,"end":1919.41,"speaker":"Fr Stephen De Young","text":"Absolutely, you can go ahead."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":1919.73,"end":2062.26,"speaker":"Fr Andrew Stephen Damick","text":"All right, and so I'm going to read this and then we're going to go to break shortly after this. But yeah, okay, so this is from Revelation chapter 20, and this is verses four through six. And this is, you know, the apostle St. John speaking in this visionary experience he had. And I saw thrones, they that sat upon them and judgment was given to them. And the souls of those who had been beheaded because of the witness of Jesus and because of the word of God, and who did not worship the beast nor his image, and did not take the mark upon their forehead or upon their hand, then they lived and reigned with Christ a thousand years. The rest of the dead did not live again until the thousand years will be completed. This is the first resurrection, blissful and a holy one is the one who has a part in the first resurrection over these, the second death has no authority, but they will be priests of God and of Christ and they will reign with him a thousand years. And I think it's really important to note that it starts out by saying that it's the souls of those who have been beheaded because of the witness of Jesus. In other words, this is human beings who have been martyred for Christ. That's who this passage is talking about. And as you said, you know, it talks about them reigning with Christ and also that they are priests. And I loved the little bit of word nerdery that you put in here about the word priests because sometimes people like to say, well, in the New Covenant there aren't priests. In other words, there aren't people who are offering sacrifices on altars. Right? There's just presbyters. And there is an argument to be made there because the English word priest actually comes from the word presbyter. But in English Bibles we tend to translate presviteros as presbyter or elder. And we translate yarefs as priest. Right. What's interesting is that in this passage, as you said when we were talking about this earlier today, that the word that is talking about them as being priests is irfs. It actually says they're going to be sacrificial priests of God and of Christ and they'll reign with him in that beautiful millennium."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2062.85,"end":2167.97,"speaker":"Fr Stephen De Young","text":"And I know there's a lot of other popular interpretations of this passage vis a vis the end times, but just to point out a couple reasons why this has to be talking about the saints in glory. Now you notice it talks about these are the word for witness, and the witness of Jesus is martyrion. So these are literally martyrs in the actual word. They come to life and they reign with Christ. And them coming to life and reigning with Christ is described as it says literally this is the first resurrection. Right. They're seated on these thrones and reigning with Christ in the first resurrection. Then it says over these those who participate in the first resurrection, the second death has no authority, meaning those who aren't participants in the first resurrection are under the authority of the second death. So this can't be describing a group of people who are raised from the dead early, like for a rapture, as opposed to some other Christians who are raised later. The people who are raised later are the dead who are not righteous or the dead who are not holy are the dead who are subject to the second death. So this is talking about in the first resurrection, it's talking about the life of the souls of the departed of those who are specifically the martyrs here. So this is quite literally talking about the departed saints and what they're doing right now. And that is that they are reigning with Christ and they are serving as priests, which means they're interceding and they're offering worship and praise."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2169.21,"end":2176.41,"speaker":"Fr Andrew Stephen Damick","text":"And with that, we're going to go ahead and take a break, and when we get back, we're going to answer a question that we just got via Facebook. So we'll be right back."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2176.89,"end":2194.74,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2199.7,"end":2252.83,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, Prayer, Fasting and Almsgiving. Books now available at store ancientfaith. And the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2257.31,"end":2273.48,"speaker":"Steve","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8558-AF-RADIO."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2275.56,"end":2325.67,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. So this is the second part of our show and it's where we begin to take your calls. And like you just heard from the voice of Steve, you can reach us at 855-AF-RADIO, which is 855-237-2346. You can also send questions to us on social media and hopefully if one of our helpers spots it, they'll send it to us and we can answer it that way. But we, of course, would also love to hear your voices. So the first question that we've received this evening is from Helen, who left this comment on our Facebook stream. And Helen said this do the ancients believe the planets are angels? Are they praying to what we know as planets? So we've kind of addressed that before, but why don't you go ahead and, you know, give us a little refresher there, Father Stephen?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2326.29,"end":2384.91,"speaker":"Fr Stephen De Young","text":"Yeah, this is not they're not praying to the physical object. Right. But they understood, ancient people understood that there were spirits associated with all of these visible objects. There were invisible spirits associated with them, involved in their governance and otherwise associated with them. For ancient Israelites and for people of the Second Temple period, they believed that these were angelic beings or demonic beings created by God who had been given authority from him to exercise over these things. If we're talking about pagans, they worshiped these spirits sort of in their own right. And that was, of course, the problem."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2385.55,"end":2386.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2387.15,"end":2394.67,"speaker":"Fr Stephen De Young","text":"Rather than seeing them as part of the, the administration of the true God, the Most High God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2395.55,"end":2396.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2396.51,"end":2404.51,"speaker":"Fr Stephen De Young","text":"And so, yeah, so that's the idea. It's not. Right. Like we know the sun is a massive incandescent gas."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2404.91,"end":2405.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2405.03,"end":2409.47,"speaker":"Fr Stephen De Young","text":"It's a gigantic nuclear furnace. They didn't worship that."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2410.03,"end":2467.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. And it's an interesting question. Like, okay, so if there is an angel associated with the sun who is obedient to God, but then you have pagans over here who are worshiping their sun God. Are they attempting to worship an angel who doesn't want their worship? Or is there basically some demon that's sort of saying, yeah, I'll take that worship. Excuse me. You know, that's a different. I mean, obviously it's hard to kind of sort all this stuff out, but, you know, that kind of connects a little bit with one question that we've gotten over and over again, and we'll probably. I think we'll explore this a lot more in a future episode, which is that can angels still fall? Right. If there's a good angel, so to speak, that's tending to the sun, could he decide, you know what, I'm going to go ahead and take that sun worship, or is it really another demon? A demon who is accepting that?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2469.41,"end":2483.81,"speaker":"Fr Stephen De Young","text":"Yeah. And there's no reason to believe. We always have to keep in mind a couple of things. The first one is that demons are creatures of deceit and chaos and lies."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2483.97,"end":2484.22,"speaker":"Steve","text":"So."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2484.45,"end":2490.13,"speaker":"Fr Stephen De Young","text":"So there's no reason to believe that every spirit that showed up in the ancient world and claimed to be Apollo was the same being."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2490.21,"end":2495.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or if. Yeah, I could say I'm the sun God. Yeah, yeah. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2495.57,"end":2531.72,"speaker":"Fr Stephen De Young","text":"And. And then secondly, and this is addressing this struggle and some others that I know people are having, listening to the show, sort of processing things, and this is something we're always going to have to come back to from the very beginning. And that's talking about the grid. Right. The. The western grid we have. And with this show, we're not coming to you with new things to fill out the fields in the grid as opposed to the old ones that were wrong. We're trying to get you to get rid of the grid."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2532.04,"end":2532.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2532.84,"end":2568.22,"speaker":"Fr Stephen De Young","text":"And so sometimes this confusion is going to be caused by. Right. I'm sending you a Word document that's got a poem in it, and you're importing it into Excel as a spreadsheet. Right, Right. It's poetry, it's not math. And so it's going to come through garbled. And so if we're looking for precision. Okay, exactly what angel is doing this and what's his rank and what's his name and where is he? And then who's this one and who's that? You're not going to have a good time."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2569.53,"end":2569.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2572.41,"end":2575.45,"speaker":"Fr Stephen De Young","text":"That'S not how it. That's sort of not how it Works. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2575.45,"end":2674.9,"speaker":"Fr Andrew Stephen Damick","text":"And it's interesting that that's a kind of, you know, correct me if I'm wrong here, but you know, ancient Gnostics tended to, they loved their big charts. You know, like all of this was arranged to, you know, this angel is at this eon and this, you know, this archon is over here and signed to this. And what's amazing with how complex some of those arrangements are is the variety of them. You know, like when they're attempting to get it all sorted out, I mean, no one, except for maybe their little group actually buys into that particular sorting. Yeah, so. Yeah. Well, anyway, so with the second part of our show tonight, we want to talk about some possible objections that people might have to what we just described in the first part. And the first objection we want to discuss is, is something that especially that Protestants who encounter the Orthodox Church can tend to have a big, big problem with. And it's an understandable problem. I totally get it. I used to see things this way myself because I was not always Orthodox. I was raised as an Evangelical Protestant and that's that when Orthodox Christians give veneration to angels, to saints, to. A lot of Protestants will look at that and say, why are you worshiping saints? Why are you worshiping angels? Isn't that idolatry? Right. And the Orthodox person will respond by saying, I'm not worshiping them, I'm venerating them. And the response to that might be, well, six of one, half a dozen of another."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2676.26,"end":2689.61,"speaker":"Fr Stephen De Young","text":"I want to make sure we're being as charitable as possible possible. Okay, Right. And so even, you know, yeah, in one way it's objections, but I want to, I want to give our Protestant friends who have this issue even more credit than that."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2690.01,"end":2690.49,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2690.57,"end":2718,"speaker":"Fr Stephen De Young","text":"And say, and say that this isn't just them wanting to have an argument, although some of them, that probably is it, but they're not trying to have an argument, but that, that this is a difference that they don't see. And so the whole idea, they're good hearted people, they love Christ, they want to worship only the true God. And since they don't see the distinction, the whole thing makes them really queasy and nervous."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2718.48,"end":2719.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2719.44,"end":2722.48,"speaker":"Fr Stephen De Young","text":"It's not just a sort of an intellectual objection or something."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":2723.04,"end":3055.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. It looks like worship to them what we do with saints and angels, you know, And I think that the basis for that is. And we're going to get into this, I think especially. But the basis for that is that the actions that most Protestants do in their worship services. So let's be explicit. So singing to God, praying to God and telling him how awesome he is, you know, and in some cases, like if you're more affected by, say, for instance, the charismatic movement, they might lift up their hands. These kinds of things are what is identified as being worship in those contexts, right? And even if they do have, especially as you get to the more the kind of the low church side of things, you know, more sort of Zwinglian understanding of, for instance, communion, even if they have communion, it's largely not described as, interestingly, not described as being that that action is not described as being worship, but is rather as being a memorial. Like, okay, we're doing this to remember what Jesus did for us, right? And so the actions that are described as worship in many Protestant contexts, you know, singing, praying, praising God and so forth, Orthodox look at that stuff and say, well, that's just veneration, right? So when we sing to a saint or tell him that he's awesome or ask him to help us, we don't regard that as worship. We regard that as a veneration. And we're not making this point as just pure apologetics, right? Like, this is not an apologetics show, but I think this is an important point to make because like you said, we're trying to get people kind of off of the grid, off the matrix that they're in and say, there's a whole different world here, actually, that we're trying to help people see and experience. And for the Orthodox, worship is focused on the act of offering, right? And it's not just offering prayers, but actually offering sacrifices. And in the Orthodox Church, there's essentially two sacrifices that are offered. Now, I mean, you know, the. The term gets metaphorically used to refer to, for instance, the sacrifice of praise, right? But there's really two sacrifices that are being offered. One is the sacrifice of the Eucharist. Bread and wine being offered on the altar, changed by God to be the body and blood of Christ. And then we share that sacrificial meal with him, because that's what sacrifice is. And then also incense is sacrificed. Incense is offered. It's offered to God, but again, we share it with him, right? We smell it, right? It's not just offered to God for Him to smell, so to speak, but it's offered to God and we share it with Him. So again, it becomes a means of communion between us and Him. And even though it's not a meal, it's still ingested, literally. You know, we're still bringing it into ourselves. And so incense and the Eucharist are the things that are sacrificed, offered in the Orthodox Church and that we understand as being the. That is what worship truly is. There are services where we don't offer those things, like compline, for instance, or the hours. And we would say, well, those are prayer services. But worship in its true, true sense is about offering sacrifices for the purpose of communing with God. And we don't offer the Eucharist to angels, we don't offer incense to saints. We offer those things to God alone. And so for us it's like, well, you know, you say, well, you know, you're worshiping saints. We're like, well, no, we didn't offer them the Eucharist. You know, it becomes really obvious when you understand that that's what worship is. And then you can see this in the scripture. Okay? That's what worship is in scripture. And the ancient world understands that. And whether you're talking about ancient Israel or the New Testament or even pagans understood that that's what worship is. It's sacrifices. Whether it's food sacrifices or incense sacrifice, that's what worship is. And so sometimes again, a well meaning Protestant might say, well, what about some uneducated Orthodox person who's bowing in front of an icon of a saint? For them, is there any big difference between worship and veneration? They may not be able to explain the difference to you. They may not have the theological education to say the things that I just said, but they know that they don't offer the Eucharist to St. George. They know they don't do that. They know that when they eat and drink that bread and wine, that that's the body and blood of Jesus Christ, not the body and blood of St. Paul. Right. Or of an angel. That's really the key, key difference. So let's kind of get deeper into some of that now."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3055.42,"end":3087.58,"speaker":"Fr Stephen De Young","text":"Yeah. That's made it very explicit in the words of the Divine Liturgy that when we're offering the Eucharist, we're offering the Eucharist for the people there. Right. For the, for the whole church, for the whole world. And for. And after the word for it runs through, a list of the saints, including the saints commemorated for that day. And that list culminates with we're offering it especially for the Theotokos, the Virgin Mary."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3087.82,"end":3088.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3088.94,"end":3094.55,"speaker":"Fr Stephen De Young","text":"Christ's mother. It's offered not to her, but especially for her."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3095.35,"end":3095.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3095.75,"end":3110.55,"speaker":"Fr Stephen De Young","text":"Right. So just as the saints pray for us, we offer our worship for ourselves and for the saints in this, in this unity. But there's. There's a place where in the ancient world, this rubber really met the road."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3111.11,"end":3118.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This was really. This was really interesting to me when we started exploring this as we prepped for this. So go ahead. Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3118.9,"end":3136.06,"speaker":"Fr Stephen De Young","text":"So. So in. In the ancient world, we've talked about the divine council. What? The divine council in a pagan context is what we today call a pantheon. Right. The. The group of the gods, and then there's one who presides."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3136.62,"end":3137.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3137.1,"end":3212.22,"speaker":"Fr Stephen De Young","text":"And kingship. And this goes all the way back to Sumeria. The Sumerian kings list begins with. With the kingship coming down out of heaven. So they viewed the king as a God, as a divine figure, and he was a member of that council. And so as the member of that council, he had a role in representing his people in the council, though that was often not taken very seriously. He had a role in representing that council to the people in terms of him being a God that was taken more seriously by pagan kings. But while those elements are sort of adapted into the kings of Israel, where, for example, King David did pray and intercede for Israel before God. Right. And was responsible to administer God's justice on this earth to serve as sort of an icon or image of. Of God in the pagan context, the king also, as a God, received worship. He was the object of worship."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3212.46,"end":3213.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3214.7,"end":3242.23,"speaker":"Fr Stephen De Young","text":"Sacrifices and libations were made and offered to the king as to the king, one of the gods. And so we see that. I mean, sort of an exhibit A, Just an example that probably the vast majority of people listening this will be familiar with comes from the third chapter of the Book of Daniel, where Nebuchadnezzar sets up the big statue of himself and commands that everyone must worship it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3243.11,"end":3243.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3244.07,"end":3288.61,"speaker":"Fr Stephen De Young","text":"And of course, the. The. The three youths refuse and end up getting thrown into the fiery furnace. But this was. This was prototypical in the pagan world, not just in Babylon. As I said, this started in Sumeria. This goes on to the imperial cult in the Roman Empire before St. Constantine, where, starting with Julius Caesar, they believed he ascended into the heavens and joined the divine council as one of the gods. And so he was the object of the offering of incense. Thousands of Christians were killed by the Roman state for refusing to offer incense to the spirit of Caesar."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3289.01,"end":3289.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3290.69,"end":3293.65,"speaker":"Fr Stephen De Young","text":"And so this was just commonplace."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3294.13,"end":3294.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3295.25,"end":3321.42,"speaker":"Fr Stephen De Young","text":"And not. But the answer to that when it comes to the Jewish people and this, the rubber meets the road on this, like in Daniel 3, when they're in exile. Right. When they're not in their own land. Because when they're in their own land and they have their own king. It's kind of clear to both the king and the people, they're not supposed to worship the king. And to the king, he's not supposed to be worshiped. But now they're living in the land ruled by another king, a pagan king who does demand their worship."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3321.66,"end":3322.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3322.78,"end":3338.61,"speaker":"Fr Stephen De Young","text":"And the answer to that for the faithful Judahites in Babylon is not know you're to have nothing to do with that no good, wicked pagan king. Right. Stay separate from him. He's, you know, in our modern terms, he's the Antichrist."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3339.01,"end":3339.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3339.73,"end":3353.33,"speaker":"Fr Stephen De Young","text":"You know, get rid of anarchy. Right. You know, oppose him. The answer is no. You don't pray to him or worship him. You pray for him and you worship for him."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3354.05,"end":3354.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3354.9,"end":3366.26,"speaker":"Fr Stephen De Young","text":"You offer sacrifices for him, you offer prayers for him, you offer incense for him to the true God. To the one true God, who is his Creator."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3366.74,"end":3429.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The direction that you offer your worship is really important. It's not just, okay, you're doing this act of worship, but to whom is it being offered? You know, there's an offer and a receiver. Right. And, you know, there's multiple places in the scripture where it says to pray for the king or pray for, like, for instance, Jeremiah 29:7, you know, seek the peace of the city where I've caused you to live in captivity. Pray for it to Yahweh, for in its peace you will have peace. You know, support your local community by praying for it. And of course, we do that in all of our church services in the Orthodox Church for this city and for every city and countryside, you know, and the people who. And the people who dwell therein, the faithful who dwell therein, let us pray to the Lord. Right. It's exactly that sense that we get from that verse I just read from Jeremiah. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3430.29,"end":3459.89,"speaker":"Fr Stephen De Young","text":"Yeah. And so that's a key. You know, to someone today, it may seem hazy. Right. Even when we talk about the difference between, like tonight, intercession, seeking intercession and. And worshiping. Right. Seeking intercession from the Spirit before the true God versus worshiping this as a God alongside God. Right. But here, when you've got a king, he's standing in front of you threatening to murder you. Right. That difference becomes very clear."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3460.45,"end":3460.89,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3460.89,"end":3464.37,"speaker":"Fr Stephen De Young","text":"Because there's something that you're called to do and then something you cannot do."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3464.85,"end":3497.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's super applicable to. To us today where. Where, you know, we just. We're in the midst of a really tense political period right now, at least in the United States. And sometimes praying for a particular government official or a particular candidate for office is taken as a kind of endorsement. Right. But the scripture tells us to pray even for pagan kings who are actively slaughtering the people of God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3498.59,"end":3500.99,"speaker":"Fr Stephen De Young","text":"Let me put a. Let me put a fine point on that."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3501.31,"end":3501.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3501.87,"end":3515.87,"speaker":"Fr Stephen De Young","text":"It. First Timothy 2, verses 1 and 2. St. Paul says, therefore I exhort first of all that entreaties be made. Prayers, intercessions, and thanksgivings. The word for thanksgivings there is literally Eucharists."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3516.19,"end":3516.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3516.63,"end":3527.95,"speaker":"Fr Stephen De Young","text":"On behalf of all men, on behalf of kings and all those who are in authority, so that we may lead a calm and peaceful life in all godliness and sanctity. And that's taken over to the prayers of liturgy."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3528.03,"end":3528.51,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3528.51,"end":3536.67,"speaker":"Fr Stephen De Young","text":"But so St. Paul is saying that in the Roman empire, much of St. Paul's ministry was conducted under the reign of Caligula."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3537.15,"end":3545.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Who? You know, Google him, people, if you don't know who that guy is, he was out of his mind, literally."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3545.71,"end":3546.07,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3546.07,"end":3546.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3546.51,"end":3549.95,"speaker":"Fr Stephen De Young","text":"One of the most vile human beings to ever live on purpose."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3550.75,"end":3551.15,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3552.02,"end":3560.98,"speaker":"Fr Stephen De Young","text":"And so if St. Paul can pray for him, if St. Paul's approach to him is, well, we need to pray for him and hope that he will find Christ."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3561.54,"end":3561.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3562.18,"end":3576.82,"speaker":"Fr Stephen De Young","text":"And that that's what we need to all do, then I don't care how much you hate the current president or the previous one, you can pray for him too. Right. Because he's got nothing on Caligula, I guarantee it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3577.07,"end":3671.52,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And so then even more than that. So even more than just praying for the authorities, which I think most Christians can swallow that like, okay, yes, I will pray for the authorities, even if I don't like them, you know, even if they're actively trying to kill me. The scriptures actually also tell us to honor them, to honor the authorities. So, for instance, and like in the fourth commandment. Right. Honor your father and your mother. Right. That's not understood in the scripture as, like, if you give honor to your father, that that's taking something from God. Because all honor should go to God. Right. It doesn't do that. And then 1 Peter 2, 17. Honor all men, love the brotherhood, fear God, honor the king. Again, the scripture tells us explicitly to give honor to human beings who are set in authority over us. And even it says to honor all men, you know, everybody. Right. And that's what we're talking about as orthodox Christians. We're talking about giving honor. So we honor the king, we pray for the king, but we do not give sacrifices to the king. And the same is true with the angels and the saints. We honor them. Now, of course, we don't need to pray for them. We ask them to pray for us. But we also definitely do not offer sacrifice to them. That's a worship that's due God alone. You don't give sacrifice to anyone but to God."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3671.92,"end":3723.1,"speaker":"Fr Stephen De Young","text":"Yeah. And more than just honoring our parents or honoring the civil authorities or honoring the saints or honoring the angelic hosts, not only does that not conflict with giving all honor and glory to God, that is how we give honor and glory to God. And the New Testament is very clear on that. Right. That's why it says, you know, to serve your. Your master or your employer. Right. As you would serve Christ. Because the authority they have over you, they have from Christ. And so if you respect and honor and obey that authority, you are respecting and honoring and obeying Christ. If you rebel against it, you're rebelling against Christ. If you rebel against your parents, you're rebelling against Christ."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3723.66,"end":3724.14,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3724.14,"end":3724.46,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3724.46,"end":3880.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And I think one of the problems, of course, again, is, you know, looking at it from a modern point of view when we talk about honor. So Orthodox Christians, when we say we honor the saints, we really know what we. We know what that means. We bow in front of an icon, we kiss an icon, we sing praises to a saint. You know, these are. These are the things we do when we honor, when we venerate. There's actions, specific actions. In the modern world, when we tend to talk about honor, it's a much more kind of ephemeral idea, like, oh, I'm honored that you would choose me, or I honor the sacrifice you made. It's more about things that you say more than anything else. But we still actually do have some of those specific actions of honor. So some examples, for instance, when a soldier is very brave in battle and has done something meritorious, we give him a medal. That is an action of honor. That is an action of veneration to that man or woman. Right. Again, to continue in the military image, junior servicemen and women salute their superior officers. That is to give honor and veneration to that superior officer because of where that person is in the hierarchy. Right. And, you know, we, in public events, we stand up for the flag, we take our hats off, we put our hands over our hearts, and, you know, we may say words of praise for someone that we're honoring, but likewise, like to take it out of all those kinds of public things. One of my favorite examples is if you go to a cemetery, everyone venerates in a cemetery. You know, you're quiet. That's a way to show veneration, honor. You might put flowers next to a grave. That's veneration and honor. You might light a candle next to the grave. You might say prayers there. You might even talk to the person who has departed. Right. These are all ways that we show veneration and honor in various circumstances. And so when the Orthodox say that we venerate and honor saints and angels, that's what we mean. That is what we mean. And really nothing else. You know, it's not. We're not trying to pull a fast one on anybody. Right. You know, I say, oh, you know, I'm honoring this saint, but I'm going to slip in a little worship when no one's looking like it's just two different actions. It's not the same thing. Now, often veneration goes alongside worship, but worship is a specific action of offering. It's not any religious looking thing you might do. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3881.12,"end":3887.68,"speaker":"Fr Stephen De Young","text":"So, yeah. So are we going to have our break before our third half and then come back with necromancy?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3888,"end":3900,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. It's a great time to take a break and we'll have everybody on the edge of their seats as they think about necromancy for the third half of the Lord of Spirits. So we'll be right back."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3900.64,"end":3918.47,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3923.43,"end":3926.39,"speaker":"Mother Alexandra","text":"Here is Mother Alexandra of blessed memory."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3926.71,"end":3954.99,"speaker":"Sherry","text":"It seemed to me that in this modern life of ours, where everything has become so frightfully materialistic, there is a very great need of transfiguration, of a change of our attitude, our way of thinking, our way of behaving, our way of holding ourselves. Everything needs a new Christianization. We must become more aware of the Christ within us."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":3955.55,"end":4010.8,"speaker":"Mother Alexandra","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the Church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the Church as expressed in her theology, hymnography and iconography. For those who long to become better acquainted with these holy servants of God and to understand their role in our lives, this book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com we're."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4010.8,"end":4026.6,"speaker":"Steve","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4028.28,"end":4044.04,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. You know, when you hear the voice of Steve, that means we're about to come back. Before we get into our discussion of necromancy, first we want to take one of our calls. And that is from Elijah in Georgia. Elijah, welcome to the Lord of Spirits."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4045.55,"end":4048.27,"speaker":"Elijah","text":"Hey, thank you very much. Father's Bless."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4048.67,"end":4050.19,"speaker":"Fr Andrew Stephen Damick","text":"God bless you. You made it through."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4051.47,"end":4058.75,"speaker":"Elijah","text":"I did. This is one of, you know, thank you all so much for doing this show. It really beats like, sitting around watching the news or something."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4059.23,"end":4067.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is the real news. This is what's actually going on. So what's your question, Elijah?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4068.91,"end":4084.12,"speaker":"Elijah","text":"Well, well, honestly, I have tons of questions on surprises, but the one that I called in at night was in. Yeah, exactly. Was regarding something that was asked of Father Stephen on a previous episode."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4084.44,"end":4085,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4085.64,"end":4104.29,"speaker":"Elijah","text":"Somebody asked, what is the relationship between mental illness and spiritual affliction? And he just said, oh, probably. Probably the same as the relationship between physical illness and spiritual. Spiritual affliction. So I was wondering if maybe you could elaborate on that a little bit."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4105.89,"end":4109.57,"speaker":"Fr Andrew Stephen Damick","text":"Well, you're on the spot, Father Stephen, so say more."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4109.97,"end":4117.01,"speaker":"Fr Stephen De Young","text":"As I recall, we experienced some of our trademarked technical difficulties in the middle of that answer to boot."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4117.57,"end":4123.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Yes. That's when the power went out. So everybody make the sign of the cross right now."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4127.65,"end":4443.55,"speaker":"Fr Stephen De Young","text":"So hopefully. Yes. So the first part of that was I was obviously making an equation between mental illness and physical illness, that these are the same kind of thing. And we tend to think about them differently. We tend to think about mental illness as if it's something you can think your way out of or talk your way out of or, you know, just cheer up. I mean, you wouldn't say that if you saw someone with a broken leg and the bone protruding. You wouldn't say, hey, cheer up, guy, you know, get up and walk it off. You know. But we say that to people suffering from depression all the time. Right. And it's just as ridiculous. So I wanted. I wanted to make that equation. But then the other piece, and I think what you're actually wanting to know about is how that relates to spiritual beings and that kind of thing. And so we, we know from the scriptures and from orthodox tradition that there are times when we already talked about Job a little bit tonight. There are times when God allows demonic spirits to afflict human beings in different ways. Sometimes that's mental, sometimes that's spiritual, sometimes that's physical. Like in the case of Job, you know, a building collapsed on his children. So that God allows these things to happen. And we get windows. One of them is, is, is Job. One of them is St. Paul talking about the thorn in his flesh where he was afflicted by the evil one, and that the purpose that people are able to find in them. And I phrased that a very deliberate way because a lot of times when things like that happen to us and we suffer or we suffer some catastrophe or some loss, we ask sort of why, in the sense that we're looking for some kind of answer out in the ether somewhere. Like we want to, this is a theme in Job. I mean, Job really reflects on this in the ancient world, right? We want to, we want to go and find God and ask him. Or if we're feeling really salty, we want, you know, God to come down here and explain himself, right? Because we're, we're angry that this, that this has happened to us. And we want, we want him to sort of explain, well, here's the reason why. And if you just understood, you know, the whole cosmos and what's going on, you'd know why you had to break your leg or why this person you love had to pass away now instead of years from now. And that's not what we see in the scriptures, and that's not what we see in our tradition in terms of how we receive it. What can make these things meaningful is how we receive these things. So Job suffered all of these things. That's just a reality. It happened to him and he could have reacted the way his friends did, said, oh, well, I must have done something bad and I deserve this, and sort of wallowed in self pity. He could have done what his wife said and just gotten angry at God and rejected God over it. And this happens a lot in our modern world. That's why we have a lot of the atheists we have in our modern world, not all of them, but a lot of them. That's not how he chose to receive it. Right? And that's not how St. Paul chose to receive the thorn in his flesh. The way that they chose to receive it as this testing from God for the purification of their soul, the purification of their body. And by trusting him, that made it meaningful for them, that made it transformative. For them. And the reason why I say that made it meaningful is the day is going to come for every one of us when we die. That's reality. We don't like it, we don't want to talk about it, we don't want to think about it, but that's reality. And when we do, all of our stuff is going to rot and our reputation is going to vanish and be forgotten, and all these other things are going to disappear. And the only thing that's going to be left is ourselves, our soul, eventually our resurrected body and what we made of it. And so if these temporal catastrophes, even the most horrible and painful of them that I suffer, if I can receive those in a way that is beneficial to me and helps me grow and become more like Christ, then that, right, the person who I become through them is something that's going to last into eternity. And so it's infinitely meaningful, far more meaningful than whatever it is I lost, whether that was years of friendship or years of love, whether that was possessions, what, at my health, whatever else it was, those two things, as St. Paul says, you know, you can't compare those sufferings that only go on for a time to the glory of God, that goes on forever."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4446.19,"end":4447.63,"speaker":"Fr Andrew Stephen Damick","text":"Does that help you out, Elijah?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4449.04,"end":4457.2,"speaker":"Elijah","text":"Yeah, I believe so. You know, like I said, I got plenty of questions. I called and asked this one on behalf of my wife and. All right, I appreciate it, and I know she does, too."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4457.52,"end":4585.68,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. Well, God bless you. All right, so before we continue on, we have another question. This comes from Lisa on Facebook. So Lisa asks this. If we are destined to rule with Christ, I never understood who we are ruling over. Is it a hierarchy of unison and mutual submission? That's a great question. And I think it goes to this issue of what exactly it means to rule and to reign. Right. On the one hand, there is a kind of ruling over that happens. So, for instance, the apostles are going to sit on 12 thrones and judge the 12 tribes of Israel. So that does happen in that sense. But if you look at what the angels, for instance, are doing, as we've described it, what do they rule over? Well, they rule over kind of making things run, you know. And the word that actually came to mind when I was thinking about this was a word that is used in the monastic context. So they have a word that's ecclesiarch. Right. Now, that word ecclesiarch gets used in a lot of different ways in the Orthodox Church, but in general in a monastic context, the ecclesiarch. So if you think about that word. It means the church ruler, if you take it apart etymologically. But what the ecclesiarch is, generally speaking in the monastic context is the guy who takes care of the church building. Now, he may. He or she. Sorry, I said guy, but it might be a nun as well. He or she may also be in charge of, for instance, doing things like setting up the books that the chanters are using or, you know, making sure all the supplies are where they need to go. But it may also be, you know, cleaning and lighting lamps and all that kind of thing. So that notion of ruling or reigning is not just the idea of having control over other people, but it's really that something is in your care, Something is in your care. Now, it might be other people, but it may also be, if you're an angel that's been assigned to the stars, then you're taking care of stars. Right? So I don't know. Father Stephen, do you have anything you wanted to add to that?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4586.34,"end":4601.78,"speaker":"Fr Stephen De Young","text":"Well, yeah, I think we need to keep in mind what. What Christ said about rule and authority to his apostles, right? He says, you know, the rulers of. And I really dislike the word gentiles."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4603.62,"end":4604.42,"speaker":"Fr Andrew Stephen Damick","text":"The nations."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4604.74,"end":4675.3,"speaker":"Fr Stephen De Young","text":"Yeah, the nations. Or if it's referring to people, pagans is actually a better translation because it's not talking about an ethnic concept, that's a more modern thing. But the. The rulers of the nations. Right, the rulers among the pagans, they lord it over one another. Yeah, Right. And so I know there's a tension there. You say, well, you're going to rule over the world, cover you could be ruling over other people. Does that mean, like, you know, I'm going to have a boss in the world to come? Right. But that's not how authority works when it's purified and holy. Right. The authority that Christ tells his apostles that they are supposed to exercise is one of communion and love. Right. The authority he talks about between a husband and wife is. Is love and self sacrifice, Right? That's. That's what authority is. So we have to always keep that understanding of authority in mind here, right? That we're not going to be sort of lording it over the animals or the plants or the trees or each other in the world to come."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4675.7,"end":4759.17,"speaker":"Fr Andrew Stephen Damick","text":"It's service. I mean, when Christ wanted to show his disciples the way they were supposed to treat each other, he washed their feet, you know. Yeah, yeah. All right, well, let's continue on. And now we're going to talk about necromancy, death, magic, and we Bring that up. We bring that up because. Not just because Father Stephen and I both have liked role playing games in our past and present, but because that is the way that some people, for instance, look at orthodox Christian interaction with the departed saints, right? That you're trying to summon the dead, that you're communicating with the dead. And that's what necromancy means. It means death magic, right? Or attempting especially to maybe, you know, the traditional understanding of necromancy with almost all those words that end with Mansy is it's about trying to get knowledge that you're not supposed to have, right? Whether it's foretelling the future or, you know, seeing something that's happening in a place that you normally couldn't see. And so in this case it's using death magic to make that happen. So why is orthodox Christian invocation of the saints not death magic? Why is it not necromancy, right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4759.17,"end":4816.94,"speaker":"Fr Stephen De Young","text":"And, and I've gone, I've gone through phases with this, right, in interacting with people, people who are people who I care about, people who I like, people who I love, particularly again from a Protestant background, who have this issue. So, you know, in terms of levels, right, there's sort of the snappy answer, right? There's our snappy orthodox apologetic answer, which is we tell them, we tell someone who has a problem with this to go read Matthew 22:32, Mark 12:27, Luke 20:38, right? Where Christ talking about the resurrection to the Sadducees, says, you know, God is the God of Abraham and Isaac and of Jacob, he's not the God of the dead, but of the living, right? So see, they're not dead, they're alive. And so since they're alive, we could ask them to pray for us and see. Gotcha, right? That's our snappy answer, right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4816.94,"end":4817.54,"speaker":"Fr Andrew Stephen Damick","text":"Check me."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4818.02,"end":4877.5,"speaker":"Fr Stephen De Young","text":"They're active and they're doing something, right? But that snappy answer doesn't really answer the concern because again, these are people who are sincere and good hearted and love Christians, want to worship only God and the idea of this makes them queasy, right? So pushing it a little further, right? The next step, pushing it a little further is, well, okay, are there examples of something like this in the Bible and in ancient Israelite religion and the religion of the Second Temple? And the answer to that is yes, we see this all already beginning in Genesis, where Genesis makes the point of telling us where Abraham and Sarah and Isaac and Rebecca and, and Jacob and Joseph, eventually where they're buried, where their tombs are, and these are sites that are still known to this day."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4877.9,"end":4879.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can go there."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4879.18,"end":4923.69,"speaker":"Fr Stephen De Young","text":"This wasn't just a matter of curiosity, because already then, these were places where people would take pilgrimages, places where they would go to pray. Right. The place where, you know, and you say, well, God's everywhere. Why does it matter where Abraham's now completely decomposed body is? Right. But this was a place, and that has continued to be true in Judaism to this very day. I mentioned to you last week that there was a news article I saw that a group of Israeli settlers had gone to the tomb of Abraham to pray for the results of the United States presidential election."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4924.49,"end":4925.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4925.85,"end":4984.88,"speaker":"Fr Stephen De Young","text":"And you know, that may blow some of our views of Judaism. Right? Because you'd say, well, why would they go. Well, it's because they believe that when they go there and pray, Abraham is praying with them. When you read the interpretation of the verse that gets quoted by St. Matthew in terms of Herod's slaughter of the innocents about Rachel weeping for her children, the interpretation of that that you find all through early Jewish literature in the Second Temple period is that that's talking about Rachel's spirit praying for the people as they went into exile. Right. That this isn't just figurative language, that Rachel actually was weeping and praying and interceding for her children. So this is. It was present in ancient Israel. It's present in Judaism all the way through to this present day. This idea."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4985.44,"end":4986.08,"speaker":"Fr Andrew Stephen Damick","text":"Amazing."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4986.96,"end":4991.53,"speaker":"Fr Stephen De Young","text":"But. But I pushed a little deeper than that."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4991.93,"end":4992.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4993.45,"end":4999.29,"speaker":"Fr Stephen De Young","text":"Because that's still just giving examples, right? That's still just got to, well, see, well, Jewish people do it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":4999.53,"end":5001.45,"speaker":"Fr Andrew Stephen Damick","text":"Precedent, right? Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5001.53,"end":5004.25,"speaker":"Fr Stephen De Young","text":"Yeah. And here's some Bible verses that point to it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5004.25,"end":5004.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5006.89,"end":5020.9,"speaker":"Fr Stephen De Young","text":"And so I wanted to really get into. Because I was still hearing this, and even after I would say these things, I was still hearing this from people, and they weren't people who I could just dismiss. It's like, well, this guy isn't, you know, the sharpest tool in the drawer. He just doesn't get it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5020.9,"end":5021.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5021.22,"end":5099.8,"speaker":"Fr Stephen De Young","text":"No, these are intelligent people, right. Who are saying. It's just. It's. It's necromancy. It's necromancy. Right. And so I push a little. What is it? Right. Because it's not apparent to me. It wasn't apparent to me why you would even connect those two, how those two things were even similar, Right. How. How what the witch of Endor does with Samuel is similar to me asking the Theotokos or St. Stephen to pray for me. Like. Like those. I. I didn't. Like how are these the same? And I, I think when I really pushed, I think what's happening is that for a lot of the people who I talk to who have this issue, who. This makes them queasy and disturbed, I think they're thinking of prayer in terms of communion with God, in terms of experiencing the spiritual communion with God and talking to God and then God talking to them. And so when they hear us use the language that I don't think we should use of praying to saints, then they hear, oh, well, you're communing with St. Nicholas and you're talking to him and he's talking to you. And there's. Right. Like it's."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5099.8,"end":5101.96,"speaker":"Fr Andrew Stephen Damick","text":"You're using a bunch of Ouija boards."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5101.96,"end":5111.4,"speaker":"Fr Stephen De Young","text":"Yeah, right, right, right. And that's why I say I don't think we should use that language because that, of course, is not what we're doing."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5113.48,"end":5147.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not. And I mean, you could, you could say, oh, well, you know, well, look, in 16th and 17th century English, which is the language that we should be praying in, pray just means ask. We see it in Shakespeare all the time, people praying, quote unquote to each other. It just means ask. But I mean, that just sort of begs the point because we don't use the word pray in 21st century English to mean something other than a religious act. You know, I mean, I may wake up and say to my child, you know, I pray thee fetch another gallon of milk from the basement."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5149.52,"end":5151.48,"speaker":"Fr Stephen De Young","text":"I believe that you do that, by the way."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5151.48,"end":5309.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I do talk to my kids that way once in a while and they usually go, dad, you know, but the fact that they would react that way is they know that I don't normally talk that way. And I'm sort of putting something on when I do that. And so I think you're right that asking the saints to pray for us is, you know, that we pray with saints, we pray alongside saints. Just as you gave that example of Israeli settlers going to the tomb of Abraham, that they understand that Abraham prays with them when they do that. And you know, that it makes sense to me that for people who believe that prayer is sort of the great act of communion with God, that you wouldn't want to do that with a saint. But for us, you know, again, we talked about sacrifice and worship and so forth and what exactly those things bring really, really mean, then. Then, you know, necromancy is again, it's about control, right? So, like, I, I think that people do have some that times that sense, like, well, the reason you're talking to a saint is you're trying to find out something secret. Like, well, the truth is, is that most of the time when I ask, in fact almost every single time when I ask a saint to pray for me, I do not get some kind of voice and response back saying, I will now reveal to you the esoteric secrets that you have asked for. You know, like it doesn't, you know, we're not the Illuminati sitting around some giant pyramid in the middle or whatever and putting our hands on it and saying, oh, St. Nicholas, tell us the future. Like, that's not what's going on. And the thing about necromancy is it's really, it's really about control, right? And I think, you know, I mentioned role playing games. I think people who have played those, they get this a little bit better than most. Because what does a necromancer do in Dungeons and Dragons? He tries to make skeletons do his bidding or he makes zombies arise and do his, you know, like that's what he does. That's what a necromancer is, is someone who's exerting force, you know, over dead, dead bodies and stuff and trying to make them do things. But, but, and I think another side of this also is I think of our, our, our, you know, 21st century aversion to death and to dead bodies and so forth. Sure, we should have an aversion to death, but we've so sanitized it that any kind of interaction with bodies, we're just not really into that. And I think that that also is something of an influencer in terms of the way that people think about this."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5310.53,"end":5381.44,"speaker":"Fr Stephen De Young","text":"And also, as you were getting into this really brings us full circle to what we were talking about, that for us as orthodox Christians, the fundamental act of communion, this was true for all ancient people, is not prayer, but is sacrifice. And what you see when you look at examples of ancient necromancy, not D and D necromancy, but ancient necromancy, right, is it all involves sacrifice and sacrificial meals. On the folk level, it involves eating meals with the dead, right, as a way of communing with them in that sacrificial sense. But if you want the clearest example, you could look at the Odyssey and see that when Odysseus wants wisdom, he says, well, I'm going to go and talk to the shade of Achilles. And the way he does that is to go to one of the places that is a gate to Hades which exists, and we'll go into that in a future episode teaser."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5381.44,"end":5381.92,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5383.28,"end":5402.62,"speaker":"Fr Stephen De Young","text":"Goes to one of the places that's a gate to Hades. He sacrifices black goats and he pours their blood into a pool so that the shades could come and drink it, like to lure them up out of Hades so that he can inquire about it. So this is not just communion in a general sense, but this is sacrificial communion."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5402.78,"end":5403.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5403.58,"end":5422.01,"speaker":"Fr Stephen De Young","text":"And this is not just the understanding of. Of communion that exists there, but this is our. Our understanding and the understanding of St. Paul as to how sacrifice and how the Eucharist work. So do you want to read the. The quote?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5422.33,"end":5484.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, sure. So, yeah. So in First Corinthians, chapter 10, which, you know, you just have to love this chapter for so many reasons. But anyways, First Corinthians, chapter 10, verses 16 through 21. The cup of blessing that we bless, is it not communion in the blood of Christ? The bread that we break, is it not communion in the body of Christ because there is one bread? We who are many are one body, because we all commune in the one bread. Consider Israel according to the flesh are not those who eat the sacrifices communicants of the altar. What do I imply then? That food offered to idols is anything, or that an idol is anything? No, I imply that what pagans sacrifice, they offer to demons and not to God. I do not want you to commune with demons. You cannot drink the cup of the Lord and the cup of demons. You cannot commune in the table of the Lord and the table of demons, which I feel like there should be a, you know, apostolic mic drop at the end. At the end of that. Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5484.74,"end":5505.26,"speaker":"Fr Stephen De Young","text":"Boom. And so we do not. We do not have. We do not offer the Eucharist. We do not offer sacrifices. Right. To the saints. But by offering the Eucharist for ourselves and for the saints, we are in communion with each other because all of us are in communion with Christ."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5506.38,"end":5519.1,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. All right. Well, before we wrap up, we want to take one more call. And this is from Sherry in Washington State. Sherry, welcome to the Lord of Spirits."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5520.3,"end":5521.42,"speaker":"Sherry","text":"Thank you, Father."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5523.18,"end":5525.26,"speaker":"Fr Andrew Stephen Damick","text":"What's your question for us this evening? Sherry?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5526.86,"end":5554.31,"speaker":"Sherry","text":"Sorry, let me mute this. Yeah, I apologize. So I was going to ask this question last week, and it pertains to what you were talking about a little while ago about possession and demonic oppression. So I would like to know your thoughts on. Do you feel that a baptized Orthodox Christian can be possessed by demons, Doctor."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5555.1,"end":5587.92,"speaker":"Fr Andrew Stephen Damick","text":"But actually possessed, possessed, like taken control of? Yeah, yeah. That was brought up very briefly and again, I think was this one of our other power problems or something, Father Stephen, where you started talking about this because. Yeah. This was the question about mental illness as well, about someone being demon possessed. And Father, you said there's a difference between mental illness and being demon possessed. And so, Sherry, you're asking, can an Orthodox Christian actually be possessed by a demon?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5588.96,"end":5606,"speaker":"Sherry","text":"Yes, and I'm asking that because I actually in my life have seen a manifestation of that in someone detail. But I mean, literally a physical manifestation, like the color of a person's eyes changing their countenance. Changing. Something very dramatic."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5606.56,"end":5607.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5607.08,"end":5621.59,"speaker":"Sherry","text":"And so I've wondered for years about that issue. All right, well, mental health issues involved, but something like that, you know, where you actually see a physical manifestation of something that's like, wow, you know."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5622.63,"end":5635.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As I often say, we can't necessarily pinpoint what's happening in particular instances with particular people. But Father Stephen will give us a general remark."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5635.35,"end":5662.05,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah. I can't wait on that spit. Now, I will say the things you're describing are kind of archetypal signs of where you consider demonic possession. So the answer to this is you can't get possessed by a demon accidentally. Right. People aren't just walking down the street, minding their own business one day and they get possessed by a demon."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5662.45,"end":5662.77,"speaker":"Sherry","text":"Right?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5662.77,"end":5684.65,"speaker":"Fr Stephen De Young","text":"Right. People who get possessed. Right. Not afflicted. We talked about affliction a little bit ago, but. But people who get actually possessed have invited it. Now, that doesn't. Sometimes that's very literal. Right. I'm here in Southern Louisiana. There's people here who literally invite spirits to possess them and perform ritual sacrifices to make that happen."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5685.53,"end":5686.09,"speaker":"Sherry","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5687.37,"end":5700.54,"speaker":"Fr Stephen De Young","text":"But sometimes it's more subtle. Sometimes it's an invitation that's extended over a long period of time. And it's like the frog in the boiling water where it gets turned up slowly and you end up in a place that you didn't want to when you set out on that journey."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5701.26,"end":5701.82,"speaker":"Sherry","text":"I agree."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5702.54,"end":5729.99,"speaker":"Fr Stephen De Young","text":"Right. So that never happens accidentally. Now, that can't happen to an Orthodox Christian, obviously. Accidentally. My. My qualm with just saying, no, that can't happen to a baptized Orthodox Christian is. Unfortunately, some of our folks think that, well, if I was baptized in an Orthodox church, I'm an Orthodox Christian, even if I've never seen one since. Right. And I'm 50."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5730.23,"end":5730.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5731.19,"end":5738.39,"speaker":"Fr Stephen De Young","text":"And it's being an Orthodox Christian is not like being a jet. When you're a Jet, you're a jet for life. But."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5741.51,"end":5744.15,"speaker":"Fr Andrew Stephen Damick","text":"West side Story reference for all of you youngins out there."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5744.23,"end":5812.15,"speaker":"Fr Stephen De Young","text":"Yeah. But, but you know what? One can be baptized at orthodox Christian and then proceed to live one's life in a way where you are no longer an orthodox Christian. And so it is possible too. And, and there are plenty of scriptures that talk about this in, in the New Testament that talk about trampling underfoot, you know, the, the blood of the covenant and this. And so apostasy is something that can happen. And if you, if you choose to go back to Egypt, you're choosing to go back to Egypt and then you're under the authority of Egypt's gods again and you're back in slavery. That's how St. Paul talks about it a lot is going back into the slavery from which Christ delivered you so that that can happen. But there's still hope for you. Right. That's not like, okay, now you're done. Right. You can return. There is a service that I think we should do more as priests in the Orthodox Church, for any other priests who are listening, there is a service for receiving someone back into the church who has lapsed."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5812.47,"end":5813.03,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5813.35,"end":5851.2,"speaker":"Fr Stephen De Young","text":"And, and we don't do it a lot. We just sort of were happy they came back, you know, and we should be happy they came back. But doing that service of reconciling them again to the church and reform, formally receiving them back, I think is a powerful service and important because these services we do in these rituals we do aren't just symbols or nice things or nice events or milestones in our life, but they actually do something. When that service is done, they are brought back into the church and they are brought back out from under the power of those things, back into the kingdom of, into the kingdom of God and they're set free again."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5852.41,"end":5852.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5853.45,"end":5855.29,"speaker":"Fr Stephen De Young","text":"So, yeah, that's my answer to your question."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5856.09,"end":5856.77,"speaker":"Elijah","text":"Oh, thank you."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5856.77,"end":5858.25,"speaker":"Sherry","text":"That's a very good answer. I appreciate it."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":5858.65,"end":6225.58,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you very much for calling, Sherry. It's good to hear from you. And I always like it when we get follow up questions like, could you say more about this? Yeah. So. All right. Thank you very much for that, Sherry. So. All right, well, we want to. Before we close tonight, we're going to give some final thoughts. But before we do that, I just want to give everyone the big teaser that I know that so many of our dedicated listeners have been waiting for. And that is that our episode on giants is going to be happening next and cheers go up all across America and throughout the world. Yeah, we're going to be talking about giants. We've teased it over and over again, but we're finally going to be doing an episode on Giants, but I just want to mention that because it is falling on American Thanksgiving, we're not going to be in the studio that night doing it live. It's going to be a pre recorded show, but that doesn't mean that we're not going to be taking any of your questions and stuff, but you're just going to have to submit them beforehand. You can send them to us via email@lordofspiritscientfaith.com or you can also use our Speak pipe. If you go onto the live show part of the ancientoffaith.com website, you'll find way down at the bottom because we're the most recent live show that's happening. There is a Speak Pipe link that you can click there and you can leave us a voice message. And if we choose that one, then we will include your voice on that recorded episode that's happening two weeks from today. So like I said, it's not going to be we're not going to be in the studio live doing it, but we are going to record that episode. You're not going to have to go without. And it is going to finally be our Giants episode. So you're not going to want to miss it at all. So. All right, well, I just wanted to give a few closing thoughts and then Father Stephen and then we'll be done for the evening. We titled this episode His Minister's Flaming Fire, which is the end of a clause first in Psalm 104:4. And it's also quoted then in Hebrews 1:7. And you know, we hear this a lot in the Orthodox church pertaining to angels. You know, he makes his angels spirits as ministers of flaming fire. And this gets translated in various ways. Where does this image come from? Well, to dive into what I know is one of Father Stephen's favorite subjects just a little bit in Ugaritic mythology, which is that's the BAAL cycle stuff. We're going to talk about baal, I know a lot more in the future. The God Yam, who is the God of the oceans and is the most high God within that mythology. His messengers appear as flaming fire in the assembly of the gods in that pagan version of the divine council. And so what happens then is that idea of angels being associated with fire. That image is used in the scriptures, right? His ministers flaming fire. But this is not just a poetic image like, oh, angels are scary. And so fire is scary. And so we're going to make them look like fire. Rather, this fire is understood as being the fire of God's presence. The fire of God's presence, and that they become kindled by their participation in God, by his active love for them, and especially important for our purposes this evening, his sharing of his ministry with them, his governance of this world, his love for the creation that he's made and especially for us. Right. And that powerful, powerful image of God's presence in his angels. You know, it says in the Scripture, God is wondrous or wonderful in his saints. This is one of the ways that we understand that the saints, the angels, do not function apart from God as they participate in the rule of this. Of this creation, as they. They help to steward it, to take care of it, to intercede for it. They're not apart from God. They're participating in God. Right. You know, one of the conversations that Father Stephen and I had, and maybe I'm stealing his thunder here a little bit. I don't know. You know, when a king assigns a duchy within his kingdom to a duke, that doesn't take away from the honor of that king, and indeed, it extends it. You honor the duke and you, the, therefore, are honoring the king. And the duke takes care of the lands assigned to him because he's honoring the king, and he does it in the name of the king. Right. And so that's what the angels and the saints do. They are participating in God's own care for the creation, his own ministry. And so they intercede for us, and they help to take care of us. And it's such a beautiful, beautiful image, you know, when the scripture says over and over again that we're going to reign with Christ, this is what it means, that we are actively doing the things that are necessary to make the kingdom go right. But it's not going to be drudgery because all of the imperfection of this world will have fallen away. All the sin of this world will have fallen away. So it's not going to be drudgery. It's going to be glorious, beautiful, and super not boring. The life, the age to come, is not going to be some static thing. It's going to be active. It's going to be creative. It's going to be the continuation of stories, to use J.R.R. tolkien's image that I mentioned, the beginning. It's going to be the continuation of all that is good and even more than now. So, Father Stephen, why don't you give us the final word?"}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6225.9,"end":6247.74,"speaker":"Fr Stephen De Young","text":"Sure. And I do want to say first, I was perfectly willing to do a live program on Thanksgiving. But Bobby Maddox is going to be in a turkey coma, so he wouldn't have an engine, so I'm just going to throw him under the bus on this one. But in terms of summing up what we've been talking about this evening."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6250.07,"end":6250.23,"speaker":"Fr Andrew Stephen Damick","text":"I."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6250.23,"end":6419.63,"speaker":"Fr Stephen De Young","text":"Think the verb or the preposition with is very important. I mentioned a little bit switching from praying to with. Right? The sun and the moon and the stars, praying with Adam and Eve for repentance, the angels making our entrances in the church and worshiping with. With us, I think is crucially important. St. John Chrysostom says that wherever Christ is, there are the saints, there are the angels, there are all the hosts of heaven there with him. And I think, especially now, as you know, when I. When I was seeing some news earlier today, things are getting locked down again. Throughout this year, I think a lot of people have felt alone. And I don't think that the way a lot of times we talked about taxonomy, you know, and trying to find these structures and the way we think about God's heavenly administration and the saints and the angels, where it's like, oh, well, you can't. What, you can't go to God directly. You have to go through the. These other people in this. I think that's especially unhelpful in a time like this, because the truth that we're talking about at its core and at its most practical level, in terms of the saints and the angels praying with us and interceding for us, is that if I'm not allowed to leave my house and I'm stuck in my room and I've got an icon of Christ and a candle, and I light it and I. And I pray I'm not alone. I'm surrounded by saints from thousands of years of righteous people who have loved God as I do and love Christ as I do, have struggled with what I've struggled with, been through what I've been through, gone ahead of me and are now there praying with me and for me, and the angels are there worshiping with me, and Christ is there with me. And so, as Christians, we're never alone. That's what this is about, realizing that. And not only are we never alone, we're never going to be alone. This communion and this fellowship and this family that we're in, in this brotherhood and sisterhood that we share with each other, with all those who have gone before us and all those who will come ahead of us in the future, is something that's going to last forever into the world to come and that love and communion and faith is the substance of, of the rule that we're talking about and the intercession we're talking about. And so it's the stuff that sort of makes up what it means when we say we have this glorious destiny to be sons of God in the world to come."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6420.91,"end":6453.33,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you to all of you for listening. If you didn't get a chance to call in during the live broadcast, but we would love to hear from you either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page or leave us a message via Speak Pipe and we read everything, but we can't respond to everything. And we do save what you send for possible use in future episodes and."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6453.33,"end":6472.2,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And don't forget to like our Lord of Spirits Podcast Facebook page while you're at it and join our Facebook discussion group, leave a recommendation and then invite all your friends."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6472.92,"end":6481.16,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts and that raises the visibility of the show and gets more people connected."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6483,"end":6491.86,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com and help make sure that we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6492.42,"end":6493.94,"speaker":"Fr Andrew Stephen Damick","text":"Thank you and God bless you."}
{"episode_id":"LOS - #007 - 2020-11-13 - His Ministers Flaming Fire","start":6495.62,"end":6532.85,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
