{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":0.32,"end":65,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":66.92,"end":167,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. It's the 33rd episode of the Lord of Spirits podcast and the last episode of 2021. My co host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. Matuska Trudy will be taking your calls tonight and we're going to get to those in the second part of our show. So when the prophets ascend in heavenly visions, they see the divine council, the throne of God, the cherubim, the seraphim, the angels and a man. And sometimes outside of prophetic visions, that man shows up on earth and he talks and even eats with people. Who is this man in heaven? Who is this man from heaven? Well, tonight we're going to wrap up our four part series on the Christology of the Old Testament. In our first episode we looked at the title, the angel of the Lord. And the second it was the word of the Lord or the Word of God. And last time we looked at the phrase the Son of man. All of these appear in the scriptures and get used by the fathers and the divine services. So tonight we're going to look at, well, almost everything else from the Old Testament where God appears in some kind of physical form, but especially in a human form to us, his creatures. Father STEPHEN I was told that no one has ever seen God ever, like ever, ever. So what's going on?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":167.8,"end":171,"speaker":"Fr Stephen De Young","text":"Except for all the times that they do yeah, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":171.56,"end":172.16,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":172.16,"end":174.92,"speaker":"Fr Stephen De Young","text":"Right. Yes. It is the Eve of Christmas Eve."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":175.24,"end":177.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Christmas Eve Eve. Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":177.56,"end":185.8,"speaker":"Fr Stephen De Young","text":"And so this is our Christmas Eve Eve episode, Christmas Eve Squared. And I want to try something."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":186.6,"end":188.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I'm ready for anything."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":189.24,"end":202.91,"speaker":"Fr Stephen De Young","text":"The revival of Dexter. At the beginning of each episode, they show us in quick succession these 1 second clips from later in the episode. Oh, right. To like tease what's gonna happen and get you interested."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":203.23,"end":203.79,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":203.95,"end":218.51,"speaker":"Fr Stephen De Young","text":"So I ought to tell people that if they stay tuned tonight, they will hear about the Pleasing man, they will hear about the Cherubim Zodiac, and they will get another example of why time and space don't exist. There we go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":218.83,"end":220.67,"speaker":"Fr Andrew Stephen Damick","text":"So stick with us, everyone."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":220.99,"end":223.15,"speaker":"Fr Stephen De Young","text":"Yes. So that's what awaits you."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":223.73,"end":230.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And as you're about to found your new prog rock band, you can call your lead singer Cherubim Zodiac."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":230.45,"end":235.81,"speaker":"Fr Stephen De Young","text":"Yes, yes. You can find a way to work, call your first album Pleasing Man. You could work this all in."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":238.85,"end":239.13,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":239.13,"end":250.81,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And one of the ways of talking about this that we mentioned way back in the episode about God's body, which was what, like the fifth or sixth episode or something?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":250.81,"end":261.63,"speaker":"Fr Andrew Stephen Damick","text":"I don't even remember. No, it was early this year, but we had done, you know, a few months. Yeah, we had done a few months of stuff. Yeah, yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":261.79,"end":263.31,"speaker":"Fr Stephen De Young","text":"It all blurs together anyway."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":263.31,"end":263.79,"speaker":"Fr Andrew Stephen Damick","text":"It does."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":264.35,"end":282.11,"speaker":"Fr Stephen De Young","text":"So we talked about this term that was used, well, sort of attempted to be repurposed by St. Mark the Ascetic, or sometimes called St. Mark the Monk, Kyriakos Anthropos in Greek."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":282.66,"end":284.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He shows up in the Philokalia."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":284.54,"end":303.46,"speaker":"Fr Stephen De Young","text":"Right, right. And that gets sort of brought through Latin as the Dominical man or the Lordly man, is the idea. Now that term, I say he attempted to repurpose it because that term was used by the Apollinarians to describe sort of their composite Christology."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":304.1,"end":304.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":305.62,"end":354.72,"speaker":"Fr Stephen De Young","text":"And St. Mark tried to sort of take the terminology and repurpose it. And. And it didn't really catch on. So the other Father, other later fathers didn't sort of pick up on it and use it the way he did. But it was a way for him to talk about the. In scare quotes, pre Incarnate Christ. More on that later places where the second person of the Holy Trinity outside of the Incarnation in the New Testament appears in bodily form. Right. It seems to have some sort of particularly human bodily form. And that was a trick which I think if the Apollinarians hadn't already used it probably would have caught on and been helpful."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":354.72,"end":368.24,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, I mean, it's a Pretty good phrase, Kiriak. Just reading it literally. Kiriakos Anthropos. Lordly man. Or, you know. Yeah, yeah. I mean, it's. It works. But unfortunately, heretics got a hold of it and wouldn't let go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":368.48,"end":411.53,"speaker":"Fr Stephen De Young","text":"Poisoned the well. Yes. Yeah. So tonight we're going to kind of be going through some passages in some detail, as is our want, because there are a few sort of key passages. And as you also mentioned, this is kind of. While the last three episodes were very well, for us, tightly themed, this one we're going to touch on a lot more stuff along the way that's maybe not directly related, but because we're going to be working through these passages, there are going to be other sort of related things that come into play that we'll talk about."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":411.77,"end":422.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Although I should say, by the way, though, we did get a comment from someone that described our last episode as, quote, a rather tortuous and winding journey around the issue."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":423.15,"end":424.51,"speaker":"Fr Stephen De Young","text":"Oh, that's cool."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":424.67,"end":427.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So not everybody thinks it was very focused."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":427.39,"end":430.27,"speaker":"Fr Stephen De Young","text":"Those are my favorite comments. Well, that's why I put it the. For us."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":430.35,"end":431.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, for us, exactly."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":431.63,"end":433.11,"speaker":"Fr Stephen De Young","text":"Yes, for us. It was good."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":433.11,"end":450.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I, you know, I think that part of the reason that it comes to be that way is that if we just simply say, okay, here's the question and here's the answer, good night, everybody, that we miss the way that the answer needs to be received."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":451.01,"end":451.41,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":451.49,"end":468.01,"speaker":"Fr Andrew Stephen Damick","text":"And often there's a whole lot of, you know, unlearning what you have learned kind of thing that we have to do along the way. So I don't know. I'm not going to make any apologies for our rather torturous and winding journey around the issue, but God bless you, reviewer. Thank you very much for that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":468.01,"end":485.24,"speaker":"Fr Stephen De Young","text":"Yeah, no, yeah. I mean, that reminds me of someone. Someone asked Alfred Hitchcock once why nobody in his movies ever called the police, and he said question, because then the movie would be over in five minutes and that would be boring, was his response. Right, right. So, yeah. Come on, man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":485.4,"end":486.6,"speaker":"Fr Andrew Stephen Damick","text":"How it should have ended."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":487.4,"end":490.6,"speaker":"Fr Stephen De Young","text":"Spirits Edition. Yeah. Have some fun. Have some fun."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":490.68,"end":491.32,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":491.8,"end":497.24,"speaker":"Fr Stephen De Young","text":"We're all here to have a good time. And that's right. Hear, hear. Song lyrics from they Might Be Giants."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":497.88,"end":499.56,"speaker":"Fr Andrew Stephen Damick","text":"Get Trudy home late for dinner."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":499.64,"end":502.28,"speaker":"Fr Stephen De Young","text":"Yeah, right. That's our goal."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":503.1,"end":508.3,"speaker":"Fr Andrew Stephen Damick","text":"So. Okay, well, the first Back to Daniel 10. Back to Daniel's prophecy."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":508.3,"end":538.05,"speaker":"Fr Stephen De Young","text":"Back to Daniel. Yeah. So, yeah, the first. The first one of these texts that we're going to go through in some detail is from Daniel, chapter 10. We spent a lot of time in and around Daniel 7 last time. And we've sort of gone through Daniel 7 from three or four different trajectories by this point. But Daniel 10 is less read. We have touched on it before, actually, way back in one of the early episodes, but I won't guess which one because apparently I'm way off."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":538.13,"end":542.45,"speaker":"Fr Andrew Stephen Damick","text":"So. But in the before times."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":542.53,"end":575.05,"speaker":"Fr Stephen De Young","text":"Yeah. So way back in the long ago time, we briefly touched on it, but we're going to now go through it in some detail because this is one of the. I wouldn't go so far as I did last time. Last time. I mean, Daniel7 really is for the. The sort of eschatological son of man figure is the locus classic classicus for discussing it, but Daniel 10 is not really the locus classicus for discussing the heavenly man, but it's one of the most significant passages for this discussion. So that's why we're starting there. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":575.69,"end":787.26,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, I'm going to read the passage. And this is. Well, you'll hear. This is Daniel speaking. In the third year of Cyrus, king of Persia, a word was revealed to Daniel, who was named Belteshazzar, and the word was true, and it was a great conflict. And he understood the word and had understanding of the vision. In those days I, Daniel, was mourning for three weeks. I ate no pleasing food. No meat or wine entered my mouth, nor did I anoint myself at all for the full three weeks. On the 24th day of the first month, as I was standing on the bank of the great river, which is the Tigris, I lifted up my eyes and looked, and there suddenly appeared a man clothed in linen, with a belt of fine gold from Uphaz around his waist. His body was like a beryl, that's B E r y l the gem. His body was like a beryl, his face like the appearance of lightning, his eyes like flaming torches, his arms and legs like the gleam of burnished bronze, and the sound of his words like the sound of a multitude. And only I, Daniel, saw the vision. For the men who were with me did not see the vision, but a great trembling fell upon them, and they fled to hide themselves. So I was left alone and saw this great vision, and no strength was left in me. My fair appearance was fearfully changed, and I retained no strength. Then I heard the sound of his words. And as I heard the sound of his words, I fell on my face in deep sleep with my face to the ground. And behold, a hand touched me and set me trembling on my hands and knees. And he said to me, o Daniel, favored man in the Greek Old Testament, man of desires, understand the words that I speak to you and stand upright, for now I have been sent to you. And when he had spoken this word to me, I stood up trembling. Then he said to me, fear not, Daniel, for from the first day that you set your heart to understand and humbled yourself before God, your words have been heard. And I have come because of your words. The prince of the kingdom of persia withstood me 21 days. But Michael, one of the chief princes, came to help me, for I was left there with the kings of Persia and came to make you understand what is to happen to your people in the last days, for the vision is for days yet to come. When he had spoken to me according to these words, I turned my face toward the ground and was mute. And immediately one having the likeness of the sons of Adam touched my lips. Then I opened my mouth and spoke. I said to he who stood before me, o my lord, by reason of the vision, pains have come upon me and I retain no strength. How can my Lord's servant talk with my Lord? For now no strength remains in me, and no breath is left in me. Again, one having the appearance of a man touched me and strengthened me. And he said, o favored man. Again, man of desires, fear not. Peace be with you. Be strong and courageous. And as he spoke to me, I was strengthened and said, let my Lord speak, for you have strengthened me. Then he said, do you know why I have come to you? But now I will return to fight against the Prince of Persia. And when I go out, behold, the prince of Greece will come. But I will tell you what is inscribed in the book of truth. There is none who contends by my side against these, except Michael, your prince. So that's the vision. Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":787.26,"end":793.58,"speaker":"Fr Stephen De Young","text":"And I'm making Father Andrew read these long passages because I have to save my voice for nativity services. So I'm just."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":793.58,"end":794.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is that what it is?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":794.54,"end":795.98,"speaker":"Fr Stephen De Young","text":"Throwing him right under the bus?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":796.22,"end":800.22,"speaker":"Fr Andrew Stephen Damick","text":"I'm a second priest now, so, you know, I don't really have anything I have to do. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":800.94,"end":801.34,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":803.33,"end":805.73,"speaker":"Fr Andrew Stephen Damick","text":"And that's the whole of chapter 10, everybody, by the way."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":805.81,"end":825.81,"speaker":"Fr Stephen De Young","text":"Yeah, that's the whole chapter, but, yeah. And you may have noticed, and as it was mentioned, it's in the first person. And we briefly mentioned before, and we'll only touch on it briefly now, but the Book of Daniel is kind of a mess texturally, textually."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":826.13,"end":827.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":827.91,"end":885.59,"speaker":"Fr Stephen De Young","text":"It switches between third person and first person. People are already at least A lot of people listening to this are probably already aware that the Greek version is very different than the. We'll call it the other version because the other version, the older version, is part in Hebrew and part in Aramaic. And it switches back and forth at two points, one of which is exceedingly arbitrary that it just all of a sudden switches to Aramaic. It starts out in Hebrew, switches to Aramaic at a seemingly completely arbitrary point, and then switches back to Hebrew for the last couple of chapters. And there are like a thousand theories because journal articles have to be published, dissertations have to be written. Yeah. On why this is and how this is happening. There's a, there's a Dutch scholar who spent his whole career, like just writing about this issue."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":886.16,"end":886.4,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":888.32,"end":974.33,"speaker":"Fr Stephen De Young","text":"So the realize, I mean, nobody knows for sure, you know, why exactly, and what's going on. And a lot of the theories are that these are different pieces that came together later, you know, that started out separate, et cetera, et cetera, et cetera, but there are sort of through lines. The reason, the only reason I bring that up here is that as we're now going to be talking about it and interpreting it, we are going to be interpreting it in the context of the Book of Daniel as a whole. Right. So we're taking for granted that this has some connections to what comes before it. At least we're not going to talk too much about what comes after it, but at least what comes before it. And yes, there are those folks not just confined to 19th century Germany who would say, you can't do that because it's written by eight different people, at least two of whom were women. And. Yeah, but, but that's where we're going to go because. And the reason for that, the justification for that is that as Orthodox Christians, the version of the text that has authority for us, the version of the text that's important to us is the version of the text that is used and read in the church. Right. So it doesn't matter what the historical process was that got us there. It's that form of the text."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":974.57,"end":976.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is the one we've actually received."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":977.21,"end":1005.44,"speaker":"Fr Stephen De Young","text":"Right. That's the one that has authority for us, not any hypothetical or even real earlier versions when they're from. So all that said, we'll kind of go through and make some comments, you know, go back through what, what Father Andrew just read sort of in toto about this vision. So you commented as you were going through on the man of Desires thing."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1006,"end":1006.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1007.12,"end":1014,"speaker":"Fr Stephen De Young","text":"Which if folks have been going to liturgy the last couple of weeks. They've probably heard that title a few times."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1014.32,"end":1015.36,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1015.44,"end":1023.41,"speaker":"Fr Stephen De Young","text":"And man of Desires is really vague in English."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1023.81,"end":1087.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even, like, the explanations that I've read for it, like, for instance, I copied out the one that's from. This is from the Synaxarion that's in the great Horologian, the Greek tradition, 1. And it says this about this Daniel, whose name means God is judge, in case everybody was wondering, was called man of desires by the angels that appeared because he courageously disdained every desire of the body, even the very bread that is necessary for nourishment. Which. That seems like opposite of what it means. Like, man of desires would seem to mean a man who has a lot of desires, but this is actually about him denying those desires. And then it says, furthermore, he received this name because in his longing for the freedom of those of his tribe and his desire to know their future condition, he ceased not supplicating God, fasting and bending the knee three times a day, which. That's a little bit more. Makes a little bit more sense with, you know, the idea of being him, being a man of desires. But that's not. That's not quite what it means. Right. And either."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1087.87,"end":1088.79,"speaker":"Fr Stephen De Young","text":"Right, what is it?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1088.79,"end":1092.43,"speaker":"Fr Andrew Stephen Damick","text":"Aramaic or. Which is Aramaic or Hebrew here, or Greek."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1093.55,"end":1120.88,"speaker":"Fr Stephen De Young","text":"Well, Aramaic or Greek, depending on which version you're reading. Right. But yeah, and this, the contrast you're pointing out in that surface reading of the Synaxarion in English is even more pronounced in Greek because the word that's translated, desire, in the Greek version of this is. Is a form of epithemia, which is epithelia is what's used for, like, passions."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1121.76,"end":1123.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1123.16,"end":1131.92,"speaker":"Fr Stephen De Young","text":"Like desires in that sense. Right. And so then it's saying he's called the man of desires because of his asceticism. And you're like, what?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1132.08,"end":1135.6,"speaker":"Fr Andrew Stephen Damick","text":"What? Yeah, right, right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1136.96,"end":1147.12,"speaker":"Fr Stephen De Young","text":"So what's going on is actually not sort of a weird opposite contradiction, but a kind of wordplay. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1147.12,"end":1147.52,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1147.52,"end":1160.85,"speaker":"Fr Stephen De Young","text":"Because whenever you see. This is a general tip. When you see in an English translation, an English biblical translation of Greek, when you see of. Right. That's like, that's a punt."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1161.89,"end":1162.25,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1162.25,"end":1218.99,"speaker":"Fr Stephen De Young","text":"Because what that means is you have a word that's in the genitive, and the Greek genitive can be used in lots of different ways. Right. But when you have a committee translating something, all those people on that committee disagree about which way you should translate it in this particular instance. And so you end up just. Well, we'll just put of, okay, is everybody right? Like, is Everybody happy with that? Right. So that should tell you that there's some. Anytime you see it of like that, like man of desires, you know, there's some further interpretation that needs to take place that hasn't yet. Right, right. It's a good marker. So the idea behind both the Aramaic here and the way the Greek is used is not that this is a man who possesses desires or who is filled with desires or passions, but this is a man who is pleasing or who is desired."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1219.47,"end":1224.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a desirable man is sort of the idea."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1224.75,"end":1246.96,"speaker":"Fr Stephen De Young","text":"Or a man who is favored. Right, that kind of idea. Pleasing or favored man. Right. And so the idea that's going on sort of behind the English of the. The sinnexarian is the idea that, right, this play that Daniel cut off the pleasures of this world and became pleasing."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1246.96,"end":1263.32,"speaker":"Fr Andrew Stephen Damick","text":"To God by these means. And then there's a fun sort of wordplay where it talks about he eats no pleasing food. What he's talking about is asceticism there in the scripture. Or. No, desirable. Yeah. Daniel 10."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1263.32,"end":1278.37,"speaker":"Fr Stephen De Young","text":"Yeah. What's translated there is, I ate no pleasing food. No meat or wine entered my mouth. The word pleasing there is the same word. Right. So this wasn't food that had lots of passions, desires. Right. The food was just laying there."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1278.69,"end":1280.85,"speaker":"Fr Andrew Stephen Damick","text":"That would be it. That's. That's a different episode."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1281.09,"end":1285.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That's an episode of Veggie Tales or something. Oh, I was gonna say that was."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1285.69,"end":1287.21,"speaker":"Fr Andrew Stephen Damick","text":"A reference to cannibalism maybe, but."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1287.21,"end":1291.09,"speaker":"Fr Stephen De Young","text":"Yeah, it's always werewolves with you anyway. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1293.66,"end":1294.02,"speaker":"Fr Andrew Stephen Damick","text":"So. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1294.02,"end":1308.3,"speaker":"Fr Stephen De Young","text":"So it's. It's this. It's this kind of idea that the way that, like meat and wine, right. Would be the pleasing food, the desirable food. Right. He made himself pleasing to God by cutting off those things that would please him."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1308.3,"end":1309.62,"speaker":"Fr Andrew Stephen Damick","text":"Pleasing food. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1309.62,"end":1319.03,"speaker":"Fr Stephen De Young","text":"Right, Right. So that's the. That's the. That's what the cynics are in, is doing. That's what's going on with this man of desires title."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1319.27,"end":1319.91,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1320.63,"end":1360.54,"speaker":"Fr Stephen De Young","text":"That we hear here over and over again. And so, relatedly, as we just talked about, right. Notice that Daniel here is trying to receive this vision. He's seeking wisdom from God, right? This kind of prophetic wisdom. And in order to do that, he's practicing asceticism, Right. This is not just this Christian innovation. This is not something that comes from Platonism or Gnosticism or something, right. This is Jewish man living in exile practicing asceticism. And even the way he fasts will be kind of familiar to orthodox Christians because It's not that he just doesn't eat anything."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1361.5,"end":1362.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1362.46,"end":1367.82,"speaker":"Fr Stephen De Young","text":"It's that he cuts out certain pleasing foods. In this case, meat and alcohol."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1367.98,"end":1370.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. He doesn't eat certain kinds of things."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1370.7,"end":1429.84,"speaker":"Fr Stephen De Young","text":"Right. The most pleasing things. Right. He goes for a simpler, sparer diet. Right. In order to focus on pray, in order to seek this wisdom from God. And then that prayer is answered. And so the way in which that prayer is answered is that this man appears to him. Right. He lifts up, he's by the river, he's by the Tigris river. And he looks up and there's a man there. But even though he's identified at first as a man, the description. Right. His clothes is. Okay, right. That, that he's got, you know, a linen. Linen garment and a gold sash. Right. But then his face is like lightning. His arms and legs are like, you know, burnished bronze. Right. So."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1432.32,"end":1433.76,"speaker":"Fr Andrew Stephen Damick","text":"Gems and metal and."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1435.21,"end":1440.49,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. This isn't describing, like, Doc Savage or anything. This is."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1441.93,"end":1444.41,"speaker":"Fr Andrew Stephen Damick","text":"Wow, See, that was one I got. Thank you, thank you."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1444.49,"end":1460.49,"speaker":"Fr Stephen De Young","text":"Man of bronze right there. Anyway, Doc Savage, but it's also clearly not your run of the mill human. Right. It's not just, oh, he looked up at another. Another prophet came."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1462.55,"end":1465.99,"speaker":"Fr Andrew Stephen Damick","text":"He's definitely deeply weird and sort of spectacular looking, you know?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1465.99,"end":1467.43,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1467.51,"end":1467.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1468.15,"end":1478.95,"speaker":"Fr Stephen De Young","text":"And there is another place in the Bible where someone else has a vision and sees a very similar looking man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1479.43,"end":1481.11,"speaker":"Fr Andrew Stephen Damick","text":"Where could it be, Father Stephen?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1481.43,"end":1483.11,"speaker":"Fr Stephen De Young","text":"That's in the book of Revelation."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1483.67,"end":1514.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. So Revelation chapter 1, verses 12 through 15. This is the apostle John now speaking. Then I turned to see the voice that was speaking to me, and on turning, I saw seven golden lampstands. And in the midst of the lampstands, one like a son of man, clothed with a long robe and with a golden sash around his chest. The hairs of his head were white, like white wool like snow. His eyes were like a flame of fire. His feet were like burnished bronze refined in a furnace."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1514.6,"end":1514.76,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1514.83,"end":1517.87,"speaker":"Fr Andrew Stephen Damick","text":"And his voice was like the roar of many waters."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1520.19,"end":1525.39,"speaker":"Fr Stephen De Young","text":"Right. And so may have noticed that's. That's similar but not quite the same."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1526.03,"end":1526.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1526.59,"end":1531.71,"speaker":"Fr Stephen De Young","text":"And this is one of these interesting little things. This is a rabbit trail. We won't go all the way down."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1532.99,"end":1534.27,"speaker":"Fr Andrew Stephen Damick","text":"But we'll stick a foot in it."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1534.67,"end":1552.75,"speaker":"Fr Stephen De Young","text":"Yeah. We'll tip our toes in the Tigris River. And so the. This is not. St. John is not here in Revelation, chapter one. Sort of just referencing the Greek of Daniel 10."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1553.07,"end":1554.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a quote."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1554.67,"end":1564.43,"speaker":"Fr Stephen De Young","text":"Right. He seems to be. Because there are sort of weird differences between the Greek and the aramaic of Daniel 10. He seems to be citing the Aramaic."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1564.51,"end":1568.59,"speaker":"Fr Andrew Stephen Damick","text":"In Greek, doing his own translation."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1569.08,"end":1603.52,"speaker":"Fr Stephen De Young","text":"Right. His own translation from Aramaic into Greek. And that's why things sound really similar. But they're not sort of identical. Because when you, you know, if you're translating directly from Aramaic into English and then from Aramaic to Greek to English, the English you get out of those two processes isn't going to match. Exactly. Right, right. But, but that's what's going on here. And that, by the way, strongly implies that whoever wrote the book of Revelation was a first language Aramaic speaker."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1604.16,"end":1604.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1604.64,"end":1624.61,"speaker":"Fr Stephen De Young","text":"Like somebody from Galilee. I'll just leave that there. But, but so, yeah, so this is. And, and this isn't. Right, let's be clear. St. John is likewise having a vision. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1624.77,"end":1627.17,"speaker":"Fr Andrew Stephen Damick","text":"In the same way that reading Daniel."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1628.05,"end":1630.37,"speaker":"Fr Stephen De Young","text":"Right. And sort of doing a remix. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1630.61,"end":1654.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's that he's having a vision and he's seeing something very similar to what Daniel is seeing. But because, of course, he's steeped in the Daniel tradition when he goes to write it down, he's putting it in similar terms, you know, and seems to be translating on some level. But it's not, you know, again, it's not just him quoting."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1655.61,"end":1656.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1656.01,"end":1680.96,"speaker":"Fr Andrew Stephen Damick","text":"It's. He's actually having a vision. And I think, you know, just as a side note, just like you said, the version of these books that we receive are the, as canonical are the versions that we receive. We also have to receive them as having integrity of their own and not just say, well, I don't think he really had a vision because he says, I had a vision. You know, it's like, well, if you're just going to say you're a liar, then why are we bothering to read this book?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1681.11,"end":1681.35,"speaker":"Fr Stephen De Young","text":"Book."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1681.59,"end":1686.31,"speaker":"Fr Andrew Stephen Damick","text":"But, you know, I don't know. Not a liar."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1686.71,"end":1703.75,"speaker":"Fr Stephen De Young","text":"Right. So the question then, and the fact that we've brought up The Apocalypse of St. John probably gives away the answer we're going to come up with by making this connection that we just made. But the question then is, who dis."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1705.75,"end":1710.99,"speaker":"Fr Andrew Stephen Damick","text":"Who is this man? Who is this like a statue at the same time? Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1710.99,"end":1759.53,"speaker":"Fr Stephen De Young","text":"Who Daniel sees. I will throw in one little. I'm definitely not following this out. But just for, for, for those of you who might want another little piece, another little data point in terms of St. Paul receiving a prophetic call on the road to Damascus rather than being a quote unquote, notice what Daniel says right after he describes the man he saw. He says, only I, Daniel, saw the Vision for the men who were with me did not see the vision, but a great trembling fell upon them. Compare that to how St. Paul narrates what happened to the men, the other men who were with him on the road to Damascus."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1759.61,"end":1778.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, pretty much the same. And I mean, there's stuff like this that happens in various places, like where Christ, you know, speaks to the voice of. The voice of the Father speaks to him. And of course, you know, John writes it down, what he said, and then it says. But some said it thundered like, this is a. This is a thing that you. That happens every so often."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1778.52,"end":1784.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that little tidbit."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1784.44,"end":1784.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1784.84,"end":1793.76,"speaker":"Fr Stephen De Young","text":"Being thrown out there, that's. That's the, that's the, the cheap present that goes in your stocking, I guess, before you get the real presence that we're going to get into. Now."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1796,"end":1796.4,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1799.84,"end":1816.92,"speaker":"Fr Stephen De Young","text":"In terms of who this is, we've got some candidates, sort of in the context. There are some angelic beings, some divine beings who we've already seen in Daniel and who we've seen in the. In the immediate context. So one candidate might be St. Michael the Archangel."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1817.39,"end":1818.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1819.15,"end":1831.79,"speaker":"Fr Stephen De Young","text":"And of course, we can kind of rule him out right off the bat because twice here in this vision, the man who we're identifying refers to St. Michael in the third person."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1832.43,"end":1834.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that wouldn't work."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1834.67,"end":1858.83,"speaker":"Fr Stephen De Young","text":"Someone who is with him and someone who's on his side. Right. So it can't be him. So next candidate might be the Archangel Gabriel, after whom my parish is named. Right. And those two are put in context. And St Gabriel does appear in Daniel, but here's the problem. He just appeared in Daniel."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1859.63,"end":1866.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. So if he was mentioning him again, it would just say, and Gabriel came to me again, you know, or something like that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1866.67,"end":1873.79,"speaker":"Fr Stephen De Young","text":"Right. He wouldn't give this description and fall on his face and. Right. Have this extreme reaction to seeing somebody who he just saw twice."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1874.77,"end":1895.89,"speaker":"Fr Andrew Stephen Damick","text":"Plus, plus when, you know, when Gabriel's mentioned in Daniel 8:16, Daniel says this, and I heard a man's voice between the banks of the Ulai, the river, and it called Gabriel. Make this man understand the vision. So there's the voice, this man's voice, who is giving Gabriel orders."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1898.93,"end":1904.52,"speaker":"Fr Stephen De Young","text":"And that voice is coming from the river by which Daniel now sees this man. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1904.52,"end":1905.96,"speaker":"Fr Andrew Stephen Damick","text":"That's the beginning of chapter 10."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1906.28,"end":1917.08,"speaker":"Fr Stephen De Young","text":"Right. And so it makes sense that if we're reading this through that we would say, oh, this man who he now sees must be the man who was talking to Gabriel in 8:16."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1917.56,"end":1918.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1918.52,"end":1956.73,"speaker":"Fr Stephen De Young","text":"Right. Now he's seeing him at the river. So that rules out the two of them. But we also get this other clue in terms of the context of. Of Daniel, and that's that there are actually three descriptions of this man in chapter 10 that you read. Not just the one. Right. The one is the most detailed. Right, Right. But then twice after that he's described. Right. And in the other two, the first one is that he's one having the likeness of the sons of Adam. And in Greek, it has one having the likeness of a son of man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1956.89,"end":1958.09,"speaker":"Fr Andrew Stephen Damick","text":"Son of man, Yep."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1958.09,"end":1961.61,"speaker":"Fr Stephen De Young","text":"Right. Which. I mean, those are commensurate. Right. Because Adam is the word for man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1961.61,"end":1962.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1962.09,"end":1963.81,"speaker":"Fr Stephen De Young","text":"See, as we talked about, episode."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1963.81,"end":1964.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1964.25,"end":1968.33,"speaker":"Fr Stephen De Young","text":"See the. See the tortuous winding road of our last episode."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1970.73,"end":1971.13,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1972.57,"end":1977.77,"speaker":"Fr Stephen De Young","text":"And then after that, he is again referred to. Right. Again, what, Having the appearance of a man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1978.33,"end":1978.89,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":1979.05,"end":2007.06,"speaker":"Fr Stephen De Young","text":"Right. So this man appears both in this kind of heavenly fashion. Right. That we also see paralleled in Revelation. And that. And that as we go forward tonight, we'll see paralleled other places as well. But he also appears just as someone who looks like a human. Right. Which is what we saw in Daniel seven last time."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2007.78,"end":2018.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. So you've got both this spectacular divine appearance, and then he also looks like a man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2019.7,"end":2020.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2020.18,"end":2024.42,"speaker":"Fr Andrew Stephen Damick","text":"You know, so it's a heavenly appearance and it's a human appearance."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2024.98,"end":2040.31,"speaker":"Fr Stephen De Young","text":"Right. And when St. John sees the same man with the same description, it is the appearance of the heavenly Christ whom St. John had also seen as a man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2041.19,"end":2065.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. So you've got his gospel showing him as a man and sometimes as God, although he is clear. He is both the whole time. Let me just clarify that. And then. And then, of course, he's also in the revelation, much more of a divine appearance. But again, he is also man in. In Revelation, there's just these different emphases between the two accounts."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2066.46,"end":2067.38,"speaker":"Fr Stephen De Young","text":"Right? Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2067.38,"end":2067.82,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2068.06,"end":2088.72,"speaker":"Fr Stephen De Young","text":"And so if we come to the conclusion then, or at least we posit the hypothesis that this is the. This is. This is Christ. Right. This is the second person of the Holy Trinity. This is God the Son. Right. Who Daniel is talking to. That raises questions about the end of the chapter that we read. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2089.04,"end":2099.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's all this stuff about him battling the Prince of Persia and St. Michael coming to give him a hand, and no one but Michael coming to give him a hand."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2099.76,"end":2109.24,"speaker":"Fr Stephen De Young","text":"Right. No one but Michael being on his side. And you would say, well, if this is God the Son, if this is the second Person of the Trinity number one, why would he need an angel's help? Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2109.24,"end":2110.4,"speaker":"Fr Andrew Stephen Damick","text":"Isn't he just God?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2110.48,"end":2136.87,"speaker":"Fr Stephen De Young","text":"And number two, why can't he just, you know, curb stomp this demon and move on? Right? Like, right. Why is there. Why is there even a battle going on? Right. And so we have to take this within the context of not just Daniel, but of the Old Testament as a whole and sort of where we are in sort of the movement and sweep of the entire Old Testament."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2136.95,"end":2172.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. So, you know, thinking back now to the first of this series of four episodes where we talked about the angel of the Lord, there's a bunch of times where the angel, the Lord not only appears and talks to someone, but actually fights in battles and fights alongside and leads the armies of Israel. Right. So you've got this image already exists as a warrior image. It's already a thing, you know, in scripture. Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2172.79,"end":2180.03,"speaker":"Fr Stephen De Young","text":"And that. That place, right, that the central place where that occurs is in the Torah at the time of the Exodus."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2180.83,"end":2183.67,"speaker":"Fr Andrew Stephen Damick","text":"Right? A bunch of spots around there, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2183.67,"end":2186.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Like when it says that God is a man of war."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2187.47,"end":2192.59,"speaker":"Fr Andrew Stephen Damick","text":"Available now. It's stored on ancient faith. Sorry, had to put that one out there."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2193.39,"end":2193.87,"speaker":"Fr Stephen De Young","text":"Thanks."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2193.87,"end":2194.75,"speaker":"Fr Andrew Stephen Damick","text":"Good book, everybody."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2195.04,"end":2239.78,"speaker":"Fr Stephen De Young","text":"Good book, everybody. Excelsior. But so that happens around the Exodus. So as we've talked about on the show before, what's happening at the Exodus, right? So the nations, right, God has, because of his holiness, because he doesn't want to destroy humankind again. After the flood has withdrawn from the world, has placed these angelic beings over the nations, those angelic beings have rebelled. And as we hear here in Daniel 7 or Daniel 10, St. Michael's the only one who stayed loyal, who is the sort of patron and guardian angel of Israel itself."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2240.74,"end":2241.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2242.34,"end":2264.6,"speaker":"Fr Stephen De Young","text":"But so at the time of the Exodus, right, the people of Israel are in Egypt and they're enslaved in Egypt. And that's not just physical slavery, Right? That's included. But that's also spiritual slavery because remember, at the time of the Passover, God says he's going to render judgment against the gods of Egypt. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2264.6,"end":2266.44,"speaker":"Fr Andrew Stephen Damick","text":"Not just against Pharaoh and his crew."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2266.52,"end":2295.36,"speaker":"Fr Stephen De Young","text":"Right, right. And so they have to be delivered from those spiritual enemies and then brought to the land. So by the time we get to Daniel, Daniel is living in the Babylonian exile. Yeah, Right. So the people, in their disobedience, right, have suffered. The people of Judah have suffered the curses of the covenant. They've gone back into exile. The Exodus has been undone. They're now again living in a foreign."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2295.36,"end":2299.56,"speaker":"Fr Andrew Stephen Damick","text":"Land under a foreign oppressor, including their gods."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2299.56,"end":2371.76,"speaker":"Fr Stephen De Young","text":"Under these foreign gods. Right. The Prince of Persia, Right. And pretty soon the prince of Greece is going to come through, right? And they're back in this situation. And so this is why, when you read the exilic prophets, including Daniel, the hope is that there's going to be this new Exodus that's going to end the exile, right? And. And bring them back. And if there's going to be a new exile and they're going to be brought back, then that means once again, the angel of Yahweh. The Yahweh angel, right, who is Yahweh himself, is going to need to come and lead them into battle to defeat and battle against Israel's enemies, right? Judah's enemies. And so what this is saying, what this is saying, what's being talked about here by the heavenly man when he talks to Daniel about this battle he's engaged in with the prince of Persia and then the prince of Greece is that that salvation, that new Exodus, that new Passover, that new Pentecost that are coming is already in motion. We're in media race right now. Right. So the gospel is in process, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2371.76,"end":2407.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And like one of the things that's said in the vision where God speaks to Daniel as he says that this is about. I can't remember exactly where it is, but he says this is about the future, this is things to come, right? So there's this sense of. It's not just talking, you know, it's not talking about the exodus from Egypt, for instance, but it's. And it's also not just talking about, presumably return from Babylonian exile. But as we talked about last time in particular, this is way bigger than all of that, right? Yeah. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2407.2,"end":2407.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2407.96,"end":2411.56,"speaker":"Fr Andrew Stephen Damick","text":"This is the big defeat of all."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2411.56,"end":2418.52,"speaker":"Fr Stephen De Young","text":"The false gods because it's not enough, Right. This is why there's a promise of a new covenant, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2418.52,"end":2419.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2419.04,"end":2457.28,"speaker":"Fr Stephen De Young","text":"Because just reinitiating the old covenant would have just been restarting this whole cycle anew, right? Where Israel sins again and goes back into exile, Right? Just like you see that cycle play out a dozen times in the Book of Judges, right? That's not enough. Right? So this is why it's fulfillment. It's filled to overflowing, Right. This time it's a new covenant. That's an everlasting covenant, Right? That's going to not just manage sin, but it's going to deal with sin once for all. It's not going to just manage death, it's going to do away with death. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2458.88,"end":2463.89,"speaker":"Fr Andrew Stephen Damick","text":"Which then explains a lot of the language in Daniel 7 about this kingdom. Having no end."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2465.09,"end":2512.68,"speaker":"Fr Stephen De Young","text":"Right, right. And this is in motion. And we're not going to go through all of these chapters of Daniel, but this is the context in which the time when Christ's birth is going to be is predicted pretty close to. To the year. So this, this process is in motion. Right. We talked about how show how the word gospel is talking about is the report of a victory. Right. Christ's victory. And we talked last time with the Son of Man. There's this victory that's won over these demonic powers, after which Christ is enthroned and all power in heaven on earth has been given to him. Well, what. We'll just say it. What Christ is saying here to Daniel."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2513,"end":2513.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2513.72,"end":2530.61,"speaker":"Fr Stephen De Young","text":"Is that the opening skirmishes of that great battle, Right. The beginning of that second, greater fulfilled exodus is now in motion. And that's going to culminate then in the victory of Christ that we see unfold in the Gospels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2530.85,"end":2540.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because he's taking on directly these principalities that are over these pagan nations. The prince of Persia, the prince of Greece."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2541.41,"end":2544.85,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, they're being dealt with."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2545.41,"end":2574.9,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Right. So, yeah, So I mean, these prophecies in Daniel are related ultimately then to this eschatological victory, which, you know, is why then you see this stuff appearing again in St. John's Apocalypse at the end of the New Testament. Because this is about the culmination of all things. This is about the great victory of Christ over. Over his enemies."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2575.86,"end":2576.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2577.62,"end":2586.5,"speaker":"Fr Andrew Stephen Damick","text":"So. All right. Well, that is the first half of tonight's episode of the Lord of Spirits. And we're going to take a short break and we'll be right back with the second half."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2587.14,"end":2603.46,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2612.02,"end":2656.93,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers and Internet forums to answer? Are you an Orthodox Christian looking for a reliable first place to send your interested friends? Do you need help finding an Orthodox church near you? My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America. And I'm Fr. Andrew Stephen Damick, Chief content Officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox intro team."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2657.25,"end":2658.93,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2658.93,"end":2660.89,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2660.89,"end":2663.33,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2663.41,"end":2693.66,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and not just toss them into the chaos of the Internet, a place to get help finding an Orthodox parish and get plugged into an actual Orthodox community, then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of ancient faith ministries and made possible by our donors. It's an Orthodox on ramp to the Christian life. Again. That's orthodoxintro.org."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2702.35,"end":2718.35,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2721.79,"end":2750.04,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second half of the show and it's where we begin to take your calls. So give us a ring. We'd like to hear from you. Just like the voice of Steve said, 855- AF-Radio. 855-237-2346. So we just took a little romp through Daniel, chapter 10, pretty much the whole chapter. And we've got a whole lot more now to look at this episode. We're going to just be looking at a whole bunch of scriptural passages. So strap in, everybody."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2750.2,"end":2756.89,"speaker":"Fr Stephen De Young","text":"Yeah, but if you tuned into this show and you're not interested in the Bible, I'm kind of not sure why."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2757.29,"end":2762.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. What are you doing here? Yeah, yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2762.13,"end":2763.53,"speaker":"Fr Stephen De Young","text":"Came to the wrong place."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2763.93,"end":2771.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly. So, all right. Well, okay, so what's the first thing that we're going to look at here? Another one of the prophets?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2772.97,"end":2790.18,"speaker":"Fr Stephen De Young","text":"Yes. We're actually going to be looking at several more of the prophets here. But yeah, this is, you know, as we said, you know, nobody ever sees God and lives except for when they do. And so we're going to go through some times when they do."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2790.74,"end":2863.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the point, okay, so we're not like trying to contradict that line from the scriptures. You know, that is a line from the scriptures. And this actually came up in a lot of questions we got, especially after our last episode. People were like, well, you know, maybe no one really does see God. But the point is that when the Scripture says that you can't see God, it's not creating an absolute rule that always applies in every possible way. It's referring to a certain way in which you don't see God because Then you've also got, not only as we're talking about appearances of God, instances where people do see God, but then you even have direct addresses of it, like where the Lord says, blessed are the pure in heart, for they shall see God. Right. So I mean, he actually addresses it outright. So we can't say, well, these are places where people aren't really seeing God because Christ says you can see God. Right. So obviously when the scripture says these things, it's talking about different things. It's not exactly the same thing being addressed here. But more on that later."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2863.6,"end":2885.88,"speaker":"Fr Stephen De Young","text":"Right, so. Right, yeah. So we're not. Nobody can see God and live except when they do, is not saying that that first statement isn't true. It's trying to deal with what we actually have in the Scriptures. So in Exodus 33, where God says, no one can see my face and live, just a few verses earlier in the same chapter, it says that he spoke to Moses face to face."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2886.76,"end":2889.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's not an editing error."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2890.04,"end":2924.4,"speaker":"Fr Stephen De Young","text":"Right. So that's there. So we have to add a big part of what we're doing, not just in this episode, but in, in all four of these episodes, about Christ of the Old Testament is explaining how that works. Because the revelation of Christ that becomes clear in the New Testament is what explains all this. Right, right. It's what makes all this make sense if you didn't have it. Right. The Hebrew Bible by itself, there's lots of things that don't make sense."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2926.15,"end":2926.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2926.63,"end":2946.23,"speaker":"Fr Stephen De Young","text":"And that's why when you get into Rabbinical Judaism. Right. When you, when you study rabbitical Judaism, you look at just like the Talmud, what you find are dozens of different rabbis, all of whom are incredibly revered, who all have radically different opinions and different ways of solving all these problems in the Hebrew Scriptures."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2946.55,"end":2947.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2947.07,"end":2974.13,"speaker":"Fr Stephen De Young","text":"And it's just a constant conversation and debate because there's no single through line and resolution. Right. So Christianity, unless you have Christ. Right, right. Christianity has a through line that connects all this and explains all this. Now, if you ask, I was going to say, to be fair to our orthodox Jewish friends, they would say that's not a bug, it's a feature of their religion, that it's a constant discussion and debate and framing."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2974.13,"end":2974.45,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2975.17,"end":2997.14,"speaker":"Fr Stephen De Young","text":"Right. We would, I would say, right. That, that clarity. Right. Because the Holy Spirit is a spirit of order and not confusion, as St. Paul reminds us. That clarity that comes through Christ and being able to understand the Scriptures is a superior benefit. But that's why I'm a Christian and not an Orthodox Jew."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":2997.14,"end":3008.62,"speaker":"Fr Andrew Stephen Damick","text":"In part Right, right. Okay. All right, well, so we've got something from Jeremiah chapter one, which. I'm not going to read that whole chapter to you. We're just going to mention the bits that are relevant to what we're talking about."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3008.62,"end":3009.5,"speaker":"Fr Stephen De Young","text":"I mean, you could."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3009.98,"end":3012.78,"speaker":"Fr Andrew Stephen Damick","text":"I could. I mean, it's our show. We could kind of do whatever we want, but."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3013.1,"end":3014.06,"speaker":"Fr Stephen De Young","text":"But it's okay."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3014.46,"end":3014.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3015.1,"end":3085.86,"speaker":"Fr Stephen De Young","text":"We're making you read enough. So. Yeah. So, yeah. Jeremiah chapter one, as one might expect in the first chapter, is talking about Jeremiah's call to be a prophet. Right. And in it, going back to our episode about the word of the Lord, the debar, Yahweh, there's this interesting back and forth where it literally alternates back and forth between the word of the Lord debar talking to Jeremiah and just Yahweh talking to Jeremiah. Right. And it's not presented as there are these two different people standing in front of Jeremiah. It's presented as there's this. What? That the word of Yahweh is also Yahweh. Right. But one of the interesting parts of this is that at one point in particular. Right. That in verse nine, at this one point in particular, this figure is described in physical terms in terms of having at least a couple of body parts. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3086.58,"end":3087.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3087.38,"end":3098.49,"speaker":"Fr Stephen De Young","text":"And the figure who's described as having these body parts is not the word of the Lord, but just the Lord. Just Yahweh."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3099.61,"end":3111.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Like in verse nine, it says, then the Lord, and that's Lord in all caps. So then Yahweh put out his hand and touched my mouth."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3113.37,"end":3147.32,"speaker":"Fr Stephen De Young","text":"Right. And so because of the language. Right. This is really hard to take figuratively. Right, right. You can say, oh, the hand of the Lord was upon him. Oh, well, that's metaphorical. Right. But this is literally he reached out his hand and touched my mouth. There's not really a good metaphorical way to take that. Right. It's describing the extension of the arm. Right. So there is a figure who is Yahweh, who has at least an arm and a hand standing in front of Jeremiah. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3148.2,"end":3151.08,"speaker":"Fr Andrew Stephen Damick","text":"And. And this is involved in his prophetic call."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3151.64,"end":3152.04,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3152.2,"end":3163.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, okay, well, the next passage we're going to look at is. Is Ezekiel, chapter one. Yes, yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3163.88,"end":3165,"speaker":"Fr Stephen De Young","text":"The whole chapter."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3165,"end":3169.66,"speaker":"Fr Andrew Stephen Damick","text":"The whole chapter. And I mean, you know, I'm not going to apologize because you have to of kind. Kind of take in all this together."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3169.9,"end":3170.38,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3170.38,"end":3186.22,"speaker":"Fr Andrew Stephen Damick","text":"It's so easy. So many times, you know, like Christians, we read a verse or two, which can be okay, but if you don't read it all together or hear it all together. Sometimes you're going to get it wrong then or kind of off or distorted when you try to understand what it's saying. Okay, so this is."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3186.86,"end":3195.64,"speaker":"Fr Stephen De Young","text":"Oh, go ahead, go ahead. Here at Lord of Spirits, we have a 100 year tradition of addressing a certain topic every. Every Christmas."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3196.52,"end":3197.16,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3197.24,"end":3199.24,"speaker":"Fr Stephen De Young","text":"And it's going to be addressed in this passage."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3199.64,"end":3458.31,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. So. Yay. All right. Okay, so. Ezekiel, chapter one. In the 30th year, in the fourth month, on the fifth day of the month, as I was among the exiles by the Chebar Canal, the heavens were opened, and I saw visions of God. On the fifth day of the month, it was the fifth year of the exile of King Jehoiachin, the word of the Lord came to Ezekiel, the priest, the son of Buzi, in the land of the Chaldeans, by the Chebar Canal, and the hand of the Lord was upon him. There as I looked, behold, a stormy wind came out of the north, and a great cloud with brightness around it, and fire flashing forth continually. And in the midst of the fire, as it were gleaming metal, and from the midst of it came the likeness of fire, four living creatures. And this was their appearance. They had a human likeness, but each had four faces, and each of them had four wings. Their legs were straight, and the soles of their feet were like the sole of a calf's foot, and they sparkled like burnished bronze under their wings. On their four sides they had human hands, and the four had their faces and their wings. Thus their wings touched one another. Each one of them went straight forward, without turning as they went. As for the likeness of their faces, each had a human face. The four had the face of a lion on the right side, the four had the face of an ox on the left side, and the four had the face of an eagle. Such were their faces, and their wings were spread out above. Each creature had two wings, each of which touched the wing of another, while two covered their bodies, and each went straight forward. Wherever the spirit would go, they went without turning as they went. As for the likeness of the living creatures, their appearance was like burning coals of fire, like the appearance of torches moving to and fro among living creatures. And the fire was bright, and out of the fire went forth lightning, and the living creatures darted to and fro, like the appearance of a flash of lightning. Now, as I looked at the living creatures, I saw a wheel on the earth before, beside the living creatures, one for each of the four of them. As for the appearance of the wheels and their construction, their appearance was like the gleaming of beryl. And the four had the same likeness, their appearance and construction being as it were a wheel within a wheel. When they went, they went in any of their four directions, without turning as they went. And their rims were tall and awesome. And the rims of all four were full of eyes all around. And when the living creatures went, the wheels went beside them. And when the living creatures rose from the earth, the wheels rose. Wherever the spirit wanted to go, they went. And the wheels rose along with them. For the spirit of the living creatures was in the wheels. When those went, these went. And when those stood, these stood. And when those rose from the earth, the wheels rose along with them. For the spirit of the living creatures was in the wheels. Over the heads of the living creatures there was the likeness of an expanse shining like awe inspiring crystal, spread out above their heads. And under the expanse, their wings were stretched out straight, one toward another. And each creature had two wings covering its body. And when they went, I heard the sound of their wings like the sound of many waters, like the sound of the Almighty, a sound of tumult, like the sound of an army. When they stood still, they let down their wings. And there came a voice from above the expanse over their heads. When they stood still, they let down their wings. And above the expanse over their heads there was the likeness of a throne in appearance like sapphire. And seated above the likeness of a throne was a likeness with a human appearance. And upward from what had the appearance of his waist, I saw as it were gleaming metal like the appearance of fire, enclosed all around and downward from what had the appearance of his waist, I saw as it were the appearance of fire. And there was brightness around him like the appearance of the bow that is in the cloud on the day of rain. So was the appearance of the brightness all around. Such was the appearance of the likeness of the glory of the Lord. And when I saw it, I fell on my face and I heard the voice of one speaking."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3460.63,"end":3465.51,"speaker":"Fr Stephen De Young","text":"Wow. Wheels in the sky keep on turning."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3466.87,"end":3469.27,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much for making references that I get."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3469.83,"end":3471.11,"speaker":"Fr Stephen De Young","text":"I try once in a while."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3471.35,"end":3471.79,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3471.79,"end":3476.71,"speaker":"Fr Stephen De Young","text":"Yes, of course, some of them is past you, so you don't even realize you didn't get them on occasion."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3476.71,"end":3481.87,"speaker":"Fr Andrew Stephen Damick","text":"So I'm okay with that too. But journey references I will get especially with songs like that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3482.03,"end":3486.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, so, right, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3486.91,"end":3502.2,"speaker":"Fr Andrew Stephen Damick","text":"So you got. I mean, okay, you've got these four living creatures. What's going on with that? And then especially if you are familiar with this podcast. And this is not your first episode. When you see wheels with eyes, you know that's the throne of God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3502.92,"end":3503.4,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3503.8,"end":3508.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. So that at least kind of gives us a sense of where we're looking at."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3508.6,"end":3545.58,"speaker":"Fr Stephen De Young","text":"Not UFOs, definitely not aliens. Yeah. Right. So this is part of. We've talked a lot about throne chariot stuff, Merkava stuff on this podcast. So people are familiar with the idea of the throne chariot. This is particularly emphasized with Ezekiel, because, remember, Ezekiel, like Daniel, is an exile. He's a prophet of the exile. And so Ezekiel literally sees the throne of God, the throne, chariot of God, leave the temple before it's destroyed."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3546.22,"end":3546.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3546.66,"end":3569.02,"speaker":"Fr Stephen De Young","text":"Right. And the idea here is that God's throne is sort of mobile, Right. And therefore can encompass the whole of the Earth. Right. So he's not like a local, territorial God of that strip of land. Right. And he's not just the God of a particular people. He is the God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3569.1,"end":3569.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3570.38,"end":3587.47,"speaker":"Fr Stephen De Young","text":"He is God of the universe. And this whole description, in ways some more subtle than others, shall we say, or some more difficult to understand for modern readers than others, is aimed at giving that impression that he is the cosmic, universal, most high God, the God of gods."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3587.63,"end":3593.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's the rainbow, and, you know, he's above the sky and all that kind of stuff."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3593.87,"end":3606.79,"speaker":"Fr Stephen De Young","text":"Right. And so part of what's going on here that we would be remiss, not to mention, given that we. We have to talk about astrology in our Christmas episode every year."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3606.79,"end":3607.31,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3608.35,"end":3609.95,"speaker":"Fr Stephen De Young","text":"It's a rule. It's a tradition."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3611.48,"end":3612.68,"speaker":"Fr Andrew Stephen Damick","text":"Cherubim zodiac."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3612.68,"end":3639.69,"speaker":"Fr Stephen De Young","text":"Yes. Here comes the cherubim zodiac, as promised. So we have these. These four living creatures. So the picture. In case people tried to picture this in their heads, right. Is that you have these four cherubim, right? These four living creatures. That's what cherubim means, is living creatures. Right. And picture your Babylonian Sphinx like things, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3639.69,"end":3642.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The Lamassu. Go Google it up. You can see."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3642.53,"end":3695.96,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Right. So, and they. There are four of them facing in the four directions. Each of them has four faces, Right. They're facing the four directions also, but their wings are touching, right. So that they're. They're sort of in a circle, flying in a circle, Right. Facing out from each other with their wings touching and with their wings making a platform on which is this blue firmament that is the sky. And then the chariot, throne of God, is on top of that. Right. Sort of above the heavens. Right. So then what are these cherubim about? Well, the clue here, if You're a nerd. Is that is the four faces, right? The four faces of the four living creatures."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3696.12,"end":3703,"speaker":"Fr Andrew Stephen Damick","text":"Right? There's a human face, a lion face, an ox face, and an eagle face."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3703.4,"end":3752.94,"speaker":"Fr Stephen De Young","text":"Right. And so what you need to imagine is the Babylonians, like all of these other ancient cultures, had a zodiac, right? They had a set of 12 constellations, right. That they used to track the seasons and the times. Right. In the sky. And so within those 12, there were four cardinal zodiac signs. Right. Representing the sort of the cardinal directions in the sky. Right. That you would orient yourself by in the sky. And in Babylonian astrology, those four cardinal signs were a man, a lion, an ox and an eagle."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3754.06,"end":3754.86,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3756.62,"end":3764.78,"speaker":"Fr Stephen De Young","text":"So these cherubim, these angelic spirits, are also constellations."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3765.82,"end":3766.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3766.7,"end":3773.02,"speaker":"Fr Stephen De Young","text":"And that's why it could talk about the spirits of the constellations being also in the wheels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3774.06,"end":3777.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To move."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3777.18,"end":3792.78,"speaker":"Fr Stephen De Young","text":"To move them about. Right. So these are those four constellations. And so this. This is something that Saint Irenaeus still knew about."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3793.82,"end":3795.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, He. He picks up on this."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3795.66,"end":3833.27,"speaker":"Fr Stephen De Young","text":"Yeah. Because there's this famous passage that not a lot of people have read in Toto in context, but that a lot of people are sort of vaguely familiar with, which is that Saint Irenaeus is the earliest Christian author we know of who talks about these four creatures. Right. These four faces as being connected to the four Gospels. Right. And that's something that gets picked up by a lot of later fathers. But what you'll find when you compare the different fathers is they tend to match up different faces with different Gospels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3834.15,"end":3834.71,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3834.79,"end":3850.23,"speaker":"Fr Stephen De Young","text":"Right. And the reason for that is that's not the basis of the connection. What I mean by that is they did not read those list of faces and say, hey, this sounds like the four Gospels. That's not how they got there."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3850.55,"end":3851.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3851.79,"end":3872.81,"speaker":"Fr Stephen De Young","text":"They got there a different way. And this is that way. If you read the text from Saint Irenaeus where he talks about this, he doesn't just say, hey, there are these four living creatures, and, hey, they represent the four Gospels, though I once saw Rod Parsley talk about this in St. Irenaeus."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3876.09,"end":3878.01,"speaker":"Fr Andrew Stephen Damick","text":"Has Rod Parsley ever heard of."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3878.17,"end":3881.79,"speaker":"Fr Stephen De Young","text":"I was dumbfounded. I guess a book fell off the shelf and landed open."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3882.11,"end":3886.91,"speaker":"Fr Andrew Stephen Damick","text":"I am currently dumbfounded. That was the last name I thought you had made. Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3888.67,"end":3949.34,"speaker":"Fr Stephen De Young","text":"So, but. So that's not the immediate connection. If you read that whole section, Saint Irenaeus talks about how not just the four living creatures, but also there are four winds, there are four corners of the earth. Yeah, right. There are four cardinal compass Directions. Right. So. And again, he's not just saying, like, hey, here's a bunch of stuff that there's four of. Right, Right. But all of those examples, the four winds, the four cardinal directions, these four constellations. Right. The four corners of the Earth, all of those things represent, again, just what they represent here in Ezekiel. This idea of totality of the whole cosmos. Right. Of the whole world. Right. Of wholeness and completion by having the four. Right. Together. And it's from there that Saint Irenaeus goes to. And therefore, this is why it is appropriate and fitting that we have four Gospels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3949.66,"end":3953.9,"speaker":"Fr Andrew Stephen Damick","text":"Now, does he identify a particular face with each Gospel or."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3954.14,"end":3964.08,"speaker":"Fr Stephen De Young","text":"He does, but he does that sort of last. Right. And so the later fathers who pick up on him all agree with his basic point, but then match them up differently."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":3964.24,"end":4007.09,"speaker":"Fr Andrew Stephen Damick","text":"Interesting, right? Yeah. Because I know that in, like, iconography, especially, like manuscript iconography in the west, it gets pretty consistent where you get, the man is Matthew, the eagle is John, the ox is Luke, and then the lion is Mark. Perhaps most famously depicted, at least for those of us here in the west, in the Book of Kells, where they've got that incredible illumination page that has all four. Or, you know, that actually it's. I don't think it's one page that has all four. Oh, there it might be. But anyways, it's in there. And then I think it's in the Lindisfarne Gospels as well. But I mean, it's all over the place. You get those images lined up in exactly that way in a lot of iconography."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4007.09,"end":4025.18,"speaker":"Fr Stephen De Young","text":"Right. And I believe. And someone can actually me on this, because as is well known, once you get to the 4th century AD, I lose all interest in the world. But I believe that that codification is found in St. Gregory the. Gregory."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4025.18,"end":4025.58,"speaker":"Fr Andrew Stephen Damick","text":"Great."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4025.74,"end":4029.34,"speaker":"Fr Stephen De Young","text":"That particular matchup. And so I find it likely that they're following that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4029.58,"end":4048.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I just looked it up. I was gonna say I just looked it up, by the way. There is indeed a single page in the Book of Kells that has all four of them together. So. Which is really cool, by the way. Just Google up Book of Kells, K E L L S Gospel Animals, and you'll see the picture I'm talking about. It's pretty neat, everybody. Yeah, yeah, yeah. Cool."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4049.87,"end":4057.87,"speaker":"Fr Stephen De Young","text":"There's also a whole Doctor who audio adventure where they try to steal the Book of Kells, but that's less interesting and less pertinent. I just thought I'd throw it in."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4058.51,"end":4098.58,"speaker":"Fr Andrew Stephen Damick","text":"How dare they? Yeah, no, I've seen it. I mean, I. 20 years ago, I went to the UK and I was on pilgrimage and I went to Dublin and at Trinity College Dublin, they have the Book of Kells there. And you can go into this dark room and they'll have a couple of pages from a couple of the different volumes opened up and you can actually see it there. And I mean, it's a holy book. It has its own kind of holy presence to it, which you can definitely sense when you go in there. So, yeah, I mean, this stuff plays out. It's not just written in a prophecy somewhere, but this stuff plays out in terms of the real depth of Christian culture, you know."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4098.9,"end":4179.16,"speaker":"Fr Stephen De Young","text":"Yeah, this is a pretty firmly. Yeah, yeah, yeah. Ingrained thing, but, yeah, but the key is that. So this is. I'm going to go ahead and pause to make this general point. Right. The way a lot of folks tend to use the Church Fathers and the Scriptures is that. And the ancient Christian commentary on Scriptures has done us no favors in this regard is that people tend to like, I don't understand this verse or this passage. I will go look up in something like the ACCs. I will go and look up what Church Fathers say about it. If they all seem to say basically the same thing, then I'll just sort of proof text it and say, well, that's what it means. And if they disagree, then those are like options and I can choose which one of these I want to hold. Right. All of which is. Is bad and an abuse of the Church Fathers. Right. So something like the ACCs could be useful if you use it as like an index. Like, if you use it to say, hey, here's where I could go look to see St. John Chrysostom talk about this passage, for example. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4179.4,"end":4179.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4179.88,"end":4231.78,"speaker":"Fr Stephen De Young","text":"But what's more important than reading an English translation of what a Church father said in a particular homily or a particular theological work with reference to that verse is figuring out why. Right. Is understanding how that Father got there. Right. Because a lot of times if you just look up what Church Fathers say about a text, you'll be holding the book sideways trying to figure out what does that have to do. Right. Why is he talking about this? Right. There's a great example. We Talked about Daniel 10 in the first half of the show. Go look at patristic commentaries on the description of the heavenly man in Daniel 10 and you'll find this incredible amount of ink spilled on Tarshish."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4233.78,"end":4236.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Where was Tarshish mentioned?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4237.09,"end":4257.57,"speaker":"Fr Stephen De Young","text":"I don't remember that exactly. In the Aramaic. It's not. Well, it sort of is. It talks about gold that came from a particular place, which is another name for Tarshish. Right. In the Greek, it doesn't say gold from Tarshish. It just says, he wore a sash of Tarshish."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4258.61,"end":4259.17,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4259.17,"end":4282.78,"speaker":"Fr Stephen De Young","text":"Right. So the church fathers all eventually arrive at. Well, it's gold. They all arrive at the same place as our translation. Right. But because they're looking at this sort of odd Greek translation, they have to spill a lot of ink to explain, well, they got gold from Tarshish, etc. Etc. All to come back to. It's a gold sash."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4283.34,"end":4284.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4284.62,"end":4307.1,"speaker":"Fr Stephen De Young","text":"But so if you just go and look at that, proof text it and say, oh, well, this is a man from Tarshish or something, like, you're going to be worried. Way off. Right, Right. You have to find out what are they looking at, what are they seeing, what are they doing, why are they applying it this way? Right. How. What is their understanding? Right. So if you. If you just look in this case at St. Irenas and say, well, Saint Irena says those four faces represent the four Gospels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4308.3,"end":4308.7,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4309.02,"end":4337.56,"speaker":"Fr Stephen De Young","text":"Right. Meaning that's what was being communicated to Ezekiel. Ezekiel was supposed to see this vision and think, at some point, 500 years from now. Right. 600 years from now, a group of four disciples of the Messiah will write the story of his victory over the powers of death and Hades. And each of them will have a character similar to one of these faces. Right. Obviously, that's not it. Right, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4337.56,"end":4339.24,"speaker":"Fr Andrew Stephen Damick","text":"There's way more going on here."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4339.64,"end":4340.84,"speaker":"Fr Stephen De Young","text":"Right. And so we have."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4340.92,"end":4342.92,"speaker":"Fr Andrew Stephen Damick","text":"Just from reading the chapter, you can see that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4343,"end":4353.12,"speaker":"Fr Stephen De Young","text":"Right. We have to delve into the original text and then see what St. Irenaeus said about it and then figure out how he got there. And then this all kind of unfolds."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4353.44,"end":4353.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4353.96,"end":4360.8,"speaker":"Fr Stephen De Young","text":"This all kind of unfolds in front of us. Right. And we can get much more out of both the Bible and the Church fathers. So end rant on that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4361.04,"end":4361.6,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4361.6,"end":4365.12,"speaker":"Fr Stephen De Young","text":"But I get to do that once in a while, I guess."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4365.44,"end":4365.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4365.92,"end":4371.51,"speaker":"Fr Stephen De Young","text":"I mean, we're live. We're on live. Who could stop? So somebody could cut my mic, I guess."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4371.82,"end":4374.62,"speaker":"Fr Andrew Stephen Damick","text":"But Trudy would never do that to you."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4374.86,"end":4383.34,"speaker":"Fr Stephen De Young","text":"No, she's sorely tempted all the time. Never actually pulls the trigger."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4384.14,"end":4386.54,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so cherubim zodiac."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4386.7,"end":4417,"speaker":"Fr Stephen De Young","text":"So that covers. We had to talk about the Cherubim zodiac for Christmas. We had to get some astrology in here. No, I'm not gonna. I'll save it for next Christmas. Okay, so last Christmas, you gave me no, you gave me your heart the very next day Gave it away. Oh, yeah. So I've tried to work at it. All I want for Christmas is you reference, and it's not coming to me, but I guess I just did."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4417,"end":4417.36,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4417.36,"end":4419.8,"speaker":"Fr Stephen De Young","text":"Anyway. Thank you very much. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4419.96,"end":4426.93,"speaker":"Fr Andrew Stephen Damick","text":"So there's another. Yeah, there's another. Then there's another image they wanted to focus on, and that's the. The one from verses 26 through 28."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4426.93,"end":4456.73,"speaker":"Fr Stephen De Young","text":"Which is the end, which is actually germane to our topic tonight. So we're getting back from that torturous circumlocution, back to perambulation, back to the topic at hand. Yes. And that is that who is ultimately seen. Once we have the throne described, the sky and the constellations and the stars and the heavens and all of this described, then seated on the throne is the likeness of a human."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4457.45,"end":4466.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting the way that the scene kind of unfolds. It sort of pans upward, you know, it's very cinematic. And then, boom, there's the one on the throne."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4468.81,"end":4474.65,"speaker":"Fr Stephen De Young","text":"And notice gleaming metal enclosing fire."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4475.53,"end":4476.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4476.57,"end":4485.82,"speaker":"Fr Stephen De Young","text":"The same kind of language as the man Daniel saw, as St. John saw. And there's this brightness of glory around him."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4486.3,"end":4489.5,"speaker":"Fr Andrew Stephen Damick","text":"Sapphire throne is pretty awesome. Sapphire throne, everybody."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4490.3,"end":4505.74,"speaker":"Fr Stephen De Young","text":"And. And then finally there is that rainbow. And that rainbow takes us back or forward back to the future, to. To Revelation this time, chapter four."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4508.52,"end":4542.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So in Revelation 4, verses 2 and 3, this is now St. John, of course, speaking at once. I was in the spirit. And behold, a throne stood in heaven with one seated on the throne. And he who sat there had the appearance of Jasper and carnelian. And around the throne was a rainbow that had the appearance of an emerald. So more gemstones. And there's an. An emerald rainbow. You know, whether that means it's all green or not, I don't know, but. Because, I mean, that's what we think of when we think of as emeralds."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4542.95,"end":4550.31,"speaker":"Fr Stephen De Young","text":"But. Yeah, gems. There's. Gems in the Bible are a whole thing. They're a whole thing."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4550.55,"end":4566.62,"speaker":"Fr Andrew Stephen Damick","text":"It's not clear. Yeah, right. They line up with. With our gems. Well, and even. I don't think. I don't remember if I've mentioned this on the show before, but even. Even colors in ancient cultures don't necessarily line up with not just the way. Which colors we're thinking of, but the way colors are understood."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4566.62,"end":4569.58,"speaker":"Fr Stephen De Young","text":"Like, oh, we talked about. They're not being blue, remember?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4569.74,"end":4603.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. You know, they can't see blue. And then. But then or like in. Forgive me everybody if I've said this before, I do not remember, but like, yellow in Beowulf is not the color yellow. Like we think of it. It's really about the way that light plays on things. So that's why water is often described as being yellow in Beowulf. It's not because they had super polluted water. It's because sunlight is playing off of the, you know, the, the top of it. So, yeah, anyway, yeah, colors and gems and stuff. Very interesting rabbit hole."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4603.58,"end":4639.44,"speaker":"Fr Stephen De Young","text":"But, but so, so once again, though, St. John, right, is seeing the same things that the prophet saw. This includes the heavenly man. So then this brings us to our next passage and to pull back the curtain for our listeners. A great moment in our discussion, our pre show discussion was when you read. I told you what we were going to talk about in terms of this passage. You read the entire passage and then said, I don't see what that has to do with anything."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4639.92,"end":4640.32,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4640.72,"end":4641.84,"speaker":"Fr Stephen De Young","text":"I mean, it's."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4643.68,"end":4841.25,"speaker":"Fr Andrew Stephen Damick","text":"It'S clearly like there's connections. But I did not make. Yeah, I, I did not read this for the reason that we're. We're one of the reasons that we're using this. But anyway, so, so, you know, journey with me into my confusion, everybody. So, okay, so this is, this is Exodus 24. Yeah. Then. And I guess this is God speaking, right? Then he said to Moses, come up to the Lord. You and Aaron, Nadab and Abihu, and 70 of the elders of Israel and worship from afar. Moses alone shall come near to the Lord, but the others shall not come near, and the people shall not come up with him. Moses came and told the people all the words of the Lord and all the rules, and, and all the people answered with one voice and said, all the words that the Lord has spoken, we will do. And Moses wrote down all the words of the Lord. He rose early in the morning and built an altar at the foot of the mountain and 12 pillars according to the 12 tribes of Israel. And he sent young men of the people of Israel who offered burnt offerings and sacrificed peace offerings of oxen to the Lord. And Moses took half of the blood and put it in basins, and half of the blood he threw against the altar. Then he took the book of the covenant and read it in the hearing of the people. And they said, all that the Lord has spoken, we will do, and we will be obedient. And Moses took the blood and threw it on the people and said, behold the blood of the covenant that the Lord has made with you. In accordance with all these words, then Moses and Aaron, Nadab and Abihu and 70 of the elders of Israel went up, and they saw the God of Israel. There was under his feet, as it were, a pavement of sapphire stone, like the very heaven for clearness. And he did not lay his hand on the chief men of the people of Israel. They beheld God and ate and drank. The Lord said to Moses, come up to me on the mountain and wait there, that I may give you the tablets of stone with the law and the commandment which I have written for their instruction. So Moses rose with his assistant Joshua, and Moses went up into the mountain of God. And he said to the elders, wait here for us until we return to you. And behold, Aaron and Hur are with you. Whoever has a dispute, let him go to them. Then Moses went up on the mountain, and the cloud covered the mountain. The glory of the Lord dwelt on Mount Sinai, and the cloud covered it six days. And on the seventh day, he called to Moses out of the midst of the cloud. Now, the appearance of the glory of the Lord was like a devouring fire on the top of the mountain. In the sight of the people of Israel, Moses entered the cloud and went up on the mountain. And Moses was on the mountain 40 days and 40 nights. And just so you can again journey with me into my confusion and reenact it, you can now richly participate in my confusion by listening to this. Father Stephen said. So. Yeah. So this has a lot about the Eucharist, and everyone really needs to understand this as being foundational for our understanding of the Eucharist. I was like, okay, well, I see blood and there's an altar, but I'm not really sure what else is going on here with that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4841.33,"end":4846.37,"speaker":"Fr Stephen De Young","text":"So. And it's a very Christmassy passage, you know, isn't it? The blood flying around and everything."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4846.37,"end":4846.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4848.37,"end":4875.11,"speaker":"Fr Stephen De Young","text":"Right. So. So what this chapter is describing is the covenant ratification ceremony of the Old Covenant, the first covenant, the covenant of Sinai. So this is effectively the first Pentecost. We tend to think of Pentecost in the New Testament as the first Pentecost. But the day of Pentecost was already a feast."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4875.68,"end":4875.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4875.96,"end":4876.72,"speaker":"Fr Stephen De Young","text":"Yeah, it was."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4877.12,"end":4884.16,"speaker":"Fr Andrew Stephen Damick","text":"The thing that happens in Acts is happening on an existing feast day, Pentecost. This is the 50th day from the Passover."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4884.56,"end":4931.26,"speaker":"Fr Stephen De Young","text":"Right. And so this is that they've. They've been brought out of Egypt. They've been brought to Mount Sinai, and now God is. Is giving them the covenant. And this ritual that we see play out here that has two main parts is the, the ritual enactment of, of that covenant. Right. That represents the first Pentecost and the coming of the Holy Spirit is the second Pentecost. And I definitely am not going to go down this trail now. But if we better understood the relationship between first Pentecost and second Pentecost ritually and what's going on in Acts, we would better understand what St. Paul is talking about when he talks about the Torah or the law and the Spirit. But anyway."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4933.02,"end":4934.46,"speaker":"Fr Andrew Stephen Damick","text":"We'Ll have to save that for a future."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4934.94,"end":4971.37,"speaker":"Fr Stephen De Young","text":"Yeah, so, but so the first part, I said there's sort of these two parts, right, to this, this covenant ratification ceremony. The first one involves the blood of the covenant, right. This is, this is where the Old Testament, that phrase, the blood of the covenant occurs is in this chapter. And so what we have here with the blood, where half of it is taken and splattered on the altar and then the other half gets sprinkled over the people. Right. That would be a very different theophany if we still did it that way."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4972.41,"end":4972.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4973.61,"end":4974.89,"speaker":"Fr Stephen De Young","text":"Which is dry cleaning bills."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4975.13,"end":4977.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's just not going to come out."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4978.17,"end":4979.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4979.61,"end":4992.58,"speaker":"Fr Andrew Stephen Damick","text":"I think about how often you have to change your vestments. But, but, but I mean, you know, so some of this should be familiar to listeners. You know, blood sprinkling, it's about purification. It's, you know."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4993.06,"end":4994.22,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4994.22,"end":4997.78,"speaker":"Fr Andrew Stephen Damick","text":"This is a normal part. This is a normal part of sacrifice in the ancient world."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":4998.18,"end":5002.18,"speaker":"Fr Stephen De Young","text":"Right. But this is a rare case where it's sprinkled on people."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5002.66,"end":5007.22,"speaker":"Fr Andrew Stephen Damick","text":"On people. And not just on altars and stuff and places."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5007.3,"end":5042.95,"speaker":"Fr Stephen De Young","text":"But usually it's used to cleanse objects. Right. So there's this case where it's put on people. There's the ordination of a priest that we'll probably talk about at some later point where it's rubbed on the earlobe and the thumb and the toe. But there's a tease what's going on there. But. So, yeah, that's relatively rare. So what's going on with this? This is an exercise in oath taking. Right. And so to help understand what's going on here, we have to go back even a little further back into the book of Genesis."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5043.35,"end":5099.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And this looks at one of the weirdest passages in the Bible that I've had people ask me about for years, you know, because people tend to ask priests questions. And I was like, I don't know what this is about. I mean, so this is, this is the bit from. I mean, I do now, but this is the bit from Genesis 15, right. Where God makes this covenant with Abraham. And part of what goes on in this is various animals are cut into two pieces and they're laid out. And then you see this torch pass between them, kind of go down the passage that's created by these animal halves being laid out on the ground. And that is just. I mean, from a modern point of view, like, what is going on? Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5099.27,"end":5108.11,"speaker":"Fr Stephen De Young","text":"Well, yeah. And they're sort of, when they're cut in half, they're butterflied. Right. Like it's bisected, like spatchcocking."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5108.11,"end":5109.63,"speaker":"Fr Andrew Stephen Damick","text":"And then you cut it. Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5109.95,"end":5126.16,"speaker":"Fr Stephen De Young","text":"And laid on either side, right opposite each other. And then after that's done, Abraham actually has to wait until nightfall for the torch to show up and pass between them. So it describes him in Genesis 15 having to like chase off the vultures at the buzzards."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5126.96,"end":5127.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5127.32,"end":5173.28,"speaker":"Fr Stephen De Young","text":"Don't eat this ritual stuff getting at the bisected animals. Right. So, yeah. So what's going on here? Well, the verb that's used for the issuing of a covenant, right. In Hebrew. We've talked about covenants at least a little before on the show. I'm sure I won't guess what episode again, because I'm always wrong. But covenants are issued by like a high king, by a suzerain to a vassal, to a lesser king. Right. They're given, but the verb isn't issued or signed or enacted or inaugurated. But covenants are cut. In Hebrew, you cut a covenant with someone."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5174.36,"end":5174.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5175.4,"end":5223.24,"speaker":"Fr Stephen De Young","text":"And this is what Abraham is doing is in the ancient Near East, a relatively common oath taking ritual involved in these kind of covenants. Normally it would be the vassal, it would be the weaker party who would walk through the split animals. And what they're saying when they do that is as a form of oath taking, they're saying, if I violate the terms of this covenant. Right. Because covenants came with blessings and curses attached, like you see at the end of the book of Deuteronomy, at the end of the Torah. And so symbolic of those curses was the split animals. Right. So it's sort of, may I end up like these animals? Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5223.24,"end":5236.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And then by walking through it, then the vassal is identifying himself with the animals. But there's a sense of like, that's only going to happen to you if you break this covenant, Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5236.42,"end":5240.42,"speaker":"Fr Stephen De Young","text":"You're accepting the curses that will come to you if you violate it, Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5240.42,"end":5240.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5240.94,"end":5257.38,"speaker":"Fr Stephen De Young","text":"You're accepting the curse of the covenant. Now, what's interesting here, and this isn't the Last time we're going to see this tonight. But when this ritual is enacted in Genesis 15, God inverts it because it is the presence of God represented by this torch that passes through the haves."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5258,"end":5260.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not Abraham walking through or Abram at this point."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5260.92,"end":5295.83,"speaker":"Fr Stephen De Young","text":"Right? Abram at this point, yeah. So effectively God is saying that if this covenant with him is broken, he will receive the curses. Right. And for Abraham, that or Abram, he probably would have thought, well, God can't die, so that just means it can't be broken. But what St. Paul will see in this, as he's going to talk about in several of his epistles, is Christ becoming a curse for us. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5295.83,"end":5296.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5296.19,"end":5315.4,"speaker":"Fr Stephen De Young","text":"That it is in fact Christ who accepts the curse of the. Of the covenant. Right. That results from our. From our disobedience. Right. But so that this, in going back to Exodus, this blood that's thrown on the people, right, are taking. They're taking a similar oath."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5315.87,"end":5316.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5316.11,"end":5338.67,"speaker":"Fr Stephen De Young","text":"And you see that in the text. Right, because after he does that, right, he puts it on them. Well, actually, first in verse three, they say all the words the Lord has spoken, we will do. He sprinkles them with the blood. He reads it to them again, and they say, all that the Lord has spoken, we will do. We will be obedient liars. But anyway."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5340.43,"end":5343.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right. Narrator. Yeah, Narrator. They were not obedient."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5344,"end":5357.12,"speaker":"Fr Stephen De Young","text":"Yes. And when he's throwing. And then verse eight, when he's throwing the blood on the people, he says, behold the blood of the covenant that the Lord has made with you in accordance with all these words. Look at the blood."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5357.36,"end":5366.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, yeah, so the idea is basically, we're accepting death if we break it, you know? Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5366.16,"end":5375.38,"speaker":"Fr Stephen De Young","text":"Right. Right. So this is. This is sort of part one, as we said. There's two parts."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5375.62,"end":5376.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5376.82,"end":5416.11,"speaker":"Fr Stephen De Young","text":"Part two then comes in verse nine through 11, where Moses, Aaron, the high priest, his sons Nadab and Abihu, who they don't know yet, but are not long for this world, See Leviticus and the 70 elders of Israel. 70 or 72 elders of Israel go part way up the mountain. Only Moses is going to go all the way to the top to speak to God face to face, to receive the covenant. But they go halfway up these 73 to 75 others. And we're told very bluntly, they see the God of Israel. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5416.19,"end":5421.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's what it just says. They saw the God of Israel. And then they see under his feet this pavement of sapphire stones."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5422.39,"end":5432.31,"speaker":"Fr Stephen De Young","text":"Right. And notice under his feet, right. So we don't have his body described the way we did in the other prophetic texts we look at. But he does have feet."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5432.87,"end":5444.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting. Interesting to me that. And then in verse 11, it says he did not lay his hand on the chief men of the people of Israel. Which I assume that means they didn't die when they saw God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5444.87,"end":5445.99,"speaker":"Fr Stephen De Young","text":"Right. They were not harmed."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5446.15,"end":5450.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. No death by holiness. Yes. This point."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5450.61,"end":5451.17,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5451.25,"end":5453.61,"speaker":"Fr Andrew Stephen Damick","text":"Again, see Leviticus. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5453.61,"end":5458.85,"speaker":"Fr Stephen De Young","text":"And remember, this is. This is a mountain where if an animal touched it, they had to kill it from a distance."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5459.49,"end":5460.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They couldn't even go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5460.69,"end":5465.73,"speaker":"Fr Stephen De Young","text":"So that they wouldn't touch the mountain themselves. Trying to get the animal and kill it for touching the mountain. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5465.73,"end":5471.73,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if I recall correctly, there's all kinds of purification stuff that they have to do before this hap. This stuff happens, Right? Yes, yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5471.97,"end":5509.52,"speaker":"Fr Stephen De Young","text":"But so the second piece of this covenant ratification or this covenant cutting ceremony is the eating of this meal. Right. God is there in human form in their midst. Right. And they are eating this sacrificial meal with him and establishing this fellowship between them as the leadership of Israel and God himself. Right, yeah. So these are these two pieces. And the point I made, that at first confused you, but hopefully now you think makes sense at least."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5509.6,"end":5513.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it does indeed make sense."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5513.44,"end":5583.12,"speaker":"Fr Stephen De Young","text":"That you see these two elements that this is. This is the moment that. At the mystical Supper, the Last Supper, right. As Christ is instituting the Eucharist, this is the moment that he takes us back to when he says, this is my blood of the new covenant. Right. This is. He's referring us back to this. This is my blood of the new covenant. And there is this element, Right. Of. Of oath taking here. Right. So I'm about to hold on to your hats, people. I'm about to say something kind of positive about Ulrich Zwingle. Right? So a lot of folks who have heard of Ulrich Zwingli may think that his view of the Eucharist in particular, and the sacraments in general was that they were in scare quotes, just symbolic. Right, right. And I did the scare quotes. Don't me, Jonathan Pigeau, so. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5583.52,"end":5586.32,"speaker":"Fr Andrew Stephen Damick","text":"But that's not actually calling him out like that, man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5588.64,"end":5604.24,"speaker":"Fr Stephen De Young","text":"That's not actually what Zwingli taught about it. Zwingli himself. Right, right. Zwingli himself took up an older meaning of the Latin word sacramentum."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5604.56,"end":5612.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Which means taking an oath. Cause like, Roman soldiers would have to do a sacramentum to join the army."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5612.71,"end":5614.11,"speaker":"Fr Stephen De Young","text":"Right? The sacred oath."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5614.11,"end":5615.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5616.15,"end":5629.11,"speaker":"Fr Stephen De Young","text":"And so, right. Zwingli was not wrong that there is an element of oath taking in baptism in the Eucharist. Right. He was wrong that they're just an act of oath taking."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5629.83,"end":5630.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5631.35,"end":5635.67,"speaker":"Fr Stephen De Young","text":"He was wrong that that was all he thought they were, but they are that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5637.29,"end":5637.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5637.85,"end":5643.41,"speaker":"Fr Stephen De Young","text":"He was, he was right about that piece. Right. So there you go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5643.41,"end":5648.49,"speaker":"Fr Andrew Stephen Damick","text":"That's the one positive thing that we're likely to ever say about Ulrich Zwingli, Lord of Spirits."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5648.81,"end":5656.65,"speaker":"Fr Stephen De Young","text":"Yes, yes, There was, there was a piece of content edited for time in which I said something positive about Michel Foucault. Sit and wonder what that could have been."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5659.45,"end":5659.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5661.69,"end":5769.73,"speaker":"Fr Stephen De Young","text":"So, but, so there is this, and there is this oath taking element in the Eucharist and we see this play out in the institution, right? In the Mystical Supper, in the Last Supper with Judas and the dipping of the bread and Christ saying that someone would betray him, this idea of faithfulness and loyalty and betrayal breaking. And that is incorporated right into the institution at the beginning of, of the Eucharist. And we still in our Orthodox practice, right, in the pre communion prayers, we talk about, neither will I give thee a kiss as did Judas, but like the thief will I confess thee. Right? There is this idea of faithfulness. I will not speak of thy mysteries to thine enemies. Right. There, there is contained within those prayers. It brings out this element of oath and of sort of a re ratification of the covenant that each of us has broken and continues to break. But we are reconfirming it as we're being purified by the blood of Christ in the Eucharist. Right? And so both the blood and the meal are within this sacrificial context, right? So this is not. We've talked about how the Eucharist is sacrificial, right? But this is a very particular referent, right. That in terms of the blood of the new covenant and what is going on here, this connection to the original Pentecost in Exodus. And just as an aside, because I feel the need to do this, some folks, now I have to say, some folks who are older man, I'm an old man. Some of you who are old enough to remember when the movie Passion of the Christ came out, which is not all of you, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5771.17,"end":5779.05,"speaker":"Fr Andrew Stephen Damick","text":"I feel like it wasn't that long ago, but it was. But because, I mean, you're only a few months older than I am, there."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5779.05,"end":5797.37,"speaker":"Fr Stephen De Young","text":"Was, there was one, there was one line that was edited out of the subtitles, okay, from the Aramaic, and it was a line from St. Matthew's Gospel where the crowd, that is 2004, by the way."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5797.37,"end":5799.05,"speaker":"Fr Andrew Stephen Damick","text":"2004, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5799.45,"end":5802.33,"speaker":"Fr Stephen De Young","text":"So about to be 18 years ago."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5802.97,"end":5803.37,"speaker":"Fr Andrew Stephen Damick","text":"Man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5805.69,"end":5816.61,"speaker":"Fr Stephen De Young","text":"Get off my lawn. Anyway, so that was a line from St. Matthew's Gospel where the crowd is crying out for Christ to be crucified, and they say his blood be upon us and upon our children."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5816.61,"end":5818.49,"speaker":"Fr Andrew Stephen Damick","text":"Upon our children. Right. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5819.22,"end":5827.46,"speaker":"Fr Stephen De Young","text":"And there's this whole history in medieval Western Europe of blood libel and all of this nonsense. That is a complete misinterpretation."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5827.86,"end":5843.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's the least anti Semitic thing. Yeah. Because, I mean, it's, you know, when blood is put upon you ritually within. Within, you know, Israel, that's. That's good. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5843.86,"end":5858.21,"speaker":"Fr Stephen De Young","text":"That's restoring the covenant. Broke it. Right. St. Matthew there is cluing us in. St. Matthew is referencing this in Exodus. Right. And the blood of the covenant that was placed on the Israelites and their children."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5858.93,"end":5859.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5859.89,"end":5937.84,"speaker":"Fr Stephen De Young","text":"To re. Ratify the covenant and the new covenant. Right. So this is. St. Matthew is using it as this ironic thing. This is something we see a lot in the Gospels, where some people who aren't believers per se will sort of say something that turns out to be true anyway. Right. Happens to Caiaphas, happens to Gamaliel. Right. You know, they don't necessarily mean it the way it goes. Right. And this is the same kind of thing. This is a crowd baying for blood. Right. Right. But they end up saying something that means something far more profound than they realize. Right. And. And that's what there's. There's a certain irony there that St. Matthew is trying to bring out. But anyway, that's kind of an aside, but it's related to that text that we were talking about. But so the reason I said that that's so foundational to the Eucharist is that, I mean, this is why we are coming together to eat a meal to receive the blood of the new covenant with Christ in our midst, in the same way that he stood halfway up Mount Sinai with the elders of Israel and Aaron and Moses and Nadab and Abihu as they ate before him. And so now for the rest of the second half, we have potpourri."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5938.32,"end":5938.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5938.68,"end":5941.12,"speaker":"Fr Stephen De Young","text":"This is just verses of Old Testament verses."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5941.2,"end":5950.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where we are about to take a series of verses out of context. Yes. But we're not doing it in an irresponsible way. Okay."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5951.13,"end":5959.61,"speaker":"Fr Stephen De Young","text":"We just don't know, belabor the point in some circuitous wandering journey to get to our topic."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5960.89,"end":5995.3,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay. So. All right. We'll just. This be sort of, you know, lightning round. So. Okay, so Genesis 26:24. You know, this is God appearing to. To Isaac. And the Lord appeared to him the same night and said, I am the God of Abraham, your father. Fear not, for I am with you. And. And will bless you and multiply your offspring for my servant Abraham's sake. So it's very explicit there. It says, the Lord appeared to him. He sees him. Yes. You know."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5995.54,"end":5996.42,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5996.98,"end":5998.42,"speaker":"Fr Andrew Stephen Damick","text":"Anything else we want to say about that?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":5999.06,"end":6000.42,"speaker":"Fr Stephen De Young","text":"No. This is lightning around, man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6000.42,"end":6039.31,"speaker":"Fr Andrew Stephen Damick","text":"All right, Lightning round. Okay. Genesis. Genesis 28:13. And this is. This is Jacob's ladder, right? Yes. Jacob's ziggurat. Excuse me. And behold, the Lord stood above it. See, I needed an antecedent for that. It. And behold, the Lord stood above it and said, I am the Lord, the God of Abraham, your father, and the God of Isaac. The land on which you lie, I will give to you and to your offspring. So you get God standing above it. He not only sees him, but he sees him standing, which means it wasn't like some ball of light or whatever."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6039.31,"end":6040.87,"speaker":"Fr Stephen De Young","text":"It's some disembodied voice."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6041.35,"end":6054.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He's got legs and feet. At least, you know, there's standing going on. Okay. Genesis 32. You could read all the way 22 through 32. I'm not going to read all of it. I'm just going to read verse 30, that's all."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6054.51,"end":6055.27,"speaker":"Fr Stephen De Young","text":"The wrestling."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6055.83,"end":6077.82,"speaker":"Fr Andrew Stephen Damick","text":"This is the wrestling scene. Jacob wrastling the angels. So Jacob called the name of the place Peniel. I've heard it pronounced Peniel. Peniel. Saying, for I have seen God face to face, and yet my life has been delivered. What does that word mean, Father Stephen?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6077.98,"end":6079.5,"speaker":"Fr Stephen De Young","text":"It means the face of God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6079.82,"end":6080.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6080.7,"end":6081.42,"speaker":"Fr Stephen De Young","text":"God's face."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6081.9,"end":6099.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Usually in the Bible, when you see and so. So and so called the place this four, he said. Then usually there's just the explanation of what the word, the name, means. You know, like Bethel, for this is the house of God. You know, whatever. That's what's going on here."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6099.81,"end":6105.09,"speaker":"Fr Stephen De Young","text":"Yeah. And let's be here. Jacob doesn't say he wrestled with an angel. He says he wrestled with God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6105.09,"end":6105.65,"speaker":"Fr Andrew Stephen Damick","text":"With God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6105.65,"end":6110.21,"speaker":"Fr Stephen De Young","text":"Jacob, which Israel means, by the way, also wrestles with God."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6110.21,"end":6128.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. Exodus 33:11, very famous. Thus, the Lord used to speak to Moses face to face as a man speaks to his friend. When Moses turned again into the camp, his assistant Joshua, the son of nun, a young man would not depart from the tent."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6130.14,"end":6132.7,"speaker":"Fr Stephen De Young","text":"So, yeah, Joshua is seeing him too."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6133.34,"end":6154.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. Face to face. Yeah. Joshua is not. Yeah, it's interesting, you Know, think about Joshua. I mean, we think about the book of Joshua and him leading all those battles and stuff, but Joshua is having these, these visionary experiences of the Lord alongside Moses on at least this occasion. Are there other places too where Joshua sees God with Moses? Yeah, well."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6154.45,"end":6157.61,"speaker":"Fr Stephen De Young","text":"And of course, he's got the, you know, commander of the Lord's army."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6158.49,"end":6166.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. He's not just sort of this, you know, and, and oh, by the way, this is Moses assistant, you know."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6166.82,"end":6167.06,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6167.06,"end":6215.22,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, no, no, this, there's something much, much bigger happening here. So. Yeah, so that was kind of the lightning round of various other places that you can see where, where people see God and, and clearly see a physical form and in some cases clearly with, with human characteristics. Right. Standing a face, couple times of a face. Yeah. And you know, when in all of these particular examples, when people see God, they're seeing Christ. Right, right. Like when you have a vision of God in the Bible, if you kind of default to this is Christ, that's pretty much accurate. 99, you know, percent of the time. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6215.22,"end":6218.38,"speaker":"Fr Stephen De Young","text":"99.999999. Yeah. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6218.54,"end":6218.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6219.18,"end":6219.7,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6219.7,"end":6223.86,"speaker":"Fr Andrew Stephen Damick","text":"There's at least a couple other hints of other things, but, but yeah, that's."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6223.86,"end":6227.26,"speaker":"Fr Stephen De Young","text":"That'S what St. Justin Martyr said at least. So I'll go with St. Justin."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6227.98,"end":6228.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6228.78,"end":6235.26,"speaker":"Fr Stephen De Young","text":"Yeah. So. So our first two halves to do the tease. Now, our first two halves, we've talked about the heavenly man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6235.98,"end":6236.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6236.62,"end":6241.74,"speaker":"Fr Stephen De Young","text":"Right. Third half. Now we're going to talk about the man from heaven."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6242.54,"end":6246.38,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're going to take a short break and we will be right back."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6247.12,"end":6263.2,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6268.88,"end":6277.35,"speaker":"Fr Stephen De Young","text":"Hi, this is John Maddox. You know, when you support Ancient faith Radio, you're not only helping to make this ministry possible for you, but also."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6277.35,"end":6279.67,"speaker":"Announcer","text":"For people like Bryce in Australia."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6280.23,"end":6282.19,"speaker":"Fr Andrew Stephen Damick","text":"I'd firstly just like to say that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6282.19,"end":6286.15,"speaker":"Fr Stephen De Young","text":"I love your show and what you do. It means a lot to all of us listening."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6286.47,"end":6288.87,"speaker":"Fr Andrew Stephen Damick","text":"I'm down in Australia and over here."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6288.87,"end":6295.83,"speaker":"Fr Stephen De Young","text":"Orthodoxy is basically unheard of. I'm not orthodox. I was raised into an Evangelical Protestant family."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6296.47,"end":6298.91,"speaker":"Fr Andrew Stephen Damick","text":"However, from a gradual exposure and desire."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6298.91,"end":6300.75,"speaker":"Fr Stephen De Young","text":"To learn more about Orthodoxy, I've come."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6300.75,"end":6302.59,"speaker":"Fr Andrew Stephen Damick","text":"To agree and see truth in pretty."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6302.59,"end":6304.19,"speaker":"Fr Stephen De Young","text":"Much everything the church teaches."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6304.59,"end":6307.11,"speaker":"Fr Andrew Stephen Damick","text":"The nearest English speaking Orthodox church is."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6307.11,"end":6309.19,"speaker":"Fr Stephen De Young","text":"Several hours away and I feel all."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6309.19,"end":6310.83,"speaker":"Fr Andrew Stephen Damick","text":"Alone in my pursuit of the faith here."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6311.39,"end":6318.67,"speaker":"Fr Stephen De Young","text":"Currently, my only exposure to orthodoxy is through Ancient Faith Radio. And my friend, how should I introduce the idea that I may be inquiring."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6318.67,"end":6320.11,"speaker":"Fr Andrew Stephen Damick","text":"Into orthodoxy to my parents?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6320.67,"end":6327.63,"speaker":"Fr Stephen De Young","text":"Thanks again, Bryce. Would you consider a donation to AFR right now? You can do so on our app."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6327.88,"end":6333.28,"speaker":"Fr Andrew Stephen Damick","text":"Or go to our website@ancientfaith.com Support Ancient."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6333.28,"end":6336.12,"speaker":"Fr Stephen De Young","text":"Faith Radio here for you and for."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6336.12,"end":6337.56,"speaker":"Fr Andrew Stephen Damick","text":"People all over the world."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6355.49,"end":6371.41,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6373.57,"end":6408.28,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of the show and this will be the final segment in our series that we've been doing on the Christology of the Old Testament. I've really liked this series. I think it's been really valuable for me. And, and a lot of the feedback we've gotten has been very, very good. So, you know, thanks for sticking with us, everybody. I know that this stuff has not been quite as, I don't know, whiz bang spectacular as, you know, monsters and giants and stuff. But, but no, I. Cherubim Zodiac. Yeah, okay. Right. We did."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6408.28,"end":6409.32,"speaker":"Fr Stephen De Young","text":"There is a good payoff here."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6409.32,"end":6411.52,"speaker":"Fr Andrew Stephen Damick","text":"In this episode, you'd have Cherubim Zodiac. Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6411.52,"end":6411.96,"speaker":"Fr Stephen De Young","text":"Come on."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6412.68,"end":6415.96,"speaker":"Fr Andrew Stephen Damick","text":"I think that should be a T shirt. I don't know how it'd work, but."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6416.12,"end":6418.52,"speaker":"Fr Stephen De Young","text":"Yeah, some kind of Babylonian something."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6418.84,"end":6421.16,"speaker":"Fr Andrew Stephen Damick","text":"Tonight only Cherubim Zodiac."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6421.32,"end":6428.12,"speaker":"Fr Stephen De Young","text":"You know, you can have tour dates on the back with like Sumerian and Acadian cities. Make it happen."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6428.44,"end":6434.52,"speaker":"Fr Andrew Stephen Damick","text":"T shirt maker. You know who you are. We're counting on you down there in Florida."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6437.94,"end":6438.1,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6438.1,"end":6486.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay, but before we get into the third half, I just want to give everybody a heads up. So, you know, we do our shows on the second and fourth Thursdays of the month. This month, this December, there's five Thursdays. And whenever there's a month with five Thursdays, that always means that it's going to be three weeks between episodes at some point. So our next episode is going to be three weeks from tonight on the 13th, I think of January, and we're going to be doing another all Q and A episode. So sometimes when people call in and they have a question that's not really about what we're talking about in this particular episode, we ask them to hold it for later or send us an email or something like that. But in the next episode, there will be none of that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6487.99,"end":6489.66,"speaker":"Fr Stephen De Young","text":"Call in with filters."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6489.97,"end":6491.41,"speaker":"Fr Andrew Stephen Damick","text":"No. Colin, with what?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6491.49,"end":6510.45,"speaker":"Fr Stephen De Young","text":"No screening no, there will be screening. Tell us about how you're from another dimension. Tell us you're a time traveler that I want here. Talk about, you know, how your brother's a Nephilim. Anything goes, man. Pretty much the gloves are coming off."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6512.13,"end":6684.94,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, maybe another Pandemonium episode next time. So, yeah, so get ready. We've had to ask a number of people to hold it for a number of episodes here, but the floodgates are coming open next time. So, yeah, that'll be at the turn of the year. It'll be our first episode of the year again. That'll be on the 13th of January. All right. Well, now we're going to talk about. I mean, this is one of my favorite passages in Scripture, actually. So this is Genesis, chapter 18, and this is the very famous Oak of Mamre scene. And a lot happens here. But I'm just going to read the very, very beginning of this. And the Lord appeared to him, that is, to Abraham, by the oaks of Mamre as he sat at the door of his tent in the heat of the day. He lifted up his eyes and looked, and behold, three men were standing in front of him when he saw them. And he ran from the tent door to meet them and bowed himself to the earth and said, o Lord, if I have found favor in your sight, do not pass by your servant. Let a little water be brought and wash your feet and rest yourselves under the tree while I bring a morsel of bread that you may refresh yourselves. And after that you may pass on, since you have come to your servant. So they said, do as you have said. And Abraham went quickly into the tent to Sarah and said, quick, three seahs of fine flour, knead it and make cakes. And Abraham ran to the herd and took a calf, tender and good, and gave it to a young man who prepared it quickly. Then he took curds and milk and the calf that he had prepared and set it before them, and he stood by them under the tree while they ate. So, you know, at the beginning we've got Abraham sitting in the door of his tent. And you know, when we were doing our pre show prep, you commented that the ancient world must have had a much higher tolerance for boredom just sitting there in the door of his tent. But so here's the way I this is my head canon for Genesis 18, if I may, is that, you know, like most Middle Eastern men sitting there in the door. And of course, Abraham is older at this point, so you know, most elderly Middle Eastern men sitting around what is he likely doing. He's probably playing backgammon because that is what Middle Eastern men of a certain age tend to do when they're just sort of sitting around retired. And I said that. And you mentioned to me that there was something called the Royal Game of Ur. You are. So tell us what that is, Father Stephen."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6685.34,"end":6694.7,"speaker":"Fr Stephen De Young","text":"So this is the earliest known board game. And when I say the earliest known board game, we have complete game boards that date back to 2600 BC."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6695.58,"end":6697.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so now when is Abraham?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6697.5,"end":6702.94,"speaker":"Fr Stephen De Young","text":"Roughly about 2000. So this is 600 years pre Abraham. We have boards."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6702.94,"end":6706.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. And go ahead. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6706.21,"end":6714.93,"speaker":"Fr Stephen De Young","text":"Well, the reason it's called the Royal Game of Ur is that these early boards, the earliest boards we found were in the sort of royal burial grounds."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6715.01,"end":6715.69,"speaker":"Fr Andrew Stephen Damick","text":"I gotcha."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6715.69,"end":6725.57,"speaker":"Fr Stephen De Young","text":"Royal cemetery at Ur. So it's very clear that the wealthy folks were doing it already back in 2600. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6726.13,"end":6734.8,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, the fun thing is that there actually are clay cuneiform tablets with the rules for this game."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6735.28,"end":6735.76,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6736.64,"end":6788.09,"speaker":"Fr Andrew Stephen Damick","text":"Which is crazy. And so here's the other thing. It turns out that it's very likely that this is, in fact, a precursor to backgammon. So look it up. There is a whole Wikipedia article on the Royal Game of Ur. And as soon as you see the game board, which they have a picture of it, one of the ones that's in the British Museum, and it will remind you of a backgammon board, everybody. So when I made that joke about Abraham sitting around playing backgammon, it's possible, it is indeed possible that he was playing something like this. And here's the other fun thing, everybody. You can go on Amazon and order yourself a replica copy of this game. Now, when I was telling my wife about this at lunch today, she's like, oh, yeah, the kids and I printed out a copy of that game board and we've played it."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6789.13,"end":6789.53,"speaker":"Fr Stephen De Young","text":"What?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6790.81,"end":6798.09,"speaker":"Fr Andrew Stephen Damick","text":"So there it is, everybody. My wife, once again, way ahead of me in almost every respect."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6798.41,"end":6805.45,"speaker":"Fr Stephen De Young","text":"I'm pretty sure any kind of trademark or copyright from 2600 BC has long lapsed. So you could probably just make your own."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6805.53,"end":6812.21,"speaker":"Fr Andrew Stephen Damick","text":"Just make your own. It's true. Yeah. You don't have to buy the expensive one on Amazon, but it does look just like the one in the British."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6812.21,"end":6813.33,"speaker":"Fr Stephen De Young","text":"Museum, so that is cool."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6814.76,"end":6817.08,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. So Abraham's out there playing backgammon in."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6817.08,"end":6820.6,"speaker":"Fr Stephen De Young","text":"The Torah's tent, so hypothetically."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6822.84,"end":6823.36,"speaker":"Fr Andrew Stephen Damick","text":"Throwing that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6823.36,"end":6870.29,"speaker":"Fr Stephen De Young","text":"Out there as a possibility. But what he's doing, he sees we have this first description of three men. Right, Right. Three men are. And that yeah, everybody does this in their English translations, including what you behold, three men were standing in front of him. This is a little inside football for the language nerds. That behold there is translating a Hebrew. It's not really a particle, it's a Hebrew word. Hanay and hinay really should not be translated. But the behold thing comes from. That's how the. The King James tended to do it. Behold or. Or low or low and behold."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6871.12,"end":6872.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm a big fan of low."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6873.36,"end":6893.2,"speaker":"Fr Stephen De Young","text":"Low, yeah. And really the idea is the word is just put there to lend a sense of sort of immediacy to the action. Right. So when I'm doing translations, I would put more like. And suddenly three men were standing in front of him. Right. Or immediately, or that kind of idea, Right, Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6894.72,"end":6917.11,"speaker":"Fr Andrew Stephen Damick","text":"It almost has a parallel with the Old English, which I do tend to translate as low, but it might mean listen up or, you know, Although I did see one translation, this one drove me crazy. It translated as well, yeah, so. So the first word in Beowulf is. Well, well, we have heard how in the days of old, I'm like, oh, please, no, please don't."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6917.11,"end":6919.19,"speaker":"Fr Stephen De Young","text":"So, like three men."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6919.43,"end":6930.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so like, yeah, I think what actually would work here as an Old English translation of this three men, you know, the ideas."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6930.47,"end":6932.31,"speaker":"Fr Stephen De Young","text":"He looks up and they're there, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6932.31,"end":6932.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6934.15,"end":6959.91,"speaker":"Fr Stephen De Young","text":"And so he then offers this hospitality, right, where he invites them in, washes their feet, has Sarah prepare some food, right. She starts making some cakes. He goes to the herd and gets a calf to cook it. And then he goes, he puts it together and he feeds them, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6960.23,"end":6960.95,"speaker":"Fr Andrew Stephen Damick","text":"And they eat."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6961.83,"end":6969.23,"speaker":"Fr Stephen De Young","text":"And we're going to discover very clearly you left off at the end of verse eight, that verse, verses that you're supposed to. It's fine."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6969.23,"end":6969.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6972.23,"end":6987.59,"speaker":"Fr Stephen De Young","text":"No shame. In verses 9 through 15, when the central one of these figures speaks, it's just identified as being Yahweh, right, The God of Israel. And then two other figures who will be identified a little later. But we'll get to that."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6988.63,"end":6994.39,"speaker":"Fr Andrew Stephen Damick","text":"In verse 10, it says the Lord said. And of course, again, it's the all caps. Lord. So Yahweh said."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":6994.79,"end":7007.28,"speaker":"Fr Stephen De Young","text":"Right. And so one of these three is Yahweh, the God of Israel. Right. And notice Yahweh, the God of Israel has his feet washed and eats in front of Abraham."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7008.88,"end":7010.88,"speaker":"Fr Andrew Stephen Damick","text":"Important details, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7011.12,"end":7020.72,"speaker":"Fr Stephen De Young","text":"So this is a person, right? Yeah, the sense of. Not in the theological sense of personhood, but in the sense of. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7021.04,"end":7021.76,"speaker":"Fr Andrew Stephen Damick","text":"It's a man."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7021.84,"end":7024.64,"speaker":"Fr Stephen De Young","text":"Human, right? Yeah. Human body, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7024.64,"end":7024.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7024.92,"end":7028,"speaker":"Fr Stephen De Young","text":"And appearance, tactile. Experience."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7028.64,"end":7046.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And not only, you know, are you getting the look of a man, but he does things like have, you know, have his feet washed and eat. So, like, this works like a man, you know? Yeah, right, right. Which should remind us of something."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7047.04,"end":7048.48,"speaker":"Fr Stephen De Young","text":"Yes, Yeah, A couple things."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7048.72,"end":7049.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7049.28,"end":7155.05,"speaker":"Fr Stephen De Young","text":"But so one of these things in particular, so one of the things that I know we've been breaking people's brains with a little bit, is the wibbly, wobbly, timey, wimey stuff. Right. Which is talking about whether when Christ appears in the Old Testament in bodily form, whether that is. Would look like or would. Whether that's his resurrected human body from the incarnation. Right, right. Because we have locked it, Right. That. Well, this is pre incarnation. Right. Quote unquote. Right. Because for the humans involved, right. This is an earlier point in time. The incarnation, Christ's incarnation had not entered into the realm of human conscious experience yet. Right. It was not a phenomenological reality yet. But as we've also talked about, Christ is God. And so asking. This is the problem of asking what time it is in heaven right now. Right, right. That time and space don't apply. So the same way that Christ's body, sorry, Calvinists and the extra Calvinisticum, is not in some particular place and not others Right. After the resurrection and ascension, the same way it's not at a particular point in time. Right. God is not like on a parallel track of time with us any more than he's occupying physical space somewhere."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7155.69,"end":7170.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the reason why this makes sense is this person in front of Abraham who is having his feet washed and is eating. This isn't fake."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7171.49,"end":7171.89,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7171.89,"end":7176.05,"speaker":"Fr Andrew Stephen Damick","text":"You know, so this is a human body."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7176.53,"end":7181.65,"speaker":"Fr Stephen De Young","text":"Right. Because he's eating. Here's where this becomes really pointed. And that's the eating."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7182.77,"end":7183.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7183.33,"end":7191.23,"speaker":"Fr Stephen De Young","text":"Because we did. I remember when this was. This was back at Pascha time this year."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7191.23,"end":7191.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7191.59,"end":7193.79,"speaker":"Fr Stephen De Young","text":"We talked about the resurrection appearances of Christ."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7194.03,"end":7194.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7194.71,"end":7201.79,"speaker":"Fr Stephen De Young","text":"And one of the things that happens over and over again in the resurrection appearances of Christ is that Christ eats in front of the disciples."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7201.95,"end":7203.31,"speaker":"Fr Andrew Stephen Damick","text":"In front of them. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7203.55,"end":7213.66,"speaker":"Fr Stephen De Young","text":"In order to show that he's risen from the dead, that he's not a ghost or a spirit or a phantom or whatever, but he's actually risen. Proves that by eating."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7214.22,"end":7214.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7215.42,"end":7257.91,"speaker":"Fr Stephen De Young","text":"So this causes a kind of a problem then with Exodus 18, if you read it in a certain way. Right. Because if we're going to view this as the pre and quote unquote, pre incarnate Christ, and we view the pre incarnate Christ as bodiless Then how is he eating? And if the pre incarnate Christ, right, Quote unquote, who has not yet taken upon himself our human nature, not yet from our perspective. Right. Can eat, then how did Christ after the resurrection eating prove anything? Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7258.39,"end":7265.67,"speaker":"Fr Andrew Stephen Damick","text":"And the only other, like there's another bad way to solve this problem which, which is to say that he was incarnate more than once."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7266.23,"end":7267.83,"speaker":"Fr Stephen De Young","text":"Right. Very bad."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7267.83,"end":7274.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah, yeah. Like this is a human body that he's got for this moment and then, oh, by the way, he takes one later from the Virgin."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7274.71,"end":7301.04,"speaker":"Fr Stephen De Young","text":"Right, right. So nobody wants to go there. Or there's a very simple way through this. Right. That just as Christ is the lamb slain from before the foundation of the world. Right. Part of the reason we could say Christ was incarnate, Christ took upon himself our shared human nature without change. Right. Is that there's not for Christ as God a before and an after."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7302.72,"end":7304,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7306.08,"end":7327,"speaker":"Fr Stephen De Young","text":"There's a place where these eternal realities enter into our human conscious experience, our phenomenological experience. Right. The realm of time and space that we live in. But that doesn't mean that they were not true for God at some point in the past and are true now and some change has taken place."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7328.12,"end":7377.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's also why one of the reasons we can say that he is the firstborn over all creation, not just in the sense that he is the firstborn in terms of his position where he gives the inheritance, which is probably the most important thing to say about that, but also there is even a more literal way that he is the firstborn over all creation in the sense that he is man even at this point, in fact, he is the man. I mean, when you see icons of Christ creating Adam and Christ as a man, I mean, what do you do with that if you can't read it in essentially a sort of trans temporal way? Right, right, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7377.31,"end":7399.8,"speaker":"Fr Stephen De Young","text":"And we have to do that. We have to and do do this elsewhere in our theology. Right. So if you are an orthodox Christian, then you believe that God the Son is eternally generated from God the Father without time. Right, right, right. Christ is begotten of the Father, not in time."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7400.44,"end":7407.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's so many theological problems that come by sort of assuming that God is bound by linear time."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7408.12,"end":7408.6,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7409.16,"end":7441.17,"speaker":"Fr Andrew Stephen Damick","text":"I mean just, we could just list them off by the hundreds. It's really true. This is where I get to say sorry, not sorry Calvinists, but it's, but I mean it really is true and we have to take it really seriously and not just say, well, cause the way that most Christians I think take that seriously on some level is by talking about God, knowing the future, that they'll say, well, it's sort of present for him all at the same time, which. Absolutely. Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7441.33,"end":7444.05,"speaker":"Fr Stephen De Young","text":"But they don't always follow that out or they couldn't be."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7445.01,"end":7465.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. Let's follow out what that really means. And the fact that here you have, let's just say it, Jesus Christ eating with Abraham. I mean, there's no other way to kind of work that out. He's actually eating. You know, angels don't eat."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7465.66,"end":7465.98,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7465.98,"end":7476.54,"speaker":"Fr Andrew Stephen Damick","text":"Although it says, I don't know. This is a question that I had because it says, at least in the translation that I read, he stood by them under the tree while they ate."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7477.11,"end":7478.47,"speaker":"Fr Stephen De Young","text":"Yeah, it's ambiguous."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7478.55,"end":7480.75,"speaker":"Fr Andrew Stephen Damick","text":"It's ambiguous. Okay. In, in the Hebrew."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7480.75,"end":7481.55,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7481.55,"end":7484.71,"speaker":"Fr Andrew Stephen Damick","text":"Okay. While the eating happened."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7484.71,"end":7508.43,"speaker":"Fr Stephen De Young","text":"Yeah. And so just to further our case a little bit. Right, okay. Before someone comes along and says, why are you bringing all this Plato eternity stuff into my Bible? Right. So God bless you. If you know who says what we were just saying, that would be Christ himself in John 8, verse 56."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7510.59,"end":7534.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which you know, he says, your father Abraham rejoiced that he would see my day. He saw it and was glad. Like if you stopped at just the first sentence, you might think, oh, Abraham's rejoicing that someday in the future when he's in heaven, he, he's going to see this happening. But then Jesus puts it immediately in the past tense. He saw it and was glad."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7534.92,"end":7594.34,"speaker":"Fr Stephen De Young","text":"Right. And remember my day? We talked about day like the day of the Lord. Right. This is a, this is the day. Right. This is not a way of referring to a 24 hour calendar period. Right. This is a way of referring to a happening. Right. Something coming into the realm of fatality. So yes, Abraham sat and ate with Christ and washed his feet and was glad when he saw the Lord. So Yes. And notice also, it's also in St. John's Gospel, by the way, where Christ washes the disciples feet, where this pattern. And again, this is not the last time we're going to see this tonight. This pattern is inverted. Right. Christ washes the disciples feet and says he did not come to be served, but to serve."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7594.66,"end":7595.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he flips it."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7596.74,"end":7635.44,"speaker":"Fr Stephen De Young","text":"Right, right. And comes to serve. And more on that in just a minute. So yeah, as we mentioned in verses 9 through 15, there's the whole exchange with, about Sarah having a son where she's back in the tent and she laughs because she's like 90. And Abraham's 100. And like, yeah, sure, I'm going to have a kid. And that makes it clear that this is Yahweh who's speaking. And then there's this really interesting thing that happens in verses 17 through 20 where Abraham kind of shuffles out and Yahweh has a conversation with Yahweh. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7635.44,"end":7711.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In verse 16, it says that Abraham leaves. Right. It says the men set out from there and they looked down towards Sodom and Abraham went with them to set them on their way. So Abraham is seeing them to. Well, not the door, because it's just a series of tents, but he's taking them presumably to the edge of the camp. And then you see this conversation happening between Yahweh and Yahweh. Yes, yeah. Where the first thing it says is, the Lord said, shall I hide from Abraham what I am about to do, seeing that Abraham shall surely become a great and mighty nation and all the nations of the earth shall be blessed in him. And he goes on. But the point is, he's saying, you know, shall I hide what I'm about to do to Sodom and Gomorrah? Right. From Abraham? And then there's this response in verse 20. Then the Lord said again, Then Yahweh said, because the outcry against Sodom and Gomorrah is great and their sin is very grave, I will go down to see whether they have done altogether according to the outcry that has come to me, and if not, I will know. So there's this question that's asked and then there's a response given. So it's clear that there's the Lord is talking to the Lord and then the Lord responds to the Lord."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7712.72,"end":7714,"speaker":"Fr Stephen De Young","text":"Right? Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7714.88,"end":7725.6,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, who's is this? The Father and the Son? Is that what we're seeing here? Yeah. Yes. Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7725.6,"end":7731.52,"speaker":"Fr Stephen De Young","text":"Right. And so note also that language of I will go down to sea."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7732.24,"end":7740.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Which doesn't make any sense if you take that purely in human terms, like, oh, God isn't sure what's happening down there in Sodom and Gomorrah, so he's going to go have a look."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7740.88,"end":7765.56,"speaker":"Fr Stephen De Young","text":"He's heard bad things, but he needs to go see for himself. Right? No, Right. God knows what's going on, but that I will go down to see, see is echoing this language. Right. We're only in Genesis 18, right. So only seven chapters out from the Tower of Babel in Genesis 11. Right. And remember, with the building of the tower, there was the. Let us go down and see, they were trying to draw God down. And God says, well, we'll go down. And then that's when the judgment happens."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7766.2,"end":7766.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7767.08,"end":7782.97,"speaker":"Fr Stephen De Young","text":"This when he comes to visit, right? When God visits his people, it's not like grandpa coming over and having, you know, scones and coffee, right. It's this visit is more like, wait till your father gets home. Right. This is. Then some stuff's going to get settled, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7783.13,"end":7784.97,"speaker":"Fr Andrew Stephen Damick","text":"Don't make me come down there."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7785.21,"end":7794.89,"speaker":"Fr Stephen De Young","text":"Yeah, yes. So that's. I will pull this car over. That's where. So this is, this is judgment stuff. This is judgment stuff, right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7794.89,"end":7795.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7795.69,"end":7798.41,"speaker":"Fr Stephen De Young","text":"And so we're going to go again to the Gospel of John."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7799.69,"end":7837.47,"speaker":"Fr Andrew Stephen Damick","text":"Right? Okay. Yeah, yeah. And then I mean, so Everybody knows John 3:16. For God so loved the world that he gave his only son, that whoever believes in him shall not perish but have everlasting life. John 3:17, the verse after. For in other words, because for God did not send his Son into the world to condemn the world, but in order that the world might be saved through him. So it's again in the inversion, in this case, God does come down, but it's not this time to condemn, it's to save."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7837.79,"end":7846.91,"speaker":"Fr Stephen De Young","text":"Right. And as St. Paul says, you know, do not say who will go up to heaven. That is to draw God down. Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7846.99,"end":7847.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7847.35,"end":7864.32,"speaker":"Fr Stephen De Young","text":"For no one will ascend but he who descended that he might fill all things. Right. This is that. This is the same Babel language that, that St. Paul plays with. But why does St. John have to say this? Right. Because the coming of the Lord, the day of the Lord. Right. Is darkness where all things are tried by fire."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7865.36,"end":7865.76,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7865.76,"end":7896.4,"speaker":"Fr Stephen De Young","text":"Right. But when Christ comes, this is how he inverts that pattern. Right. It's not just that rather than having his feet washed, he washes the disciples feet. Right. It's not just that. Rather than enacting the curses of the covenant upon those who have broken it, he becomes a curse for us. Right. So, so that we could receive the blessings. Right. And receive the new covenant, but it's that his entire visit is not for condemnation and judgment in that sense, but for salvation."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7897.36,"end":7897.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7898.48,"end":7898.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7898.84,"end":7899.2,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7899.2,"end":7941.98,"speaker":"Fr Stephen De Young","text":"So when, when the heavenly man becomes the man from heaven, Right. He comes to bring salvation, not judgment in his incarnation. The second coming then. Right. Christ's glorious appearing is a different story. And back to the pattern. Right, Right. And so then as the chapter sort of concludes, right. The other two men, right? So Yahweh stays and talks to Abraham. And Abraham, of course, kind of does his intercessory haggling. Right. If we could find 50 people, right, will you spare the cities? What if we could find 25? What if we could find 10? Right, yeah."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7944.14,"end":7953.02,"speaker":"Fr Andrew Stephen Damick","text":"Meanwhile, the two. And it says this in 19:1, next chapter, that the two angels then arrive in Sodom."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7953.18,"end":7958.22,"speaker":"Fr Stephen De Young","text":"Right. So that identifies the other two figures. So this is Yahweh, the God of Israel and two angels."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7958.62,"end":7962.32,"speaker":"Fr Andrew Stephen Damick","text":"Right? It's not Father, Son and Holy Spirit, the three."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7962.32,"end":7973.56,"speaker":"Fr Stephen De Young","text":"And then the sort of culmination of this judgment is in chapter 19, verse 24, in which Yahweh, the God of Israel, sends down fire from Yahweh, the God of Israel."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7974.76,"end":7984.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And that's the end. No, yeah. This actually is the last detail we're."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7984.2,"end":7984.84,"speaker":"Fr Stephen De Young","text":"Going to talk about."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":7985.08,"end":8024.99,"speaker":"Fr Andrew Stephen Damick","text":"But, but the, the interesting thing here is not, you know, the spectacular destruction of these cities. It says, you know, then the Lord reigned on Sodom and Gomorrah, sulfur and fire from the Lord out of heaven. Again, Lord, there is Yahweh. Yahweh reigned on Sodom and Gomorrah, sulfur and fire from Yahweh out of heaven. So you've got Yahweh sending down fire from Yahweh in heaven. So there's this location identification for the one sending down the fire. So again, it's Yahweh here and Yahweh there simultaneously, who are interacting and in two places."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8026.67,"end":8028.35,"speaker":"Fr Stephen De Young","text":"Yes, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8028.51,"end":8170.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Well, this is the end of our series on Old Testament Christology. And I think, you know, there's so many possible takeaways from all of these, but I think that the one for me, not just this particular episode, but from all four of them, really, you know, we've mentioned a number of times there's this phrase in the scripture, no one can see God. Whether it's. No one can see, no one has seen God at any time, or no one can see God and live. This idea that God is invisible is certainly there in the scriptures, and yet there are all these places where he does appear even before the events of the Gospels. Right. Even before that. And, and, and if you've listened to these episodes now, you have no excuse for ever saying again, well, God was totally invisible in the Old Testament, and then he suddenly appeared on the scene in the New Testament. That's just not a thing. I'm sorry. Which sometimes people say that as, as our explanation for why we have iconography. There's something true about that. We do have iconography because the Lord appeared, because he became man. That is true. But if you go on to say that he had never appeared before the events in the Gospels, well, that's not true. It's very clearly, very clearly not true. So what are we to do with that? These statements in Scripture that no one has seen God? Well, the easy answer to that is no one has seen God unless they're looking at Christ and then they're seeing God, right? The point of the Scripture saying no one has seen God is not to lay down a rule about the nature of God. As people who live in the 21st century west, we're very influenced by a lot of philosophical movements that we like to lay things out in big taxonomies, and we want to understand systems of knowledge. And so, you know, the underlying question in a lot of our thought is the question, what is this?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8170.49,"end":8170.81,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8170.81,"end":8469.57,"speaker":"Fr Andrew Stephen Damick","text":"So we want to define it, we want to describe it, we want to give it a Latin name. You know, all of these things, which, I mean, there's something good about a lot of that kind of work, for sure. And yet the main question to ask when encountering the God of Abraham, Isaac and Jacob is not what is God? Which is what's underlying. When we try to work out the apparent contradiction between you can't see God, and wait, here he is, right? Because we're trying to figure out what's the nature of God, that sometimes he is a parent and sometimes he's not. Not that questions about the nature of God are not important. But the most important question is, who is this? And you notice that Jesus asks his disciples that question, who do you say that I am? Who do men say that I am? He doesn't ever ask them the question, what am I? Right. And occasionally when they tend in that direction, they say things like, it's a. You know, especially after his resurrection, oh, it's a ghost. You know, they obviously get that very, very wrong. It's. It's who am I? Right? And the answer to that question is, well, everything we've just been discussing these last four episodes, right? And the point is that God reveals himself to us. And the point of that is, as we've just been hearing, so that we may be saved, right? God is not a natural phenomenon. He very deliberately shows himself to us so that we can be saved. It's not just to display his power. It's not just. It doesn't just sort of happen. It's specifically so that we can be saved, so that we can be rescued from these fallen gods that we've heard about so many times, so that we can be Rescued from our own rebellion and joining in that demonic evil, right? So that we can be rescued from corruption and death. So that we can be rescued from our sins which drag us into all of those things, all that kind of slavery, right? Everything that God does in relation to man is for the purpose of saving Him. The technical theological term for this is what's called the soteriological motive. And God has a soteriological motive, or if we can speak of him, you know, about his motives. It does say in Scripture that God is not willing that any should perish, but that all men should be saved and come to the knowledge of the truth. That is his desire. We know it's his desire because he said it is. He wants to save us. And so when he appears to us, it's for that purpose. It's not about creating systems or taxonomies of knowledge, right? Whenever we see an appearance of God in Scripture, whenever we see the appearance of God in the divine services, whenever we see the appearance of God in iconography, when we see the appearance of God in the writings of the Fathers, or wherever, however, we encounter him, when we see the appearance of God in the love and the kindness shown to us by another person, it is always for our salvation. So we should ask the question, how is this for my salvation? How can I receive this so that I can be saved? How can I receive this so that I can participate in his work in the world? So that all can be saved. Saved, right? We have to work for the salvation of all. We're not told that all will be saved. That is a heresy to insist that all will be saved. I'm sorry, it just is. Sorry, not sorry, universalists. It is a heresy. But we are to work for the salvation of all because God is working for the salvation of all, right? And so when we see these appearances of the Lord, whether we're talking about him as the angel of the Lord, the word of the Lord, the Son of man, and then these amazing expressions from this episode, the heavenly man, the man from heaven, right? When we see him, it is always. You can see, it's always in relation to what he's doing for mankind. Every time. It's all about that. This is. This is the divine mission. This is the gospel, right? His victory over demons, sin and death. And notice, all of this is done in the revelation of Christ, in the revelation of Christ. Sometimes some of the church fathers will say things like, what are we trying to attain to. We're trying to attain to the vision of Christ. And someone might Say, well."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8472.38,"end":8473.74,"speaker":"Fr Stephen De Young","text":"That'S what salvation is."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8473.74,"end":8589.49,"speaker":"Fr Andrew Stephen Damick","text":"It's like seeing Him. What does that do? But if you understand what seeing him does to you and what it does for you and why he's doing it because you don't see him without him willing it to happen, then you understand that the vision of Christ in glory transforms the human person to become like Him. That's what it does. You're not just sort of viewing Him, Right? It's not just a sight or spectacle. It is a vision in which you participate. We read from some of these prophets about how when they saw God, it just sort of knocked them off their socks. You know, it's because they were participating in his holiness. There was a transformative effect. And of course, in multiple cases, we see it calling a prophet, giving him what he needs in order to be a prophet, in order to bring the word of the Lord to the people, right? So the question always is, how is this for my salvation? Whatever we receive from the Lord is for our salvation, all of it. There's not a thing that we receive in this life that is not for our salvation. It's that pervasive, that overwhelming, that beautiful. And so I just thank God for the things that I've learned, and I hope that you've learned some things during this series, and it's been a great 2021 for the podcast, and we have a lot more coming in the next year. But my prayer, as always, is that you would attain to seeing our Lord God and Savior Jesus Christ as He is. Father Stephen."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8592.05,"end":8598.61,"speaker":"Fr Stephen De Young","text":"So I'm going to actually here in my final thoughts, answer a speak pipe that we didn't play."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8599.41,"end":8600.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh, cool."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8600.05,"end":8602.05,"speaker":"Fr Stephen De Young","text":"It's live radio and I'm going rogue."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8602.4,"end":8602.88,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8604.96,"end":8657.36,"speaker":"Fr Stephen De Young","text":"We got a speak pipe from a certain. I don't know if she identifies as a Bat Woman or a Batgirl. And there's Batgirl with and without the hyphen. So whichever female chiropteran humanoid she identifies as sent us a speak pipe that we didn't play. It would have been good if I thought of this and told you beforehand, wouldn't it? I would. But anyway, to summarize it, talk about a certain difficulty that I think is not just hers, but maybe some other listeners in that sort of. A lot of the stuff we talk about in this series and in general on this show can be very heady and very nerdy."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8657.68,"end":8658.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8658.72,"end":8739.48,"speaker":"Fr Stephen De Young","text":"And appeal intellectually, especially to a certain type of person, and get them excited and interested. But sometimes there is a disconnect between that and sort of everyday life, even life in the church, even like going to liturgy. Right. The actual practical thing of getting in the car on a Sunday morning without coffee and driving to liturgy. Right. Can seem at a distance from sort of these heady, fascinating sort of intellectual type discussions. And the question was sort of about how to, how to connect those dots or how to, to bridge that gap. And I don't think this is just like a problem with our show, right. Like we need to fix the show and make it more practical. I think this is a problem that more and more we all face due to the nature of our contemporary technology centered life where all of us now are conditioned to kind of prefer remote interaction, to direct personal interaction. Right. It's sort of safer to watch things from a good safe distance."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8739.72,"end":8740.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8740.28,"end":8763.74,"speaker":"Fr Stephen De Young","text":"Sort of vicariously. Right. And you know, this goes across all. I mean, not to get graphic family show, but you look at statistics now, younger people now are far less prone to have actual physical relationships with each other, preferring rather to just look at things on the Internet."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8764.22,"end":8765.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":8765.9,"end":9062.85,"speaker":"Fr Stephen De Young","text":"Because it's sort of safer to be remote and distant. And so that can happen to our religion, that could happen to, to us in the spiritual realm also where we want to have this kind of Internet based or just mental based, reading books based kind of idea that doesn't, you know, get into a room with a bunch of other people and taste and smell and be with each other and focus on the sacraments and on the transformation of our lives and confession and repentance and all of those things, right. That don't let you, you can't stay up above it, you have to get down in it, right. To get there. And I think this is not unrelated to what we were talking about tonight, because what we were talking about tonight is that as we're going to celebrate in two days that Christ, the one who reigns on the cherubic throne, the one who, who sits enthroned in the heavens on the cherubim above the skies, right? That the heavenly man became the man from heaven, that he was born and put in an animal food trough in a cave as a tiny baby and lived a life of rejection and suffering because he did not remain up above us, but he came down with us and became one of us and suffered alongside us and rejoiced alongside us, mourned alongside us, celebrated weddings alongside us, embraced the totality of our human life. And so a big part of the way that we find salvation, we find our spiritual selves and our spiritual renewing and healing and what we call theosis and deification in Christ is through truly discovering and embracing our humanity the way Christ did, and embracing it not only in ourselves, but in other people, in other people around us. Because the truth is the things that we really want in life, to be free from fear, to have a sense of meaning and purpose in our life, to have the brokenness in us fixed, to have the wounds in us healed, to grow strong and experience love and joy and peace. And all of those good things will never happen by ourselves in a room in front of a computer screen. It won't happen. To get those things, you have to be willing not only to get into the trenches and be around people, not only to come to church, into the church community and go out into the world, right? Taking Christ with us. Christ tells us we have to be willing to die the way he was. We have to be willing to suffer. We have to be willing potentially to become martyrs. Because taking that risk, not all of us will become martyrs, right? Not all of us will. In fact, Lord willing, few of us will. But that willingness, that sort of risk taking, right, that being willing to risk and give up our lives in this world is what gives us the life of the world to come, is what helps us find the one thing that we truly need. And so it's not just a question of finding a way to bridge that gap. It's imperative that we do right. What we talk about on this show is like we're standing on a hill and we're describing the landscape to you, right? If you're seeing the layout. But if you just stay at a distance and stand there, you're not going to experience any of the good things that we're describing. You've got to go down the hill, you've got to go into the town. And not everything there is going to be beautiful and pretty and pleasant, right? But all of the good things that are there are going to come to you when you're willing to brave it and you're willing to do it and you're willing to potentially sacrifice for it. So that's what I wanted to say to wrap this up. I hope that helps answer the question. I'm sure I will be informed whether it did or didn't and we could revisit. I'll get a message from the Batcave regarding whether that was satisfactory. But it's critically important that at Christmas we remember that the path that leads us to the glory in which Christ lives now is the path that that leads us through his humiliation, his humbling himself and his following the path of the cross and his death. That's the way that we need to go."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9064.45,"end":9089.5,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well that is our show for tonight and for this year. Thank you very much for listening. If you didn't get a chance to call in during the live broadcast, we would like to hear from you either via email at LordOfSpiritshot. You can message us at our Lord of Spirits Podcast Facebook page. We do read everything but can't respond to everything and we do save some of what you send for possible use in future episodes and join us for."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9089.5,"end":9100.58,"speaker":"Fr Stephen De Young","text":"Our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Next time we're doing another all Q and A episode, so get ready to tell us your darkest secrets and if."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9100.58,"end":9110.07,"speaker":"Fr Andrew Stephen Damick","text":"You are on Facebook, you can like our page, join our discussion discussion group, leave reviews and ratings everywhere, but most importantly, share the show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9110.47,"end":9122.07,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air. When you give to Ancient Faith, you can help feed Father Andrew's children for the price of a cup of coffee a day."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9122.39,"end":9131.04,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Thank you, good night, God bless you, Merry Christmas and may you have a wonderful and excellent and holy New Year."}
{"episode_id":"LOS - #034 - 2021-12-23 - Is the Heavenly Man the Man from Heaven -","start":9137.12,"end":9174.33,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
