{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":0.48,"end":65.11,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":67.11,"end":144.05,"speaker":"Fr Andrew Stephen Damick","text":"Good evening one and all. This is nothing other than the 35th episode of the Lord of Spirits podcast, known in some circles as podfather, priests and spooks. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346 with your questions about our topic tonight. Monteska Trudy will be taking your calls and we're going to get to those in the second part of our show. So tonight in your favorite inexplicably weird Bible study set in the context of trying to understand ancient people in their world, we will be looking at what the scripture says about the priesthood. It's a topic that seems to come up mainly when people want to argue about church leadership and who gets to do it. But it actually has a rather deep and profound theological basis that is written into the very fabric of creation itself and especially into humanity. And I'm sure that is a big surprise for longtime listeners of this podcast. Big surprise. So to bring us into what the priesthood is and means and does according to the Bible, well, here's another big surprise. We're heading back to Genesis. So let's start with Adam. Father Stephen, was Adam a priest?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":145.01,"end":145.49,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":146.77,"end":148.81,"speaker":"Fr Andrew Stephen Damick","text":"All right, here we go."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":149.69,"end":177.95,"speaker":"Fr Stephen De Young","text":"So he started out holy, then he went shadow, and then he respect discipline. I've got a riff on the title, a little of that. So nice. But that actually it made sense to a tiny portion of Our audience have them forever now. Yeah, we're gonna start out with a little bit of review because, you know, any episode could be someone's first."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":179.07,"end":187.79,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true. Although we do recommend everybody. You don't have to do it tonight, but, you know, go back and start from the very first episode. We do recommend that."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":187.95,"end":195.79,"speaker":"Fr Stephen De Young","text":"Which. Which gets more and more ridiculous every time we say it. Because right now you'd have to go listen to like 50 some hours of us."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":196.11,"end":198.19,"speaker":"Fr Andrew Stephen Damick","text":"What else do they have to do with their lives, though?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":199.63,"end":203.27,"speaker":"Fr Stephen De Young","text":"I don't know. The world must be people, kids."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":203.27,"end":204.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":204.11,"end":205.23,"speaker":"Fr Stephen De Young","text":"Yeah. Well, thank you."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":205.31,"end":206.83,"speaker":"Fr Andrew Stephen Damick","text":"The first Shakespeare quote for the."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":209.13,"end":235.61,"speaker":"Fr Stephen De Young","text":"But since we're talking about going to talk about Adam as a priest, we've got to go back and review. I was about to say review quickly, but come on. This is us. The identification and understanding of paradise as a temple. And so we've talked about this before, I think, in multiple episodes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":235.61,"end":235.97,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":238.05,"end":260.53,"speaker":"Fr Stephen De Young","text":"So the. To do this relatively quickly. The pattern that we see in Genesis 1 and 2 corresponds very closely to what we see in ancient Near Eastern temple construction and dedication texts."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":260.96,"end":261.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":262,"end":287.44,"speaker":"Fr Stephen De Young","text":"Which you would think would be really boring. Right. You would think would be like, yeah, so we found a good piece of land and here's the dimensions and here's the layout. Right. But it's actually not. It usually involves gods, like killing chaos monsters and like flinging their bodies to the ground and using the blood and bones to build things and, you know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":288.77,"end":289.65,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":289.97,"end":383.24,"speaker":"Fr Stephen De Young","text":"So as we talked about that, that sort of chaos comp. The war with chaos element is kind of inverted a little bit in. In Genesis 1, but it does still sort of follow that format. And that culminates in. In these ancient Near Eastern texts. And in the process, as it would have played out ritually when a material temple was built, the sort of final step of that was placing the image of the deity within the temple. And then the ceremony which would open its nostrils, which would then allow the spirit to enter into it and indwell it. And then that would be the point at which the people could then interact with the God ritually. And we've talked about how we see exactly that reversed in Genesis 2 with Adam, where still at the end of the process, Adam is made as the image of God. He's made, and then he's placed within the garden as a temple. But that Adam, as we said, that is inverted. He is to image God in the world. And that idea of imaging, as we've talked about before, is not just A nominal idea. It's not just a noun, but is a verbal idea that he actively images God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":383.4,"end":406.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one of the big differences between the way that Genesis presents this dynamic, this narrative, is that God himself places this image within his temple garden versus the pagan stories where constructing a temple, ultimately the images being placed by. By the pagan worshipers, you know?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":406.92,"end":407.24,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":407.24,"end":411.4,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, yeah. Which is a big, big important, very important discontinuity."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":411.56,"end":415.56,"speaker":"Fr Stephen De Young","text":"Right. Because they are using the temple of the rituals to act upon the God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":416.2,"end":416.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":416.56,"end":431.31,"speaker":"Fr Stephen De Young","text":"To get the God to do what they want, to maintain a fellowship with the God. Right. This is vice versa. Right. Adam is created sharing God's life and to continue the work of God in creation, as we've talked about."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":431.71,"end":434.87,"speaker":"Fr Andrew Stephen Damick","text":"So we talked about expansion of Eden, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":434.87,"end":537.46,"speaker":"Fr Stephen De Young","text":"And so first three days of creation in Genesis 1, God is putting things in order, right? He's separating the light from the darkness, separating the sea in the sky, separating the dry land from the waters, putting all those things in order. And then in days four through six, he fills in the same order. Those spaces that he set out put in order. He fills them with life, with living things. And so the command that's given to Adam and then when humanity is divided into man and woman, that's given to them is to fill the earth and subdue it, to put the earth in order and to fill it with life. And so the intent was that they would exit out of Eden and bring Eden with them. And as they did that, as they put things in order to fill it with life, those parts of the world, those parts of the earth would be integrated into Eden. So Eden would sort of expand, right? Yeah, they would be sort of annexed. And when we're talking about Adam as priest, this is important because that expansion was Adam's offering. One of the primary ways in which he was to put the world in order was to take all of the things of creation and offer them back to God in this sacrificial way. Right. Blessing and sanctifying them, making them holy, and thereby integrating them into Paradise."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":539.24,"end":540.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":541.64,"end":573.39,"speaker":"Fr Stephen De Young","text":"And. And so that is sort of the. The offering function there, Right? So it was not a question of he was going around. He was supposed to go out of Eden to find animals to sacrifice and then use their blood to, like, claim that piece of ground, right? No, but that was. That was the sense. So that kind of offering, right, is far more like the Eucharist than like the offerings of the old covenant, you might notice."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":573.71,"end":588.35,"speaker":"Fr Andrew Stephen Damick","text":"Right, because it's about, you know, incorporating rather than, you know, Bringing, as you said, rather than going. Bringing in something from the outside, it's about sort of incorporating what's there and offering that to God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":588.83,"end":605.97,"speaker":"Fr Stephen De Young","text":"Right. And why was that? Well, that was because the sacrifices of the Torah in particular, but even the ones before that were about cleansing and purification from sin and its effects. Right. Which didn't need to happen yet. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":605.97,"end":607.25,"speaker":"Fr Andrew Stephen Damick","text":"Because it's not a thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":609.89,"end":644.78,"speaker":"Fr Stephen De Young","text":"But so if we want to give sort of the quick definition then of what a priest is, starting with Adam. Right. The priest represents God to the rest of two other humans and really to the whole creation. Right, right. Represents God to the creation in that. Right. Like Adam. Right. Putting things in order, filling them with life, participating in the ongoing work of God in the world."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":645,"end":646.88,"speaker":"Fr Andrew Stephen Damick","text":"I was like naming them as well, you know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":646.88,"end":656.84,"speaker":"Fr Stephen De Young","text":"Right, right, right, yeah. That. That is participating in the work of God in the world. So the works of God are coming into the world through humanity. He doesn't need humanity."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":657.4,"end":658.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":658.28,"end":681.17,"speaker":"Fr Stephen De Young","text":"He chooses. Right. To. To do it through humanity. And then the flip side is that he represents man, other humans, and really the whole creation back to God. Right. This incorporation, this lifting up in prayer, in worship, in intercessions and blessing. Right. Before God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":681.41,"end":706.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even though this is not what we're going to super get into in this particular episode, you know, when death and sin and so forth come in, that's why so much of this stuff gets upended and distorted and destroyed. Is that the relationship of the creation to God that, that Adam was supposed to be maintaining, that all gets kind of, you know, broken as a result."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":706.7,"end":731.86,"speaker":"Fr Stephen De Young","text":"Right, right. And so priesthood then, is not like a job, like a particular job, a particular profession. It's not like a power position or a. An office. Right, right. That's supposed to clear with Adam."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":731.86,"end":743.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. None of that stuff. I mean, those are all like social, socially relative kinds of terms. Right. You know, and that doesn't exist in Eden because it's just Adam."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":743.98,"end":744.34,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":744.34,"end":749.82,"speaker":"Fr Andrew Stephen Damick","text":"And then you got Eve or whatever, but it's not. Yeah, yeah. There's no offices, there's no titles."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":750.46,"end":778.06,"speaker":"Fr Stephen De Young","text":"Right. It's. But it's a. It's a way in which Adam is to interact with the world. Right. A way he is to interface with the world. A way in which he is supposed to see and interpret the world and the things in the world. Right. So he's to relate to the animals, the plants, the other people as one who is offering them up to God and who is representing God to them."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":779.27,"end":779.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":779.51,"end":785.43,"speaker":"Fr Stephen De Young","text":"That's how he is to interact and see the world and experience it. That's what priesthood is."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":785.59,"end":786.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Really?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":786.63,"end":787.07,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":787.07,"end":797.95,"speaker":"Fr Andrew Stephen Damick","text":"And I was gonna say. And even another way of sort of extending that language is to say also that he. He offers God to the world and offers the world to God as. As part of it as well."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":797.95,"end":798.27,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":798.27,"end":798.79,"speaker":"Fr Andrew Stephen Damick","text":"That there's."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":798.79,"end":822.64,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. He is. He is sort of a conduit. Right, right. That runs in both directions. Right. And so this is because this is a way of relating to the world and a way of being in relationship to God in the world. Right. This is really an element of what we call human nature."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":823.6,"end":828,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's built right into what it means to be human. It's built into the creation itself."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":828.32,"end":856.19,"speaker":"Fr Stephen De Young","text":"Yeah. And we'll. We'll probably need to do an episode at some point where we just go through some of these terms. But like, a lot of the terms we've talked about. We've talked about so many terms where. Like image that we reviewed tonight, where these things have really become sort of reified in our usage and in our heads, right. To the point that we'll even talk about, like when we're talking about Christology, we'll say Christ took a human nature."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":857.31,"end":857.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":858.11,"end":933.65,"speaker":"Fr Stephen De Young","text":"Like human nature is a thing. Right. Like it's a human body, which expressly is not, at least in the sense we usually think about bodies as material. There's another word we take overly reified, but. And so nature is, in its original usage, is a directedness of being. Hmm. It is a sort of. And directedness in a. In a teleological sense, meaning a purpose or an aim or a goal. Right. So an acorn has the nature of an oak tree. Right. Meaning that if it is planted and if all goes well. Right. And if it was, if it is free to grow fully into its nature, that is. Right. The. The end of it. Right. Will look like that. Right. And so I believe it was St. Basil the Great. Correct me if I'm wrong. And you know who said that a human being is the being whose end is God in a sense of telos."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":934.37,"end":939.77,"speaker":"Fr Andrew Stephen Damick","text":"That sounds super familiar, but I cannot neither confirm nor deny from St."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":939.77,"end":980.24,"speaker":"Fr Stephen De Young","text":"Basil talking about. I'm sure he'd agree with it even if it was another Father. But the idea there being that obviously, and Christ being where we look for this, Christ is where we look to see what humanity is supposed to look like and what God looks like. That is sort of the end, that if all went well, that is what our humanity would look like. And one element of that. Right. One element of that is Meaning one element of how our being as humans, how our human nature is directed, is this idea of priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":980.56,"end":1012.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I say I'm reminded a little bit at that teleological definition of. It's not exactly the same thing, but it's the same sort of idea. That line from St. Augustine, which. I don't know if he really said this or if this is a misattribution, but you know, which I always love the way it gets rendered in English. Our hearts shall ever restless be until they find their rest in thee. Which is that same kind of idea that Christ is who and what we're meant for, and we're just not really truly fully human in every way we can be until we're in Christ."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1013.08,"end":1153.25,"speaker":"Fr Stephen De Young","text":"Right, right. And so this is sort of built into our human nature. And now, as we already mentioned, and this has to be addressed if we're talking about priesthood, that humanity, as we mentioned, gets separated into man and woman. Right, right. So I think we've mentioned before, right. That when this happens, when humanity is divided into man and woman, man and woman sort of major in one of those two tasks. So man majors in the task of setting the world in order, and woman majors in the task of bringing life into the world. And that second one is, you know, we could see in a pretty literal sense, but is also true beyond that literal sense. Right, right. But ideally. Right. Ideally both are participating with the other in the other's work. Right. So again, we could very literally see that for a woman to literally bring new life into the world, a man has to participate. Right, right. That's how the system works. Right. But also, also for a man to set the world in order in a way which will then allow it to be filled with life. Right. That requires the participation of woman. And this is part of the mystery of marriage. And the two becoming one flesh is that these two can become perfectly reunited in order to accomplish both tasks. There are ways of bringing life into the world that are pure chaos. There's a bayou not far from where I'm sitting right now. That's a good example. It is full of life. Life that will kill you if you go down there at the wrong time. But life nonetheless, that is out of control. Right. And even destructive at times."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1154.21,"end":1155.93,"speaker":"Fr Andrew Stephen Damick","text":"And also very tasty at times."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1155.93,"end":1181.98,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. When properly set in order. Yes. By frying, but. Right. But there's also obviously an ordering of the creation that is anti life. Right. These two are not opposed to each other by nature, but they can be if they don't each have the Participation of the other."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1182.46,"end":1182.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1182.74,"end":1184.86,"speaker":"Fr Stephen De Young","text":"I mean, it's not a cooperation."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1185.5,"end":1191.94,"speaker":"Fr Andrew Stephen Damick","text":"It's the point at which ordering becomes tyrannical. Right. I mean, you know, this is. Right. This is back to Leviathan and Behemoth."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1191.94,"end":1192.9,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1192.9,"end":1216.34,"speaker":"Fr Andrew Stephen Damick","text":"You know, yeah. Leviathan is. I mean, yeah. Leviathan is. Is sort of a chaotic life, so to speak. And. And Behemoth is a tyrannical order. But. But yeah, you know, again, there's. It's that old. That old Latin saying, you know, abuses non toled uzum. Right. Which I'm sure I'm mispronouncing, but the idea that just because there's an abuse of something does not negate its proper use."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1217.37,"end":1288.02,"speaker":"Fr Stephen De Young","text":"Right, right. And we actually see the place where this goes wrong in Genesis 3, where in the curse that's put on, the curse that's pronounced regarding the woman, it's usually, or at least often translated into English. Your desire will be for your husband, but he will reign over you. Right, right, right. And that's what that's saying is desire being sort of on the chaos and bringing life into the world side and reigning or ruling or dominating being on the order side. And both of them now, rather than cooperating together to create Right. In the world, are now opposed to each other. Right. And committed to dominating each other. It's now a power dynamic. Right. Where each side is trying to dominate the other rather than this cooperation. And that is one of the results of Adam and Eve coming to know evil."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1288.74,"end":1290.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yep."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1292.02,"end":1339.57,"speaker":"Fr Stephen De Young","text":"And so. And that rain language. Right. You may have noticed we've been talking about Adam as a priest, but there's also been a lot of setting, in order, naming the animals, which, as we talked about, you see in. In Hittite iconography, you see their kings naming animals as a way of saying they're the king. So there's also this sort of king idea mixed in there. And we have to remember that until a point we're going to talk about in a little bit in Act 2, Priest and King are still together right now. Right. These aren't separate ideas. Right. Everywhere in the world, pretty much, you have priest kings at this point in history, and Adam really is one too. Right. Those ideas are united there."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1339.97,"end":1413.49,"speaker":"Fr Andrew Stephen Damick","text":"And there's this idea as well, of. Especially since in many cases you're talking about really early civilizations where the whole kingdom, so to speak, is basically just a massive family. You know, there's, there's. And this is. It's interesting, like, this gets reflected in fact in language. Right. So even the English word king and yes, I know, you know, etymology does not determine meaning, but. But, you know, at some point in the history of the English language, the word king, which was kuning in Old English, it comes from the word kun, which is, you know, becomes our modern word kin. And it means almost exactly the thing then that it does now. And so the idea is that the king is the kin person. You know, he's the one who's bringing the kin together and putting them, as you said, in order. Which, I mean, as just kind of a side comment. It always makes me sort of roll my eyes when I see sometimes people complaining about scriptural language, about the kingdom of God, and saying, no, no, it should be about the kin Dom of God. I'm like, that's literally where this word has its origin. It really is about kin. But I mean, it's about putting the kin in order."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1413.89,"end":1416.37,"speaker":"Fr Stephen De Young","text":"I think you're the only one who sees people doing that."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1416.69,"end":1417.33,"speaker":"Fr Andrew Stephen Damick","text":"I am."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1417.33,"end":1417.97,"speaker":"Fr Stephen De Young","text":"Probably not."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1417.97,"end":1420.49,"speaker":"Fr Andrew Stephen Damick","text":"Okay. But no, it's out there."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1420.49,"end":1421.81,"speaker":"Fr Stephen De Young","text":"You take care of them for us."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1421.97,"end":1428.13,"speaker":"Fr Andrew Stephen Damick","text":"I will. Oh, I am, I am. But yeah, it's definitely a thing. Like this idea of kindom, not kingdom, like."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1428.13,"end":1428.53,"speaker":"Fr Stephen De Young","text":"Oh."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1429.41,"end":1438.21,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, weirdly enough, people do not want to be enlightened by my etymological wisdom. I don't know why that is, but."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1438.75,"end":1443.63,"speaker":"Fr Stephen De Young","text":"They sound like tiresome people. I mean, to be sure. So maybe I'm glad I haven't met them."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1443.63,"end":1450.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is the same world where people say amen and a women. I'm like, that's amen. Has nothing to do with maleness at all."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1450.99,"end":1453.55,"speaker":"Fr Stephen De Young","text":"Yeah, pedantry run wild."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1456.59,"end":1457.87,"speaker":"Fr Andrew Stephen Damick","text":"Trying to put things in order."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1461.47,"end":1533.45,"speaker":"Fr Stephen De Young","text":"But this, we should also say that, you know, this. While obviously it shouldn't be hard to convince anyone that the proper relationship of. Of men and women has fallen away into a kind of struggle for power, I don't think it'd be hard to convince anyone of that, at least in today's day and age. It's also true that that participation is still there as the ideal. As the ideal. And this is why you can see this in certain places. This happens in the Scriptures. Isaiah's wife is called the prophetess, right? Because she participates in his prophetic ministry and activity. And in the Orthodox Church, if a priest is a presbytere, we have a. And you're married. Your wife is a presbytera, which you could literally translate priestess. Right. That doesn't mean she is doing the same things I'm doing. Right. And even cooperation is there, I'm saying."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1533.45,"end":1548.66,"speaker":"Fr Andrew Stephen Damick","text":"And even in the period where we had married bishops early, early, early on. They were called episcopa, or sometimes, occasionally the bishop's mom was called episcopa. There's this participation in his role as a bishop."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1549.77,"end":1581.86,"speaker":"Fr Stephen De Young","text":"Right. So that is still held out as the goal and the ideal. And of course, you know, the conceiving and birthing of children is related to this as sort of a sign and a symbol in the positive sense of that. Right. That it's not limited to that, but that is a marker. That is a clear, visible and material sort of marker of what all, all of marriage, all of matrimony should be about. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1581.86,"end":1582.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1584.94,"end":1601.74,"speaker":"Fr Stephen De Young","text":"So relatedly, what we see as we go through the rest of the book of Genesis, Right. As the patriarchal narratives roll out and are we going to have to think of something else to call those?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1603.03,"end":1603.67,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1604.63,"end":1605.75,"speaker":"Fr Stephen De Young","text":"Is that going to be bad?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1606.15,"end":1611.51,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I mean, they are the patriarchs. I mean, what can you say? Like this is. This is the word."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1611.51,"end":1612.23,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1612.71,"end":1613.19,"speaker":"Fr Andrew Stephen Damick","text":"I mean."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1613.27,"end":1616.35,"speaker":"Fr Stephen De Young","text":"But yeah, I don't think we have."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1616.35,"end":1620.71,"speaker":"Fr Andrew Stephen Damick","text":"A lot of people deeply concerned with political cosmic podcast. Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1620.79,"end":1673.16,"speaker":"Fr Stephen De Young","text":"Just making sure. But if you are out there, welcome. We're glad to have you. Yes. And send your angry emails to Father Andrew Damick, courtesy of Ancient Faith Ministries. So what we see and prominent examples of the. These, this would be like Abraham, Isaac, Jacob, Job. Right. The patriarchs afore named is we see the fathers as in not the father of a nuclear family. We need to pause here a second. Okay. I know the nuclear family is ingrained into all of our brains as what a family is. Right. And some folks even this is gets mixed up in politics and stuff and they think the nuclear family is some kind of Christian ideal. The nuclear family did not exist before industrialization."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1674.36,"end":1682.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was just not really even possible economically for a family to survive that way. In most cases, everybody thinks about Little House on the Prairie and whatever."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1682.64,"end":1693.13,"speaker":"Fr Stephen De Young","text":"But yeah, it's not man, woman, children. It's man, woman, uncle, aunt, children, cousins, grandma, grandpa, great grandma, great grandpa, which."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1693.13,"end":1701.61,"speaker":"Fr Andrew Stephen Damick","text":"I mean, a lot of people in the world still live that way. Like a lot of my wife's family who lives in Lebanon, they all live in the same building. They're just all together."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1702.17,"end":1715.22,"speaker":"Fr Stephen De Young","text":"And so it's worth reiterating. Right. Because when we talk about Abraham and his family, we're not talking about Abraham, Sarah, Isaac and maybe Ishmael."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1715.22,"end":1715.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1715.7,"end":1800.17,"speaker":"Fr Stephen De Young","text":"We're talking about all of them, plus lot, plus all of his servants, plus all of it. Right. All the extended Relatives. So the social structures, and we're going to be talking about these going forward. So it's worth taking a little time here to lay this out. Right. When we come into Act 2. So the social structures, at this point, you have these extended family units. Right. And you'll have several of those that are also related but more distantly, that make up a clan. Right. They'll generally be these large extended family units that have a common sort of ancestor maybe two or three generations back. Right. And that'll be a clan and then a group of clans. Right. Which generally that group of clans, which they will have a story at least, that they're all distantly related to each other by blood. But whether that's actually by blood or whether there was adoption, as we've talked about it before. Right. And other people entering in is often not totally clear. But those clans then will make up a tribal unit. Right. So, like, this is how Israel is going to be set up later, and this is how Israel's neighbors are mostly set up."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1800.25,"end":1834.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, when you look at, you know, like, like almost any, any culture, when you look at it, like its mythology and the description of families and so forth, like that's the way that things are set up is, is a lot of those stories come out of these tribal periods. And there's always, you know, and there's always one. One man who's at the head of the whole thing and is related to at least half of them in a pretty demonstrable way, you know, and then a lot of the authority flows from him to members of his family, you know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1834.47,"end":1836.71,"speaker":"Fr Stephen De Young","text":"Right. And this is going to be true in cities, too."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1837.27,"end":1837.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1837.87,"end":1902.71,"speaker":"Fr Stephen De Young","text":"Cities, you're going to have these extended family units and even clans, and then the king of a city state is going to be seen as sort of the father of the whole unit. Right, Right. And so within these social structures, the fathers of the extended families. Right. Sort of. Sort of the elder of each of those families. Right. The patriarch of each of those families. So Abraham, Isaac, Jacob, Job, they're the ones who are performing the priestly functions. They're the ones who we see going and offering sacrifices. Right. They're the ones who we see offering not just other people, but the elements of creation back to God and representing God to them. Right. So God is working in the world through them to both to their families and to the world, and they're coming back to represent the world to God. So think about Abraham sort of bargaining with God over whether or not he'd destroy Sodom and Gomorrah. Right. Interceding for Sodom and Gomorrah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1902.71,"end":1913.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's not this, again, it's not like a separate profession like the butcher, the baker, the candlestick maker and the priest. It's. This is his task as the head of the family."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1914.03,"end":1932.72,"speaker":"Fr Stephen De Young","text":"Yes, yes. So priesthood and fatherhood in this sense are built together. Anyone who's seen as a father is also seen as a priest. Right. Including the king. So like Melchizedek, who's a priest king. Right. See the whole episode we did about Melchizedek."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1933.12,"end":1933.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1934.16,"end":1990.15,"speaker":"Fr Stephen De Young","text":"But he is the king. He is seen as the father, therefore he's functioning as a priest. Right, right. And so these two things are deeply connected. Right. This is what fatherhood is, is priesthood. And what priesthood is, is, in a sense, fatherhood. Right. You can't separate those, those two fully. And so this is, this is a part. We're going to get into this more later because we decided to be super controversial this time. But this is part of why, as we're already seeing, we have male priests. Right. Because this is, this is what, what fatherhood is. And I don't think we're going to touch on this super directly later. So let's go ahead and do it now."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1990.47,"end":1991.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":1991.99,"end":2037.21,"speaker":"Fr Stephen De Young","text":"As we talked about, we're saying now, priesthood is particularly related to fatherhood and to masculinity. That it sort of constitutes it. Right. And so why is that? Right. Why is that? Well, if you study the Torah very much and if you have in your brain, as we don't always have, or if you have in mind that to pay attention to men and women in the Torah, what you'll find, for example, is that almost all of the commandments and when you get to issues like sexuality, all of the commandments are directed to men and not women."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2037.93,"end":2055.77,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which follows a general pattern in the Old Testament, particularly, that you see where. And even in the New Testament, where the person who has the choice in a matter or the power or authority or whatever, those are the ones that God is talking to and usually putting limits on that person."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2056.41,"end":2060.89,"speaker":"Fr Stephen De Young","text":"Right, right. And it's not just limits. Right, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2060.89,"end":2061.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2061.17,"end":2074.32,"speaker":"Fr Stephen De Young","text":"But. But on the whole. Right. The males of the human species are more physically powerful. Right. Just and physically dominant, actually."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2074.32,"end":2075.2,"speaker":"Fr Andrew Stephen Damick","text":"True. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2075.44,"end":2101.75,"speaker":"Fr Stephen De Young","text":"Which is why you get in societies all over the world, far more commonly patriarchy than matriarchy. Right. And so it is male energy in particular. It is that male energy to put things in order. Right. To subdue. Subdue very quickly becomes dominate."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2102.39,"end":2106.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's not what it's supposed to be. It's more like cultivate."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2107.35,"end":2107.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2107.99,"end":2109.47,"speaker":"Fr Andrew Stephen Damick","text":"Build. Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2109.47,"end":2130.61,"speaker":"Fr Stephen De Young","text":"And so male energy has a particular need to be channeled in certain ways. Right. And the way in which it can be channeled positively to result in theosis, to result in becoming more like God. Right. As part of our human nature, as it was meant to be, is priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2132.21,"end":2132.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2133.33,"end":2264.77,"speaker":"Fr Stephen De Young","text":"So priesthood is part and parcel of masculinity because in this world, because it is what masculinity needs in this world order to find salvation. Right. And we could equal. Well, I couldn't equal. I'm a man, so I couldn't equally well talk about. But I could also talk about that motherhood, which is not limited to physical, biological motherhood, but also includes spiritual motherhood, just like priesthood includes spiritual fatherhood, is what is needed for women to channel that feminine energy into producing life instead of producing chaos. Right. So these. When people. Part of the problem is that traditionally in our culture and in sort of the Puritan influenced Protestant culture of the US So I'm not even specifically talking about Protestant churches now. I'm just talking about American culture as it's been influenced by Puritan Protestantism, the discussion tends to be about gender roles and those roles are spoken of as being assigned. Right, Right. So it's seen as like, this is what you are going to do. Right. That's because some authority has said so and used to be that authority was God. This is what God says, said men are supposed to do and women are supposed to do. And if you're disobedient, that's bad and you'll be punished. Since most people now in American culture have gotten rid of the God part, it's just sort of the culture has said it, or oppressive social structures, Western tradition has said it. And that of course is much more open to question, which is why we have a lot of the chaos we do. Right, Right. So we need to think about this more. Like when St. Paul says everything is permissible to me, but not everything is beneficial. Yeah, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2264.77,"end":2271.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's, it's not about who's allowed to do what. It's really about what is it that's actually going to bring a person to holiness."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2271.97,"end":2276.13,"speaker":"Fr Stephen De Young","text":"Right. How will each person find salvation? Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2276.13,"end":2276.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2276.77,"end":2287.57,"speaker":"Fr Stephen De Young","text":"And so as we're going to see as we keep going now, that doesn't mean that every male human needs to become a priest the way you and I are priests. Right, Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2287.57,"end":2293.33,"speaker":"Fr Andrew Stephen Damick","text":"But all are called to priesthood in this sense. Yes, exactly."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2293.33,"end":2384.4,"speaker":"Fr Stephen De Young","text":"Priesthood in various contexts. Right. And it's not that women aren't called a priesthood, but women are called to experience that by participating in the men's priesthood. Right. By being their wives, by being their mothers, by being their spiritual mothers. Right. By being their daughters. Right. In all of those ways. Right. So, right. As we were saying, this is a means of exercising authority, right. The authority that's been given to Abraham, Isaac, Jacob, Job, Melchizedek, Right. In their various social units, that authority can be used by them in a lot of different ways. Right. And Melchizedek is definitely an exception among ancient pagan priest kings. Right. He's not really a pagan, but you know what I mean? Right. And so this is a way of channeling, right. And of directing that authority and utilizing it. Right. And so we talked about how priesthood then can be seen in terms of being this sort of conduit, right. That, that worship, the worship of the people, Right. Passes through them to God. Right. Prayer and worship of people passes through."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2384.4,"end":2386.56,"speaker":"Fr Andrew Stephen Damick","text":"Them to God and then it goes the other way."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2386.96,"end":2395,"speaker":"Fr Stephen De Young","text":"Right. God's grace, the works of God, the divine energies, right. God working in the world passes through them to the people and to the creation."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2395.64,"end":2396.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2396.52,"end":2398.92,"speaker":"Fr Stephen De Young","text":"And ideally they don't get in the way."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2399.4,"end":2449.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. So that's where, and this is the problem, I'm sure some people hearing that, they're like, well, that really gives a lot of power to the priest. Right. But I mean, again, anything can be abused. And the way that in the ancient world that we see it, abuse is that the, the priest king sets himself up as a God king, Right. You know, that instead of just being the person that the worship passes through to God, he now expects God. He expects to be worshiped as a God. And also instead of just being the guy that the grace of the God passes through him to the people, like a lot of it sort of stops with him. You know, he's being charged up by the God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2449.8,"end":2452.04,"speaker":"Fr Stephen De Young","text":"Right. And he then dominates the people."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2452.28,"end":2517.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which is, you know, like this pagan model of priesthood, fatherhood, kingship is exactly the model that I think a lot of, you know, even well meaning Christians react against because they see this corrupted version of priesthood, right. That it's about dominating people and about thinking that you're holy and can dispense all graces and if I may say so, the key to the storehouse of merit, that kind of thing, Right. That's the kind of thing that people are reacting against. And it's precisely this, this is where that comes from. Right? Now, mind you, pagan God king priests are Being very explicit about it. You know, they're saying, yes, I'm a God, worship me. But, you know, and, you know, no Christian worth his salt, even a tiny little bit would ever say such a thing about himself. But that's the way when people react against priesthood very negatively. The priesthood they're reacting against is this kind of paganized version."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2518.17,"end":2534.66,"speaker":"Fr Stephen De Young","text":"Right. Because this isn't saying you need an intermediary between you and God. This isn't saying you need another mediator other than Christ between you and God. Right. Because ideally, if he's doing it right, he virtually ceases to exist."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2535.38,"end":2537.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. He becomes sort of transparent."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2537.46,"end":2539.54,"speaker":"Fr Stephen De Young","text":"This is dying to self. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2539.94,"end":2540.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2540.42,"end":2569.32,"speaker":"Fr Stephen De Young","text":"This is ego, death. This is St. John the Forerunner, saying, he must increase and I must decrease. Yeah, right. This is the. The priest is the one who connects people to God and God to people and then gets out of the way. Right. That's the ideal here. Not that he is imposing. In fact, if he's imposing himself in between and asserting himself in between, by definition, like these pagan priest kings, he's doing it wrong and he's usurping God's authority."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2569.72,"end":2573.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's the thing which is bad usurpation, right? Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2573.44,"end":2574.6,"speaker":"Fr Stephen De Young","text":"For the record. Bad."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2575,"end":2595.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And I mean, this is one of the primary evil things that you can do in Scripture is the usurpation of God's authority, whether it's a pagan priest king doing it for himself or people worshiping a demon who's doing that, you know, taking the place of God by accepting worship. Idolatry."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2596.56,"end":2658.08,"speaker":"Fr Stephen De Young","text":"Right, right, right. And this, this shows. Hi, Jordan B. Cooper, if you're listening, this shows why not only is iconography and the veneration of icons in the church not idolatry, it is literally the opposite of idolatry. Performing the imaging function of God. The image of God is the opposite of idolatry because idolatry is definitionally. Right. Whether it be the pagan priest king who's seen as the embodiment of the God. Right. Like the pharaoh being the. The incarnate Horus. Right. Or different gods at different stages in Egyptian history. Or whether we're talking about a stone or wooden idol. Right. That object or person is by definition this kind of intermediary who comes between."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2659.51,"end":2661.03,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's the body of a God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2661.83,"end":2680.95,"speaker":"Fr Stephen De Young","text":"Right. Who receives instead and who exercises authority instead. Whereas an icon. Yeah, go ahead. Well, an icon. Right. As Saint John of Damascus reminds us again and again. Right. Remember, the veneration, the honor passes through it."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2681.43,"end":2681.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2681.83,"end":2711.51,"speaker":"Fr Stephen De Young","text":"To the one depicted. Right. That's why the window to heaven language. Right. A lot of folks have, have really kind of been trashing that language lately. And I understand why, because the idea that, like, oh, you're looking into a window and seeing heaven. Right. But I don't think that was the original intent, or I'm going to give the benefit of the doubt that that was not the original intent. I'm hoping the original intent, because this expresses something very true, is that they were referring to the icon as being transparent."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2712.7,"end":2712.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2713.26,"end":2713.98,"speaker":"Fr Stephen De Young","text":"Like glass."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2714.54,"end":2723.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, to use, as you said, the conduit language, idolatry is when the conduit gets sort of stopped up."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2723.82,"end":2724.26,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2724.26,"end":2737.34,"speaker":"Fr Andrew Stephen Damick","text":"You know, it. Then the, the worship stops there or the, the, the, the, you know, divine power stops there and resides in that thing. You know, that's, that's the problem."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2738.44,"end":2738.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2738.56,"end":2743.24,"speaker":"Fr Andrew Stephen Damick","text":"You know that. Yeah, yeah, exactly. You know, at a very. It's dammed up, so to speak."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2743.56,"end":2888.46,"speaker":"Fr Stephen De Young","text":"Right. And, and this was sometimes seen as happening quite literally. So there are in Second Temple literature examples of when they're trying to explain what's going on with golden calves, whether we're talking about the one in Exodus or we're talking about the ones Jeroboam son of Nebat set up. Right. That kind of thing where someone makes an idol of Yahweh, the God of Israel. Right. Some kind of representation. A very common Jewish interpretation of what happened there and why it was wrong was because someone could come and say, well, okay, I mean, but they're trying to worship the God of Israel. They're doing it the wrong way. Right. But they're sort of trying in a bad way to worship the God of Israel. Right. But the way they saw it happening is they argued that demons would enter into those idols and the demons would sort of intercept it, like intercept the worship. Right. Like insert themselves in between and block the blessings. Right. To quote certain preachers. Right, right. So that's what we're talking about when we're talking about idolatry. We're talking about this instrumentalization. Right. One way or the other or both ways. Right. So if it's a priest king, it's working both ways. Right. One of these pagan priest kings or God kings, he's interposing in both ways between God and the people and between the people and God within a physical idol that can't see or hear or talk. It's between the people and God. Right. It's not even performing the other function at all. Right. But that then, to repeat, is the opposite of imaging Right. When Melchizedek as a priest king, served as a priest king, he was serving as an image of the God who created the universe to his people. So David, when he was imaging God, right. In the, in the divine council with his human council, right. He's imaging. Right. He's not putting himself in between. He's not demanding obeisance for himself instead of God. Right. That's the key, the key difference. And what makes them opposites."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2888.78,"end":2900.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Exactly. Exactly. All right. We are going to take a short break and we'll be back with your calls. Call in if you have questions about the priesthood. That's what we're talking about tonight. And we'll be right back."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2901.65,"end":2917.81,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2926.69,"end":2938.77,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer? Are you an Orthodox Christian looking for."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2938.77,"end":2942.29,"speaker":"Fr Stephen De Young","text":"A reliable first place to send your interested friends?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2942.53,"end":2945.41,"speaker":"Fr Andrew Stephen Damick","text":"Do you need help finding an Orthodox church near you?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2945.89,"end":2947.61,"speaker":"Fr Stephen De Young","text":"My name is Father Paul Hodge."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2947.61,"end":2958.6,"speaker":"Fr Andrew Stephen Damick","text":"I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2958.6,"end":2962.12,"speaker":"Fr Stephen De Young","text":"I serve in the Greek Orthodox Archdiocese of America."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2962.28,"end":2971.56,"speaker":"Fr Andrew Stephen Damick","text":"And I'm Fr. Andrew Stephen Damick, chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox Intro team."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2971.88,"end":2973.56,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2973.56,"end":2975.6,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2975.6,"end":2977.88,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2978.12,"end":2983.88,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2983.88,"end":2988.04,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos of the Internet, a place to get."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":2988.04,"end":3008.28,"speaker":"Fr Andrew Stephen Damick","text":"Help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of ancient faith ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3013.87,"end":3014.27,"speaker":"Fr Stephen De Young","text":"Foreign."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3016.91,"end":3033.07,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3035.79,"end":3088.36,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the second half of this evening's episode of the Lord of Spirits. We're talking about the priesthood. And just like you heard the voice of Steve said, you can give us a call if you have questions about that at 8:55 AF radio. Again, that's 855-237-2346. So we've laid out exactly what it means that priesthood is kind of baked into the creation and baked into humanity and especially into fatherhood. Right. And we talked about how that contrasts with the way that paganism distorted all of that. So now we're going to kind of move forward a little bit chronologically in the scriptures and talk about the way that the priesthood begins to change because of some things that happen. Right. So let's talk about Moses. So what goes on with him, Father?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3089.8,"end":3090.76,"speaker":"Fr Stephen De Young","text":"A bunch of stuff."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3091.08,"end":3094.68,"speaker":"Fr Andrew Stephen Damick","text":"Some stuff. It's all that Exodus read Exodus, good."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3094.68,"end":3140.98,"speaker":"Fr Stephen De Young","text":"Night, kills that Egyptian dude. Yeah. So in addition to that and related to priesthood. So now that we're out of the book of Genesis, right. We're coming into the Book of Exodus. What's going to happen is that priesthood is going to get fractured. Right. That's what we're going to be talking about in this act. And the second half, we're going to be sort of going through and seeing how. We talked about how before Exodus, in Genesis, there's not sort of a priesthood. Right. Like Abraham didn't go and find a priest when he wanted to offer a sacrifice. He just did it."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3141.06,"end":3142.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He didn't get ordained by somebody."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3143.14,"end":3225,"speaker":"Fr Stephen De Young","text":"Right. So but then there is this now going to be a priesthood, obviously spoilers in the Old Testament. And that represents priesthood now being separated off to a particular group. And that actually begins with Moses himself. Right. And to understand that, we have to talk about one of the really weird. Well, this includes one of the really weird episodes in the Book of Exodus. There's more to it than that. And a lot of what's going on in it is hidden behind euphemisms and de. Euphemizing it slightly, a little bit, not completely, because Family show and our lead in was just like a children's gospel reading. So now I feel bad if I scar someone for life by talking about this too bluntly. But so we're pretty familiar with the first part of Exodus 4 where God has this exchange with Moses, right. Like at the burning bush and tells Moses to go back to Egypt. And Moses is like, nah, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3226.6,"end":3228.6,"speaker":"Fr Andrew Stephen Damick","text":"That's a literal translation of the Hebrew."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3228.76,"end":3241.4,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Low. Yeah. No. So, well, it gets to that. Right. It starts out with a lot of excuse making, you know, it starts out with me. No, talk Good."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3241.96,"end":3242.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3243.64,"end":3287.8,"speaker":"Fr Stephen De Young","text":"You know, are not going to get killed. And is it. There's somebody else you could pick. And finally, it's just sort of like, I don't want to do it. Right, right. And God sort of gets in the text increasingly angry about this. Right, right. And remember, the angel of the Lord is involved in this too. Right. This is one of the places where we see. And we mentioned this in our pre Christmas series. This is one of the places where you see the angel of the Lord in the bush and then also Yahweh talking from the bush where they're distinguished but yet identified. And so there's this increasing sort of irritation with Moses. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3287.8,"end":3296.04,"speaker":"Fr Andrew Stephen Damick","text":"Which I mean, like, let's just take a second here and realize that here is Moses literally looking God in the face and he's standing there making excuses."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3296.44,"end":3296.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3299,"end":3309.32,"speaker":"Fr Andrew Stephen Damick","text":"Which I mean, you know, it's comfortable. Think, well, I would have done differently, but I am not even 10% as holy as Moses, so probably not."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3309.32,"end":3317.27,"speaker":"Fr Stephen De Young","text":"I don't know, man. God wants. God wants me to give back the extra change I got at Walmart and I make excuses. What are you talking about?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3317.35,"end":3318.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3319.35,"end":3320.63,"speaker":"Fr Stephen De Young","text":"So, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3320.63,"end":3335.35,"speaker":"Fr Andrew Stephen Damick","text":"And also this is right when like, you know, part of this is God showing Moses the signs that he's about to be able to do, like the thing with staff and put his hand inside his clothes, you know, like all this kind of stuff. Like, here's some miracles, Moses. And he's still like, really?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3335.43,"end":3337.64,"speaker":"Fr Stephen De Young","text":"Do I have to? Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3339,"end":3340.36,"speaker":"Fr Andrew Stephen Damick","text":"May he intercede for us."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3341.96,"end":3376.95,"speaker":"Fr Stephen De Young","text":"And I have an icon of him staring at me right now, so I won't be too critical. So what God says is, well, I'll send Aaron to help you. And in fact, he says, you know what? God having known this was going to happen, said he's already on his way here. Right. So why don't you just head out toward Egypt and he'll meet you on the way and the two of you could go to Egypt together. And Moses says, okay. And then heads in the opposite direction."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3377.67,"end":3384.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so he pulls a Jonah. Yes. Or should say that Jonah pulls a Moses. I don't know."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3384.27,"end":3393.43,"speaker":"Fr Stephen De Young","text":"But yeah. And so as he's heading in the opposite direction, who should he run into? Not Aaron, because Aaron's coming from the other direction, but his wife."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3393.86,"end":3394.58,"speaker":"Fr Andrew Stephen Damick","text":"Zipporah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3394.58,"end":3406.18,"speaker":"Fr Stephen De Young","text":"Zipporah. And so in this encounter, we find out that the angel of the Lord is about to kill him. Right. Kill Moses."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3406.74,"end":3407.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3407.86,"end":3420.75,"speaker":"Fr Stephen De Young","text":"And so it's not just that he was making all the excuses, it's not just that he was Running in the other direction. But we now find out that Moses had not circumcised himself and had not."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3420.75,"end":3434.43,"speaker":"Fr Andrew Stephen Damick","text":"Circumcised his son, which, again, this is basic, you know, constitutive, belonging to the family of God. Kind of like this is, you know, this is utterly baseline stuff."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3434.43,"end":3434.87,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3434.87,"end":3445.55,"speaker":"Fr Andrew Stephen Damick","text":"Like, you have to be circumcised if you can be part of the covenant people. And, you know, here is Moses about to be the prophet of God to the people, and he has not even done this most basic thing for himself and his sons."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3445.91,"end":3471.91,"speaker":"Fr Stephen De Young","text":"Right. This is like finding out your bishop was never baptized. Right, right. And so Zipporah is actually mad at Moses about this. Right. Because this could have left her a widow and potentially there could have been consequences for her son. And so when she shows up. And again, this is some of the stuff that's hidden beneath the euphemism."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3473.78,"end":3474.02,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3475.38,"end":3558.53,"speaker":"Fr Stephen De Young","text":"She throws the results of her having circumcised their son at Moses, and she takes the knife, the knife that she used to do it, and places it in the place where she would have to place it to also circumcise Moses. Yeah. Ed says it's usually translated as, you have become a bridegroom of blood to me. Right, right, right. Meaning I married you, I had this child with you, and look at this misery and wrath that you've potentially brought upon me. Right. So after this episode, Right. Is where we find out that it's going to be Aaron who is going to be the high priest. Aaron and his sons are going to have the priesthood, the now existing priesthood. Right. So what's happening here is that the priesthood is being taken away from Moses. He still has that kind of kingly leadership role, but the priesthood has been taken away from him and isolated with Aaron and his sons, as opposed to Moses and his sons."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3558.61,"end":3567.17,"speaker":"Fr Andrew Stephen Damick","text":"Because, you know, up to this point, him having this sort of patriarchal position, he would have been the priest of the people or the primary priest."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3567.41,"end":3568.93,"speaker":"Fr Stephen De Young","text":"Right. The same way Abraham was."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3569.33,"end":3572.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. He's now in the place of Abraham, essentially."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3572.85,"end":3589.86,"speaker":"Fr Stephen De Young","text":"Right. And. Right. And this is not just sort of a random punishment. Right. Or an arbitrary kind of punishment. This is related to the fact. The specific. His specific failing. Right. His specific failing was as a father."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3590.82,"end":3593.46,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because this is the thing that a father is supposed to be doing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3593.62,"end":3603.86,"speaker":"Fr Stephen De Young","text":"Right. He failed to be a priest for his own family. And if you can't be a priest for your own family, then you can't be a priest for the broader community."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3605.21,"end":3605.53,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3605.53,"end":3612.17,"speaker":"Fr Stephen De Young","text":"Right. St. Paul's going to make this point later on in the New Testament, this is where he's getting it. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3612.41,"end":3613.77,"speaker":"Fr Andrew Stephen Damick","text":"He didn't make it all up."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3614.81,"end":3672.43,"speaker":"Fr Stephen De Young","text":"That's later. Sorry, we'll talk about that more in the third half, but. Right. So you can't do it on this larger scale if you can't do it on this smaller scale. Right. And so it's, it's given to Aaron. And so here the king and high priest are separated and they're going to remain separated throughout the rest of. Well, the person who's supposed to be the king and the person who's supposed to be the high priest will remain separated throughout the rest of the Old Testament. These will be two different things. Right. And later on as we move through the Old Testament, the line of the high priest is going to, in various stages, get sort of winnowed down. Right. So it's, it starts with Aaron and his sons, but it's not going to be like all of Aaron's descendants are the high priestly family."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3672.91,"end":3673.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3673.43,"end":3695.04,"speaker":"Fr Stephen De Young","text":"There are going to be several important junctures. Right. And the first of those is Phineas, who I know we've talked about before because I just like triggering people by talking about Phineas, who's. Whose name is actually an Egyptian name. Egyptian name is Pinihas, which is one of the words for a Nubian. It means the black skinned one."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3695.44,"end":3695.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3696.8,"end":3726.34,"speaker":"Fr Stephen De Young","text":"So his mother, he's Aaron's grandson. His mother was from Put, which is southern Libya, and she was an African woman. And Phinehas is the one who intercedes violently at, in the Book of Numbers at the incident at Baal or Baal Peor."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3726.98,"end":3728.82,"speaker":"Fr Andrew Stephen Damick","text":"This is chapter 25."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3729.06,"end":3785.7,"speaker":"Fr Stephen De Young","text":"Yeah. A group of Moabite and Midianite women who are not just some random women looking for husbands, they are shrine prostitutes seduce a number of Israelite men into participating in the rituals there at the high, at the high place. And this includes some of them even bringing some of these shrine prostitutes into the camp and defiling the camp. And Phineas intercedes with a spear to put an end to that. And, and then it is his descendants who then the family of the high priest will come down. Come from. And then several centuries later, the high priesthood is winnowed down again to the family of Zadok, the faithful high priest. And so this will sort of continue in terms of who is going to be the high priest. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3785.7,"end":3786.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3787.99,"end":3817.35,"speaker":"Fr Stephen De Young","text":"So that's the high priest. Right. But there's also just priests. Right. There's sort of the general priesthood. Right. You're run of the mill priests, not just the singular high priest. Right. And these are the people who are doing most of the things. Right. When you read the rituals, right. I mean, the high priest is involved at the day of atonement. He has this special role. There are a couple other places where he has a special role, but the day to day stuff in the tabernacle is being done by the priests."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3817.59,"end":3821.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's just one high priest at a time, is that right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3821.27,"end":3821.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3822.07,"end":3823.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3823.27,"end":3918.82,"speaker":"Fr Stephen De Young","text":"Right. So despite this happening pretty early on in Exodus, right. Before from then until through the Exodus, and even once they come out into the wilderness to Mount Sinai, the people who are doing those sort of regular day to day priestly functions are still the elders of the people. Right. The Presbyterians in Greek. Right. The presbytery in Greek, who each, as we mentioned before, in those social units, each of these extended families. Right. That was in these clans. Each of these clans, they had an elder. Right. A presbytere, a leader. And the Presbyterians of the 12 tribes, 70 or 72 of them, I tend to think 72 just because it's an even multiple of 12, but it could be either number. Then we're sort of the, the, the elders of the people as a whole. Right. The presbyterate as a whole. And they were the ones who were still offering sacrifices for their families. Right. They're still fulfilling that same function. The priesthood had not been taken away from them the way it was taken away from Moses yet. Right, Right. And so we see this play out in the episode with the golden calf in Exodus 32. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3918.82,"end":3925.5,"speaker":"Fr Andrew Stephen Damick","text":"Where they decide to try to use the techniques of idolatry to worship Yahweh."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3925.98,"end":3930.54,"speaker":"Fr Stephen De Young","text":"Right, Right. So Moses is up on the mountain. He's gone too long."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3931.12,"end":3931.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3931.32,"end":3970.37,"speaker":"Fr Stephen De Young","text":"It's dark up there and scary. So they say, ah, he must have died up there. Hey, Aaron, you know, here's all. Here's a bunch of our golden jewelry that we looted from the Egyptians on our way out. Make us, make us a God to worship. So he makes what is probably an APIs bowl. An Egyptian style APIs bowl. And Aaron points at it and says, here is Yahweh, your God, who. Who brought you out of Egypt, and more euphemisms. But the text in most English translations says something like they sat down to eat and then rose up to play."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3972.13,"end":3975.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which means that they engaged in a pagan orgy."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3975.97,"end":3989.85,"speaker":"Fr Stephen De Young","text":"Right? Right. They had pagan sacrifices, they had a sacrificial feast and then an orgy. Yes. That's what that is saying. It's not saying that they, you know, ate a light lunch and then played Twister. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3989.85,"end":3994.37,"speaker":"Fr Andrew Stephen Damick","text":"A little bit. The Royal Game of Ur, perhaps."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":3994.37,"end":4047.1,"speaker":"Fr Stephen De Young","text":"Yes. So, and then, of course, you know, we've seen this dramatized with Charlton Heston and everything. Right. Moses comes back down and finds them in flagrante delicto and is quite upset. Right. And is going to put a stop to this. And he says, who will stand with me? And the people who stand with him are the. The heads of the clans from his own tribe, the Levites. And so they then join with him to restore justice. Right. In this situation, which involves killing a whole lot of people and the destruction of the golden calf and the punishment of Aaron and etc. Etc."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4048.54,"end":4049.26,"speaker":"Fr Andrew Stephen Damick","text":"A plague."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4049.82,"end":4094.58,"speaker":"Fr Stephen De Young","text":"Yes. So lots of bad. Yeah. So they bring down upon themselves with this wickedness. So it is at this point explicitly that the priesthood is taken away from the elders of the people and given to the Levites. Right. So not only the high priestly line, right. High priestly family is going to be there within one of the clans, but the priestly clans are going to be part of the tribe of Levi, and the rest of the Levites are going to have these priestly roles. Right. In relationship to the other tribes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4094.9,"end":4102.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah. As I say, before we move on to the next thing, we actually do have someone calling."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4103.14,"end":4103.7,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4103.7,"end":4113.62,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, in fact, he has the very best possible name. So, Andrew, are you there? Are we connected with Andrew?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4114.27,"end":4116.83,"speaker":"Fr Stephen De Young","text":"You can call us on the line. You can call us anytime."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4120.75,"end":4123.23,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I'm not hearing Andrew, but."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4125.39,"end":4126.83,"speaker":"Fr Stephen De Young","text":"He'S probably not even blonde."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4126.83,"end":4134.91,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah, so. All right, well, so Andrew, are you there?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4137.79,"end":4138.67,"speaker":"Fr Stephen De Young","text":"Speak to us."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4138.67,"end":4140.11,"speaker":"Fr Andrew Stephen Damick","text":"I think we might have lost him."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4140.45,"end":4141.33,"speaker":"Fr Stephen De Young","text":"Who did this to you?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4141.65,"end":4154.53,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, Andrew, if you're there, you know, give us a call back and hopefully we'll get reconnected and we can. We can talk to you. So. Okay, well, all right, well, let's. Let's talk about the Sons of."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4154.85,"end":4155.81,"speaker":"Fr Stephen De Young","text":"Back to it then."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4155.81,"end":4158.53,"speaker":"Fr Andrew Stephen Damick","text":"Wait, wait. Andrew, are you there now? Are you there now, Andrew?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4159.33,"end":4160.85,"speaker":"Unregistered: Andrew","text":"I'm there now. Can you all hear me?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4161.17,"end":4169.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome. Welcome to the Lord of Spirits podcast. Andrew, what is your question or your comment with that glorious name that you have?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4171.5,"end":4191.34,"speaker":"Unregistered: Andrew","text":"Yeah, my. My question kind of goes back to what you were talking about earlier with the priesthood being the kind of archetype of God given masculinity. I was just wondering what are some of the bigger challenges that you two face and kind of manifesting that in a world where Masculinity can be seen in negative light and in some cases, a borderline pejorative."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4192.86,"end":4301.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a good question. I mean, I've thought about this a lot, especially because, you know, I'm not only a priest of the church, but I'm also a father of four children and married, you know, and so I remember one of the things that my own spiritual father told me one time is he said that a priest's ability to minister the grace for that comes from within his life at home. Right Now, I mean, it's not making a. You know, the point that he was making was not to say like, that there's some kind of mystical force that makes that happen or whatever, but. But rather that, you know, exactly this point that, that Father Stephen said earlier, which, you know, St. Paul said, which is, you know, if a man cannot be a priest within his own family, then how can he offer that to the church? Right. And I've experienced this myself, you know, as a struggle. And it's. And it's always, I think one of the big struggles that fathers and husbands have is, you know, we get home, we've worked hard, and we just want to sit down and just chill out and, you know, please don't ask me to do anything. Right. You know, everybody feels that way at the end of a work day. And yet the reality is that man is supposed to be leading his family, among other things, in prayer, especially if someone's an ordained priest. Like, look, I pray all the time as part of my job. Do I have to? You have the feeling, right? It's this temptation, but I've found that it's one of the most beautiful things within a family. And it's not easy, it's really important to struggle in that direction."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4301.35,"end":4301.51,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4302.06,"end":4310.46,"speaker":"Fr Andrew Stephen Damick","text":"But it's true what my spiritual father said, that there is a grace that comes from within that, that empowers the ministry in general."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4311.26,"end":4311.66,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4311.74,"end":4429.83,"speaker":"Fr Andrew Stephen Damick","text":"So if things are not in order at home, especially in terms of that man suffering and sacrificing and leading his family in prayer, then he's not going to be able to do it well outside of the home. Right. And you mentioned also, as I said, I have a lot of opinions about this. You mentioned also this idea that masculinity has become almost kind of like a dirty word in the modern age. And I think part of it is because of the way that a lot of people have attempted to exercise masculinity, which is exactly in this kind of paganized fashion, where it's about dominating people Right. You know, and. And the truth, I always tell people, it's so funny. There is this whole sort of thing that people talk about online, trying to kind of reassert, quote, unquote, manliness. Right. And I've seen a lot of people talk about this who are not husbands or fathers and have never really suffered or sacrificed in their lives. And I'm like, you know, it's okay to talk about this stuff, but you really don't know what you're talking about. Because real masculinity is about sacrificing oneself and becoming that conduit, and it's not always comfortable. Not even usually comfortable. Right. It is about sacrificing for the people that God has given to you, and that's what makes a man a man. Right. It's not about, you know, being dominating or assertive or any of that kind of stuff. It's really about being willing to sacrifice. So that's. That's my experience with that. And another. Another senior priest that told me something really good was he said, you need to get control of yourself, and then that will stabilize your family and your community. Very, very wise words. Very, very wise words. So, I don't know. Father Stephen, do you have anything you wanted to add to any of that?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4431.03,"end":4438.57,"speaker":"Fr Stephen De Young","text":"Well, I mean, being super rugged and brawny, it just kind of comes naturally to me. Me. But no."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4440.33,"end":4443.93,"speaker":"Fr Andrew Stephen Damick","text":"No, Father Stephen is not a small dude. I'll just say that. Everybody."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4444.01,"end":4447.21,"speaker":"Fr Stephen De Young","text":"But no, part of the."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4447.45,"end":4447.85,"speaker":"Announcer","text":"The."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4448.17,"end":4470.9,"speaker":"Fr Stephen De Young","text":"Part of the. The issue, I think, is that a lot of the stuff about, like, how do I be a man, how do I be masculine that we have in the modern age, like, I understand why people feel that way. Right? Yeah. But a lot of the way it plays out is in sort of this really neurotic way of I want other people to see me as a man."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4471.22,"end":4471.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4471.86,"end":4518.4,"speaker":"Fr Stephen De Young","text":"I want other people to look at me in a certain way. Right. And I need to try to figure out how to reshape my body or say the right things or grow the right beard or whatever so that people will see me that way as being manly or being masculine and coming off as sort of neurotic and insecure about your masculinity is, like, the least manly thing in the world. So it's sort of this badly reflexive thing so that people don't see you that way. So then you get even more insecure. Right. And, like, you get this, like, death struggle with your own ego. Yeah. And the problem is right there at the beginning, where you're wanting people to look at you and see you."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4520.24,"end":4520.64,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4521.52,"end":4538.48,"speaker":"Fr Stephen De Young","text":"As we were talking about this is about, in a large way, about transparency and about getting out of the way. Right. So you said, what kind of obstacles do we face? My biggest obstacle always has been and I think always will be my own ego. Right. My own sense of myself."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4539.77,"end":4540.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4540.41,"end":4639.83,"speaker":"Fr Stephen De Young","text":"Getting in the way. Because I kind of want to be in the way. I kind of don't want to get out of the way. Right. Like, you know, you can performatively going around, go around acting like you don't care what people think, but that's a sure sign that you care what people think. Right. Your ego could just trap you that way. I think, on a. On a practical level. Right. One of the things about being a man that's been totally lost in our world, and I think this is in part because as we were talking about, the sort of idea of the nuclear family has replaced a lot of much better ideas, like of the extended family and of the village. Right. And of the community. That, for example, one of the really masculine things you could do that falls into this priesthood example is, is provide for people. And I don't mean by that, right. You need to make a lot of money and provide for, you know, put designer shoes on your kids and jewelry on your wife. Right. That's not what I mean. What I mean is, for example, helping another man in your community get a job, giving him a job, being a mentor to a younger man, teaching somebody a skill. Right. Where it's not about you, it's about them and getting them connected to something. Right. Helping them grow into the man that they can be. Right. Rather than focusing on yourself. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4640.71,"end":4644.71,"speaker":"Unregistered: Andrew","text":"And sacrificing yourself for the community."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4645.19,"end":4684.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Right, yeah. We need to get past the idea that identity is about what separates me from everyone else. Identity is who I am in my family, who I am in my community. Right. That's who I am. Right. So I don't have an identity off by myself as an individual. Right. It's how I relate and how I interface and doing that in this priestly way. Right. Is. Is. Is what takes care of that masculinity and manliness thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4686.74,"end":4688.18,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, Andrew?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4689.22,"end":4690.54,"speaker":"Fr Stephen De Young","text":"It does, yeah. All this."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4690.54,"end":4726.63,"speaker":"Unregistered: Andrew","text":"All really, really great stuff. And it's just, you know, I kind of. I thought that I was kind of. You were going along is that, you know, you know, even whether. Whether or not, you know, like you said, there's kind of. There's priests in the church and then there's kind of the general, you Know, everyone is called to the, you know, to the kind of, I guess, lowercase P priesthood that, like you said, offers God to the world and the world to God. And. But I think, you know, part of that is in order to do that, you have to be in the world and interact with the world. And that's just. Just curious as to, you know, what your challenges were and how you guys have. Have been able to manifest that and struggle through that."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4727.27,"end":4741.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. I would agree with Father Stephen that my biggest obstacle is his ego. No, it's my ego. And I think that that's. I mean, I think that's true for all of us. Right. Humility is the thing we're struggling towards."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4741.8,"end":4744.36,"speaker":"Fr Stephen De Young","text":"My ego is bigger than his and wields a club."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4749,"end":4752.44,"speaker":"Fr Andrew Stephen Damick","text":"So there we are. All right, well, thank you very much, Andrew, for that call."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4753.72,"end":4755.29,"speaker":"Unregistered: Andrew","text":"Yeah, thank you, gentlemen, very much."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4755.76,"end":4761.04,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right. Okay. Well, let's talk about the sons of Korah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4761.44,"end":4806.5,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. So we want to talk about the sons of Korah in order to disambiguate something, right? And that's that when we've been talking about the restriction of the priesthood, right. It going from. To being reserved in the Old Covenant, in the Sinai Covenant, to this particular group of people, there's been a lot of violence involved, right? So one could almost say that they've sort of seized the priesthood by violence, Right. If one wanted to take that read. Right. But we have an episode here in the Torah where someone tries to sort of seize the priesthood by violence. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4806.5,"end":4806.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4808.34,"end":4859.5,"speaker":"Fr Stephen De Young","text":"To show that that's not what this is about. Right? That's not what this is about. That this is about faithfulness and faithlessness. Right. And those who are faithless, you know, those who have little, even what they have is taken away, right? Those who have been faithless with a little is taken away from them and given to those who are faithful. And so that episode that sort of disambiguates this is in numbers 16. It is a story of, as you mentioned, Korah's rebellion. Korah and a couple other clan heads within the Levites decide that Aaron should be the one who gets to be the priest and his sons. It should be Korah, and they should be able to be high priests, too."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4861.5,"end":4861.9,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4863.97,"end":4880.05,"speaker":"Fr Stephen De Young","text":"The way he expresses this in the text is rather literally, is not everyone in Israel holy? Each and every one of us, are we not holy? And therefore, why should you be a priest and set yourself above the rest of us? Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4880.05,"end":4881.73,"speaker":"Fr Andrew Stephen Damick","text":"That's verse three of Numbers 16."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4882.21,"end":4899.94,"speaker":"Fr Stephen De Young","text":"I will leave it to you if that sounds like anyone you may know. Anyway, but. So Korah makes this argument. And what Korah is really arguing, though, at the core, is that God did not make Aaron the high priest, that Aaron is lying. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4899.94,"end":4901.7,"speaker":"Fr Andrew Stephen Damick","text":"That he set himself up as the high priest."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4901.7,"end":4932.67,"speaker":"Fr Stephen De Young","text":"God did not put Moses and Aaron in these positions, but they're just lying and saying that they put themselves in those positions. And so this sort of. It's not really a test. This sort of thing is set up where they're all going to gather with sensors. And then there's. There's kind of a telegraphic of what's about to happen because they send messengers to all the people who are near the tents of Korra and the other rebels to kind of back away slowly. Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4932.67,"end":4933.07,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4935.63,"end":4977.98,"speaker":"Fr Stephen De Young","text":"Then what happens is the ground ends up opening up, and Korah and his fellows go down alive into Sheol. They go down alive into Hades. And as someone said after a lecture I gave on Tuesday night where I also talked about Korah's rebellion, he pulled a reverse Elijah by going down alive into Sheol. But so it is not a question of sort of the priesthood being something seized by violence. It isn't like becoming captain of a Klingon ship where you assassinate the old captain and now you're in charge. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4977.98,"end":4980.38,"speaker":"Fr Andrew Stephen Damick","text":"And that's the way things work on a Klingon vessel."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":4982.7,"end":5016.82,"speaker":"Fr Stephen De Young","text":"And you don't have to eat gah. Though, either. So that's good. But that. It's about this function of justice, right? Remember, justice is everything being in the right order, Right. This ordering function of the priesthood, right? And so the Levites, Phinehas, right? They help restore order, right? They perform that ordering function. And that's why the priesthood is given to them, because they're acting as priests, Right. And Korah is doing the opposite."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5018.18,"end":5018.5,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5018.5,"end":5035.18,"speaker":"Fr Stephen De Young","text":"Yeah, he's doing the opposite of that, which is why he not only loses his Levitical status, but his life. So he has some sons who survive and write some psalms. But that's for another episode, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5035.18,"end":5056.25,"speaker":"Fr Andrew Stephen Damick","text":"The Psalms of the Son of Korah. Sons of Korah. Yeah, yeah, yeah, yeah. If you read. Yeah. Just as a note, you know, like, if you guys. If you read the Psalter, you'll sometimes see at the beginning, it'll say something like, you know, for the chief musician or, you know, for the sons of Korah. And there it is. So, like, the sons of Korah are like a. A chanting group, basically, you know, later on, right? As you said."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5056.25,"end":5067.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. It's 11 Psalms between 42 and 88 or 41 and 87, depending on whether you're using the Hebrew or Greek numbering."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5067.69,"end":5068.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5070.09,"end":5134.03,"speaker":"Fr Stephen De Young","text":"But so this creates the situation then, where we have the high priest, right, which is this particular family, Aaron's family, and then particularly Phinehas's branch, and then particularly Zadok's branch. And then we have priestly clans within the Levites, who the priests come from. So this is a bigger structure surrounding that. And then we have the other Levites who are sort of in supporting roles. We'll talk more about them later. Right, Right. Who are doing sort of all the other tasks to assist. Right. That are required in this. Both the Levite men and the Levite women are doing some of those tasks. Right. And so you could picture this as sort of concentric circles, right. Where you've got the inner circle would be the high priesthood, then the priesthood around that, and then the tribe of Levi around that. Right. In these concentric circles."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5135.17,"end":5135.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5136.05,"end":5163.03,"speaker":"Fr Stephen De Young","text":"And so one important note here, and this is related to when the high priesthood is established. The high priesthood is established with. When you read the Torah, it's described a couple of times in great detail, particular vestments. Right. Not just a particular role, but he presents himself, he appears in a certain way both before God and before the people."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5163.43,"end":5186.63,"speaker":"Fr Andrew Stephen Damick","text":"And this is command. I mean, you know, it should go without saying, but this is commanded by God. Like, he's not like, oh, I have an idea, I'll make myself look fantastic with super fancy vestments. God says, no, this is what you're going to wear. It's going to look like this. I mean, there's a lot of very specific liturgical instructions in the Old Testament, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5186.92,"end":5303.54,"speaker":"Fr Stephen De Young","text":"Yeah. Including the name of Yahweh written on a plate on the front of his. His sort of headdress. But this is because. Right. This is in service of making him into. Once he puts these vestments on, he is now not Aaron or Eliezer or Phineas or whoever. Right. Once he has these vestments on, he is now the icon of Yahweh, the God of Israel. Right. And he is to perform this imaging function. Right. And so part of the vestments is reducing, minimizing, losing the individuality of the person. Right. Part of that transparency, that serving as a conduit. And interestingly, a part of that. Right. Is that the way in which these vestments are described, when we compare this to other things in the ancient near east, they're described as the vestments in the same way as the vestments that were put on idols in pagan Temples. The priests in those pagan temples would come and dress the idols and feed them and all of those things. Right. And care for them, Kathy Bates style. And. Wow. And so. And so Aaron is dressed the way they were to. Again, this is going back to Adam. Right. The tabernacle is going to have not just the cherubim, but also especially prominent in the temple. Right. Trees, fruit trees. Right. These are reconstructions of paradise. And so the high priest is then in there taking the place of Adam."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5304.1,"end":5304.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5304.9,"end":5331.68,"speaker":"Fr Stephen De Young","text":"In paradise. Right. As. As the image, the imager of God. Right, right. And another part of those vestments is in the ephod, that sort of breastplate. He's got the. The stones, the precious stones with the names of the twelve tribes. Because when he goes and he comes before God, he's bringing the people before God with him."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5332,"end":5335.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. This is this basic priestly function."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5335.76,"end":5358.67,"speaker":"Fr Stephen De Young","text":"Right. So the imaging is working both ways. Right. And that's built into these vestments. Right. And there are other things that are inverted about this. Right. We just mentioned not only did they dress the idol of the God, but they'd also come and feed the God. And we have the table with the showbread, often spelled with an e, but it's still pronounced showbread."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5359.71,"end":5360.95,"speaker":"Fr Andrew Stephen Damick","text":"The shoe bread."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5360.95,"end":5380.63,"speaker":"Fr Stephen De Young","text":"Yeah, you want to say shoe bread, but that's not what it is. It's showbread. It's really the bread of the presence in the original. Right. And that bread is not brought there by the priests to feed to the God of Israel, but that bread is there on this table in the tabernacle for the priests to eat during their service."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5381.19,"end":5398.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the table itself, like, actually, I was just looking at this in scripture recently. Like, the table itself is a. Is, like, covered in gold. And I mean, it's really something. It's not just some little, you know, buffet table. Yeah, yeah, yeah, yeah. It's really, really something."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5399.03,"end":5406.27,"speaker":"Fr Stephen De Young","text":"Right. Because this is God's table, and he is feeding his priests. So it's directly inverted."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5406.59,"end":5407.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5407.31,"end":5410.51,"speaker":"Fr Stephen De Young","text":"He's the host. He feeds the priest, feeds Israel."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5410.91,"end":5432.34,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. That. The priests are there in Persona Israel. I don't know how you would work that out in Latin, but you get the idea. So. All right, well, before we move on to the next point, we actually do have another caller. So. Kavya, are you there? Yes, I am. Welcome to the Lord of Spirits podcast. Kavya, what's on your mind? Thank you."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5432.34,"end":5437.86,"speaker":"Fr Stephen De Young","text":"So I actually have the reverse of Andrew's question earlier about priesthood and gender."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5438.42,"end":5440.74,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, you talked about what."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5440.74,"end":5446.74,"speaker":"Fr Stephen De Young","text":"Can be done to sort of image priesthood in a masculine sense. I'm thinking about the feminine sense as well."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5446.9,"end":5448.14,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, for those of us."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5448.14,"end":5451.38,"speaker":"Fr Stephen De Young","text":"Who are not literal mothers or nuns."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5451.86,"end":5457.22,"speaker":"Unregistered: Andrew","text":"What is spiritual motherhood like? What does it mean to bring life into the world?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5457.95,"end":5462.11,"speaker":"Fr Andrew Stephen Damick","text":"Hmm, that's a good question. Father Steve, I'm gonna let you go first on this one."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5464.03,"end":5464.67,"speaker":"Fr Stephen De Young","text":"Punt."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5465.95,"end":5467.43,"speaker":"Fr Andrew Stephen Damick","text":"So I'm not punting."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5467.43,"end":5478.79,"speaker":"Fr Stephen De Young","text":"I have things I could say. I think you're punting, you're trying to think of something. But I'll give you some time here. Don't worry. Fine, I'll cover for you. All right, thanks. I'm gonna go make some coffee."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5478.79,"end":5479.47,"speaker":"Fr Andrew Stephen Damick","text":"I'll be right back."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5479.47,"end":5510.75,"speaker":"Fr Stephen De Young","text":"Right, Right. So. Well, so first of all, first of all, it's a. Important that we talk about that participation, right? That participation element, right? So part of it is. Now this is going to be more like, for example, an obvious example is for someone who is a literal mother. Obviously, parenting should not be each parent performing different functions, right? Like they should be participating together."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5513.15,"end":5513.55,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5514.35,"end":5811.09,"speaker":"Fr Stephen De Young","text":"But also this takes place in the. Again, in the community setting. The same thing applies that I was saying in terms of breaking out of this idea of individ individuality as being the source of. Of identity as opposed to community, right? So when we're talking about bringing life into the world, we're talking about doing this in. In communal settings, right? So if you live by yourself, right, you could kind of do that into your home for yourself. But also you're going to be involved in the parish community, right? And so in the same way that I was saying, masculinity can in part be worked out in providing, right? This also is true on the other side for femininity. And I'm not only talking about feeding people, but this does include feeding people, right? This does include sharing, you know, things you make with your hands, whether that be food, whether that be other things, the work of your hand with people. This includes mentoring young women, right? Serving as a spiritual mother in that way, teaching skills, that same kind of thing, right? You can have. Just because you don't have the title mother, because you're not an abbess, right? Doesn't mean you can't be a spiritual mother to other women. And it certainly doesn't mean you can't be a spiritual daughter. And it certainly doesn't mean you can't support the men who are in your life and your priest in the ministry. In the parish. There are always, trust me, as a priest, there are always thousands of things that need to be done in a parish and two or three people who want to do them. So there are all kinds of ways to contribute, right? And so this is. This is something I said on Jonathan Pageau's channel once that I think a lot of people misunderstood, or at least I hope they did, because they called me a heretic. But he asked whether cities have souls, and I said yes. And I think that's what freaked people out. But the word soul, especially in Hebrew, just means life, right? So each of us has life right within us, right? But also communities, families, and extended families. So communities like parishes, right? And communities like cities have a shared life. And that shared life is not just the sum of the parts of the lives of the individual people, right? And so on one hand, if we're talking about on the masculine side, that life can either be in good order or not, right? In the same way, that can be an environment which is affirming to life, that brings forth more life, that encourages life, the abundant life that Christ was talking about, meaning the joy, the love, the peace that comes from God. Or communities could be very ugly. They could become communities more characterized by death, right? And despondency rather than joy and bitterness and hatred rather than love, right? And so part of being a spiritual mother within a community is being the conduit through which that love and joy and peace and caring and life come into that community as a whole. Right? And there are lots of ways to do that. That practical sharing element is a practical way to do that. The mentoring, organize, organizing of things, right? Of activities and of everything else. All of. All of those things are going to bring more life into the community and make it a place. Place that is characterized by life and love and joy, right? And that's what you can play a part in doing, right? Again, it doesn't have to be to a nuclear family. In fact, the nuclear family would kind of have to get out of the way, right? It has to be bigger than that. That's too small. It has to be bigger than that, right? And so while, yes, you. You kind of have to be married and probably have at least one kid to technically have a nuclear family. If we take nuclear family off the table, then that's not required for you to, in the various levels of community in which you live, be someone who brings life and love and joy to each of those communities."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5812.69,"end":5813.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5813.41,"end":5815.53,"speaker":"Fr Stephen De Young","text":"So that gave you a few minutes. What you got, Father Andrew?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5815.53,"end":5816.17,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5816.17,"end":5817.73,"speaker":"Fr Stephen De Young","text":"Oh, hey, hey, everybody."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5820.69,"end":5992.15,"speaker":"Fr Andrew Stephen Damick","text":"No, well, I mean, number one, that was lovely, Father, But. But the other thing I would. I would add a little bit that I would add is, you know, I think that especially if we, as we look at the way that God created Adam and Eve and their particular emphases, right. As Father Stephen said earlier in the show, they sort of major in one thing or another, right. That Adam, his job is mainly to do this work of subduing, which is like a cultivating and building, and that Eve's job is mainly to, you know, to be fruitful, to multiply, to bring life. Right. I think that that meditating on that. And again, it's because that these things serve the salvation of these people, not because God is just assigning some kind of random task, you know, so. But so within that, then I would also add especially that there's a really an internal aspect as well, right. Like I mentioned, you know, this advice that I was given. Control of yourself. Now, the way that men and women get control of themselves is different because that our temptations tend to be different, right? But I think that that's one of the best things that can also be done is to stabilize oneself because we're all unstable in one way or another. And whenever we feed our. Whenever we feed our temptations, we become more unstable. Right. And so that would be the thing that I would add is also to work on that internal life as well and think about the way that bringing life into your own life, you know, how it can be focused on that rather than on death, frankly, you know, the opposite. That that is a way to serve all the things that Father was just talking about as well, you know, and to make sure that it's filled with prayer and with devotion to God and, you know, all of that, Right. And like I said, men and women struggle towards that differently. I'm not a woman. I've never been a woman. I cannot be a woman. So I don't know exactly what that is like. I can only tell you what I've seen. And, you know, it is different that I do know, you know, that men and women simply struggle differently. But one of the best ways, I think, to struggle well is to find that experienced person within your own parish, family, or maybe a godmother or someone like that who knows what they're doing and connect with them and be mentored by them as well, Right. This is a faith that we pass from one person to the next. And the way that we do it best is by the experienced person giving it to the less experienced person. Right? So that's what I would add to all of that. Does that help you at All Kavya."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5993.1,"end":5994.14,"speaker":"Unregistered: Andrew","text":"That is enormously helpful."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5994.14,"end":5997.9,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much. Thank God. Thank God. Well, thanks for calling this evening."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5998.7,"end":5999.3,"speaker":"Fr Stephen De Young","text":"Absolutely."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":5999.3,"end":6001.34,"speaker":"Fr Andrew Stephen Damick","text":"Thank you both. Alrighty."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6001.42,"end":6011.82,"speaker":"Fr Stephen De Young","text":"We. We really need to push this nuclear family thing off the board. You can make a lot of people."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6011.82,"end":6012.78,"speaker":"Fr Andrew Stephen Damick","text":"Mad with that, Father."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6012.86,"end":6013.9,"speaker":"Fr Stephen De Young","text":"I don't. I don't care."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6014.78,"end":6019.26,"speaker":"Fr Andrew Stephen Damick","text":"And we should say we're not trying to. Like, it's not about destroying the nuclear family."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6019.42,"end":6020.05,"speaker":"Fr Stephen De Young","text":"No. It's."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6020.36,"end":6020.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6020.68,"end":6022.28,"speaker":"Fr Stephen De Young","text":"Conceptually, it's too small."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6022.76,"end":6027.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's about not idolizing and isolating it."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6027.64,"end":6051.63,"speaker":"Fr Stephen De Young","text":"Right. So this is. And this is. And I understand why people are so devoted to it. Right. Because here's what's happened. Here's what's happened. What Modernism, one of the many horrible things it's done to us. Right. Is we are now in a situation where we are so alienated from everything and everyone that the only refuge we have left is the nuclear family."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6052.03,"end":6052.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6052.75,"end":6087.16,"speaker":"Fr Stephen De Young","text":"In our current society. Right. So I understand why everybody's devoted to it and why be. Talking about this will get people. Might get people mad. But understand what I'm saying. I'm not saying we need to get rid of it and have everyone just be this isolated, completely alienated person out in the world. Right. The problem with having it as the last refuge, though, is that now. So here's how people feel. I have two options. I could either get into a nuclear family by finding someone to marry and trying to have a kid, or I'm going to be single, I'm going to."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6087.16,"end":6089.36,"speaker":"Fr Andrew Stephen Damick","text":"Be alone, and this is a huge issue."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6089.68,"end":6099.6,"speaker":"Fr Stephen De Young","text":"Isolated. Those are the only two options. Right. And that's ridiculous. Those have never been the only two options. Right. That's what we've been reduced to."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6100.67,"end":6100.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6101.55,"end":6133.16,"speaker":"Fr Stephen De Young","text":"And so we need to think bigger than that. No one is single. No one is. You feel alienated, and you've been alienated by everything in our society and our culture and our economy and everything else. Right. But that's not the way it should be. And that shouldn't be what we're doing as a church community. We should be reintegrating with each other and with God. That is the number one thing the church is doing. That's what the Eucharist is all about, bringing us into communion and deeper communion with one another and with God."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6133.24,"end":6174.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think this is one of the things that's so beautiful about monasticism, is it's simply enacting that within the context of celibacy for that community. But I mean, if you look at the way that an abbot functions or an abbess functions within their monastery. And the way it is called a brotherhood or a sisterhood for a reason, like, it's not just a word, you know, like, that's what happens is it becomes. It becomes a reconstitution of an extended family. You know, And I think that's one of the things that one of the reasons why monasticism is valuable to us who are not monastics is it demonstrates how to do that as a community who are not necessarily bound together with the ties of blood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6175.87,"end":6176.75,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6176.75,"end":6177.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6177.11,"end":6181.66,"speaker":"Fr Stephen De Young","text":"And even in parishes in the church, everyone in the New Testament is called brethren."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6182.38,"end":6182.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6183.1,"end":6196.38,"speaker":"Fr Stephen De Young","text":"It's not just brothers and sisters in Christ. That's not just a nice way of talking about each other. That should be real. We are an extended kinship unit. Right, Right. The other adults in your parish are your kids, aunts and uncles."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6197.02,"end":6197.58,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6198.54,"end":6204.3,"speaker":"Fr Stephen De Young","text":"Whether they're related to you by blood or not. Right. Big family. Anyway, end of. All."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6204.3,"end":6206.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. It was a good rant, though."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6206.66,"end":6223.3,"speaker":"Fr Stephen De Young","text":"This is a beautiful. Yeah. But you know what's going to happen? You know what's going to happen now? Somewhere on Reddit and somewhere on Twitter, somebody's going to say, de Jong wants to destroy the nuclear family. And I will read those posts and laugh heartily. I enjoy being flamed."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6223.54,"end":6225.38,"speaker":"Fr Andrew Stephen Damick","text":"Exercising the nuclear option."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6225.62,"end":6226.1,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6227.86,"end":6262.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, so, okay, so one of the things that we see in. In the Old Testament, actually, some people don't know this is in the Old Testament, is this idea that Israel is supposed to be a kingdom of priests. So, I mean, does that like. So, okay, Exodus 19, 5 and 6. Right. Now, therefore, if you will indeed obey my voice and keep my covenant, you shall be my treasured possession among all peoples, for all the earth is mine, and you shall be to me a kingdom of priests and a holy nation. Doesn't that suggest that Korah and Sons were right? Hey, we're all holy here, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6264.32,"end":6265.92,"speaker":"Fr Stephen De Young","text":"Yeah. I guess we got to rethink this whole thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6269.84,"end":6276.24,"speaker":"Fr Andrew Stephen Damick","text":"The earth did swallow up Korah and Sons and the fire did go out from the Lord and consume them."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6276.64,"end":6339.99,"speaker":"Fr Stephen De Young","text":"It is good countermanding evidence. Yes. So. Right. But this is. And we're gonna see this in Act 3 when we eventually get there. Who knows when that'll be? But it's very common in our time to pit the idea of everyone in the community exercising a kind of priesthood against the idea of there being particular people who are designated as priests. Right. Very commonly, those two ideas are seen as opposed to each other, but here in Exodus, here in the Torah, they're not at all Seen as opposed to each other. Right. They are both true. So how does that work? Right. If they are a kingdom of priests? Well, we talked about those concentric circles in terms of the priesthood as it's laid out in the Torah. Right. You have the high priest family, you have the priestly clan as the circle around that. You have the Levites as the circle around that. Right. And each of those groups is called to a higher level of holiness."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6340.15,"end":6340.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6340.43,"end":6389.5,"speaker":"Fr Stephen De Young","text":"The high priest, his family are called to the highest level of holiness. The priests are called to the next highest level of holiness. Then the Levites, Right. They're the ones who are camped around the tabernacle. Right. Then you go out to the other 11 tribes of Israel. Right. And what this is saying in Exodus 19 about them being a kingdom of priests and a holy nation is that they as a whole represent a priesthood in relation to who. Right. So the. The high priest, the priestly and the Levites are a priesthood for the 11 tribes. Right. The 12 tribes together. Israel as a whole is a priesthood in relation to the 70 nations."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6390.3,"end":6390.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6391.34,"end":6398.2,"speaker":"Fr Stephen De Young","text":"And so this is why we have so many commandments, especially in the Holiness code code. We've Talked about Acts 15 on this show. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6398.36,"end":6398.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6398.8,"end":6400.28,"speaker":"Fr Stephen De Young","text":"I never remember where I talk about."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6401,"end":6404.6,"speaker":"Fr Andrew Stephen Damick","text":"I think so. But it might be good to really focus in on some of the things."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6405.08,"end":6489.63,"speaker":"Fr Stephen De Young","text":"We'll do it real briefly because we have a lot of content still to go through. But this comes up in Acts 15. Right. But if you look at the holiness code in Leviticus, which is roughly Leviticus 17 through 23, people kind of argue, you know, hey, you got to publish journal articles and write dissertations. So people argue about where it ends. Exactly. But something like 17 through 23 or 17 through 24 is referred to as the Holiness code. And in there, almost all of the commandments are directed to the people of Israel. It says, Moses. God says to Moses, tell the sons of Israel no ham sandwiches. Right? Tell the sons of Israel. Tell the sons of Israel. And then there are four commandments in there that are directed, he says, not only tell the sons of Israel, but also all the foreigners who are in the land of Israel, who dwell in the land. Right. Even though they're not Israelites, they haven't been circumcised, they're not eating the Passover, they still have to follow those four. And those four are not at all, coincidentally, exactly, the four things that in Acts 15 are prohibited to Gentile Christians."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6490.03,"end":6490.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6490.75,"end":6609.55,"speaker":"Fr Stephen De Young","text":"Right. And so Acts 15 is taking this very literal reading of Leviticus almost Like they think the law is still in effect. The Torah is still in effect. Go figure. How about that? But the point here being, for our purposes, is that Israel is being held to a higher level of holiness than the other nations are because they serve this priestly function over against the other nations, right? And they are closer in. They're in a closer concentric circle around the place where God is dwelling. And so they must have a higher level of holiness than the Greeks, the Babylonians, the Egyptians, right? Because they're Israel. And so this is why we don't have commandments, right? This is a difference between a lot of forms of Islam and what we find in the Torah, right? Is that the Torah, they're never called, you know, hey, go conquer Moab and make them stop eating pigs, right? And circumcise them all by force, right. It's never, this is the eternal law of God. You must subject the entire world to it. It's explicitly the opposite. It's explicitly, this is for you, because you're this special people with whom God is dwelling. Therefore you are now called to this higher level and it's directed to you and one primary place. This is just one example, but it's a really good example. Where Israel plays this function for the 70 nations is at the feast of tabernacles, as it's Described in numbers 23. We're on the feast of Tabernacles. Every day they give this set of offerings, and all the offerings each day are the same, except for the number of bowls."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6610.42,"end":6623.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. If you read numbers 23, starting from, I think verse 12 or whatever it says, and then offer this many bulls, and then the next day then offer this many bulls. And if you count it all up, it turns out to be 70 bulls total, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6623.62,"end":6638.85,"speaker":"Fr Stephen De Young","text":"One bull for each nation, right. So this is a place where they are making sacrifices to Yahweh, the God of Israel, for the, the other nation, right? They're interceding for the world."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6638.93,"end":6639.89,"speaker":"Fr Andrew Stephen Damick","text":"The world, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6640.05,"end":6690.37,"speaker":"Fr Stephen De Young","text":"As a people together, as a. As a community. So to move through this kind of quickly, right, Just to move us up to the time of Christ, right? Because some stuff happens between Moses and the time of Christ. Meanwhile, things 12 to 1500 years worth of stuff. So what happens, this gets really messy during what's called the Hasmonean period, which is the period described in the books of first and Second Maccabees. Third Maccabees is about Egypt, but First and Second Maccabees and our friend Judas Maccabius, AKA Judah the Hammer, the Hammer. Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6691.41,"end":6695.01,"speaker":"Fr Andrew Stephen Damick","text":"I mean, living in a town called Emmaus, I really appreciate that."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6695.01,"end":6730.62,"speaker":"Fr Stephen De Young","text":"Yes, yes. I don't think I sent out my Hanukkah memes this year anyway. I really want to bring back, as a favor to the Jewish community, at least the English speaking Jewish community that's on the Internet. I have these Hanukkah memes. I want to bring back an awareness of Judah the Hammer. Right. There's too much about candles, too much about gift giving. I want killing elephants and Judah the Hammer. Laying the smack down on Greek people. Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6732.54,"end":6733.58,"speaker":"Fr Andrew Stephen Damick","text":"Pagan Greek people."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6733.58,"end":6742.71,"speaker":"Fr Stephen De Young","text":"Pagan Greek people. It seems to be like every 13 year old Jewish kid in this country would agree with me that that's way cooler. I'm just guessing, I'm not Jewish, but."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6742.71,"end":6744.87,"speaker":"Fr Andrew Stephen Damick","text":"I bet I'm on board with this as well."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6744.87,"end":6767.32,"speaker":"Fr Stephen De Young","text":"So Judah the Hammer comes, right? And he and his brothers re. Establish an independent Judea. Right. They have a revolution. They reestablish independent Judea. They rededicate the temple. That's what the feast of lights, what Hanukkah is all about. And then Judah's brother becomes the high priest."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6768.51,"end":6770.83,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Because why not?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6771.23,"end":6774.43,"speaker":"Fr Stephen De Young","text":"Yeah, right, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6774.83,"end":6779.79,"speaker":"Fr Andrew Stephen Damick","text":"There's not some sort of priestly descent or he's not. Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6779.79,"end":6808.19,"speaker":"Fr Stephen De Young","text":"And so the Hasmoneans, they have. They sort of took the priesthood to the kingship. And then it kind of gets worse because by the time you get to about 150 BC and John Hyrcanus, he makes himself both the king and the high priest at the same time and sort of presents himself as a messianic figure, went and destroyed the Samaritan's temple on Mount Gerizim, which never got rebuilt."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6810.03,"end":6819.95,"speaker":"Fr Andrew Stephen Damick","text":"Which just interesting fun point of fact, the rubble still existed at the time of Christ. And that's what the Samaritan woman was referring to when she said, this is where we worship."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6820.03,"end":6823.5,"speaker":"Fr Stephen De Young","text":"Yeah. That didn't help relations between Judeans and."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6824.3,"end":6827.34,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6828.14,"end":6895.78,"speaker":"Fr Stephen De Young","text":"So and then it's. It's sort of. Then that family, the descendants of that family who hold the priesthood at the time of Christ, this is the party that's called the Sadducees in the New Testament who have control of the temple in Jerusalem and its environs and the sacrifices. Sadducee is sort of a Anglicized sort of corruption of Zadokites. So there they called themselves the Zadokites to act as if they were descended from Zadok because they could read. And they saw that that's who the high priests were supposed to be descended From. Right. But they weren't. They just identified as zadokites. They were not actually zadokites. And so they essentially, you know, they're most famous for not believing in the resurrection in the New Testament, but we don't appreciate now the level of true corruption that was there where they had turned the temple into essentially a business venture. It was sort of Jerusalem Temple, Inc. And they did."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6895.78,"end":6897.38,"speaker":"Fr Andrew Stephen Damick","text":"They did a deal with the Romans."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6897.38,"end":6952.16,"speaker":"Fr Stephen De Young","text":"They did a deal with the Romans where they were allowed to collect the temple tax. They were allowed to collect taxes from the people to support and operate the temple. And so what they would do is they would demand extortionate tax rates, and then when people couldn't pay them, they would confiscate people's land to pay the debt. And so by the time of Christ, about 70% of Judean land was owned by the Sadducees, by the high priestly family. Wow. And the people. And then, because they now essentially evicted people from the land that was given them by the Torah to their families, but given to them by God, they had basically evicted them. They would then basically have them come back for slave wages as peasant farmers and work what used to be their own land."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6952.48,"end":6955.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. So basically turn profit into serfs, with."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":6955.82,"end":7011.46,"speaker":"Fr Stephen De Young","text":"The profit from that going back also to the Jerusalem Temple. Right. So thanks. Yeah. It's not just that people were selling, had too expensive prices on their sacrifices. When Jesus comes and cleanses the temple, there was a lot more fiduciary irresponsibility going on at the Jerusalem Temple. Temple by this point. And so this. This is what lies behind a lot of the things that Christ directs toward the temple and the high priesthood. In his preaching, there's some really negative things that sound really unchristlike to us that he says, but this is why, Right. This is what. They are literally oppressing the people. Right. They are supposed to shepherd these people, and instead they're making lamb kebabs of these people."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7011.86,"end":7012.26,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7012.26,"end":7012.58,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7014.18,"end":7015.54,"speaker":"Fr Andrew Stephen Damick","text":"Could use a good jubilee."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7016.1,"end":7016.58,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7017.3,"end":7024.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right, well, that's the second half. We're going to go ahead and take a short break, and we will be right back in a few minutes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7025.22,"end":7041.46,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-852-33-72346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7046.98,"end":7102.07,"speaker":"Fr Stephen De Young","text":"New from Ancient Faith Publishing. God is a man of war. The problem of violence in the Old Testament, written and read by Stephen DeYoung. The God who reveals himself in Scripture may at times seem to conflict with what seems right to us, but the ways of man lead to destruction. By sojourning through this tension, our views of ourselves, our lives, God and his creation are reshaped and reformed in a way that is truly real. Wrestling with Christ as he appears to us in the Bible will yield his blessing only if we allow ourselves to be molded and taught. We cannot approach the Scriptures to find our own personal Jesus who conforms to who we may want or even demand that he be. Such a Jesus probably does not exist and so will avail us nothing. Rather, we must come to know the only Jesus Christ who does exist and through his grace offers to transform us into his likeness. God is a man of war. The Problem of Violence in the Old."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7102.07,"end":7106.03,"speaker":"Unregistered: Andrew","text":"Testament now available as an audiobook@audible.com."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7106.75,"end":7122.84,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7125.72,"end":7162.44,"speaker":"Fr Andrew Stephen Damick","text":"You know, Father, listening to that promo for your for your audiobook, I never really realized that there was that Depeche Mode reference in there before. So your own personal Jesus. Yeah. So welcome back, everybody. So just a note, even though the voice of Steve just told everybody to call in, we're actually not going to take any more calls tonight because we've gone a little bit long and we still have some more to talk about. So you'll just have to hold on to those for next time. So were you just stunned at hearing the promo of your own voice? Father?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7163.32,"end":7164.76,"speaker":"Fr Stephen De Young","text":"I evaded it mostly."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7164.76,"end":7167.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, he's like, wait, no, it's one of those get out, get out."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7167.88,"end":7175.48,"speaker":"Fr Stephen De Young","text":"Yeah, run. So run, you fools. Anyway, yeah, fly, you fools."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7175.48,"end":7215,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. So, okay, so we're continuing to talk about the priesthood as the third half of the show. And where we left it off was with the super oppressive situation of the Sadducees in the time of Christ, who controlled the temple and had set themselves up as being the priestly cast, as it were at that point. So, so what happens then with the coming of Christ? I mean, he comes in and puts the smackdown there in the temple courts, but there's way more actually going on in terms of Christ and the priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7215.08,"end":7379.45,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so, I mean, this even gets back, and we talked about this a little in our Melchizedek episode, but this even gets back into the sort of Messianic expectation that we find playing out in the Second Temple period. Right. And so there are a couple of options. There are sources where there seem to be two Messiahs, sort of a priestly Messiah and a kingly Messiah, where these things are still separate. But often what we see is that, as with Melchizedek, and this is particularly as we talked about in that episode under the influence of Psalm 110 or Psalm 109, where the Lord Messiah is sort of combined with the priesthood of Melchizedek. Right? We see that the idea was that the Messiah was going to bring these things back together, was going to bring the high priesthood and kingship back together and reunite them. And this is related to the whole idea of Christ as the second Adam that's going to play out in St. Paul's epistles and other places. Remember, Adam is priest and king. We saw the high priest is presented again as sort of this new Adam within the paradise of the tabernacle or the temple. And then now also, right. The idea is that that being restored represents a restoration of humanity, a restoration of human nature. All of these ideas are sort of intertwined in what is expected from the Messiah. Right? And so, as you can read at length in Hebrews, Christ is the high priest, sin qua non, because he is the ultimate fulfillment in the sense of filling to, overflowing the role of priesthood. Right? So he represents God to man in that he is the express image of the Father, Right? Right. He is God. Right. And he presents man to God because he is truly and fully human. Right, Right. And our human nature is united to God in his person. Right. And so this makes him, based on the definition of a priest, this makes him the great high priest, Right? Definition."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7380.25,"end":7393.48,"speaker":"Fr Andrew Stephen Damick","text":"I mean, in a sense, a priest, to be a true priest is to be Christ. Right? That. That's what priesthood is aiming at. Is aiming at. At being Christ."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7395.24,"end":7395.6,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7395.6,"end":7396.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7396.36,"end":7473.9,"speaker":"Fr Stephen De Young","text":"And so we see that in the church, right. This Christ as high priest imagery surrounds the bishop, Right? Right, right. The icon of Christ, the great high priest, is on the bishop's throne, Right. And his vestments match what Christ is wearing in that, Right. And are roughly parallel to the high priest of the Old Testament. But the idea here is that because we now have the fulfillment of this in Christ, the bishop, now the person who has the roughly equivalent role of the high priest in the Old Covenant is now the icon of Christ. Right? Is the icon of Christ in our. In our midst. And so this reunion doesn't stop with Christ reuniting The priesthood that was split in Moses and Aaron between kingship and priesthood, right? But it continues, right? It continues all the way down. Because Christ doesn't just restore some offices or some roles or some particular historical persons. He restores humanity, right, with what was."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7473.9,"end":7476.58,"speaker":"Fr Andrew Stephen Damick","text":"Created to be by God from the beginning."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7477.22,"end":7507.81,"speaker":"Fr Stephen De Young","text":"And so this has a chain reaction, right? And so this also reunites priest and elder of the people, right? The two words, right, in Greek areas from the old, that's used in the Old Testament for priests. And presbyter, presbyteros, that's used of the elders of the people, right, who had the priesthood taken away at the golden calf."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7508.05,"end":7508.45,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7508.45,"end":7532.88,"speaker":"Fr Stephen De Young","text":"Now that has been reunited for them as well. Right, right. And so the. The presbyter, right, in the new covenant now has this priestly iconic function. Right? And that's why priest and presbyter are related in English."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7533.2,"end":7534.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7534.24,"end":7536.8,"speaker":"Fr Stephen De Young","text":"To Father Andrew, thank you very much for that."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7537.68,"end":7724.96,"speaker":"Fr Andrew Stephen Damick","text":"For that punt for me. Yeah, yeah, yeah. So, I mean, okay, again, little disclaimer. Etymology is not what determines meaning, but it can tell us a lot about how words have been used in the past. So priest and presbyter in English are both descended from the Greek presviteros. And what they represent in terms of the etymology is that English borrowed the same word at two different points in its history. The first time we get it. So priest comes in Old English, it's preost. And that actually comes from having borrowed that word from Greek through Latin into Old Germanic, and then it makes its way into Old English and into modern English. So that's where we get preuss and then priest, which then gets commonly used to refer to both Christian priests and also pagan priests, right? But by the time it gets used in Old English, it's being used to refer to Christian priests, right? That's. That. That's just the way it's used. And then later, the same word gets borrowed again, but more directly in, I think via French, maybe because of those Normans, man, Normans. But. And then it comes in as presbyter, you know, so it sounds a little bit more obviously from pres. Viteros, right? Presbyteris or some. Or I'm not sure how to pronounce it in Latin. And. And then that gets used to very exclusively to refer to Christian clergy. So the fun thing is now, I mean, most languages don't have this, right? But English, what's fun about English is it often does borrow the same word at multiple times in history, and then we get different forms of it. So the fun thing about the way that English has those two words, presbyter and priest, is that it just shows the union. The union, you know, as you said, the reunion of, of priesthood to eldership. It just sort of illustrates it because of this linguistic history. So, you know, understood correctly, they really are synonyms. Right now we do tend to use the modern English word priest to translate that Greek word erefs and then presbyter, which is basically almost a transliteration of presbyteros. And that's okay, but we should at least know that they both ultimately come from that word. Presvitaros is where it kind of comes in English. So it's just one of the fun things about the history of English that illustrates this point about priesthood being restored to presbytery, so to speak, by Christ. You know, that priesthood comes back into eldership. So that's what an elder is within the church is they are a priest by virtue of this. So that's your. Well, I'm not going to say that's your only etymology lesson for today, everybody, but that's one of your etymology lessons for today. So, yeah, it's just, I don't know, it's a cool feature of English. It just illustrates this really beautifully."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7725.12,"end":7732.32,"speaker":"Fr Stephen De Young","text":"We need to make Father Andrew's etymology corner should be like theme music. Yeah, a little bit of music at the beginning."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7737.12,"end":7739.75,"speaker":"Fr Andrew Stephen Damick","text":"I'll think about a title for that. That'd be good. Yes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7741.35,"end":7745.51,"speaker":"Fr Stephen De Young","text":"So angles on etymology. Anyway."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7747.75,"end":7749.87,"speaker":"Fr Andrew Stephen Damick","text":"So that's a very good pun, by the way."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7749.87,"end":7751.11,"speaker":"Fr Stephen De Young","text":"That's good. Thank you. Thank you."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7751.11,"end":7755.67,"speaker":"Fr Andrew Stephen Damick","text":"Non angli said Angeli the."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7756.95,"end":7805.54,"speaker":"Fr Stephen De Young","text":"And so we also see play out, right, we see this play out in the Book of Acts, right, that there's also this need, right. For in the New Testament priesthood there's a lot of work to be done. There are a lot of support functions in the same way there were with the Levites in the Old Covenant supporting the priesthood. And so we see deacons show up in the Book of Acts and then they get talked about later in St. Paul's Pastoral Epistles. And this becomes sort of a catch all category for a whole bunch of offices in the early church. When you look at the early church orders from the late first and early second centuries of deacons and deaconesses and sub deacons and doorkeepers and exorcists."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7805.86,"end":7868.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because the akanos just means servant, right? Yeah. In a server, in a broad sense. And it's interesting, like that sense of deacon being a kind of catch all that refers to multiple different roles. It still exists like in the Coptic churches. And the Syriac churches and those influenced by them. I've heard them refer to reader deacons and sub deacons. And, you know, and then they'll use the phrase full deacon to refer to what is generally, in English anyways, called a deacon. Although, like in. In Arabic, you've got shamas al nur, which means deacon of the light, which is a subdeacon. And then you got shamas alanjil, which is a deacon of the gospel, which is the role that we normally call a deacon in English. So it's interesting. It has that broad, broad sense. Very much like the Levites had all these different kinds of roles. And that's a lot of people. I mean, the Levites are not just a group of men. It's all of them and their families. It's a whole tribe are the Levites."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7868.68,"end":7870,"speaker":"Fr Stephen De Young","text":"It's a whole mishpaka."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7870.56,"end":7871.84,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I don't know that word."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7873.36,"end":7897.31,"speaker":"Fr Stephen De Young","text":"It's a Yiddish pronunciation of a Hebrew word. Okay, but so. And just to save everybody a PS on the angry letter, you're writing about me blowing up the nuclear family, because since I said the word deaconess. Right, right. Yes. Deaconesses in the early church were not women who were made deacons. Deaconess was its own thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7897.47,"end":7898.59,"speaker":"Fr Andrew Stephen Damick","text":"It's a separate thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7898.59,"end":7983.35,"speaker":"Fr Stephen De Young","text":"Yeah, it's its own thing that men could not do. It was its own thing. And that. But that is. That is parallel when you think about it, because the Levites, when we're talking about the Levites, we're not just talking about the male Levites. Right. There were female Levites, including a group of women who dwelt at the gates of the tabernacle. Right. Who did things like sewing and mending vestments and parts of the tabernacle and assisting with all kinds of things. Right. So there were female assistants who had their own duties in the Old Covenant, and that continues in the New Covenant. There's this continuity, but so we have these structures that emerge within the New Testament that are parallel to the similar structures in the Old Covenant. Right. But that have found their fulfillment now in Christ. And sort of like how they were concentric circles. They're also concentric circles in a sense now because every bishop is also a priest and also a deacon. So if you have bishop as the center circle, then the circle around that would be the presbyterate, and then the circle around that would be the diaconate. Right, right. And then you could put another circle with sort of the sub diaconate."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7983.35,"end":7983.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":7983.55,"end":8017.4,"speaker":"Fr Stephen De Young","text":"All those other offices. Right. And then in the circle outside that the people. Right. Because just as the people of Israel as a whole exercised a certain kind of priesthood in the Old Covenant, so also in exactly the same way, using exactly the same words. For example, in 1 Peter 2:9, the members of the Christian community, the members of the church as a whole exercise a kind of. The exact same kind of priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8017.48,"end":8046.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, St. Peter pretty much almost exactly quotes this from the Old Testament. A chosen race, a royal priest, and a holy nation. Yeah. And it's interesting. It has this purpose that you may proclaim the excellencies of him who called you out of darkness into his marvelous light. Like the whole point of being that the church is this royal priesthood, this holy nation, is so that they can bring God to the world and bring the world to God. I mean, it's exactly the same thing over and over."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8046.98,"end":8077.57,"speaker":"Fr Stephen De Young","text":"It's exactly the same thing. Sorry, dispensationalists. So this means that the Church has the same relationship to the world that Israel had to the 70 nations. Right. That our task is to represent God to the world and the world to God. That our goal is to integrate. Right. If the Church is the new paradise. Right. Then we're going out and like Adam integrating, not conquering."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8078.53,"end":8079.49,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8079.73,"end":8081.09,"speaker":"Fr Stephen De Young","text":"Not imposing our will."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8081.25,"end":8081.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8081.97,"end":8082.69,"speaker":"Fr Stephen De Young","text":"Dominating."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8083.01,"end":8095.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. Bring people into paradise and they become conformed to paradise. Not like this sort of utopian totalitarianism. I mean, that's the most extreme version. Okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8095.06,"end":8095.34,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8095.34,"end":8098.26,"speaker":"Fr Andrew Stephen Damick","text":"But not like, you know, go out and make everybody behave a certain way."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8098.58,"end":8104.34,"speaker":"Fr Stephen De Young","text":"Right. Or like Livey said about Rome, create a wasteland and call it peace. It's really peaceful out there now that all the people are dead."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8105.3,"end":8105.86,"speaker":"Fr Andrew Stephen Damick","text":"Yay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8108.1,"end":8184.04,"speaker":"Fr Stephen De Young","text":"Right. And then also on the other side, interceding for the world before God. And this is why the Eucharist is offered for the life of the world and for its salvation. Right? Right, Right. According to the liturgy of St. Basil. So this priesthood of the faithful, Right. Within the church, just like in Israel, is not opposed to there being certain people who exercise another kind of priesthood. These aren't opposed ideas. Right. Priesthood is always exercised in relation to God and then someone and. Or something else. Right. So the bishops are exercising a priesthood. Right. To all of the circles outside of them. So bishops are priests to priests, they are priests to deacons, they are priests to the faithful, and they are priests to the world. Priests are priests, presbyters are priests to the deacons, to the faithful and to the world."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8184.84,"end":8186.48,"speaker":"Fr Andrew Stephen Damick","text":"And then they'll tell two friends, and."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8186.48,"end":8205.17,"speaker":"Fr Stephen De Young","text":"Then tell two friends and so on and so on. Right. So you get to the people, the laity, the faithful are priests to the outside world. Right. Of the, of the church. Right. And we see the sort of fulfillment of this than in the book of Revelation actually. Over and over again."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8205.57,"end":8248.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, repeatedly. Like, okay, Revelation 1:6, God and made us a kingdom, priests to his God and Father to him be glory and dominion forever and ever. Amen. 5, 10. And you have made them a kingdom and priests to our God and they shall reign on the earth. And then 20, verse six, blessed and holy is the one who shares in the first resurrection and over such the second death has no power, but they will be priests of God and of Christ and they will reign with him for a thousand years. So you've got that priesthood and kingship, kingdom and priests, priestly kingdom, you know, like it's just over and over again, that's the way that the image of what it is, the fulfillment of the kingdom of God in this world looks like according to the book of Revelation."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8249.74,"end":8258.02,"speaker":"Fr Stephen De Young","text":"Right. So now that we've laid all that out, Protestant friends, pull up a chair, let's have a talk."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8260.18,"end":8261.62,"speaker":"Fr Andrew Stephen Damick","text":"Number one, we love you, priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8261.86,"end":8289.23,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yes. We're not here to dominate you or argue with you. We want to integrate you into the church. But yeah, let's talk. And the reason we're doing this, this is not an apologetic show, right? Right. But the reason we're addressing this in this way with our Protestant friends is because we actually get this question a lot, right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8289.23,"end":8289.71,"speaker":"Fr Andrew Stephen Damick","text":"We do."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8289.71,"end":8311.21,"speaker":"Fr Stephen De Young","text":"Father Andrew reads every email we get. I skim some of them. But I've noticed in that skim that we get this question a lot. Right. About priesthood in the New Covenant, about New Testament priesthood, about why there are priests in the Orthodox Church. Right. And we're talking about this with our Protestant friends because our Roman Catholic friends have priests too, so they don't need to have this talk."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8311.29,"end":8351.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. So, yeah, so there's generally this idea that exists that the priesthood of the Old Testament gets set aside by Christ, that all of his sort of like his anti Sadducee language and actions and stuff, you know, and the tearing down of the temple, that that equals end of the priesthood. We don't need that anymore. It's over now. Right. So, you know, and then they'll often say, well, you know, well, Christ fulfilled it, which means within this vision that it was that it's over, that it's abolished, you know, that fulfillment means abolition."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8352.5,"end":8355.3,"speaker":"Fr Stephen De Young","text":"Right. Which, which is, I mean, this is a fit."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8355.3,"end":8355.62,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8356.91,"end":8371.87,"speaker":"Fr Stephen De Young","text":"Yes. Christ said he didn't come to abolish the law. He came to fulfill it. Right. But that doesn't mean that we just chuck the law and then when someone accuses us of abolishing it, we say, no, it's not abolished, it's fulfilled."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8372.59,"end":8373.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8373.15,"end":8387.06,"speaker":"Fr Stephen De Young","text":"If it's still sitting in the dumpster, it's abolished. It doesn't matter what you call it. Okay. It doesn't matter whether you get fired from your job, terminated or released. Released from your contract, you're still unemployed, let go. Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8387.06,"end":8391.66,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah. Fulfillment is to fill it up to the full and overflowing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8391.66,"end":8393.82,"speaker":"Fr Stephen De Young","text":"Right. It's the opposite of abolishing it."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8393.98,"end":8394.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8395.66,"end":8405.5,"speaker":"Fr Stephen De Young","text":"That's why Christ makes that distinction. Right. So the priesthood of the New Covenant is not less than the priesthood of the Old Covenant."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8406.3,"end":8406.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8406.66,"end":8421.7,"speaker":"Fr Stephen De Young","text":"It is more than, more than the priesthood of the Old Covenant. Right. That's what we should expect to see. And if you tried to apply that kind of argument consistently, it would have some really bad results."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8422.18,"end":8425.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For instance, the phrase to fulfill all righteousness."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8427.06,"end":8429.54,"speaker":"Fr Stephen De Young","text":"Don'T have to worry about righteousness anymore. Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8429.86,"end":8430.98,"speaker":"Fr Andrew Stephen Damick","text":"It's been fulfilled."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8431.86,"end":8506.22,"speaker":"Fr Stephen De Young","text":"Right, right. Christ fulfilled all the commandments of the law, so I don't have to worry about any of them now. Right. We would never say that. No one would ever say that. Our Protestant friends would not say that. Right, Right. But so you shouldn't say it selectively about certain parts of the Torah then either. Right. So if, but if you're going to take that approach. Right. That rather than eldership and priesthood coming back together, that eldership remains, but priesthood is gone. Right. Either it's done away with or I don't know, Christ brought it to heaven. He's still the high priest, but there are no other priests. Some version of that where they're not integrated. Right. They're not reintegrated. Then there are some questions you have to answer. Like why do the structures that, like St. Paul lays out in the Pastoral epistles and the structures that we see emerge in the Book of Acts, the structures we see emerge in the first century church, why are those directly parallel so clearly, as we've seen, so directly parallel to the Old Testament structures and."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8506.22,"end":8508.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in some cases using the exact same words."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8509.26,"end":8615.4,"speaker":"Fr Stephen De Young","text":"Right, right. Why are, if this is a new thing, if the old thing is gone and this is a whole new thing, why does the new thing look so much like the old thing? Might it not be that our point, that the new thing is the fulfillment, the filling up of the old thing, might that not be a better way to interpret that? But this also causes a bunch of problems down the chain. Right. Because what happens is, what happens when we talk about the offices in the church, then as they're usually talked about in like the Protestant reformers, and most of them take some kind of three office view, meaning they have something similar, the Protestant reformers. I mean, you have something like a bishop or a pastor. You have something like elders. Right. And you have something like deacons. Right. Sometimes the names are a little different depending on who you're reading as you go forward. Forward in Protestantism, that's not always true. You get various two office things where sometimes you'll have a pastor and deacons. In a lot of American evangelical churches, especially Baptist churches, you'll get in. You get two office Presbyterians, where they just have presbyters and deacons, but they have two kinds of presbyters. And one of those kinds of presbyters looks a lot like a bishop. But. But you get what I mean. So it sort of plays out in different ways. But. But the basis for that, the whole basis for that, then if you set the Old Testament aside, if the Old Testament thing, everything with the priesthood in the Old Testament is now irrelevant. Right. Then your only basis for that are the words of St. Paul in the Pastoral epistles."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8616.28,"end":8616.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8616.92,"end":8621.72,"speaker":"Fr Stephen De Young","text":"His epistles to Timothy and Titus creating these roles. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8622.12,"end":8622.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8622.92,"end":8623.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8623.2,"end":8626.84,"speaker":"Fr Andrew Stephen Damick","text":"And you could say by fiat, apparently. Just saying this is what I decided."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8627.26,"end":8638.38,"speaker":"Fr Stephen De Young","text":"Either by fiat or. Right. You know, to be fair. Right. It's scripture. So God speaking through St. Paul says this is how he wants the church to be organized. But it's just a command."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8639.34,"end":8639.7,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8639.7,"end":8652.38,"speaker":"Fr Stephen De Young","text":"Right. Either issued by St. Paul on behalf of God or by God through St. Paul, however you want to see that. Right. But so it's just this command. Okay. And it's not based on anything in particular. It's divine command. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8654.79,"end":8655.03,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8657.35,"end":8671.51,"speaker":"Fr Stephen De Young","text":"If they're not connected like that. Right. Then they become subject to a whole lot of interpretation. And first and Second Timothy and Titus aren't that long and they're not that detailed. Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8671.51,"end":8673.19,"speaker":"Fr Andrew Stephen Damick","text":"There's not a lot there about the rules."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8673.83,"end":8705.19,"speaker":"Fr Stephen De Young","text":"So for example, when St. Paul says that a presbyter must be, it literally says a one woman man. It's usually translated husband of one wife. Right. So what does that mean? Does that mean just he can't be a polygamist? Does that mean he can't be divorced? Is the male part the important part or is just the only married ones the important part? And it could be a woman."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8706.31,"end":8706.71,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8707.03,"end":8710.23,"speaker":"Fr Stephen De Young","text":"Right. And this is not just me Making up hypotheticals."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8710.63,"end":8713.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is real applied stuff."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8713.27,"end":8813.17,"speaker":"Fr Stephen De Young","text":"This is real life, Right. Among our Protestant friends in their various communities. Right. These are arguments that are made. Right. Because all we have to go on are these few words from St. Paul. Right. And so how do we interpret, how do we understand them? What are the parts that he's meaning to be a rule and what are the parts that are not really rules and just descriptive. Right. And so that then once you could read these lots of different ways and make lots of different arguments, right. You get a kind of chaos that you see play out in church leadership in various different types of churches, whether they're in a denomination or non denominational or what have you. Right. And so it's not just a question of women's ordination. Right. That obviously enters into this, as we just said, but now we've disconnected. This is a new role. This is not related to priesthood. Right. So other than the qualifications that St. Paul gives, we also aren't given a whole lot of detail on how they are to function. St. Paul tells us the kind of person who should be made one. Even that's subject to interpretation. But once we have this person in this office in this role, what do they do and how do they do it? Well, we can't go back to the priesthood stuff because they aren't priests. Right. And so this gets, tends to be. Right. This becomes an ideological superstructure thing that gets molded by outside forces of the society."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8813.96,"end":8826.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. So like it gets interpreted often along the contours of being about power. Right. So there's this kind of Marxist social interpret, interpretation that's put upon it, you know?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8828.04,"end":8829.16,"speaker":"Fr Stephen De Young","text":"Or capitalist."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8829.4,"end":8837.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. Which. No, yeah, exactly. Yeah, exactly. Yeah, exactly. It becomes about controlling people and, and, and that sort of thing."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8837.88,"end":8851.54,"speaker":"Fr Stephen De Young","text":"Yeah. Controls the money, who controls the organization, who controls. Right. So you get, the pastor is a CEO and then he has a board that's like the board of a corporation, Right, Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8851.78,"end":8862.98,"speaker":"Fr Andrew Stephen Damick","text":"Who gets to tell people what you have to believe. Like it becomes about handing down edicts from on high, you know, and it's funny, like it, again, it begins to resemble this paganized view of the priesthood."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8864.1,"end":8864.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8864.74,"end":8870.75,"speaker":"Fr Andrew Stephen Damick","text":"You know, where it gets again, the conduit gets stopped up. Right, right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8870.75,"end":8895.49,"speaker":"Fr Stephen De Young","text":"Because Christ told us explicitly the lords of the nations, lords of the gentiles, lords of the 70 nations, they Lord it over people. So should it not be with you? Right, right. So there was supposed to be this sort of counterpoint between how priesthood functions in the church and how leadership functions in external organizations in the world. But the exact opposite, it has happened."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8895.65,"end":8896.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8896.13,"end":8945.22,"speaker":"Fr Stephen De Young","text":"So we get this CEO thing, we get this power dynamic, right? I'm the boss, right. I'm the leader. I'm the one in charge. Or you get the opposite, right? You get the opposite. Where especially more recently seven, 1970s and on in the United States, for example, where it becomes all about the. The pastor is. And the elders are. They are there to provide care of a certain sort of. Right. They are. They are caregivers. They're presiding pastoral and spiritual care. They're there to nurture people spiritually. Right. And this again, when you define the role of the church leadership in that way, what do you think is going to happen? Well, I know a lot of women who are really gifted at care professions."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8945.7,"end":8947.42,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8947.42,"end":8979.76,"speaker":"Fr Stephen De Young","text":"And they're going to look at these church leadership positions from which they were traditionally excluded in their minds. Right. Because again, this is just a role that St. Paul delivers the first word on. And he's been interpreted historically in Protestant communions to be only talking about men. Right. So they turn this, I'm excluded for this, but I seem to be really gifted in this. And so they say, well, why am I so gifted in this if I'm not supposed to do it? That doesn't make sense."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8980.49,"end":8980.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":8980.81,"end":9024.9,"speaker":"Fr Stephen De Young","text":"And they interpret that as God calling them to do it. Right. They interpret it that way because we've redefined the it. We've redefined what it is, right. As this function. And so why shouldn't someone of any gender or any age or any marital status, right. Be able to do that if they're gifted to do it? Right? And so you get both. Right. This dynamic is why you have both, like liberalizing trends within Protestant churches and authoritarian trends in other Protestant churches. Right?"}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9024.9,"end":9025.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9025.18,"end":9064.04,"speaker":"Fr Stephen De Young","text":"Where you have pastor as dictator on the one hand and pastor is caring nurturer on the other. Right. And so if the presbyter isn't a priest, right. If the pastor isn't a priest, then he, she, they can end up being, right, you know, a counselor, a motivational speaker, a CEO, a worship leader or a liturgist. Right. All of those things become the definition because there isn't another real biblical one. And so we get one from the culture."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9064.52,"end":9084.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, it's not that most of those things are bad in and of themselves, right. Like, you know, a counselor is a good thing to have. You know, like, it's good to have a counselor. Right. But that's not what priesthood is. And as we've seen, it's not, therefore, what Presbyterate is."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9085.75,"end":9086.79,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9087.11,"end":9104.15,"speaker":"Fr Andrew Stephen Damick","text":"Like a presbyter might be a counselor. Like, there are. I know some. Some. Some priests who are, you know, like, they actually have that ability and training, and they're good at it. But, you know, that's not. That's not core. That's not within the core of what the priesthood actually is."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9104.47,"end":9121.05,"speaker":"Fr Stephen De Young","text":"They're that qua person, not qua priest. Yeah, yeah. And to be fair. To be fair. Right. This same pressure that has been exerted on our Protestant friends is also exerted, at least in this country and I'm sure in other Western countries, on the Orthodox Church."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9121.61,"end":9125.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's the expectation. Orthodox clergy are supposed to be these things, too."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9126.01,"end":9173.81,"speaker":"Fr Stephen De Young","text":"Yeah. Are supposed to be master liturgists or CEO of a small nonprofit or what have you. Right. So this is an affliction. But. But here's what I'm saying to my Protestant friends, honestly, the way out of that mess is. And our Protestant friends should have no problem with this, is to go back into the Scriptures and recover the connection between the offices of leadership in the New Covenant in the New Testament and those in the Old Covenant and the Old Testament, and to see that presbyters are now once again priests, and that priesthood is how authority is to be exercised in the church in this transparent way."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9177.89,"end":9262.33,"speaker":"Fr Andrew Stephen Damick","text":"Well, to wrap things up, you know, one of the things that occurred to me as we were having our conversations about all this is, I mean, it's no secret my great love for the works of J.R.R. tolkien. One of the. His very good and. And remarkable essays is called On Fairy Stories. And it's a piece of literary criticism. It's a lecture that he gave and then got published some years later. And he makes the point. So just hang with me here. He makes the point that a fairy story or a fairy tale is not a story about fairies. Right. You know, however you want to define fairies. He actually hated the idea of fairies as being, you know, diminutive little people. For him, they were otherworldly, almost humans, but, you know, elves or whatever. But he makes the point that a fairy story or a fairy tale is actually about human beings entering into a realm called. That he would call fairy, which he didn't invent that term, and it's often spelled F A E R I E Faerie, and that it both encompasses the idea of human beings crossing into another realm and also standing in the presence of something otherworldly."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9263.21,"end":9263.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9263.61,"end":9465.35,"speaker":"Fr Andrew Stephen Damick","text":"That. That's what. That's how he defines what a fairy story or a fairy tale is about. And of Course, if you're familiar with his fictional works, you know that that is a pretty significant element in what he likes to write about. And, you know, as we try to get our minds around as much as possible what the priesthood is, which is not totally possible because this is. This is a gift from God, and it's about participating in who Christ is. So we can't really, truly, truly understand it or comprehend it. We can participate in it, but as we tried to understand on some level so that we can participate, well, this was one of the things that occurred to me about what priesthood is. Not just in terms of being a presbyter, like Father Stephen and I are, but in terms of what it means to be in the people of God, right? So on the one hand, we. We come in contact with what is otherworldly, right? And I don't just mean the unseen world in general, I mean God in particular, that our task is to encounter him, right? But also our task, especially as a holy nation, as a royal priesthood together, a kingdom of priests, is to bring the world into contact with God. So we represent. We present God to the world and we present the world to God, right? This is that basic dynamic of the conduit that we've been talking about in this whole episode. And I think that one of the ways that we can do that is especially by trying, as we do on this podcast, to look at and to understand what the scriptures say about God's presence and work in the world and his holy ones that are working alongside him, right? So it's a priestly act, for instance, to tell someone the story of a saint's life, because you're doing that, you're becoming that conduit, right? And then it's a priestly act to help someone become like Christ. You know, you're being the conduit in the other direction. You're presenting them to God, right? So ultimately, it's not about fairy tales, but fairy tales are one way of trying to understand that encounter between the human and the otherworldly, the human and the divine, Right? And I think that that's part of the value of reading stories like that and understanding stories like that is that it helps to show shape and to nurture the imagination so that when we encounter these things in scripture, it makes a little bit more sense to us because we've already encountered it in some way in something that's a little bit more bite sized. You know, they're not absolutely analogous. It's not absolutely analogous, but it can help to form the human person, to be more receptive to the reality that is being described in Scripture and to be more receptive to the reality that we actually encounter in the divine services, especially the Divine Liturgy itself, the Eucharist."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9466.55,"end":9466.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9467.35,"end":9521.49,"speaker":"Fr Andrew Stephen Damick","text":"And so, you know, like I said, it's not the only angle. You know, it's not required, but it's one angle. And I think that all of us as human beings, encounter stories which are about this encounter, again, of the human with the otherworldly, with the divine, with the astonishing. And I believe that the more that we become the storytellers that God has made us to be, and by that, I don't mean that you necessarily have to write novels or whatever, but simply to tell the story of the Scriptures, to tell the story of the lives of the saints, then we are functioning in that priestly way, one way of functioning in that priestly way. There's a lot of ways, but this is one in particular. Father Stephen."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9524.13,"end":9525.73,"speaker":"Fr Stephen De Young","text":"I didn't know you liked Tolkien."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9525.97,"end":9526.53,"speaker":"Fr Andrew Stephen Damick","text":"I do."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9526.85,"end":9527.77,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9527.77,"end":9529.33,"speaker":"Fr Andrew Stephen Damick","text":"I know. I've been hiding it for a while."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9529.49,"end":9919.46,"speaker":"Fr Stephen De Young","text":"Even after all these years. I learned something about you. Yep. So as we talked about, priesthood is a way of relating to the world and the people in it and relating to God. And we've fallen into all kinds of different ways of relating to other people and relating to God that are not what we've described tonight as priesthood. But let's think about for a minute what that might look like if we decided to do that. What does it look like if someone who's parenting children parents them in a priestly manner? Well, for one thing, then a child being disobedient wouldn't be about them transgressing or challenging your authority. It wouldn't be about your ego versus their ego and your ego needing to crush theirs and put them back in their place as a child under your authority. It might look a lot more like seeing a child's disobedience as them having alienated themselves from God and from the family. And your task as a parent being to do the work with them, to reintegrate them, to bring them back into communion with the family and with God. It's a very different thing. And the same thing could be true with employees, with students who you teach, with people who you supervise. In a job situation, we can approach other people in the sense of wanting to reintegrate what is broken, to reconnect what's been separated, to rebuild after all the alienation we've all suffered. Reconnect and to heal. We all have the capacity to do that in every encounter we have. And that's not just true on this personal basis, because the Christian world, especially in the United States, I'm sure this is true other places too, spends a whole lot of its energy trying to enforce the rules that govern the lives of Christians on the country around us and the world around us. We approach our larger community, not now our church community, not now our parish community, but our city, our state, the country we live in as a place that we need to now use power relationships, use what power we have as citizens to try to conform it, to try to sort of conquer it, try to take control of it, and then make it into what it should be. Right? And this is not just true of one side. I don't know that there are even two sides in American politics anymore, but that's a whole other topic. But you know, on one side, right, we need to seize the levers of power and remake things and use our power to make sure that certain sins are made illegal so that we can try to stomp them out. Even among people who don't know Christ and don't believe in Christ, we'll cross a couple sins off the list that we won't let them commit. The other side says we need to do something by force using the mechanisms of power, using our power as citizens to make sure that the people who we should be feeding get fed by the state, the people who we should be clothing get clothed by the state. Right? And both sides are not approaching the world as if they as Christians, are priests for the world. Because I as a priest, am not called to go run for mayor. In fact, I'm not allowed to as an orthodox priest or Congress or president. I'm not called to take over those mechanisms and try to enforce these things. I'm called upon as a priest to represent Christ to the world and the world to Christ. God didn't send us into the world to condemn it, whether that's condemning it as a wokes gold or condemning it as a Puritan of the more traditional type, right? But that the world might be saved. That's why we're sent. And so we need to be going out into the world and seeking to integrate the world into the church as the new paradise on this larger scale. And that's a priestly function that, as we said, every single Christian has. And we do it directly through direct action with people. We bring Christ to them and then we bring them back to Christ. At first, that may only be in prayer. Maybe eventually we get them to come to Christ themselves. But that has to always be our goal. Because, Lord willing, if that's how we're living our life as Christians, then as those people become Christians, guess what? They're going to live a Christian morality and they're going to care for the poor and the needy. They're going to do all of those things that we've been busy trying to do politically and, by the way, failing miserably. They're going to do all those things as Christians, and better than that, they're going to find salvation and eternal life, which is a whole lot more important than the wealth gap or how much sin is going on in any given city. So those are my thoughts."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9920.5,"end":9945.23,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for today. Thank you very much everyone for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email at Lord of Spirits, Ancient Faith.com or you. You can message us at our Lord of Spirits Podcast Facebook page. I read everything. Father Steven skims everything. But we can't respond to everything and we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9945.79,"end":9954.43,"speaker":"Fr Stephen De Young","text":"I skim some things Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9954.91,"end":9964.36,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, you can like our page. Join our discussion group Leave reviews and ratings every everywhere, but please share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9964.68,"end":9973.72,"speaker":"Fr Stephen De Young","text":"And you know, don't be on Facebook if you don't have to. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9974.2,"end":9977.16,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. Good night and may God bless you all."}
{"episode_id":"LOS - #036 - 2022-01-27 - World of Priestcraft","start":9991.89,"end":10029.02,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 thousand times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
