{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":0.72,"end":65.41,"speaker":"Fr Andrew Stephen Damick","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":66.77,"end":77.41,"speaker":"Fr Stephen De Young","text":"Good evening giant killers, dragon slayers. You are listening to the Lord of Spirits podcast. My co Host, Father Steven DeYoung, the Reverend Doctor is with me from Lafayette, Louisiana."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":77.65,"end":79.09,"speaker":"Fr Andrew Stephen Damick","text":"Very Reverend Doctor."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":79.09,"end":84.29,"speaker":"Fr Stephen De Young","text":"Oh, excuse me, the Very Reverend Doctor. Can I throw out my big title as well?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":84.29,"end":85.01,"speaker":"Fr Andrew Stephen Damick","text":"The render."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":88.69,"end":134.37,"speaker":"Fr Stephen De Young","text":"And I'm Father Edger Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. Just like the voice of Steve just said, Matuska Trudy is taking your calls tonight, our engineer extraordinaire. And we're going to get to those in the second part of our show. Lord of Spirits is brought to you by our listeners with help from Theoria school of Filmmaking. Theoria school of filmmaking is the first, first orthodox film school. The primary instructor is Jonathan Jackson, a faithful orthodox Christian speaker, writer and five time Emmy award winner. To learn more about theoria, please visit theoriafilm.org that's t h e o r iafilm.org that's."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":136.21,"end":150.88,"speaker":"Fr Andrew Stephen Damick","text":"Because of the theoria school of filmmaking that like Kurosawa, I make mad films. Okay. I don't make films, but if I did, they'd have a samurai. All right, that was for our Canadian listener."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":150.88,"end":194.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah, yeah. It took me, it took my brain like a couple of seconds to realize that you were quoting a certain band of fully clothed males. Fully clothed males. Yeah, yeah. So this evening we're going to wrap up our three part series on the fall of man. Tonight is about the Tower of Babel which we first learn about in Genesis chapter 11. But the people who first heard Genesis 11 weren't hearing this for the first time. In fact, they already knew the story, but most of us probably don't. So that's where we're beginning tonight. The context into which Genesis 11 was speaking. So what is that context, Father?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":196.13,"end":198.18,"speaker":"Fr Andrew Stephen Damick","text":"The olden times. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":198.18,"end":203.46,"speaker":"Fr Stephen De Young","text":"Back in the day, the before times. Back in the day when the group was cool and I wasn't in it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":203.86,"end":209.3,"speaker":"Fr Andrew Stephen Damick","text":"The way back, the before time. Yep. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":209.46,"end":209.86,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":211.7,"end":242.08,"speaker":"Fr Andrew Stephen Damick","text":"One of our major foci tonight is going to be the fact that sort of like the creation of the world and the flood, the story that's told in Genesis 11, the first part of it at least it's not that long, about the Tower of Babel, is also a biblical retelling of an event that was sort of common knowledge in the ancient Near East."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":242.4,"end":242.88,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":242.88,"end":314.36,"speaker":"Fr Andrew Stephen Damick","text":"And people are probably more aware of the first two. Right. Like, it probably seems obvious to most people that, like, yeah, these different cultures would have different stories about the creation of the world. Right. Or how it came into being. And if you've done any reading at all about the ancient world or ancient mythology or the Bible and comparative literature, one of the first things you find out about is the fact that there are flood stories everywhere in the world. Right. Yeah, but so this one is a little more specific. Right. And therefore, I think a lot of people haven't necessarily made the connection between this story and actual events that everyone would have known about and that are historical events. Right. So we kind of start with. Okay, so what is even being talked about in this story, which is sort of a longish paragraph at the beginning of chapter 11 of Genesis."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":314.36,"end":319.8,"speaker":"Fr Stephen De Young","text":"It's not a big piece of text, and then the text just kind of moves on from there."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":320.6,"end":327.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we consider that, you know, the flood proper. Right. Is Genesis 6 through 9."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":327.96,"end":328.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":328.76,"end":358.82,"speaker":"Fr Andrew Stephen Damick","text":"And if you include, as we would, and as people have heard us do in the last couple weeks, include like, Cain and his genealogy in there with the flood, then you're talking about Genesis 4 through 9. This is not the whole chapter. This is a good. Probably more than half in terms of text. Slightly more than half of chapter 11 of Genesis is actually Abraham's genealogy leading to chapter 12."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":359.06,"end":366.27,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, the Tower of Babel story is verses 1 through 9 of Genesis 11, and then. Then the rest is genealogy stuff."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":366.43,"end":371.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Leading up, actually, it's a genealogy of Terah, Abraham's father, technically."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":371.31,"end":372.91,"speaker":"Fr Stephen De Young","text":"But yeah, yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":372.99,"end":425.38,"speaker":"Fr Andrew Stephen Damick","text":"Just so we don't get actualied in a chat box somewhere, they're going right now. Yeah, but so what is. And you know, there's kind of a thin. Right. We treat this, We've become used to treating this partially because, you know, most folks aren't big fans of reading genealogies. We treat this as like, oh, well, here's this story that's in between some genealogy stuff that we skim. Right? Yeah, but all of the genealogies. And we've seen this several times, right. Already just in the early chapters of Genesis. All of these genealogies will like hit pause occasionally and have small stories and pieces of information in them. Right. Like Enoch being taken up into heaven."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":426.02,"end":426.42,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":426.9,"end":436.66,"speaker":"Fr Andrew Stephen Damick","text":"Which is in Seth's. Right. Genealogy. Right. Or some of the stuff we talked about last time with Cain's genealogy. Right. Things that they invented in sort of lamech."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":436.9,"end":464.93,"speaker":"Fr Stephen De Young","text":"And this just feeds into, you know, I can't remember which episode it was now, but we talked about history and what history is in the pre modern era. It's the story of a people and the narrative of people. A lot of it is going to be genealogies, particularly of kings and then, you know, certain exploits related to some of those kings or events that surround them and bring context to the story of that particular people. And that's, you know, that's what's going on here."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":465.41,"end":483.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And so this being only nine verses, right. You know, there's kind of a fuzzy line where we say like, oh, well, if it's, if it's three or four verses, that's just part of the genealogy. But if it's nine verses, then this is separate from the genealogies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":484.86,"end":485.62,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":485.62,"end":489.66,"speaker":"Fr Andrew Stephen Damick","text":"Like that's kind of arbitrary distinction, Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":489.66,"end":493.7,"speaker":"Fr Stephen De Young","text":"Because again, there's not such a thing as verses back in the day or."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":493.7,"end":544.59,"speaker":"Fr Andrew Stephen Damick","text":"Chapter breaks or any of that. Right. So, so this is a, a story that is now nine verses, but that gives you an idea of the length that's in this genealogical material. And so the easiest way, I think, to start getting into this in terms of identifying what this story is about is to start with Babel, Right. This is famously the Tower of Babel. And so the. And I put this in our inaccessible show notes, I put the actual cudeiform of the Sumerian name for Babel, right. Which is."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":544.91,"end":551.43,"speaker":"Fr Stephen De Young","text":"Sorry, everybody, I'll put it, if you're watching on YouTube, I will put it in the YouTube chat so you can actually see the cuneiform."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":551.43,"end":553.59,"speaker":"Fr Andrew Stephen Damick","text":"Will it actually paste in there? YouTube will."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":553.59,"end":562.25,"speaker":"Fr Stephen De Young","text":"Yes. I did this last time and it worked. So everybody can now see it. If you're watching watching on YouTube. Hey, hey, YouTube people. All 21 of you tubers."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":562.33,"end":572.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so. And hey, it worked on Facebook too."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":572.73,"end":574.53,"speaker":"Fr Stephen De Young","text":"Just FYI. Facebook listeners."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":574.53,"end":578.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we'll let you cut. So exciting."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":578.01,"end":582.53,"speaker":"Fr Stephen De Young","text":"Yes, yes. Yeah, it's crazy. I can't guarantee that people's computers will."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":582.53,"end":586.29,"speaker":"Fr Andrew Stephen Damick","text":"Display it, but it's working. Oh, yeah, that's the other. That would be the other issue."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":586.29,"end":588.17,"speaker":"Fr Stephen De Young","text":"Yeah, it works on mine, so I don't know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":588.39,"end":597.19,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, so. Yeah, yeah. And that in Sumerian, it's basically pronounced gun or kun digurak."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":598.15,"end":598.79,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":600.39,"end":607.83,"speaker":"Fr Andrew Stephen Damick","text":"Which, as we all know, means literally gate of the gods."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":608.63,"end":609.03,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":609.27,"end":652.1,"speaker":"Fr Andrew Stephen Damick","text":"So it's made up of four symbols for the folks who can't see, which may be everybody, but the people who can't see the cuneiform, even though Father Eduard just posted it, and people who won't be listening live, who probably won't see it. But it's four cuneiform symbols. The first one is basically a pictograph of a gate. That's the gun or the kun. And then the second symbol looks kind of like a star on purpose and is. It's pronounced dgar, which is the word for a God or the symbol for a God. And then the symbol for a God."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":652.1,"end":655.1,"speaker":"Fr Stephen De Young","text":"Looks like a star. Yeah, yep, yep."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":655.1,"end":657.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All of this semi pictographic."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":657.26,"end":659.78,"speaker":"Fr Stephen De Young","text":"I'm shocked, shocked, shocked, I tell you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":660.82,"end":679.34,"speaker":"Fr Andrew Stephen Damick","text":"And then the third symbol is what's pronounced rock. And that's essentially to make the. The word God, what we would call in Greek or Latin a genitive. So that's the. Of the. Essentially."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":679.66,"end":680.06,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":680.94,"end":686.54,"speaker":"Fr Andrew Stephen Damick","text":"So that it's gate of the gods. And then the fourth symbol is a symbol that we've seen before."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":687.58,"end":690.06,"speaker":"Fr Stephen De Young","text":"Yes, I recognize it from previous notes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":690.14,"end":700.55,"speaker":"Fr Andrew Stephen Damick","text":"From the last show. Is sort of a diamond shape on the exterior that denotes it as a place name."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":701.03,"end":704.71,"speaker":"Fr Stephen De Young","text":"Yeah. Cause it looks like a little walled city or something like that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":705.11,"end":722.07,"speaker":"Fr Andrew Stephen Damick","text":"So it's like the place that is the gate of the Gods. Right. And the Akkadian name is Bobealy, Bob being gate, Eli being God. So you could probably detect the El. Eley. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":722.98,"end":723.94,"speaker":"Fr Stephen De Young","text":"That Semitic root."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":724.02,"end":743.74,"speaker":"Fr Andrew Stephen Damick","text":"Semitic root there. So there's. There's a bunch of debate because Sumeriologists, like everybody else, have to write dissertations and publish journal articles as to which of these, the Sumerian form or the Akkadian form came first, which is a."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":743.74,"end":756.42,"speaker":"Fr Stephen De Young","text":"Translation of the other because they don't sound like each other. It's not a. It's not a loan word either way. It's an actual. What they call a calc C, a L, Q, U E, where you translate the parts and create a new word out of that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":756.74,"end":853.85,"speaker":"Fr Andrew Stephen Damick","text":"Right? Like, you know, everybody calls the town Red Stick and then change it to Baton Rouge to be fancy. Right. In this case, the reason for that argument is that this is the only known case of a place name in Mesopotamia where the Sumerian and Akkadian names for the place are translations, Right? Not like a transliteration, but actually they translated it from one language into the other so that it would mean the same thing. So that then raises the question which came first? Everybody's like, great, now I have a journal article to write and things could go on as planned. But both of them mean one is the Sumerian form and one of them is the Akkadian and therefore Semitic form of Gate of the Gods. How we get from Bob Eli to Babylon is through Greek, because the Greek transliterated the Akkadian as Babylon quite directly. So if you know the Greek Alphabet and you're reading the Greek Old Testament or the New Testament in Greek and you come to Babylon, you will instantly recognize it because it's Babylon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":854.57,"end":856.01,"speaker":"Fr Stephen De Young","text":"Yeah, Right, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":857.06,"end":865.54,"speaker":"Fr Andrew Stephen Damick","text":"So. And so that just gets transliterated into English according to standard, like, conventions, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":865.54,"end":865.86,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":865.86,"end":873.78,"speaker":"Fr Andrew Stephen Damick","text":"It's beta, alpha, beta, epsilon, lambda, omicron. New. Right, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":873.78,"end":883.14,"speaker":"Fr Stephen De Young","text":"So, yeah, Babel equals Babylon. Right. That's a really important identification to make here. These are not two different places as far as the biblical text is concerned."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":883.71,"end":899.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And the place that should confirm that to you is right there in Genesis 11. Because even though we brush over this when we read the story, it actually says that they set out to build a city and a tower, Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":899.23,"end":900.27,"speaker":"Fr Stephen De Young","text":"Not just a tower."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":900.67,"end":937.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. So it's the tower of Babel, meaning it's the tower, actually ziggurat of the city of Babili, AKA Babylon. Now, when you get to all that said, when you get to verse nine, Genesis 11, nine, sort of the end of the story, the Hebrew text indicates that the name Babel comes from the Hebrew verb Bilbao."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":938.71,"end":949.43,"speaker":"Fr Stephen De Young","text":"Right. So it's presenting an etymology, like what it says in the esv, Therefore its name was called Babel because there the Lord confused the language of all the earth."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":950.95,"end":968.64,"speaker":"Fr Andrew Stephen Damick","text":"Right? So it's presenting. It's coming from the Hebrew Bilbel. Now, it is a generally true phenomenon that ancient literature is full of bogus etymologies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":969.44,"end":994.47,"speaker":"Fr Stephen De Young","text":"Yeah, it's true. The reliable philological discipline of etymology is pretty much a modern thing. Ancient peoples did not seem to know how this worked. And in fact, the idea that languages that were not mutually comprehensible at the time actually had a common. You know, Ur language was not a thing that occurred to most people either."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":995.27,"end":1006.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And so it was sort of whatever was close. Sometimes even they're working in their own language. Ancient Greek literature. Classical Greek literature is like super terrible about this."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1006.87,"end":1007.43,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1008.23,"end":1010.39,"speaker":"Fr Andrew Stephen Damick","text":"It's just sort of whatever word seems similar."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1011.43,"end":1011.91,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1012.15,"end":1019.84,"speaker":"Fr Andrew Stephen Damick","text":"One of the famous ones in Plato's Republic is him. Him saying that dika is derived from diki to cut."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1021.04,"end":1021.52,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1021.76,"end":1025.76,"speaker":"Fr Andrew Stephen Damick","text":"Which it's not like at all."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1026.56,"end":1031.12,"speaker":"Fr Stephen De Young","text":"Yeah. It's interesting. They have this idea that some words are derived from others, but they so often get that wrong."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1031.44,"end":1064.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. They just try to break them apart. And I mean, you could do that in English very easily too. Right. People do it a lot. Yeah. Being the classic example. Right. So that said. Right. That said, it's very easy and a lot of scholars will just say, well, like, okay, this is bogus. Right. I don't think that that's what this is, that this is an ancient bad etymology. I would argue that this is deliberate."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1065.13,"end":1065.69,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1066.33,"end":1094.1,"speaker":"Fr Andrew Stephen Damick","text":"For one thing, Akkadian and Hebrew are not that different. Right. And here's how. Well the two pieces of Bob Ely, right. The Akkadian name that Babel comes from, how well that's held on Bob Ely. I mean, it's probably pronounced slightly differently, but basically means Gate of the Gods in Arabic."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1095.89,"end":1096.13,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1096.61,"end":1098.05,"speaker":"Fr Andrew Stephen Damick","text":"Like modern Arabic."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1098.93,"end":1104.81,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. I don't have that much Arabic knowledge, but I don't know. Right. In Arabic speakers. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1104.81,"end":1168.77,"speaker":"Fr Andrew Stephen Damick","text":"People told me. Yes, yes. Well placed people who would know. Right. And again, it's. I'm sure it's pronounced a little differently, but basically like they could look at that and say. Yeah, right. So it seems to me to be a difficult argument to say that whatever writer, editor, wherever you want to place this in the process of the Torah as we have it now coming together. Right. Whoever that was at any stage didn't honestly know what Babel came from. Number one, Bob L. Right. But. But actually thought it came from Bilbel, which barely resembles it. Right. So I would argue that this is a deliberate thing. This is a deliberate."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1169.01,"end":1170.21,"speaker":"Fr Stephen De Young","text":"They're making a comment."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1170.93,"end":1178.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes, he's making a comment. Right. This is not the place of the gate of the Gods. This is the place of confusion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1179.2,"end":1181.04,"speaker":"Fr Stephen De Young","text":"Yeah. It's a correction."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1181.6,"end":1198,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so it's more like how the ancient Hebrews changed BAAL Zabul. Right. Which meant sort of High Lord BAAL to BAAL Zabub."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1198.73,"end":1198.97,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1198.97,"end":1199.93,"speaker":"Fr Andrew Stephen Damick","text":"Lord of the flies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1200.25,"end":1203.69,"speaker":"Fr Stephen De Young","text":"Right, Right. It's a joke. It's trash Talk."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1204.17,"end":1210.73,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which is a reference to excrement, in case anyone didn't know, because that's where the flies all gather together."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1210.81,"end":1211.53,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1214.09,"end":1240.58,"speaker":"Fr Andrew Stephen Damick","text":"So it's more like that. Right. So this is a deliberate comment being made about Babylon. So what we get, even from just this initial sort of cursory look at this little story here in Genesis 11, is that this is a text that is commenting on the founding of Babylon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1241.14,"end":1242.42,"speaker":"Fr Stephen De Young","text":"Yeah. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1242.5,"end":1254.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. So what's actually up with the founding of Babylon? So we have a really good idea of when Babylon was founded."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1255.73,"end":1260.37,"speaker":"Fr Stephen De Young","text":"Yeah. Which is kind of weird for events in the ancient world that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1260.37,"end":1262.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And this is very ancient world."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1262.33,"end":1263.57,"speaker":"Fr Stephen De Young","text":"This is decent idea."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1263.81,"end":1270.21,"speaker":"Fr Andrew Stephen Damick","text":"This is not just like pre, when Moses lived. Regardless of how early you think Moses lived, this is pre, when Abraham lived."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1270.61,"end":1271.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1271.33,"end":1281.92,"speaker":"Fr Andrew Stephen Damick","text":"This is before the ur3 period. Okay. So this is way back. Right. None of the Old Testament was written in the time we're talking about."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1282.24,"end":1284.56,"speaker":"Fr Stephen De Young","text":"Yeah. This is over 4,000 years ago."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1284.8,"end":1337.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes. But what we know from archeology and what we know from ancient writers matches up almost perfectly. Which never happens. This, like, never happens. Right. So archeologically, the earliest reference we have to Babylon comes from a tablet. So these clay fire tablets that cuneiform was written on are nigh indestructible. Right. You get breaks and gaps sometimes. That's why I said nigh. But it takes a lot. Right. The average one, you could. If you threw it at your floor, it would make a dent in your floor. It would not, like, shatter."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1338.65,"end":1339.13,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1340.25,"end":1379.82,"speaker":"Fr Andrew Stephen Damick","text":"That's why they've survived for all these thousands of years, because they're very sturdy. And most of the ones where you see breaks, like if you're reading and you see breaks in the text, usually there's a tablet missing or it's not that the whole tablet has gotten destroyed, it's that something's happened. There's a big chip out of the front that. Where we can't read the writing. Right. Some chip has got knocked off of it. Usually. Like, you know, the city was conquered 14 times, you know, leveled, burned to the ground. And, you know, the tablet got chipped somewhere along the way."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1380.78,"end":1381.18,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1381.74,"end":1383.02,"speaker":"Fr Andrew Stephen Damick","text":"Like that level of thing."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1383.1,"end":1394.47,"speaker":"Fr Stephen De Young","text":"And we should say that most of these tablets that are out there are not cool things like the founding of Babylon or the BAAL cycle. It's, you know, like people's grocery lists and whatever."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1394.71,"end":1398.79,"speaker":"Fr Andrew Stephen Damick","text":"As far as we know, because most of them are untranslated. I know we've talked about that on the show before."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1399.03,"end":1402.39,"speaker":"Fr Stephen De Young","text":"Exactly. There's a career out there. People, you just got to get a grant."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1402.71,"end":1413.83,"speaker":"Fr Andrew Stephen Damick","text":"I would imagine the ratio of cool stuff to trade documents is probably roughly the same between the translated and untranslated portions."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1414.13,"end":1414.37,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1414.37,"end":1426.91,"speaker":"Fr Andrew Stephen Damick","text":"So. But the. The earliest one of these we have that mentions Babylon is from somewhere in the mid 23rd century B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1427.11,"end":1430.69,"speaker":"Fr Stephen De Young","text":"Okay, so that'd be the 2200 B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1431.01,"end":1442.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Somewhere in the middle of it. So, you know, the dead Middle would be 2250, which is near the end of the reign of Sargon of Akkadian."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1443.28,"end":1444.48,"speaker":"Fr Stephen De Young","text":"Which is such a great name."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1444.96,"end":1449.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, not the YouTube dude. No, no, the actor."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1450.72,"end":1451.2,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1455.2,"end":1521.52,"speaker":"Fr Andrew Stephen Damick","text":"So the. He's called Sargon of Akkad. This will come up again later. We've mentioned this before. Right. Mesopotamia, historically, pretty much always, until modern times, really, was divided into northern and southern portions. The southern portion was Sumer. The northern portion was Akkad. Right. And we already mentioned the two languages, Sumerian and Akkadian. Akkadian is Semitic. Sumerian is a language isolate. Meaning it's not related to anything. Yep, as far as we know. And so within Mesopotamia, sort of the balance of power throughout the fourth and third millennia BC Sort of went back and forth between Sumerian cities and Akkadian cities, Sumerian dynasties, and Akkadian dynasties of kings. So he's called Sargon of Akkad because he was the head of a major Akkadian dynasty."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1521.84,"end":1523.2,"speaker":"Fr Stephen De Young","text":"Right, right, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1523.28,"end":1537.92,"speaker":"Fr Andrew Stephen Damick","text":"In Akkad. But so near the end of his reign, we have a tablet that refers to Babylon as a town, not as a city, as a town. So it's sort of a settlement at this point on the Euphrates River."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1540.32,"end":1540.88,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1541.76,"end":1585.76,"speaker":"Fr Andrew Stephen Damick","text":"So that's. That's our earliest sort of reference to it being there in terms of trying to date its founding that we've got from our modern archeology. But we have various ancient sources. We're gonna go through these in order of increasing ancientness that also give us dates that we can work out. And in a lot of cases, the person whose writings we have say that they're getting their information from somebody else who's even more ancient than them."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1586.48,"end":1589.36,"speaker":"Fr Stephen De Young","text":"Okay. So they're citing their sources, but we."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1589.36,"end":1601.39,"speaker":"Fr Andrew Stephen Damick","text":"Don'T have those sources to check on. Right. We just have the sort of later but still ancient person. So the first one to talk about is George Sinkellos."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1602.51,"end":1602.95,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1602.95,"end":1651.88,"speaker":"Fr Andrew Stephen Damick","text":"He's late 8th century, late 8th century Byzantine historian. Incredibly important. We've mentioned him on the show before, and he says he has access to the writings of this dude Ctesias, who we don't know anything about, but he has access to these writings of Ctesias. And Ctesias says George Sinkellos had these ancient Babylonian documents about the founding of Babylon. So this is third hand coming from George Sankelos and he dates the founding of Babylon at 2286 B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1653.86,"end":1657.94,"speaker":"Fr Stephen De Young","text":"So that's sort of early 23rd century B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1658.1,"end":1680.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Well if it's there as a town around 2250, then 2286 kind of makes sense as a date for founding. But George Takelos did not have that tablet that we're going by. Right, right. Did not have access to that. He's going from other information. So a little more ancient than that. There's a fella named Stephen of Byzantium."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1681.34,"end":1682.62,"speaker":"Fr Stephen De Young","text":"That's a good solid name."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1683.1,"end":1685.34,"speaker":"Fr Andrew Stephen Damick","text":"And we know almost nothing about him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1685.9,"end":1686.3,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1686.94,"end":1690.46,"speaker":"Fr Andrew Stephen Damick","text":"That's why he's called Stephen of Byzantium. We know where he lived."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1690.62,"end":1695.74,"speaker":"Fr Stephen De Young","text":"Right. But he's sort of roughly contemporary with the emperor Saint Justinian."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1696.3,"end":1711.91,"speaker":"Fr Andrew Stephen Damick","text":"He lived in Constantinople, sixth century during the reign of Saint Justinian. So in the sixth century. And he says that Babylon was founded 1,002 years, not 1,000 years."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1712.55,"end":1713.91,"speaker":"Fr Stephen De Young","text":"I know, that's so great."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1714.31,"end":1716.23,"speaker":"Fr Andrew Stephen Damick","text":"One thousand and two years."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1716.79,"end":1719.35,"speaker":"Fr Stephen De Young","text":"You almost expect them to say. And 13 days."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1719.67,"end":1732.18,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Before the siege of Troy, which based on his own dating of the siege of Troy would put it at 2231 BC."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1733.14,"end":1745.62,"speaker":"Fr Stephen De Young","text":"Okay, so we've had three dates now, roughly the middle of the 23rd century, early 20th 3rd century, late ish. 23rd century B.C. yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1746.9,"end":1757.63,"speaker":"Fr Andrew Stephen Damick","text":"And so then our most sort of ancient source on this is Pliny or Pliny, but I'm going to say Pliny."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1758.11,"end":1759.23,"speaker":"Fr Stephen De Young","text":"It's okay, it's English."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1759.47,"end":1764.59,"speaker":"Fr Andrew Stephen Damick","text":"I think that's the British way of doing it, is to do, I don't know, like Constantine."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1764.99,"end":1771.95,"speaker":"Fr Stephen De Young","text":"Yeah, I don't know. But I've never discussed Pliny with any British people that I can recall."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1772.11,"end":1775.23,"speaker":"Fr Andrew Stephen Damick","text":"I may soon have an opportunity to do this. I will verify."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1775.39,"end":1780.51,"speaker":"Fr Stephen De Young","text":"Yeah, go check with them. Make a note of this. Could you say these words?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1782.81,"end":1797.85,"speaker":"Fr Andrew Stephen Damick","text":"Chimpanzee. Right, okay, Allumen. So Pliny who lived in the early second century A.D. right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1798.09,"end":1801.85,"speaker":"Fr Stephen De Young","text":"This is Pliny the Younger by the way, everybody. Because there's an elder Pliny too."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1802.97,"end":1868.5,"speaker":"Fr Andrew Stephen Damick","text":"And so he quotes this fellow Berossus. So Berossus is an interesting guy. Unfortunately we don't actually have Berossus writings, we just have people citing Berosus. So berossus was a 3rd century BC priest of Bel Marduk. So he was a priest of like BAAL and the Babylonian God Marduk in the third century BC during the so you could period in Syria. And so Berossus wrote in Greek, and so he sort of wrote down in Greek at that time, sort of Babylonian myths, stuff about Babylonian worship and sacrifice, and sort of wrote that all down in Greek for a Greek audience. So he was sort of the point of access to ancient Near Eastern religion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1869.53,"end":1871.45,"speaker":"Fr Stephen De Young","text":"Kind of the Edith Hamilton of his day."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1871.53,"end":1940.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For the Greeks and the Romans. Right. Although he had a lot more of the practical religious stuff about sacrifices and festivals and stuff than Edith Hamilton does. So. But he wrote. So that's the only access they had to it. It'd be great if we ever found Berosus because it would be just this treasure trove of information. But we only have places where he gets quoted by classical authors. But so Pliny quotes him or cites him as having placed the founding of Babylon. And in this case, he doesn't actually say the founding of Babylon. He says that they began to do astrology at Babylon at that site. Right. And for him. Right. We've talked before about how when you read like in the Torah, somebody calling upon the name of the Lord, that that's worship. Right, right. For Berossus, that seems to have been doing astrology. Seems to be. Have been for him the beginning of religion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1940.77,"end":1941.33,"speaker":"Fr Stephen De Young","text":"I see."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1941.41,"end":1945.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Right. So that kind of equates it to the religious founding for him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1946.29,"end":1951.86,"speaker":"Fr Stephen De Young","text":"Stars and gods again. Yeah, yeah, I'm shocked. Shocked."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1952.74,"end":1956.42,"speaker":"Fr Andrew Stephen Damick","text":"But he places that at 2243 B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1957.54,"end":1976.43,"speaker":"Fr Stephen De Young","text":"Okay. So then to kind of wrap this up, you know, our earliest date is 2286 B.C. the latest is 2231. All these dates are basically within 55 years of each other, which you talk in the ancient world. That's like inches away in terms of dating things from the ancient world."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1976.67,"end":1985.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And this is people writing centuries later. And our best archaeology from the time. Yeah, that's crazy modern archeology."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1985.47,"end":1992.67,"speaker":"Fr Stephen De Young","text":"So we can be pretty sure that this is around when Babylon was founded or some major things started happening there."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":1993.07,"end":2025.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Well, there weren't a lot of major things happening there yet. This is what it started the astrology. You know, a settlement or a town, when the major stuff starts happening is going to come a little later, starting in really the 19th century BC okay. So in the 19th century BC, this group of tribes comes in from the east."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2026.65,"end":2027.13,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2028.01,"end":2035.69,"speaker":"Fr Andrew Stephen Damick","text":"And so this is another thing about Mesopotamian history. Mesopotamia doesn't have good natural borders."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2036.73,"end":2039.53,"speaker":"Fr Stephen De Young","text":"Hmm. Subject to a lot of invasion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2039.85,"end":2095.04,"speaker":"Fr Andrew Stephen Damick","text":"So they get invaded a lot. Yeah, right. They get invaded by. And it's not just, oh, some other empire that's their neighbor, builds up a bigger army and then comes and invades. It's like barbarians coming and sacking cities and stuff all the time. They come down out of the mountains because there aren't good defensible natural borders. And this is true also for Sumerian Akkad at this point. So this group comes from out of Syria into Mesopotamia. So they come from the west. And starting in the 19th century BC, they move in and they capture a bunch of cities, including Babylon. And so they get called by the Akkadians the Amuru, which means westerner guy from the west."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2095.52,"end":2096.08,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2097.12,"end":2103.84,"speaker":"Fr Andrew Stephen Damick","text":"And that Amuru is where the biblical Amorites comes from."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2104.32,"end":2105.52,"speaker":"Fr Stephen De Young","text":"Yeah, I remember them."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2106.72,"end":2124.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So an Amorite is used, including in the Torah, but even after the Torah into Joshua and stuff, Amorite is used as a catch all, often for giant clans."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2125.38,"end":2132.9,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And you know the famous King Sion of the Amorites, whose defeat is commemorated in the Psalms."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2133.38,"end":2150.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Alongside Og, king of the Rephaim. But when they're referred to together, like in Joshua, they're referred to as the Amorite kings. So Og even gets lumped in there because again, it's used as sort of a catch all for giant clans."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2150.72,"end":2151.2,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2151.84,"end":2161.36,"speaker":"Fr Andrew Stephen Damick","text":"So the most famous one of these Amorites, particularly in Babylon, is Hammurabi, or Hammurabi if you're a hipster."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2162.88,"end":2164.24,"speaker":"Fr Stephen De Young","text":"The Hammurabi's code guy."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2164.64,"end":2166.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2166.8,"end":2172.72,"speaker":"Fr Stephen De Young","text":"So he shows up in civilization. I think you can play him. I think he's the king of Babylon. And so in civ. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2173.04,"end":2180,"speaker":"Fr Andrew Stephen Damick","text":"Right. So his. I don't want to digress on this too much, but his law code is technically not a law code."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2180.32,"end":2182.32,"speaker":"Fr Stephen De Young","text":"Oh, man, big disappointment."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2184.16,"end":2231.86,"speaker":"Fr Andrew Stephen Damick","text":"But he does propagate laws. Right. And he promulgates those laws on publicly visible standing stones that we still have. So that's why we know so much about Hammurabi's so called code in air quotes. But so Hammurabi establishes not only builds up Babylon into a city, but he makes it into the capital city of an empire. And this is really the first empire. Right. This is the original empire because you had, you know, as we mentioned, Akkad and Sumer going back and forth. Right. But like, these are neighbors in Mesopotamia."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2232.18,"end":2234.66,"speaker":"Fr Stephen De Young","text":"Yeah, it's just a local thing and."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2234.66,"end":2299.76,"speaker":"Fr Andrew Stephen Damick","text":"There are tribal movements and shifts, have population shifts and stuff. But when we talk about an empire, we talk about a transnational empire. Right. That has like trade and infrastructure. Right. And is able to move things from literally one side of the Known world to the other. Right. The first one of those is Hammurabi's Babylonian empire. And he ended up conquering, like, all the Mesopotamian cities you've heard of. So Ur, Uruk, Eridu that we talked about last time. Right. Whole bunch of other ones that are less commonly known, he took, but his reach extended. He went up into Asia Minor, he went. And his reach with trade, here's how extensive it was. We call this the Bronze Age. Right. He was getting his bronze by going to Cyprus to get copper."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2300.48,"end":2300.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2300.96,"end":2302.48,"speaker":"Fr Andrew Stephen Damick","text":"That's where Cyprus gets its name."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2302.8,"end":2305.92,"speaker":"Fr Stephen De Young","text":"In fact, the word Cyprus and copper are cognate."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2306.32,"end":2313.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That's literally where it got saved. They go to Cyprus, they get copper and then mine tin in what's now Afghanistan."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2314.8,"end":2317.2,"speaker":"Fr Stephen De Young","text":"Yeah. Because you have to have both and."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2317.2,"end":2329.38,"speaker":"Fr Andrew Stephen Damick","text":"Bring it back and smelt it right into bronze. Hammurabi also, we know, really liked the style of sandals they made in Crete. So he would get them imported."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2330.18,"end":2333.86,"speaker":"Fr Stephen De Young","text":"Those Cretan sandals. Yes, those were the hot sandals."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2334.26,"end":2388.66,"speaker":"Fr Andrew Stephen Damick","text":"Yes. He was the sneaker head of his day. But so that shows you. That shows you here in the, you know, first half of the second millennium B.C. right, that this empire connected the world. Right. This is. This is the first world empire and brought what was at the time these wonders of technology. Right. And this cosmopolitan trade. Right. And in the sort of imperial propaganda, this was because the Amurru, the Amorites, had brought back the Golden Age from before the flood."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2389.62,"end":2394.98,"speaker":"Fr Stephen De Young","text":"Yeah. This idea of antediluvian knowledge they had."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2395.94,"end":2453.77,"speaker":"Fr Andrew Stephen Damick","text":"Through their connection with the gods, maintained this secret wisdom from the Apkallu we've talked about. Right. The Apkallu story is a Babylonian story, Right. Of this knowledge that was revealed to the kings before the flood. And now the Amorites have it. Right. And that is what has allowed them to establish this. This great empire. So this is. And this is so thorough that, you know, we talked several times already now about Akkad and Sumer as being these two Mesopotamian regions and Mesopotamian powers that go back and forth. You don't hear about either of them in the Old Testament. Right. Like, I mean, you hear about cities, right. Like Ur. Right. But the word Sumer or Sumerian or the word Akkadian or Akkad don't show up."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2454.17,"end":2454.61,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2454.61,"end":2502.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. But that's because of how successful this empire is at transforming even how people view the world. So before this, you have Akkad and Sumer or Sumeria. Right. After this, the northern region of Mesopotamia is called Assyria, and the southern portion is called Babylonia. And so that's why when we get into the former prophets, what are sometimes called the historical books of the Old Testament, you see these references to Assyria and Babylonia. Right, Babylon. And you don't see references to Sumer and Akkad. Because Babylon, this first great world empire, sort of looms large. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2502.6,"end":2503.12,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2504,"end":2524.54,"speaker":"Fr Andrew Stephen Damick","text":"And of course, it doesn't still exist, so it collapses. When people based on the Old Testament think about the Babylonian Empire, you're thinking about like Nebuchadnezzar and his father Nabopolassar. Right. That's called the Neo Babylonian Empire."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2525.42,"end":2525.9,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2526.38,"end":2540.18,"speaker":"Fr Andrew Stephen Damick","text":"They were self consciously trying to reconstruct after they defeated the Assyrians, they were trying to self consciously reconstruct and appropriate Hammurabi's original Babylonian empire from like, what."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2540.18,"end":2541.18,"speaker":"Fr Stephen De Young","text":"A thousand years before?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2541.5,"end":2550.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. A little more than a thousand years before. Yeah. But much like the Holy Roman Empire, you know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2550.81,"end":2551.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2551.53,"end":2552.33,"speaker":"Fr Andrew Stephen Damick","text":"Come on, man."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2552.33,"end":2554.01,"speaker":"Fr Stephen De Young","text":"None of those words were correct."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2554.17,"end":2583.59,"speaker":"Fr Andrew Stephen Damick","text":"You're not fooling anybody. So this original empire collapses. Its collapse is really the beginning. It sets the balls rolling. That ultimately produced the Bronze Age collapse, the collapse of the Bronze Age, as such. Right. So it starts with barbarians from the edges."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2584.23,"end":2584.55,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2584.55,"end":2626.25,"speaker":"Fr Andrew Stephen Damick","text":"Coming and starting to sack cities. Babylon itself got sacked And I believe 1499, for the first time, this is all going to repeat with the Roman Empire. Right. Later on, Western Roman Empire. Right. So it starts getting sacked, things start to crumble. Right. And then when you get. As you move into the second half of the second millennium bc, everything just falls apart. That's. All of these trade relationships fall apart. It's not that people, like forgot how to smelt bronze. It's just they couldn't get copper and tin."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2626.57,"end":2626.97,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2626.97,"end":2627.61,"speaker":"Fr Andrew Stephen Damick","text":"Logistically."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2628.09,"end":2628.65,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2630.97,"end":2678.7,"speaker":"Fr Andrew Stephen Damick","text":"And so its collapse is the beginning of everything's collapse. Right. And so the whole period. So the Exodus is portrayed as happening during this period where Egypt actually survives the Bronze Age collapse, which is massively weakened. Right. And when we get. This is part of the background, when we get into Judges and First Samuel and Second Samuel, or First and Second Kingdoms in the Orthodox study Bible. Right. That part of history is literally post apocalyptic. Right. Like they are in the ruins of this Bronze Age civilization."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2679.31,"end":2684.51,"speaker":"Fr Stephen De Young","text":"So basically, Judges is sort of the Mad Max of its era."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2684.91,"end":2686.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2687.15,"end":2687.63,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2688.43,"end":2716.26,"speaker":"Fr Andrew Stephen Damick","text":"And yeah. And Then first the second Samuel is like the last 30 or so issues of Walking Dead, Right. Where they're pulling civilization back together. Right. And that's. So we tend to have this very medieval Western read of King Saul and King David, partially due to Renaissance art. That portrays them that way. But in actuality, especially, Saul was basically a tribal chieftain."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2716.98,"end":2717.54,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2718.58,"end":2721.94,"speaker":"Fr Andrew Stephen Damick","text":"And David was maybe a step above that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2723.7,"end":2724.06,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2724.06,"end":2739.92,"speaker":"Fr Andrew Stephen Damick","text":"They were really pulling things together. I mean, you'll read these things, like, at the time Saul becomes king, like, the Philistines have basically made sure that there weren't any blacksmiths, Israelite blacksmiths. So they don't even have, like, weapons."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2740.64,"end":2741.12,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2741.36,"end":2766.01,"speaker":"Fr Andrew Stephen Damick","text":"They're fighting with, like, farm implements. Right. They don't have a standing army. So. Yeah. So there's this apocalypse that happens, the Bronze Age collapse. And those earliest stories are crawling out of sort of that wreckage. The Philistines themselves. Right. Were. Were one of the sea peoples."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2766.41,"end":2766.85,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2766.85,"end":2805.55,"speaker":"Fr Andrew Stephen Damick","text":"Who came from the Greek islands. Because of climate change and economic collapse and famine, they migrated south, they tried to invade Egypt and lost. And so they settled along the coast of the Levant. That's why you have those coastal Philistine cities. Right, right. So they're, like, remnants of this collapse. Right. This, like, apocalypse. Yeah. And so that's why it's such a big deal in. In 1st Samuel when Goliath comes out, because not only is he a giant. Right. But he's wearing all bronze."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2805.95,"end":2808.59,"speaker":"Fr Stephen De Young","text":"Yeah. He's this warrior of the ancient days."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2808.99,"end":2885.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's got a magical item in every slot, basically, because they couldn't make any of those. They don't have enough bronze to make any. That's why it goes on and on about the weight of these things. Right. Like, no one has that much bronze to make something like that even if they wanted to at this point. So. So yeah, so there's this. There is this collapse, Right. That. That happens of that empire centered around the city of Babylon. Right. And then from the whole world having been sort of pulled together by that empire and connected by that empire, everything ends up fragmented and confused. Right. So as a. As a last note, and this is a pattern that'll be familiar to our longtime listeners at Babylon. During this period, the main gods who are being worshiped are Shemesh, who's the sun God, the Semitic sun God that Samson's parents name him after as the sort of most high God. And then Marduk at this point is seen as his son who sort of presides in the council of the gods, Sort of like El and BAAL or Cronus and Zeus."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2885.36,"end":2886.16,"speaker":"Fr Stephen De Young","text":"Yeah, exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2887.12,"end":2894.4,"speaker":"Fr Andrew Stephen Damick","text":"The same pattern is going on there. And just like in those other cases, Shemesh sort of drifts off and Marduk sort of becomes the main show."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2895.84,"end":2902.19,"speaker":"Fr Stephen De Young","text":"We'll talk about this pattern a little bit more on Our. On our next episode, but our forthcoming. Yes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2902.35,"end":2903.55,"speaker":"Fr Andrew Stephen Damick","text":"Thunder Gods episode."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2903.55,"end":2904.43,"speaker":"Fr Stephen De Young","text":"Thunder Gods."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2905.55,"end":2946.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, wait. Wrong sort of moments, whole thing going on. So with that in mind, right, About. About Babylon. Right. And what Babylon would have represented in the sort of common imaginary of the people at the time that the Torah is first being promulgated. It's first being heard. Right. Now we can go back to Genesis 11 and sort of set the telling of the story there over against this background."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2947.05,"end":2947.53,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2950.49,"end":2956.23,"speaker":"Fr Andrew Stephen Damick","text":"So one of the things we see right off the bat is this idea that everyone speaks the same language."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2957.51,"end":2968.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. This is where you break. It's not quite Sunday school for me, but you're breaking something for me. But go ahead, break it. It's fine. You know that this is very, very, very personal for me."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2968.79,"end":2976.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes. The idea here is, again, this is not meant as sort of a literal thing. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2976.79,"end":2982.32,"speaker":"Fr Stephen De Young","text":"It's a knife to the heart, man, that they're not actually all speaking the same language."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2982.64,"end":2999.56,"speaker":"Fr Andrew Stephen Damick","text":"The idea is this is a way of portraying an interconnected world. Right. They're all on the same page. This is speaking the same language. Like when someone comes up to me as a Dutchman and offers me a coupon, I say, now you're speaking my language. It's in that sense."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":2999.56,"end":3001.2,"speaker":"Fr Stephen De Young","text":"Right. Would you like a discount, sir?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3001.84,"end":3011.53,"speaker":"Fr Andrew Stephen Damick","text":"So the idea is that all of humanity is united. And what's it united by? By this city, of this tower. Right, By Babylon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3012.25,"end":3016.89,"speaker":"Fr Stephen De Young","text":"Yeah. So the idea of a single language is symbolic, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3016.89,"end":3044.91,"speaker":"Fr Andrew Stephen Damick","text":"It's pulled them together to this common purpose. Right. So then if we back up a little bit into chapter 10, right, another one of these little interjections happens in the Genealogy of Ham, and that is about this Nimrod fellow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3045.95,"end":3048.27,"speaker":"Fr Stephen De Young","text":"Oh, yeah, Nimrod, the great hunter."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3048.91,"end":3063.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Well, and for our millennial and zoomer listeners, there was a time way back in the long ago, when calling someone a nimrod was a great insult."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3063.31,"end":3066.75,"speaker":"Fr Stephen De Young","text":"It's true. Meant kind of an idiot, sort of. Yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3069.23,"end":3071.87,"speaker":"Fr Andrew Stephen Damick","text":"And I have no idea how exactly that happened."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3072.03,"end":3076.27,"speaker":"Fr Stephen De Young","text":"Right. Because there's nothing in the text that suggests he was some kind of stupid person."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3078.43,"end":3080.11,"speaker":"Fr Andrew Stephen Damick","text":"But that was a thing at one point."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3080.19,"end":3081.23,"speaker":"Fr Stephen De Young","text":"There you are. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3082.19,"end":3103.4,"speaker":"Fr Andrew Stephen Damick","text":"In the ancient world of the 1970s A.D. so what we read about Nimrod in Genesis 10, 8 and 9 is that he's the son of Cush and he's the first on Earth to be a mighty man."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3104.04,"end":3106.68,"speaker":"Fr Stephen De Young","text":"Yeah. What's the Hebrew word there for mighty man?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3106.92,"end":3107.56,"speaker":"Fr Andrew Stephen Damick","text":"Gabor."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3108.76,"end":3111.96,"speaker":"Fr Stephen De Young","text":"Right. Which should remind us all. Genesis, chapter six."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3112.28,"end":3148.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That's the same These were the mighty men of old, the men of renown. So he's a mighty hunter before the Lord. Therefore, it is said, like Nimrod, a mighty hunter before the Lord. So that's gonna be the origin of a saying. So Nimrod is not only connected to the giants by that Genesis 6, 4 reference, but also by the fact of his name, which is linguistically identical to Ninurta, which is a Mesopotamian God."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3148.56,"end":3153,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Mesopotamia. Yeah. So he's literally carrying the same name as this God."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3153.4,"end":3169.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So what this text, this genealogy is doing is saying is identifying this Mesopotamian God as actually being this giant figure. Right. Nimrod."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3169.36,"end":3178.46,"speaker":"Fr Stephen De Young","text":"So if you've been reading Genesis for a few chapters by this point, you would say to yourself, wait, I've seen this before. Yes, giants are arising again."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3178.94,"end":3254.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So we have this pattern, right? What was the pattern? Genesis, you know, four through nine. We have the genealogy of Cain, and that leads us up to. And rolls us, like we talked about last time, rules us into the flood, where everything gets destroyed. Right. Death by holiness happens to purify the earth. Right. And so if we're reading along here, we should see. Oh. Oh, boy. Right. It's all starting to happen again. The same cycle is repeating. We have this genealogy. We have giants showing up. Right. Everything is repeating. Right. And so the biblical story then, by that pattern, fundamentally agrees with the Babylonian propaganda about it. Right? Because the Babylonian propaganda was, yes, we are the new incarnation of before the Flood. Right. So the text of Genesis is very much saying, yes, they were the new incarnation of what was before the Flood. And that's bad, right? This is terrible."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3255.18,"end":3255.58,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3258.3,"end":3266.78,"speaker":"Fr Andrew Stephen Damick","text":"And so we have this element, sort of the central element here, the sort of this purpose. What are they trying to do?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3267.58,"end":3284.76,"speaker":"Fr Stephen De Young","text":"Yeah, right. This is in the beginning of Genesis 11, where it says in verse four, they said, come, let us build ourselves a city and a tower with its top in the heavens, and let us make a name for ourselves lest we be dispersed over the face of the whole Earth."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3285.56,"end":3321.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so they're trying to build this tower up to heaven, right? And that is in part going to sort of cement this union of humanity, right, in this empire. Now, this may be a ruined Sunday school also now. They think about it. So sort of like when the snake lost his legs, people read this as, like, oh, those dummies. They thought they could just build a really tall tower and it would reach God up in heaven."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3321.49,"end":3325.17,"speaker":"Fr Stephen De Young","text":"Right? Because of course, they knew that gods existed at a certain altitude."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3326.45,"end":3327.37,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3327.37,"end":3330.29,"speaker":"Fr Stephen De Young","text":"That's where you have to think that's what they think."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3330.45,"end":3335.41,"speaker":"Fr Andrew Stephen Damick","text":"But allow me to suggest, if that's what they were really trying to do, God wouldn't have had to do anything."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3336.22,"end":3336.62,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3337.26,"end":3382.18,"speaker":"Fr Andrew Stephen Damick","text":"He wouldn't have needed to stop them. He could have just let them go, been like, okay, guys, have fun. Right? So there's no reason to sort of punish that. It's its own punishment because it's stupid. Right. But this is something which God feels the need to put an end to. Right? So if we look at how this idea of someone wanting to ascend into heaven. Right. Someone wanting to ascend to the heavens. And this is part of how we know we're talking about a ziggurat. Because the word ziggurat literally means like a high or raised place."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3383.14,"end":3383.7,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3385.54,"end":3431.37,"speaker":"Fr Andrew Stephen Damick","text":"But we look at how that, that plays out in the rest of Scripture, right? So Deuteronomy 30:12, talking about the commandments of the Torah and obeying them. It says, it is not in heaven, that you should say, who will ascend to heaven for us and bring it to us, that we may hear it and do it. Right. So the idea here is that this reaching up to heaven is to go up there and bring something down, not to go up there and live up there. So this isn't Babel. Isn't man seeking some alternate way of salvation. Salvation's going to heaven and we're going to get there by building a tower. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3432.33,"end":3433.53,"speaker":"Fr Stephen De Young","text":"That's not how this works."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3434.25,"end":3462.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's to bring something down. And then St. Paul applies this idea even further in Romans 10, verse 6, where he says, but the righteousness based on faithfulness. I'll retranslate. It says, do not say in your heart who will ascend into heaven. Right? So he's referencing Deuteronomy. It says, that is to bring Christ down."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3463.54,"end":3466.82,"speaker":"Fr Stephen De Young","text":"Yeah. So it's again, it's this image of going up there to bring something down."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3467.23,"end":3488.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so someone may say, well, how do you know that what St. Paul's talking about in Romans is what's going on here? Well, what St. Paul says in Romans makes no sense if he's not talking about what's going on here. Right. Why would who will go up for us into heaven mean bring Christ down from heaven?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3489.07,"end":3494.19,"speaker":"Fr Stephen De Young","text":"Right. Like there's no frame that within which that makes sense. Like no one ever."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3494.19,"end":3494.59,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3494.83,"end":3495.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3495.23,"end":3496.03,"speaker":"Fr Andrew Stephen Damick","text":"Not other than this."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3496.73,"end":3498.09,"speaker":"Fr Stephen De Young","text":"Right, Right, exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3498.89,"end":3509.85,"speaker":"Fr Andrew Stephen Damick","text":"Right. So the idea here, the problem. The problem is not that they think they could build something tall enough to reach heaven. The problem is that they're trying to bring God down."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3510.73,"end":3518.81,"speaker":"Fr Stephen De Young","text":"Yeah. And this is exactly how idolatry works in the ancient world. Set up an idol, bring a God into it, make it do what you want, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3518.81,"end":3614.02,"speaker":"Fr Andrew Stephen Damick","text":"And then that. And they're doing that so that to sort of empower and preserve their empire. They want to bring God down to elevate themselves. Not literally elevate themselves, but in order to preserve this empire. So in the story, Yahweh does come down, but when God comes for a visit, right, it's not get out the tea and biscuits, right? It's things are going to get settled, right? So you might think, well, if God comes down into this scene, these people are all going to get wiped out, right? They're just going to get obliterated, Right. Like Babylon's going to be like Sodom and Gomorrah. But we just had a story that preceded this about the flood, right? And that's what happened in the story about the flood. So the first time this pattern happened, yes, everyone got destroyed. But then afterwards, God made a promise and he set down his bow in the clouds. And again, rainbow is not bow, like a pretty bow on a present. It's bow like a bow and arrow. God sets it down in the clouds. And that's a sign because every time you see it, you can say, yeah, it's still sitting there. He hasn't picked it back up again. That's the idea. So he's not going to destroy humanity again."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3614.5,"end":3615.78,"speaker":"Fr Stephen De Young","text":"He's laid down his arms."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3618.18,"end":3632.47,"speaker":"Fr Andrew Stephen Damick","text":"If humanity has become wicked like they did before the flood, and if God has promised not to wipe them all out again, what's the other option besides death by holiness? Exile."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3632.55,"end":3633.11,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3633.35,"end":3648.31,"speaker":"Fr Andrew Stephen Damick","text":"God has to separate himself from humanity, Right. So rather than them being able to sort of pull God down and make him do what they wanted, instead he pulls back and disperses them."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3648.95,"end":3669.12,"speaker":"Fr Stephen De Young","text":"Yeah. And so this is Genesis depicting the branches collapse as being an act of God. And it's bound up in this story of the city and the tower of Babylon here at the beginning of Genesis, chapter 11, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3669.12,"end":3720.05,"speaker":"Fr Andrew Stephen Damick","text":"That. That previous civilization was just as wicked. It was the reproduction of the one before the flood that was also wicked. And so God is the one who brought that down. And as we're going to talk about here in a little bit in the second half, established a new order, a new world order, after sort of the disassembly of the Bronze Age civilization. But before we get to that, here at the end of the first half of three, just a couple of notes, right? The first big note being about. We've been going through Genesis 1 through 11, basically these last three shows."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3720.37,"end":3720.93,"speaker":"Fr Stephen De Young","text":"Yep."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3721.81,"end":3830.64,"speaker":"Fr Andrew Stephen Damick","text":"Three episodes. And that's appropriate because we're talking about, Right. The three falls of man that are recorded there. There is sort of a shift in the way the narrative is told at this point in Genesis in the sense that starting with chapter 12 with Abraham, we're reading about the life of a guy, his son, his grandson and his great grandsons. Right. And it's sort of the narrative is going through the lives of these people, Whereas the first 11 chapters are a little more of a macro view in the sense that we don't like follow Enoch or Cain or Seth, like their life or even Adam and Eve, their lives. Over the course of their lives. We find out about their deaths in a genealogy. We don't read a narrative account of their life and their death. Right. So there is a. There are differences there. But it has become very common in scholarly circles and non scholarly circles, even some orthodox circles, to talk about this massive genre difference between Genesis 1:11 and Genesis 12 through 50, that these are really two, like they're all lumped together into the book of Genesis, but these are really two doing two completely different things."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3830.96,"end":3848.81,"speaker":"Fr Stephen De Young","text":"Yeah. That the beginning is quote unquote, myth, and then the rest is quote unquote history. As though the history part, you're supposed to take this pretty literally. But the stuff before that is all kind of big sweeping symbols and woo woo. Stories of the ancient world."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3848.81,"end":3850.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3850.57,"end":3852.81,"speaker":"Fr Stephen De Young","text":"That's the technical term for mythological studies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3852.81,"end":3854.89,"speaker":"Fr Andrew Stephen Damick","text":"By the way, is woo woo. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3855.77,"end":3858.65,"speaker":"Fr Stephen De Young","text":"Well, you have to draw it out to like three or four syllables."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3859.29,"end":3861.53,"speaker":"Fr Andrew Stephen Damick","text":"Well, then you just sound like you're doing a ghost impression."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3862.73,"end":3864.45,"speaker":"Fr Stephen De Young","text":"Well, ghosts are related to all of this."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3864.45,"end":3867.69,"speaker":"Fr Andrew Stephen Damick","text":"Or you could do herculoids like a hoingman."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3871.54,"end":3871.78,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3873.14,"end":3939.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so then the first 11 chapters, right. We just sort of set aside in terms of anything to do with history and try to extract something from it. Whether it's some kind of moral lessons, whether it's some kind of. I mean, lately in our contemporary world, it's basically like the only reason Adam and Eve are in the Bible is to tell us what manhood and womanhood are. Right. That's it. Right. And Cain and Abel you can't get much out of, except, you know, murdering your brother is bad. Skip all the genealogies, flood bad. Right. Tower of Babel don't talk much about at all. Don't really know what to do with it. Yeah. And so there's a Lot of problems with this. One of the biggest ones is that ancient people made no such distinction between myth and history."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3939.8,"end":3941.8,"speaker":"Fr Stephen De Young","text":"Yeah. It's just not a thing."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3941.96,"end":3949.33,"speaker":"Fr Andrew Stephen Damick","text":"Medieval people didn't even make a distinction between myth and history. Little people. This doesn't stop at late antiquity."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3949.57,"end":3982.57,"speaker":"Fr Stephen De Young","text":"Yeah. Like. Like, for instance, you know, in our next episode, we're going to talk about very briefly, I'm going to mention Saxo Grammaticus, the Danish historian from the 12th century. And he does a whole book of the. The, you know, the origins of the kings of Norway. Right. I'm sorry, of, well, the Danish kings and so forth. And he starts with what we would consider to be prehistory and then shows how they're kind of descended from those that are worshiped as gods up there, you know, on up to his own point in history. Like, it's all just one big narrative for him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":3983.21,"end":4053.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so nobody, I mean, you look at the genealogies of Christ in the New Testament, right. They don't indicate, like, okay, well, this Adam guy, Seth, you know, Then you get to Abraham, you're like, okay, now we're in. Now we're in history territory. Right. Like, there was not mythos just means story. Historia also means kind of story of a people. Right. These are really the same thing. Right. In the ancient world. And so part of the. What causes this problem for modern people is modernism. Right. That's why they have a problem reading Genesis 1 through 11 the same way they read 12 through 50, because of existing presuppositions that we already have. If you just come to it fresh with no knowledge of anything, you would not have any reason to read. To suddenly make this jump at chapter 11."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4055.43,"end":4055.63,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4055.63,"end":4063.67,"speaker":"Fr Andrew Stephen Damick","text":"And allow me to suggest that if what we've said so far on this show is correct. Right. You'd really have to split it at chapter nine."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4065.67,"end":4066.23,"speaker":"Fr Stephen De Young","text":"Hmm."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4066.71,"end":4204.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because chapter 11 is basically just talking about history the same way, like the books of the kings will, if what we're saying here is correct. So now you got to move it back to chapter nine. And you could make a better. You could make a better argument for that. You could say, well, see, before the flood, this is a different age. Right. Sort of this view of ages. There's like, paradise is an age before the flood is an age from the flood to Christ is an age. Right. You could try that. Maybe just move it back to nine. Maybe I'll turn this into my. Another version of my conversation with preterists. Like, why don't you just use 135ad it works better, right, than 70 anyway. You do the same here, maybe divided at 9, but nobody does that. Right. They include the Tower of Babel. But so if you approach not just Genesis 1 through 11, the Scriptures in general, with a definition of truth that's based in modernism, modern materialism specifically, then your definition of truth is what is true is what corresponds to material reality. Right. And so it's if I had a time machine and a video camera, right, or my phone, and somehow magically, my cell phone worked in the ancient past without towers and not be able to recharge it, and I recorded something, right, that happened, that this is what I would see. What is written here on this page is exactly what I would see, right. If I went back and did that. That's our modern sort of materials. They didn't have a concept of time travel and they didn't have a concept of recording devices in the ancient world. So when we criticize this, sometimes I think, and I think this because of comments we get when we criticize this, I think some of our listeners hear us saying when we say this, that we somehow don't believe that these things really happened, or we're saying that the writers of scripture didn't know or didn't care whether these things really happened."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4205.22,"end":4207.98,"speaker":"Fr Stephen De Young","text":"Yeah, really happened. Quote, unquote, Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4207.98,"end":4209.3,"speaker":"Fr Andrew Stephen Damick","text":"Quote, unquote, really happened."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4209.3,"end":4209.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4209.78,"end":4237.07,"speaker":"Fr Andrew Stephen Damick","text":"And just that phrase really happened. You're already in this idea of corresponds to material reality. Right. But I have no doubt, right, that if you did have a TARDIS and you went back and you talked to one of the writers of Scripture, it would take you a while to explain your question, frankly. Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4237.07,"end":4237.43,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4237.43,"end":4364.68,"speaker":"Fr Andrew Stephen Damick","text":"Like when you said to them, so are these the exact words Moses said? They'd be like? Well, yeah, I said that's what Moses said. No, no. Were those the exact words? But once you explained it to them, what you meant by the question, I'm pretty sure every one of the biblical writers would say, yes, would say, yes, this is what really happened. Yes, this is what actually happened. But that's not what's in their mind as they were writing it. That's not how they thought about history and thought about the world. And it's not how they define truth. Right. Because they didn't have the concept of time travel. They didn't have the right. They knew that if you asked eyewitnesses to something to describe what happened and what people said, they wouldn't 100% agree. Right. So they understood this and they understood that that didn't mean the event didn't happen. That meant people had different perspectives and they were able to hear different parts and see different parts and were looking from different angles. Right? They were actually very sophisticated in understanding that. And that's only one definition of truth. That's not the only definition of truth. That's not the only definition of truth that we use every day. So another common modern definition of truth is basically a utilitarian one. What's true is what works, right? So if I come to you, or let's say Shaquille o' Neal comes to you to sell you Gold Bond medicated cream, and he tells you, rub this on your knee and it'll help you with your dry knee, right? So you get some and you rub it on your knee, right? If it works, if your knee is less crusty the next day, right? Then you will say, yes, what Shaq told me is the truth. Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4364.68,"end":4366.08,"speaker":"Fr Stephen De Young","text":"And that was not in the notes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4369.68,"end":4371.52,"speaker":"Fr Andrew Stephen Damick","text":"Most of what I say is not in the notes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4371.6,"end":4374.76,"speaker":"Fr Stephen De Young","text":"Well, that's usually related to the notes in some way."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4374.76,"end":4386.01,"speaker":"Fr Andrew Stephen Damick","text":"I wasn't expecting Shaquille o' Neal and Gold Bond. He's everywhere, man. He's like in every commercial. He's selling you general car insurance. Gold Bond. Anyway, good for you, Shaq."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4386.41,"end":4387.13,"speaker":"Fr Stephen De Young","text":"Good for you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4387.69,"end":4444.46,"speaker":"Fr Andrew Stephen Damick","text":"Get your money. But that kind of utilitarian definition, right, again, that we use all the time, right? There's something is either true or false based on whether it actually works, right? Whether it actually does what it says on the tin, right? There's also various philosophical definitions of truth. Like we might say something is true because it expresses some first principle or gives us some insight, right? Into human behavior or the way society works or the way the world works, right? And we use this all the time when we talk about, right, we read. We. We read a work that we know is fiction, right? But we say, hey, something this novel said is really true, right? When we say that, we're not claiming that it's not fiction, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4444.7,"end":4445.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4446.38,"end":4464.06,"speaker":"Fr Andrew Stephen Damick","text":"We're claiming that it said something to. Or this film or whatever said something true in the sense that it provided some insight right? Into the way things work. But we're not saying, yes, the events depicted in this film are what really happened at some point to some person, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4465.82,"end":4467.42,"speaker":"Fr Stephen De Young","text":"The following is based on a true."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4467.42,"end":4502.15,"speaker":"Fr Andrew Stephen Damick","text":"Story and based on. In that they're both in English. So all of these examples, and we could give more examples of different ways that we think of truth, of something being true, right? All of these are really grounded in different definitions of reality, right? So again, that Idea of corresponding to material reality is based on being a materialist. Right. What's real is what's material is what that's only."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4502.23,"end":4506.39,"speaker":"Fr Stephen De Young","text":"Only. Only the material is real and everything else is something else."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4506.55,"end":4534.96,"speaker":"Fr Andrew Stephen Damick","text":"And what could be experienced with the senses. Right. So if I had the time machine, this is what I would see happening. Yeah. And some of those philosophical definitions. Right. If you ask Plato or somebody suffering from Plato brain, what truth is, it's not going to be anything you can see with your senses. Anything you can experience with your senses is not really going to be true."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4535.2,"end":4535.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4536,"end":4545.29,"speaker":"Fr Andrew Stephen Damick","text":"What's going to be true is going to be the first principles that underlie may be very far removed from the things you experience with your senses."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4545.53,"end":4549.21,"speaker":"Fr Stephen De Young","text":"Yeah. All this is just kind of an illusion of sorts. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4549.85,"end":4584.16,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's a shadow of a. Yeah, right. Of an image of an actual thing. Right. Yeah. And so. Right. They're in these. These different definitions of reality, but these are things we can navigate because we use these different definitions in different circumstances. If you come to me and say, hey, Father Stephen, your house is on fire. Right. My concern is going to be that this is true in a modern materialist sense. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4585.68,"end":4587.76,"speaker":"Fr Stephen De Young","text":"But what do you mean by fire?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4588.24,"end":4605.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Or I'm not going to sit and be like. To quote what will no doubt go down in history as one of the greatest films of all time. You'd run into a burning building to save someone you don't even know, but your marriage is burning down all around you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4607.3,"end":4611.78,"speaker":"Fr Stephen De Young","text":"Wow. Did you just reference Fireproof?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4611.86,"end":4617.66,"speaker":"Fr Andrew Stephen Damick","text":"I did. I just quoted Fireproof. Wow. Wow. This may be our first Kirk Cameron."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4617.66,"end":4620.54,"speaker":"Fr Stephen De Young","text":"Reference in the entire podcast, everybody."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4622.61,"end":4626.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like, I'm not going to be thinking that that's not where I'm going to go with it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4626.13,"end":4626.49,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4626.49,"end":4663.82,"speaker":"Fr Andrew Stephen Damick","text":"Are you talking about my marriage? Have I not been caring for my wife adequately? Right. I'm going to drive to my house and see if it is on fire. Like literally burning down. That's going to be my immediate concern. Right. There's not something wrong with that. That doesn't make me a materialist. Right. The fact that that's going to be my. My first interpretation. So what all this means the reason I'm rambling and ranting about all this and quoting Kirk Cameron. That actually wasn't Kirk Cameron. That was Kirk Cameron's friend. That's what he said to him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4663.98,"end":4665.42,"speaker":"Fr Stephen De Young","text":"Oh, right, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4665.42,"end":4687.11,"speaker":"Fr Andrew Stephen Damick","text":"Snap him out of his dogmatic slumber. All of this is aimed at. So if we're going to talk about the book of Genesis or any other Part of the scriptures we need to. The question we need to ask is, how is Genesis looking at reality? How is it defining truth?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4687.59,"end":4728.06,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Genesis is not simply giving a list of objective facts and that we should understand that it's not actually an introduction to the whole story of Babylon. It's a response to an existing story that the first listeners and readers would have already known. Like, they would have known, oh, he's. They're talking about Babylon. Let's hear this take on it. And it's. And this is the Bible's correction and commentary on what's going on with Babylon, with the collapse of that empire, and how that is to be understood by the people of God. This is what God is saying about this."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4728.54,"end":4738.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. Just like when Genesis 6 starts talking about a flood, none of the original hearers would have been like, oh, there was a flood."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4738.94,"end":4739.34,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4740.86,"end":4758.04,"speaker":"Fr Andrew Stephen Damick","text":"Everybody knew there was a flood. Everybody knew it wiped out a previous civilization. Right. So everybody knew Babylon had been founded, and everybody knew the Babylonian empire had collapsed. And everybody knew that that was the first in a string of dominoes that read led to worldwide civilization collapsing. Right? They all knew that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4758.44,"end":4759,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4759.08,"end":4761.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. So this is giving a perspective on it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4763.08,"end":4763.48,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4763.88,"end":4789.73,"speaker":"Fr Andrew Stephen Damick","text":"This is giving a perspective on it of what was actually happening. It's frankly apocalyptic in the sense that we've used it before on the show in the sense that it's revealing the spiritual reality behind those historical events. Right. And this is part of why it doesn't. Genesis 11 doesn't feel the need to give us a date."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4790.37,"end":4792.37,"speaker":"Fr Stephen De Young","text":"Yeah, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4792.77,"end":4802.53,"speaker":"Fr Andrew Stephen Damick","text":"It doesn't feel the need to give us a ton of geographic locators. This short little text just assumes we all know what's being talked about. Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4802.77,"end":4803.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4803.09,"end":4853.73,"speaker":"Fr Andrew Stephen Damick","text":"And then we see how it's being characterized. But so Babylon isn't just here in Genesis at the beginning of the Bible as sort of the first empire, but Babylon is seen as sort of the principle behind all world empires. And we could not only see this along the way through the Bible, but we even see this if we go from Genesis all the way to the end to Revelation. Right. And even near the end of Revelation, there's sort of an ominous. In Revelation 16, verse 19, there's sort of this ominous statement where God remembers Babylon. Right. And this isn't like, oh, God had forgotten about it. Right. But this is like, now it's time for another visit."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4854.45,"end":4855.01,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4856.13,"end":4879.24,"speaker":"Fr Andrew Stephen Damick","text":"And so then in chapters 17 and 18, we have this whole depiction. This is the whore of Babylon that's referred to who sits on seven hills like Rome. Right. Wait, what? Because Rome was the current Babylon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4879.72,"end":4881.08,"speaker":"Fr Stephen De Young","text":"Yeah. Right. Babylon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4881.08,"end":4924.7,"speaker":"Fr Andrew Stephen Damick","text":"The type St. Peter represents. This references this, too. But so this is true for Revelation in General, right? So St. John says in First John, you have heard that an Antichrist will come and already Antichrist, plural or at large in the world. Right? So the same thing is true with Babylon, right? Yes, there will be a last world Empire. Right. But there's already been a first, and there's a whole bunch in between, and they're all Babylon because they're all founded on that same spirit."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4925.26,"end":4925.7,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4925.7,"end":4953.02,"speaker":"Fr Andrew Stephen Damick","text":"They're all founded on this idea of uniting humanity, humanity uniting itself toward a common purpose, which is its own glory, and trying to drag God down and put him in service of it. So here's my attempt at cancellation number 352. The current one is the United States of America."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4955.66,"end":4956.22,"speaker":"Fr Stephen De Young","text":"There we are."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4956.22,"end":4957.34,"speaker":"Fr Andrew Stephen Damick","text":"Am I being canceled already?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4958.06,"end":4959.5,"speaker":"Fr Stephen De Young","text":"I'm not canceling you, but."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4961.66,"end":4963.82,"speaker":"Fr Andrew Stephen Damick","text":"Up Until World War II, it was the British Empire."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4964.31,"end":4970.79,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, the reality is we are the. We are the current world empire that's pulling the most strings and, you know, put."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":4970.87,"end":5047.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't think it's gonna last much longer, if that makes anybody feel any better. But that gives me one fuzzy feeling. Yeah. Who knows what happens next? Right? All right, well, the Brits have already experienced the end of that, but. Yeah, uniting the world through trade, et cetera, et cetera, et cetera. Right? So this is. But the key here. The key here is that I'm not saying the United States is the last one. I'm not saying it's the ultimate one. I'm not saying. And this is part of the problem, just like people who read Revelation, and Daniel, not so well want to play pin the tail on the Antichrist, right? They want to pin the tail on one world government, right? So they almost never pick the United States, though. They usually pick the eu, Right? And frankly, I don't know if the EU could run a successful, like, toothbrush distribution campaign, let alone establish a New World Order at this point. But. Okay, but that pin the tail on the New World Order is not new either, Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5047.35,"end":5047.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5047.91,"end":5166.87,"speaker":"Fr Andrew Stephen Damick","text":"It was Napoleon, right? It was Hitler. It was Stalin. It was. I mean, right. All of these. Right. Evil empires of the past have all been. Right, The One, right? And none of them yet are the One. Eventually, there will be a last one. But the point is. And the point here is not to rag on the United States of America, but to point to what happened after World War II with the Ascendancy of the United States, economy, is that we entered into that imperial position. And so there will always be that temptation for this empire, just like all the other ones, to try to unite humanity around its own glory, to try to sort of demote God to being underneath it and use God for its purposes, to justify what it's going to do. And so this is something. I mean. I mean, Rome was doing this while the apostles were alive. At least a couple of them, like St. Paul, were Roman citizens. Right. So this doesn't mean they were evil. This doesn't mean St. Paul stopped praying for the emperor because he decided the whole Roman Empire was Satanic. He wanted to convert the emperor to Christianity. And that ultimately happened with St. Constantine. And the empire was changed and it crumbled. Bad news for anyone who doesn't realize the Byzantine Empire fell. And it's interesting that one of the marks of Saint Constantine, Saint Theodosius Christianizing of the empire, was that after that, neither in the west or the east did the empire actually function as a world empire."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5168.71,"end":5169.27,"speaker":"Fr Stephen De Young","text":"Hmm."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5173.03,"end":5190.44,"speaker":"Fr Andrew Stephen Damick","text":"They weren't actively going out and conquering and consuming. Right. The kind of things that were said about the Roman Empire before that. Right. They've created a wasteland and called it peace. Doesn't really work once you get to the Christian emperors. In fact, that may have been why its days were numbered."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5190.84,"end":5191.56,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5193.16,"end":5196.92,"speaker":"Fr Andrew Stephen Damick","text":"It was no longer playing by the world's rules. And, you know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5197.48,"end":5199.2,"speaker":"Fr Stephen De Young","text":"Yep. All right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5199.2,"end":5199.96,"speaker":"Fr Andrew Stephen Damick","text":"People still were."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5200.28,"end":5205.25,"speaker":"Fr Stephen De Young","text":"Well, all that said, we're gonna go ahead and go to our first break. We'll be right back."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5205.89,"end":5222.21,"speaker":"Fr Andrew Stephen Damick","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5228.14,"end":5277.18,"speaker":"Fr Stephen De Young","text":"For all of us, male or female, parent or not. That's what it's often like, isn't it? It's at the end of our own tether that the miracle happens. It is in our greatest weakness that God's strength is known. It's when we decrease that he can increase. It's in losing our life that we find it. To put it another way, it's in the spot where St. Morwena falls, falls down exhausted, that her spring rises up. It's when the people of God curse Moses in the wilderness and wish themselves back in Egypt that they hear the crack of the staff, the gush of water through the rock. It's when God himself is spat upon and mocked and bleeding and dead that the glorious resurrection is ushered in."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5278.22,"end":5281.02,"speaker":"Fr Andrew Stephen Damick","text":"From Seven Holy Women Conversations with Saints."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5281.02,"end":5286.23,"speaker":"Fr Stephen De Young","text":"And Friends, now available as an audiobook at Audible, Amazon and itunes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5286.79,"end":5302.95,"speaker":"Fr Andrew Stephen Damick","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5305.03,"end":5341.04,"speaker":"Fr Stephen De Young","text":"Welcome back, everybody. It's the second part of our show. Show. We're talking about the Tower of Babel. And we just, I think it was one of our longer, longer first halves, about 90 minutes there. We just went through the whole context of the building of the city and Tower of Babylon. Again, Babel equals Babylon in Scripture. So now we're going to kind of shift gears a little bit, and we do have a caller waiting, but I think we're going to hold on to that call until the point in this half where what she's asking about makes the most sense. So just hold on, caller. We hear you. We know you're thinking."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5342.24,"end":5345.36,"speaker":"Fr Andrew Stephen Damick","text":"I think I'm supposed to mention I have a new book out, but here's the thing."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5345.44,"end":5346.76,"speaker":"Fr Stephen De Young","text":"Oh, yes, you do have a new book out."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5346.76,"end":5354,"speaker":"Fr Andrew Stephen Damick","text":"I don't want to say the name because that way this podcast will age better because I kind of always have a new book out."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5354.48,"end":5356.72,"speaker":"Fr Stephen De Young","text":"I hope that's always going to be the case, Father."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5356.8,"end":5366.33,"speaker":"Fr Andrew Stephen Damick","text":"So, Right. If we don't say the name, six months from now, somebody listening to this will be like, oh, Father Stephen has a new book out. And then just whatever it is, whatever it is, they'll go get it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5366.49,"end":5373.13,"speaker":"Fr Stephen De Young","text":"There we go. And what is new when we're talking about, you know, cosmic time anyway, so. Yeah, exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5373.77,"end":5378.17,"speaker":"Fr Andrew Stephen Damick","text":"So the writing of books, there is no end. Ecclesiastes. Yep."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5380.01,"end":5390.82,"speaker":"Fr Stephen De Young","text":"All right, so something happens after this event, after the, the Babel event, as it were. Right. What's going on in connection with that?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5391.22,"end":5503.13,"speaker":"Fr Andrew Stephen Damick","text":"Well, so this attempt to restore the antediluvian ordering of the world gets ended and something else is given to replace it. Right. So the resulting state of affairs, also seen by the Torah to be the product of God's action. Right. So we see this laid out in large part, actually, in Deuteronomy, chapter 32. I know there's some folks out there who get excited just mentioning that chapter, which is one of the oldest parts of the Torah. And you know what's funny is that's actually me saying that is probably more likely to get me canceled than saying that the US Is an empire because there's somebody out There going, Moses wrote all of it at the same time. Right. But when I say it's the oldest. Right. Again, the Hebrew that the oldest versions of the Torah that we have today is written in did not exist at the time Moses lived. So things have been updated, things have been translated, it's in a different Alphabet, etc. Etc. So when I say this is one of the oldest portions, I mean Deuteronomy 32. The other big one is Exodus, chapter 15, the song of the Sea. These are the parts of the Torah in Hebrew that show the least sign of editing. So they're in a very antiquated form of Hebrew that's frankly very hard to translate."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5503.45,"end":5505.85,"speaker":"Fr Stephen De Young","text":"Yeah. Because there's almost nothing else like it out there."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5506.17,"end":5535.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a lot of words that are only used here. One of the verses we're about to quote has a verse. Has a word that's only used here. That's a Babylonian loanword. Right. It's not even a Hebrew word. So. Yeah, so that's what I mean by oldest part, meaning oldest in the sense that it's still in sort of its original form. Right. It hasn't been edited or updated or smoothed out the way some other sections have."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5535.62,"end":5536.1,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5536.34,"end":5548.36,"speaker":"Fr Andrew Stephen Damick","text":"Into later Hebrew. So this starts at Deuteronomy 32, verse 8, which we've quoted a bunch on this show."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5548.52,"end":5566.52,"speaker":"Fr Stephen De Young","text":"Yep, Yep. So when the Most High gave to the nations their inheritance, when he divided mankind, he fixed the borders of the peoples according to the number of the sons of God. And that's the. From the Hebrew version. In the Greek Old Testament, it's according to the number of his angels."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5566.84,"end":5570.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now that's the. According to the Dead Sea Scrolls, Hebrew."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5571.12,"end":5572.48,"speaker":"Fr Stephen De Young","text":"Oh, yeah. The sons of God. Reading."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5572.48,"end":5580.96,"speaker":"Fr Andrew Stephen Damick","text":"What you find in the later Masoretic text is they've edited sons of God into sons of Israel, which makes no."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5580.96,"end":5582.96,"speaker":"Fr Stephen De Young","text":"Sense because Israel doesn't even exist at this time."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5583.28,"end":5592.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So people just thought the Greek was weird. Well, that would have been the sons of Israel in the sense of, like, Israel, like Jacob."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5593.28,"end":5594.2,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5594.2,"end":5604.06,"speaker":"Fr Andrew Stephen Damick","text":"Which would give you 12. And then you get some people who do the split special pleading of like. Well, there's like 70 or 72 people who go down into Egypt. Egypt at the end of the thing."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5604.38,"end":5616.46,"speaker":"Fr Stephen De Young","text":"Wow. But this follows. I mean, this is, you know, there is a reference to the number of the peoples in Genesis, what, 10? Yeah. You've got the table of nations and Israel's not there."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5616.78,"end":5626.62,"speaker":"Fr Andrew Stephen Damick","text":"So you got to ignore. Yeah, you got to ignore Genesis 10. You got to ignore how, like, all the church fathers at all Second Temple Jewish literature reads this. And you got to say that the Greek translation got it wrong."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5626.94,"end":5627.42,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5627.42,"end":5690.41,"speaker":"Fr Andrew Stephen Damick","text":"But if you. If you really want to defend a Hebrew text from 1000 AD as being. No, this is the right one. Okay. You know, have fun with that. I have no interest in doing that. Right. But so this is the most high God, right. Yahweh gives to when he divides mankind. Right. Tarot, Babel fix their borders according to the numbers of the sons of God, of which there were 70 or 72. And as you mentioned in Genesis 10, we have sort of the table of nations, and there are 70 nations. So this is a side note. This is me grinding an axe, slash, beating a dead horse. But one of the worst things about English Bibles, mostly English New Testaments, is the fact that they use the word gentiles."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5693.21,"end":5693.85,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5694.17,"end":5695.37,"speaker":"Fr Andrew Stephen Damick","text":"Which is a Latin word."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5696.17,"end":5696.57,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5696.89,"end":5702.17,"speaker":"Fr Andrew Stephen Damick","text":"For one thing. So there's no reason to use it. And they're using that to translate the word nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5705.14,"end":5705.54,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5706.26,"end":5732.69,"speaker":"Fr Andrew Stephen Damick","text":"And inconsistently. Right. Because sometimes they will translate it as nations. Right. But it both gives this sort of ethnic thing of Jews and Gentiles. Like, this is an ethnic issue of peoples. Right. But what that's translating is the phrase nations, which is a reference to like, the most accurate translation of that would be pretty much every time you see gentiles would be to have the 70 nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5733.09,"end":5753.21,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, it's weird because, like, gentile in its oldest form simply does mean nations. Like, it's related to the word. You know, the. The word gens, G, E, N, S, which means a kind, you know, But I think. I think in the medieval period, it comes to mean non Jews. Yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5753.21,"end":5754.13,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's weird."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5754.45,"end":5756.21,"speaker":"Fr Stephen De Young","text":"Yeah. In English. In English, I mean."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5756.29,"end":5764.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Oh, yeah, yeah. Because like, I mean, Thomas Aquinas uses that word to mean Muslims."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5764.98,"end":5766.1,"speaker":"Fr Stephen De Young","text":"Oh, yeah. That's fun."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5766.42,"end":5774.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But that's a whole other digression. But my point being, this idea of the 70 nations is what lies behind that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5774.82,"end":5775.38,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5776.18,"end":5854.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's these 70 nations that were divided. Right. And are out there and. No, I know, I know some of you out there who still have the spreadsheet in your head are thinking, well, wait a minute, are there still only 70? Do they drop out and like new ones when a new nation forms it. We're not talking about nation states. Right. We're not talking. This is symbolic number. Right. The idea here is that you have the 70 nations and then you have Israel, which is not a nation in which God creates for himself. Right. But the purpose of the creation of Israel as this separate nation is through that nation to save the 70 nations. Right. So, yeah, this is. That's a very literal reference to the nations. Right. That means. Right. The peoples of the world. So then in. That's what we're told happens at the Tower of Babel. Then in Deuteronomy 32:17, we see that things didn't sort of go as planned."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5856.01,"end":5856.41,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5856.41,"end":5861.21,"speaker":"Fr Andrew Stephen Damick","text":"Or didn't go the way they should have. It would have been better."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5861.9,"end":5915.53,"speaker":"Fr Stephen De Young","text":"So you get they sacrificed to demons that were no gods, to gods they had never known, to new gods that had come recently, whom your fathers had never dreaded. And we should probably say where it says, to demons that were no gods, to gods they had never known. If you read the first part of saying these demons weren't really gods, and then it seems like it's talking about two different groups of beings, like to demons and then to gods that they had never known. But the point in saying that they were no gods, remember? And we talked about this, I think our. Our very first couple of episodes, that that gods in almost every ancient language has this sense of being rulers. They were. They were ruling. Right. So the point is, is that these demons are not really the rulers, you know, that God is the ruler. So they're not truly that. But then the verse proceeds to use that exact same word because that's the shorthand word to refer to spirits."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5915.53,"end":5935.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the word that's translated demons there in Hebrew is shedim, which is putting a Hebrew plural ending on shedu, which is a Babylonian word for a territorial spirit, meaning a spirit. That's the spirit of a particular region or place or geographical feature."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5936.09,"end":5937.77,"speaker":"Fr Stephen De Young","text":"Yeah, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5940.17,"end":5959.85,"speaker":"Fr Andrew Stephen Damick","text":"So they were not supposed to start worshiping the spirits of these places once they got to these places. Right, is the idea. But that's not sort of the end of the story right here at Deuteronomy 32. Because when we get to verse 43, there's this promise of this reckoning."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5960.09,"end":5973.97,"speaker":"Fr Stephen De Young","text":"Yeah, okay. So this one says, rejoice with him, O heavens. Bow down to him all gods, for he avenges the blood of his children and takes vengeance on his adversaries. He repays those who hate him and cleanses his people's land."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5976.69,"end":5979.41,"speaker":"Fr Andrew Stephen Damick","text":"So bow down to him, all gods."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5979.89,"end":5982.93,"speaker":"Fr Stephen De Young","text":"Oh, yeah, right, right. Yeah, yeah, exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":5983.33,"end":6032.92,"speaker":"Fr Andrew Stephen Damick","text":"So this is sort of. So within Deuteronomy, the movement of Deuteronomy 32, right. You have the dispersal of the peoples into the nations. Right. So this attempt at unifying everything is thwarted Right. And things are distributed, but then when they're out there, Distributed. Right. God has pulled himself back away from humanity so humanity won't be destroyed. He appoints these angelic beings to govern and shepherd the nations, but those nations start worshiping them and start worshiping other spirits. Spirits instead of God. Right. And so the time is coming when God is going to take revenge on those demonic spirits who have deceived the nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6032.92,"end":6035.56,"speaker":"Fr Stephen De Young","text":"Yeah. And put things back the way they're supposed to be."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6035.8,"end":6052.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. And that's sort of the arc here in Deuteronomy 32. And we're also going to quote again. We've quoted it before on the show, but it's going to be relevant as we go forward tonight. So we're going to just reference it again so people have it fresh in their minds. This is the comment in Deuteronomy 4:19."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6052.91,"end":6096.55,"speaker":"Fr Stephen De Young","text":"Okay. Yeah. So Deuteronomy 4:19. Beware, lest you raise your eyes to heaven. And when you see the sun and the moon and the stars, all the hosts of heaven, you be drawn away and bow down to them and serve them. Things that the Lord your God has allotted to all the peoples under the whole heaven. So, yeah, it's this repetition of don't engage in idolatry. And it's this connection, of course, with the gods, with the host of heaven, the angelic beings, with, you know, astronomical bodies. Right. And there's this reference to this allotment of all the peoples under the whole heaven. So it's kind of. Yeah, yeah, exactly. All the nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6096.55,"end":6106.99,"speaker":"Fr Andrew Stephen Damick","text":"And so this is the flip side. Right. So because Israel is specially created by Yahweh, the God of Israel, for himself."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6108.02,"end":6108.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6108.58,"end":6113.46,"speaker":"Fr Andrew Stephen Damick","text":"One of the worst things they could do is for them to be like the nations and start worshiping those other."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6113.7,"end":6114.9,"speaker":"Fr Stephen De Young","text":"Yeah, exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6115.38,"end":6125.38,"speaker":"Fr Andrew Stephen Damick","text":"Because they're the ones who have sort of direct access to God Most High, through whom he intends to save those other nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6125.46,"end":6147.18,"speaker":"Fr Stephen De Young","text":"Yeah. So before we move forward with some other really interesting quotes that you folks probably out there haven't heard before, we actually have a caller calling in who has a question that's relevant to this, and that is a guy with a name that is very similar to yours. His name is Steven Young. Can you believe it? Steven Young. Stephen, are you there?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6147.9,"end":6178.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm here. I'm thrilled. I came for the Giants. I stayed for the theology. Absolutely love the show. Are you the former quarterback for the San Francisco 49ers? No, but that was my dad's favorite quarterback, and my brother's name is Neil Young. Which was his favorite singer. I hope he will remember it all comes together. You have other brothers named Crosby, Stills and Nash?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6180.46,"end":6181.34,"speaker":"Fr Stephen De Young","text":"Please say yes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6182.7,"end":6184.54,"speaker":"Fr Andrew Stephen Damick","text":"I wish I did. Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6185.5,"end":6193.76,"speaker":"Fr Stephen De Young","text":"Okay. All right. We're not going to require that of you. So, Stephen, what is. What is your question? Comment, concern, accusation?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6196.88,"end":6232.74,"speaker":"Fr Andrew Stephen Damick","text":"My question is, so obviously have the sons of gods over the 70 nations? 70 nations. What is to be said about the nations that were outside, like, that weren't listed, you know, like. And obviously, I understand it's not nation states. It's more like, you know, different ideas than that. But what about the other parts of the world? Did they also have divine being over them? Or is it just like it was these 70 and then they just kind of spread out across the world and of course, the being still looked after them wherever they went? How would that work?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6233.46,"end":6248.54,"speaker":"Fr Stephen De Young","text":"I mean, so, I mean, at least the way that the scripture depicts it is that this is the origin of all humanity because these are the people descended from Noah and his sons. Right? So what the scripture is. Is saying is that this is everybody."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6249.34,"end":6249.78,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6249.78,"end":6292.39,"speaker":"Fr Stephen De Young","text":"Right. That there aren't other nations out there. Now, is it possible that if the flood was not truly, truly worldwide, that there are other nations out there? I don't know. But I mean, that's not what. That's not the picture that the scripture is giving. But I do think that even if there are other nations out there, which, again, I don't know, that's just not the Bible story, that they're included in this exact same dynamic, you know, because if there was some nation out there that would. That remained truly faithful to God, then there would have been no point in creating Israel. Right. Why would God have needed to do that? I don't know. Father, do you have anything you wanted to add or correct or."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6292.95,"end":6449.7,"speaker":"Fr Andrew Stephen Damick","text":"Actually, this is. I'll explain. Explain a little more. When I said that 70 is a symbolic number, right. The idea is that 7 represents the whole or completion. And this is because there are seven planets, counting the sun and the moon. I'm not being facetious. In the mind of ancient people, there were seven planets, including the sun and the moon. And so seven is used. This is where what we now call the menorah comes from. Right. The candle stand that was in the temple and the tabernacle that we have on our altar in Orthodox churches. The reason there's seven lamps is that there were seven lights in the heavens. The sun, the moon, and the five planets. And so that represents sort of the whole. It's sort of a representation of microcosm Right. Literally of the cosmos. And so the reason why the number is set at 70 is not because, just objectively, there happened to be 70 nations in the world at the time. It's to convey the whole. Right. The whole world. Right. That makes sense. And St. Matthew does something similar to this in his genealogy of Christ where He has the 14 generations and then the 14 generations. And the 14 generations. So he has like six sevens and then he. And then Christ is beginning the seventh seven. Right. And sort of bringing it. Bringing it all to completion. Right. If you compare his genealogy to the genealogies of the Old Testament, in order to get 14. 14, 14, he has to edit the. All little bit. Right, I get you. But he's wanting to use that symbolic number to convey that meaning. So that's why they kept it to 70. Right. Even if they. If the. The writers could have listed more, they kept it to 70 to convey that, the whole thing. And if you look at the. There's a Romanian icon that I know we've posted the. The JPEG of several times that depicts this. It shows sort of these people from different nations walking away from the Tower of Babel with angels sort of surrounding their head. And that icon includes a person who's clearly supposed to be Chinese and some other people from other nations that aren't listed in the. In Genesis 10."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6450.18,"end":6452.34,"speaker":"Fr Stephen De Young","text":"Yeah, there's a Native American in that icon."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6452.74,"end":6453.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6454.38,"end":6457.02,"speaker":"Fr Stephen De Young","text":"Yeah. So does that answer your question, Stephen?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6457.74,"end":6475.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that absolutely does. And I was atheist for most of my life, and if I would have found orthodoxy earlier on, I would have come on board way earlier. Just it makes so infinitely more sense than the common Protestantism that I was hearing in America. Bless you both and have a fantastic night."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6476.46,"end":6486.87,"speaker":"Fr Stephen De Young","text":"Thank you very much. All right, moving forward, let's talk about Plato. See, not everything is Plato, brain. There's some good things to say about Plato."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6487.03,"end":6494.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I am going to tease Plato a bit at the end of this. But anyway, what's he going to do about it?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6496.47,"end":6497.99,"speaker":"Fr Stephen De Young","text":"He's cool with it either way."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6500.79,"end":6554.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm a particular person. He doesn't care about me. So this idea that the nations were divided by the most high God and that sort of the spirits who govern those nations were sort of assigned to them, is not something you only find in the Bible. This is pretty much how the pagans saw it working also. And Plato is a really good example of this. And so we're going to go through a couple quotes from Plato where he talks about this in two different places. The first one is in The Critias, which. The Critias is the place where Plato talks about the antediluvian civilization. For Plato, that's Atlantis."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6555.25,"end":6555.65,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6555.65,"end":6560.19,"speaker":"Fr Andrew Stephen Damick","text":"Which is this great advanced civilization before it gets destroyed by a flood."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6560.99,"end":6666.97,"speaker":"Fr Stephen De Young","text":"How about that? Okay, so this is the Critias, a quote from section 109B through D. In the days of old, the gods had the whole earth distributed among them by allotment. There was no quarreling. Yeah, allotment. Yeah, exactly. There was no quarreling. For you cannot rightly suppose that the gods did not know what was proper for each of them to have. Or knowing this, that they would seek to procure for themselves by contention that which more properly belongs to others. They, all of them, by just apportionment, obtained what they wanted and peopled their own districts. And when they had peopled them, they tended us, their nurselings and possessions, as shepherds tend their flocks, accepting only that they did not use blows or bodily force as shepherds do, but governed us like pilots from the stern of the vessel, which is an easy way of guiding animals, holding our souls by the rudder of persuasion according to their own pleasure. Thus did they guide all mortal creatures. Now, different gods had their allotments in different places which they set in order. Hephaestus and Athena, who were brother and sister and sprang from the same father, having a common nature and being united also in the love of philosophy and art, both obtained as their common portion this land which was naturally adapted for wisdom and virtue. And there they have implanted brave children of the soil and put into their minds the order of government. Their names are preserved, but their actions have disappeared by reason of the destruction of those who received the tradition and the lapse of ages. So he's talking about, you know, Athens. He's talking about Greece. Right. Which it's interesting to me, he says are, what is it naturally adapted for wisdom and virtue."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6667.52,"end":6679.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Athens is. Yeah, yeah. As opposed to, you know, there's no good Spartans and stuff. Right. But yeah, this isn't Sparta. Notice also what he's saying about there was no quarreling."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6680,"end":6680.4,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6680.96,"end":6684.52,"speaker":"Fr Andrew Stephen Damick","text":"Or that they. They were gentle shepherds at all."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6684.52,"end":6684.8,"speaker":"Fr Stephen De Young","text":"This."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6684.8,"end":6690.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's making these distinctions because those distinctions are referring to this golden age."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6691.6,"end":6692.16,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6692.32,"end":6717.77,"speaker":"Fr Andrew Stephen Damick","text":"This is the way things used to be. Right. So now Plato knew the Iliad was out there, Right? Now the gods go to war with each other over territory. Right. Now the gods are gentle is not a good descriptor of many of the Greek gods and their dealings with humanity. Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6717.77,"end":6721.21,"speaker":"Fr Stephen De Young","text":"Not even a little bit. As we will see next time."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6722.36,"end":6779.35,"speaker":"Fr Andrew Stephen Damick","text":"So he's referring to this previous golden age. There was this period of time when these spirits were apportioned out to the nation. We had ours, and they were gentle and they didn't fight and everything was wonderful. But something has changed for Plato. The other place where he talks about this is in his discourse on the laws. And I know the Plato fans out there, the ones that still remain who didn't get mad at me and stop listening aren't fans of the laws either, because it's generally regarded to be the last thing that Plato wrote and did not be very good and to probably be unfinished. But the particular piece that we're going to read is another place where he talks about this. Same thing, the same idea, the same golden age and what it's like."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6779.59,"end":6855.97,"speaker":"Fr Stephen De Young","text":"All right, so this is Plato again. I must do as you say. Well, then, tradition tells us how blissful was the life of men in that age, furnished with everything in abundance and of spontaneous growth. And the cause thereof is said to have been this. Chronos was aware of the fact that no human being, as we have explained, is capable of having irresponsible control of all human affairs without becoming filled with pride and injustice. So, pondering this fact, he then appointed as kings and rulers for our cities not men, but beings of a race that was nobler and more divine, namely demons. He acted just as we now do in the case of sheep and herds of tame animals. We do not set oxen as rulers over oxen or goats over goats, but we, who are of a nobler race ourselves, rule over them. In like manner, the God, in his love for humanity, set over us at that time the nobler race of demons, who, with much comfort to themselves and much to us, took charge of us and furnished peace and modesty and orderliness and justice without stint, and thus made the tribes of men free from feud and happy. And even today, this tale has a truth to tell, namely that wherever a state has a mortal and no God for ruler, there the people have no rest from ills and toils."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6857.49,"end":6861.16,"speaker":"Fr Andrew Stephen Damick","text":"So good old Plato, not a big fan of democracy."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6861.72,"end":6867.4,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yes. People, you know, some beings get to rule because they're just better."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6867.8,"end":6965.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. You wouldn't have an ox lead an ox, would you? Right, but so you can see here, this is the dynamic Cronus, right, Zeus's father, right, is sort of the most high God in this. In this golden age. And he apportions out to the spirits, right, to lead all of these different groups of People so that they could all be happy back in the golden age. This leads to them all being happy and having all the things they need and everything is wonderful. That's not where we live anymore, right? That's not where we live anymore. So you see both this idea of the apportionment, but also this kind of golden age view like the Babylonians have. And that even connected to the antediluvian world. So now moving on from Plato, now we'll go to a Christian, right? This isn't something that's just sort of in the ancient world. And then Christians just kind of Babylon, whatever, right? Gods, the nations are demons. Sure, whatever. This is still important when we get into an important idea once we get into early Christianity. And as just one example, Saint Dionysius the Areopagite talks about this in his Celestial hierarchies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":6965.67,"end":7047.69,"speaker":"Fr Stephen De Young","text":"Okay, so this is Saint Dionysius. He says, hence the word of God. And that's capital W, everybody. The word of God has assigned our hierarchy to angels by naming Michael as ruler of the Jewish people and others over other nations for the most high established borders of nations according to the number of the angels of God. Deuteronomy 32 reference there. But if anyone should say, how then were the people of the Hebrews alone conducted to the supremely divine illuminations? We must answer that we ought not to throw the blame of the other nations wandering after those which are no gods upon the direct guidance of the angels, but that they themselves by their own declension fell away from the direct leading towards the divine being through self conceit and self will, and through their irrational veneration for things which appeared to them worthy of God. Even the Hebrew people are said to have suffered the same thing. For even over the other nations from whom we also have emerged, certain not alien gods were wont to preside. Yet there is one head of all. And to this the angels who religiously direct each nation conduct those who follow them. So he's sort of placing the blame on the nations and not on the angels that governed them. Father Stephen, you still there? Did we delusio?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7048.25,"end":7049.61,"speaker":"Fr Andrew Stephen Damick","text":"I am. You cut out for us."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7049.61,"end":7052.09,"speaker":"Fr Stephen De Young","text":"Oh, okay. It's just a big pause."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7054.09,"end":7055.77,"speaker":"Fr Andrew Stephen Damick","text":"People are panicking. Oh, no."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7055.77,"end":7058.97,"speaker":"Fr Stephen De Young","text":"Yeah, I was like, oh, oh, technical difficulties again."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7060.49,"end":7063.65,"speaker":"Fr Andrew Stephen Damick","text":"Our nemesis sees. Yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7063.65,"end":7071.87,"speaker":"Fr Stephen De Young","text":"I mean, so what's that bit about certain not alien gods, right? What does he mean? Like those are the gods that were assigned to them. They weren't from somewhere else? Is that what he means by that?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7072.59,"end":7086.55,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there are. There are Two things that. That happen here. Right. So St. Denisius wants to make clear that God didn't like, assign the nations to demons. Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7086.55,"end":7087.07,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7087.63,"end":7165.7,"speaker":"Fr Andrew Stephen Damick","text":"So what he's not saying is that, oh, yeah, God intended for them to worship Zeus and for these other people to worship Marduk and these other. Right. That's not at all what he intended, that these were angels that were assigned. And so in one of the next quotes, we're going to read a lengthy one. This is going to be disambiguated a little more, but there are a few different things that happen. So in some cases, and this is in there, in Saint Dionysus as well, the people start worshiping some other spirit other than the angel God assigned. In some cases, that angel who was assigned to them falls and accepts their worship. And then there's probably other mixed cases. Right. You've got giant spirits in there and. All right. Other demonic spirits. Right. But the idea that Saint Dionysius is trying to get across is that. Right, again, God was not saying, okay, I'm the God of the Israelites and these demons are the gods of these other nations. Right. Like he gave the nations to a bunch of demons."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7165.86,"end":7166.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7166.26,"end":7183.21,"speaker":"Fr Andrew Stephen Damick","text":"Gave them away, wasn't interested in them. Right. That this is part of his plan toward ultimately redeeming them. Right. And that it's the corruption of the people that caused this state of affairs, not God's action that caused the state of affairs."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7183.37,"end":7222.92,"speaker":"Fr Stephen De Young","text":"Right, right. So, yeah, and this is why then we get, you know, these references in Scripture to all the gods of the nations are demons. Right. And then the references in St. Paul, Ephesians, chapter 6, to fighting against powers and principalities. Right. And then again, Psalm 82, which we've talked about many times, you know, God stands up. Yeah, God stands up in the council of the gods and renders judgment and kind of reads off a list of charges and then. And then destroys them at the end. As he rises, as he arises from."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7222.92,"end":7245.14,"speaker":"Fr Andrew Stephen Damick","text":"The dead, he arises to judge the earth and inherit from all of the nations. Right? Yeah, exactly. That sort of. The psalm dramatizes what was already promised in Deuteronomy 32, 43. And then, of course, we celebrate the fulfillment of that on holy Saturday as Christ rises from the dead and all authority in heaven and on earth is given to him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7245.54,"end":7256.26,"speaker":"Fr Stephen De Young","text":"Yep. Yeah, exactly. So, okay, well, we have another caller and we have Celeste on the line, and she wants to ask about these fallen angels. So, Celeste, are you there?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7257.91,"end":7259.11,"speaker":"Fr Andrew Stephen Damick","text":"I'm here. Can you hear me?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7259.35,"end":7265.03,"speaker":"Fr Stephen De Young","text":"Yes, we hear you. Welcome to the Lord. Of Spirits podcast. Celeste, what exactly is on your mind? Thank you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7265.51,"end":7293.48,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so I'm thinking about the crystallized state you first spoke about during your first episodes on the Falls of Men and Angels. And I don't understand how if we determine by our own lives whether we are, so to speak, goats or sheep at our death, Christ merely separates us. How does praying for the repose change the repose from goats to sheep? And when does the crystallization happen?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7294.68,"end":7298.2,"speaker":"Fr Stephen De Young","text":"All right, all right, Father Steve, I'm going to let you go ahead and just take this one first."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7299.16,"end":7312.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay? So, yeah, so I thought you were going to ask a different question, but this question than the one I thought you were going to ask. So I'm glad this is the one you ask, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7312.34,"end":7312.74,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7314.58,"end":7567.19,"speaker":"Fr Andrew Stephen Damick","text":"We are able, during our lives to repent right, to ourselves, take the action of the actions that are required that lead to us being purified from sin, purified from its effects, healing from its consequences, setting things right that we set wrong. Once we are no longer in the body and no longer in this world, then we ourselves can't do that, right? So I myself, if I pass away and I go to Hades, in Hades, right? I can't fix what I broke, right? I can't come in and apologize and ask forgiveness from someone, right? I can't repent and change, right, my life, myself at that point, right? But we have to take into account that from our perspective, right? Like our living human perspective, the Last judgment, that sorting hasn't happened yet, and that Christ's relationship to time and our relationship to time is totally different. And so in the same way that my prayers now might be what God uses to say, heal someone who I'm praying for, right? My prayers now might be something God uses in potentially the past, from my perspective, right? To bring someone to repentance to shape the course of their life. And additionally, since that separation hasn't happened, that separation is up to Christ. Christ is the one who judges everyone and who makes that distinction in that separation. People who I think look like goats may actually be sheep and vice versa, but Christ is the one who knows that. So there's a mystery here, right? And part of that mystery is that there's not sort of this bar, right? This is one of the differences with Western theology. In Western theology, there kind of is a bar. In orthodox theology, there's not really a bar where you hit that bar and now you're on the saved side. And if you don't make that bar now, you're on the damn side. And so you either have to hit that bar before you die, or our prayers or actions need to do something to help you hit that bar after you die. But there's no bar, right? Everyone is on a continuum between Christ and inhumanity. And we don't know or have any basis to draw a line somewhere on that continuum that says blessed on one side and condemned on the other. How exactly Christ is going to do that is known only to him, right? And so we all pray for each other, and we do that continuously because all of us need the grace of God and the support of each other, working together to try to continue to draw closer to Christ, thereby become more human instead of less human, be cleansed of our sins. And so all the tldr on that is you're kind of asking me how prayer for the departed works. And there's not really a way that things work."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7570.08,"end":7571.12,"speaker":"Fr Stephen De Young","text":"We just know that it does."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7571.76,"end":7592,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's not like a mechanism, right. That we can get at of how it works. Right. But we know that our prayer for the departed is a continued expression of our unity with each other. Right. And a continued manifestation and furthering of our union with Christ."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7593.04,"end":7594.16,"speaker":"Fr Stephen De Young","text":"Yeah, Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7594.16,"end":7630.84,"speaker":"Fr Andrew Stephen Damick","text":"And even if it doesn't, Even if it doesn't quote, unquote work, right? Even if our prayers for someone who's departed end up in the final analysis, and may this not be so, but even if it ends up in the final analysis that we just really loved and prayed with tears for people who end up not loving God, well, that makes us a lot more like Christ, because we're told that God wills that none should perish. And so Christ himself desires the salvation of a whole bunch of people who won't have it, don't want it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7633.88,"end":7635.8,"speaker":"Fr Stephen De Young","text":"Does that make sense, Celeste? Does that help?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7636.52,"end":7639,"speaker":"Fr Andrew Stephen Damick","text":"It was an awesome answer. Thank you very much."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7639.48,"end":7655.69,"speaker":"Fr Stephen De Young","text":"Great. It's always good when you're awesome. Father Stephen, thank you for calling. Celeste, good to hear from you tonight. Thanks for waiting, by the way. Thank you you very much for waiting. All right, moving forward, everybody's favorite semi Aryan from the 4th century, Eusebius of Sorrow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7656.09,"end":7661.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay, now, okay, sorry. Now I gotta think. Do you have a."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7661.25,"end":7663.25,"speaker":"Fr Stephen De Young","text":"You have one that's more favorite? I don't know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7663.25,"end":7671.53,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I gotta think for a minute. I mean, I don't keep a big 4th century A.D. yeah. Because my favorite semi Aryan is Philo of Alexandria."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7671.53,"end":7672.25,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7672.73,"end":7674.66,"speaker":"Fr Andrew Stephen Damick","text":"These first century B.C."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7674.66,"end":7675.66,"speaker":"Fr Stephen De Young","text":"Yes, that's right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7675.66,"end":7705.5,"speaker":"Fr Andrew Stephen Damick","text":"Like some of these ranking things, Right. Like somebody asks, who's your favorite Nazi? It's Always going to be Martin Heidegger. Right. But you try and go below that and it gets really tough because you have to try and think of another Nazi that's at all worthwhile. Right. Carl Schmidt. I don't know. Anyway, that ought to get me canceled if nothing else does today. Right? But yeah, so, yeah, probably. Okay, I'll give you Eusebius accessory favorite semi arian of the 40."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7706.22,"end":7706.86,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7706.94,"end":7709.86,"speaker":"Fr Andrew Stephen Damick","text":"He's better than Eusebius of Nicomedia, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7709.86,"end":7733.5,"speaker":"Fr Stephen De Young","text":"Yeah. Not that guy. So, yeah, I mean, Eusebius of Cicero, of course, is mostly known as a church historian. That's his kind of main value to the church. Right. But he has some other writings, including one called the Demonstration of the Gospel. And we're going to go through a kind of a long quote from that, which I'm going to read parts of it to you and then Father Stephen will stop me and we'll talk about bits here and there. Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7733.66,"end":7736.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. Well. And so why are we. Why are we doing this?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7736.75,"end":7737.47,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7737.79,"end":7834.9,"speaker":"Fr Andrew Stephen Damick","text":"People out there will be going, why? Why are you doing this? The reason why is I've referred to this text a bunch. I've referred to it on the show. I refer to it in Religion of the Apostles. I refer to a bunch of places. I'm pretty convinced no one has actually looked it up and read it, despite how many times I refer to it. And this is worth knowing about for reasons we'll see as we go through. Also, last time I talked about, when I was talking about St. Augustine and the expulsion from paradise and the Fall, Right. I mentioned this text again because I said different authors, early Christian authors will tend to focus on one of what we're calling the three false, will tend to focus on one of them and make that one sort of it. Right. The main thing. Right. Even though they'll acknowledge the other ones. So, for example, St. Augustine famously, and this had a vast effect on Western theology, focuses everything in on the expulsion from paradise. Sin gets attached. Everything gets attached to that. But he also, as we talked about last time, Cain is the first fundamentally important figure to the City of God. So he doesn't like deny this other stuff outright. Right. It's just he thinks one is the main focus. So Eusebius of Caesarea, specifically, in this lengthy quote we're going to work our way through now, he is making the Tower of Babel the big event."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7835.46,"end":7836.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7836.26,"end":7849.64,"speaker":"Fr Andrew Stephen Damick","text":"He's not denying the expulsion from paradise. He talks about it. He's not denying the flood, he talks about it. But for him, the big Fall, the Capital F fall is here at the Tower of Babel episode."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7849.88,"end":7869.32,"speaker":"Fr Stephen De Young","text":"Right. And you know, just as a note, folks, just as we quoted Plato, who's not a Christian and did not say, you know, he's some kind of church father, when we quote Eusebius of Caesarea, we are not saying. And so there he. Therefore he's a saint and infallible. You know, we're saying, here is a witness to this view. That's the word. That's."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7869.32,"end":7881.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I just compared semi Aryans to Nazis. Like, I am not promoting semi Arianism or the tenets of National Socialism, just to be clear."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7881.88,"end":7884.04,"speaker":"Fr Stephen De Young","text":"Even though it is an ethos, I."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7884.04,"end":7885.8,"speaker":"Fr Andrew Stephen Damick","text":"Do kind of like Heidegger, but."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7885.88,"end":7887.72,"speaker":"Fr Stephen De Young","text":"Oh, yeah. For other reasons."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7887.72,"end":7890.88,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, yes. Radically different reasons."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7890.88,"end":7925.53,"speaker":"Fr Stephen De Young","text":"Yes, exactly, exactly. All right, okay. So well, let's begin with from Eusebius text, demonstration of the Gospel. Into this truth, Moses, the first mystic theologian initiated the Hebrews of old, saying, ask thy Father and he shall announce to thee thine elders, and they shall tell thee. When the Most High divided the nations, when he distributed the sons of Adam, he set the bounds of the nations according to the number of the angels of God. His people. Israel became the portion of the Lord. Israel was the line of his inheritance. In these words, surely he named."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7925.53,"end":7925.93,"speaker":"Fr Andrew Stephen Damick","text":"By the way."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7925.93,"end":7926.29,"speaker":"Fr Stephen De Young","text":"Go ahead."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7926.29,"end":7930.01,"speaker":"Fr Andrew Stephen Damick","text":"That's Deuteronomy 32, 8, 9 that he just quoted from the Greek."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7931.45,"end":7942.85,"speaker":"Fr Stephen De Young","text":"In these words, surely he names first the most high God, the supreme God of the universe, and then as Lord his Word, whom we call Lord in the second degree after the God of the universe, there's his semi Arianism."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7942.85,"end":7946.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's warning sign number one."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7946.5,"end":7983.24,"speaker":"Fr Stephen De Young","text":"Yeah, there you go. And their import is that all the nations and the sons of men here called sons of Adam were distributed among the invisible guardians of the nations, that is the angels, by the decision of the Most High God and his secret counsel unknown to us, whereas to one beyond comparison with them, the head and King of the universe. I mean, to Christ himself as being the only begotten Son was handed over, that part of humanity denominated Jacob and Israel, that is to say, the whole division, which has vision and piety, which means. Yeah, exactly. Yeah, there's."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":7983.24,"end":8016.53,"speaker":"Fr Andrew Stephen Damick","text":"So if you remember the quote from Saint Dionysius, the Areopagite. Saint Dionysius references Daniel in which it talks about the prince of Persia and the prince of Greece, and then they say, and Michael, your prince. So he references the fact that St. Michael the Archangel was the sort of guardian angel of Israel. And you may have just noticed that Eusebius says that Jesus is the one who's appointed."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8016.53,"end":8025.97,"speaker":"Fr Stephen De Young","text":"Right. So there's another bit of semi Arianism, but that's not the point of. That's not why we're quoting this. But we're just pointing that out. Those are some problematic passages."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8026.45,"end":8088.04,"speaker":"Fr Andrew Stephen Damick","text":"Just quickly. Right. What makes him a semi Arian and not a full on Arian? The distinction here is that for him we cut out, we're not reading. I mean, obviously this is going to be a long quote, but this isn't even all of book four of the demonstration of the Gospel. So at the beginning of book four, he talks more about the relationship between the Father and the Son. And so, and that's why he says here that can at the same time sort of equate Jesus with the Archangel Michael and say that Christ is beyond comparison with the angels, is that he believes that essentially that Christ came into being but was not created. He believes he came into being from the essence of the Father. Yeah, but that he came into being within time."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8088.52,"end":8090.16,"speaker":"Fr Stephen De Young","text":"Weird. Yeah, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8090.16,"end":8117.15,"speaker":"Fr Andrew Stephen Damick","text":"That's what makes him a semi Aryan. And that's why Philo of Alexandria, the Jewish author, is basically a semi Arian because he believes that the Logos and the Spirit were sort of made by God out of himself, rather than being created the way other things were created, but still come into being within time. So that's why he's a semi Arian. He is wrong."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8118.27,"end":8118.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8118.91,"end":8139.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but this is not Nicene Christology. But even though his Christology is not what we would want. Right. It's important to see here again that he's citing Deuteronomy. Right. That these ideas, these traditions are current in the 4th century in Christianity."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8140.72,"end":8205.92,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yeah. Okay, moving forward, more Eusebius from the same passage. But the angel, guardians and shepherds of the other races allowed them, inasmuch as they were not able with their mind to see the invisible, nor to ascend so high through their own weakness to worship things seen in the heavens, the sun and moon and stars. For these, indeed being the most wonderful of the things of the phenomenal world, invited upwards the eyes of those who see, and as near as possible to heaven, being, as it were, in the precincts of the king's court, as near as possible to heaven, being, as it were. Sorry, I'm repeating myself. Manifesting the glory of him that is the source of all by the analogy of the vastness and beauty of created visible things. For in exhorting the portion of the Lord to grasp with clear mind and pure soul that which is Known to the mind only and unembodied, he prohibits all terror of the things seen in heaven, adding that the Lord thy God has divided them for all the nations. When he says he prohibits the terror, he means don't worship those things in heaven."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8205.92,"end":8209.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And that's Deuteronomy 4:19 that he just quoted."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8209.88,"end":8252.91,"speaker":"Fr Stephen De Young","text":"Right, exactly. And it is worth realizing why he says that they were divided, since unseen by us, they that bear the earthy and demonic nature are everywhere. Wanderers flying through the air around the earth, unknown and undistinguished by men. And the good spirits and powers, and indeed the divine angels themselves, are ever at variance with the worse. There was but one way for those who failed of the highest religion of the Almighty to prosper, namely, to choose the best of things visible in heaven. For there was no slight danger lest, seeking after God and busy with the unseen world, they should turn towards the opposing demonic powers amid the stress of things obscure and dark. Such was their position."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8253.71,"end":8259.15,"speaker":"Fr Andrew Stephen Damick","text":"Notice he makes these references to earthy and demonic nature."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8259.79,"end":8260.75,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8261.31,"end":8302.2,"speaker":"Fr Andrew Stephen Damick","text":"So just to clarify what that is, remember the word giantes giants, Greek literally means one's born of earth. One's born of Gaia, actually. Right. Because that's where they come from. Gaia, like the goddess the earth. Right. So he's distinguishing there. The demonic would be fallen angels. The earthy would be basically the spirits of dead giants. Right. So you have this overarching category of unclean spirits. Right. And he's sort of distinguishing these two types when he mentions these earthy spirits. That's what he's talking about."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8303.56,"end":8311.68,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. All right, moving forward, I'm going to lose my place here. The way this is translated is you're."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8311.68,"end":8312.92,"speaker":"Fr Andrew Stephen Damick","text":"At such after the ellipse."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8312.92,"end":8352.26,"speaker":"Fr Stephen De Young","text":"Yes, such. Yeah, yeah, yeah. So, okay. While those on the side of the opposing rebel power were either demons or vile spirits immersed more or less in wickedness. I love that line. They're immersed more or less in wickedness, in wickedness with the cunning ruler of them all. The cunning ruler of them all, the mighty demon who first failed of their reverence of the divinity and fell from their own portion. That's the devil. When envy of man's salvation drew them the contrary way, plotting with all sorts of evil devices against all the nations, and even against the Lord's portion in their jealousy of the good."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8352.66,"end":8356.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. So notice the envy and jealousy language about the devil."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8357.22,"end":8358.1,"speaker":"Fr Stephen De Young","text":"Yep, yep."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8358.1,"end":8371.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. In motivating his fall and how he says, right, he decides to go after the nations, the 70 nations, and even after Israel Itself. Right. Which he's calling the Lord's portion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8371.14,"end":8392,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. All right. These are the words of God's antagonist, boasting in the strength of his wickedness as he threatens to steal and obliterate the divisions of the nations, delivered by the Most High to the angels and loudly cries that he will spoil the earth and shake the whole race of men and change them from their former good order. And in this way. Go ahead."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8392.16,"end":8413.5,"speaker":"Fr Andrew Stephen Damick","text":"Let me add there. So it's when you said these are the words. So believe it or not, I know this is long that we're reading through. It's actually way longer. I cut out little bits. And the bit that was cut out before, these are the words is actually he quoted Isaiah. He quoted the devil in Isaiah saying that he would remove the boundaries of the nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8413.98,"end":8415.18,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8415.18,"end":8424.67,"speaker":"Fr Andrew Stephen Damick","text":"And despoil the whole earth. And so he lit on that. Remove the boundaries of the nations. Right. The order that God established after Babel, he wants to destroy that order."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8425.15,"end":8435.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So then that's why the next thing he says, and in this way, he took the whole world and held it captive and obliterated the boundaries of the nations. I mean, this is this imperial drive, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8435.95,"end":8443.31,"speaker":"Fr Andrew Stephen Damick","text":"The idea of empire. Right. You obliterate those boundaries, unite everything under yourself. Yeah, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8444.11,"end":8481.73,"speaker":"Fr Stephen De Young","text":"And from that day forward, he ruled all men with deceit. And the evil demons were arrayed under their king in every place and city and land. And thus the whole of human life was enslaved by earthly powers and evil spirits. Instead of the earlier ministers of God, they that were their guardian angels before were unable to defend in any way the subject nations now involved in such a flood of evil. They took care of the rest of the created world. They guarded the other parts of the cosmos and served according to their want, the will of God, the creator of all. But they did not realize the fall of mortal men through the undetermined human choice of evil."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8482.05,"end":8511.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there he makes the same point Saint Dionysius did. Right. That it was humans who caused everything to go bad. Right. And he says that the angels who remained faithful to God sort of weren't able to do anything about this. Right. So those other angels had to sort of retreat to taking care of other parts of the cosmos. Yeah, right. That were still obedient to God, like everything other than humans."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8512.39,"end":8554.24,"speaker":"Fr Stephen De Young","text":"Yeah. There's this tradition I know of amongst Greek Orthodox Christians that and maybe exists in other places too, but I've always heard this from Greeks that when the angelic rebellion began, that the archangel Michael said, stop which is why anyone, and I know we have at least one listener out there named Stamatios, which comes from the Greek word that means stop, which is why someone named Stamatios, their name day is the feast of the archangels. So it's this idea of like, they can't make the demons stop. They just. They're going to do what they're going to do."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8554.88,"end":8582.09,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. And so they have to. Right. But. And this is a theme a lot in the Psalms, is that. Right. You know, the stars all stay in their courses and. Right. All of the sort of elements of the natural world all sort of obey God's commands. It's just humans who are the problem. Yeah, Right. And so that's sort of part of the idea here is that the angels go and start taking care of everything other than the humans, because the humans are so rebellious and wicked, they can't do anything."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8582.33,"end":8623.98,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. All right, moving on. Wherefore a sickness great and hard to heal overcame all on the face of the earth. The nations being driven now one way, now another by the evil spirits and falling into a depthless abyss of evil. Yea. Now some thought it good to feast on the bodies of their dearest like wild beasts that devour the raw flesh of men, and to lie shamelessly with mothers, sisters and daughters, to strangle their old men and cast their bodies to the dogs and birds. Why should I recall the cruel and terrible human sacrifices of the gods? I mean, the evil demons into which they maddened the human race."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8625.98,"end":8632.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. So these things he lists aren't just horrible things. Right. You may recognize them from giant stuff, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8632.62,"end":8633.7,"speaker":"Fr Stephen De Young","text":"Yes, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8633.7,"end":8661.48,"speaker":"Fr Andrew Stephen Damick","text":"As the stuff the giants did. But these are. The point here is not just that they did these horrible acts of murder and incest and. And human sacrifice, but that all of these things were related to the straggling of people, casting their bodies into animals or into bogs. Right. These are all things that these demonic spirits demanded as sacrifices from the nations. Right. These demons that they were worshiping as gods. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8662.36,"end":8760.58,"speaker":"Fr Stephen De Young","text":"All right, we're getting close to the end, everybody. But it was when evils of such magnitude had fallen on the whole world from the wicked and vile spirits and their king. And none of the guardian angels was able to defend them from the evils that he, God the word, the savior of the universe, by the good will of his father's love to man, that the human race so dear to him might not be seethed in the gulf of sin, sent forth at last some few and watery rays of his own light to shine through the prophet Moses and the godly men before and after him, providing a cure for the evil in man by the holy law. These and many other holy teachings and commands God the word gave to them of old by Moses as delivering the elementary truths at the entry of the life of holiness by means of symbols and worship of a shadowy and external character in bodily circumcision and other things of that kind which were completed on the earth. But since as time went on, none of the prophets who succeeded Moses had the power to cure the evils of life, owing to the excess of wickedness, and the activity of the demons daily waxed greater, so that even the Hebrew race was hurried along in the destruction of the godless. At last the Savior and physician of the universe comes down himself to men, bringing reinforcement to his angels for the salvation of men, since the Father had promised him that he would give him this boon. So that's why, according to Eusebius, this is why Christ comes into the world to deal with this big demon problem, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8760.58,"end":8827,"speaker":"Fr Andrew Stephen Damick","text":"Because so the way he presents the Torah and the Old Testament scriptures, but specifically the Torah, is that this comes first of all. It comes from Christ, according to Eusebius, but that he gives it into the world to try and preserve, right, his portion to preserve Israel, right, from what the demons have done to all the nations. But the Torah is powerless to sort of take care of this demon problem, right? At best, it could kind of preserve Israel, right, as this sort of little bastion, right? But it can't solve the problem at all. And not only could it not solve the problem, but Israel didn't keep it. And so they more and more started falling under the sway of the same demonic spirits, right? And so the only solution this is here, the gospel as, as Eusebius sees it, is that Christ comes to defeat those demons and liberate the nations."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8827.32,"end":8833.28,"speaker":"Fr Stephen De Young","text":"Amen. All right. Well, with that, we're going to take our second break and we will be right back in just a second."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8834,"end":8883.25,"speaker":"Fr Andrew Stephen Damick","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO, new from ancient Faith Publishing Secret Turning, a collection of short stories by Stephen Signari. So I'm out in the lot at Auto Heaven and up comes Father Naum from behind, grabs me, gives me a kiss and tells me he's happy to see me wearing his worn out dungaree bib overalls with the beat up straw Stetson pulling his wire basket, going shopping on the avenue."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8884,"end":8885.6,"speaker":"Fr Stephen De Young","text":"How old is Naom anyway?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8885.68,"end":8886.72,"speaker":"Fr Andrew Stephen Damick","text":"Sharkey asked."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8887.04,"end":8890.16,"speaker":"Fr Stephen De Young","text":"Older than he acts. Lefty said to be red."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8890.16,"end":8897.6,"speaker":"Fr Andrew Stephen Damick","text":"He said yeah, and younger than he seems. So he says to me, the Audrey, the church is much better when you're there."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8897.92,"end":8900.72,"speaker":"Fr Stephen De Young","text":"It's not the whole family when we don't see you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8900.96,"end":8929.23,"speaker":"Fr Andrew Stephen Damick","text":"You know, God misses his children and Nana Olga misses her son. Now available in paperback, ebook and audiobook@store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8930.75,"end":8943.29,"speaker":"Fr Stephen De Young","text":"Alright, welcome back. It's the third half of our third episode in this three part series on the fall of man. We're talking about the Tower of Babel and everything that happened as a result of that."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8944.81,"end":8950.73,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, you know, our friend Aristotle told us that everything that comes in threes is perfect."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8951.21,"end":8956.33,"speaker":"Fr Stephen De Young","text":"Oh. So this, maybe we should just end the entire show, the entire podcast."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8956.33,"end":8958.33,"speaker":"Fr Andrew Stephen Damick","text":"This is therefore the perfect episode."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8958.97,"end":8960.97,"speaker":"Fr Stephen De Young","text":"Yeah, it's a third of it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8961.05,"end":8961.61,"speaker":"Fr Andrew Stephen Damick","text":"Standards."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8961.85,"end":8966.2,"speaker":"Fr Stephen De Young","text":"And this is the perfect half of that episode. Of, of that episode. Because it's the third one."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8966.2,"end":8968.6,"speaker":"Fr Andrew Stephen Damick","text":"The third half of the third episode."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8969.16,"end":8969.88,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8969.96,"end":8974.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Have we done the three series? Is this the third series? I don't know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8974.04,"end":8979.4,"speaker":"Fr Stephen De Young","text":"I have, I haven't checked. Actually. We have had a few series though, so. All right, Extra perfect."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8979.4,"end":8979.88,"speaker":"Fr Andrew Stephen Damick","text":"Extra."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":8979.88,"end":9010.41,"speaker":"Fr Stephen De Young","text":"Most perfect. The third of thirds. So. All right, well, we've in our first, first half we talked about the Tower of Babel in the city of Babel, Babylon itself. And then the second half we talked about the gods of the nations, right? These allotment of the nations and the downfall of them and how Christ came to, among other things, to defeat them. All right, so how are we going to wrap this one up, Father? Where can we go from here?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9010.97,"end":9028.96,"speaker":"Fr Andrew Stephen Damick","text":"Well, we're going to talk about now another set of allotments that it turns out are related and that is the land allotments in the Torah, which I know is everybody's favorite part of the Pentateuch."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9029.28,"end":9030.48,"speaker":"Fr Stephen De Young","text":"Oh yeah, big time."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9030.8,"end":9034.8,"speaker":"Fr Andrew Stephen Damick","text":"But mainly just the people who publish Bible maps. Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9038.24,"end":9044.48,"speaker":"Fr Stephen De Young","text":"It'S like the geography chapter in the Silmarillion. Like no one loves that chapter except for the people who make their own maps of Beleriand."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9044.81,"end":9051.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there are cartography people, man. Dude out there who's an expert on 16th century maps."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9051.45,"end":9055.93,"speaker":"Fr Stephen De Young","text":"Yeah, Yeah. I mean, I love that stuff. I always loved cartography when I was young."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9056.09,"end":9057.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9057.05,"end":9060.57,"speaker":"Fr Stephen De Young","text":"I always pulled out the maps from the National Geographic and put them on my walls."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9061.45,"end":9086.74,"speaker":"Fr Andrew Stephen Damick","text":"This is the thing with academia, man. If you want to study, you could spend your whole life studying, you know, late antique roman textiles, right? 16th century maps, right. Whatever you're into, man, like, that's perfectly legitimate if that's what you want to devote your life to, but we're not gonna all play ball that it's, like, relevant to anything. You do you."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9087.22,"end":9088.42,"speaker":"Fr Stephen De Young","text":"Oh, come on, man."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9088.42,"end":9091.86,"speaker":"Fr Andrew Stephen Damick","text":"You do you. Whatever you're into, man, it's cool. But."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9094.26,"end":9101.24,"speaker":"Fr Stephen De Young","text":"You know, 16th century maps probably would not work as a pitch for a new podcast on ancient faith Radio. I don't know."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9101.32,"end":9109,"speaker":"Fr Andrew Stephen Damick","text":"I could try to come up with an audio podcast describing maps. Imagine, if you will."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9111,"end":9112.44,"speaker":"Fr Stephen De Young","text":"And 33 degrees."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9112.44,"end":9119,"speaker":"Fr Andrew Stephen Damick","text":"To the northwest, the top that looks like New Jersey. And then, like, follow like."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9120.76,"end":9126.25,"speaker":"Fr Stephen De Young","text":"All right, enough digression. All right. Land allotments."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9127.45,"end":9161.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And by the way, yes, we were just saying we will never do an episode of the Piri Reis map. So land allotments in the Torah. Right. So probably the more well known of those, and I say more purely as a comparative, would be the pieces of land within Canaan that were allotted to the different tribes. And I say that purely as a comparative because, again, not a lot of people jumping up and down with love for the Book of Numbers."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9163.02,"end":9163.42,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9165.5,"end":9276.47,"speaker":"Fr Andrew Stephen Damick","text":"There were particular pieces of land designated for each tribe in the area of Canaan. And even if you've never poured over the maps that get produced of this, of where they were supposed to be, you may be aware of that. You may also be aware of the fact that the Levites did not get a piece of land. The Levites inheritance. Their allotment is God himself. Right. And that was a way of conveying what we've talked about before, that in Israel, there's sort of concentric circles, and the closer you are to God, like the higher level of purity you had to maintain, right? So Israel was called to a higher level of purity than the nations. And then the priesthood within Israel was called to a higher level of purity than the rest of Israel. And then the high priest is called right to the highest level of purity because they're how close they were going to be to the presence of God. Right? But so they have an allotment. It's just not land, Right. And so they got their food and clothing and support from the people of the other tribes when they came to worship and offer sacrifices. But these allotments and the boundaries of these allotments are considered by the Torah to be set in stone. Meaning that hypothetically, every 50th year when you get to a jubilee year, right? So every seven years you have a Sabbath year, and then after seven sevens, you have the 50th year. That's the jubilee year. One of the things that happens in the jubilee year is that all of the land reverts back to the tribes and clans that originally had those allotments."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9277.03,"end":9284.2,"speaker":"Fr Stephen De Young","text":"There's a big resetting of all the boundaries. And anyone who rented a property or bought a property, it goes back back."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9284.2,"end":9299.68,"speaker":"Fr Andrew Stephen Damick","text":"To these original boundaries and this original order. Now, we know from the text of the Old Testament that Israel never actually did this. There was never a single jubilee year. Right. That they actually celebrated. They didn't even ever do the Sabbath year."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9300.72,"end":9301.2,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9302.32,"end":9320.96,"speaker":"Fr Andrew Stephen Damick","text":"And we know that because Jeremiah gets told that the reason the exile was going to last for 70 years is that Israel had been in the land for 40, 490 years and never celebrated the Sabbath year. So God was taking all 70 of his Sabbath years at once, that they owed him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9321.28,"end":9321.76,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9323.84,"end":9327.6,"speaker":"Fr Andrew Stephen Damick","text":"So, and if they weren't doing the Sabbath year, they definitely weren't doing Jubilee. Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9328.16,"end":9331.52,"speaker":"Fr Stephen De Young","text":"Yeah. But."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9333.36,"end":9361.29,"speaker":"Fr Andrew Stephen Damick","text":"So those are said. So less well known because for various reasons related to the beliefs of certain segments of American evangelical Christianity, we only think about Israel when we think about descendants of Abraham, this included. There were land allotments made by God to the other descendants of Abraham."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9361.93,"end":9367.07,"speaker":"Fr Stephen De Young","text":"Hmm. So Edomites, some other people."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9367.39,"end":9370.51,"speaker":"Fr Andrew Stephen Damick","text":"Edomites, Moabites. Ammonites."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9371.31,"end":9371.95,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9372.11,"end":9420,"speaker":"Fr Andrew Stephen Damick","text":"And if you don't believe me or you're just interested in reading more about it, go to Deuteronomy, chapter 2. The Edomites are mentioned in and around verse 5. The Moabites are mentioned in and around verse 9. The Ammonites are mentioned in and around verse 19. It's reiterated there that obviously the Edomites are descended from Esau, but the Moabites and the Ammonites are descended from Lot, Abraham's nephew, part of his family. And in all three cases, as the Israelites are approaching Canaan to take the land that he's allotted to them, at least in theory, God says, you're not to touch these people. You don't have to touch their land. You don't get a single foot of it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9420.4,"end":9427.76,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I just looked at the verses, and it's basically like, don't invade them, don't harass them, because I gave them that land, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9428.16,"end":9482.94,"speaker":"Fr Andrew Stephen Damick","text":"God gave them that land. And part of him giving them that land, right, he allots them the land. And then what they're required to do is to go in and drive out the giant clans. And if you read In Deuteronomy chapter 2, in all three of those cases, it then lists the giant clans who are driven out before those Abrahamites, right? The Philistines are also included in there, even though they're Greek. But that's a whole other thing. All the Greeks in Israel we'll talk about another time. So the idea is, right, and this is part of where the folks I mentioned a few minutes ago stumble, is that they look at the promises to Abraham regarding the land, and it's this huge swath of land, and they say, well, Israel never had all that land."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9483.5,"end":9483.9,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9484.7,"end":9502.09,"speaker":"Fr Andrew Stephen Damick","text":"But again, read closely. That promise wasn't that big swath of land wasn't promised to Israel. It was promised to Abraham's descendants. And if you put together all of these land allotments, guess what you find out?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9502.73,"end":9504.73,"speaker":"Fr Stephen De Young","text":"Yeah, that's the borders."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9506.41,"end":9561.06,"speaker":"Fr Andrew Stephen Damick","text":"That's where it went. And so Israel are the late comers, right. When they show up in Canaan in Deuteronomy at the end of the 40 years of wandering in the wilderness, these other Abrahamites already have their land. They've already driven out the giants, and they already have their land. So now it's up to them, and this is what the book of Joshua is about. It's up to them now to go and take their allotments and drive out the giants before them. And even though a bunch of the tribes don't go to their allotments, they go somewhere else, like Dan, or they don't completely take the land they're supposed to take, or they let some of the giants get away. Right. Even though they do all that, when we get to the end of Joshua, the book of Joshua says that all those land promises were fulfilled."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9562.9,"end":9563.34,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9563.34,"end":9565.86,"speaker":"Fr Andrew Stephen Damick","text":"None of them are outstanding. They're all fulfilled, right?"}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9565.86,"end":9613.36,"speaker":"Fr Stephen De Young","text":"It's been done. Like this is not something in the future. Yeah. So like Joshua 11:23, so Joshua took the whole land according to all that the Lord had spoken to Moses and Joshua gave it for an inheritance to Israel according to their tribal allotments. And the land had rest from war. And then Joshua 21:43, 45. Thus the Lord gave to Israel all the land that he swore to give to their fathers, and they took possession of it and they settled there. And the Lord gave them rest on every side, just as he had sworn to their fathers not one of all their enemies had withstood them. For the Lord had given all their enemies into their hands. Not one word of all the good promises that the Lord had made to the house of Israel had failed. All came to pass. All the promises were fulfilled."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9613.68,"end":9623.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there are no land promises to any ethnic nation of anybody still outstanding from the book of Genesis."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9625.44,"end":9626,"speaker":"Fr Stephen De Young","text":"There we go."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9626,"end":9628.08,"speaker":"Fr Andrew Stephen Damick","text":"Highlight that. Put stars around it."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9629.52,"end":9631.52,"speaker":"Fr Stephen De Young","text":"Sorry. To our dispensationalist friends."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9631.52,"end":9635.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Support your Palestinian brothers and sisters."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9635.42,"end":9635.66,"speaker":"Fr Stephen De Young","text":"Christ."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9635.66,"end":9636.22,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9636.62,"end":9637.18,"speaker":"Fr Stephen De Young","text":"Amen."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9641.18,"end":9684.23,"speaker":"Fr Andrew Stephen Damick","text":"So that's all done, right? But. So what was that about anyway? Especially since it's all done. Right. Well, we've mentioned on the show before when we were talking about Abraham, that these land promises, and this is the way, like St. Paul's Epistle to the Hebrews interprets it, right. Is that the land, the physical land, was a sign. Right. So it's very common in prophecy in the Old Testament and even sometimes in the New Testament, that there is a physical and immediate sign that people will see that serves as the guarantee that the larger prophecy will come true."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9685.19,"end":9686.71,"speaker":"Fr Stephen De Young","text":"Yeah, kind of down payment."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9687.43,"end":9823,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so when you see this first part come true, then you'll know that the rest of it is true. So in a lot of ways, Genesis, remember, is part of the Torah. So we get the promises to Abraham in Genesis by the end of the Torah. And if you throw in Joshua as the Hexateuch, especially. But even if you don't, you see the fulfillment of the sign Israel coming into the land that was promised, right. That first bar being kept. That's what you see in the Torah. The rest of the Torah is basically that being fulfilled, the sign being fulfilled, which is then causes the Torah as a whole to function as a pointer toward the eventual fulfillment of the larger promise. So what's the larger promise? Well, the larger promise pretty well parallels what happened in driving out the giant clans and receiving the allotted land. Because the promise to Abraham, and it's reiterated several times, but in Genesis 15:5 in particular, it says that they will be in number, his descendants will be a number like the sand of the sea, and they will be like the stars of heaven. So the stars of heaven there are used qualitatively, and we've laid this out in previous episodes, Right. This is how Philo interprets it. This is how everybody interprets it. But just for tonight, if you want somebody who interprets it that way, Daniel the prophet Daniel in Daniel 12:3, talking about the resurrection of the dead, says, and those who are wise, shall shine like the brightness of the sky above. And those who turn many to righteousness like the stars, forever and ever. So that's how he reads it. So your offspring become like the stars of heaven, which we've already seen are sort of connected to the angelic realm. Right. And then Genesis 22, verse 17, adds, when those promises are reiterated, adds this extra element. Right, of. And your offspring shall possess the gate of his enemies."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9823.99,"end":9824.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9824.71,"end":9844.39,"speaker":"Fr Andrew Stephen Damick","text":"And possess is the translation that got cut and pasted here. But the. The original Hebrew word kind of means camp. They'll dwell in the gates of their enemies. So the gate is the place where you fended off attacks from your city. So if somebody is. If they're camping in your gates, you lost, bud."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9844.79,"end":9845.39,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9845.39,"end":9848.07,"speaker":"Fr Andrew Stephen Damick","text":"Like they've come in and taken over your city."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9848.23,"end":9848.89,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9850.24,"end":9888.2,"speaker":"Fr Andrew Stephen Damick","text":"So they're going to become like the stars of heaven. They're going to defeat these enemies. Right. And so the land is this sign, the fulfillment. Right. The bigger promise is that the descendants of Abraham, the sons of Abraham, those who are like Abraham, who are faithful, they are going to ultimately become gods, become like the angelic beings, become sons of God, and are going to replace those fallen angelic beings. Right. Who are the gods of the nations. They're going to take their roles."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9888.52,"end":9914.65,"speaker":"Fr Stephen De Young","text":"Yeah, exactly, exactly. So, yeah, so to that end, you mentioned Philo of Alexandria earlier. So we have a quote from Philo, and I think we've quoted this one before, but it's relevant again to what we're talking about here. This is from his Special Laws one, part three. I don't know if that's chapter one or book one, but anyway, one part."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9914.65,"end":9915.81,"speaker":"Fr Andrew Stephen Damick","text":"Book one, part three."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9915.89,"end":9983.48,"speaker":"Fr Stephen De Young","text":"There you go. Okay. He writes this. Some have supposed that the sun and moon and the other stars were gods with absolute powers and ascribed to them the causation of all events. But Moses held that the universe was created and is in a sense, the greatest of commonwealths, having magistrates and subjects for magistrates. All the heavenly body is fixed and wandering for subjects, such beings as exist below the moon, in the air, or on the earth. These magistrates, however, in his view, do not have unconditional powers, but are lieutenants of the One Father of all. And it is by mimicking the example of his governance, exercised according to law and justice over all created things, that they acquit themselves aright. So all the gods which the senses know in the heavens must not be supposed to possess absolute power, but to have received the rank of subordinate rulers, naturally liable to correction. Let us proceed to give honour to the immaterial invisible, understood by the intellect alone, who is not only the God of gods, but whether perceived by sense or by mind, but also the maker of all."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":9985.96,"end":10022.39,"speaker":"Fr Andrew Stephen Damick","text":"So what the angels are doing, right, is not just that some of them were governing the nations, but they're governing all these aspects of the cosmos. They're part of God's sort of administration, his lieutenants, magistrates. Yeah, right. And so they are sort of actively engaged with the cosmos, ruling elements of it. Right. Guiding elements of it. Right. They are not capital G gods. They're not like God in that sense. Right. But Philo, who's a Jewish person in the first century bc, has no problem calling them gods."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10023.11,"end":10029.43,"speaker":"Fr Stephen De Young","text":"Right. We say small G, it's in the Bible. He's just using biblical language."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10029.75,"end":10048.24,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so. Right. This is the role that those angelic beings had. This is the role then in which humans are going to replace them. And we see this play out all over the place in the New Testament as theosis is described. Right. What this concretely means."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10048.72,"end":10049.44,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10049.92,"end":10083.7,"speaker":"Fr Andrew Stephen Damick","text":"So in, in Matthew 19:28 and Luke 22, verse 30, parallel passages, the apostles received this promise that they're going to sit on 12 thrones and judge the 12 tribes of Israel as their reward for what they've given up, the things they've given up in this life. In Revelation 3:21, at the beginning of the book of Revelation, there are these letters to the seven churches, and each one of them sort of concludes with a promise to the one who overcomes. Right? The one who conquers, who overcomes."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10083.7,"end":10097.07,"speaker":"Fr Stephen De Young","text":"And this 1, Revelation 3:21, the one who conquers, I will grant him to sit with me on my throne, as I also conquered and sat down with my father on his throne. There's that co ruling image again."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10097.63,"end":10117.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. And Revelation 4:4. Right. You see the 24 elders who are sitting on 24 thrones, governing. And it's not a coincidence that there are 24 of them, because 24 is 1/3 of 72."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10117.94,"end":10146.15,"speaker":"Fr Stephen De Young","text":"Yeah. And in this case, 72 represents the angelic governors of the nations. And so the idea is that, you know, and as it says in Revelation 12, 4, it says that a third of the stars fall out of heaven because they're swept out by the tail of the dragon. Now, we should say that that doesn't mean that only a third of the nations fell. That's not what that means. The number is getting repurposed here."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10146.55,"end":10157.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, guys, don't spreadsheet this, okay? This is not saying there's only 24 saints. This is not saying exactly. There were only 24 demons who fell. Right. That's not right."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10157.59,"end":10158.07,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10158.07,"end":10163.51,"speaker":"Fr Andrew Stephen Damick","text":"And if there's any question a third, the proportion is what we're trying to. The same proportion."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10163.91,"end":10179.09,"speaker":"Fr Stephen De Young","text":"And if there's any question in people's minds about these 24 elders, whether these are human humans, the song that they sing before the throne of God, one of the things that they say is, you have redeemed us out of every nation. Yeah, that's humans. That's only humans that could. That's. That's not angels."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10179.81,"end":10202.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right. And so then in both. And in both Revelation 5, 10, and 20, verse 4, it talks about those who are participate in the resurrection, reigning with Christ. Right. Serving as priests and reigning as kings."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10203.28,"end":10603.3,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. And you know, there is also this reference in one of these verses to those who reign with Christ wearing white garments. You see this in some, for instance, icons of all saints. Hell. Now, not every icon of all saints, but there are some all saints icons in which all the saints there and the angels are all wearing these white garments. You know, so this is straight out of the book of Revelation. And I just want to read Revelation 20:4, which has this stunning image, this stunning picture painted here by the Apostle John. Then I saw thrones, and seated on them were those to whom the authority to judge was committed. Also I saw the souls of those who had been beheaded for the testimony of Jesus and for the word of God. And those who had not worshipped the beast or its image and had not received its mark on their forehead or their hands, they came to life and reigned with Christ for a thousand years. It's just astonishing. This beautiful, beautiful image there of what theoses is. You know, Cool, cool stuff. All right, well, to wrap up this episode, some final thoughts from each of us. You know, number one, we ended up on Theoses, right? Which probably you didn't think that an episode about the Tower of Babel would end there, but here we are, because that's. This is one of the big arcs of the Scriptures. And also this is the arc of all three of these episodes is that the fall of man is not just a tragedy, right? There is hope at the end of it. And in the midst of all of the darkness and evil that has come into the world as a result of the events that we've described from the scriptures, there is hope that not just that we would be saved out of the world, Right. That's not actually what it says in scripture, but rather that we would be saved from the evil One, and that's in the Lord's Prayer before he goes to his crucifixion, that. That those who follow him would be saved from the evil one. Right? And that means no longer under his influence. That means no longer doing his works, as we talked about in the last episode. But it also means positively, not just no longer some things, but positively. It means doing the works of the Lord, doing the works of Christ, doing the works of God as our Father. And so we image him, therefore. Right? And so what this means is that ultimately the telos of theosis is not just, oh, we become like God in some kind of sort of attributive sense, although that's part of it, Right. But also we become like God in terms of what he does in the world. And we see that demonstrated for us, of course, by the angels. And we see that realized in the saints. The saints take up this mantle that the fallen angels threw down when they decided to disobey. Right? And so as a result, then that means that the life of the world to come is not just a bunch of glowing beings standing up on clouds or sitting on thrones and giving orders or just, you know, it's not this static thing. It is dynamic because part of what it means to be created beings is that we're dynamic. We change. That's the way it is. But it's going to be good change because we'll be preserved from sin at that point if we are in Christ. Right? So the age to come, the life of the age to come is a very creative age, a very creative age. You know, it's well known to pretty much anyone who listens to anything that I. That I am part of or often things that I write. I'm a big, big fan of the works of J.R.R. tolkien. And I'm going to bring up something that he said because it's very relevant to this. One of the letters that he wrote, he wrote to his. One of his sons. And I don't have the quote in front of me, so I'm going to have to paraphrase a little bit. But what he says is there is a place called heaven where all the stories that are unfinished will continue, where all the songs that are yet to be sung will be sung. Right? And so this is part of his vision, and I think it aligns very much with the scriptures and things we've talked about, that the life of the age to come will be a creative age. It'll be creative. And I don't just mean creativity in terms of the kinds of things that we normally think of as creative stuff like art and literature and so forth. There's a creativity that every human being has that is about making and doing what is good. Right. And in that we imitate our Father, who is the Creator. That is how he is revealed to us. Is the one who makes things to be the one who makes things. He's a maker. Right. So, you know, the life of the age to come is not going to be a bunch of people sitting around not having a life. It will be a creative life, a building life. It'll be life more abundant than what we have now. Like, we shouldn't think of it as somehow less, because it's not. It's going to be even more than what we have now. Right. You know, this idea that the good things that we do in this life that are in the name of God, that are in accordance with his commandments, that are faithfulness to him, that this continues into the age that is to come. So even though the things that we build and do might seem temporary in this world and there's a certain temporariness to them, they also have this eternal character as well. Right. We are making permanent contributions to the new Jerusalem. Right. And so that's one way of understanding what it means for us to be saved. And I think it's a very compelling, very compelling vision of why we should want to be Christians at all. Right. It's not the only thing to say about it, it's not the only angle from which to look at it, but it is absolutely part of it that we take up these roles along with the angelic hosts, as the saints have already done, and we participate in the governing, the shaping the creativity of this creation. Father STEPHEN so."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10605.22,"end":10612.34,"speaker":"Fr Andrew Stephen Damick","text":"We talked here and there, completely non controversially about empire this evening."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10613.3,"end":10613.7,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10616.98,"end":10662.01,"speaker":"Fr Andrew Stephen Damick","text":"To reiterate, I don't know if we iterated it on this show, but the origin of the whole concept of empire and of an emperor actually, in terms of the terminology, actually comes out of Rome because the Romans historically had a really bad experience with kings. That's where we get the word tyrants is from their early kings. So their memory before the Republic of Kings was extremely negative. So when the time came for Caesar, things didn't go so well for Julius, though he did die surrounded by his friends. We can say that about him."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10664.01,"end":10665.53,"speaker":"Fr Stephen De Young","text":"Wow, that was dark. Father."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":10670.81,"end":11166.97,"speaker":"Fr Andrew Stephen Damick","text":"When it came to Octavian, when it came to Augustus, King was the last title that they were going to try to take because that would have been a step too far and so what they come up with is imperator. What they come up with is conqueror. And therefore an empire is the conquest, right? Is what has been seized, what has been taken, and then what they can do with it as a conqueror. And that way of thinking isn't just something that applies at the top level of politics, right? If you're Queen Victoria or the president of the United States or Napoleon, that way of thinking is everywhere and has been democratized in our modern human experience. Everyone is now made into an emperor in that everyone is sent out to conquer. You may never literally conquer the world. In fact, odds are good you won't, especially if you're listening to this. But you can conquer some little piece of it, you can set up some little fiefdom, and you can do it at the expense of others. The more ruthless you are, the bigger an empire you can build for yourself, whether it be in something like business or it be in something that most people would consider silly on the Internet or something. We can all set up our little fiefdoms. We can all try and put together a following of peasants who we consider beneath us. We can all exploit others and exploit the world around us. But even more so than that external temptation toward others, conquest itself, that idea itself is not always necessarily bad. Why do I say that? Well, because we also saw that word in that concept briefly when we quoted one of the letters to the seven churches in the Book of Revelation. That terminology is used actually in all seven of them. And it's used in terms of the promise. Depending on your translation, it'll say, to the one who overcomes. Or just straightforwardly, to the one who conquers. To the one who conquers. This will be given a white robe, will be given, a new name will be given. They will sit upon Christ's throne with him. The question is, who or what are we conquering? What St. John is talking about in Revelation, what really Christ is. Those letters were dictated by Christ to St. John in the Book of Revelation. What Christ is talking about there is not setting up an empire on this earth. Business, political, military, whatever popularity likes as an influencer. What Christ is talking about, we see in the quote that we actually read from the one letter where he talks about the fact that he himself had conquered. And he himself conquered, not the Roman Empire, literally, in the sense of he didn't go to Rome and kill Caesar and make himself Caesar. He conquered the very demonic powers that we've been talking about all evening. So if that's what Christ did, what does it mean? For us to conquer. What are we called upon to conquer as Christians? To be the one who overcomes the one who conquers. Allow me to suggest that who we each need to conquer is ourselves. This is where self mastery comes back into the picture. Our self, right, our soul is the territory that we need to conquer. And to conquer it, we're going to have to drive out the evil spirits and their influence that has taken up residence. So that means we're going to have to. Here's what that looks like. We're going to have to conquer our pride. We're going to have to conquer our ego. You don't do that by sitting around thinking about how horrible you are and moping or putting on big displays of humility. That's not conquering pride, right? In fact, that kind of still is pride, right? What conquering pride looks like is that your ego cannot make you do anything. Someone cannot walk up to you and insult you and thereby ruin your day. Cause you to sin against other people, cause you to want to take revenge against them. If you've conquered your own ego, then the worst insult that can be leveled at you, you will take as food for thought. Is there something legitimate here I can learn from? Maybe not. But maybe there is. It means we need to conquer our envy and our jealousy. What does that look like? That looks like when someone around us is rejoicing and is happy and has had something good and wonderful happen to them. We're rejoicing and happy with them as if it happened to us. We're not bitter and angry that they got something we didn't or didn't have or wanted. We're not jealous. We don't resent them, right? But we're actually happy. In fact, maybe even happier that it happened to them than that it happened to us. No matter who they are, whether we like them or not, whether we get along with them or not. That's what actually conquering and mastering jealousy and envy in yourself look like. We can say the same about any other sin, whether it's on the list of seven deadly sins or not, right? Conquering ourselves, mastering ourselves means that there is no force, there is no passion. There is nothing outside of us that can cause us to react and to do anything. That we are able to set our own limits. That we are able to choose to do that which we want to do in following Christ and becoming like Him. And that's not something that you just do on a Wednesday. Today I mastered myself. Today I conquered myself. This is a battle that goes on throughout our entire lives. The day when we can say whether or not we're the one who conquers is when Christ tells us so when we reach the end. Until then, we fight to purify ourselves, to purge ourselves from these dark and evil influences, to set ourselves right. But this is the positive side of repentance. Repentance is not about feeling bad. It's not about moping. It's not about wearing a hair shirt unless you're Saint John in the hair shirt. But repentance is about fighting back and about taking back your own life and your own self and your own soul by mastering yourself so that hopefully we can be those ones on the last day who Christ rewards with a palm branch and a white robe and a new name and ultimately to come to share in his reign and rule over his creation. So those are my last thoughts."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11167.37,"end":11186.14,"speaker":"Fr Stephen De Young","text":"Amen. Well, that is our show for tonight. Thank you very much everyone for listening. If you didn't get through to us live, we'd still love to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11186.14,"end":11198.34,"speaker":"Fr Andrew Stephen Damick","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific, usually not two weeks from now. That one's recorded, but most of the time live broadcast second yep."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11198.5,"end":11209.47,"speaker":"Fr Stephen De Young","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere but but most importantly, share this show with a friend whom you know is going to love it and it will be helpful to them."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11210.35,"end":11220.03,"speaker":"Fr Andrew Stephen Damick","text":"I say share it with strangers. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11220.43,"end":11224.03,"speaker":"Fr Stephen De Young","text":"Thank you very much, good night and God bless you always."}
{"episode_id":"LOS - #049 - 2022-08-11 - Fall of Man Part 3 - The Gate to Heaven","start":11238.92,"end":11276.05,"speaker":"Fr Andrew Stephen Damick","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
