{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":0.64,"end":65.26,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":70.62,"end":152.55,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. I'm Fr. Andrew Stephen Damick in the borough of Emmaus in the Commonwealth of Pennsylvania and with me is my co host father Stephen DeYoung in in the Hub City, Lafayette, Louisiana. And normally you would be listening to us live, but this is actually not being played live and the reason is that Father Stephen had funeral services that he needs to attend to. So if you're listening to this at the normal time, he's doing a funeral right now and I might be listening in, I don't know. But anyway, instead of canceling the episode or moving it or whatever, we decided to pre record. So this is a, a prerecorded episode and even though you will hear the voice of Steve suggesting you call in, if you call in, you will not get us in this particular time. All right, well this is actually the second part of a two part series on bodies and so instead of my usual introductory comments, we're going to do a little recap of our last episode just very briefly and also try to clear up a couple of misconceptions and some questions that we got about the body of God. And so to begin that I just want to play a message that we got from Kyle and he had a really interesting question. So let's go ahead and play that Father's blessed."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":152.63,"end":174.88,"speaker":"Fr Stephen De Young","text":"In the last episode you spoke about anthropomorphizing God and how we can interpret the Bible to be a theomorphizing of humans. The Bible has God showing emotions like anger and wrath. How are we to interpret that in light of a theomorphizing of humans?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":175.04,"end":243.3,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for Taking my question. All right. Well, this obviously connects directly to what we were talking about. And we. I noticed, for instance, in our Facebook group. Hey, everybody, join the Facebook group. That there were some issues with this. Like, so, for instance, one person sent a message saying, aren't you basically. If you're saying that God has a body, aren't you just basically saying that God is just a very big version of us, you know? Right. And I think that what Kyle asked here is kind of connected to that. Not that he's saying that, but he's trying to make sense of the Bible, for instance, saying that. That God has emotions. Right. And we made the point last time about theomorphism versus anthropomorphism. So, Father Stephen, why don't you, for all the kids at home, why don't you give a little recap as to exactly what that means and why we are absolutely not saying in any particular, in any way at all, that the body of God is basically a kind of really big and powerful version of the bodies of human beings."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":243.9,"end":246.78,"speaker":"Fr Stephen De Young","text":"Yes. Last time on Lord of Spirits."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":247.1,"end":247.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":247.46,"end":252.46,"speaker":"Fr Stephen De Young","text":"Now we insert like a shot of a guy turning a car key and then a long shot of a car exploding or something."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":256.14,"end":256.54,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":257.66,"end":263.34,"speaker":"Fr Stephen De Young","text":"So nothing really exploded. But we did have these questions."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":263.58,"end":264.06,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":264.22,"end":306.91,"speaker":"Fr Stephen De Young","text":"Right, right. In terms of nailing that. Exactly. Exactly what we're talking about. And so we talked about how. And tried to reiterate that when we're talking about a body in general, from the ancient understanding, the ancient understanding of body, that we're not per se talking about a material object in the world. Right. We're talking about a nexus of powers and. Or potentialities. And we'll get into that andor a little more as we go on in this episode."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":307.39,"end":307.79,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":310.11,"end":334.9,"speaker":"Fr Stephen De Young","text":"We'Re talking about that. And so that in some bodies and human bodies and animal bodies that has a material form, if we're talking about angels and demons, as we're going to. As we always do, but as we're going to. More later on in this episode, we're talking about bodies which are immaterial compared to ours, but are still created."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":335.22,"end":335.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":335.94,"end":379.57,"speaker":"Fr Stephen De Young","text":"And if we're talking about God's body, there's zero material aspect to it. We're talking about his powers. And I think to directly get to Kyle's question first, one of the points we were trying to make is that when we were criticizing the idea of anthropomorphism in favor of theomorphism is that, for example, when the scriptures talk about God's face, someone says they want to see God's face. He doesn't say, don't be silly, I'm not a big human, I don't have a face. Right. He says, you can't see my face and live."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":379.89,"end":380.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":380.25,"end":392.37,"speaker":"Fr Stephen De Young","text":"If you see my face, you'll die, implying he has one. But that, that's understood within the definition of body that we're talking about here in the ancient world. So it's not a material face."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":392.85,"end":399.73,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, and face is this sort of communication power. Right, right. And, and we."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":399.89,"end":401.05,"speaker":"Fr Stephen De Young","text":"Communication, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":401.05,"end":476.71,"speaker":"Fr Andrew Stephen Damick","text":"We, you know, we use the word face and it includes what, you know, what we normally think of as a face, like something you could put makeup on or something, you know. Right. But that, and when we use that word to refer to God, we're not saying that God's face is like our face, but we're saying that he also, and in fact a much in the full way, has the ability to communicate and to interface. There you go, interface. What a great word. With, with, you know, with, with. With human beings, with, with angels, you know, so forth. So like, it's interesting, I think it's tough because the scriptures do use what we would conceive of as anthropomorphic words. Right. But that doesn't mean that, you know, for instance, when they say the hand of, you know, the hand of the Lord was upon him or something like that. Right. That there's this gigantic hand that comes out of heaven, you know, with five fingers on it. It's rather about God connecting with and acting in. So there is anthropomorphic language, but that's not what's really meant when that language is used, if that. Am I getting that right? Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":476.87,"end":491.52,"speaker":"Fr Stephen De Young","text":"The idea is we're not attributing this human quality of having a physical arm to God. Right. We're referring to, when we talk about God's right arm, we're talking about his power and might."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":492.72,"end":493.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":493.2,"end":524.01,"speaker":"Fr Stephen De Young","text":"And our human right arm, if we're right handed, at least which most people were and are, unless you're a Benjamin, your right arm is your strong arm. It's the arm you use to do things that require strength and dexterity. Right. So our right arm is sort of a devalued, low grade shadow of our strength is this low grade, devalued, shadowy version of God's strength."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":525.85,"end":535.29,"speaker":"Fr Andrew Stephen Damick","text":"We're going to talk, we're going to talk about this a lot more, but that our strength includes a fleshly arm with an elbow and fingers and a wrist."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":536.17,"end":580.17,"speaker":"Fr Stephen De Young","text":"Right. That's the instrument that we use to exercise our physical strength. But so when we talk about God's right arm, we're not just imagining God having an arm, we're referring to something real. His power, his might. Right. And so the same thing is true when we use this emotional language for God. We're not saying that God is sort of passive and flies into a fit of rage or gets really sad or. Right. We're not saying he's subject to human emotions. But at the same time, those things that we refer to, like when we talk about God's wrath, that's referring to something real."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":580.89,"end":581.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":581.69,"end":587.37,"speaker":"Fr Stephen De Young","text":"That's referring to a real experience of God that we don't want to have."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":587.93,"end":588.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":590.25,"end":599.61,"speaker":"Fr Stephen De Young","text":"So it's not just this, this. Oh, well, these primitive people, they thought of God as a giant human and talked about him getting angry. But we know that's silly."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":600.38,"end":600.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":600.74,"end":612.46,"speaker":"Fr Stephen De Young","text":"And so that we just sort of abandoned that. Right. No, that was language that was used to point to a reality. And we might choose to point to that reality with different language now."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":612.54,"end":643.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And, and, and, and that is a normal thing that happens. Right. In the, the, the history of the scriptures where you see language change in Scripture. You know, the most obvious example is the Old Testament. Most of it in its original, original writings. There I go. But, you know, what I mean is in Hebrew. But then the New Testament is all in Greek. And Greek is not one to one an equivalent to Hebrew. I mean, in so many ways. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":643.67,"end":646.39,"speaker":"Fr Stephen De Young","text":"No two languages are one to one equivalents to each other."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":646.39,"end":649.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They can't be even languages that are closely related."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":650.31,"end":658.88,"speaker":"Fr Stephen De Young","text":"Right. Hebrew and Aramaic aren't one to one. There are words that mean different things in Hebrew and Aramaic, sometimes subtly, sometimes in a big way."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":659.28,"end":822.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this process of, I mean, this is one of the things that I study a lot. Just, you know, even outside of my, I don't know, is there anything outside of religious, theological, pastoral study? For me, I don't know. But even what might be explicitly kind of that religious stuff is something that's really interesting to me. And because no language functions one to one, not just in terms of vocabulary, but in terms of grammar and the way that the words relate to each other, that means that we can't get fixated on particular vocabulary terms. Right. And I'll give a really quick example. So the seventh Ecumenical Council makes a distinction between two Greek words, Latria and proskinesis. And latria is generally translated in English as worship. Or sometimes you get adoration. And proskinesis is translated generally in English as veneration. And that worship belongs Only to God. And veneration can be given to his saints and to holy objects and so forth. But proskinesis is used in Scripture to refer to worshiping God. Does that mean that the seventh Ecumenical Council fathers are pulling a fast one? No, it just means they're using particular words and giving them a technical meaning. But the truth is, is that it's not like once that was decided, that you can only use those words in those particular ways ever after. For instance, at the beginning of most of our services, you get, oh, come, let us worship and fall down before God our King. That said a lot. Well, in Greek, that's veter Proskiniso, man. They're using proskinesis, and yet we don't understand it as, oh, come let us venerate God. It's, let's worship God. Right. So even though this very technical kind of definition was given at the seventh Ecumenical Council to those two words, we don't. It's not like we sat down and revised the scripture based on that or that we're not allowed to use that earlier meaning or whatever context is so, so, so, so important. And so, you know, when, when you hear us use particular words, don't get hung up on the particular word. Like if you say, if we say that God has a body, we don't. We do not mean that God has a body in the same way that we have bodies. Right. But, but rather that there is this ancient sense of what a body is, which includes what we think of as bodies, but is not limited to it. So, yeah, we're not trying to create a theological dictionary here. That's not our task at all."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":823.3,"end":826.26,"speaker":"Fr Stephen De Young","text":"And both of us like Battlestar Galactica, but we're not Mormons."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":826.82,"end":832.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Exactly. Yes. Yes. I love JR Tolkien without being a Roman Catholic."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":833.78,"end":865.87,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, this is important because a lot of the questions we got were related to, well, how does this ancient use of the term body relate to xyz? Later Greek theological terms like how does this relate to the essence and energies distinction? How does this relate to nature? The term nature. Feces. Right. How does this relate to hypostasis or person?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":866.03,"end":866.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":868.6,"end":931.02,"speaker":"Fr Stephen De Young","text":"And there's a problem there in approach that we need to, I think, address because this, we've kind of addressed a version of this before, but we need to kind of make it plain. So those terms used as technical terms, the way orthodox theologians use them today, came into existence over the course of the first eight centuries of the Church. Right. They were refined by the Fathers and refined at the councils using that terminology, since they were speaking Greek, using that Greek terminology to describe the Holy Trinity, to describe Christ, to describe these other spiritual realities. And those terms are all good and all valid and all important in terms of, I'll go so far as to say those are the best way to describe those realities in the Greek language."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":931.26,"end":931.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":933.1,"end":968.07,"speaker":"Fr Stephen De Young","text":"But the, the Old Testament in Hebrew and Aramaic and even Greek translation doesn't use those terms the same way. Neither does the New Testament. And so we have a whole bunch of people, 19th century German theologians in their ilk who based on that fact say, oh well, the whole idea of the Holy Trinity, the whole idea of Chalcedonian Christology, the whole idea of Christ having two wills developed later."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":968.79,"end":969.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":969.23,"end":999.42,"speaker":"Fr Stephen De Young","text":"That, that, that those ideas, those understandings, those realities don't pre exist. The language, the Greek language that was used for them these later centuries. So part of what we're, we're doing last episode and on this show in general and that I'm always trying to do and stuff outside this show is show the continuity between, you know, late Bronze age Israelites and 8th century church fathers."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1000.59,"end":1000.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1000.91,"end":1020.11,"speaker":"Fr Stephen De Young","text":"And that they're, they're pointing at the same reality. They're, they're coming to know the same God. Right. And, and so the idea of the Holy Trinity, the idea of Christology, these all pre exist that, that later Greek language by centuries, if not millennia."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1020.59,"end":1021.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1021.71,"end":1056.94,"speaker":"Fr Stephen De Young","text":"And so when we're talking about, for example, how body was used in the ancient world and how it's used in the Old Testament. Right. We're talking about, here's the terminology that's used in scripture to describe these realities. So that once you understand the terminology scripture uses, hopefully that'll help you make those connections. Right. So this, that, you know, Saint Maximus is saying about the will. Right. Is really the same thing that the psalmist is here saying in Hebrew. Right. He's just using different terms."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1057.42,"end":1057.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1057.78,"end":1060.38,"speaker":"Fr Stephen De Young","text":"But they're talking about the same reality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1060.94,"end":1065.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then there's the issue of reading English translations of both of those texts."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1067.26,"end":1067.66,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1068.22,"end":1237.87,"speaker":"Fr Andrew Stephen Damick","text":"Which again are not, you know, Greek and Hebrew are not one to one and English is not one to one with either Greek or Hebrew. It probably has more in common with Greek being because they're both Indo European languages. But still, just because you've read something in translation doesn't mean that you really, truly got what it is. Or even maybe you understand that language, maybe you took classes and you understand Hebrew. That doesn't necessarily mean still that you are automatically going to read it. Well, and this might seem like A big digression, everybody. But I think it's a really important point. And, and because for this particular program, the kind of expertise that in particular Father Stephen brings to the table is biblical expertise. It's going to. The way that it gets talked about is going to be different than someone like, for instance, if we had a patristic scholar. Now we're both interacting with the Fathers and informed by the fathers and the church services, and we're bringing all these other things in as well. But it's not going to be identical in terms of the language, you know, and context is super, super, super important. Right. There are. There are ways. For instance, I became aware that someone was unhappy that I used the phrase there is one energy. Well, you know, referring to God. The context of that makes a big difference because you can see patristic language, you know, one energy, language and plurality of energies, language depending on context, and even that's all just within Greek. So you can't just pick out a particular phrase and say, look, gotcha. You know, you're saying it wrong, Whatever. Right. And also, you know, it's possible I will admit I'm wrong about things and God willing, I'm getting better, you know, it's okay, right? It's okay. I'm happy to be corrected. And, you know, that's a lot of what. What we're doing here. So. Yeah, like I said, it seems like a big digression, but I think it's really important, especially because particularly the last episode got into a lot of stuff that a lot of us have never really thought much about or read much about. Including me. Especially me. So, you know, hang in there, everybody. It's going to be okay. So. All right, well, let's continue talking about this question of a body as being a nexus of powers or potentialities. You know, and we. So last time we talked about the body of God, now we're going to begin talking about human bodies. So take us in, Father Stephen."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1239.87,"end":1245.71,"speaker":"Fr Stephen De Young","text":"Right. So less controversially than saying God has one, humans have bodies."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1245.87,"end":1248.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. That should be a surprise to no one."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1249.15,"end":1302.69,"speaker":"Fr Stephen De Young","text":"Yes. But it's important that we're still using that same definition of body for our purposes. Right. In the sense that we're not just talking about the material body, but we're talking about body in terms of this nexus of powers and potentialities. And it's really when we start talking about created bodies that the idea of potentialities enters it. This. This is another place where we got some questions that indicated there was some confusion, which means we didn't clarify it enough. And so the reason we were talking about powers and potentialities is that we were talking about bodies in general. If we're talking about this ancient understanding as applied to God. So if we're talking about God's body understood in this ancient sense, we're just talking about powers."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1303.36,"end":1306.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he doesn't. God doesn't grow."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1308.4,"end":1321.36,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And he isn't acted upon. Right. All of that is true. Right. So we're talking about powers with him. When we start talking about created bodies, though, there are created powers."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1321.84,"end":1322.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1322.16,"end":1328.32,"speaker":"Fr Stephen De Young","text":"But there's also then potentialities because created things are acted upon."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1328.76,"end":1328.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1328.96,"end":1378.71,"speaker":"Fr Stephen De Young","text":"And in some cases do change and, etc, etc. So when humans are created. And this is going to be a little bit of recap too, because I know we talked about this in a previous episode, but we talked about how the act of creation as it's portrayed in Genesis 1 and 2 is in Genesis 1, it's God acting to first, in the first three days of creation, set the creation in order. So it's moving from chaos to order. And then the second set of three days, the fourth, fifth and sixth days that correspond directly to the previous days, it's filling those spaces he created with life."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1379.35,"end":1379.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1380.07,"end":1419.58,"speaker":"Fr Stephen De Young","text":"Then human beings are created to continue that work. Right. For. For to go out from paradise, the garden that God planted, and to set the world in order and fill it with life. And we get in Genesis 2, the particular story of Adam being pulled apart into Adam and Eve and, and Eve being created in particular, woman being created in particular for this function of filling the world with life."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1420.22,"end":1420.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1421.58,"end":1450.3,"speaker":"Fr Stephen De Young","text":"And Adam, in naming the animals, being the one who sets things in order. And even as I say that, I want to also make the point, right. That this isn't saying, well, women just fill the world with life and men just set things that are. Obviously, the whole context of the two being one flesh is that both are participating in the other."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1450.86,"end":1451.26,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1451.42,"end":1460.9,"speaker":"Fr Stephen De Young","text":"Right. It's very clear, for example, that. That while women give birth to children, men participate in the making of children, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1460.9,"end":1461.42,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1461.66,"end":1505.34,"speaker":"Fr Stephen De Young","text":"So there's. There's a mutuality there as well. And so the reason we talk about this as in the context of potentialities rather than just powers, is that the work that Adam and Eve are created to do is still God's work. Right. They're still, they're continuing God's work. God is working in and through them to accomplish this. And so for them, it's a potentiality because they're participating in God's exercising of his powers. Right. His. His works."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1505.98,"end":1521.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's not. They can't be, you know, to use the philosophical language, fully actualized in that, because it's God and they're just human beings, you know, even in this unfallen state."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1521.69,"end":1532.17,"speaker":"Fr Stephen De Young","text":"Right, right, right. They are. They are participating in God's ongoing work of creation. They're not creating additional things independently."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1532.89,"end":1533.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1533.45,"end":1535.77,"speaker":"Fr Stephen De Young","text":"Apart from, Apart from God."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1536.09,"end":1559.41,"speaker":"Fr Andrew Stephen Damick","text":"To, you know, use one of my beloved Tolkienian terms. They are being sub. Creators. You know, they can't make things. They can't make things come into being, but they can take God's existing creation and reorder it, give it a higher level of order. But again, as you said, they're not functioning independently. They're being like God. They're participating in God. They're doing his work."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1560.69,"end":1571.57,"speaker":"Fr Stephen De Young","text":"Right. To continue the example, when Eve gives birth to her first child, she says, I have received a son from Yahweh."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1572.31,"end":1572.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1573.67,"end":1585.19,"speaker":"Fr Stephen De Young","text":"Obviously she and Adam were involved in making the child and biological processes and, and, and. But she correctly sees that this new life has come into the world from God."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1585.75,"end":1586.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1586.39,"end":1587.91,"speaker":"Fr Stephen De Young","text":"Even though it turns out to be Cain."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1588.55,"end":1588.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1591.03,"end":1611.6,"speaker":"Fr Stephen De Young","text":"So that said, and we've already alluded to this, this means we have to shift our paradigm a little bit in terms of how we understand Eden and how we understand humanity, given that most of us have grown up in a Western context."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1612.08,"end":1613.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1613.92,"end":1625.35,"speaker":"Fr Stephen De Young","text":"Where my least favorite person to pick on St. Augustine, because he gets picked on too much, has kind of influenced our vision and our understanding of these."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1625.35,"end":1625.67,"speaker":"Fr Andrew Stephen Damick","text":"Things."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1627.75,"end":1708.11,"speaker":"Fr Stephen De Young","text":"In the way in which he's kind of. He. Well, I'll be fair to it. We will inevitably be doing a show where we talk about the fact that there are three falls of humanity. I think we already alluded to that in the fabish Fall of the Angels episode. And what you find in the early Fathers is that they will not deny any of the three. They'll refer to all three, but they will tend to focus on one event in Genesis 1 through 11 as being the primary event where humanity fell or where sin took hold of humanity. And so St. Augustine was very much within the mainstream of that in that he picked the expulsion from paradise as being the main event in Genesis 1:11, and the other one sort of being subsidiary and kind of collapsed some of the elements of the other two into that first one. And the problem is he wrote in Latin and not a lot of other people did. And so Western Christianity from the 5th century on became almost completely beholden to St. Augustine."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1708.51,"end":1710.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1710.51,"end":1719.59,"speaker":"Fr Stephen De Young","text":"So the more Full orbed understanding didn't get fully handed down to his successors, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1719.59,"end":1898.09,"speaker":"Fr Andrew Stephen Damick","text":"And, and there's one of the big problems with this, and I mean, I'm not deeply read in St. Augustine, but one of the big problems with this is that there's this, at least the way that people have now kind of received this, is that Adam and Eve in the Garden of Eden, everything is utterly perfect and then it all goes wrong, right? That's the image that most people have of what's happening there. And so not only is there, as you said, there, these multiple events that occur that kind of constitute the Fall, but also there's the problem of seeing Adam and Eve as being utterly perfect in an utterly perfect place. Right. That neither one of those things is true. Now, the problem with parsing that, of course, is that we tend to use the word perfect to mean sinless, right? If I do something wrong, I can say, well, I'm not perfect. But that's not what perfect means generally, for instance, when the Church Fathers use whatever their equivalent term is, usually in Greek, but whatever language they might be writing in that, you know, in English, we have, we do use this word perfect to mean sinless, but we also have the sense of something being perfected, right? In other words, that it's coming into its full flower, it's coming into its full polish, it's becoming all that it can be. And that's what Adam and Eve and even the world don't actually have. They're off to a good start, right? The world is off to a good start, but there is this. It's not just an interruption, it's also kind of an alteration. Right. And we're going to talk about that. I know a lot more, but I think, you know, it's interesting, I've noticed this, that especially as English speakers appropriate this theology of Adam and Eve being sinless but not perfect. Before this Fall, less often do you get this idea of the world actually not yet being perfected, that it's kind of incomplete, it's not done yet, so to speak. And yet these are intimately connected. And Adam is the priest of this world, his task. And you know, he's. He's the king of this world. His task is to. To rule it with God's rule, to name it, to order it, you know, all these things. Of course, Eve participates in that as well. It's interesting, I can't remember, was it the last episode where we talked about the idea of that Eden was supposed to have been expanded. Right. I love that. That's So I don't know. That's really. It's inspiring, it's invigorating, because this is our task as well. Our task is to do the thing that Adam failed at, being in Christ. That's our task. But I don't know, maybe I'm getting ahead of ourselves a little bit here, but I'm just excited about these ideas."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1898.89,"end":1945.27,"speaker":"Fr Stephen De Young","text":"Well, yeah, and it's in the text. If we read the text carefully. In Genesis, right? God plants a garden in the east, in Eden, right? So that's not the whole world. That's a garden that he puts in a place, right? And that's the place where he's going to dwell with humanity. That's what makes it paradise. And the word paradise in Greek is actually taken over from Persian and refers a walled garden, right? So it's enclosed, which made me really happy when I watched the Good Omens adaptation on Amazon. When they showed Eden, it was walled in. But anyway, wasteland outside."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1946.31,"end":1957.15,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, that's kind of the. Isn't that the image that C.S. lewis uses in the Last Battle, that there's this walled garden as well that you. Further up and further in? So there you go. There's one for all you Narnia lovers out there."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":1957.87,"end":2003.96,"speaker":"Fr Stephen De Young","text":"So, and when Adam is created, God goes and forms him from the dust of ground, forms him out of this sort of chaotic prime matter that's out there, and then places him in Eden, places him in paradise. He gets created outside and then picked up and put there. And so there's this outside area, and when the command is given to Adam and Eve to fill the earth and subdue it, which is that command, right? The word subdue doesn't just mean put in order in a general sense. Like, hey, put all your DVDs in alphabetical order, right? Which I do because I'm OCD. It's. It's the word subdue. There is actually the word for, like, conquering a city."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2004.73,"end":2005.37,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2006.33,"end":2079.16,"speaker":"Fr Stephen De Young","text":"So it implies, like, opposition and contest and what our German friends call chaos. Kampf. Right. The struggle against chaos. Right. So that's the picture. So the picture is that the world outside Eden isn't finished yet in the sense of what God is doing in Genesis 1. It's still empty and it's still filled with chaos. And so Adam and Eve were to go out and expand, right? Eden to fill the whole world. And then because of their trespass, they're sent out instead. But in the same way that the creation as a whole isn't done, Adam and Eve aren't done. That's perfect. The Greek concept of telos, Right, Teleology, Right. It's the final. It's the end, it's the goal. It's where you arrive, you know, at. At fullness and completion and wholeness, purpose. Right. At the, at the end of the growth and change process. Right. That's. That's where you're at. That's your final form and your power levels over 9,000. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2079.88,"end":2080.28,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2082.2,"end":2099.83,"speaker":"Fr Stephen De Young","text":"That'S what it's aiding. Right. And so the way Adam and Eve were going to go from this innocence to this perfection to this completion was by participating with God in bringing the rest of creation toward that. Toward that perfection."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2100.23,"end":2102.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2103.59,"end":2118.44,"speaker":"Fr Stephen De Young","text":"And a crucial element of that, a crucial element of that, that to. We're going, Going to talk about more toward the end of this episode is the Incarnation of Christ, which means, as I say."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2118.44,"end":2121.4,"speaker":"Fr Andrew Stephen Damick","text":"So you're saying that the Incarnation is."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2121.4,"end":2217.78,"speaker":"Fr Stephen De Young","text":"Not plan B, right, The Incarnation, Sorry, Anselm of Canterbury. The reason why the God man is not human sin. That's. So the Incarnation of Christ is a super lapsarian reality. Shout out to all the Calvinists I just triggered. It overarches the concept of the Fall because the participation we were just talking about between Adam and Eve and God, right, finds its fullness and its fulfillment when God becomes man, when God is made man in the person of Jesus Christ. And it's Christ who was always going to bring not just humanity, but creation to its fullness, to its telos, to its end, to its perfection through the Incarnation. So this is a positive aspect of salvation. This is what we've been talking about when we've talked about theosis in previous episodes of us becoming sons of God. Christ is the unique Son of God. So it's in his image and it's through him that we become sons of God in that positive sense which Adam hadn't yet achieved. He was."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2218.66,"end":2259.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So salvation is not just about the forgiveness of sins and the removal of death and the, you know, rescue from the domination by the dark powers, but is actually about this growth, this realization of, of what it is that Adam is supposed to be. That, that, that in, in. If I can say this and maybe, maybe correct it or nuance it or whatever, that Christ is what Adam was made for. Not that Adam becomes Christ by nature, but that Christ is Adam's telos. Am I putting that well?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2260.36,"end":2273.99,"speaker":"Fr Stephen De Young","text":"Right? He becomes like Christ through grace, through participating in the work of God. He becomes like Christ. Yes. Christ is the, the paradigm, the Logos, if you will. Of the whole creation."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2274.31,"end":2275.11,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2279.11,"end":2311.83,"speaker":"Fr Stephen De Young","text":"So, yes, so there's both. We tend to focus almost entirely. And sorry, St. Augustine. Right. But the west. And it wasn't his fault. It's how he was appropriated. But the west has focused almost entirely on this negative aspect of salvation, as if that's the whole thing. That's the whole enchilada is taking care of the sin and death problem. That's not the whole enchilada. Those are some roadblocks that were thrown up on the original road."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2312.39,"end":2320.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like a child who's ill in a way that prevents him from growing. So heal the illness. And now he can grow."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2320.63,"end":2351.87,"speaker":"Fr Stephen De Young","text":"Now he can grow to fullness and maturity. But the fullness of maturity was always the intent and the plan. So Christ still would have been incarnate for our sakes and accomplished what he accomplished even without any. With zero falls. Right. But he wouldn't have died the death on the cross. Right. He wouldn't have. Those things are to deal with death, sin, etc."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2352.79,"end":2352.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2352.99,"end":2362.11,"speaker":"Fr Stephen De Young","text":"But the incarnation itself is to accomplish this original purpose in, in God's creation and in his creative acts."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2362.11,"end":2415.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And sometimes people see the incarnation as being just sort of a necessary condition so that he can do the things like die on the cross. Like, well, we need, we needed a Savior who could do this. And so therefore we have. Have one. But, but it's. But that's the opposite. It's that. That he is incarnate and, you know, he dies, he suffers. He dies because of who he is, because he's taking care of, as you said, these negative aspects of what has happened. So. Yeah. Yeah. All right, well, let's talk then now about what does happen to Adam and Eve. You know, we talked about this a little bit. We kind of, you know, telegraphed it a touch, talking about the garments of skin, for instance. So they eat of the tree of the knowledge of good and evil, and things change."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2416.94,"end":2458.87,"speaker":"Fr Stephen De Young","text":"So, and the tree of the knowledge of good and evil itself is talking about this issue of maturity. Right. Because everywhere else where that phrase, the knowledge of good and evil, knowing good and evil occurs, in the Old Testament, it's referring to maturity. Right. So Isaiah, chapter seven, you know, a child will be born before he is old enough to choose the good and reject the evil. This will happen right before he comes to. Comes of age, before he reaches maturity. And so the fathers are all very clear. And even before that, Second Temple literature is very clear that the tree of knowledge of good and evil is not itself evil."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2459.43,"end":2460.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2460.43,"end":2463.79,"speaker":"Fr Stephen De Young","text":"That it's a knowledge. Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2463.79,"end":2468.11,"speaker":"Fr Andrew Stephen Damick","text":"I would say, why would God have put a poisonous tree in the middle of the garden of."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2468.83,"end":2472.83,"speaker":"Fr Stephen De Young","text":"Right. It's that this was knowledge that they weren't ready for yet."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2473.15,"end":2473.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2473.55,"end":2487.63,"speaker":"Fr Stephen De Young","text":"This was a level of maturity that they hadn't reached yet. And they were trying to seize it before God knew they were ready for him to give it to them. But so this. This happened, and so his commandment to them was. Was more of a warning."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2488.63,"end":2488.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2488.99,"end":2497.91,"speaker":"Fr Stephen De Young","text":"Right. It was not like, I'm going to just arbitrarily set a test for them, you know, by saying, hey, you know what? You can eat all the other trees. Don't eat this one."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2498.31,"end":2599.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. Well, I mean, you know, those of us who are parents, it's the same thing. It's like, look, you know, you're not ready for that yet. Right. You're not like, it's not like I'm tempting my kids by having a car in the garage and they know where the keys are. Right. Like, I didn't buy a car in order to send them into ruin. Right. I mean, obviously the analogy doesn't totally hold in every way, but, yes, they've seen me start the car. They could probably not my toddler, but the three older kids probably could go in there and start the car. They could do that. They've seen me do it enough. They've seen my wife do it enough, but we didn't buy the car in order to send them into ruin. But what we do tell them is there is going to come a day when you're going to be ready for this. You know, you're going to have this ability, you're going to have this permission, you know, and it's going to be fruitful for everybody, God willing. I don't have any drivers just yet, but we're maybe only a year or two away from it. Oh, man. But, you know, that's just to try. I mentioned that just to kind of stave off some people. Obviously, again, the analogy does not hold in every way. They were like, well, why would God have put that tree there, you know, if he knew that Adam and Eve were going to do this? But it was there because it was going to be for them. You know, they just weren't. They were. They were seizing it. And he told them, don't do that. Right. He didn't hand them the keys to the car and say, now, this is how it all works now. Don't. Don't go do it. Don't. You know. Right. It wasn't like that."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2600.41,"end":2608.01,"speaker":"Fr Stephen De Young","text":"Right, Right. And so once. And that's. That's the devil's whole presentation is."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2608.01,"end":2608.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2608.57,"end":2620.05,"speaker":"Fr Stephen De Young","text":"You know, if. If you eat this, you could leapfrog all this hard work stuff, all this subduing and filling and all that. You just become like God right off the bat. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2620.05,"end":2621.13,"speaker":"Fr Andrew Stephen Damick","text":"Boom. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2621.7,"end":2640.1,"speaker":"Fr Stephen De Young","text":"Here's the. The easy path. Right. But so once they. They eat of the tree, they now know good and evil. And the word know, we tend to intellectualize Right. Where we think this doesn't mean. Now they could write an ethics textbook. Right. Like, before this, they had no concept of disobeying God."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2640.26,"end":2643.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now they have a copy of the rules."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2643.38,"end":2651.22,"speaker":"Fr Stephen De Young","text":"Yeah. And now they understand deontology according to Immanuel Kappa categorical imperative."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2651.46,"end":2652.5,"speaker":"Fr Andrew Stephen Damick","text":"Who does, though, really?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2654.02,"end":2682.36,"speaker":"Fr Stephen De Young","text":"So the verb know, you know, yada in Hebrew is the same one that's used at the end of chapter three to say, Adam knew his wife Eve, and they brought forth a son. So knowing something is more intimate and more involved than. Than just intellectually having the idea in your head of good and evil. They now know good and they now know evil."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2682.68,"end":2683.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2684.2,"end":2693.96,"speaker":"Fr Stephen De Young","text":"And so what God says in terms of why they're going to die, the way it's often presented is sort of, you know, God makes this rule and he says, if you break this rule, I'm going to kill you."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2694.12,"end":2694.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2694.92,"end":2704.82,"speaker":"Fr Stephen De Young","text":"Like that day I'm going to kill you. And then that causes people all these problems because they look at it and say, well, wait a minute, he didn't kill them that day."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2705.38,"end":2705.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2706.18,"end":2708.74,"speaker":"Fr Stephen De Young","text":"Right. But that's not what he said."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2708.82,"end":2709.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2709.14,"end":2733.33,"speaker":"Fr Stephen De Young","text":"He said, that day you will die. And so we see this kind of deliberation scene with the divine council in Genesis 3, after this has happened, after they've come to know good and evil, where God says, well, now they're like us, knowing good and evil. What are we going to do about this? If they now go and eat from the tree of life, they will be immortal."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2734.29,"end":2734.69,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2735.57,"end":2760.93,"speaker":"Fr Stephen De Young","text":"They will be immortal. And so that evil that they now know will be immortal. They'll be like the demons. Right. Immortal and evil. We don't want that. Yeah. And so they need to be cut off from the tree of life. They need to be expelled from God's presence. Right. Which will bring about, which is immediately their physical death."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2762.21,"end":2762.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2762.53,"end":2775.17,"speaker":"Fr Stephen De Young","text":"There are two kinds of death. Spiritual death is the separation of the human soul from God. Physical death is the separation of the human soul from the human body and body in our material sense."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2775.89,"end":2777.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2780.53,"end":2788.28,"speaker":"Fr Stephen De Young","text":"So they have to be. They have to be made mortal now so that. That evil will not be immortal."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2788.92,"end":2789.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2789.64,"end":2846.11,"speaker":"Fr Stephen De Young","text":"So that that evil can die so that they will not live forever in that state, as Genesis 3 says. And so this is the idea that. That mortality, being subject to corruption then brings about mutability, and mutability brings about the possibility of repentance. If you can get sick and you can die, you can also be healed and. And restored. So in terms of our ancient definition of body, what we're talking about is a lot of the powers that humanity had are weakened. And these new potentialities of being subject to death and corruption and decay, both physical and moral, all of those things now enter into the realm of human potentiality that weren't there before."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2846.67,"end":2956.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. That. That God gives. And this is what. This is what the garments of skin are. It's not that God makes some leather outfits for them. It's that their. Their bodies change and they gain and lose, as you said, potentialities and powers. And some are weakened. And that mortality is actually a gift from God and not a punishment, because otherwise we would have been crystallized in sin. I'm just kind of restating what you said, but I think it's really important to hammer this home, that this is a gift from God so that we would become mutable. You know, we could certainly change in the sense of growing. Right. We had that ability to grow and so forth, but not to be kind of acted upon and to be altered. Right. That was necessary in order to be able to repent, because that's what repentance is. It's this turning back to God and reconnecting with him and so forth. That. And we're gonna. We're about to talk about angels in a moment. But. But that death is God's gift to mankind so that he does not become demon. And. And what we do with that gift is up to us. It's up to us. But it is. It is a gift. It comes with some problems. You know, corruptibility is. No, is no joke. Right. It's not. It's not a. It's not a walk in the park, but it's. But it is the path back to. To wholeness, to communion with God. Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2956.12,"end":2960,"speaker":"Fr Stephen De Young","text":"And there. There's. There's another important distinction we have to make here."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2960.48,"end":2961.04,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2961.36,"end":2993.45,"speaker":"Fr Stephen De Young","text":"Especially in terms of the way flesh is going to be used biblically later, like in the New Testament, but also in terms of understanding this properly. And that's the difference between mortal flesh, right? The mortal body that Adam and Eve receive and sinful flesh, flesh Corrupted by sin. That's under the power of sin. Again, because of poor St. Augustine, who I have to keep pointing to. Unfortunately, those two things get collapsed."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2994.24,"end":2994.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":2994.44,"end":3052.34,"speaker":"Fr Stephen De Young","text":"Because you get the Western idea of original sin. And I'm not going to go into the whole argument about whether that included guilt for St. Augustine or not anyway, but that corruption is that corruptibility is actual depravity. And that's not the way the Scriptures present it. And that's not the way. If you read Second Temple Jewish literature, the early Fathers, the New Testament, that's not the way they understand it. Because there are two different figures here who are getting put together. One of them is Adam and one of them is Cain. The word sin does not occur anywhere in Genesis 3. The Scriptures do not say that Adam and Eve sinned. They violated a commandment. And the word that's usually used for that is trespass."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3053.33,"end":3056.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Trespassed over the line. Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3056.97,"end":3090.98,"speaker":"Fr Stephen De Young","text":"Right. A line was drawn and you stepped over it. You went over the fence. But the word sin first appears in Genesis 4, when God is talking to Cain and he says, this is after Cain is upset because his offering was rejected and Abel's was accepted. And God says to him, sin is crouching at your door. It seeks to master you, but you must master it. That presentation of sin is not breaking a rule."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3091.78,"end":3092.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3092.34,"end":3096.5,"speaker":"Fr Stephen De Young","text":"God isn't saying, hey, Cain, you're about to break that no murdering people rule."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3097.14,"end":3099.38,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3102.26,"end":3113.58,"speaker":"Fr Stephen De Young","text":"There is this force, right? The verb that is translated usually crouching. There is actually a loan word from Akkadian. Oh, that. Yeah. Fun with Akkadian."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3113.66,"end":3117.02,"speaker":"Fr Andrew Stephen Damick","text":"Another. Another Semitic language everybody refers to."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3117.82,"end":3137.8,"speaker":"Fr Stephen De Young","text":"Refers to. Yeah. It's basically the earliest tier of Babylonian language, as opposed to Sumerian. But that. That verb that's translated crouching is a. Is a word that was used in Akkadian to describe a particular type of demon that they thought crawled up out of the underworld through cracks in the ground and sort of stalked people."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3138.2,"end":3138.92,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3139.96,"end":3169.81,"speaker":"Fr Stephen De Young","text":"So that's the imagery that's being invoked there. That. That's what sin is like. Right. And we see this in. Once you know that. And you read Romans 5. And what St. Paul says, right, when he says sin entered the world through Adam. Right. He's not saying Adam's the first person who broke a rule. He's saying sin, this power. Right. This demon that crawled up out of the underworld, it came into the world through Adam and then it goes after Adam's son."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3170.85,"end":3171.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3172.53,"end":3182.37,"speaker":"Fr Stephen De Young","text":"Ends up winning, ends up conquering Cain and. And subjecting him. This is why? The fathers talk about sin as passions. They make us passive. They act upon us."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3182.77,"end":3183.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3183.89,"end":3184.77,"speaker":"Fr Stephen De Young","text":"And take control."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3186.13,"end":3238.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting that there's. And I don't know, it was not that long ago that this distinction kind of came to me in my mind finally, that we often pray in the orthodox tradition for protection from sin. Right. And not as much. I mean, there's nothing wrong also to pray that God would keep us from sinning. Right. That's also a thing for sure. But the notion of being protected from sin, that sin is this external thing, I mean, is it. Maybe this is going too far, whatever. But I mean, is it, is it wrong to say that sin is a demon or maybe sin is demonic force or. I don't know. I mean, there's almost this personification of sin going on there in Genesis 4, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3239.68,"end":3366.58,"speaker":"Fr Stephen De Young","text":"Yeah. Well, and it's. It's true throughout Scripture. This is another one of Those places where St. Paul uses words very carefully. There are only a handful of places in St. Paul's epistles where he uses sins plural, Right. Almost always. He talks about sin singular as this force, as this power that's unleashed in the world and that is trying to dominate us and master us the same way it mastered Cain. And so Cain is in the second Temple period in the New Testament. You see this in First John as one shining example. Cain is the preeminent sinner, not Adam. Cain is the sinner. You read Josephus. He's the first heretic, right. That gets picked up by a bunch of the ante Nicene fathers that he taught his children after him, evil, right? So he's a paradigmatic heretic. He's the paradigmatic murderer. He's the. All of these things. He's, you know, I mean, St. John calls him the. The says he's the son of the devil, right. Like so. And it's that sonship, like we've talked about it in past episodes, being a son of God, right, that, that he's his image, right. His likeness, the one doing his works on earth, that that's what happens through sin. And we have to separate those. So we're going to talk about the bodily resurrection some more in the. The second half coming up here. But we see in our iconography and our hymnography that we see Adam and Eve being restored, Adam and Eve being redeemed, humanity being redeemed from death and from the mortality that resulted from Adam's transgression. We don't see the same thing in terms of Cain anywhere being redeemed from Sin, redemption from death is universal for the human race. But that negative aspect of salvation, taking care of. Taking care of sin and purification is not. Is not everyone."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3367.38,"end":3512.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, man. All right. Well, before we go to break, I actually just wanted to read a. A prayer that actually kind of summarizes a lot of what we've just said. And so this is a prayer that's said by the priest, and it's called a prayer for one who has suffered long and who is at the point of death. And I'm just going to read it to you. We don't need to explicate it because we just excluded everything we're just talking about. But I'm going to read it to you, and you can hear everything that we've said summarized now in this. This beautiful moment when a priest is praying over someone who's. Who's in the process of dying. O Lord our God, who in thine ineffable wisdom didst create man and has fashioned him out of the dust, adorning him with comeliness and splendor as an honorable and heavenly acquisition to the glory and magnificence of thy glory and kingdom, that thou mightest lead him unto that which is according to the image and the likeness. But inasmuch as he trespassed the command of thy statute, having accepted the image, but having preserved it not, and therefore that evil not be immortal out of love for mankind as God of the fathers, by Thy divine will thou didst ordain remission for this. And that this indestructible bond should be severed and dissolved, and that the body therefore be dissolved from the elements of which it was fashioned, but that the soul be translated to that place where it will remain until the general resurrection. Therefore we pray unto Thee, the unoriginate and immortal Father, and unto Thine only begotten Son, and unto Thy most Holy Spirit that thou wilt release. And then you give the name from the body unto rest, entreating also out of thine ineffable goodness, forgiveness. If he in any way, whether of knowledge or in ignorance, has offended thy goodness or is under the ban of a priest, or has embittered his parents, or has broken a vow, or has fallen into demonic delusion or shameful magic because of the malice of an evil demon, yea, O Master, Lord God, hearken unto me, thy sinful and unworthy servant in this hour, and release thy servant from this unendurable sickness and the bitter infirmity that has taken hold of him, and give him rest where the souls of the righteous abide. For thou art the repose of our souls and bodies. And unto thee do we send up glory to the Father and to the Son and to the Holy Spirit, now and ever and unto ages of ages. Amen."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3513.56,"end":3529.88,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3534.36,"end":3540.65,"speaker":"Fr Stephen De Young","text":"You have that RV that blared out a warning that some type of an explosion was coming."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3540.65,"end":3542.37,"speaker":"Bobbi Maddox","text":"It happened on Christmas Day."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3542.37,"end":3545.21,"speaker":"Fr Andrew Stephen Damick","text":"Tonight, that powerful Hurricane Zeta is slamming."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3545.21,"end":3548.53,"speaker":"Bobbi Maddox","text":"Into Louisiana at 110 miles per hour."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3548.77,"end":3556.21,"speaker":"Fr Andrew Stephen Damick","text":"It's moving at breakneck speeds firefighters rarely see exploding. Across the Sierra National Forest this Sunday."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3556.45,"end":3558.05,"speaker":"Fr Stephen De Young","text":"Assault on democracy."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3559.89,"end":3561.41,"speaker":"Fr Andrew Stephen Damick","text":"To slow the spread of the coronavirus."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3561.73,"end":3563.62,"speaker":"Fr Stephen De Young","text":"As you can see, we are heading."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3563.62,"end":3565.14,"speaker":"Bobbi Maddox","text":"In the wrong direction and we are."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3565.14,"end":3566.3,"speaker":"Fr Stephen De Young","text":"Heading there very fast."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3567.26,"end":3612.21,"speaker":"Unregistered: Elisa Bielatic","text":"In these uncertain times, it is difficult to know who to trust and where to turn for guidance on the issues of the day. How does one nurture and maintain an orthodox mindset in the midst of what seems at times like crisis after crisis? Where are the gentle and discerning voices that speak reason and hope in a way that cuts through the cacophony of panic and unrest that surrounds us everywhere? When you are feeling lost and overwhelmed in this age of turmoil, or like your Orthodox faith, no longer pertains to contemporary society and its challenges, one place you can go for refreshment, renewal, and just plain good sense is ancient faith radio."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3612.45,"end":3616.1,"speaker":"Fr Stephen De Young","text":"As Orthodox Christians, we don't oppose medicine."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3616.26,"end":3618.9,"speaker":"Fr Andrew Stephen Damick","text":"We see the wonders of such progress."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3618.9,"end":3621.38,"speaker":"Fr Stephen De Young","text":"As a sign of the higher faculties."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3621.38,"end":3630.82,"speaker":"Fr Andrew Stephen Damick","text":"Of man, even the image of God, which allows us to think higher thoughts, to create, to inform, and even to build. So God decided that there had to."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3630.82,"end":3633.78,"speaker":"Announcer","text":"Be a world with holocausts, with tsunamis."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3634.26,"end":3642.84,"speaker":"Fr Andrew Stephen Damick","text":"With murders of children, with all these horrible, horrible things. And when we hear them all, what comes to the mind of a believer."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3642.84,"end":3648.76,"speaker":"Announcer","text":"Is, first of all, thanks be to God that this is not the final word."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3649.56,"end":3666.3,"speaker":"Fr Stephen De Young","text":"Our struggle to live according to God's ultimate and original plan is a journey to reclaim our true nature, restore communion with God, and ultimately return all of creation to the state God had originated."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3666.45,"end":3681.65,"speaker":"Unregistered: Elisa Bielatic","text":"Originally intended Ancient faith radio, your home for Orthodox teaching, orthodox music, and reliable cultural insight from an orthodox perspective. Thanks for listening, and thanks so much for your support."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3689.17,"end":3705.28,"speaker":"Announcer","text":"We're back now with the Lord of Spirits, the Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3712.08,"end":3742.97,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back. This is the second part of our show. Normally we begin to take your calls, but as we mentioned earlier, this is not a live show. This is pre recorded. So we talked about human bodies and what happens to human bodies, especially after all the things that occur in Eden and the time after that and so forth. But what about angels? What about their bodies? We talked about that a little bit. And so to start us off, I just wanted to play this pair of questions from our friend Father Photius in Texas."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3743.21,"end":3745.37,"speaker":"Fr Stephen De Young","text":"Hi, this is Father Photius Avant."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3745.69,"end":3747.57,"speaker":"Fr Andrew Stephen Damick","text":"And I'm very sorry, but I actually."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3747.57,"end":3803.28,"speaker":"Fr Stephen De Young","text":"Have two questions and I hope that's not cheating. St. John of Damascus, in his exact exposition of the orthodox faith, says that angels cannot repent on account of their incorporeal nature. And yet he further clarifies that it is only the deity which is truly immaterial and incorporeal. I do not see in this necessarily a contradiction to the understanding that Yahweh and the angels can be said to have bodies. If we are speaking of a nexus of potentialities, as has been mentioned. I do, however, wonder what it is about the angels immortality which prevents them from repenting. And secondly, how do unclean spirits interact with the world around them as they are deprived of the faculties of a body? Thank you so much. God bless you abundantly."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3803.75,"end":3841.7,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what about that? Well, that's what we're about to talk about, actually. So it's good that you ask Father Photius. Yeah, I mean, I think the way for us to get into this is to talk about angels and their bodies. And especially to mention, you know, we got a little bit of pushback in our Facebook group saying, well, doesn't the church teach that angels are bodiless? We call them the bodiless powers over and over again. How can you guys possibly say that they have bodies? And of course, to that we will answer, well, St. Paul says that they have bodies. So I mean, you can't go wrong by simply quoting St. Paul. Right, so let's talk about that a little bit then."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3842.98,"end":3862.44,"speaker":"Fr Stephen De Young","text":"Right. And not only St. Paul, but numerous fathers. I mean, St. John of Damascus is a notable one. Explain, you know, that apparent disjunction of the Church using the language of bodiless and then St. Paul saying they have bodies by saying that they're bodiless compared to us."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3862.44,"end":3864.08,"speaker":"Fr Andrew Stephen Damick","text":"Yes, it's a relative term."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3865.12,"end":3894.55,"speaker":"Fr Stephen De Young","text":"Right. And when they say bodiless compared to us. They're not saying. They're not using body there in the sense that we've been talking about it in this ancient sense. So they're not saying that angels are powerless compared to us, or they're unable to interact with God or humans or. Or the world. Less. They're less able than we are. They mean it in the sense of physicality and materiality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3894.71,"end":3895.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3895.15,"end":3902.87,"speaker":"Fr Stephen De Young","text":"That compared to us, they are. They are immaterial and lack tangibility."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3903.59,"end":3904.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3905.35,"end":3912.83,"speaker":"Fr Stephen De Young","text":"But they are not utterly intangible and utterly immaterial because they're created beings. They're not God."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3912.83,"end":3930.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I seem to recall that. Is it Saint John of Damascus who says that they are circumscribed, meaning that there's a. For lack of a better phrase, you know, space that they exist in, or that they. They're not limitless. That to be true."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3930.59,"end":3931.55,"speaker":"Fr Stephen De Young","text":"They're not infinite."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":3931.55,"end":4058.06,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. They're not infinite. You know, they're. They're. They're limited. They're finite. We are, too, although in very different ways. So they have bodies, but they're not. They're not material bodies in the sense that we have materiality to our bodies. Right. And that's an important point. So they are bodiless. But again, again, it's just like we said at the very beginning, like, you can't get hung up on a particular word. Right. What does someone mean by the word? That's the important thing. We're not. When we say that angels have bodies, we're not saying that they have corpses. If they were to die or something like that. That's not what we're saying. Their arms and legs and fingers and toes, hair and eyeballs and so forth. That's not what we're saying. So. Yeah. So. Well, you know, if you don't mind, I'm going to read actually what St. Paul says about this, and we can talk about this passage. And so this is from 1 Corinthians, chapter 15, starting with verse 38. And he's continuing on from a little bit longer, a longer discourse here, where he's talking about bodies and the resurrection and all this kind of stuff. This whole chapter is really fascinating and interesting and as you have pointed out, many times pivotal. So starting with verse 38, and I'm reading here from the new King James. But God gives it a body as he pleases, and to each seed its own body. All flesh is not the same flesh, but there is one kind of flesh of men, another flesh of animals, another of fish, and another of birds. There are also celestial bodies and terrestrial bodies. But the glory of the celestial is one and the glory of the terrestrial is another. There is one glory of the sun, another glory of the moon, and another glory of the stars. For one star differs from another star in glory. So I can imagine the immediate objection now to this is when he's talking about celestial bodies, doesn't he just mean rocks floating in space and balls of gas that are on fire? You know?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4059.34,"end":4063.1,"speaker":"Fr Stephen De Young","text":"Right. And some are, some are brighter than others. Right? That's what the glory is talking about."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4063.1,"end":4063.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4063.42,"end":4091.81,"speaker":"Fr Stephen De Young","text":"Yeah. So no, no, yeah is the short answer. So the slightly longer answer is in, in the Greek, both that list, the sun, the moon, the stars, the way they're talked about, and the list in the passage you just read of the different types of animals is reproduced word for word, essentially from the Greek of Deuteronomy chapter four."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4092.05,"end":4092.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4092.85,"end":4099.89,"speaker":"Fr Stephen De Young","text":"And that's a text that we've cited a bunch in the past episodes, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4100.62,"end":4118.14,"speaker":"Fr Andrew Stephen Damick","text":"Deuteronomy 4:19 especially, right. Where God says, don't give worship to the heavenly. When you look up at the moon and the stars and all the host of heaven, it says there, don't worship them and serve them."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4118.7,"end":4149.21,"speaker":"Fr Stephen De Young","text":"Right. Who God has allotted to the other nations. So we've talked about that connected to Deuteronomy 32, verse 8. So St. Paul very clearly, he isn't just accidentally reproducing those two lists in exactly the same order. Right? That's. That's deliberate. So St. Paul is thinking of Deuteronomy 4 here. And so he's very clearly referring to angels."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4149.45,"end":4149.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4150.81,"end":4191.42,"speaker":"Fr Stephen De Young","text":"And so what it means that the bodies of angels, in a sense differ from one another in glory is what we talked about in our previous episode when we talked about the quote unquote, ranks of angels, right? That, that different angelic beings, right? Their vast cosmic intelligences, they have different purposes, different roles, different jobs, as it were, that they fulfill. And so they receive being created beings. They receive powers, abilities, potentialities related to that role that they're going to serve."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4191.58,"end":4191.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4192.86,"end":4205.82,"speaker":"Fr Stephen De Young","text":"And that. So they in that sense participate in God's power and his grace to those different extents. And so their, their glory differs based on, based on that role."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4207.19,"end":4207.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4207.39,"end":4239.29,"speaker":"Fr Stephen De Young","text":"And so St. Paul clearly has them in this same continuum of human beings and animals in terms of bodies. But it's especially important that he's talking about angels here, because as we're going to talk about in a little bit, once we're done talking about angels, he's going to use this idea of angelic bodies and celestial bodies, when he starts talking about human bodies in the resurrection and. And some of how they're different, but sticking with, Sticking with angels for now."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4239.85,"end":4241.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. One thing at a time."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4241.93,"end":4267.78,"speaker":"Fr Stephen De Young","text":"That would. And, yeah. And this kind of applies to the second part of Father Photius's question or his second question, depending on how we want to diagram his sentences. The second verse is talking about demons. Right. And so when we talked about the 5ish falls of the angels, we talked about how there are different things in the category of demon."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4267.86,"end":4269.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4270.26,"end":4301.17,"speaker":"Fr Stephen De Young","text":"Different types of beings. And so the, the. And demons who are fallen angelic beings. Right. The gods of the nations who are demons, powers and principalities who are demonstration. The demons responsible for making the. The nephilim. Right. And misleading humanity. The devil. They have bodies. They have angelic bodies."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4301.49,"end":4301.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4303.17,"end":4342.39,"speaker":"Fr Stephen De Young","text":"The exception to that would be the dead Nephilim themselves, who we've talked about the dead giants, the spirits of the dead giants being dead. Their bodies went into the ground and decomposed. And they now are, in a different sense, bodiless in the sense that they've been deprived of their body. And those are the demons that we see in the synoptic gospels and in the writings of the fathers and stories from their lives who come and indwell both idols and. Come and possess humans."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4343.74,"end":4344.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4344.78,"end":4353.66,"speaker":"Fr Stephen De Young","text":"And use those as. Use those as their bodies in order to interact with the world and do what they do."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4353.98,"end":4395.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although it should be noted that it's not a real union. Right, right. You know, if they, if they inhabit an idol or even possess a human being, those. Those physical objects do not become truly theirs. They just sort of temporarily kind of make use of them, you know. Right. We got. We kind of an odd question. I recall this in the group where someone essentially kind of wondered, you know, if someone. If one of these disembodied Nephilim inhabit a person and, you know, possess a living human being. You know, what does that kind of say about that human being and all this kind of stuff?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4395.93,"end":4396.13,"speaker":"Fr Stephen De Young","text":"Like."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4396.13,"end":4424.96,"speaker":"Fr Andrew Stephen Damick","text":"Well, it's not, you know, it's. That body doesn't become their body. You know, it's almost like, I don't know, a suit of clothes. Right. It's not your body, you're just kind of clothed in it. I don't know if that's the right word to use. But you know, I could. I could wear a hazmat suit. Right. And use that to interact with the world, but it's not. And it moves when I move it but it's not me, you know, it's just we have like a body."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4425.92,"end":4430.4,"speaker":"Fr Stephen De Young","text":"We have a bunch of examples of this in the synoptic gospels. I mean, Legion is an example of this."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4430.4,"end":4432.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4432.28,"end":4432.72,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4432.8,"end":4434.08,"speaker":"Fr Andrew Stephen Damick","text":"And they can be driven out."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4435.04,"end":4448.08,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, they could be. They could be driven out again. Now, the one possible, and this is going to be a big tease, but the one possible, slightly different scenario would be in the case of vampires. But we'll talk about that in a future episode."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4448.4,"end":4455.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there we go. Yeah, we should do a whole episode that's sort of vampires, werewolves, zombies."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4456.87,"end":4457.35,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4458.31,"end":4458.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4460.31,"end":4462.59,"speaker":"Fr Stephen De Young","text":"Maybe our next Halloween special. That's where we'll go."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4462.59,"end":4463.19,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4464.71,"end":4503.91,"speaker":"Fr Stephen De Young","text":"So, but we'll see when we get to that. But so, so, yeah, so that's. That's how they then interact with the world is through possessing. Right. Taking possession. I mean, we use the term possession all the time, but that's what it is. It's taking possession. They're squatting, right. Taking possession of some. Somebody in the material, in the material world. And this also, probably the question that I think we've gotten the most since this show started has been about why demons can't repent."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4504.63,"end":4534.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And even we got a recent question in the group, someone was like, someone was telling a relative, I think about this, and the relative is like, well, that's not fair. You know, why doesn't God provide them the means of repentance as well? You know, why can't angels, fallen angels, demons, why can they not repent? Can't they just change their minds? Don't they see how horrible it is to be a demon? Don't they sound."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4534.46,"end":4535.3,"speaker":"Fr Stephen De Young","text":"They can't be fun."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4535.7,"end":4554.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I would love to get back into the divine council. Guys, come on. Is this really forever? So, yeah, well, what about that? Because it's actually relevant to us. To us, to us human beings. But let's talk about it from an angelic point of view first."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4554.66,"end":4555.06,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4555.22,"end":4556.02,"speaker":"Fr Andrew Stephen Damick","text":"As much as we can."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4557.74,"end":4623.36,"speaker":"Fr Stephen De Young","text":"I suppose it is a noble quality to have sympathy for the devil. And to quote a great Armenian, I cry when angels deserve to die. But that would probably went right over your head. I know it did. But there's someone out there, the devil, there's someone out there who that just landed with in a big way, send us your cards and letters telling us if it was you. So we've already. We've already touched on a couple elements of this. Like we touched on the idea that. That human mortality is what provides for repentance. Right. That our Mortal bodies are particularly suited to allow for repentance. And I think back in the 5ish Falls episode, again, we referenced at least the idea that one of the reasons why God provides this way of repentance for humans is because, you know, if he didn't, then essentially the evil spiritual powers would have won."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4624.08,"end":4624.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4624.72,"end":4632.4,"speaker":"Fr Stephen De Young","text":"That was. Their goal, was to confound God's plan in Christ. And the incarnation was to destroy humanity. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4633.84,"end":4658.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And we should say here, by the way, that this idea that. That angels can't repent because they don't have mortal bodies. Again, we're not making this up. This is straight out of St. John of Damascus. He has a section about angels. Right. And he explicitly says this here. And St. John of Damascus is not a speculative theologian. He is a catechist. Right. He is teaching the basics, the core stuff."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4659.47,"end":4663.55,"speaker":"Fr Stephen De Young","text":"Right, right. And what he's received from previous fathers."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4663.87,"end":4666.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He's not making it up either. Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4666.84,"end":4675.96,"speaker":"Fr Stephen De Young","text":"Right. So what this all comes down to, ultimately, is what is it like to be a bat?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4681,"end":4681.64,"speaker":"Fr Andrew Stephen Damick","text":"A bat?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4682.44,"end":4683.04,"speaker":"Fr Stephen De Young","text":"A bat."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4683.04,"end":4684.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Like a bat."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4685.24,"end":4687.64,"speaker":"Fr Stephen De Young","text":"Flying rodent. Yes, a flying rodent."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4688.76,"end":4692.64,"speaker":"Fr Andrew Stephen Damick","text":"So this is not a vampire thing, is it? No, no, no."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4692.64,"end":4702.24,"speaker":"Fr Stephen De Young","text":"We're not going back to the vampire thing yet. Don't get excited. Don't get too excited. What is it like to be a vampire? Is a whole other thing. No."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4702.24,"end":4707.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I was told that the world is a vampire."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4707.68,"end":4708.96,"speaker":"Fr Stephen De Young","text":"Yeah. Set to drain."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4708.96,"end":4712.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. See, I can make pop culture references, too."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4712.64,"end":4774.28,"speaker":"Fr Stephen De Young","text":"You can? And since we're. That's particularly appropriate since we're answering Father Photius's questions, but. So what is it like to be a Bat? Is the title of a famous among 12 nerds philosophical essay by a philosopher named Nagel, who's probably the preeminent contemporary writer in philosophy, but here's why it's important. What he talks about in that is the fact that if we want to sit and discuss the question, what is it like to be a bat? What we're doing in trying to imagine that is we're essentially imagining our brain in a bat body. Right. It's like, what would it be like if my consciousness. Right. Was inside a bat body? Like a witch, turned me into a bat, but it was still me, and I had all my memories and thoughts and everything. But now I'm a bat, which isn't what it's like to be a bat."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4775.08,"end":4775.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4775.6,"end":4780.84,"speaker":"Fr Stephen De Young","text":"That's what it's like to be a human consciousness trapped in a bat body, which is a different thing."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4781.16,"end":4781.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4782.04,"end":4823.98,"speaker":"Fr Stephen De Young","text":"And so we, we don't know. And we can't know what it's like to, you know, sense the air traveling around our wings while we're in flight. Right. Or experiencing the world through reflected sound. Right. The way a bat does. A bat's consciousness is structured totally differently than ours. And so we don't have a window into what it's like to be a bat. We only have a window into human consciousness. So why is this important for angels? Well, if we can't understand what it's like to be a bat. Yeah, we can't understand what it's like to be a vast cosmic intelligence."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4824.69,"end":4846.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I just looked this up, by the way, and what is it like to be a bat? Is in fact a Wikipedia article. So it actually has a nice little summary about. Yeah, there's actually a Wikipedia article called what is it like to be a bat? So there it is. And there's even a picture of a bat and there's a picture of Dr. Nagle."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4848.61,"end":4868.86,"speaker":"Fr Stephen De Young","text":"So that, and we're talking here about the structure of consciousness. And, and here's why that's important. It means we don't understand how an angelic being experiences reality. Yeah, we don't understand how they experience things like time and space."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4870.7,"end":4871.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4871.1,"end":4907.5,"speaker":"Fr Stephen De Young","text":"Because, you know, for example, we, we don't have, like with Archangel Gabriel comes to the Theotokos to tell her she's going to bear a son, right. It's not told like, well, he leaves heaven and then he has like a 93 million mile trip, right, to get to Earth to get to right where the Theotokos is. Right. To tell her he's not like, traversing space like that. And we can't. Well, what, what is the maximum flight velocity of an angel? Right. Like, yes, we understand innately that these are silly questions."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4907.66,"end":4909.74,"speaker":"Fr Andrew Stephen Damick","text":"You mean an African or a European angel?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4909.98,"end":4977.75,"speaker":"Fr Stephen De Young","text":"Right, exactly. Well, they were coming to help with the election. I was given to understand by a certain prophet. But angels coming from Africa and from who? So we got political. I know, but the. So we understand that that's a silly question, but it's equally a silly question for us to try to understand how angels experience time. We still preeminence, as I've said so many, like, quasi negative things about him. I'll say something super positive now about St. Augustine. St. Augustine's understanding of human consciousness of time in books 10 and 11 of the Confessions is the greatest work on that subject ever written. And I can pretty much prove that because even phenomenologists like Husserl And Heidegger basically just cribbed from it. When they talked about human understanding of time, all right. They just basically stole from it. But that is, again, that's talking about how humans experience time and memory and change. Right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4977.75,"end":4978.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4978.39,"end":4987.27,"speaker":"Fr Stephen De Young","text":"And all of that, understand, all of our understanding of time and change is intimately related to our mortality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4988.47,"end":4988.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":4989.03,"end":5024.24,"speaker":"Fr Stephen De Young","text":"Our mutability. Right. Those all factor in. So what it means to talk about angels and demons, you know, before and after they fell and quote, unquote, when they fell, from their perspective, not from our perspective. Right. Because some of these events coincided with events on Earth. And so we could talk about from our human perspective, well, here's what was going on on Earth related to the fall of this being."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5025.12,"end":5025.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5026.48,"end":5041.44,"speaker":"Fr Stephen De Young","text":"But that's not from the angel's perspective, Right, Right. That's from our perspective, the perspective of human history and human memory. So a lot of these questions are ultimately unanswerable."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5042.32,"end":5042.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5043.6,"end":5055.71,"speaker":"Fr Stephen De Young","text":"Right. In terms of, I mean, when we say, well, is it an angel in hell? Isn't he, sorry, doesn't he want to go back to heaven? Right. That's our brain, right. Our consciousness in an angel body."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5056.91,"end":5057.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5057.79,"end":5060.03,"speaker":"Fr Stephen De Young","text":"Right. That's not what it's like to be an angel."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5060.35,"end":5080.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think, you know, you and I privately talk often about what's called the Dunning Kruger effect, right. Usually when we see people making embarrassing themselves. But the Dunning Kruger effect is when you don't even know what you don't know. Right. And."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5081.02,"end":5084.94,"speaker":"Fr Stephen De Young","text":"Yeah. The less you know about something, the more you think you understand it."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5085.18,"end":5132.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, Right. And, you know, I mean, just from an experience that probably all of us have had, you know, watching a kid think that he knows everything there is to know about whatever, and then horribly do something horribly wrong. Right. You know, really a big mistake. And the problem is that we don't even know how we would begin to know what it's like to be an angel. You don't even know where to begin. The problem, even the concept that a problem has a beginning is a human concept. But we can't conceive of another way of conceiving. Right. We don't even know what it means for them to conceive, to think."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5133.56,"end":5133.96,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5135.56,"end":5158.04,"speaker":"Fr Andrew Stephen Damick","text":"And this is, you know, this, this causes theological problems too, Right. Like, you know, we've talked, for instance, about the heresy of universalism. It. It's. Universalism is predicated upon these kinds of assumptions that human consciousness is what kind of really rules the universe. This is kind of the way it comes down to being or the way that every sentient being really functions."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5158.04,"end":5162.2,"speaker":"Fr Stephen De Young","text":"You know, that our, our present fallen human consciousness to boot."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5162.28,"end":5253.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. And I mean, and this has, this has enormous pastoral implications too. Right. You know, someone might say, well, I have a tendency towards what's something that the church says is sinful? Well, I, that's just who I am. I was just born this way, whatever it might be. It's like, well, but we're in a fallen state. So yes, maybe I am born this way, but that doesn't mean that that's how God made me or that I have to stay that way or whatever it might be or that I'm just subject to it. That I must accept that we need a lot more humility, theologically speaking and pastorally speaking. And, and just in terms of our own kind of psychology. Just because I feel something over and over again and I can't imagine not feeling it. And I don't mean just things that we think of as sinful tendencies, but even just habits of the mind. Right. If we have that problem where we can't even imagine being different, then how much more is it an issue for us to. To try to figure out, you know, what it's like to be an angel and what it means for an angel to repent or not repent or whatever. So, yeah, I mean, this is huge. This is, again, this is not just, as we've said in the past, not just nerdy giant stuff. This is not just nerdy angel stuff. This actually comes down to kind of where we are."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5253.67,"end":5262.25,"speaker":"Fr Stephen De Young","text":"Right. And how much more ridiculous is it for us to try to psychologize God?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5263.37,"end":5263.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5263.85,"end":5280.17,"speaker":"Fr Stephen De Young","text":"Or psychologize Christ? And this works in all kinds of insidious ways, not necessarily perfidious, but where people talk about, you know, God planning things."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5281.53,"end":5282.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5282.09,"end":5285.62,"speaker":"Fr Stephen De Young","text":"Like God sat down at some point in time and then planned things."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5285.77,"end":5286.17,"speaker":"Fr Andrew Stephen Damick","text":"The future."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5286.81,"end":5304.49,"speaker":"Fr Stephen De Young","text":"Or talk about what was Jesus thinking when this happened? And it's like, what? You know, like, well, he's. He's God, so you can't fathom it. Right. We can't know what it's like to be God. We can't even know what it's like to be other created things."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5304.81,"end":5305.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5306.09,"end":5307.53,"speaker":"Fr Stephen De Young","text":"Let alone uncreated."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5308.01,"end":5381.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay. So related to that, and probably now that you've heard all that, everybody, you could probably answer this for yourselves. But still, let's go ahead and ask it, you know, okay, so God gives mankind mortality altering human bodies in order to. For that to be, you know, and that's what happens. That makes us capable of repentance, what would it be like when. If he did that for angels, why doesn't he do that for the fallen angels? Why doesn't he give them mortality? And one of the questions that came to my mind is like, well, would we really want materially embodied demons walking around on this earth? Would that be a good idea? What would happen? And I recall in our pre show discussion you kind of said, well, we sort of did, right? This is the part where everybody gets excited. Giants exactly are basically that, right? I mean they're not exactly that, but they are, they're embodied, materially embodied, demonized beings."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5381.81,"end":5383.81,"speaker":"Fr Stephen De Young","text":"And did they fully demonized humans?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5384.29,"end":5456.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Did they repent? No, they super didn't. The flood came, you know, they didn't repent or God sent Israel to wipe them out because they had to just go, you know, it had to be over. So yeah, and again. And I mean we could fall back and say, well, God knows what he's doing. How can we question God? Which I think is a good answer, actually. I mean, that's what God kind of says to Job. When Job says, well, what about blah, blah, blah, he's like, well, were you there when I made the world? Right? It's not like it's an unbiblical answer to say that, but there's more to it than that. There's more to it than that. And I think a lot of it is just simply that it's predicated upon this idea that we don't know what it means to be an angel. So even though we sort of try to imagine what it might be for them to repent, it's not a problem that we can even think about correctly. To say nothing about solve and to say nothing about judging God. Like, why don't you make this choice instead? You know, because again, we have to work with what actually God has revealed to us, not what we want it to have been, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5456.68,"end":5495.85,"speaker":"Fr Stephen De Young","text":"And apophaticism, which is what this basically is, is not just a punt, right? It's not just like, I don't know, right? Or you know, yeah, you found a flaw in my logic. So I'm just going to paper it over by appealing to mystery, right? That's, that's not what apophaticism is. Realistic humility about what humans are capable of knowing and understanding and what they're not, right? And understanding that if you try to come to an understanding of something that you by nature cannot understand, you're going to come to at best a deformed understanding and at worst, just total, total imagination and fiction."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5496.01,"end":5498.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5498.47,"end":5501.07,"speaker":"Fr Stephen De Young","text":"So now let's get back to some cataphaticism."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5501.39,"end":5514.27,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Welcome back to things we can say. Yeah, welcome back to things we can say, everybody. So, all right, well, yeah, back. Back to First Corinthians 15 then."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5514.99,"end":5538.21,"speaker":"Fr Stephen De Young","text":"Yeah. And the, the immediately succeeding verses, that's in which St. Paul is talking about, specifically about our bodies, human bodies in the resurrection, when the resurrection takes place and our soul is reunited with our body, our life is brought back into our body to animate it again."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5538.45,"end":5568.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So he had just said, look, there's different kinds of bodies. There's celestial bodies, there's terrestrial bodies, there's different kinds of terrestrial bodies, there's different kinds of celestial bodies. And then he begins with. So also is the resurrection of the dead. Right. And we're not going to read this whole passage to you, but what we're looking at, if you want to open it up, everybody, is 1 Corinthians, chapter 15, verses 42 through 54. So we're going to kind of summarize that and say what St. Paul is saying here. So what is he saying? What is this about?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5568.63,"end":5574.71,"speaker":"Fr Stephen De Young","text":"Yeah. And we'll be coming back here in our pre Pascha episode, by the way. We got to keep the teases coming."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5574.87,"end":5575.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5576.73,"end":5589.53,"speaker":"Fr Stephen De Young","text":"Keep everybody coming back for more. The first one's free. So what St. Paul talks about here is he uses the language of the mortal being clothed with immortality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5590.01,"end":5591.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5591.13,"end":5596.41,"speaker":"Fr Stephen De Young","text":"Of our bodies being sowed in the ground, buried in weakness, but rising in strength."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5597.05,"end":5598.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5598.25,"end":5605.29,"speaker":"Fr Stephen De Young","text":"And that language he's using, again, makes sense if you understand this ancient concept of the body."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5605.91,"end":5606.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5606.07,"end":5659.38,"speaker":"Fr Stephen De Young","text":"Because the transition that happened at the expulsion from paradise is powers becoming weakened, these potentialities, these passive potentialities coming into play. Right. And, and those are the things that St. Paul is calling weakness. Those are the things that St. Paul is noting when he talks about mortal bodies and mortal flesh. Right. And then that gets clothed upon with immortality that rises in strength, meaning those powers are reinvigorated. Right. And. And those passive potentialities are sort of eclipsed and removed. Death has sort of served its purpose. The purpose for which we just talked about God had. Had granted it to humanity in the first place. That purpose has now been served, and so now it's done away with. Right. And it's done away with by making humans no longer subject to it."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5659.86,"end":5717.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And we should point out that this redemption of human nature happens to it's human nature itself. So that means that all human Beings are going to rise from the dead. You know, resurrection is not a reward for the righteous. It's something that's going to happen to all of us. Absolutely all of us. We will be raised incorruptible. And that's how St. John Chrysostom, in his paschal homily can say, not one dead remains in the grave. You know, he's not just talking about some group of people, it's everybody. And now he's speaking eschatologically when he speaks there, because he's obviously in the 4th or 5th century. Whenever he's speaking, the general resurrection had not occurred yet. Justice has not occurred yet for us. But. But. Right. It's. It's universal. It's universal."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5717.86,"end":5728.22,"speaker":"Fr Stephen De Young","text":"Right. And John, John 5, 28, 29, famously, Christ says, the day is coming when all those who are in the tombs will hear the voice of the Son of Man. And those who hear shall live."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5728.7,"end":5729.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5729.82,"end":5746.06,"speaker":"Fr Stephen De Young","text":"Those who have done, have done good unto the resurrection of life, those who have done evil to the resurrection of condemnation. But everyone experiences this resurrection. Everyone receives this new body."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5746.86,"end":5748.18,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5748.18,"end":5756.86,"speaker":"Fr Stephen De Young","text":"This, this new human body. So in, in a sense, this is a reversal of what happens at the expulsion from Paradise. But it's not just that."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5757.58,"end":5805.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, that this is really intriguing to me because, I don't know, I guess for most, you know, most of my life, I thought, okay, we're gonna get. Finally get back to where we were in paradise and can kind of get back on track and continue on, you know, have that life again. But we can't, like, we can't say, well, it's all water under the bridge now. Something has happened which is all of these things we've been talking about, all of human history, all of these, these falls, all of our sins, all of. All of this has occurred. That even individual human history, my history, right. It's not going to be erased in the resurrection. It's not gone. Right, Right. So what else is happening here?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5806.45,"end":5861.38,"speaker":"Fr Stephen De Young","text":"Right. So humanity is now in a different position than it was at the time of the expulsion from paradise, where Adam was innocent and was at the beginning of the story. Right. But humanity has now, through the incarnation of Christ, this positive work that was always intended to happen has taken place. So the adoption as sons of God that we've talked about in so many previous episodes, this has now taken place in Christ. Humanity has been brought to a maturity that it didn't have originally. And so when, when we receive the resurrection body, it's not only just reversing that and taking us back to this place of innocence. But it's now being confirmed in what we've become. And that is for good and for ill. That's where that resurrection of condemnation comes in."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5861.46,"end":5862.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5862.46,"end":5918.11,"speaker":"Fr Stephen De Young","text":"Because looking at it negatively, right, all of humanity would have ended up like the demons, immortal and wicked, if not for mortality. But the unrepentant, that is where they still end up after losing this window that God has given for repentance, this life in this world that he's given us for repentance. And then on the positive side, right, Humanity has now been united to God in the person of Jesus Christ permanently and forever. So again, since I want to try and balance out the things I've said about St. Augustine, right. St. Augustine, the one hymn he wrote, his Ode to the Paschal Candle, famously has in Latin refers to Adam and Eve's transgression as felix culpa."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5918.11,"end":5918.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5918.83,"end":5921.23,"speaker":"Fr Stephen De Young","text":"Sometimes translated oh, happy fault."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5921.31,"end":5921.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5922.19,"end":5922.99,"speaker":"Fr Stephen De Young","text":"In English."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5923.55,"end":5923.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5924.43,"end":5928.27,"speaker":"Fr Stephen De Young","text":"And it's the reason it's happy is because of the redemption it produced."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5928.59,"end":5929.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5929.67,"end":5945.11,"speaker":"Fr Stephen De Young","text":"So St. Augustine is even delighting in the fact that this, that the devil intended for evil, even this Christ has now turned to good for humanity."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":5945.75,"end":6010.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think, for instance, about the fact that the resurrected Christ still bore visibly on his body the marks of the passion. His suffering is part of who he is. I mean, if I can put it that way. I'm not trying to lay out any complicated Christology here, but it's clear that it's not erased. It's not erased, that it's there and his wounds are life giving now. Right. Thus, Felix Kulpa, right. That man meant it for evil, but God has turned it to good. And it's interesting that the scripture puts it that way and not man meant it for evil and God erased it. Right, Right. That the thing that was meant for evil has become now good. You know, that like. And you know that tombs, tombs of saints can be healing rather than just, you know, destruction and decay and so forth. Forth. Right. Relics, you know, all of this stuff."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6010.67,"end":6062.58,"speaker":"Fr Stephen De Young","text":"Yeah. So this, this, there's, there's both the, the positive piece and the negative piece. But this positive piece is why St. Paul over and over again. And our reading of St. Paul's soteriology is a mess because of a lot of Western stuff. I won't go into a tyrant against it again. I've done plenty of those. But because we've lost this positive part again and again and again. St. Paul not only talks about repenting of sin, Right. Knock it off with the sinning guys. Right? I mean, that's definitely important. Right? And being healed of the effects of our sin is definitely important. But equally important to St. Paul, and in some epistles, more important is him again and again calling the people in. In the communities he's writing to. To come to maturity."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6062.58,"end":6063.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6063.38,"end":6100.49,"speaker":"Fr Stephen De Young","text":"To push toward perfection, to be zealous for good works, to participate in the work of God in the world and be transformed in a positive way, not just in getting rid of sin. This is a, A part of our salvation. Right. And is part of that original plan that we kind of lose sight of and, and forget about. Because the picture we get at the end of the book of Revelation of the new heavens and the new earth. Right. There's no temple, and that includes no Eden. Because the whole cosmos is the place where God lives now."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6100.89,"end":6101.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6102.25,"end":6135.01,"speaker":"Fr Stephen De Young","text":"That original goal has been accomplished. The whole cosmos, the whole universe is now Eden. It's now the place where God dwells, is now in perfect order, is now filled with life. Right. That's been accomplished at the end, but we're in the process of. Of accomplishing it now. And that is part and parcel of our salvation. Just as Adam and Eve were going to come to maturity and be transformed themselves by continuing the work of God and participating in it. Same with us. That's how St. Paul sees salvation."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6135.57,"end":6173.89,"speaker":"Fr Andrew Stephen Damick","text":"Amazing. And. And, you know, I don't know that we've made it explicit yet, but just to say this also because I think it's important. You know that passage From John, chapter 5, about the resurrection of life and the resurrection of condemnation, or sometimes it's translated as a judgment or even damnation, that because our bodies will no longer be subject to mortality, then that means that repentance is not a thing. Right? It's. It's not. It's not possible after. It's not possible. Not only after death, but it's not possible after the resurrection either."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6174.45,"end":6239.98,"speaker":"Fr Stephen De Young","text":"Right. And. And when we say repentance is not possible. Right. It's. It's important not to psychologize this because again, this is a person in a state other than our present human consciousness. But not just that. We're. We're not saying that there are all these poor people in hell or however you want to talk about it. You know, usually the people who are opposed to this will conjure up some kind of fiery hell of torment which inevitably will do an episode. That's not what hell is. But anyway, it's not what Hades is, that they're there and they're Suffering horribly and they really want to repent, but they get told not too late. Right. No, you missed your window. Stores closed. Right. That's not what we mean by it's not possible to repent. It's not possible to repent meaning in their will, they don't desire to repent. Right. There is no transformation that takes, that takes place self motivatedly."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6240.06,"end":6242.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no regret. They don't have the capability of regret."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6243.18,"end":6257.8,"speaker":"Fr Stephen De Young","text":"Anyone who. And hopefully it will be few, you know, very, very few other than the demons themselves. Anyone in that state of condemnation is going to be there hating God with every fiber of their being."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6258.6,"end":6284.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which, which then I just wanted to loop back to a question I don't think we addressed directly, but we all, we get all the time, which is, you know, given that there's multiple points at which angels fall as depicted in scripture, could that still happen? And if not, why is the Archangel Michael kind of change his mind about serving God?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6286.57,"end":6295.77,"speaker":"Fr Stephen De Young","text":"Right. Well, that's again, assuming that angels experience time the way we do, like on a parallel track. Right? Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6296.09,"end":6301.29,"speaker":"Fr Andrew Stephen Damick","text":"So I guess we talk about five ish falls of angels. That's from our point of view."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6301.72,"end":6301.96,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6303.08,"end":6351.11,"speaker":"Fr Andrew Stephen Damick","text":"I seem to recall. I don't know if it's Saint Maximus or if he was talking about. Yeah, I think it might have been St. Maximus. It talked about the fallen angels falling as they come into being, which of course makes no sense from our kind of temporal point of view, but seems to attempt to sort of solve some of this issue, you know, so to speak. But I think the whole point of talking about 5ish falls of angels just to say, look, the scripture depicts these things kind of connecting with our time in whatever way that that happens at four or maybe five different points, you know, at least five events that we can point to. And maybe there's other events that we're not aware of. Right, right. I mean, that's, I'm just speculating here, but."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6351.35,"end":6356.15,"speaker":"Fr Stephen De Young","text":"Or maybe from their perspective, it's not an event. Right? I mean, yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6356.15,"end":6359.53,"speaker":"Fr Andrew Stephen Damick","text":"Maybe event is, is a human thing."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6359.61,"end":6364.65,"speaker":"Fr Stephen De Young","text":"Right. There are five historical events that relate to this spiritual reality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6366.17,"end":6460.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this connects with this question of the resurrection of the dead. Because again, it's this problem of perspective. I don't know what it's going to be like when I'm raised from the dead. How will I think, how will I perceive, how will I function? How will I act? And that's really all important to keep in mind for so many reasons, not just because it's kind of interesting to speculate whether angels could still fall. But. But also when, you know, when I. When I think about, I don't know, like, there's sometimes people will say things like, well, you know, okay, if you go in the ground and you decompose, your molecules are going to make their way through the ground. And if they fertilize some piece of grass that's eaten by a cow and then the cow is eaten by a person, does he then have your molecule? And is the resurrection going to really work on you? I mean, I'm reminded of there's a whole passage from Hamlet that kind of talks about this, about a worm eating the guts of a king and then the worm being used as bait by a beggar who eats the fish. But, you know, again, we're talking about, I don't know, I mean, a rearrangement of matter itself and the way that it works, at least especially as it relates to human beings. You know, the idea that. I think the problem is sometimes we think, okay, in the resurrection, we're going to basically be exactly what we are now, except faster, stronger, better, you know, superhumans, basically."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6462.3,"end":6465.26,"speaker":"Fr Stephen De Young","text":"But no, all you can eat frozen yogurt."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6466.62,"end":6509.53,"speaker":"Fr Andrew Stephen Damick","text":"There you go, the good place. Yeah. Right. Yeah. Lamest afterlife ever in that show. I mean, a really fascinating, interesting show. But heaven there is awful. It's lame. Yeah, yeah. And, you know, St. Paul says the body is sown in corruption and raised in incorruption. It's not the same thing. And even though there's the image of the seed, like, you think about a seed, it's this little thing, and you put it in the ground and what comes out looks nothing. Like, doesn't function like it. It doesn't look like it. It doesn't smell like, it doesn't taste like. It's just completely different. And yet it is the seed. It's the same."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6509.53,"end":6512.81,"speaker":"Fr Stephen De Young","text":"It's the same living entity. Yeah, it's the same living entity."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6512.89,"end":6522.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Cool stuff. All right, well, why don't we go ahead and go to a break, and then we'll come back for the third half of our show."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6523.13,"end":6539.45,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6543.54,"end":6546.02,"speaker":"Unregistered: Elisa Bielatic","text":"Hello, Elisa Bielatic of Everyday Orthodox."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6546.1,"end":6546.74,"speaker":"Fr Stephen De Young","text":"Well, hi there."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6546.74,"end":6549.7,"speaker":"Bobbi Maddox","text":"Bobbi Maddox, station manager of Ancient Faith Radio."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6549.7,"end":6550.06,"speaker":"Announcer","text":"Hey."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6550.06,"end":6558.26,"speaker":"Unregistered: Elisa Bielatic","text":"So I wanted to talk to you about creating A promo for the great lineup of family related programming currently available@ancientfaith.com Ah, cool."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6558.26,"end":6563.3,"speaker":"Bobbi Maddox","text":"You know, there are actually a lot of resources on the site for Orthodox families of all shapes and sizes, including."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6563.3,"end":6564.82,"speaker":"Unregistered: Elisa Bielatic","text":"A few that you've had a hand in."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6564.82,"end":6565.7,"speaker":"Bobbi Maddox","text":"That is true."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6566.11,"end":6589.55,"speaker":"Unregistered: Elisa Bielatic","text":"I'm talking, of course, about Tending the Garden of Our Hearts, which you record with Christina Wenger and that features weekly meditations for families with stories about the saints, scripture readings and lessons designed to open up conversation and to enrich the little church of the home. And then there's the podcast Raising Saints in which you offer tools to equip adults to share the Orthodox Christian faith with children. Help me out, Alisa. What else does AFR provide with regard to the family?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6589.79,"end":6622.47,"speaker":"Bobbi Maddox","text":"Well, let's see, you mentioned Christina, and she's also the woman behind Let Us Attend, which is a podcast that paraphrases the Sunday gospel for younger and older children. And oh, don't forget about Family Matters, in which the center for Family Care, which is a ministry of the Greek Orthodox Archdiocese, nurtures and empowers families, helping them navigate the joys and challenges of life. And of course, Annalisa Boyd has her own podcast called the Ascetic Lives of Mothers that serves as an encouragement for mamas parenting children through all all their different ages and stages. That's five podcasts right there, Bobby."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6622.47,"end":6623.71,"speaker":"Unregistered: Elisa Bielatic","text":"And now there's a sixth."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6623.95,"end":6624.35,"speaker":"Fr Stephen De Young","text":"Really?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6624.43,"end":6624.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6624.83,"end":6644,"speaker":"Unregistered: Elisa Bielatic","text":"I'm very happy to announce the debut of all these Things with Hannah Vasquez. Hannah is a wife and mother of four with one on the way who offers encouragement and inspiration as well as practical tips to mothers as they navigate the responsibilities with all these things, homemaking, childcare, food preparation, et cetera, while trying to stay focused on Seeking Kingdom."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6644,"end":6649,"speaker":"Bobbi Maddox","text":"Wow, that's a lot of family content and it definitely deserves a promo. So when should we record it?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6649,"end":6649.72,"speaker":"Unregistered: Elisa Bielatic","text":"We just did."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6649.96,"end":6652.76,"speaker":"Bobbi Maddox","text":"I guess we did, didn't we? So are we done here?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6652.76,"end":6653.24,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6653.24,"end":6654.6,"speaker":"Unregistered: Elisa Bielatic","text":"Thank you, Elisa Bieltic."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6654.68,"end":6656.12,"speaker":"Bobbi Maddox","text":"So long, Bobby Maddox."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6659.64,"end":6675.73,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6682.53,"end":6727.03,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. This is now the third half of the Lord of Spirits. And like I said earlier, this is a pre recorded episode, so don't call in. We're not live tonight. God willing, we'll be back live next time. Again, we're on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. So. All right, well, we've just talked about the bodily resurrection. Let's bring it to the full final conclusion here and talk about our Lord Jesus Christ, who is the man, you know, he is the human. Right? He is, he is the. The new Adam. Right, all of that."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6727.99,"end":6736.95,"speaker":"Fr Stephen De Young","text":"Right. And so, of course, since we teased the end of the last episode with Does Christ have two bodies? We're now going to talk about that at the very end of this episode."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6736.95,"end":6738.19,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Exactly."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6738.19,"end":6740.87,"speaker":"Fr Stephen De Young","text":"Because that's how we roll around these parts."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6740.87,"end":6743.35,"speaker":"Fr Andrew Stephen Damick","text":"We're glad you stayed with us this whole time, everybody."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6745.43,"end":6765.36,"speaker":"Fr Stephen De Young","text":"So. So if we're going to talk about body in this ancient sense, right, we're talking about powers and potentialities. So as God, Christ, the divine Logos, the Word of God, the second Person of the Holy Trinity, possesses all of the powers of the divine nature."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6765.68,"end":6767.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. So."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6768.32,"end":6790.66,"speaker":"Fr Stephen De Young","text":"And we talked about last time how one of the primary ways in the Second Temple period and ancient Israelite religion of understanding the second person of the Holy Trinity was as the embodied Yahweh."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6790.98,"end":6795.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, because he appears to people and I mean, we talked about this last time, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6795.62,"end":6798.82,"speaker":"Fr Stephen De Young","text":"And interacts with people and speaks with people face to face and."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6799.79,"end":6800.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6802.11,"end":6862.81,"speaker":"Fr Stephen De Young","text":"So in the Incarnation, right, Christ takes our shared human nature, and so he takes upon himself all of the powers associated with humanity. Right. So using body in that ancient sense, you could say, Right. You confuse everyone, but you could say that Christ has two bodies in that sense. And you'd basically be referring to a concept very similar to talking about Christ having two natures, divine and human. But there are places where, if you read the fathers closely, St. John of Damascus does this fairly frequently. But other Fathers too, when they're talking about the Incarnation, they'll refer to Christ's human nature as his human body. And they're not being Apollinarians like we talked about last time. Right, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6862.81,"end":6872.41,"speaker":"Fr Andrew Stephen Damick","text":"They're not saying that he's. Yeah, this material, you know, two arms, two legs and a head with, you know, the soul extracted and God in there in place."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6872.41,"end":6924.99,"speaker":"Fr Stephen De Young","text":"Right. Instead. Right. That's not what the Fathers are saying. They clearly reject that view. So when they use that terminology that way, they're using body not to refer to Christ's material human body, which he certainly had, but they're using human body in that ancient sense to refer to a concept more that includes his whole human nature, all of his powers, his human will, his human energy, all of those things can be covered by this ancient sense of the word body. And so sometimes The Fathers will use the term body that way. And so if you're reading one of those texts talking about the Incarnation, don't be confused when it says that, when it talks about Christ's human body and his human body being created, it's not just talking about the physical body, it's talking about Christ's humanity."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6926.11,"end":6926.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6926.83,"end":6927.79,"speaker":"Fr Stephen De Young","text":"In toto."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6928.75,"end":6957.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so I kind of have a question. And I don't know remember if we even talked about this pre show or not, but in thinking about this, then Christ takes on human nature. He takes on a human body with all that. That means when he's, you know, prior to his death and resurrection, he's walking around, he's material. Right. He takes on materiality."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6957.41,"end":6957.73,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6957.73,"end":6962.66,"speaker":"Fr Andrew Stephen Damick","text":"He takes on its limitations. He. I mean, and you know, we're going to talk about him taking on this voluntarily and so forth."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6963.22,"end":6963.62,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":6963.78,"end":7001.03,"speaker":"Fr Andrew Stephen Damick","text":"And then he. He rises from the dead, he ascends into heaven, he sits down at the right hand of the Father. Is it right to say that he's still material in this way? If materiality is. So. Okay, maybe I need to back up and say this is materiality. Is it only a sort of manifestation of the kind of mortality that we have now or what's going on there? Right. So, I mean, human bodies changed after what happens in Eden and become mortal. Were Adam and Eve material or. They were material, but in a different way. I mean, you see what I'm getting at here, right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7001.03,"end":7002.59,"speaker":"Fr Stephen De Young","text":"They were material, but in a different way."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7002.75,"end":7004.03,"speaker":"Fr Andrew Stephen Damick","text":"In a different way. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7004.11,"end":7012.44,"speaker":"Fr Stephen De Young","text":"And just as our resurrection bodies will be material in a different way, and we see this with Christ's resurrected body in the Scriptures, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7012.44,"end":7013.68,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he talked about flesh and bone."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7013.68,"end":7027.76,"speaker":"Fr Stephen De Young","text":"They could touch him. He still has flesh about, you know, St. Thomas could. We're not told whether he did or not, but I like the Caravaggio painting. So we'll say he did put his hand in. In Christ's side and in the holes of the nails."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7028.32,"end":7030.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Most Orthodox icons show him actually making contact."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7031.12,"end":7038.16,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So. So, yeah, all that's true. And he eats. Right? All of that's true."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7038.82,"end":7038.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7038.98,"end":7075.23,"speaker":"Fr Stephen De Young","text":"But at the same time, he could just appear in a locked room. He can, you know, cross vast distances without, you know, running. Right. It's not like Christ turns invisible and then goes running over to the road of Emmaus. Right, Right. He. He's just. He's there. Right. And he's there. So he's still. He's clearly still material, but he's clearly material in a different way. Yeah. Right. And. And yeah, if. If we don't understand that you could get into some really goofy stuff with your doctrine of the Eucharist, for example."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7075.71,"end":7077.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7077.31,"end":7081.47,"speaker":"Fr Stephen De Young","text":"Right. Like, I'm looking. I. I'm looking at you Lutherans and Calvinists."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7082.27,"end":7082.75,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7083.23,"end":7084.27,"speaker":"Fr Stephen De Young","text":"And your debate."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7084.83,"end":7116.49,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, well, let's. Well, let's talk about. I mean, I don't know. Maybe we'll get to that. But yeah, I mean, I think we should talk about that, because we say it's the body of Christ. I mean, we use this phrase, body of Christ, not only to refer to what we would normally think of as the person of Christ, but the church and the Eucharist. Right. So, I mean, what's going on there? In what sense is the Eucharist the body of Christ according to this kind of language? Which."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7116.57,"end":7122.17,"speaker":"Fr Stephen De Young","text":"Yeah, both. This is a. This is a porque los dos situation."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7124.33,"end":7125.09,"speaker":"Fr Andrew Stephen Damick","text":"Why not? Both."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7125.09,"end":7141.37,"speaker":"Fr Stephen De Young","text":"Yeah, that the Eucharist is both Christ's body in the sense of being his body. And in our soon to be forthcoming episodes on Sacrifice, we'll be talking about that. Right?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7141.45,"end":7141.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7143.54,"end":7161.54,"speaker":"Fr Stephen De Young","text":"And his blood. Right. Which is the fact that his blood is involved very clearly means that that sense is real. Right. That physical sense is real because blood is not used the way we've been talking about body. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7161.62,"end":7162.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7162.9,"end":7207.14,"speaker":"Fr Stephen De Young","text":"But it is also true that the Eucharist is the body of Christ in this sense. In the sense that the Eucharist and, and. And all of the materials, sacraments and all the sacraments have these material elements are the instruments through which Christ's power enters into the world to. To transform us, to change us, the way he acts upon us. Right. This is, this is what we mean when we say God's grace, his energies, his working in the world is mediated through sacramentality. Right. Through the mysteries. We mean that Christ works through them. So they're. They're also his body in this ancient sense. Yeah, the Eucharist is also his body in this ancient sense."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7207.62,"end":7208.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7208.5,"end":7222.82,"speaker":"Fr Stephen De Young","text":"So. Yeah, so. So both. I was more going after, you know, the Calvinists arguing that it can't be Christ's body in the Eucharist because His body is in heaven at the right hand of God. Like that's a place."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7223.27,"end":7224.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7224.71,"end":7232.23,"speaker":"Fr Stephen De Young","text":"Where it's located. And then. And then the Lutherans essentially arguing. So it's hard to pin them down."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7232.79,"end":7233.75,"speaker":"Fr Andrew Stephen Damick","text":"In, with and under."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7234.15,"end":7235.91,"speaker":"Fr Stephen De Young","text":"But yeah. And using."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7235.91,"end":7240.39,"speaker":"Fr Andrew Stephen Damick","text":"But if you say consubstantial, then, you know, or. Yeah, consubstantiation. Like. No, no, no."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7240.39,"end":7254.35,"speaker":"Fr Stephen De Young","text":"Using this weird incarnational analogy that is Definitely not orthodox. That somehow like Christ takes a third nature of bread or something. Like it's hypostatically united to him instead of incarnation."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7254.35,"end":7255.65,"speaker":"Fr Andrew Stephen Damick","text":"It'. Panation."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7255.81,"end":7259.49,"speaker":"Fr Stephen De Young","text":"Yeah. So anyway, enough picking on Protestants."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7260.21,"end":7260.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7260.65,"end":7279.49,"speaker":"Fr Stephen De Young","text":"But that whole, that whole debate kind of doesn't make a lot of sense. If we understand Christ's body in this biblical sense that we derive from St. Paul and the resurrection body and of Christ's resurrection appearances in the Gospels, that whole eucharistic debate kind of doesn't make a whole lot of sense."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7280.29,"end":7296.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I think it's a, it's an attempt to, to take these kinds of Aristotelian categories of things and what makes a thing a thing and apply it to the God Man. I can't believe I even said that sentence. But you know what I mean?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7297.22,"end":7306.58,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. And it wasn't the Protestants who did that first. We'll spread the blame around to everybody in the west for getting that all mixed up and confusing everyone."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7307.46,"end":7309.06,"speaker":"Fr Andrew Stephen Damick","text":"How many of our listeners have we alienated?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7309.22,"end":7321.54,"speaker":"Fr Stephen De Young","text":"Probably a lot. There are friends. I'm just saying we do love them. I'm just saying they're confused and it's not their fault they're confused. Like they have this historical trajectory that has led them to a confusing place."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7323.3,"end":7323.7,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7324.34,"end":7326.98,"speaker":"Fr Stephen De Young","text":"Yeah, it's not blameworthy that they're confused."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7326.98,"end":7328.34,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7329.62,"end":7353.48,"speaker":"Fr Stephen De Young","text":"So, but the other, the other key thing, and the people I'm going to bash a little now, I don't even consider Protestants, is that when Christ is incarnate and he takes on human nature and he takes on these, these human powers, he's taking on something else. He's not getting rid of or substituting anything."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7354.44,"end":7394.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Okay. So I've heard this view and it's, you know, there's that word kenosis. Right. Or kenosis, as I sometimes get anxized, the self emptying of God, you know, in Christ, and I've even heard it as, you know, he set aside being God so he could be man for a while or something like that, which is just, I mean, awful. Yeah, right. It's, to use that wonderful phrase, it's not even wrong. It's so incoherent, it's not even correct. Yeah, yeah, yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7394.31,"end":7396.67,"speaker":"Fr Stephen De Young","text":"It's, it's, it's fractally wrong."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7396.67,"end":7397.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7397.59,"end":7405.75,"speaker":"Fr Stephen De Young","text":"Meaning the whole thing is wrong. And if you zoom in on any particular part of it, it is just as wrong as the whole thing is wrong."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7406.55,"end":7407.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7408.79,"end":7421.38,"speaker":"Fr Stephen De Young","text":"Yeah. So. Yeah, right. So that, that is not the idea at all. This is why the fathers were so clear that Christ becomes man without change or alteration. Yeah, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7421.54,"end":7425.14,"speaker":"Fr Andrew Stephen Damick","text":"He's still fully God in all that it means to be God."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7425.14,"end":7452.38,"speaker":"Fr Stephen De Young","text":"He has added to himself human powers. Right. The human nature, the human body in this ancient sense, which includes human body in the modern sense. He's added that. And so the, the limitations that Christ takes upon himself are each and always. He takes them upon himself voluntarily."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7453.26,"end":7528.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. I'm reminded, for instance, of in Anglo Saxon Christian literature, it often depicts Christ as like a warrior who climbs up on the cross. Right. Like, now it's my time to die. I'm gonna go do it, you know, and it's not suicidal, but it's voluntary. You know, he's conquering death. Death is not. He's not a. He's not a victim in the sense of like, okay, well, I'm gonna let them overpower me. You know, it's, it's. And I. And it's, it's illustrated in scripture. I can't remember who I read that explicated this, but I just thought it was such an amazing piece of attention to a really important detail where it says that he bows his head and then gives up the spirit in that order, which is exactly the opposite order of the way most of us die, which is that we die and then we slump over because we don't have any control of our bodies anymore. He's in control. He bows his head and then gives up his spirit. The moment that he himself dies is his choice. You know, it's not that the, the Romans successfully killed him. Right, right, right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7528.95,"end":7547.63,"speaker":"Fr Stephen De Young","text":"And that's especially. That's especially a theme in St. John's Gospel. Over and over and over again, there are all these times where they try to kill Jesus during his ministry. And it doesn't say, but Jesus was clever and escaped. Right, yeah, it says, it says, but they could not kill him because it wasn't his time yet."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7547.63,"end":7548.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7548.61,"end":7574.36,"speaker":"Fr Stephen De Young","text":"And then that gets sort of summed up by Christ himself saying, no one takes my life from me. I am able to lay it down and I am able to take it up again. So Christ chooses to die. He's not even subject to death, let alone any of the other things. So Christ chooses to become tired. He chooses to become hungry. He chooses to undertake what are called by the fathers, the blameless passions."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7574.67,"end":7574.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7575.39,"end":7583.15,"speaker":"Fr Stephen De Young","text":"The things we suffer that aren't the result of the direct result of us being sinners and our domination by sin."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7584.03,"end":7686.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And. And you know, it's when a human being is taken hold of by circumstances and then suffers it valiantly and you know, without complaining and, and you know, maybe even self sacrificing. That for us is extremely admirable, right? You know, you see someone taken prisoner and then tortured and killed or whatever, which happens over and over again with the martyrs. And yet Christ is the Lord of glory at every moment in his whole life. In his passion, in his death, you know, he could call down ten legions of angels. He could, with a thought, make them all dissolve, you know, faster than Thanos can snap his fingers. Right? It's, it's. I don't know. How do you even conceive of that, right? That he is so in control and chooses, chooses it all. It's very, very deliberate in his part. You know, we admire someone who's caught up by circumstances and bears them up. Well, he's not even caught up by circumstances, right? We can't say, you know, well, they did it to him. But you know, he. Look at what he did, you know, it's, it's way beyond that. It's a choice every moment that, that, that he enters into death in order to save us from death, and he chooses it. It wasn't just a last desperate kind of attempt, right? It's, it's his choice. He enters into it very, very deliberately. And there's no point in which he loses control ever, ever through that. The whole, the whole timeline. Not ever."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7687.03,"end":7719.23,"speaker":"Fr Stephen De Young","text":"Right. And this, this isn't something that we can construct a good enough series of philosophical categories to understand and explain. This is, this is an incredible mystery that we write hymns and poetry and sing and pray and stand in awe at. I mean, that's what Holy Week is, is a protracted period of standing in awe of this before it, not trying to explain or comprehend it."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7720.35,"end":7739.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, let's. I think maybe a good place to. I mean, we've already kind of talked about this a little bit, but maybe we can meditate on this as our place to kind of wrap up. The church is the body of Christ. The church is the body of Christ. What does that mean?"}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7740.12,"end":7785.57,"speaker":"Fr Stephen De Young","text":"To understand this, you have to understand body in this ancient sense that we've been talking about this whole time. That when St. Paul talks about some people being God's eyes and some people being his feet and some people being his hands. This isn't just to randomly talk about body parts or do an analogy. He means it in this sense. Right. So that the way in which people in this world experience being seen and known by God is by being seen and known by us. The way in which the world hears Christ's voice is when the church speaks."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7785.73,"end":7786.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7786.21,"end":7817.59,"speaker":"Fr Stephen De Young","text":"The way in which people. Christ feeds the hungry. Right. Clothes, the naked. Right. We sit back in our modern world and we look at poverty and hunger and disease and these horrible things happen in the world, and we have the gall to say, why doesn't God do something about this? This is a philosophical problem of theodicy. Why doesn't God. It's like God sent."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7817.67,"end":7818.23,"speaker":"Fr Andrew Stephen Damick","text":"Like he."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7818.39,"end":7828.71,"speaker":"Fr Stephen De Young","text":"God sent someone. He sent you, buddy. Yeah, God, he sent you, buddy. God sent someone. It's you sitting on your couch watching the Sally Struthers commercial. Right. Like, that's a deep cut."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7828.71,"end":7828.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7828.99,"end":7860.88,"speaker":"Fr Stephen De Young","text":"You're the one. You're the one who's supposed to be doing something about this. Right. And you're not. Right. That's what St. Paul means. There's an urgency to St. Paul saying that. That not only do we each need to fulfill. God has given us the gifts to do what he's called each of us to do, our small part of that. And it's critically important that we not only each do it, but that we all cooperate together as one whole body."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7861.2,"end":7861.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7861.92,"end":7873.73,"speaker":"Fr Stephen De Young","text":"To do this work together and to get it done in the world. And there are. There are no substitutes for direct action."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7874.37,"end":7874.93,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7875.49,"end":7883.97,"speaker":"Fr Stephen De Young","text":"And I'm going to be only slightly political now. Fair warning. This is true across the board."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7884.85,"end":7885.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7885.65,"end":7913.26,"speaker":"Fr Stephen De Young","text":"So going and voting for someone who says he's going to do something to help poor people is not fulfilling God's calling to you to help those in need. And going and voting for someone who says they're maybe going to somehow ban abortion is not fulfilling God's call on you to go and help mothers who are pregnant and who are in distress and need help."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7913.66,"end":7914.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7914.3,"end":7925.6,"speaker":"Fr Stephen De Young","text":"There's not a substitute for direct action. There's not a substitute. There's not something we can do to fulfill what God wants other than doing what God wants in the world."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":7925.6,"end":8240.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I have some final thoughts, and then. And then you can give your thoughts. You know, so for these last couple episodes, we've been talking about concepts that are really difficult because they're so different from the way we usually think. Right. We tend to think of bodies as objects, as a material thing. And so then again, you know, this is the podcast of, hey, it's not just a metaphor. So when we hear phrases like the body of Christ, whether it means the Eucharist or the church or we think about the resurrection, Right. We think about what happens to Adam and Eve. We think about angels like all of these things, if we just think about. If we just have a concept of bodies as objects, then it's an atomized theology, right? It's just, here's a thing, here's a thing, here's a thing. And it tends towards kind of the magical and the talismanic, if I can say so, right? Like, here's a thing that's charged with superpowers, right? But if we understand that God in Christ is making use of us, especially the Church, that we are his body, we are his nexus of powers, to use that kind of language, then it utterly vivifies the Christian life in a radically different way. You know, we've talked, for instance, about living an exorcistic life, you know, casting out, demonstration. Well, it's not because I have a power of being an exorcist. It's because Christ's mission is casting out his enemies, the demons. And I can participate in that or not. I can become truly his body in that sense, or not. It's all voluntary. I have a choice. And what that means is that the thing that you do, listener, whatever it is, you said a prayer this morning for someone. You gave something that you didn't have to give. You helped someone with something that they needed help with. Whatever it is you did, when you did that, you were participating in the very power and action and love, the body of God himself. It's not enough for us to just sort of say, God is everywhere and he's watching the things I do, like the divine Santa Claus, making a list and checking it twice. I hope I get in at the end. It's so much more than that. It's so, so much more. He is present now in this room where you are, and he's acting, and he's acting through you. You have become, you know, St. John Chrysostom talks about the priesthood. At one point, he says, Christ is the priest, and the one that we call a priest, the presbyter. He gives his voice in his hands, and he participates in Christ's priesthood. So my prayer is, as you have listened to these two episodes and probably had your mind blown 10 or 12 times, which would be exactly half the number that I had, maybe that you would again, not just say, wow, I learned some interesting ancient concepts today, and so forth, But. But that this would vivify your life in Christ, that you would understand. It's not a metaphor. The church is the body of Christ. He is present with us. He's in our midst. He's working in our midst. It's Just like it says at the beginning of the Acts of the Apostles, where St. Luke says in the former treatise, you know, when he's talking about his Gospel text, I wrote about all the things that Jesus began to do and say, which means that what happens in the Book of Acts is Jesus continuing to do all of those things. And it's not just the Book of Acts, and it's not just 1st, 2nd, 3rd, 4th, 5th century Christianity. It's now. It's now as well. Christ is acting, he is healing his world. He is drawing all men to himself. He is forgiving sins, he is healing. You know, he is doing all those things. And so our task is to join in and be faithful and to remain faithful. And when we fall over, to get back up and return to faithfulness and keep going forward, always with our eyes on that final day when Christ is going to come to judge the living and the dead and we will see him as he is."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8242.47,"end":8497.98,"speaker":"Fr Stephen De Young","text":"What I have to say is not unrelated, right? We got a question by email in which someone asked us how this relates to St. Paul teaching that our body is the temple of the Holy Spirit. And we kind of brushed over. I mean, there's so much related to this. We couldn't go into detail on everything that St. John, both in his Gospel and in. In the Apocalypse, in the book of Revelation, says that Christ's body, Christ's humanity, right, Is. Is the temple, is the new temple, and, and how that relates to then our bodies being the temple of the Holy Spirit and how that works, right? Because we may think about that as well. Our body is sort of a physical space and the Holy Spirit lives inside it, right? And obviously, if you push on that even gently, it gets kind of ridiculous. Like we've got internal organs in there, right? Like, where's. Obviously that's not. That's not that kind of literal spatial kind of sense. The presence of God in the temple, right, is what made it the temple, his body being there. As we talked about in the previous episode, temple's the place where God's body is. And so the same is true with Christ. Christ's body is God's body. But St. Paul is saying the same thing. When he says that our body is the temple of the Holy Spirit, he's saying that our body is and is to be God's body. That's why in that same context, he can say to someone, how can you go and join the members of Christ to a prostitute? We may take that primarily in the negative sense, and St. Paul clearly means that negative sense. But it's also true in the positive sense. Over and over again in our liturgy. In the Divine Liturgy, we offer ourselves and our whole lives and each other to Christ. As St. Paul says, we offer ourselves as living sacrifices. We offer our bodies to God as instruments for him to use. And we're making a commitment and we're making a promise when we do that that we are not going to use our bodies, our powers, our abilities, our gifts. We're not going to use those as a means to gratify ourselves, as a means to seek pleasure for ourselves, but we're going to give them to him to do his work. The Christian religion is not an immaterial or ghostly religion. It is not about sitting in your house and purely repenting and contemplative prayer. It is not about avoiding the outside world and avoiding others. Even our great monastics who have done that have only done that for a certain period of time and then have shared what God has done in them with others. So we work out our salvation every day in the material world through our bodies by showing love, showing compassion, doing good, cultivating life, putting things in order and establishing justice and decency and good in the world every day. That's not an add on. That's not something that's good to do in addition to our salvation. That's not a sign that we're really saved. That is the stuff of our salvation because that is the stuff of our transformation. That's how we grow. That's how we change. That's how we come to know Christ more deeply. That's how we become sons of God. And that's how we reach that maturity and completion and perfection that God created us to seek after and by his grace to attain."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8499.74,"end":8526.57,"speaker":"Fr Andrew Stephen Damick","text":"And that's what we've got for today. Thank you very much everyone for listening. If your question didn't get a chance to be addressed during this broadcast, we would love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything, but we cannot respond to everything, unfortunately. And we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8527.13,"end":8538.1,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the 2nd and 4th Thursday Thursdays of the month at 7pm Eastern, 4pm Pacific like our Facebook page and join our Facebook discussion group."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8538.34,"end":8544.66,"speaker":"Fr Andrew Stephen Damick","text":"Leave reviews and ratings, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8545.14,"end":8552.74,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and a lot of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8553.54,"end":8555.62,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you."}
{"episode_id":"LOS - #012 - 2021-01-28 - Bodies and the Bodiless","start":8567.63,"end":8604.68,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
