{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":0.24,"end":64.82,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":64.82,"end":84.82,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, wrestlers with the devil. You are listening to the Lord of Spirits podcast and my co Host, the Very Reverend almost double doctor pentuple master Steven DeYoung. Pentuple, sextuple. Sextuple. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":85.3,"end":88.66,"speaker":"Fr Stephen De Young","text":"Who knows? Yeah, well, yeah, yeah, technically, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":89.22,"end":99.04,"speaker":"Fr Andrew Stephen Damick","text":"Sex, sextuple master. Speak. Father Steven DeYoung is with me from Lafayette, Louisiana, where it's only in the low 80s, which is weird."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":100.32,"end":101.76,"speaker":"Fr Stephen De Young","text":"Having a rainy cool day."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":101.76,"end":110.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, where it is actually in the 90s. We're not live today. Oh, like last time."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":110.68,"end":111.44,"speaker":"Fr Stephen De Young","text":"We are alive."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":112.16,"end":113.04,"speaker":"Fr Andrew Stephen Damick","text":"You know what I mean?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":113.36,"end":115.84,"speaker":"Fr Stephen De Young","text":"We're not dead. Yeah, the show isn't live."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":116.24,"end":118.24,"speaker":"Fr Andrew Stephen Damick","text":"We could be dead by the time it airs, who knows?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":118.56,"end":119.44,"speaker":"Fr Stephen De Young","text":"Yeah, that could be."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":119.44,"end":124.67,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. Yeah. Which would be very weird and sad. They'd have to play a little bumper at the beginning."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":125.07,"end":127.99,"speaker":"Fr Stephen De Young","text":"Dear listeners, this would be our haunting final masterpiece."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":127.99,"end":139.23,"speaker":"Fr Andrew Stephen Damick","text":"I know, like last time, this is a pre recorded episode because unlike last time when it was Father Stephen, I'm traveling when this one airs. So people talk about the devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":139.39,"end":143.55,"speaker":"Fr Stephen De Young","text":"You're traveling to a place where it is literally impossible to buy a vowel because they don't have any."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":143.55,"end":176.77,"speaker":"Fr Andrew Stephen Damick","text":"They don't need them. What do you need them for in Wales? Yeah, yeah, yeah. So people do talk about the devil even in Wales, usually in the singular. Yet the scripture gives us a number of different names and descriptions of spirits that might all or some qualify for this role. And if you figure in second temple Jewish literature, the list gets even longer. So with this episode, we're going to look at the list, try to make some sense of it. So we're gonna go ahead and take a break from our series on the Apocrypha. Or are we?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":178.93,"end":186.53,"speaker":"Fr Stephen De Young","text":"Yes, we are. I mean, we are gonna talk about. There'll be some references that are second devil, Jewish literature, but we always do that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":186.61,"end":187.65,"speaker":"Fr Andrew Stephen Damick","text":"So that's true."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":187.65,"end":192.61,"speaker":"Fr Stephen De Young","text":"If we don't consider this a break, then that means our whole show has been one long series on."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":193.81,"end":197.33,"speaker":"Fr Andrew Stephen Damick","text":"That's probably true. There's probably not an episode. We haven't made some reference to it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":198.16,"end":199.6,"speaker":"Fr Stephen De Young","text":"Yeah. At some point."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":199.76,"end":202.08,"speaker":"Fr Andrew Stephen Damick","text":"Get Father Stephen's Apocrypha book, everybody."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":202.32,"end":206.24,"speaker":"Fr Stephen De Young","text":"It's the footnotes and you never have to listen again. Oh, wait, no, that's right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":206.56,"end":207.2,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":207.92,"end":209.44,"speaker":"Fr Stephen De Young","text":"You save all kinds of time."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":209.52,"end":218.52,"speaker":"Fr Andrew Stephen Damick","text":"All right, so, yeah, so the devil, there's definitely that phrase used in the Bible, right? The devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":218.52,"end":219.96,"speaker":"Fr Stephen De Young","text":"He's in the details. Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":219.96,"end":220.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":220.72,"end":221.6,"speaker":"Fr Stephen De Young","text":"I'm given to understand."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":221.92,"end":222.4,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":223.29,"end":225.37,"speaker":"Fr Stephen De Young","text":"I don't know if that's referring to the magazine or."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":230.17,"end":231.45,"speaker":"Fr Andrew Stephen Damick","text":"I do not read that magazine."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":231.45,"end":238.49,"speaker":"Fr Stephen De Young","text":"Yeah. Good. It was sort of great value Maxim, which was."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":241.85,"end":243.45,"speaker":"Fr Andrew Stephen Damick","text":"That's a phrase I've never heard before."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":244.01,"end":257.59,"speaker":"Fr Stephen De Young","text":"Yes. Anyway, those 90s quote unquote men's magazines are best. It's sort of like new metal. We should just, like, bury it like memory hole it. Never think of it or speak of it again."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":257.59,"end":271.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although it does occur to me that I have not yet played the Lord of Spirits. I have not played the Lord of Spirits metal theme in a long time. It's not new metal. Like with the nu. It's. No, I don't know, kind of more 80s, late 80s metal."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":271.79,"end":276.96,"speaker":"Fr Stephen De Young","text":"You'd have to put it, like, some record scratches and like, repetitive lyrics."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":277.92,"end":280.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is how you remind me. Okay."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":281.36,"end":282.64,"speaker":"Fr Stephen De Young","text":"No, they're not new."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":282.64,"end":285.12,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. But I was just reminded of that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":287.44,"end":291.28,"speaker":"Fr Stephen De Young","text":"You know, you don't have to say everything that comes into your head, Father Andrew, just because I do."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":291.28,"end":294.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I was going to say when you started that, I was like, well, you do."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":297.2,"end":308.74,"speaker":"Fr Stephen De Young","text":"Exactly. I jumped off a cliff with you. Anyway. Depends on which cliff, which hill I choose to die on."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":311.62,"end":317.86,"speaker":"Fr Andrew Stephen Damick","text":"Some would say you are a hill that one would choose to die on, but that's possible. Tough but fair."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":318.66,"end":325.78,"speaker":"Fr Stephen De Young","text":"So this episode, we're being transparent here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":326.34,"end":326.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":328.58,"end":343.7,"speaker":"Fr Stephen De Young","text":"And there are going to be some other episodes like this in the future. Right. So some of this stuff, especially early on in the show, you're going to recognize is. Oh, hey, this is stuff they kind of talked about a long time ago. Way back in the long ago time."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":344.18,"end":345.7,"speaker":"Fr Andrew Stephen Damick","text":"In the Mexican radio period."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":346.42,"end":370.43,"speaker":"Fr Stephen De Young","text":"Yes, the early days. And you will be correct. Now we're not going to say the exact same things because, you know, I can't even remember most of what I said yesterday, let alone what I said, you know, three years ago. But we're also going to be coming at it from a different angle. Right. We're taking a different approach to it, but for a few reasons."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":371.15,"end":371.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":372.03,"end":389.84,"speaker":"Fr Stephen De Young","text":"One of them being, again, that there is a new angle. There's going to be a lot new tonight in how we approach this and how we talk about it. But also because a lot of those early episodes, for those of you who've actually listened to them, were interrupted by things like power outages."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":390.24,"end":392.32,"speaker":"Fr Andrew Stephen Damick","text":"I know that could still happen."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":393.6,"end":405.68,"speaker":"Fr Stephen De Young","text":"My voice turning into a robot and Mexican radio and all kinds of other things. And especially in the very early episodes, we were still theoretically trying to do a one hour show."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":406.88,"end":407.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":408.72,"end":454.57,"speaker":"Fr Stephen De Young","text":"With about the same amount of material that we use now in our three, three and a half hour shows. So things ended up getting condensed and left out. All kinds of things happened. All kinds of things happened. So now that we've experienced largesse, we can return to some of these topics, go through them more thoroughly, combat them from other angles, flesh things out some more. So that's what we're doing today on this topic. If you're sitting there thinking, well, you talked about that before kinda in a bunch of different episodes and we'll do that sometimes in the future, especially with some of that. Some of the stuff we talked about really early on. Yeah, we've actually already done that a couple of times."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":454.81,"end":455.21,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":455.53,"end":518.46,"speaker":"Fr Stephen De Young","text":"But like, for example, we did very early on we did the 5ish falls of the Angels, like classic episode now, I guess, because it's old. And then we did a set of three episodes on the three sort of falls of humanity later where we were talking about some of the same things but from a different angle at a different perspective and fleshing them out more obviously. Three episodes compared to one episode, it got fleshed out a lot more. So we've already been doing that, we're doing that tonight. There'll still be somebody in the comments. Like I heard some of this before, right. In the comments. I have found that I have, though I am not a prophet, nor a son of a prophet. The ability to predict a lot of YouTube comments like before the fact for the last one. It's almost like you willed them into being. Yes, I just had to put that out there. I gave a Script and people showed up and willingly followed it for some reason, unironically."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":518.54,"end":519.66,"speaker":"Fr Andrew Stephen Damick","text":"God bless you guys."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":524.63,"end":650.9,"speaker":"Fr Stephen De Young","text":"But yeah. So we're gonna be talking about devil figures, right. Big bads, final bosses. Right. The, the. The sort of ultimate evil dude slash, spirit slash, thing slash. Right. And as I said in other episodes, we've talked about any given episode, maybe one or two of these, and come at it from different perspectives, different trajectories through it. But as we've mentioned at various times, and as we're going to talk about in the third half, just to tease what we're doing at the end, no one. There is no place in Second Temple Jewish literature or the church fathers or the scriptures themselves where anybody says, like, lists all of the figures that we're going to talk about tonight as like separate figures. Right. That doesn't happen. What you get is different texts, even different texts within the canonical scriptures, but then also different Second Temple Jewish texts, different patristic texts, different other things. We'll talk about sort of this, this figure of ultimate evil, maybe two of them sometimes. And describe. Describe that figure in certain terms according to a certain pattern. Right. As you look at multiple texts, you see these patterns emerge. And sometimes those patterns of description are attached to particular names for this figure. Sometimes they aren't necessarily."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":651.06,"end":654.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sometimes they're attached. Attached titles, basically."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":654.67,"end":669.79,"speaker":"Fr Stephen De Young","text":"Yeah. Or sometimes this description will have several of the names that we're going to talk about on this episode all thrown onto the one figure, just sort of balling them all up into this one figure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":670.35,"end":670.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":670.75,"end":686.93,"speaker":"Fr Stephen De Young","text":"And. And using multiple patterns. But so when we talk about a figure, we're not just talking about a name, although obviously different names used for that figure are going to be a key differentiator."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":687.09,"end":687.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":687.65,"end":742.49,"speaker":"Fr Stephen De Young","text":"And we're also not just talking about a certain description because there are names and other facts, factors and places where these scriptures blend together. But we're trying to. Each one of these figures we're going to describe is going to be describing one of those patterns itself. Right. And eventually we're going to talk about how mutually exclusive they are or aren't and what's going on with all this. But so when this is premiering on YouTube, there's going to be. Folks, I'm making another prediction. I'm pulling another Kreskin, who early on are going to say in the, in the live chat, they're going to say, wait, how does this one relate to this other one? Hold on, we'll get there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":742.89,"end":745.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, don't worry. This show is not brief."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":745.93,"end":760.85,"speaker":"Fr Stephen De Young","text":"Yes, we have to set the stage a little bit. Right. First we have to sort of lay out who the players are. You can't tell the players without the program. So we're giving you the program so you can tell the players, and then we'll talk about the relationships of that kind of thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":760.85,"end":854.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's an important meta issue. Right. As we're kind of setting the stage, which is like some people might say, well, okay, do these just, you know, these different sources disagree with each other or, you know, like. Because the point of these traditions, as they're described in these various texts, various writers, scripture, and as you mentioned, outside of scripture, is not that they're all trying. They're like some. Tracking down some elusive Tasmanian devil. You know, they're not. They're not searching for some species and attempting to describe it in, you know, taxonomy or whatever. Rather, when you're trying to analyze this kind of thing, you have to look at it as a set of traditions and then see what they have in common. See what it is that is the point of the traditions. Like, why were they written down? What was this aimed at? And, you know, this connects with a lot of the discussions we've had about how to read the Bible and. And stuff like that. If you look at it as an attempt that. To make sort of a kind of science of demonology, then you're going to miss what this is all about. I mean, you can get the. What is it called? The Dictionary of Deities and Demons in the Bible, which is a really interesting and fascinating book. But that's not the point of all this stuff. And in fact, the book doesn't even take that. That point of view. Like, it's an attempt."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":854.7,"end":856.42,"speaker":"Fr Stephen De Young","text":"It's descriptive, not prescriptive."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":856.42,"end":867.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It just says, this is what we see. And that's what we're going to try to do with this episode. We're going to say, look, these are the things that we see in these texts. What do these texts seem to be doing? You know, so that's."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":868.06,"end":876.42,"speaker":"Fr Stephen De Young","text":"If you want to get the really cool stuff of the scientific demonology side, though, you got it. You got to dig into some late medieval and early modern manuscripts."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":876.5,"end":878.58,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure. I mean, they get obsessed with that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":878.82,"end":880.58,"speaker":"Fr Stephen De Young","text":"They've got pictures, they've got, like, drawings."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":880.66,"end":881.22,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":881.78,"end":882.98,"speaker":"Fr Stephen De Young","text":"Of different demons."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":883.3,"end":885.7,"speaker":"Fr Andrew Stephen Damick","text":"And I think. I mean. Right. Like, you know, this is what."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":885.7,"end":887.58,"speaker":"Fr Stephen De Young","text":"Kind of cool. But it's fanfic. Yeah, exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":887.58,"end":901.89,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is what forms the basis of, like, a number of different volumes of D and D books. Right. It's Interesting and fun. Right. But we shouldn't try to kind of materialize that which is inherently immaterial."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":903.41,"end":903.85,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":903.85,"end":904.37,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":906.13,"end":910.05,"speaker":"Fr Stephen De Young","text":"It'S like the Official Handbook of the Marvel Universe ahout mood."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":910.13,"end":911.73,"speaker":"Fr Andrew Stephen Damick","text":"I used to sit there and read those."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":912.13,"end":918.93,"speaker":"Fr Stephen De Young","text":"Quantify the Hulk's strength. Right. The madder he gets, the stronger he gets. You can't sit here and put tonnage on that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":918.93,"end":919.49,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":921.41,"end":930.62,"speaker":"Fr Stephen De Young","text":"What are you thinking? Apologies to the editor of the Official Handbook of the Marvel Universe, the late, great Mark Grunewald. But anyway."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":933.74,"end":943.58,"speaker":"Fr Andrew Stephen Damick","text":"I used to have those in a series of paperbacks that combined multiple of the comic volumes into one, and I would sit there and read them for hours. I loved those."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":945.82,"end":952.06,"speaker":"Fr Stephen De Young","text":"See, that's extra nerdy. You weren't even reading the comic stories about the character."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":952.14,"end":953.06,"speaker":"Fr Andrew Stephen Damick","text":"I did that, too."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":953.06,"end":956.72,"speaker":"Fr Stephen De Young","text":"But you were just reading theoretically about the character."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":956.72,"end":963.48,"speaker":"Fr Andrew Stephen Damick","text":"Basically an encyclopedia. I've always loved reading encyclopedias. I know. It's a little lame."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":963.64,"end":992.01,"speaker":"Fr Stephen De Young","text":"Okay. Yeah. A meta level that you. You reached there. Yeah, yeah. You know, they have. They have. This is not a commercial. I'm not recommending anything. But they have. They have combined all of those old things, both the Official Handbook of the Marvel Universe and who's who in the dcu, which was the DC Comics version of that, into these giant omnibus hardcovers."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":992.41,"end":992.89,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":993.37,"end":995.29,"speaker":"Fr Stephen De Young","text":"They're like 1400 pages."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":998.09,"end":998.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":998.53,"end":1000.49,"speaker":"Fr Stephen De Young","text":"So now it even looks like an encyclopedia."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1000.49,"end":1005.69,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. I had the. I had the Deluxe Edition. That's why it was the oht mood and not."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1005.93,"end":1008.25,"speaker":"Fr Stephen De Young","text":"You got it. Yeah. You got to get the Deluxe Edition."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1008.59,"end":1008.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1009.39,"end":1013.31,"speaker":"Fr Stephen De Young","text":"Because the original handbook was too sparse."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1013.31,"end":1023.71,"speaker":"Fr Andrew Stephen Damick","text":"I think I liked it. Now that we're 17 minutes into the episode, I think that I liked it a lot because, I mean, it's related, Right? This is sort of taxonomically related to what we're discussing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1024.19,"end":1025.67,"speaker":"Fr Stephen De Young","text":"There was a lot of really good art in there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1025.67,"end":1038.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there was some good art, and I learned about a whole lot of characters from comic books that I'd never read, because I just sit there and thumb through it and read, like, every entry, you know, so well, you could."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1038.51,"end":1040.79,"speaker":"Fr Stephen De Young","text":"Find obscure, goofy characters in there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1040.79,"end":1043.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah, yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1043.11,"end":1050.55,"speaker":"Fr Stephen De Young","text":"Where it was sort of like, okay, I understand why someone was under a deadline and thought this was a good idea for one issue, but why are we preserving its memory here?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1051.59,"end":1057.27,"speaker":"Fr Andrew Stephen Damick","text":"See, this is related to Second Temple Jewish literature. All right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1057.67,"end":1059.11,"speaker":"Fr Stephen De Young","text":"I don't think they had deadlines."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1059.11,"end":1070.17,"speaker":"Fr Andrew Stephen Damick","text":"No. No deadlines. Time worked differently in the before times. So, yeah, let's. Let's talk about the devil. The devil who."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1070.25,"end":1072.97,"speaker":"Fr Stephen De Young","text":"Who is in the details as we already covered."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1072.97,"end":1074.13,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1074.13,"end":1082.33,"speaker":"Fr Stephen De Young","text":"So heads, encyclopedias, segue. Okay, so, yeah, so we'll start with the devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1082.89,"end":1083.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1084.73,"end":1085.77,"speaker":"Fr Stephen De Young","text":"Diabolos."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1086.17,"end":1088.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, diabolos in Greek."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1091.77,"end":1093.13,"speaker":"Fr Stephen De Young","text":"El diablo. No."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1094.65,"end":1099.05,"speaker":"Fr Andrew Stephen Damick","text":"Which means the one who throws apart. See, I should have played the etymology theme for that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1100.41,"end":1101.45,"speaker":"Fr Stephen De Young","text":"Okay. Butterfly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1105.37,"end":1112,"speaker":"Fr Andrew Stephen Damick","text":"Yes. He's the opposite of symbol. You know the one with the throwing together. The throwing apart. Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1114.16,"end":1116.48,"speaker":"Fr Stephen De Young","text":"Actually it means the slander, but."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1117.12,"end":1117.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1123.12,"end":1126.16,"speaker":"Fr Stephen De Young","text":"You'Re better. You're capable of such a better etymology than that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1126.56,"end":1129.52,"speaker":"Fr Andrew Stephen Damick","text":"I know I've got a good one I'm saving for later."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1129.68,"end":1130.88,"speaker":"Fr Stephen De Young","text":"Yeah, go ahead and tease it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1130.88,"end":1132.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, go ahead and tease it. Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1133.6,"end":1139.06,"speaker":"Fr Stephen De Young","text":"This is what happens when we pre record, by the way. We get even more rambly because we don't have anyone watching us."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1139.06,"end":1140.58,"speaker":"Fr Andrew Stephen Damick","text":"I think we say that every time now."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1141.54,"end":1154.58,"speaker":"Fr Stephen De Young","text":"Yeah, well, we need. It's a disclaimer. Sorry. Like they like literally the person who normally keeps an eye on us, like left the studio. We are unattended."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1157.14,"end":1158.18,"speaker":"Fr Andrew Stephen Damick","text":"No one's watching."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1158.34,"end":1161.54,"speaker":"Fr Stephen De Young","text":"So. Yes, we're just getting up to nonsense now."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1162.18,"end":1162.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1162.66,"end":1220.52,"speaker":"Fr Stephen De Young","text":"So the devil. So there's a. There's an underlying. We've talked about this before on the show, way back in the long ago time. There is a basic pagan narrative. There's some good books about this that we've recommended before that goes throughout ancient Near Eastern paganism, including ancient Greek religion that is called by scholars. Now the succession myth which boiled down is the idea that whoever the most high God is now, whichever of the gods is seen as the king of the gods or the most high God or the. The supreme reigning God now, was not the original most high God."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1220.52,"end":1222.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's a usurper."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1222.84,"end":1248.05,"speaker":"Fr Stephen De Young","text":"There's been another or others plural beforehand and. Yes. And that the way he took power was not that the old one died of old age and left. Left the throne to him, but that he staged some kind of revolution or coup or violent action. And usually it is the action of a son against his father."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1248.37,"end":1272.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the probably best known version of this to our listeners would be in Greek mythology where Zeus is considered to be the most high God, but he got it by taking out his father, Kronos, who got it by taking out his father, Ouranos or Uranus, however you want to pronounce it. And it was, you know, not. It was not an abdication, as it were."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1273.18,"end":1407.72,"speaker":"Fr Stephen De Young","text":"Yes. No, no, the second case, it was a castration. So. Yeah, there's two layers in Greek mythology. We've talked before on the show. The reason there's two Layers in Greek mythology is that. And when we're talking about Greek mythology, we're really talking about Hesiod here. So we're talking about Greek religion as Hesiod sort of lays it out. Right? And Hesiod is synthesizing. Yeah, right. As we talked about before, Greek city states had their own God or couple of gods, like Athens, it was Athena, obviously, and less obviously, Hephaestus, he's in the basement somewhere. He's making stuff. So, you know, when he synthesizes the relationships between all of these gods, we tend to have this sort of Justice League view of ancient religion where they had these pantheons and they worshiped the pantheons. And that's not accurate. Right. The pantheons are later constructs of taking all of these local gods once there is a greater sense, right? So there's a sense now it's not just Athens or Sparta or Corinth or whichever city state you want to name. It's the Greeks, right, Where there's this larger identity or a larger identity is sort of being forged that you start to get the idea that, oh, well, the gods of that city state and this state are related to each other, right? And there are these connections. And if there's been strife between those city states in the past, that gets mirrored, right? It's strife between their gods and all that. So Hesiod is synthesizing at that level. But Hesiod is also, in a way parallel to, like I just mentioned, strife between cities becoming strife between the deities. He's also dealing with the history of the people group. And so the reason there's two layers ultimately in Hesiod is that Hesiod, that first layer with basically heaven and earth, right? The sky God and the earth goddess."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1408.12,"end":1408.52,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1410.28,"end":1537.64,"speaker":"Fr Stephen De Young","text":"Sort of the Indo European religion underlying the people group, right? And then. And the transition from that to something Greek inherited from the near east. And then the second transition is the typical ancient Near Eastern transition, right? And to give another example of the specific Near Eastern transition, probably the most relevant one immediately to the Old Testament, and we're going to talk about this more in a minute, is BAAL and his father El. And it's not coincidental that Baal's a storm God. You know, this. This is part of this pattern, right? So this idea of this sort of revolution in the heavenly places between where a divine son sort of seizes the throne from his father. Now, you may point out BAAL actually seized it from Yam. This is true. But read about how BAAL and his sister wife treat Their father, you'll notice some things, but this is just how, this is in every religion in the ancient near east that this sort of succession happened. And so the Hebrew scriptures present us with a story that is sort of a counter story to this. And the story presented by the Hebrew scriptures is that there was an attempted revolution, as it were. Right. An attempted accession, an attempted sort of overthrow or an attempted rebellion, but the rebel didn't win."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1539.96,"end":1578.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, this is one of the things that underlines how different the most high God of Israel is versus the most high God of other religious groups, which is that his rule is eternal, absolute and invincible. Whereas in every pagan religion that is just not true. You know, it's. Yeah, the gods can be taken out by other gods or hurt or, you know, usurped or whatever, Right. They're just weaker. According to the actual stories themselves, the pagan gods are weaker."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1579.08,"end":1603.39,"speaker":"Fr Stephen De Young","text":"Yes, yes. And this is what's going on in Isaiah. Right? Isaiah. In Isaiah, God says, you know, before me there was none, and after me there will be no other. Right. And our Plato brain instantly kicks in and we're like, oh, he's saying he's eternal. Right. It's true that God is eternal. Right. But that's not what he's saying in Isaiah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1603.39,"end":1608.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, he's saying, I've always been in charge. No one else will ever be in charge except for me."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1609.55,"end":1679.55,"speaker":"Fr Stephen De Young","text":"Yes, yes. There's not some other, what was it, some most I got in the past who he overthrew and there's no one going to come along and overthrow him because we're the context of the Assyrians, the Babylonians who all had these, these stories, Right. That were deeply embedded in their religion. And again, I used the mythology word, which I probably shouldn't have. Right. Because that may have led people down a familiar trail to thinking of these. Oh, well, these are the stories they're telling. These are just stories they're telling to explain something or other. But of course, that's not how ancient religion worked. Right. These stories are abstracted from the actual religious ritual life of these peoples. Right. So in Babylon, the accession of Marduk to the throne was this massively huge festival, like the, the key main primary religious festival of the year. Right. The enthronement of BAAL at Ugarit was the big, right, religious festival of the year, around which their whole religious system."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1679.55,"end":1683.87,"speaker":"Fr Andrew Stephen Damick","text":"Was structured in a sense, almost the pagan versions of the Ascension."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1685.47,"end":1857.83,"speaker":"Fr Stephen De Young","text":"Right, yeah. And so it's not just a story that would be like saying, well, there's this Christian story that Jesus rose from the dead. Yeah, right. I mean, someone could say that, but it would show they don't know much about Christianity. Right. Or how Christianity works as a religion. Right. We tend to think that way again, because the religions we're talking about, like Babylonian religion, is dead. And so for us now, it is just mythology. It's just all that's left is this story and the actual embodiment of it, the living out of it. And all of this that went on in the past, you know, 25 centuries ago, is gone and not there anymore for us to really understand. So this is a key story. And so we. The Hebrew Scriptures counter this story. They're fundamentally undermining the basis of the religious life of Israel's neighbors. There is no pan heresy of ecumenism in the Hebrew Scriptures. There is no. Well, you could call him El, you could call him Yahweh, you could. You could call him Marduk. It's all good. There is no. That is not a thing. It's not remotely a thing in the Hebrew Scriptures. There were certainly, according to the Hebrew scriptures, Israelites who tried to go down that road, but it ain't there in the Hebrew Scriptures. That's what's being condemned by the Hebrew Scriptures. So the place where we actually get the counter story, and we mentioned this, I don't know if it was last episode or the episode before that. Time's a flat circle. It all blurs together. We're always talking about this. But the place where that is the scriptures, even though it's maybe not immediately apparent to us because of how we're used to reading it, is Genesis, chapter three. And that's been so firmly worked into us as this is a story where something bad happens to humanity, which is true. But it's true. Not all that's going on, but that's not it. Right? Yes, that's not it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1857.91,"end":1881.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you look at icons of the expulsion from paradise, you can see the angel with a flaming sword, you can see Adam and Eve leaving. But if you look down at their feet, this is pretty much. I haven't seen an orthodox icon where this wasn't the case. Maybe there are some. I don't know. I don't know. I'm not going to say that none are like this, but usually you look down at their feet, you can see the serpent being driven out from the garden as well."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1883.69,"end":1891.73,"speaker":"Fr Stephen De Young","text":"Right. And the serpent, of course, we said this a bunch of times on the show, is not a snake."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1892.61,"end":1892.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1892.97,"end":1895.09,"speaker":"Fr Stephen De Young","text":"This is not how the snake Lost its legs."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1895.49,"end":1896.37,"speaker":"Fr Andrew Stephen Damick","text":"Snakes don't talk."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1898.77,"end":1970.33,"speaker":"Fr Stephen De Young","text":"Well, maybe animals did talk. Remember Jubilees? But. Right, but yeah, this is not a talking snake. This is not right. We've talked before on the show about how the word nakash that's used to describe him. The cool thing with Hebrew words is that you only write the consonants and there's three consonants in all the words. Right. And depending on how you vocalize it, meaning, depending on what vowels you effectively add when you pronounce it, it could be different parts of speech. Right. So the word nakash can mean depending on whether it's an adjective, an adverb, a noun, a participle. Right. It can mean different things. And so the writers of the Hebrew scriptures deliberately use that aspect of Hebrew as a feature, not a bug. So if you study Hebrew, especially if you're a Latin minded kind of person, like St. Jerome was, you find this endlessly frustrating because Hebrew is not a precise language."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1971.03,"end":1971.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":1972.07,"end":2016.02,"speaker":"Fr Stephen De Young","text":"It's got two verb tenses, neither of which have anything to do with time. There just isn't precision in the Hebrew language. But again, the writers use that as a feature. They don't see it as a bug. And so they use it, especially in Hebrew poetry, but even elsewhere, to convey multiple ideas with the same word. That ambiguity, you could read it this way or you could read it that way to imply both meanings. And there are places where New Testament authors try to do that in Greek. That's a lot harder to do in Greek. Greek is a more precise language."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2016.02,"end":2018.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, As I say, it is much more precise."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2019.1,"end":2047.44,"speaker":"Fr Stephen De Young","text":"Yeah. Not as precise as Latin, but it is more precise. But one big example is in St. John's Gospel, Christ is speaking to Saint Nicodemus and says to him, you must be born in Greek anothen, which can mean again or it can mean from above."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2048.4,"end":2048.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2049.85,"end":2156.26,"speaker":"Fr Stephen De Young","text":"Which does St. John mean? Yes, exactly. Arguing back and forth misses the point. Right. He means both. Like it's deliberately. It's deliberately implying both ideas. Right. So you could do that. And so that, I think, is what Ed would argue and a lot of other scholars would argue is what's going on with NAKASH in Genesis 3 is that you're getting the idea. Yes, serpent, from the noun. But also it can mean the shining one and it can mean the subtle or deceptive or winding one. Which of those does it mean? Yes, it means all three of those. And when you take into account that seraphim, as we've talked about on the show before, were presented as serpentine, angelic beings, then this idea all makes sense. Shining One makes sense for an angelic being. Serpent makes sense if we're talking about something like a seraphim. And subtle, crafty, obviously, that's what he is. Deceptive or treacherous. So this is describing. This is describing a spiritual being, an angelic being. And when the curse is given in Genesis 3, again, we tend to focus on the curse, on humanity. But the serpent gets cursed, too."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2156.82,"end":2157.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2159.3,"end":2193.99,"speaker":"Fr Stephen De Young","text":"And the serpent. When the serpent is cursed. We mentioned this recently. I know. He's told, you know, he's gonna crawl on his belly and eat the dust of the earth. As we mentioned then and other times before, ancient people weren't dumb. They knew snakes didn't eat dirt. They'd seen them eat rodents. Right, That's. And so the dust there is the same word, afar, that's used for dust. You from dust you were right. From dust you were made, and to dust you will return."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2194.31,"end":2197.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the idea is that he's eating death."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2199.03,"end":2199.63,"speaker":"Fr Stephen De Young","text":"The dead."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2199.63,"end":2209.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the dead. Yeah. Yeah. Whence we get the. The images of the hellmouth, this gigantic serpentine mouth swallowing up dead humanity."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2210.51,"end":2362.93,"speaker":"Fr Stephen De Young","text":"Right. And so. And he's cast down to eretz, which is the. Is the word for earth or the land or the ground in Hebrew, but is also used to refer to the underworld. Right. So he wants to bow up on high. He's this heavenly being. He gets cast down into the underworld. He wants power and authority. He's given death. Right. And this is what Hebrews 2:14 is referring to when it refers to the devil as the one who has the power of death. Right. Now, in terms of what constitutes his rebellion, I'm not gonna. I know I've slammed Milton enough. Right. But pre Milton, we'll just say again, as we have before, pre Milton, there's not really anybody. There's definitely nobody among the Church Fathers and. And. And nobody in Second Temple Judaism that thinks there was a rebellion of Lucifer and his angels in primordial time, before the world was created, where they all got thrown out of heaven. Nobody says that. I say definitely not the Church Fathers. I add that other stuff because there's probably somebody out there. I am not a scholar of the medieval period. So Milton may have been drawing on something from the late medieval period or something that I just don't know about. And it may predate Milton by 100 years or something. Maybe. I don't know. But Milton's the first major, and Milton's where we all get it, right. There was Paradise Lost, that reading of who. Of who the devil is That's. That's not anywhere. Right. Everybody else. Everybody before that talks about the devil and sometimes he's. This figure is identified with some of the other figures we're going to talk about. But the devil is falling after the creation of the world. To quote St. Andrew of Caesarea in his commentary on the Book of Revelation, which we're going to come back to a little later. All the fathers say. He says we must accept what all the fathers say. After the creation of the world, the devil fell through envy."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2365.8,"end":2366.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2367,"end":2372.76,"speaker":"Fr Stephen De Young","text":"So now, in terms of when exactly the angels were created."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2373.72,"end":2376.04,"speaker":"Fr Andrew Stephen Damick","text":"Yes. There's a variety of thoughts about that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2377,"end":2382.68,"speaker":"Fr Stephen De Young","text":"Right. Especially. But it's always within the creation of the. Within the creation story of Genesis."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2382.68,"end":2383.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2384.44,"end":2430.2,"speaker":"Fr Stephen De Young","text":"So some fathers and Jewish writers, you'll see the first day, the first day of the fourth day are the most popular fourth day because of the connection between the stars and the angels. There are some outliers, though. There's some second day people. There are some. Right. Some other. The second day people. It's because that's the waters above from the waters below. So that's like the heavens from the deep, from the abyss. So they're connecting the abyss to the. The fallen angels. So there's different. Right. And there are fathers who say they fell pretty much instantly. Right. But the envy that we're talking about is envy of humanity."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2431.08,"end":2433.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which means there must in some sense be humanity."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2434.6,"end":2454.11,"speaker":"Fr Stephen De Young","text":"Right. That's. And so, yeah, so again, the Milton thing, we have in our head that the devil wanted to get rid of God as God and make himself God. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2454.11,"end":2458.07,"speaker":"Fr Andrew Stephen Damick","text":"Seize the throne, which is obviously drawing on these succession myth ideas."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2458.15,"end":2508.65,"speaker":"Fr Stephen De Young","text":"Succession myths. Right. Yes. But here's the thing. In the succession myths, part of the underlying presupposition is that each of the gods is in some sense finite and equivalent to one another, whereas that's not the perspective of the Scriptures. So as I've posed to people before when talking about this, you're a creature just like the devil is. You want to make God not be God anymore, and you want to make yourself God so that you have all of God's power, ability, however you want to talk about it. Right. There's problems even figuring out how to talk about it. But what's step one? That's not a thing you can do."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2509.05,"end":2509.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2512.81,"end":2519.77,"speaker":"Fr Stephen De Young","text":"And the devil may in some ways have a different set of powers and potentialities than you do."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2520.89,"end":2521.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2521.09,"end":2590.42,"speaker":"Fr Stephen De Young","text":"And you might consider those powers to be greater, but that's not possible for him either. There's not a way to do that. Right. There's just not a way to do that. So that dog don't hunt. Right. So this envy thing, again, this is all tied to humanity. Right. And the idea of envy comes from, again, a close read of the Hebrew scriptures. Right. What is man that you are mindful of him, you made him a little lower than the angels, but you crowned him with glory and honor. Right. So humanity has these unique qualities invested in humanity by God that are going to ultimately lead, ultimately, we know, in the Messiah, in Christ, to them being exalted far above the angels. Right. Humanity has, while they may not have the same powers that the angelic beings have invested in them, at least at the time of their coming into being, they have potentialities that angels don't possess."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2592.58,"end":2592.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2593.38,"end":2597.14,"speaker":"Fr Stephen De Young","text":"One very important one coming to share in the divine nature. Right. Theosis."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2597.14,"end":2597.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2598.11,"end":2602.67,"speaker":"Fr Stephen De Young","text":"It comes about through salvation. Right. That's where the envy comes in."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2603.07,"end":2608.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because humanity is destined for literally greater things than the angels."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2609.31,"end":2719.57,"speaker":"Fr Stephen De Young","text":"Yes. And this even in some texts, in some Second Temple Jewish texts, is literalized in the idea that humanity is made in the image of God. So the devil and the other angels are commanded when Adam is created, to worship and serve him as the image of God and the devil, and some like him say, nope, refuse. Right. Now there's some problematic elements of that, but I think that tradition is referred to in Hebrews, for example, amongst other places, a variation of it at least. But that's the idea here. The idea here is that out of that envy, the devil can't do anything to God. There's not a way to harm God, but he can go after God's creation. He can go after other created beings that are created like him. He could try to destroy them, corrupt and destroy them, and especially the creation that he's most envious of, which God loves and finds so precious humanity. The devil can set out to destroy humanity. And so that's what this rebellion is about. And that's how he rebels. He shows up and he talks to the woman in the garden and sort of seduces her toward evil by promising her, ironically, by promising her a kind of theosis by another means."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2719.65,"end":2722.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of like, I've got a shortcut."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2723.25,"end":2776.98,"speaker":"Fr Stephen De Young","text":"Yeah. And so that's why he is cursed also. That's why he suffers this downfall also. And so this is a reversal. This is where St. Paul gets all the gods of the nations are demons. Right. These things you're worshiping, you BAAL worshipers are basically devil worshipers. You Marduk worshipers are basically Devil worshipers. You're worshiping this being who's feeding you this line, giving you this propaganda about. No, really, I won. You should worship me rather than the Creator, the one who defeated him, the one who threw him down into the underworld. And if you continue doing that, you're going to end up following that same trajectory into the underworld with him."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2777.22,"end":2779.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You become like what you worship."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2779.7,"end":2832.36,"speaker":"Fr Stephen De Young","text":"Yeah. And that's what you get in the Hebrew scriptures. And if you want particular places where this argument is made sort of narratively, going Back to Isaiah, Isaiah 14, 3, 21. Right. This is where the name Lucifer comes out of the Latin translation. What it actually says in the Hebrew is, hello, Ben Shakar. And that seems to be. There have been a couple of really good journal articles making this argument, not just in general, not just. What is that? Helel. In Helel Ben Shakar, Shakar was the name of the morning star that gets translated into Latin as Lucifer, son of the morning."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2833.07,"end":2842.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, yeah, say. And also, that's the name of the. The dawn God in. In Ugaritic religion."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2842.75,"end":2843.11,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2843.11,"end":2843.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2843.43,"end":2848.35,"speaker":"Fr Stephen De Young","text":"He's the morning. That's the. More the. It's the Shikar is literally the name for the morning star."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2848.59,"end":2849.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2849.63,"end":2861.28,"speaker":"Fr Stephen De Young","text":"Right. And so then from that, that star is associated with the God. It's the morning star. The morning. Right. So Ben. Ben means son of. Right. In Hebrew, Son of the morning."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2861.28,"end":2864.16,"speaker":"Fr Andrew Stephen Damick","text":"That's how he gets son of the morning in some translations."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2865.12,"end":2965.7,"speaker":"Fr Stephen De Young","text":"Right. And so first of all, there's. Well, what is this Helel, this name? Right. What is that supposed to be? So there's an argument for that. But then also going through the details of the story, the way he's described, right. And sort of his fall is described into the underworld and this kind of thing, there are very good arguments, scholarly arguments now in various journal articles, that this is actually talking about Enlil, who was in Mesopotamia, specifically Babylon and the region around it, religion was the most high God who was displaced by Marduk. Right. Now you may be thinking, I thought Marduk killed his mother. T man, you'd be right. Right. That's in the ritual story. When I say Enlil was displaced by Marduk, I mean as a political reality, as we move from the Babylonian period, which then collapses, and then the beginning of the Neo Babylonian period, right? Marduk becomes the most high God politically because of the city, because of religious power dynamics, Right. This becomes the God who becomes most worship, as opposed to Enlil, who had previously been the God who was the center of worship. And so that political and historical reality in Mesopotamian religion gets reflected in new stories and ritualized as the fall of Enlil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2968.9,"end":2969.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":2969.1,"end":3070.45,"speaker":"Fr Stephen De Young","text":"So this is sort of a late religious development and there are a whole bunch of parallels between. You could go research this more, if you're super into it, between the, like, the details of the way Isaiah describes this and those Fall of Enlil stories where he's replaced by Marduk going down into the underworld and all of that. All that stuff. So here, Isaiah, right, based on who he's talking to, takes one of their stories and sort of inverts it and makes it about the devil. Right. To make the point that you guys are worshiping the loser, not the winner. Right. To sort of counter the pro devil propaganda. Right. And then there's another example of this in Ezekiel, chapter 28, verses 11 through 19. This one may be a little more well known, at least in some circles. This is usually grouped together in Most English Bibles 1 through 19 as this oracle against the King of Tyre, assuming it's talking about the human king. Right. And then most commentaries and stuff you read will say something like, at some point in this, it seems to shift to talking about the devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3071.41,"end":3071.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3072.45,"end":3073.61,"speaker":"Fr Stephen De Young","text":"Instead of the human king."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3073.61,"end":3095.33,"speaker":"Fr Andrew Stephen Damick","text":"It's weird to read it that way because, like, I mean, if you read the text, people, you'll see that it says, you know, you were a guardian cherub and you were, you know, walking on the mountain of God, you know, stones of fire, like all this stuff, it's like, okay, that's not describing any kind of earthly palace or whatever, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3095.33,"end":3175.64,"speaker":"Fr Stephen De Young","text":"Right. And if you track really closely with it, in verses 1 through 10, it's talking to the Prince of Tyre. And those are the verses where it seems to be talking about the human king. And then in 11 to 19, it switches to the King of Tyre. Now, I don't know how accurately that's reflected in some English translations. Right, but in the Hebrew, there's a distinction there. Right. So the text is talking about the human king and calling him the prince, and then it talks about the king, the guy who's really in charge, using these terms, talking about the guardian cherub from Eden who's cast down in this. Right. And so the primary God of Tyre in Phoenicia is baal. Right. And so this again is an inversion of the story of Baal's ascent. An enthronement, right? No, actually he lost. Actually he got thrown down. And just to cover it here, because we're going to go Through a bunch of different names for, you know, the big evil guy. One we're not going to go through is Beelzebub. Because Beelzebub is a form of the name baal."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3175.96,"end":3179.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, same, same guy."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3180.05,"end":3216.62,"speaker":"Fr Stephen De Young","text":"Right. Beelzebub is a corruption by. In Hebrew, like a deliberate one. Right, That's a deliberate one that's criticizing one of the titles of baal. So one of the titles given to BAAL by BAAL worshippers was BAAL Zebul, which means something like High Lord baal. It's almost literally Lord of Lords. Right. But it's sort of, you know, the great Lord baal. Right. Because baal the name means lord."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3218.86,"end":3219.22,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3219.22,"end":3224.38,"speaker":"Fr Stephen De Young","text":"Whereas Beelzebub famously means. Right. Lord of the flies."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3224.54,"end":3225.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3225.34,"end":3229.02,"speaker":"Fr Stephen De Young","text":"And I think people don't fully appreciate that. It's not talking about kids."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3229.18,"end":3233.56,"speaker":"Fr Andrew Stephen Damick","text":"No, no. It's. You're the Lord of the dung heap, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3234.2,"end":3236.36,"speaker":"Fr Stephen De Young","text":"Yes. Where do flies congregate?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3236.44,"end":3236.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3239.16,"end":3252.52,"speaker":"Fr Stephen De Young","text":"Right. The fly congregation. Right. At best you've got corpses. But more realistically, since we're in an agricultural economy, we're talking about dung. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3252.52,"end":3254.2,"speaker":"Fr Andrew Stephen Damick","text":"And not snow covered dung either."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3255,"end":3299.5,"speaker":"Fr Stephen De Young","text":"No. So they are talking dung on BAAL when they call him Beelzebub to rag on him. Right. But so this is. It's pretty clear here. Right. So we have this devil figure, this sort of attempted rebellion out of envy against the Creator, gets thrown down into the underworld. And this idea of the devil most folks are familiar with. We're starting here in our first half with the devil, you know, who I guess is better than those we're going to talk about in the second half. Who are the devil Devils. You don't know?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3299.66,"end":3300.7,"speaker":"Fr Andrew Stephen Damick","text":"That's what people say."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3301.5,"end":3309.92,"speaker":"Fr Stephen De Young","text":"Maybe not. No, maybe not. Know as well. So of course the other very commonly known name for the devil is Satan."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3310.4,"end":3316.56,"speaker":"Fr Andrew Stephen Damick","text":"Right. And often people will just sort of treat these as two different names for the same being."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3317.52,"end":3318.48,"speaker":"Fr Stephen De Young","text":"Which they could be."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3318.56,"end":3322.4,"speaker":"Fr Andrew Stephen Damick","text":"Which they could be. But not necessarily as well."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3323.2,"end":3352.81,"speaker":"Fr Stephen De Young","text":"Right, yeah. There's also a separate set of traditions around a figure called various forms of the name Satan. Right. And these may be two separate sets of traditions about the same being. They could be two different sets of traditions, two different beings. Right. Again, we're going to get into that more toward the end of the show. This show, this episode, which could be the end of the show, but could probably isn't."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3353.13,"end":3355.69,"speaker":"Fr Andrew Stephen Damick","text":"You could get melted by the weather down there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3356.25,"end":3371.38,"speaker":"Fr Stephen De Young","text":"Yeah. So this fella, Satan, right. The first time we see him in the Hebrew scriptures is in the book of Job."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3371.7,"end":3380.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where there's. It says the sons of God all line up in front of God. And then one comes and starts talking to God about Job."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3381.7,"end":3386.9,"speaker":"Fr Stephen De Young","text":"Yeah. And I say sort of, because again, we use Satan like it's a name."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3389.61,"end":3389.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3389.85,"end":3428.96,"speaker":"Fr Stephen De Young","text":"Like there's a dude named Satan and there are traditions, even Jewish traditions, in which his name is Satan, but in Job he's Hasatan, he's the Satan. And Satan or Satan means adversary or enemy. Right. So it's the enemy, the adversary, but in Hebrew. So if you know a little bit about biblical languages, you might know that in Greek, sometimes you have an article. Greek doesn't really have a definite article. It has an article. But in Greek, sometimes you use the article before names. We don't do that in English."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3429.2,"end":3429.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3430.08,"end":3431.04,"speaker":"Fr Stephen De Young","text":"Unless you're Batman."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3431.04,"end":3458.3,"speaker":"Fr Andrew Stephen Damick","text":"I remember when I was first reading, learning Greek and the textbook that we used there was this farmer character named Deca. And you know, most of the sentences started out with O Viceopolis. So we're like, wait, the diceopoulos? That's his what? But you know, but that's really common, like if, you know, for my name, O Andreas, the Andrew. Right. Because the language doesn't work the same way as English."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3458.78,"end":3468.3,"speaker":"Fr Stephen De Young","text":"Right. The reason for that, for the record, is that it's actually, the article in Greek at this point is still really the demonstrative pronoun."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3468.3,"end":3468.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3469.05,"end":3472.33,"speaker":"Fr Stephen De Young","text":"That Deca meaning the same one."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3472.33,"end":3472.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3473.69,"end":3494.25,"speaker":"Fr Stephen De Young","text":"So in a continuous narrative, Right. You'll. You'll use the article after you first introduce the person. You use the, the article to indicate you're talking about the same guy. Right. Because as you notice pretty quickly reading through, like the Gospels, for example, you'll have a bunch of people with the same first name."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3494.49,"end":3498.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So many Judes, Judases."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3498.57,"end":3507.37,"speaker":"Fr Stephen De Young","text":"Yeah. And so you might have three Marys in a room. Right. And so that form of narration makes sense to say, hey, we're talking about the same one."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3507.77,"end":3508.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3508.73,"end":3515.21,"speaker":"Fr Stephen De Young","text":"Right. And then that's why you'll get these constructions when they're translated in English. Like the other Mary."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3515.69,"end":3516.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3516.73,"end":3540.67,"speaker":"Fr Stephen De Young","text":"Or the other Judas, not Iscariot. Right. Like you have to, you know, it's not that, like it almost sounds like a put down in English. Right. When you say the other Mary. Yeah. Like, oh, yeah, that one. Yeah. Right. But that's not what it means. It's just differentiating it. What, from the one they were just talking about? Right, right. This one. That one. Right. Like these are two different people."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3542.35,"end":3542.83,"speaker":"Fr Andrew Stephen Damick","text":"But yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3542.83,"end":3640.92,"speaker":"Fr Stephen De Young","text":"So you do that in Greek. You don't do that in Hebrew. You don't put the definite article before a name. Hebrew has other ways of doing continuous narrative, so you know you're talking about the same person. So when we have the definite article here, every time Satan is used, at least in Job, it's not being used as a name, it's a title. It's referring to a figure who's fulfilling a certain role. And we see him fulfilling that role in Job, right, Where he comes and he's sort of making accusations against Job, right? He says to God, oh, yeah, he's faithful and he loves you and everything, but that's because you've made him rich and you've given him all these blessings, right? Anyone would if you gave them all this, right? Start taking some of that stuff away from him, and then maybe he won't love you so much or be so faithful, right? So he's making accusations, right? He's a spiritual being because he's there with the sons of God, with the angelic beings. But he has this particular role, right, as an accuser or an adversary, the devil's advocate, as it were. And so surrounding this figure, there are sort of related figures that you find in Second Temple Jewish literature. One of them is really on the nose, and that's an angel or an archangel that's referred to as Satana L."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3641.72,"end":3642.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3646.84,"end":3663.56,"speaker":"Fr Stephen De Young","text":"It'S his name. Right. So Satan's in the name, right? It means the Satan of God. The adversary of God. Yeah, yeah, the adversary of God. But also there's a figure called Samael, usually transliterated English, S A M A."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3663.56,"end":3667.28,"speaker":"Fr Andrew Stephen Damick","text":"E, L. And that means the poison of God."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3668.24,"end":3768.99,"speaker":"Fr Stephen De Young","text":"Yes, it means the poison of God. I don't recommend Googling Samael, just for the record. You get a lot of weird, like, Nephilim slash Vic and stuff. You don't even want to go there. Yeah, right. And, like goofy, not like. Not like the spooky, scary kind of occult stuff, like the cringy, dumb occult stuff, Right? So, yeah, so just put that out there. Fair warning, you know, if you go, look, that's on you. But in terms of Second Temple literature, right? And Jewish, you know, thought at that point that poison of God is that he's the archangel, one of the seven archangels. So we've talked about it before, like the Archangel Gabriel, the Archangel Michael, Uriel, Raphael, right? Who are. Who are the four you get in all the lists? And then the other three, who knows? Depending on who you're reading, sometimes one of those is Samael. He's more common on the list in Second Temple. Jewish writings than in Christian writings. But as late as St. Gregory the Dialogist at the end of the 6th century AD, you do find him on some Christian lists of the seven archangels. And so, as we've talked about before, don't confuse those seven archangels with the rank of archangel. When we talked about the nine ranks of the angels."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3768.99,"end":3770.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is kind of an elite group."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3771.91,"end":3810.16,"speaker":"Fr Stephen De Young","text":"Right. Because arc or arch can just mean high or important or. Right. Like the way we use it with archbishop or arch priest or. Right. And so that could be given as a title to an angel of any rank. The Archangel Michael, for example, is identified in the Synaxarion as being a seraphim. So in terms of ranks. Right. Saints Michael and Gabriel are not low ranking in terms of the nine ranks of angels. They are."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3810.16,"end":3811.14,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3811.54,"end":3846.85,"speaker":"Fr Stephen De Young","text":"Yeah. So this is saying he's one of those. Right? He's one of those. So when you hear things about the tradition, this is. The traditions about Satan being a fallen archangel are coming out of this. Right. Are coming out of this set of traditions. And so also I've sometimes heard people say, right, oh, well, if the devil was just an archangel, that's relatively low ranking. No, that's not what's being talked about."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3847.01,"end":3853.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The idea is that he's one of these. The highest, one of the top guys. The greatest. Yeah, yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3856.13,"end":3880.49,"speaker":"Fr Stephen De Young","text":"And so Samael having the poison of God. Right. Kind of a tell. But the idea was not that. That he was somehow, like, always evil or didn't experience a fall or what have you, it's that he was the angelic being who sort of did the dirty work."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3880.89,"end":3886.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, this introduces all kinds of ambiguous problems. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3887.77,"end":3889.78,"speaker":"Fr Stephen De Young","text":"Like from our modern perspective."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3889.78,"end":3927.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Especially not just from a modern perspective, but also from the. From, like, if you're thinking about the angels as created beings, created good and so forth, the idea that God would create an angel of death, that means that there's a world in which death is a thing. Right. So it, It's. It's kind of. It's. It's on the line. Right. Because without the transgression of Adam, you know, humans don't. Don't die. So is he the angel of death before that happens, after that?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3928.44,"end":3930.28,"speaker":"Fr Stephen De Young","text":"Well, it's not like God didn't know it would happen."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3930.36,"end":3931.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3931.52,"end":3933.08,"speaker":"Fr Stephen De Young","text":"Angels and you don't know what it's."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3933.08,"end":3933.6,"speaker":"Fr Andrew Stephen Damick","text":"Like to be a priest."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3933.6,"end":3933.92,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3933.92,"end":3941.81,"speaker":"Fr Andrew Stephen Damick","text":"So there's, There's. Yeah, there's kind of like this sense that this is sort of God's assassin, but then there's also, or, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3942.69,"end":3946.05,"speaker":"Fr Stephen De Young","text":"Firstborn of Egypt are going to get killed. I mean, these are actual examples of things."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3947.17,"end":3958.61,"speaker":"Fr Andrew Stephen Damick","text":"Although. Although. Yeah, yeah, yeah. You know, like, if there's a bad thing that needs to happen, there's a. There are these traditions that Samael is the one sent from God to go make it happen."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3959.09,"end":3963.89,"speaker":"Fr Stephen De Young","text":"To go do it. Yeah, right. The Destroyer. Right. Go wipe out the Assyrian army."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3963.89,"end":3981.14,"speaker":"Fr Andrew Stephen Damick","text":"And it's, it's kind of ambiguous with this concept that we've talked about a bunch of times now, which is this concept of the left hand of God, which is demons doing their will, fallen angels doing their will, which is hateful and bad and evil, and yet God has them on a leash. And so they effectively do God's will even while they're doing their own will."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3982.34,"end":3987.38,"speaker":"Fr Stephen De Young","text":"Right. Which is the picture you see of the Satan in Job. Right, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3988.18,"end":3988.98,"speaker":"Fr Andrew Stephen Damick","text":"On a leash."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3989.06,"end":3996.82,"speaker":"Fr Stephen De Young","text":"He wants to do all this stuff to Job, but he has to kind of go get permission from God. And then God says, okay, you could do xyz, but not abc."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":3997.16,"end":4007.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So it's, it's a little ambiguous as to exactly what Samael, where he lands on the left. Right. Question."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4007.8,"end":4020.28,"speaker":"Fr Stephen De Young","text":"This is why. You'll see why. You'll see in scholarship at other places, people saying, well, in Jewish, pre Christian Jewish thought, Satan wasn't sort of. Wasn't evil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4021,"end":4021.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4021.56,"end":4024.96,"speaker":"Fr Stephen De Young","text":"Like he sort of worked for God. This is what they're referring to."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4024.96,"end":4025.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4025.68,"end":4028.32,"speaker":"Fr Stephen De Young","text":"So they're not referring to the devil traditions we just talked about."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4028.56,"end":4028.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4029.12,"end":4034.64,"speaker":"Fr Stephen De Young","text":"Like the serpent in the garden and that kind of thing. They're talking about this Satan figure, this Samael figure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4034.64,"end":4035,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4035,"end":4066.97,"speaker":"Fr Stephen De Young","text":"Angel of Death figure, the Destroyer. Right. Abaddon slash Apollyon. Right. In. In Revelation. Right, right. So that's what that is about. Right. And so there's kind of a, a disjunction in the way that's filtered through to popular thinking now, where they think like, Satan was an okay guy and he was like a cool guy, and then Christians turned him into the devil. No."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4067.45,"end":4067.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4068.25,"end":4163.91,"speaker":"Fr Stephen De Young","text":"That's woefully inaccurate. Right. So there's this figure who's doing these dirty jobs, and one of those dirty jobs is accusing people of sin and trying to put people to the test and arguing against people's sanctity. He's also set up so within. So there's the seven archangels, the seven spirits who stand before the throne of God and within Second Temple Jewish thought. And some of this is even reflected in the Hebrew scriptures in the latter portions because some of those come from the Second Temple period. But like in Daniel, as we've talked about before, he talks about, you know, St. Michael having to battle the Prince of Persia and then the Prince of Greece is coming, talking about these angelic beings who are sort of the angels over a nation. And of course, St. Michael is presented there in Daniel as being the sort of guardian angel of Israel. Right. Sort of the patron angel of Israel or at that point, Judah. But beyond that, these seven spirits, these seven archangels, are in some of the Second Temple Jewish texts assigned to all of the nations descended from Abraham."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4165.67,"end":4166.31,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4167.35,"end":4168.79,"speaker":"Fr Stephen De Young","text":"They're sort of parceled out."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4169.27,"end":4169.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4169.83,"end":4174.55,"speaker":"Fr Stephen De Young","text":"To the different ages. So the Edomites, the Ammonites, reminder everyone."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4174.87,"end":4177.91,"speaker":"Fr Andrew Stephen Damick","text":"There are other nations besides Israel descended from Abraham."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4178.47,"end":4191.7,"speaker":"Fr Stephen De Young","text":"Right. Other Abrahamites. And within that, Samael is usually presented as the angel assigned to the Edomites."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4191.94,"end":4193.62,"speaker":"Fr Andrew Stephen Damick","text":"Or the descendants of Esau."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4194.5,"end":4209.66,"speaker":"Fr Stephen De Young","text":"Right. And you have to remember, when we're talking about the Second Temple period, we're talking about the destruction of the First Temple, Second Temple period. There's this great enmity between the Edomites and the Israelites that there wasn't always throughout their history."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4209.66,"end":4210.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you can kind of see."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4210.58,"end":4211.66,"speaker":"Fr Stephen De Young","text":"It certainly was at that point."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4211.66,"end":4219.04,"speaker":"Fr Andrew Stephen Damick","text":"You can kind of see where Israelites might be inclined to say that the guardian angel of the Edomites is the angel of death."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4220.16,"end":4235.04,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, yes. And relatedly, then, you get within Second Temple Jewish writings, these clashes between St. Michael and Samael."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4237.52,"end":4237.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4239.13,"end":4251.69,"speaker":"Fr Stephen De Young","text":"And often, often those don't take the form of sort of. I know we'd like to Frank Peretti this and have them be in a cool sword fight or something. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4252.41,"end":4254.97,"speaker":"Fr Andrew Stephen Damick","text":"That's the first time I've heard Frank Peretti uses a verb."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4255.61,"end":4256.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4256.57,"end":4257.29,"speaker":"Fr Andrew Stephen Damick","text":"I'm on board."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4257.85,"end":4267,"speaker":"Fr Stephen De Young","text":"Yeah. But it's just. It's not how things work. Right. Yes. If Zack Snyder gets a hold of it, it will be how things work. But until then, that's not how things work."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4267.88,"end":4269.4,"speaker":"Fr Andrew Stephen Damick","text":"That'd be some freaky movies."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4273.32,"end":4279.08,"speaker":"Fr Stephen De Young","text":"It's a clash in the sense of, say, St. Michael defending and Samuel accusing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4281.32,"end":4287.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's almost. I mean, in some ways, it's almost like. Like a courtroom. Right. You've got a prosecutor."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4288.28,"end":4289.48,"speaker":"Fr Stephen De Young","text":"It's God is king."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4289.64,"end":4290.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4290.28,"end":4331.75,"speaker":"Fr Stephen De Young","text":"Hearing a case. Right, yeah, yeah, Continue. Yeah, yeah, yeah. It's like I've said what I've said. Okay. It's like the King hearing a dispute. Right. Between two parties. Right. And so St. Michael is sort of defending, you know, and this is where the idea that we talked about last time in terms of the Assumption of Moses, the idea of St. Michael and Satan. Right. Contesting over the body of Moses comes from."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4332.23,"end":4337.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is a, this is a pre existing tradition that they do that kind of thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4338.87,"end":4349.79,"speaker":"Fr Stephen De Young","text":"Yeah. That Satan is coming and making accusations against Moses for his sins and St. Michael is defending him. Right. Against those, those accusations."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4350.11,"end":4361.95,"speaker":"Fr Andrew Stephen Damick","text":"So, so then what about, you know, where Jesus says that he sees Satan fall like lightning and yet, like. Right, yeah. So what do we do with that?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4362.83,"end":4370.19,"speaker":"Fr Stephen De Young","text":"Right, so, yeah. Which is in Luke 10, verses 17 through 20."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4372.2,"end":4372.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4374.76,"end":4388.76,"speaker":"Fr Stephen De Young","text":"And it's interesting because when you read most modern interpreters reading that passage, they've got Miltonian presuppositions, right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4388.76,"end":4396.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like they'll read it as Jesus saying, oh, hey, you guys, by the way, way back before whatever, whatever, the world."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4396.04,"end":4397.36,"speaker":"Fr Stephen De Young","text":"Was created, I was there, remember?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4397.36,"end":4402.61,"speaker":"Fr Andrew Stephen Damick","text":"You guys, you know, I was there. I saw Satan fall like lightning, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4402.69,"end":4407.09,"speaker":"Fr Stephen De Young","text":"Yeah. Which kind of makes it a weird out of context comment."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4407.09,"end":4432.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because the narrative context is that he's just sent out, in this case, the 72 apostles, and they come back saying, hey, hey, we're able to cast out demons. And he says, and then he responds, I saw Satan fall like lightning. Behold, I've given you authority to tread on serpents and scorpions over all the power of the enemy, Nothing shall hurt you. He's responding to them talking about being able to do exorcisms."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4432.63,"end":4434.39,"speaker":"Fr Stephen De Young","text":"Yeah. About something that just happened."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4434.87,"end":4437.35,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4437.99,"end":4478.29,"speaker":"Fr Stephen De Young","text":"And so seems most likely that Christ is talking about what just happened. Right. Although Christ knows more about it because 72 can't see the spiritual realm and what's going on there. Right. They're not undergoing an apocalypse at the moment. They're not having a vision. Right. Of course, Christ being God knows everything that's going on. And when you read all of the early interpreters of that text, the church fathers, they all interpret it as something that happened. Right then."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4478.66,"end":4479.14,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4480.9,"end":4509.07,"speaker":"Fr Stephen De Young","text":"They all read it that way. They've never heard of John Milton. And so very interestingly, when you get to Revelation 12, chapter 12 of the Apocalypse of St. John, and there may be some folks out there who haven't heard us talk about this material before, especially who, who are wondering why we haven't talked about Revelation chapter 12 yet."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4509.47,"end":4509.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4510.27,"end":4537.76,"speaker":"Fr Stephen De Young","text":"Because that of course talks about the dragon being cast out of Heaven by St. Michael and his angels. Right. And that's the passage that's talking about the fall of the devil. We didn't talk about it when we talked about the fall of the devil. Right. And that's the passage that people will, will, will quote, right. When they're trying to defend sort of Milton's view, they'll be like, no, that's in the Bible."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4537.76,"end":4538.08,"speaker":"Fr Andrew Stephen Damick","text":"Here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4538.08,"end":4539.24,"speaker":"Fr Stephen De Young","text":"Look at Revelation 12."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4539.64,"end":4543.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is what that verse says, just to review."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4544.44,"end":4544.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4545,"end":4555.4,"speaker":"Fr Andrew Stephen Damick","text":"It says, and the great dragon was thrown down, that ancient serpent who is called the devil, and Satan, the deceiver of the whole world, he was thrown down to the earth and his angels were thrown down with him."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4556.13,"end":4557.17,"speaker":"Fr Stephen De Young","text":"Yeah, that's verse nine."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4557.17,"end":4557.89,"speaker":"Fr Andrew Stephen Damick","text":"That's verse nine."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4557.89,"end":4600.62,"speaker":"Fr Stephen De Young","text":"Yeah, that's verse nine. So importantly, in context, right? And if you want sort of the earliest Eastern interpreter of this, whose view of relation has been enshrined, basically the Orthodox Church, because it's because of him that the book of Revelation is canonical in the East. Essentially. The reason why it's regard, why even the limited amount of public reading it has in the east, it has. It's because of St. Andrew of Caesarea. I know there's some ambiguity about whether he's a saint. Okay, whatever, he's a saint. Sue me."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4602.06,"end":4603.58,"speaker":"Fr Andrew Stephen Damick","text":"That would be an interesting lawsuit."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4603.82,"end":4611.48,"speaker":"Fr Stephen De Young","text":"Is that controversial? Nobody thinks he was a heretic or anything. Right. It's just like, I don't know, is he technically on somebody's calendar?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4611.96,"end":4691.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, well, if you, you know, if you read. And as I recall, this is how, how he. I mean, this. If you just read the, the chapter, right, from verse one, I just read it, what you can see is, says, you know, there's this great sign that appears in heaven. A woman clothed with the sun, she gives birth. You know, this great beast arises. You know, the dragon tries to swallow up the child to whom she's given birth. She flees in the wilderness. And then it says, now war arose in heaven, Michael and his angels fighting against the dragon. And then the dragon gets thrown down. So however you interpret the first six verses, okay. And you can interpret it like there's a couple different ways. As I recall, Andrew of Caesarea interprets that as being about the church. And you know, that the church is giving birth to Christ. Right. So he reads in this kind of spiritual reading, like each one of us has to give birth to Christ within ourselves. Right. But you could also read it more in terms of. And I don't think this was his reading, but a perfectly reasonable reading and certainly like this has appeared in iconography for sure, is that the woman is the Theotokos, because of course, the Theotokos is very closely associated with the church in many, many cases. Many such cases."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4691.48,"end":4692.2,"speaker":"Fr Stephen De Young","text":"And Israel."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4692.36,"end":4705.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and Israel. Right. And that the church, the child is Christ, you know? So however you interpret it, whichever those sets of images and narratives you pick, when the dragon gets thrown down happens."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4706.6,"end":4709.4,"speaker":"Fr Stephen De Young","text":"After that, after the birth of Christ."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4709.4,"end":4710.76,"speaker":"Fr Andrew Stephen Damick","text":"After the birth of Christ, or after."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4710.76,"end":4711.72,"speaker":"Fr Stephen De Young","text":"At least the first one."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4711.72,"end":4713.56,"speaker":"Fr Andrew Stephen Damick","text":"At least the first or whatever."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4713.91,"end":4714.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4714.31,"end":4731.19,"speaker":"Fr Andrew Stephen Damick","text":"It's not some primordial thing. And it's not even. This is not even in Genesis 3, you know. Or is it? Right. Like, obviously, it's partaking in the same imagery, but clearly it's happening in a different narrative structure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4731.67,"end":4737.23,"speaker":"Fr Stephen De Young","text":"Right. So very clearly a context. Yeah, it's. Very clearly. It's not. Doesn't support Milton, we'll put it that way."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4737.23,"end":4738.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is not a prediction."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4738.47,"end":4739.91,"speaker":"Fr Stephen De Young","text":"It's not sort of Jesus is born."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4741.1,"end":4741.86,"speaker":"Fr Andrew Stephen Damick","text":"That doesn't make any sense."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4741.86,"end":4767.34,"speaker":"Fr Stephen De Young","text":"The literal or other sense. And then we roll back to before the creation of the world. That doesn't make any sense as a reading of revelation in context. Right. And St. Andrew says that. Right? He says. He says, first, this is presented as being after the birth of Christ."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4769.94,"end":4770.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4770.58,"end":4807.04,"speaker":"Fr Stephen De Young","text":"And he says, but we must accept what all the fathers say. I'm quoting St. Andrew now, when all the fathers say that after the creation of the world, the devil fell through envy. So the problem for him, right, he's never heard of John Milton. The problem for him is. Well, wait, all the fathers say that the devil fell right after the creation of the world, but this is talking about Satan falling after the birth of Christ."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4807.92,"end":4808.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4808.48,"end":4811.84,"speaker":"Fr Stephen De Young","text":"So that's the issue he feels like he needs to resolve."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4811.92,"end":4817.36,"speaker":"Fr Andrew Stephen Damick","text":"Potentially. There's two different figures, or one figure who falls more than once."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4817.92,"end":4855,"speaker":"Fr Stephen De Young","text":"So he points to. He does sort of the. And indeed. Right. He quotes Luke 10, 17, 20. Christ said at that point, which was after his birth, that he saw Satan fall like lightning at that time. And so then he says, well, you've got two options. You've got two options. You've got one figure here who fell, in one sense after the creation of the world, and fell in another sense. Right. Because fell is kind of a flexible verb here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4856.12,"end":4856.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4858.04,"end":4884.75,"speaker":"Fr Stephen De Young","text":"Fell in another sense during the life of Jesus that Jesus is referring to in Luke 10. Or we've got two different figures here, each of which fall once. And how would you get the two different figures? Well, as Father Andrew read in Revelation 12, 9, it's that ancient serpent. Okay, so that's talking about the Genesis 3, dude."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4884.75,"end":4885.03,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4885.03,"end":4887.91,"speaker":"Fr Stephen De Young","text":"The serpent who is called the devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4889.75,"end":4890.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4890.15,"end":4896.39,"speaker":"Fr Stephen De Young","text":"So that's the devil and Satan, the deceiver of the whole world."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4897.11,"end":4902.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or you could Read it. So that ancient serpent who is called the devil and Satan."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4903.76,"end":4915.92,"speaker":"Fr Stephen De Young","text":"Right. So is he called the devil and Satan or is it the serpent who is called the devil and Satan? Right, this other dude."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4915.92,"end":4922.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And Andrew Caesarea says you can read it in. In both ways, which now he reads."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4922.08,"end":4923.88,"speaker":"Fr Stephen De Young","text":"It as being one figure who falls twice."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4923.88,"end":4925.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4925.84,"end":4935.93,"speaker":"Fr Stephen De Young","text":"He doesn't read it as two separate figures, but he reads it as one figure. Figure who falls twice in two different senses. And so the names then for him are referring to the two different senses."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4936.25,"end":4936.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4937.21,"end":4943.69,"speaker":"Fr Stephen De Young","text":"So Devil is referring to that first fall and Satan is referring to this second one."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4944.25,"end":4978.9,"speaker":"Fr Andrew Stephen Damick","text":"To me, this underlines a couple of things. One is that the way that the church fathers read scripture is not in a sense of. And I don't know, I'm going to hammer this again. Even though we've hammered it a hundred times. I think it's worth it to hammer this again. But there's not a sense of like, what's the Bible code? You know, this verse means this thing, and we have to figure it out what this one thing that it means is. There are multiple possible. Even with things like this, which are maybe, I don't know, questions of fact. Is this one figure or two figures? Theoretically, one of those is true and the other is not. I don't know. Although we'll get to that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4978.9,"end":4980.58,"speaker":"Fr Stephen De Young","text":"Or they're both not true and there's three."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":4980.58,"end":5022.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But then the other thing, and this is raised by this question, especially if you accept it as a single figure falling twice, is what exactly is a fall? Because I think that especially kind of in, I don't know, pop Christian theology, just very common, the idea is that a fall means that that's the moment that this being turns to evil. Right. So when we think of the fall of Adam, he turns to evil. That's how that often is used. But actually the scripture is a little bit more literal. I mean, it's not utterly literal, but it's more literal with using the word fall because it's about being thrown out of somewhere. Thrown out of heaven, thrown out of the garden, thrown out."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5023.11,"end":5030.35,"speaker":"Fr Stephen De Young","text":"Right. Because if you use it as turned to evil, does that mean Adam then repented and then fell again the next time he sinned?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5030.35,"end":5035.35,"speaker":"Fr Andrew Stephen Damick","text":"Or that the devil repented and then turned again. Like, wait a minute."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5035.35,"end":5061.95,"speaker":"Fr Stephen De Young","text":"Yeah, so that obviously isn't what it means. Yeah, right. Because we would say the expulsion from paradise. That's why I tend to use that language rather than fall of man. I talk about the expulsion from paradise because it's more specific. Right. In what we're talking about. Right. That is very different than just the cycle of sinning and repenting, which we can analogize to falling and getting back up."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5062.19,"end":5063.31,"speaker":"Fr Andrew Stephen Damick","text":"Sure, sure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5064.04,"end":5080.92,"speaker":"Fr Stephen De Young","text":"Right. But there is something unique and paradigmatic about the expulsion from paradise in terms of its effect on all humanity. That is different than just Adam sinning and repenting over the course of the rest of his life, for example. Yeah, Right. There's a differentiation there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5081,"end":5081.48,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5081.48,"end":5083.48,"speaker":"Fr Stephen De Young","text":"Right. We're not talking about the same thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5083.48,"end":5086.48,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5086.48,"end":5167.84,"speaker":"Fr Stephen De Young","text":"And so the idea then is that if those two titles refer to ways in which the devil fell, the idea would be, if it's one figure, that the devil is. Right. Cast into the underworld, made the Lord of the dead, all that in Genesis 3. Right. But is still able to at times come into. Like in the Book of Job, Satan is able to come in and act as the Satan. Right. To fulfill this role, to accuse the accuser. Right. And in fact, if you read Revelation 12, verse 10, the very next verse, he's referred to as the accuser of the brethren. Right. As the accuser of the brethren. That's what we see him doing with the body of Moses. The body of Moses there kind of representing Israel also, beyond just Moses himself. But he's the accuser of Israel. St. Michael is defending Israel, the Israelites, the Judahites. Right. The people of God. And so the idea is that in the ministry of Christ and his disciples and apostles, he loses this role as the Satan, that there's now no one to make an accusation against God's people."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5167.92,"end":5198.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting, I mean, like in verse 11 there of Revelation 12, right after it calls him the accuser. And of course it says who accuses them day and night before our God. Right. So it's clearly that. That's the context, is you're accusing them to God. And then it says, and they. That's the brethren have conquered him by the blood of the Lamb and by the word of their testimony, for they loved not their lives, even unto death. That's the saints have conquered the accuser here in Revelation 12."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5200.17,"end":5213.93,"speaker":"Fr Stephen De Young","text":"Right. So there's now no accusation. And this is, by the way, this is what St. Paul is referring to. I know, sorry, sorry. Calvinists. We have to have at least one. An episode."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5213.93,"end":5214.41,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5215.93,"end":5260.12,"speaker":"Fr Stephen De Young","text":"Certain folks are just desperate to make it so that there's all this forensic language in romans and in St. Paul's other epistles. This is all courtroom stuff. This is all courtroom stuff. It's not. None of it is the closest you get is him making references to this dynamic when he talks about no one being able to make an accusation against God's elect and that kind of thing. That's what he's talking about. He's talking about the devil no longer being able to accuse God's people because of what Christ did. All right, well, it's not talking about the Last judgment or being judged righteous. Ready. It's just, it's not there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5260.12,"end":5262.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, you don't want to be judged by Satan."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5263.88,"end":5265.48,"speaker":"Fr Stephen De Young","text":"No one is judged by Satan."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5265.64,"end":5266.28,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5267.08,"end":5269,"speaker":"Fr Stephen De Young","text":"That's the whole point. Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5269.08,"end":5283.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that's our the first half of our mega episode on the Devil. We talked about the devil and Satan and there's a lot more devilishness to come. So we'll be right back with the next half of the Lord of Spirits."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5284.26,"end":5360.84,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. Planning your wedding and reception can seem overwhelming with countless details hijacking your time and energy. In the book An Orthodox Christian Wedding Guide, authors Christopher Dorcak and Delaney Clodfelter help you identify your big three priorities to guide your decisions while keeping the emphasis on marriage as an orthodox Christian sacrament. Use this resource to help you simplify the process and keep Christ at the center of your wedding day. Now available@store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23723. That's 855 AF radio."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5364.6,"end":5413.96,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's second half of this pre recorded episode of the Lord of Spirits podcast. We're talking about the devil and in the first half we discussed the devil and the Satan, which are probably the names that most people are familiar with figures like this. And now we're going to start discussing some names that are less familiar. But of course, if you've been listening to this podcast for a long time, you probably heard probably all of them, I think, actually at one point or another, some with more detail than others. So as we mentioned in the beginning, some of this will be review in the sense of we've talked about some of these figures before, but this is kind of from a different A different angle, different context. Right. So. All right, so who we got up next in terms of our diabolical. Whose list?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5413.96,"end":5414.88,"speaker":"Fr Stephen De Young","text":"Who's on deck?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5414.88,"end":5418.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. The official Handbook of the Lord of Spirits universe."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5419.32,"end":5427.88,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So, yeah. So these next few of the second half are maybe less well known outside of the Lord of Spirits universe."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5427.96,"end":5428.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5430.68,"end":5490.46,"speaker":"Fr Stephen De Young","text":"Your average person, as you heard of the devil and Satan, but maybe not some of these folks. And so the first one is probably the most major figure in Second Temple Jewish literature. Who has the least mention in the canonical scriptures? Not none, but the least, like, direct, obvious mention, and that's Azazel. Now, if you're not in the Lord of Spirits expanded universe, but you've seen Fallen with Denzel Washington, then you may know about Azazel, but otherwise, probably. Probably not so much. The place where Azazel is, where the name occurs, I should say, in the canonical scriptures is first in the. And later on when it is mentioned, it is in the context of the Day of Atonement ritual, as described in Leviticus, chapter 16."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5490.62,"end":5496.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the word is actually used there, although often it's hidden underneath translation."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5497.45,"end":5526.88,"speaker":"Fr Stephen De Young","text":"Right. We're going to talk about that here in a minute. Yeah. So you have the two goats who are used in the Day of Atonement ritual, and you cast lots so that one of these goats will be designated as the goat for Yahweh and the other one in the Hebrew as the goat for Azazel."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5526.88,"end":5531.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the goat for Yahweh gets offered up as a sacrifice to him."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5531.96,"end":5547.68,"speaker":"Fr Stephen De Young","text":"Right. A sin offering in particular. The blood is taken and used to purify the physical accoutrement of the tabernacle and then later the temple to make atonement for a bunch of inanimate objects. But we're not going to go into atonement stuff here, per se."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5547.68,"end":5552.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, check out our episode called the Priest shall Make Atonement, which is."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5552.1,"end":5571.74,"speaker":"Fr Stephen De Young","text":"About all of that in great detail. Yeah. So the question that is, who is this Azazel figure? So Azazel can be translated based on azel being the word for goat, as the goat who goes away."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5572.46,"end":5575.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's where you get this translation of scapegoat."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5576.34,"end":5632.66,"speaker":"Fr Stephen De Young","text":"Yes. Scape is in escape. So the goat who goes away. And that is the basis for most English translations. Not all. Some will put a zazel now, but most English translations have scapegoat. Right. Or some derivative thereof, interpreting it as the goat who goes away. But there's sort of a problem here in that translation in that the language in the Hebrew is completely parallel. There's a goat for Yahweh and a goat for Azazel. Right. And so goat for Yahweh means Yahweh is his name, one of his names. This is the goat for him, the goat that belongs to him. Right. And then you're saying, even though the language is totally parallel, that the second one is. This is the goat for the goat that goes away."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5633.86,"end":5659.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, it's. It's. So I should point out, by the way, that like the earliest known use of scapegoat in English is, Is in. Is a translation of this passage by Tyndale. So it's one of the earliest English Bibles. And basically Tyndale invents the word to translate Azazel."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5660.91,"end":5663.31,"speaker":"Fr Stephen De Young","text":"He was beyond that, like atonement."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5664.83,"end":5665.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5665.71,"end":5685.24,"speaker":"Fr Stephen De Young","text":"So, yeah. So that parallel doesn't work. Right. Of. Wait a second. Right. Like this is a name and then this is like, I guess, a role that you're choosing the goat for. Like you're not choosing the first goat to be God, obviously."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5685.72,"end":5686.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5688.6,"end":5726.69,"speaker":"Fr Stephen De Young","text":"It is his. It's given to him. Right. And then the second goat you're saying then is you're choosing it to be a scapegoat. Right. So the fact that the language is perfectly parallel doesn't make. Isn't reflected by that translation kind of doesn't make sense. Then you also have to factor in the fact that every second temple Jewish interpretation we have, so all of the earliest outside the Hebrew scriptures literature we have from Jewish sources interpreting the name Azazel, all interpreted as being a demonic spirit."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5726.77,"end":5753.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that might lead you to think, by the way, if you know anything about stuff we've said earlier about names of spirits, that Azazel, that. That El on the end is a theophoric. Because El is God. It's. It's not. It's, as they call it, a false friend. It's not actually. It's not L. Yes. Azel. Azel is. Is goat. It has nothing to do with L as in God. So."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5754.04,"end":5779.73,"speaker":"Fr Stephen De Young","text":"Yeah. So it treats it as a name and that. Right. That way of reading it makes sense with the actual Hebrew where you have this parallel. Yahweh is a name. So Azazel is a name. Right. So that makes it important the fact that while this isn't, as you read, the ritual where the one goat is sacrificed to Yahweh and then the other goat is sacrificed to Azazel, it is not sacrificed to Azazel."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5779.73,"end":5802.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's clear if you Read the instructions again. Read the text. Leviticus 16, that the actions done to the goat for Yahweh are actions of sacrifice. You know, putting it on an altar and all that sort of stuff. But then the goat for Azazel is sent away into the wilderness to Azazel, as it says in verse."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5802.19,"end":5832.82,"speaker":"Fr Stephen De Young","text":"It is not sacrificed, it is not killed. So I will digress. I have to. Right, sorry. Penal substitutionary atonement supporters. The only time in the scriptures where sin is put on an animal, it's not sacrificed, it's not even killed. And this is the only time. Check for yourself and see that there's no other place where sins are put on an animal. And of course it makes sense because once you put sins on the animal, it's unclean."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5833.94,"end":5834.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you don't."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5834.7,"end":5836.9,"speaker":"Fr Stephen De Young","text":"You can't sacrifice something unclean to God."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5837.11,"end":5838.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's not a thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5838.63,"end":5845.43,"speaker":"Fr Stephen De Young","text":"And you're not getting sacrificed to something other than God. Right. So this goat is not sacrifice."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5846.71,"end":5848.39,"speaker":"Fr Andrew Stephen Damick","text":"That would be idolatry, everybody."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5848.95,"end":5872.4,"speaker":"Fr Stephen De Young","text":"Right. And because of the identifier with Azazel, you can't get around this. Looking at you, William Lane Craig, in your response to me online, you can't get around this by saying that in some weird metaphorical sense the scapegoat is sacrificed because if it were, it would be being sacrificed to Azazel."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5872.8,"end":5875.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like that is. That is sin number."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5875.08,"end":5875.96,"speaker":"Fr Stephen De Young","text":"You don't want to say that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5875.96,"end":5878.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Sin number one in the scriptures."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5879.44,"end":5947.08,"speaker":"Fr Stephen De Young","text":"Right. You don't want to have sacrificing things to a demon in your atonement theory, my friend. So, yeah, like there's just. This is where atonement is sort of described and defined for the whole rest of the Bible here in the Torah. And it ain't penal substitutionary atonement. That makes no sense with it. So sorry guys, another dog that don't hunt. Another factor in terms of understanding why universally the original interpreters understood Azazel as being a demonic spirit is Leviticus 17:7. So remember chapter 16 is where the Torah is laid out. 17, verse 7. So just a few verses later, after the end of the description of the day of atonement, God says that they will no longer worship the goat spirit or goat demon. In some translations of the wilderness, remember, the name Azazel is built around the word for goat."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5947.32,"end":5949.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5950.28,"end":5958.36,"speaker":"Fr Stephen De Young","text":"So these early interpreters are looking at the immediate context and saying, oh, Azazel is this goat spirit of the wilderness."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5959.08,"end":5959.4,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5959.4,"end":5986.59,"speaker":"Fr Stephen De Young","text":"This demonic spirit of the wilderness, the desert outside the camp. It's explicitly saying there you will no longer worship them. He can't be telling them to sacrifice a goat to it. Even if you thought that was somehow possible. Right. And so it's not just that, oh, this is goat lord of the desert."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5989.23,"end":5989.79,"speaker":"Fr Andrew Stephen Damick","text":"It's."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":5990.19,"end":6036.55,"speaker":"Fr Stephen De Young","text":"Right. The idea is the wilderness is the wilderness around the Israelite camp. We've talked about these concentric circles. Right. That are of holiness working their way out from the tabernacle. But the camp is the end of those outside of the Israelite camp. This island, the rest of the world is under the curse, under the control of evil spiritual powers. And Azazel is sort of seen in this idea as being the head of all of those, as being sort of the big bad, the devil. Right. In that sense. Right. Of this supreme evil being uses evil power over the surrounding world outside the camp."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6036.55,"end":6083.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's this, I mean, and you know, this is really a common idea in a lot of, especially pre modern cultures where travel is just a dangerous thing to do. You know, I mean, people did it, but it was always regarded as dangerous. And that sense of the, the surrounding world being kind of evil and chaotic and full of death. And it's not just because there's bandits out there, you know, or, or even just that there's wild animals or natural, naturally dangerous terrain or whatever. Like there's the sense that it's ruled by these sort of spirits. I mean, this is like the basis for the Grendel image in Beowulf. You know, the, the, the, the dark thing that's out there somewhere."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6085.85,"end":6101.53,"speaker":"Fr Stephen De Young","text":"Right, right. And so, and, and by the way, before we move too far, I know there's someone out there going, well, they, they, you said they didn't kill it, but they shoved it off a cliff. Right. First of all, it's not in Leviticus 16."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6101.69,"end":6102.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6102.89,"end":6158.93,"speaker":"Fr Stephen De Young","text":"Meaning it's not part of the ritual. That is something that they started doing at some, we're not sure when exactly when, but they started doing it some point later in the Second Temple period, but was not universally done, by the way, because, for example, when the Epistle of Barnabas in the first century talks about the day of atonement ritual, it gives a lot of details about how it was practiced, little details beyond what's in Leviticus 16 of particular practices regarding it in Jerusalem in the first century, it talks about it being led out and tied to a bush, not shoved off a cliff. Though we know that there was a period where they were shoving it off a cliff, but both tying it to the bush and shoving it off the Cliff, that art of Leviticus 16. Right. These are practical issues, because what do you do when you lead the sin goat out of the camp with all your sins and evil on it and it comes wandering back into town?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6159.17,"end":6161.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, get that thing out of here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6162.45,"end":6199.73,"speaker":"Fr Stephen De Young","text":"Right. Like. Yeah, go. Right. So they started taking things to make sure that didn't. Make sure it wasn't able to do that. Right. But they're different means at different times. And it's not part of the ritual per se. The idea and the ritual is that Azazel, right, the evil spirits out there, they're sort of the ultimate source of sin and corruption and wickedness. Right. That they've lured humans into. And so you're putting the sin on the goat and then stamping it return to sender."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6200.29,"end":6200.69,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6201.41,"end":6203.57,"speaker":"Fr Stephen De Young","text":"Like you're sending it back where it came from."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6203.57,"end":6210.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The goat is a transport mechanism to send the sins out so they no longer corrupt the camp."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6211.17,"end":6243.21,"speaker":"Fr Stephen De Young","text":"It's carrying them away. And that even fits with eventually like pushing it off a cliff. Right. Because where ultimately are those spirits? They're in the underworld, Right. So you push it into a crag in the ground, right. Then, I mean, that's mean to the poor. You know, imagine the poor goat, right? Like that goat didn't do anything. On the other hand, he got to live. The other one got killed and sacrificed. So, you know, from a goat's perspective, you know, I don't know which one you'd want to be necessarily."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6243.37,"end":6246.05,"speaker":"Fr Andrew Stephen Damick","text":"Goat tastes good. That I know that goat tastes good."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6246.05,"end":6323.88,"speaker":"Fr Stephen De Young","text":"Yeah. Curry goat is awesome. But yeah. So you're returning it back to Azazel. And so then you get sort of imagery surrounding Azazel. And I mean that quite literally in terms of his appearance, when his appearance is described as we move into now how Second Temple literature talks about him as a figure, Right. We're moving now. That's pretty much where he's directly talked about by name in the scripture we're going to talk about here. There are some New Testament references to him. And Second Temple literature will read Azazel back into some preceding stories before Leviticus 16. But in terms of where he's mentioned by name and directly, obviously this is talking about Azazel. That's pretty much it. Leviticus 16 and that one verse in 17 referring to the goat spirit of the wilderness. But as the figure gets developed, these patterns get developed that we talked about before in Second Temple literature. He's described in terms basically that are similar to what we would now call Baphomet. Right. This depiction of the devil or Satan or this figure as a goat."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6323.88,"end":6333.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although it should be noted, everybody, that that figure, like, at least the earliest mention of that name, is only like 13th century, 14th century, maybe."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6333.36,"end":6333.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6333.72,"end":6340.64,"speaker":"Fr Andrew Stephen Damick","text":"Associated with the Knights Templar. But I mean, it's. It's. It's feeding on imagery that has existed for a very, very, very, very long time."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6341.28,"end":6349.36,"speaker":"Fr Stephen De Young","text":"Right, right. And is connected not just to this, but to, you know, in Christian circles, Christ's parable of the sheep and the goats."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6349.36,"end":6350.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6350.41,"end":6717.14,"speaker":"Fr Stephen De Young","text":"Sheep go to heaven, goats go to hell. Right. So just like Cake said, there's a lot of goat connections there. Right. That play into that goat imagery. I was just using Baphomet as like an example that people would know, maybe familiar with now because they keep wanting to prop up statues and stuff. Edgelords. So, yeah. And then the other imagery is him being depicted sort of like a raven and ravens being an unclean bird, but specifically being associated with. There's when Abraham had the covenant between. Well, when the covenant was cut, literally, to use the Hebrew word, between God and Abraham. Remember, there's the episode where he splits the animals in two, cuts the animals in two, and then the presence of God moves between them. We've talked about that show before, we won't go into it now, but in that episode, right, Abraham has to sort of beat off these scavenger birds who come for the halved animals while they're laying there. Right. As one might expect. Right. Would happen. But those birds that Abraham has to sort of shoo away become associated with sort of the idea that there's these evil spirits trying to break the covenant between humanity and God. Right. Well, how could they do that? Well, they can't break it from God's end, but they can kind of get humans to. Right. They could lure humans into violating it. Right. But so because of that, he gets this sort of raven bird, scavenger bird imagery associated with him and his description. Sometimes, like, we'll talk about having wings and feathers and stuff. That's what I mean, like, quite literally, that imagery. So in Second Temple Jewish literature, there's both, as I mentioned, this sort of retrospective putting Azazel back into earlier parts, specifically Genesis of the Torah and then also sort of this eschatological element. So both sort of Azazel's been the problem from the beginning. And then also, how is Azazel going to be finally dealt with in the end? Right. Gets sort of fleshed out. And this is across a number of works in Second Temple literature. This even includes. And There are some references to these ideas in the New Testament, including especially in the Johannian literature. But so starting with that retrojection and get excited, people, here it comes. Right, so we've talked a lot before, obviously, Edward, we're gonna be brief with it this time because again, not only have we talked about it a bunch, but I think by far our most listened to episode is the giants episode. People go back to it all the time. So. Right. We don't need to spend a ton of time here rehashing all that. But. So there is this sort of expansion and detailing more of the story of Cain's line, his lineage, his genealogy leading up to the flood. Right. That starts in Genesis 4 and that involves the idea that Cain's descendants were involved, described as sexual involvement with angelic powers, who fell in the process, who turned to evil in the process, and as part of that relationship gained knowledge of what we would call technology, but beyond what we would call technology, sort of spiritual technology like sorcery or sinful techne, like seduction. Right, These sorts of things. Right. And within Cain's line in Genesis, right, you see Tubal Cain, his descendant and his sons who start, you know, herding livestock for meat and metallurgy to make weapons and these kind of things. There's an expansion on that and we've, we've talked about how this is, this is parallel. Right. This expansion of what's going on in Genesis is really interpreting it in light once again of a pagan story or a series of whole set of pagan stories which are again, not ultimately just stories, but are part of their religious life. This is another critique where we're getting the true story in Genesis over against the story that the nations tell and who they're worshiping. And a particularly good example of that is the Apkallu story that we've talked about. It's reflected in the Sumerian kings list, the story of the seven Sages, where you have these pre flood kings in the Sumerian king list who each have an Apkallu, this sort of divine being as their advisor. And then after the flood, all of these kings are 2/3. Apkallu."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6717.22,"end":6736.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This sense of not only, you know, mating with them, but also like, okay, this ancient antediluvian knowledge being given to these kings. And in many cases that's the king's basis for saying, hey, look, I have the knowledge, therefore I should rule."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6738.39,"end":6921.08,"speaker":"Fr Stephen De Young","text":"Right, right. And then that, you know, in, in the world that leads into the Amorites, right, who we've talked about, that comes from a Muru, meaning the Westerners. They're a particular group that moved in and took over Old Babylon. Hammurabi is the most famous Amorite that's outside of Scripture. There are Amorites mentioned there, of course, and their sort of claim to power was that they had retained those antediluvian pre flood secrets and knowledge, right? So that expansion, the expansion of the scriptures includes not only the expansion of the scriptures, fleshing out how it relates to this story includes not only the pre flood part, but also the post flood part in that it includes also the interpretation of Genesis 6. Sons of God and the daughters of men and then their children, right, The Nephilim, the giants, or the tyrants or the bullies. Again, giant episode. We talk about this several times. And OG king of Bashan being an example. Deuteronomy 3:11 talks about the size of his bed, right, presenting him as a giant. And that has to do with, as we've talked about on the show before, the pagan ritual rituals in which many of these kings were sired in sort of a literal sense where you would have a temple prostitute or the current king sort of embodying a divinity from our perspective, you know, possession essentially, and then through sexual congress, ritualized sexual congress, producing a child that they then believed essentially had three parents, the deity, the king and the human woman, which made them 2/3 divine because of course they thought the king was divine. And one third human is like the two thirds of Kalu. And this is sort of the origin of these pagan kings. And so the, the fleshed out version, right, that's explaining how the narrative of Genesis relates to those pagan stories is really fleshing out the fact that it is again running counter to them. So this was, this was what made these kings glorious. This is what made this age a golden age. From the perspective of pagan religion, from the perspective of the scriptures made especially clear by this fleshing out in Second Temple literature, this was a period of horror and, and evil. And these kings were tyrants, right, and engaged all manner of evil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6921.24,"end":6970.96,"speaker":"Fr Andrew Stephen Damick","text":"A story that some people might be aware of that feeds into all of this is the Atlantis story, which, right, this is a story of, about a civilization, a great massive technologically advanced civilization that gets drowned. And if someone says, oh, I have this ancient knowledge from Atlantis, like, ooh, you know, what a lot of people don't know, if you actually read the Atlantis myths, you know, as it's detailed in Plato and stuff, is the people who run the place are all children of Poseidon. So there is this. They're Giants, basically, there's this idea that they are the result of human and divine, you know, intermingling. Right. So that's all like. That's a very familiar story that actually just feeds into all of these patterns that we just talked about."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":6971.68,"end":7049.93,"speaker":"Fr Stephen De Young","text":"Right. And Prometheus. Yeah, right. Over and over again. Right. Pick your ancient Near Eastern civilization. There's all different sort of versions of this idea which is being very clearly called evil. And we have to distinguish here. Also, there's two different groups. That's going to become important in a minute once we're done with Azazel. Right? You've got these angelic beings who sort of initiate this, right. Who are associated, for example, with the Titans, very often including by St. Peter in second Peter with the Titans in Greek myth, who are then for their crimes sort of imprisoned by the other gods. Usually somewhere, the Apkallu story, they're imprisoned in the abyss, which is under the Euphrates river in, I mean, obviously Prometheus, right, we know about, gets chained to a rock with a vulture eating his liver. Right? But they're punished in some way. Right. And in the Second Temple, Jewish literature, right, they're generally imprisoned in the abyss. Right. Or what have you. And Azazel is the leader of these. Azazel is one of these angels who sort of sets this process."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7050.01,"end":7058.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't want to quite say he's like retconned into all of these stories, but that's kind of. Kind of the best way to understand it, I think."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7058.89,"end":7065.09,"speaker":"Fr Stephen De Young","text":"Yeah, well, no, he is. He is retconned. Like he's, he's ident. Or he's identified as being the figure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7065.09,"end":7065.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7065.85,"end":7112.96,"speaker":"Fr Stephen De Young","text":"He's, he's the leader of them. So in, in the Book of Enoch, right, they all. He, he holds this meeting. He calls these other angels together, these other angelic beings together on Mount Hermon and forms this pact with them to go seduce human women, teach them their secrets and everything. Right? So Azazel's leader. So Azazel's leader of that group. Right. And then there are sort of the first round of Nephilim, the first round of giants of these tyrant kings. Who are their children, right. Who are their sons. Right. Who are humans. Right. Who are a separate group. Now, a lot of them end up suffering the same fate. But there is a distinction there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7112.96,"end":7115.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The fathers quote unquote and the sons quote unquote."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7116.6,"end":7136.69,"speaker":"Fr Stephen De Young","text":"Yeah. And we'll be talking about the sons more at least briefly here in. When we're done with Azazel. But there's other. There's other retcons too. Like, the Apocalypse of Abraham identifies as Azel as the serpent in Genesis 3. So, I mean. Yeah, so it's. Right. All the bad stuff, that was a zazel back then."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7136.69,"end":7144.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's an example, by the way, everybody, of how sometimes these various figures get suddenly merged together by one or more of these texts."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7145.45,"end":7161.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But the Apocalypse of Abraham, though, first and second Enoch do this too. The Apocalypse of Abraham is very much focused on the idea that there's going to be an eschatological Day of Atonement where Azazel is sort of finally taken care of."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7161.39,"end":7161.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7161.79,"end":7164.31,"speaker":"Fr Stephen De Young","text":"I mean, if you're talking about, say."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7164.31,"end":7166.91,"speaker":"Fr Andrew Stephen Damick","text":"If you're talking to David Thomet, Azazel's gonna come up."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7168.19,"end":7174.99,"speaker":"Fr Stephen De Young","text":"Right. But so Apocalypse of Abraham wants to put him all the way back in Genesis 3 to say this guy was always the problem."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7175.23,"end":7176.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7176.43,"end":7187.28,"speaker":"Fr Stephen De Young","text":"This guy was the problem from the beginning. Right. The Day of Atonement was a way of dealing with him provisionally along the way, but ultimately at the end of days, he's going to get dealt with once and for all."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7187.28,"end":7193.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why it makes sense to identify Azazel as a. The devil figure."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7194.04,"end":7309.03,"speaker":"Fr Stephen De Young","text":"Right, right. That he's the one who has to be dealt with. Right. And so within. And we talked about this back in our Christology series. In the Apocalypse of Abraham, for example, there's this figure, Yehoel. There's this angel called Yahoel, which leads to basically Yahweh, God is his name, is the name of an angel. So this is an angel of the Lord figure. Right. This is a second person of Yahweh figure in the Apocalypse of Abraham, who is sort of the high priest along with Abraham. So he sort of enlists Abraham to be the high priest in this sort of eschatological day of Atonement where Azazel finally gets taken care of for good. In first Enoch, it's, you know, the archangels are sent to go take care of him. Right. But there's still, even in that context, the way they take care of him is clearly connected to the Day of Atonement ritual, that it is a sort of eschatological fulfillment of the Day of Atonement where he's finally dealt with. But so in 1st Enoch 10, verse 8, there's this sort of summary verse. So this is within that eschatological day of Atonement idea where he's being kind of dealt with. And it says there that the whole earth has been corrupted by the teaching of the works of Azazel. To him ascribe all sin. Right. So again, all the sin that's ever happened. Right. Is ultimately the fruit of Azazel's poison tree, is the idea there. Right. And so if we take care of Azazel, we've taken care of sin once and for all. Right. Is the idea there. That's part of the command to go finally deal with him, Which I think."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7309.03,"end":7329.26,"speaker":"Fr Andrew Stephen Damick","text":"This is a really important point when you're dealing with this question of, you know, theodicy. Right. The origin of evil and how you deal with it is that there's this sense that the reason why there's evil in the world is because of demons. It's because of demons. And so if you really want to truly get rid of all the evil in the world, you have to get rid of the demonic influence."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7330.06,"end":7333.1,"speaker":"Fr Stephen De Young","text":"Yeah. You can't just keep sending it back to him every year."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7333.26,"end":7333.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7333.58,"end":7337.26,"speaker":"Fr Stephen De Young","text":"And purifying things from him every year. And you gotta finally just deal with them."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7337.26,"end":7350.55,"speaker":"Fr Andrew Stephen Damick","text":"And it's not just about humans repenting and being forgiven either. It's also like you have to deal with the origin of it all this stuff which is in this, as it says here, Azazel or, you know, more broadly, demons."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7351.43,"end":7399.68,"speaker":"Fr Stephen De Young","text":"Yeah, the devil, however we want to sum this up. Yeah, the evil one. Right. Yeah. Also, though, note that this whole idea points to the idea that the Torah is doing something provisional in the in between time. So that's not a new idea in the New Testament. Right. That like the Day of Atonement ritual was there as like a management system. And eventually the problem that it was managing, the problem it was dealing with, would be ultimately solved. So when the New Testament writers come along and say, yes, Jesus is the Messiah and he has actually now resolved these problems, that's not like an unforeseen thing from a Jewish perspective."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7400.71,"end":7402.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It was always hoped for."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7402.95,"end":7449.65,"speaker":"Fr Stephen De Young","text":"Right. In fact, they were hoping for the Messiah to come and deal with all of the. Whether it was a priestly Messiah or. Right. However they saw it, and we've talked about that before. Right. They were looking forward to the Messiah coming and finally solving the problems that the Torah had been managing. But so within that, that verse we read from, from first Enoch, you see a bunch of understandings and interpretations that are borne out elsewhere. Like Cain as he's presented in Scripture. Right. He sort of wanders off screen and founds a city and has a bunch of kids and we don't really see much of him himself. Right. Reflected There he becomes Bigfoot in Genesis. Yeah, sorry."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7449.65,"end":7451.93,"speaker":"Fr Andrew Stephen Damick","text":"It's my favorite Mormon legend. What could I say?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7452.5,"end":7453.9,"speaker":"Fr Stephen De Young","text":"Oh, that he's Bigfoot."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7453.9,"end":7457.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, they don't all believe that. It's just a thing that goes around in those circles."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7459.62,"end":7462.94,"speaker":"Fr Stephen De Young","text":"Well, he showed up and told that guy in Tennessee, didn't he? That's, that's."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7462.94,"end":7466.18,"speaker":"Fr Andrew Stephen Damick","text":"It's based on that. Yeah. This actual encounter, 19th century."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7466.5,"end":7469.22,"speaker":"Fr Stephen De Young","text":"Yeah. He went talk to Bigfoot. Bigfoot. Told him he was Kane."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7470.02,"end":7470.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7471.62,"end":7476.26,"speaker":"Fr Stephen De Young","text":"When I think of Cain walking the Earth though, I think of Kwai Chang in Kung Fu. But anyway."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7480.06,"end":7480.3,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7480.78,"end":7487.42,"speaker":"Fr Stephen De Young","text":"But in. In the broader suite and when I say the broader sweep of Second Temple literature, I'm including stuff like Josephus. Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7487.42,"end":7488.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7489.66,"end":7532.8,"speaker":"Fr Stephen De Young","text":"See, Cain not just as this sort of this guy who did this horrible thing and then had to muddle through the rest of his life and his kids just got worse and worse before the flood. But Cain is this active participant in evil throughout his life. That he was this teacher of evil to his children, that he was a heretic, that he was right sort of every bad thing that was Cain. And Cain was sort of doing this. That's reflected in. I mentioned the Johannian literature in this sort of azazel ideas in First John 3, verse 12. Right. It talks about Cain as being of the wicked one. Yeah, sort of like that of the. Say he's like the son of."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7533.44,"end":7535.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's like he's a Zazel junior."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7536.8,"end":7557.77,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. He's sort of the embodiment. Right. The way that again, if we see Azazel as being one of these parents of the giants. Right. The idea here is that Cain is like one of the sons in that sense. Right. He's sort of supremely evil in that sense. And. No. Okay, look, look, you weirdos."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7559.77,"end":7561.61,"speaker":"Fr Andrew Stephen Damick","text":"We have a lot of weirdos who listen to this show."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7561.61,"end":7562.97,"speaker":"Fr Stephen De Young","text":"I mean, welcome weirdos. I know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7563.05,"end":7563.65,"speaker":"Fr Andrew Stephen Damick","text":"We're happy."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7563.65,"end":7568.01,"speaker":"Fr Stephen De Young","text":"There may be some of you out there who are such weirdos that you think even the serpent did something."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7568.57,"end":7570.81,"speaker":"Fr Andrew Stephen Damick","text":"Oh, oh, yes, the serpent seed."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7570.81,"end":7571.37,"speaker":"Fr Stephen De Young","text":"Nonsense."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7573.05,"end":7752.28,"speaker":"Fr Andrew Stephen Damick","text":"I will tell you. Okay, okay, since you brought that up, I wasn't going to say anything about this, but since you brought it up, I visited several years ago. I did a speaking engagement in Louisville, Kentucky. And right across the river in. I think it's in Indiana. There's a cemetery there and a church. And the church is called the Branham Tabernacle and it's named for William Branham. And William Branham was this. He was this mid 20th century faith healer. And. And he Initially did lots and lots of sort of faith healing, but then he started teaching all these weird, weird things. And one of the things that he taught was this serpent seed idea, which is the idea that Cain is the literal child of the devil and Eve, and. And that the origin of evil in the world is. Is this. There's this sort of race of other humans out there who are literally children of the devil. Yeah, canines. And so what's fun? It. Well, maybe fun's not the right word. I don't know. I mean, I'm interested in weird religious movements, especially stuff that's kind of pseudo Christian. So what's interesting is, I mean, number one, if you ever get a chance to go visit the cemetery, you should, because he's got this really weird gravestone. It's kind of like a pyramid with an eagle on the top, but not too far away from Branham's grave. And by the way, like, if you visit his grave, you can find people leaving letters for him and all kinds of stuff. Like his followers visit him. In fact, every year on Easter. Easter, people show up at his grave expecting him to rise from the dead. Anyway, not too far away from his grave is one of his followers graves. And there's actually multiple graves in the cemetery that belong to followers of his. And you can tell by what's written on their graves. But one of them is this big. I think it's a cross from this woman who is one of his followers. And on the back of it, it has this like, poem to William Branham, and it lists off all of his wackiest teachings. And the serpent seed is there. It's crazy stuff. Anyway, look him up, everybody. William Branham. I think I put a little bit about him in orthodoxy and heterodoxy and the. The. The chapter on pentecostalism and so forth, because he's just such an interesting, wacky figure. And there's videos of him on YouTube. You can see him doing his faith healing thing on YouTube. And unlike a lot of faith healers today, where it's all like, big spectacular show, he's like, awkward, and it's a little, you know, difficult to watch because he's just not like a good showman. But anyway, fascinating weird figure, but he was one. He's one of the origins of the. The popularization of the serpent seed doctrine in America. And there are still Branhamite groups out there who. In fact, I recently spoke with somebody who ran into someone who belonged to one of these groups. There's still groups out there that teach this stuff. And. Yeah, yeah, Weird, weird, weird."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7752.28,"end":7753.64,"speaker":"Fr Stephen De Young","text":"Don't do it. Not once."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7753.72,"end":7754.44,"speaker":"Fr Andrew Stephen Damick","text":"Don't go there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7755.16,"end":7762.6,"speaker":"Fr Stephen De Young","text":"But there's not a whiff of that in Genesis. And that's not what St. John is saying here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7762.6,"end":7763.84,"speaker":"Fr Andrew Stephen Damick","text":"No. Not even a little bit."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7763.84,"end":7764.6,"speaker":"Fr Stephen De Young","text":"Very clearly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7764.68,"end":7765.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7765.64,"end":7769.16,"speaker":"Fr Stephen De Young","text":"Right. Because then the person he murdered wouldn't have been his brother."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7769.72,"end":7772.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7775.78,"end":7837.6,"speaker":"Fr Stephen De Young","text":"So, but as you read, if you read First John closely, it becomes apparent that at least these ideas that we saw in one Enoch 10, eight are there in the background. First John does talk about atonement. We won't go into that here. I could, trust me, my dissertation. But he talks about atonement explicitly. And so that this language is kind of surrounding there makes sense if St. John is familiar with broader Second Temple literature, which he certainly is. So, for example, in First John 5, verse 19, he says the whole world lies under the power of the evil one. Right. Like the whole earth has been corrupted by the teaching of the works of Azazel. Right. And it's very clear from the way St. John uses the whole phrase, the whole world, olokosmu, that he is referring to like the material world, which makes sense in terms of atonement. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7837.6,"end":7839.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Got to clean up the space."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7840.24,"end":7939.63,"speaker":"Fr Stephen De Young","text":"Yeah. And then first John 3, verse 8, he says that Christ appeared to destroy the works of the devil. Right. Not to destroy the devil or defeat the devil, but to destroy the works of the devil. Which kind of parallels the works of Azazel. Right. That have corrupted the whole earth. Right. That step of removal, those works which are being done by humans, even though they're the works of this demonic figure, humans like Cain. So when you look at first Enoch, what happens to Azazel, like the spiritual being or even the apocalypse of Abraham, there's other literature. He's bound and imprisoned in a pit. And then in first Enoch, he's freed at the end of days for a brief period and then thrown into a lake of fire. Does that sound familiar to anybody in terms of what happens in the Book of Revelation to the devil? Right. And so. And that, of course, plays all the language we say about Pascha sent into Hades, Christ binding the devil. Right. All of that is a pattern that we find in the Azazel descriptions in Second Temple Jewish literature. So moving from leader of the fathers to the sons. And we're not going to spend too much time on Mastema."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7939.87,"end":7944.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because we just covered a whole bunch about him in the Jubilees episode 2."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7944.75,"end":7963.23,"speaker":"Fr Stephen De Young","text":"Jubilees episode, so you could get more detail there. Right. And that was like. Well, when you hear this. That'll be what, like four weeks ago. So yeah, you can go back and listen to that one. That's not that long ago. Don't have a ton new to say about Mastima, to be honest."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7963.31,"end":7963.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":7963.79,"end":8020.21,"speaker":"Fr Stephen De Young","text":"But briefly, as we talked about there, he was sort of the leader of the pre flood giants and he's the one who once they're all wiped out and they're all now bodyless spirits, they're about to get thrown into the abyss too, just like their quote unquote parents. He comes and cuts the deal with God where 10% of them can stick around to torment the wicked and the other 90%. Right. Sorry guys, abyss for you. And then God allows that he accepts the deal because he's going to use their tormenting of the wicked to bring them to repentance. This is explaining the phenomenon that we see, like with Saul the King, when the unclean spirit enters into him to torment him."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8020.61,"end":8033.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they're called unclean because it's this idea that they are in some way the result of a mixing hybridization between angels and humans. Again, we're not saying that that literally happens."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8033.89,"end":8035.97,"speaker":"Fr Stephen De Young","text":"Right. We're not talking about DNA."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8036.21,"end":8036.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8036.65,"end":8038.73,"speaker":"Fr Stephen De Young","text":"Because the scriptures are talking about DNA."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8038.73,"end":8039.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're saying that the Book of Enoch."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8039.93,"end":8041.21,"speaker":"Fr Stephen De Young","text":"Isn'T even talking about DNA."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8041.21,"end":8043.57,"speaker":"Fr Andrew Stephen Damick","text":"This is the way the imagery is presented."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8044.45,"end":8044.85,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8044.85,"end":8045.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8047.02,"end":8070.22,"speaker":"Fr Stephen De Young","text":"And then of course, Tobit, we see another demon and then the exorcisms that we see across, like the Synoptic gospels, the book of Acts, these disembodied, formerly demonized human spirits. Right. That become demons and insert St. John Chrysostom quote here."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8070.94,"end":8071.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8073.03,"end":8076.83,"speaker":"Fr Stephen De Young","text":"You could go back and listen to that. We've given it several times to certain."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8076.83,"end":8080.39,"speaker":"Fr Andrew Stephen Damick","text":"People'S consternation and it is in the Lord of Spirits book."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8081.59,"end":8085.67,"speaker":"Fr Stephen De Young","text":"Okay. That out here. Shilling for your book, man."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8086.63,"end":8091.67,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if there's going to be anywhere I'm going to mention the book. This is the show where I'm going to do it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8092.63,"end":8094.87,"speaker":"Fr Stephen De Young","text":"Is there anywhere you're not going to mention the book, though?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8094.95,"end":8101.55,"speaker":"Fr Andrew Stephen Damick","text":"Be honest. I don't try to sell it to my wife, for instance. She could just get it out of the boxes I have in the basement."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8101.71,"end":8102.67,"speaker":"Fr Stephen De Young","text":"Yes, exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8102.67,"end":8103.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8103.87,"end":8105.47,"speaker":"Fr Stephen De Young","text":"But you do mention it, I bet."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8105.55,"end":8108.51,"speaker":"Fr Andrew Stephen Damick","text":"Not that often. Although one of my sons is reading it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8110.11,"end":8120.63,"speaker":"Fr Stephen De Young","text":"So if I asked your wife, how often would she think you bring it up? I. Probably more often than I. Than I think. Yeah, exactly. Exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8120.63,"end":8163.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. Yeah, yeah, so, so, but. And you know, Mastema is an interesting figure For a bunch of reasons. Again, see the Jubilees episode. But what makes him particularly different from all these other guys that we've been talking about is that unlike the rest, he's not depicted as a fallen angel figure. He rather is basically a truly fallen human because he's one of the giants. And what is a giant? Is it simply a. A truly demonized human. So he's a disembodied demonized human. He functions in kind of like a demon. Yeah, yeah. He functions in the way that St. John Chrysostom says that it is possible for humans, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8164.15,"end":8176.39,"speaker":"Fr Stephen De Young","text":"Yes, yeah. Which is the flip side of the sons of the resurrection, as Christ says in St. Luke's Gospel, being sons of God equal to the angels."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8177.75,"end":8178.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8179.51,"end":8206.55,"speaker":"Fr Stephen De Young","text":"The flip side of that is being like a demon. So the last sort of major individual figure, and we've talked about this, we talked about him a couple of times, briefly. Most recently, the last episode, we talked about him briefly because he shows up at the Ascension of Isaiah and that's Belial, sometimes Beliyar."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8207.27,"end":8207.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8208.47,"end":8242.43,"speaker":"Fr Stephen De Young","text":"Due to Aramaic dialects and pronunciations. And Belial, of course, as we mentioned already in that episode, I think at least briefly, comes from the Aramaic Beliol. Most people agree now, I mean, the journal article's gotta be published and everything, but most people agree comes from Belliol, which means yokelis mean just the egg whites. Yes, that's exactly what I mean. He is meringue, anyway."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8243.55,"end":8244.91,"speaker":"Fr Andrew Stephen Damick","text":"The meringue demon."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8245.55,"end":8249.07,"speaker":"Fr Stephen De Young","text":"Yes. Light, fluffy, deadly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8250.19,"end":8252.11,"speaker":"Fr Andrew Stephen Damick","text":"This is going to become a T shirt, I hope."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8253.71,"end":8271.78,"speaker":"Fr Stephen De Young","text":"Yeah. Yes, I do want to see the. I mean, they made a horror movie about an evil demon possessed pair of jeans. So anything is possible, people. The."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8273.78,"end":8275.38,"speaker":"Fr Andrew Stephen Damick","text":"Yokeless without. Without a."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8276.1,"end":8282.14,"speaker":"Fr Stephen De Young","text":"Without a yoke, like a wild bull or wild ox who does not have a yoke."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8282.14,"end":8285.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the lawless one, he's out of control."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8285.54,"end":8289.78,"speaker":"Fr Stephen De Young","text":"Yoke here referring to the Torah, the law. Right. The lawless being lawless uncontrolled."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8290.19,"end":8291.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8293.07,"end":8317.47,"speaker":"Fr Stephen De Young","text":"And this is a title that's used all over the place. We're going to give some examples here in a second from books we've recently talked about, in fact, all across Second Temple literature. When it talks about the Messiah and when the Messiah comes and it talks about there being an enemy of his. So it's the Messiah versus."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8318.4,"end":8318.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8318.88,"end":8377.85,"speaker":"Fr Stephen De Young","text":"The name that's used over and over and over again is Belial. The Messiah over against Belial. So the Melchizedek scroll. Right. In the Dead Sea Scrolls, it's Melchizedek and all the righteous Gods versus Belial and all the gods of evil. Right. That's lower G, gods. Right. Referring to angels and saints in the one case, and folks like mastema on the other and fallen angels on the other. Right. So there's that. That's. He's the figure who opposes that. That's why we talked about. One of the places we talked about Belial was in our episode on the Antichrist. So if you want some more, you can go there because of that. Because the sort of the. The Anti. Messiah. The Antichrist. The opposition of the Messiah is Belial in these texts. But just for some examples, Jubilees 15:32 is talking about the uncircumcised Gentiles. They refer to as the sons of Belial."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8378.81,"end":8384.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which it doesn't mean literally. It just means that they do the works of their quote, unquote father."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8385.05,"end":8390.65,"speaker":"Fr Stephen De Young","text":"Right. And why are they yokeless? Well, circumcision is here being used to refer to the Torah. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8390.81,"end":8392.33,"speaker":"Fr Andrew Stephen Damick","text":"They're outside of the law."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8392.33,"end":8464.24,"speaker":"Fr Stephen De Young","text":"They don't have that yoke. And so they're like wild animals. Right. Just the idea. Right. The testaments of the twelve patriarchs that we talked about a few episodes ago refers to idolaters and sexually immoral people as sons of Belial. The ascension of Isaiah, of course, in chapter two, verse four that we talked about last time, this definitely personifies him. It refers to the angel of lawlessness who is the ruler of this world, Belial. Right. So that's putting kind of a finer point on it. But this also shows up in St. Paul's epistles. Interestingly, in Second Corinthians 6, verse 15, he says, what harmony is there between Christ and Belial? As sort of an obvious statement. Right. Like, how can you have harmony between Christ and the Antichrist? Right. That's sort of definitionally impossible. The Messiah and the like. Anti. Messiah. Right. But there is a much earlier mention, and that's in the. In the Book of Proverbs."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8464.88,"end":8465.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8465.44,"end":8466.48,"speaker":"Fr Stephen De Young","text":"Book of Proverbs."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8466.72,"end":8521.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was going to say. Yeah. I mean, it's In Proverbs, chapter 6, verses, well, 12 through 15. Yeah, it shows up in verse 12, but. But it goes on a little bit. So it says. Well, if you read. If you read the esv, I'll do that. So just kind of take us in here. A worthless person, a wicked man, goes about with crooked speech, winks with his eyes, signals with his feet, points with his finger, with perverted heart, devises evil, continually sowing discord. Therefore calamity will come upon him. Suddenly, in a moment, he will be broken beyond healing. So this is one of these cases where the translation kind of hides a little of what's going on. That phrase that shows up at the beginning into the ESV translates as a worthless person. In Hebrew. It says Adam Belial. I'm sure I'm mispronouncing it, but the man of Belial. The man of Belial."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8521.75,"end":8530.43,"speaker":"Fr Stephen De Young","text":"But it's Adam. Because instead of a nosh. Because Adam. Right, is like Adam. It's like anthropos. This is an archetype."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8530.43,"end":8531.93,"speaker":"Fr Andrew Stephen Damick","text":"Humanity, Right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8531.93,"end":8546.05,"speaker":"Fr Stephen De Young","text":"So the man of Belial is. This is an archetype. This is a type of person. This is a type of human. And then that type of human is described in the rest of the quote, crooked. But there are even more interesting translations."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8546.05,"end":8568.45,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes. I have to bring this up because. Well, number one, it's been a while since I. Since I did this. Father Andrews, etymology coordinator. Yay. I had someone ask me recently, like, how come you never play the jingle anymore? And it wasn't a decision. It just sort of didn't happen. But."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8569.33,"end":8571.77,"speaker":"Fr Stephen De Young","text":"Yes, but finally today I threw you a bone."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8571.77,"end":8773.82,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much. Yeah. So the King James. The King James version of this verse, what the ESV translates as, you know, a worthless person. But of course, more literally says a man of Belial or the man of Belial. The King James translates it as a naughty person. Naughty. And, you know, for us living here in the decadent 21st century, that sounds pretty silly. A naughty person like naughty is the word we use to refer to kids. Maybe lawless kids, but what's fun about this is this isn't. This is an early modern English translation of this phrase. They're translating it from the Hebrew. And naughty might seem crazy to us now, but actually it's really a good translation. It wouldn't work now, but it was a really good translation back when it was done. Okay, so here's why. Well, naughty actually comes from. Ultimately, it's from naught. N A U G H T. Right. Which we use as a kind of archaic way of saying nothing like that will come to naught, meaning it will come to nothing. But what's fun is that not actually comes from Old English na hu, which means no thing. So literally, it does mean nothing, but. But early on, naughty was used to mean needy, meaning having nothing. Right. Not possessing nothing. Right. So they're nothing is how you could. Might think of it. But also that sense of not or nothing was also used right around the same time, in the late 14th century. So this is kind of the late medieval period was used to mean something that's evil or immoral or corrupt or unclean. And it actually participates in the sense of not spelled either N o u G H T or N A u g h T. That sense of nothingness. And it's. It's actually a very Boethian idea that. That the privation of good is what evil is. So good is a thing and then. But evil is actually not a thing, no thing. Right. And so therefore, you also get the idea that this means something that's insignificant or meaningless or worthless. It can also even be used for the number zero. We still sometimes, like I think British English often uses not to mean zero. So this early modern English translation of naughty is actually really good in terms of translating man of Belial because it has this whole ball of nothingness, chaos, evil, privation, worthlessness, lawlessness, all bound up in that. So next time you call your kids naughty, just think about the gravity of what you're saying, or at least what you would have been saying if you were living in the late 14th century. So there we go. That was a good Father Andrew's etymology. Here we go. We get a before, before and after. So."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8775.18,"end":8776.62,"speaker":"Fr Stephen De Young","text":"Well, we all learned something today."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8776.86,"end":8782.14,"speaker":"Fr Andrew Stephen Damick","text":"I hope we all did. Don't want to be naughty, because that's just nothing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8782.86,"end":8786.62,"speaker":"Fr Stephen De Young","text":"The beguiling of naughtiness must be resisted at all costs."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8786.86,"end":8787.5,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8789.34,"end":8824.51,"speaker":"Fr Stephen De Young","text":"So, yeah, to sort of finish up this section. Right. As I mentioned, Belial's our sort of last named guy. But there are also places where some of the figures we've talked about in some of our monster episodes that are our annual Halloween monster episodes also sometimes get used to represent sort of the ultimate evil, like Leviathan or Behemoth Leviathan, especially for you Hellraiser fans out there. Yes, earlier today, I did have to explain to Father Andrew what. What Hellraiser is."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8824.51,"end":8828.23,"speaker":"Fr Andrew Stephen Damick","text":"It's not just acupuncture gone really bad. I found out."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8829.67,"end":8850.39,"speaker":"Fr Stephen De Young","text":"I don't think he enjoyed or needed to find that out, but not at all. I'm me, so I'll inform you of all kinds of things. But, yeah, so sometimes those figures are used sort of portray the ultimate evil or chaos or. Right. In sort of an analogical way."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8850.69,"end":8851.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8851.17,"end":8901.81,"speaker":"Fr Stephen De Young","text":"But so having now covered sort of these different sets of patterns and names and figures for the devil qua. Ultimate evil being or arch evil. Arch devil. When you get into our forthcoming third half here, we're gonna talk about, you know, what do we do with this? How do we understand this is this like a bunch of guys? Is this like the council? Is this like the Legion of Doom meeting in a swamp somewhere, conspiring to destroy humanity? Or like, how should we consider what's going on with these different figures and the way scripture in particular, even more than the interpretive stuff in Second Temple Judaism, but the way scripture in particular talks about them and relates them to each other, to us."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8902.37,"end":8906.11,"speaker":"Fr Andrew Stephen Damick","text":"All right, we'll be right back with the third and final half of this episode of the Lord of Spirits."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8906.58,"end":8926.6,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8555-AF-RA."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8928.08,"end":8937.31,"speaker":"Fr Andrew Stephen Damick","text":"St. Paisio said every day you should."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8937.31,"end":8969.69,"speaker":"Fr Stephen De Young","text":"Try to plant in your soul something spiritual which will eject something worldly and sinful. Replace the sinful images in your mind with holy ones. Athanightusa.com offers holy icons for those wishing to plant something spiritual in their souls. Immaculate 22 carat gold leaf, hand applied on solid wood. A lifelong gift for yourself and someone you care for. Use the code Faith for free shipping. Come and see atheniteusa.com."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8973.45,"end":8989.57,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":8995.49,"end":9015.19,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the third and final half of this episode of the Lord of Spirits. We're talking about the devil. And we just kind of did a catalog of a number of these major devil figures that are found in scripture and also Second Temple, Jewish literature and elsewhere. So now we're going to try to bring it all together, understand exactly what's going on."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9016.31,"end":9025.51,"speaker":"Fr Stephen De Young","text":"The way you keep saying devils makes it sound like you're spelling it with a Z. You know, spelling is, which is very 90s."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9031.27,"end":9037.59,"speaker":"Fr Andrew Stephen Damick","text":"I mean, in some level we are children of the 90s and of the 80s, I guess. More of the 80s, I think, in the 90s. But."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9037.75,"end":9047.91,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. But that's, that's just what I visualize. Spray painted, by the way. Nice devils with a Z, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9048.39,"end":9051.51,"speaker":"Fr Andrew Stephen Damick","text":"And maybe two V's or a Y in there somewhere."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9052.71,"end":9054.51,"speaker":"Fr Stephen De Young","text":"No, you just. The Z does it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9054.51,"end":9055.27,"speaker":"Fr Andrew Stephen Damick","text":"The Z's enough."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9055.99,"end":9058.95,"speaker":"Fr Stephen De Young","text":"Yeah, the Z makes it copyrightable. It makes it hip and cool."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9060.23,"end":9064.47,"speaker":"Fr Andrew Stephen Damick","text":"Why is there a Z in Dragon Ball Z? I've never watched that Show. I don't understand what that's about."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9065.36,"end":9066.4,"speaker":"Fr Stephen De Young","text":"That's past my time too."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9066.4,"end":9068.2,"speaker":"Fr Andrew Stephen Damick","text":"The 9,000 thing. I don't."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9068.2,"end":9070.64,"speaker":"Fr Stephen De Young","text":"Yeah, I know the memes, but yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9070.64,"end":9073.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's all I know. I don't know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9073.68,"end":9095.75,"speaker":"Fr Stephen De Young","text":"Okay, well, can't help you out on that one. Okay, so what about the fact close to. Yeah. The gaping hole in my pop culture knowledge that will remain forever is anime. Huh. I'm about to lose a ton of our listeners, but I have just. Anime bores me."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9096.07,"end":9096.55,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9097.59,"end":9099.99,"speaker":"Fr Stephen De Young","text":"Like, I've seen the like, really classic stuff."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9100.15,"end":9100.47,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9100.47,"end":9120.2,"speaker":"Fr Stephen De Young","text":"Because, like, I tried. I tried way back in the long ago time, like late 80s, early 90s, I tried to get into it, right? So like, I've seen Akira. I've seen Ghost of the Shell. I've seen Appleseed. I've seen Project Ako. I've seen Ninja Scroll. I've seen all this stuff. Like, it's never done it for me."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9120.2,"end":9121.36,"speaker":"Fr Andrew Stephen Damick","text":"Princess Mononoke."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9122.64,"end":9129.04,"speaker":"Fr Stephen De Young","text":"Yeah, saw it. No, Totoro. Yeah, I've seen. Yeah, I've seen that. Like very early, like, older stuff."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9129.68,"end":9164.39,"speaker":"Fr Andrew Stephen Damick","text":"Did you know. Did you know that the people who made. Who were the Rankin and Bass. Rankin Bass animators who made, like, you know, the Hobbit, the original Hobbit movie. I shouldn't say the original Hobbit movie, because there's one in the 60s that was called Hobbit, exclamation point. You can see that on YouTube. But yeah, the Hobbit movie that most people think about. And then they made the Return of the King, same style. They went on to form the group that. I can't remember the name of it now, that made like Princess Mononoke and so forth. So it's kind of like a pre anime thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9164.63,"end":9167.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, like, I've seen all that stuff."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9167.39,"end":9170.31,"speaker":"Fr Andrew Stephen Damick","text":"It just didn't work for you."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9170.31,"end":9177.19,"speaker":"Fr Stephen De Young","text":"Yeah, I could. I could tell you everything in the world about like European and American comics, but I know nothing about manga. Like."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9178.87,"end":9187.19,"speaker":"Fr Andrew Stephen Damick","text":"Huh? Yeah, I probably know less than you about it, but. But I also don't claim. Again, everything pop culture."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9187.19,"end":9196.15,"speaker":"Fr Stephen De Young","text":"So with manga, right? Isagi Yojimbo, right? Like Lone Wolf and Cub. I mean, like the old stuff, Blade of the Immortal. Like, I tried."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9196.83,"end":9198.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Just."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9199.07,"end":9200.03,"speaker":"Fr Stephen De Young","text":"Just not my thing."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9200.43,"end":9210.27,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what do we do with the fact that there are multiple references to the evil One and yet we have all these various spirits?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9211.07,"end":9257.77,"speaker":"Fr Stephen De Young","text":"Well, yeah, and I mean, we went through. When we were going through those, we kind of went through the places where the name was used in scripture or where it's associated directly with a story in Scripture. But like in the New Testament, there's a bunch of references that's clearly referring to a devil figure, but it's not totally clear which one. Right. So they're just kind of ambiguous references. So some of these just refer to the evil one. Right, the evil one. Well, which one? Evil one. Right. So one of the most famous ones is potentially in the Lord's Prayer."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9258.65,"end":9259.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9259.37,"end":9349.37,"speaker":"Fr Stephen De Young","text":"And I am going to have to grind an ax here for a minute. All right, just briefly. And this is, this is. Listen, guys, for those of you who think I'm always picking on our Protestant friends or our Roman Catholic friends, this is. This is mostly an issue I have with, with my fellow Orthodox folks. Right. So in Orthodox translations of the Lord's Prayer, some of them end with deliver us from evil, some with deliver us from the evil one. Right. And every once in a while, some Orthodox person who knows some Greek, sometimes I think the problem is that they know more modern Greek than ancient Greek. Here we'll say, oh, well, in the original Greek it's the evil one. And sometimes they'll even like post the original Greek to say, see? Resolved between two options. Yes, yes. Right. And I think they think that because there's an article in front of Pony Ru that that makes it the evil one. Right. Therefore the adjective evil is being used substantively."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9352.18,"end":9352.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9353.54,"end":9386.35,"speaker":"Fr Stephen De Young","text":"And that could mean the evil man, the evil person, the evil one. It's not that. That's an impossible translation. It could mean that. But here's the problem. Greek also puts an article before an adjectival quality to talk about that quality. Its. So, for example, famously, this is sometimes reflected in English translations. They'll have Plato or Aristotle talking about the good."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9387.55,"end":9388.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9388.67,"end":9421.46,"speaker":"Fr Stephen De Young","text":"Which is an over translation. Right. They're talking about good or goodness itself. You use the article to do that. It's called the monadic article. Right. You use the article to do that. And so in Greek, the reason we have these two different translations is that oponuru could be the evil one, or it could be just evil, like evil itself."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9422.02,"end":9423.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Deliver us from evil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9424.42,"end":9438.84,"speaker":"Fr Stephen De Young","text":"The Greek is ambiguous, so stop posting the Greek as if that solves the issue. Right. You may think you're pulling rank because you know some Greek on people, but really you're exposing yourself as someone who."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9438.84,"end":9442.08,"speaker":"Fr Andrew Stephen Damick","text":"Doesn'T think we should split it down the middle and say, deliver us from the evil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9443.6,"end":9453.68,"speaker":"Fr Stephen De Young","text":"From the evil. Yeah. And then everybody just be like, what? But anyway, both are fine. That acts ground."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9453.84,"end":9455.68,"speaker":"Fr Andrew Stephen Damick","text":"Do whatever is normal in your parish."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9455.84,"end":9485.68,"speaker":"Fr Stephen De Young","text":"Right. Assuming that's the Evil One. Right. Which it could be. It could be deliberately ambiguous. Remember what we were talking about back in the first half? Right. Maybe it's ambiguous on purpose. But if we're going to interpret that as being referring to the evil one, Devil, Satan, Azazel, Belial. Right. Mastema, even."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9485.76,"end":9486.4,"speaker":"Fr Andrew Stephen Damick","text":"Which one?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9487.36,"end":9492.04,"speaker":"Fr Stephen De Young","text":"Not clear. And Christ gives the parable of the."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9492.04,"end":9492.64,"speaker":"Fr Andrew Stephen Damick","text":"Sower."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9495.2,"end":9510.91,"speaker":"Fr Stephen De Young","text":"And the parable of the sower. There's the seed that falls to different places, the seed that falls on the road. The birds come in and eat it before it can take root. And when he gives the interpretation to his disciples, he says the birds, plural, are the evil one."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9511.31,"end":9511.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9512.51,"end":9534.35,"speaker":"Fr Stephen De Young","text":"Who comes and snatches away. Well, which one? I mean, even if you go with bird imagery, as we talked about in Jubilees, Mastema is represented as a crow, but Azazel has the raven stuff going on."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9534.93,"end":9535.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9535.97,"end":9540.61,"speaker":"Fr Stephen De Young","text":"Is it one of them? Could be, but it doesn't say."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9540.77,"end":9541.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9544.29,"end":9569.18,"speaker":"Fr Stephen De Young","text":"In Ephesians 6:16, St. Paul talks about the flaming darts of the evil one. Flaming darts are owned by the evil one. Well, that doesn't sound like any of the people we talked about so far tonight. That sounds more like a guy we've talked about in other contexts, including the Four Horsemen of the Apocalypse, Refesh. Right. With his archery, the flaming arrows. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9569.18,"end":9576.1,"speaker":"Fr Andrew Stephen Damick","text":"The plague of arrows, which you see, like with Apollo in the Iliad, he shoots a bunch of arrows at people and they get diseases."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9582.9,"end":9587.06,"speaker":"Fr Stephen De Young","text":"I'm glad you saw that. I wasn't making that up. By the way, when you reread the Iliad recently."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9588.41,"end":9588.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9589.53,"end":9628.74,"speaker":"Fr Stephen De Young","text":"We gave examples when we're talking about Azazel, of those quotes from First John where it sounded like Saint John was using Azazel language, but he never used the name Azazel. He referred to the devil. He referred to the evil one, the wicked one. St. Paul, at the end of 2 Thessalonians, prays that they would be protected from the evil one. Which one? Well, second Thessalonians is where he talks about the man of lawlessness. Is he talking about Belial?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9629.06,"end":9629.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9629.42,"end":9727.77,"speaker":"Fr Stephen De Young","text":"I mean, maybe John 17:15, during Christ's. What's called his high priestly prayer, he prays that the Father would protect his followers from the evil one. No clue there as to which one, which version, however we want to see it, that would be talking about then beyond the evil one language. You have three times in St. John's Gospel, in 1231, 1430 and 1611, Christ refers to the ruler of this world. Right. As this entity. That's sort of coming for him with the crucifixion. Right. That's coming after him. Which one's that? Right. At one point he says that the ruler of this world found nothing in him. Right. Had no claim on him. So is that like Satan? Like there's no accusation he can make against Christ because he's sinless or. Right. You could say it's Azazel outside the camp kind of ruling the world idea, since he's coming after Jesus, the Messiah. Is this like Belial, like the anti Messiah? Right. Like not clear. Right. And the same Thinging's true when St. Paul in Second Corinthians 4, verse 4 refers to the. The God of this age."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9730.97,"end":9731.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9734.97,"end":9793.29,"speaker":"Fr Stephen De Young","text":"Or St. Paul in 1 Corinthians 2, verse 8 refers to the rulers of this world. Rulers, plural? Yeah, in a way that's clearly referring to like powers and principalities. Right. Like demonic spirits. Right. So it's not clear who in terms of these names and these identities we've been talking about, they're referring to. But we have to back up then and even ask a kind of different question that precedes that, which is in any of those examples I just ran through, or any of those speakers or writers, Christ, St. Paul, whomever, we're talking about, St. John, are they even meaning to refer to one of these to the exclusion of the others? Do they even necessarily have in mind, oh, I'm talking about Azazel, not the devil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9795.05,"end":9795.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9795.45,"end":9798.49,"speaker":"Fr Stephen De Young","text":"Or I'm talking about Satan, not Mastema."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9800.42,"end":9818.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it kind of raises this question of like, could this. Could these all be different names and sets of imagery referring to one particular figure or a set of figures that is smaller than the, Than the total number?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9819.78,"end":9821.22,"speaker":"Fr Stephen De Young","text":"Yeah, you know, one or two."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9821.7,"end":9829.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Could this. Could the Satan and the. And the Devil be two sides of one guy? And then Azazel and Mastema, like, you know."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9831.03,"end":9844.55,"speaker":"Fr Stephen De Young","text":"Right, right. Are these names and these patterns not describing the identity of a being, but describing like, like actions, like the works. Right. In the world?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9844.79,"end":9845.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9845.35,"end":9856.52,"speaker":"Fr Stephen De Young","text":"And if that's the case, then could you have one entity who acts in these different ways and the different names and stuff are ways of talking about those different actions?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9856.52,"end":9867.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or could there even be, like, could the set of the, the beings who are doing these things actually be a larger number than the list of names that we just gave? Like."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9867.28,"end":9867.68,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9867.68,"end":9880.92,"speaker":"Fr Andrew Stephen Damick","text":"Which we've talked. I mean, we've, we've presented that idea before. Like, like when Norse pagans worship Thor, is there just one demon? Or is there maybe a set of demons that are all saying, I am Thor and accepting that worship from them."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9882.47,"end":9887.67,"speaker":"Fr Stephen De Young","text":"Right. There's certainly more than five, six demons right out there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9887.67,"end":9891.11,"speaker":"Fr Andrew Stephen Damick","text":"However you count them, there's definitely a lot."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9892.23,"end":9895.95,"speaker":"Fr Stephen De Young","text":"I mean, Legion was possessed by more than five, six. So."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9895.95,"end":9896.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9898.63,"end":9904.87,"speaker":"Fr Stephen De Young","text":"We don't think all of them were possessing Legion because then there wouldn't be any left after they went into the pigs."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9905.51,"end":9908.56,"speaker":"Fr Andrew Stephen Damick","text":"Good point. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9908.64,"end":9937.05,"speaker":"Fr Stephen De Young","text":"And so there's that question. But now we even have to back up another step. Right. The stuff we have to back up is because we're talking about we're trying to identify an evil spirit or spirits. Right. Like which one? Like to identify it, name it, describe it. Right. But how does identity even work for spirits, evil or otherwise?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9938.09,"end":9945.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, for humans, identity is very much bound up in body, frankly, contra."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9945.37,"end":9946.73,"speaker":"Fr Stephen De Young","text":"We'll be talking more about that soon."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9946.73,"end":9947.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9947.09,"end":9950.25,"speaker":"Fr Stephen De Young","text":"As I relation to the bodily resurrection and stuff. Not this episode."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9950.25,"end":9951.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9953.29,"end":9955.33,"speaker":"Fr Stephen De Young","text":"In the near future of future episodes."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9955.33,"end":9955.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":9955.61,"end":10002.7,"speaker":"Fr Stephen De Young","text":"But like, so how does that even work? So there is a sense of identity for spirits, but because we've got. We could look at. Not on the demonic side, but like the Archangel Gabriel, the Archangel Michael, the Archangel Raphael, who are named the Archangel Gabriel, appears at multiple points in scripture and gives his name as an identifier, indicating that he's the same spirit that appeared in those other places and did things in those other places. So there is a sense of identity. And remember, as we've talked about on the show, per St. John of Damascus and others, angelic beings, and therefore demonic beings are not truly bodiless."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10003.66,"end":10024.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They have sort of ephemeral bodies. They have spirit bodies. Right. I mean, St. John of Damascus tackles this question by leaving it ambiguous when he essentially says. He puts it comparatively. He says, basically, compared to us, they're bodiless. But compared to God, they are definitely circumscribed. You know, they have a body and."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10024.59,"end":10033.55,"speaker":"Fr Stephen De Young","text":"Mastema and his ilk. Right. If we want to take that real literally, they had human bodies and will again in the resurrection when they're judged."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10033.95,"end":10034.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10034.39,"end":10070.62,"speaker":"Fr Stephen De Young","text":"So there's a body associated with them. Right. In that case, too. Right. But if we look at the ones that are angelic beings who, quote, unquote, fell in various ways, they have some kind of ephemeral body, does that then translate to them having an ephemeral identity? Right. In the same way that their body experiences less finitude, they're still finite because they're created. But less finitude a human body."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10073.58,"end":10073.98,"speaker":"Fr Andrew Stephen Damick","text":"Does."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10074.06,"end":10090.46,"speaker":"Fr Stephen De Young","text":"Is there less finitude to their identity? This is a question I'm not going to answer here, by the way. I mean, I hope you're not hoping for me to like, resolve this problem."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10090.62,"end":10105.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we're. The point of, of all this problematizing, to use good postmodern philosophical language is to point out that that's not what actually really matters."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10106.69,"end":10119.49,"speaker":"Fr Stephen De Young","text":"Right. Angelic and demonic beings, we talk about them as these discrete beings. We talk about them basically as, as invisible humans with wings, let's be honest, either bat wings or bird wings, which they're good or bad."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10119.49,"end":10123.97,"speaker":"Fr Andrew Stephen Damick","text":"This is how they get depicted in art. Because, like, how else would you draw them, you know?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10124.55,"end":10124.79,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10124.87,"end":10160.86,"speaker":"Fr Andrew Stephen Damick","text":"But it's interesting even in iconography, which tends to depict like there's about three or four different colors that they usually get used. So like, there's black, black, like not black as in human black, but black, black, truly black. And then white, truly white. You could see truly, truly white. Like it's Serbian iconography. Often they depict it as very, very white. I've seen green, I've seen brown. Those are less common. But they're almost always depicted as very sort of two dimensional, like there's no substance to them. And they're often smaller than humans too."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10162.06,"end":10162.62,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10162.62,"end":10187.79,"speaker":"Fr Andrew Stephen Damick","text":"So like this, it's an attempt with art to depict something that does not Manifest in the 3D world in the way that you and I Manifest in the 3D world and could be put on a bathroom scale and, you know, eat dinner. Right. So that's art, but we shouldn't materialize the art. It's materializing it enough. Right? Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10190.51,"end":10201.47,"speaker":"Fr Stephen De Young","text":"Yeah. Because I mean, if you want to literalize it, then you say, well, Father Steve, you said earlier the City Sarian says St. Michael is a seraphim. Why isn't he depicted as a snake?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10203.64,"end":10203.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10204.68,"end":10253.04,"speaker":"Fr Stephen De Young","text":"Or the other ways that seraphs are normally depicted. Right, right. That's an over literalization that triggers that question. Right. Because he doesn't have a physical, visible form. Right. When he appears, he appears in some form. Right. But that's an appearance that he is giving. Right. And so if we understand that the way we talk about identity, because again, we only have human experiences. You have never had an experience other than a human experience. Right. You've never had a bat experience, but you've also never had an angel experience. Right. So we have to talk about things in human terms. We have to. Right. That's why God speaks to us that way in the scriptures."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10253.04,"end":10254.73,"speaker":"Fr Andrew Stephen Damick","text":"So we got. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10254.73,"end":10273.73,"speaker":"Fr Stephen De Young","text":"Because that's all we can understand. Right. So it's natural for us to kind of do that. But we have to have this kind of problematization to realize that even when we're talking about things other than human, other than humans, it doesn't necessarily reflect reality accurately."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10273.89,"end":10277.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's an attempt to reach towards it, to do the best that we can."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10278.93,"end":10281.41,"speaker":"Fr Stephen De Young","text":"Yeah. And so that means that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10282.27,"end":10282.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10285.71,"end":10386.21,"speaker":"Fr Stephen De Young","text":"That means that if we understand that our concept of identity applies only in a kind of ephemeral, shifting way to demonic beings. Right. Further, that they're beings of chaos and deception, et cetera, et cetera. Right. But that they. Right. That it applies to them only in this ephemeral, shifting kind of way. Right. That's exactly how the scriptures talk about them. That fits with references to the evil one that kind of play into one of those conceptions, but not. But kind of ambiguously. Right. And this represents a difference, you may notice, between the kind of confident way in which Second Temple Jewish literature even talks about these figures. Like outside the scriptures talks about these figures. They're very quick to say, oh yeah, Azazel, serpent in the garden. That was Azazel. That was Azazel. Azazel's like, this here's what Azazel looks like. Azazel. Azazel. Azazel. Right. Here's how he's going to beat his end. Like a temple literature. Whereas the scriptures, it's the goat spirit of the wilderness. Right. It's much vaguer and more ephemeral. Right. And then human interpreters tend to describe it again in a more human way that more literalizes it and more makes him sort of an evil human with superpowers. He's basically a supervillain."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10386.89,"end":10387.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10387.45,"end":10396.21,"speaker":"Fr Stephen De Young","text":"If you take those Second Temple Jewish literature descriptions literally. Right. He's like brainiac or bizarro or something. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10396.21,"end":10396.57,"speaker":"Fr Andrew Stephen Damick","text":"Like."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10400.09,"end":10402.81,"speaker":"Fr Stephen De Young","text":"Well, he's more of a smooth talker than Pizarro."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10402.81,"end":10403.21,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10403.61,"end":10404.09,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10406.17,"end":10406.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10408.17,"end":10426.12,"speaker":"Fr Stephen De Young","text":"And so that being the case, that means that us trying to nail it down. Right. Which version of the devil is this author in the New Testament or this church Father even trying to talk about here in this place? That's kind of a waste of time."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10426.84,"end":10427.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10427.96,"end":10456.15,"speaker":"Fr Stephen De Young","text":"That's not how and why they talk about the evil one or the devil or Satan or whichever title they're using, they're referring to this evil spirit, the sort of principal evil spirit, Right. That, that, that dominates the world. And so we're not going to. Obviously we're not going to repeat our whole what is a spirit episode."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10456.23,"end":10456.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10456.51,"end":10499.37,"speaker":"Fr Stephen De Young","text":"What is a spirit when it's at home? You can go Listen to that. But to touch on that, right? What are we talking about when we're talking about an evil spirit is we're talking about a kind of collective consciousness, right. Meaning a consciousness that includes other conscious beings within it which has agency. And that agency takes the form of being able to move those subsidiary consciousnesses. Right. So what does that mean? Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10499.37,"end":10499.73,"speaker":"Fr Andrew Stephen Damick","text":"Without."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10500.05,"end":10514.13,"speaker":"Fr Stephen De Young","text":"I don't want to go back and listen to that three hour episode. What does that mean? Father STEPHEN okay, so we'll start with something very clear in like the Synoptic Gospels and Acts, right? Demon possession."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10514.21,"end":10525.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where a demon grabs hold, or demons grab hold of a person and control their body and sometimes even talk through that person."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10526.22,"end":10530.78,"speaker":"Fr Stephen De Young","text":"Right. And so it possesses them. We. We're so familiar with that language, right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10530.78,"end":10531.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10531.06,"end":10534.54,"speaker":"Fr Stephen De Young","text":"This person is possessed by a demon, meaning the demon, like, owns them."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10534.7,"end":10535.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10536.22,"end":10614.4,"speaker":"Fr Stephen De Young","text":"Like has them in its clutches. Has them in its grasp. Right. Is controlling them. That person is still conscious. That person is not unconscious all the time. Right. Couldn't ask for help. Right. Or they wouldn't have people around them asking for help if they were. Right. And we hear it described in that way in the Synoptic Gospels. Right. The Father who says, a demon seizes my son and does this. Right. That means his son was not constantly only speaking as and acting as the demon. Right. That consciousness is still there, but there is this sort of overlapping demonic consciousness that's sort of in the driver's seat that's moving it, that's pushing and pulling and twisting and seducing and filtering and. Right. And so if we start with that, we could see that phenomenon in Scripture, right? Now we take that and we broaden that out to a collective, to a group of people. It could be any size group from a family to a nation. Right. To the world, frankly."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10614.56,"end":10616.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10616.72,"end":10641.21,"speaker":"Fr Stephen De Young","text":"Ruler of this world. Right. And Right. We could see examples. Right. As people, as longtime listeners know, I'm getting tired of always using mid 20th century Germans as the example of bad people. So the Khmer Rouge, right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10641.85,"end":10643.93,"speaker":"Fr Andrew Stephen Damick","text":"Look, it's either 19th century German scholars."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10643.93,"end":10650.61,"speaker":"Fr Stephen De Young","text":"Or mid 20th century Germany Germans. Right? So I'm eschewing both of those. I'm being more creative than that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10650.61,"end":10651.29,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10651.61,"end":10752.11,"speaker":"Fr Stephen De Young","text":"The Khmer Rouge, right. You have a group that is being moved by a spirit to do things that, quote, unquote, individuals, like a person who's a member of that group, if you had talked to them before or you talked to them after, is horrified by and wouldn't necessarily choose to do themselves because they find it horrifying. But when they're functioning within that group, they're driven by something. Something that's more than just the sum of the individual people there. Right. That drives them towards actions. Right. You can see this in sort of outbreaks of things. Even the Khmer Rouge was for a limited time, mid 20th century. German fascism was for a limited time. The Bolsheviks were for a limited time. Whoever we want to pick, right. Cultural revolution in China, whatever example we want to pick at any point. I think frankly, a lot of what happened in the Crusades, like you look at when they got the sack of Jerusalem or the sack of Constantinople in the fourth Crusade. Right. Riots, we have these individual outbreaks of things where we can kind of see, okay, yeah, I see that these people, they get in this riot, they do these horror, they're ashamed of afterwards, they regret afterwards. And that if you'd said to them, hey, why don't you go do this? They would be like, no, I would never do that. Right. But this can also be longer term and become entrenched. Right. In societies and cultures."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10752.27,"end":10756.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It can become cultural traditional, you know. Yes, keep doing it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10756.82,"end":10759.94,"speaker":"Fr Stephen De Young","text":"Cultural tradition institutionalized in law, I mean."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10759.94,"end":10761.54,"speaker":"Fr Andrew Stephen Damick","text":"Or even patterns within families."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10762.66,"end":10763.02,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10763.02,"end":10768.1,"speaker":"Fr Andrew Stephen Damick","text":"Like we've all known families where there's something about them and sometimes it's multi generational."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10769.3,"end":10777.94,"speaker":"Fr Stephen De Young","text":"Yeah. But you look at, you look at like the Roman Empire, right? Pederasty was an institution in the Roman Empire."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10777.94,"end":10778.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10779.86,"end":10821.73,"speaker":"Fr Stephen De Young","text":"Right. You look at the way they treated not just the Jewish people, but any of the sort of natives of conquered lands who didn't have Roman citizenship. That was institutionalized. Slavery was institutionalized. Right. So it wasn't just that there was some spirit in there motivating people to do something, but they were so captured by it that those things just seem normal to them. They didn't even think about them as whether they were bad or good. Right. Like they just were."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10822.13,"end":10822.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10824.13,"end":10857.34,"speaker":"Fr Stephen De Young","text":"They were just facts. Aristotle could look at slavery and be like, no, this is just natural. This is the way things are. Right. So this can be. And it's not always as sort of gross and violent and obvious as like a riot breaking out. Right. It can be very subtle. It can go on for centuries. It can be deeply entrenched. Right. As we've said before, demonic powers are more than willing to play the long game. They live a lot longer than humans."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10859.9,"end":10860.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10860.86,"end":10890.01,"speaker":"Fr Stephen De Young","text":"And to corrupt and to push and to pull and trust me, there are a bunch of them behind. Right. I'm in America, behind United States culture going on right now. You probably don't have to think hard to name them. The ones that are really dangerous, though, are the ones that you can't name because like pederasty or slavery in the Roman Empire, they've been institutionalized so much that you don't even think anything of them. That they're just the way things are."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10890.73,"end":10891.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10891.05,"end":10962.84,"speaker":"Fr Stephen De Young","text":"The ones we'd rattle off. Not that those aren't bad. Right. Like, obviously. Right. The, the pornification of, of American culture. Right. Is, is horrible. Right. And that is a spirit right behind that. Sexual profligacy, violence. Right. There's all kinds of things we could talk about American culture that are obvious to us as Christians, but there are a whole bunch built into American culture that again, we don't even think about. We don't even think about because they're just normal. They're just the way that things are. And that's sort of the ultimate long game demonic delusion. And so when the scriptures and the fathers talk about these spirits, it's not primarily to try to tell us something about the particulars of a spiritual being and be able to identify him. Right. Well, who was the serpent of the guard? Was that the devil? Was that Satan? Was that Azazel? Right. Scriptures never talk about anything for this reasons, frankly. But this either."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10963.24,"end":10963.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10963.56,"end":10968.33,"speaker":"Fr Stephen De Young","text":"It's to help us identify those spirits, to help us discern those spirits."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10970.81,"end":10971.17,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10971.17,"end":10974.17,"speaker":"Fr Stephen De Young","text":"See where they're acting and acting toward our destruction."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10975.53,"end":10975.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10975.89,"end":10981.81,"speaker":"Fr Stephen De Young","text":"Because once we've uncovered that we've discerned what spirit is behind something, that's when we can fight against it."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10981.81,"end":10982.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":10983.37,"end":11010.52,"speaker":"Fr Stephen De Young","text":"So let's, let's reapproach here at the close of, of this episode. Let's reapproach the devils that we've talked about in this episode from, from this perspective, from the perspective that these are spirits that you need to discern at work in the world. So what do we have with the devil? The way we talked about him in the first half?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11010.84,"end":11011.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11011.2,"end":11013.6,"speaker":"Fr Stephen De Young","text":"I mean, rebellion. Rebellion and envy."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11013.6,"end":11014.6,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11015.64,"end":11022.24,"speaker":"Fr Stephen De Young","text":"Right. His envy of humanity. Right. And his rebellion against God."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11022.24,"end":11030.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He rebels basically because of his envy. As it says, the devil fell through. Envy. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11030.24,"end":11041.92,"speaker":"Fr Stephen De Young","text":"And so where you see envy, whether you see it in your own soul, whether you see it in your community, whether you see it in culture at large, wherever you see rebellion, Right. You should discern."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11043.37,"end":11043.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11043.93,"end":11053.41,"speaker":"Fr Stephen De Young","text":"This is the spirit of the devil at work. Right. Look at the Satan the way we talked about him."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11053.41,"end":11054.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The accuser."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11055.85,"end":11062.97,"speaker":"Fr Stephen De Young","text":"Right. What is he about? Slander, condemning others. Right. Finding fault."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11063.69,"end":11064.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11065.13,"end":11066.73,"speaker":"Fr Stephen De Young","text":"Rather than working towards someone's good."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11066.73,"end":11074.9,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting how often these two sets go together. Like someone who's envious of someone else might then slander them."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11075.78,"end":11083.62,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. Yeah, yeah, yeah. That's why there aren't fights between demons, right?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11084.26,"end":11085.46,"speaker":"Fr Andrew Stephen Damick","text":"Not really. Like."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11085.46,"end":11087.78,"speaker":"Fr Stephen De Young","text":"Like they're all after the same thing there."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11087.86,"end":11108.35,"speaker":"Fr Andrew Stephen Damick","text":"It is depicted that way in pagan literature, but that's not what's like. Like the Iliad. Right. You know, you got some Greek gods against some Greek gods. But really the whole point of it is, and you can see this in the text, that it's to get these humans to fight with each other. But the gods are all kind of ultimately okay with each other in the end."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11109.31,"end":11111.27,"speaker":"Fr Stephen De Young","text":"Yeah. Sometimes they flip sides."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11111.27,"end":11111.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11111.67,"end":11112.35,"speaker":"Fr Stephen De Young","text":"Back and forth."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11112.43,"end":11115.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The idea is to get the people."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11115.27,"end":11118.43,"speaker":"Fr Stephen De Young","text":"To keep the fight going. Arm both sides, you know?"}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11118.51,"end":11119.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11119.31,"end":11130.09,"speaker":"Fr Stephen De Young","text":"Let them destroy each other. Or look at Azazel. Right? What's Azazel about? Seduction and sexual immorality. A desire for knowledge at the expense."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11130.09,"end":11132.69,"speaker":"Fr Andrew Stephen Damick","text":"Of morality, secret knowledge, esoterica."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11134.77,"end":11135.97,"speaker":"Fr Stephen De Young","text":"And corruption."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11137.73,"end":11138.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11139.57,"end":11156.62,"speaker":"Fr Stephen De Young","text":"Again. Look at our contemporary culture. Look at what science is doing. Look at sexual immorality. Right. Running rampant. Right. Like these are spirits at work."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11157.66,"end":11158.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11158.02,"end":11160.54,"speaker":"Fr Stephen De Young","text":"We need to be able to identify them and resist them."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11161.18,"end":11161.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11164.3,"end":11176.1,"speaker":"Fr Stephen De Young","text":"Mastema. What's mastema all about? Well, mastema doesn't have a body. Right. He's a parasite. Right. Parasitism."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11176.26,"end":11177.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11177.02,"end":11185.38,"speaker":"Fr Stephen De Young","text":"He's about leeching off of what is right. Not well, because he can't. But not creating something."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11186.1,"end":11186.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11187.06,"end":11202.11,"speaker":"Fr Stephen De Young","text":"Not building anything. Those things that God created humanity to do. Put things in order and fill them with life. No. Leech off of them. Break them down. Right. Belial, obviously. Lawlessness."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11202.43,"end":11202.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11204.43,"end":11215.15,"speaker":"Fr Stephen De Young","text":"Lack of discipline, lack of self control. Lack of any control. Right. Go to the monsters."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11216.03,"end":11216.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11216.39,"end":11250.66,"speaker":"Fr Stephen De Young","text":"Leviathan and Behemoth. On one side you've got chaos and destruction. Right. On the other side you've got tyranny. Right. Order at the expense of life. We've got to be able to discern that. Again, first of all, within ourselves, in our families and our communities, resist it and fight against it. That's the point of talking about and identifying the Evil One. To help us find him when he's at work, not to give us some esoteric information about his identity."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11253.25,"end":11934.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I feel like we get back to this theme a lot, you know, like the show is not about weird spiritual esoterica. Although, you know, I don't blame someone who that that's what they came for. Right. If you're here for that listener, welcome. But God willing, we have executed a good bait and switch here. You know, not that we ever lied to you, it's really that we're pretty upfront about what it is we're doing. So for my final thoughts about this episode about the devils, I thought I would read from Ephesians chapter six, because I think this is super relevant. So I'm going to start with verse 10 and go through verse 20. St. Paul says, finally, be strong in the Lord and in the strength of his might, put on the whole armor of God that you may be able to stand against the schemes of the devil. For we do not wrestle against flesh and blood, but against the rulers, against the authorities, against the cosmic powers over this present darkness, against the spiritual forces of evil in the heavenly places. Therefore take up the whole armour of God that you may be able to withstand in the evil day. And having done all to stand firm, stand. Therefore, having fastened on the belt of truth, and having put on the breastplate of righteousness and as shoes for your feet, having put on the readiness given by the gospel of peace in all circumstances, take up the shield of faith with which you can extinguish all the flaming darts of the evil one, and take the helmet of salvation and the sword of the spirit, which is the word of God, praying at all times in the spirit, with all prayer and supplication. To that end, keep alert with all perseverance, making supplication for all the saints and also for me, that words may be given to me in opening my mouth boldly to proclaim the mystery of the gospel for which I am an ambassador in chains, that I may declare it boldly as I ought to speak. I picked this not just because, I mean, if you listen to this, obviously there's a bunch of references to things that we just talked about. Not only is there, you know, the devil, but also these various demonic forces he talks about, even references the flaming darts, the evil one, that's the Reshef. I can't even remember which way it goes anyways, the dart throwing guy with the plagues and stuff. But what to me is really important about this is he's giving practical instruction here to the Ephesians. He's again, he's not just giving a kind of demonology, like here's a big list of demons, you know, how can you identify them or whatever. The point is to be in the fight, to be ready for battle, right? And first of all, this underlines the true nature of spiritual warfare. As he says, we do not wrestle against flesh and blood, but against the rulers, authorities. This Present darkness, spiritual forces of evil in the heavenly places. I don't think we can underline that point enough because number one, the world is pretty crazy right now. Now I've been alive long enough to know, to recognize that the world has always been crazy. Now I'm not going to claim it doesn't get better and worse. It definitely gets better and worse. And maybe we're on a worse swing right now. I don't know. I don't know. I do know that for a lot of people it feels that way, right? And when it feels that way, that means we're going to act that way, we're going to respond that way. Okay? One of the ways that people are responding to the sense that the world is getting nuttier and nuttier, that we live in clown world, right? That there's more and more darkness. One of the ways that people respond is by attempting to expose it. As though the exposing of it is what it means to fight this battle right now. I'm not saying that evil and corruption should not be exposed. I'm not saying that. I'm not saying that at all, right? If there is a way to bring justice, it should be brought. But the simple fact of protest, right, of, of making expose a kind of religion to itself, right, this often, I think appeals to frankly, the spirit of Azazel. It's a desire for secret knowledge. Look, I know what's really going on in the world. I have it. I have the knowledge that no one else sees. You know, wake up sheeple. This is very common now. It's very, very common. Cursing the darkness, frankly. But what you don't see St. Paul saying here is that that's the way to go. Again, I'm not saying that evil should not be exposed and dealt with. You know, if you can do something about evil, you should do that thing. If you can do something about it, like if you can make something right that has been made wrong. But what he does focus on here is what it means for each of us to actually fight against the darkness. This present darkness, as he uses the phrase. And of course that was a very famous. Well, Frank Peretti was mentioned already. That was the name of his big best selling book. He says to put on the whole armor of God. He talks about the belt of truth, the breastplate of righteousness, the shoes that are about the readiness of the gospel of peace, the shield of faith, the helmet of salvation, the sword of the spirit, which is the word of God. Praying at all times in the spirit, he says with prayer and Supplication, keeping alert with perseverance, praying for the saints. This is about the things that you do. This is about your actual personal spiritual life, which anybody can complain about bad things going on in the world. I mean, and you can make a lot of money doing it, frankly. There are whole industries based on this. But what it means to actually engage in spiritual warfare is fighting against the demons by living in this faithful way, right? Living for truth, living in a righteous way, preaching the gospel, becoming more faithful, knowing the scriptures, knowing the Lord Jesus Christ better and better, being serious about prayer for other people. Like, these are the things that actually are the front line of the spiritual battle. It's very tempting to feel like getting out into the public conversation about whatever is the hot thing right now is to feel like that's the front line. Like, look at me, I'm out there. I'm a big warrior. But if you're not doing anything in your heart, if you're not actually increasing your faithfulness, if you're not actually loving your neighbor, right? If you're not actually helping the people next to you and you get out on that line, I'm sorry, but you get shot in the first five minutes, you're not actually fighting against the enemy. You're getting massacred by the enemy. Because you're walking out there without the whole armor of God. You're getting wasted, you know, destroyed the demons. You're easy picking. You're easy picking. So that's why St. Paul says this is to really, really become serious about the Christian life. And it's not just something you do in your closet. It's about active love for your family, for your neighbor, for your fellow parishioners, right? This is about the 3D stuff. Anybody can be a complainer. And maybe someone's really good at complaining. Maybe they're really good at finding out all the bad things that governments and whoever else are doing. I mean, you know, news flash, governments are doing bad things, doesn't mean it's okay. But it has been kind of going on as long as humans have had history. We see that in scripture. We see that throughout history. But the point of talking about devils, the point of talking about evil spirits, is not so that we gain some esoteric knowledge. This is not esoteric knowledge, actually. This is. Most of it's simply written there in Scripture. So it's just a matter of reading what's there. It is the most available book in the world. Okay? It's not a secret, you know, this is not something that only the really Illumined know about. This is public. This is available for all. And where it actually hits the road is in the daily struggle to live as Christians. The daily struggle to live as Christians. So if you really want to make a difference in the world, follow what St. Paul says here in Ephesians chapter 6. If you really want to do battle against the enemy, you really want to give a beat down to the demons. Love your neighbor, including your neighbor who does and says things that are bad, including them, especially them. After all, the Lord Jesus said, love your enemies. And by that he means other humans. That wasn't an option. He didn't say, you know, if you're a super duper saint, you can love your enemies. He says, love your enemies. Bless those who curse you, do good to those who hurt you. This is the ethic of Christ. And the real spiritual battle is fought by putting on the whole armor of God and taking up these weapons. We don't fight as the world fights, as the Lord says, my kingdom is not of this world. And so we need to take on the tools, the weapons, the armor that are not of this world and stop wasting our times with the ones that are of this world. It's a waste and it can even be harmful to us and to other people. So that's what I have to say about that."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":11939.84,"end":12130.41,"speaker":"Fr Stephen De Young","text":"So to kind of continue the metaphor, I said something similar to this way back in the long ago time. I think my memories are vague and I don't go back and listen to the show. But one of the real dangers of not understanding spiritual warfare like Father Andrew was just talking about, or even denying that the spiritual world is real, is that it's sort of like trying to walk through a battlefield wearing a blindfold. Right? No matter how much you refuse to see it or acknowledge it or try to believe it doesn't exist, it's still a battlefield and you're not going to last long. And so I think this idea that we talked about here at the end of the episode of discernment, discerning the spirits, which is actually all through the New Testament, testing the spirits. There's an important one that we've, I think, mostly lost sight of in modern world. And as I said during that section, this really needs to start with ourself. This is echoing some of what Father Andrew just said. We're very good at, actually. Well, I should say very good. We're better at identifying these things out in society, out in culture. The farther they are from us, the farther it is from me, the better I Am at identifying it. But when it comes to inside myself, that's where things get hazy. And the reason I say we've gotten really bad about at it and forgotten it is, let me talk to all my fellow people who identify as Christians here. Stop blaming the Holy Spirit for your garbage. It's blasphemy. When you say, I was led by the Holy Spirit to do blank and you're wrong, which you usually are, it was usually your idea and your decision. You are committing an act of blasphemy against the Holy Spirit. You can look up how serious that is, right? If you preach, stop saying, well, I was gonna talk about something else, but the Holy Spirit led me to say this because I can't count the number of times I've heard someone say that and then, for example, make a basic factual error about the Greek that they're talking about, which means, guess what, Charlie? The Holy Spirit didn't tell you that error. Okay, you changed your mind about what you want to talk about. That wasn't the Holy Spirit. Not only have we lost the idea of discerning the spirits, we now just stamp our own decisions and our own ideas with the Holy Spirit. Maybe because, I don't know, we were praying about something when it occurred to."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12130.41,"end":12130.69,"speaker":"Fr Andrew Stephen Damick","text":"Us."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12133.18,"end":12186.36,"speaker":"Fr Stephen De Young","text":"Or just as a way of speaking, right. The Holy Spirit is God. Stop blaming God for your garbage. What discerning the spirits means is when I talk about inside myself, as we've talked about before on the show, my thoughts don't come from me. I don't generate them. They come into my head from outside, just like sights or sounds or smells. And then I have to discern them. I have to examine them, My thoughts, my attitudes, my ideas, my motivations, and say, what spirit is this movement within me coming from? Is it coming from the Holy Spirit, or is it coming from some other."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12186.36,"end":12186.88,"speaker":"Announcer","text":"Spirit."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12188.72,"end":12217.13,"speaker":"Fr Stephen De Young","text":"Including my spirit? My spirit is not the Holy Spirit. And I need to follow the Holy Spirit, not mine, because mine is too subject to influence from those other ones and mine is sinful in a variety of ways. Rather than analyzing our actions, we try to stamp them with divine authority."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12219.13,"end":12219.41,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12219.41,"end":12460.32,"speaker":"Fr Stephen De Young","text":"We'Re not even used to thinking this way. We're not even used to taking a step back. A good place to start, to be practical. A good place to start with this is at the end of the day. I think this is one of the reasons why Christians have always had evening prayers. Well, frankly, God's people have had evening prayers going back to the tabernacle, going back to Exodus, going back to the Torah. Because that's a point at which you can take stock of the day. You can look at the things you did, the things you thought, the places where you paused and thought and dwelt on certain thoughts and ideas, the things you didn't do, the things you avoided doing, responsibilities you didn't live up to. And you could start to sift through them. Start to sift through them and say, where are the things where God blessed me? Maybe God came in and stopped me from doing something I shouldn't. And that was the movement, right? That was the push. It was a push in the right direction, away from something bad, or push in the right direction to do something good. Those it's okay to give credit to God. Those you should give credit to God. And where are the places where I was doing my own will, or maybe where I was even being shoved by something else in the wrong direction or away from the right direction? Then once you've gotten used to doing that, at the end of the day, retrospectively looking back at things, the more you do it, the better you'll get at it. And then you'll start being able to do it a little better in the moment when the idea pops into your head before you act on it, before you speak, you pause and think, where did that just come from? Why is that here? Is that something I want to keep around or something I need to toss out? And the more you do that, the better you get at that. And then you can start doing it aimed toward the future. Then you really start to recognize the spirit of God when he's acting in you, when he's acting in your family and your community, the world, you'll start to recognize them and you can start acting to try and get on board. Here's where I see the spirit moving in some direction I'm gonna follow. Here's where I see some other spirit moving, including my own. I need to resist that. I need to push back on that. I need to get away from that. You can't do any of this non deliberately. None of this will start happening by accident. This only happens when we make a conscientious effort to pursue it, to work on it, to get better at it, try to sift and sort out these things. And we can do what St. Paul says. We can cling to what is good, we can flee from what is evil. Maybe it's because we've been taught for so long that you're not supposed to judge. We're not supposed to make you know there's a difference between discriminating against people and discriminating between good and evil. There's a difference between judgment and discernment. Maybe it's because we've been taught so long we're not supposed to do those things that we don't bother. But we're being led into destruction."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12462.72,"end":12463,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12463,"end":12514.04,"speaker":"Fr Stephen De Young","text":"We'Re blaming God for things and failing to give him credit for things all along the way. So this should be a call again, not to try to construct a cool demonology, not to get cool AI sketches of the different devils we talked about, but to actually start pursuing what we're called to and what all of these references in the scriptures and outside are really calling us, to start learning how to discern, start learning how to see spiritually what's going on in us and around us, and through some disciplined effort, get good at clinging to what is good and fleeing from what is evil."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12518.6,"end":12551.02,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that wraps up our episode on the devils. Thank you very much for listening, everyone. We'd like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page. You can also leave us a voicemail@speakpipe.com LordOfSpirits God willing, we'll be back live for our first July episode. So that'll be coming up. If you have basic questions about Orthodox Christianity or you need help to find a parish, we highly Recommend going to orthodoxintro.org and join us for our live."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12551.02,"end":12561.58,"speaker":"Fr Stephen De Young","text":"Broadcasts on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. I watched with glee while your kings and queens fought for 10 decades for the gods they made."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12563.26,"end":12576.39,"speaker":"Fr Andrew Stephen Damick","text":"If you are on Facebook, which Father Stephen is not, you can follow our page. You can also join our discussion group. Leave ratings and reviews wherever you get your podcasts. And please share this show with a friend who's going to benefit from."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12577.43,"end":12588.39,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. I laid traps for troubadours who get killed before they reach Bombay."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12589.19,"end":12591.75,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless."}
{"episode_id":"LOS - #095 - 2024-06-27 - The Devil(s)","start":12593.99,"end":12631.21,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen de Young, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
