{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":0.56,"end":65.17,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":67.57,"end":189.08,"speaker":"Fr Andrew Stephen Damick","text":"Good evening everyone. A blessed feast of the Ascension to you. This is our 20th episode. Welcome back to the Lord of Spirits podcast where we walk in the footsteps of, well, no, not giants. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And my co host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And if you are listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346 and Matuska Trudy will be taking your calls tonight and we'll get to your calls in the second part of today's show. So like I said, the Orthodox Church just began its celebration of the great feast of the Ascension of our Lord God and Savior Jesus Christ. And that is what we're going to be discussing tonight on the podcast. As we saw last time with the resurrectional appearances of Christ, many treatments of his ascension also treat it as little more than an epilogue to the action of the crucifixion and resurrection. Some more diligent orthodox examinations of the Ascension show how this feast demonstrates Christ's divinity and also how he elevates humanity to sit even upon the throne of God. Tonight we are going to look at the ascension, especially as it culminates in the enthronement of Christ. And we're going to start with footprints. Now, we're not talking about the popular footprints in the sand poem, nor about the variation that notes that the sand people ride in single file so as to hide their numbers. It turns out that within or just outside numerous temples for worshiping various gods throughout the earth, there are examples of something called a petrosomatoglyph Everybody look that up on Wikipedia right now. What is that? What is a petrosomatoglyph? Well, it's usually a footprint carved into rock. So, Father Stephen, take us back over 3,000 years to Northwestern Syria to a ruined archaeological site called Ayindara."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":191.08,"end":199.09,"speaker":"Fr Stephen De Young","text":"So, yes, today's secret word is petrosomatoglyph. So kids, whenever anyone says petrosomaticly, scream really loud."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":199.65,"end":202.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I caught that one. I caught that reference."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":204.61,"end":204.97,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":204.97,"end":207.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Footprints."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":208.05,"end":211.05,"speaker":"Fr Stephen De Young","text":"Yeah. Well, technically there are a variety of petrosomatic."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":211.05,"end":213.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. There's various shapes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":213.65,"end":216.13,"speaker":"Fr Stephen De Young","text":"Any body part carved into rock."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":216.45,"end":240.38,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And I have to say, I have to take credit right now because I posted pictures of gigantic footprints in our Lord of Spirits Facebook group yesterday, and everyone believed that we were going to be talking about giants. And so I just have to say that I'm very, very proud of myself because. Totally threw them off."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":241.02,"end":244.78,"speaker":"Fr Stephen De Young","text":"You've also deeply disappointed the Sasquatch enthusiasts."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":244.78,"end":256.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. There were several people who wanted to talk about Sasquatch, and I'm like, you know, Sasquatch, as big as he is, does not have meter long fe feet, because that's, that's the size of footprints we're looking at. Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":256.76,"end":264.52,"speaker":"Fr Stephen De Young","text":"Which is about three times human size. So that would make it the footprint of something about 15ft tall."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":264.84,"end":272.52,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Yes, yes. But not a giant. Not a giant."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":272.84,"end":273.88,"speaker":"Fr Stephen De Young","text":"Close, though."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":274.28,"end":274.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":274.92,"end":301.79,"speaker":"Fr Stephen De Young","text":"Right, right. So the most common kind of petrosomatic glyph is footprints. Right. As you were saying. And you find these outside of temples across time and across the globe. So we have a couple examples. And the one you mentioned to start out with, that's at Ayindara, which we're."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":301.79,"end":309.56,"speaker":"Fr Andrew Stephen Damick","text":"Assuming that's the pronunciation, I don't know, hanging around Arabs. I'm assuming it's Ayn or something like that, but I can't do that too many times."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":309.8,"end":317.96,"speaker":"Fr Stephen De Young","text":"And we're going to do an Asian language in a minute too, and we'll totally get that one wrong. But like, like the Lutherans say sin boldly. Right. Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":318.28,"end":326.28,"speaker":"Fr Andrew Stephen Damick","text":"Well, plus there's no speakers of those languages, you know, actually around to correct your pronunciation. So they're all gone. So we can guess."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":327.24,"end":334.72,"speaker":"Fr Stephen De Young","text":"Well, maybe, maybe. I found that the modern people descended from those people are still pretty particular about how you pronounce things."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":334.72,"end":335.96,"speaker":"Fr Andrew Stephen Damick","text":"Yes, they do have some opinions."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":336.9,"end":337.14,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":337.14,"end":340.58,"speaker":"Fr Andrew Stephen Damick","text":"About how their language should have been pronounced 3,000 years ago, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":340.66,"end":355.7,"speaker":"Fr Stephen De Young","text":"So the site in Ayindara has unfortunately now been destroyed in the current Syrian civil war. And we're not going to get into who did it or why? Because there are conflicting reports."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":356.26,"end":356.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":357.14,"end":396.3,"speaker":"Fr Stephen De Young","text":"But in the process, it's been destroyed. But it was fairly well documented before that. And there are lots of photos online and other places where you could see the remains of the temple and the giant carved cherubim and all of those things. But one of the prominent features were these two footprints. Right. A right and left footprint at the entryway to the temple sanctuary proper that, as you mentioned, are about a meter long, about three times human size."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":396.54,"end":396.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":396.94,"end":403.42,"speaker":"Fr Stephen De Young","text":"And this is a temple to our old friend baal. Yes, or baal."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":403.9,"end":407.86,"speaker":"Fr Andrew Stephen Damick","text":"And. And this is the baal, like BAAL Haddad. Right? Is that the one?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":407.86,"end":408.82,"speaker":"Fr Stephen De Young","text":"Yes. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":408.82,"end":409.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":409.22,"end":409.66,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":409.9,"end":416.06,"speaker":"Fr Andrew Stephen Damick","text":"Which doesn't mean, like, he's some guy named. Because, like, Hadad is a very common surname in the Middle east these days."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":416.22,"end":416.78,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":416.78,"end":417.3,"speaker":"Fr Andrew Stephen Damick","text":"Differently."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":417.3,"end":421.54,"speaker":"Fr Stephen De Young","text":"It's not actually related, but yeah, yeah. This is the Ciro Hittite bale."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":421.94,"end":422.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":422.3,"end":448.14,"speaker":"Fr Stephen De Young","text":"If you want to be, if you want to get fancy, there is, There is a whole book I just discovered and just ordered. This shows you the things that show up on my reading list. That is just a catalog of all the different names for BAAL arranged in a flowchart of, like, hierarchy of places over time. Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":448.46,"end":454.22,"speaker":"Fr Andrew Stephen Damick","text":"Now this is one to read out loud, you know, when you've got people over and you're sitting around the fire relaxing. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":454.3,"end":481.91,"speaker":"Fr Stephen De Young","text":"This is an ideal book, like to take on an airplane when I don't want to be talked to because they say, hey, what you're reading, and then you show them, and then you can fly in silence for the rest of your trip. But so, yes, this is that bail out of the bales. And this, this temple was built around the late 11th, early 10th century BC. Yeah. And what."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":482.87,"end":485.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say 3,000 years, plus or minus."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":485.75,"end":490.87,"speaker":"Fr Stephen De Young","text":"Right. And, and the foundations and the base and everything. So we could see the layout and all that were intact."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":491.19,"end":491.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":491.59,"end":499.15,"speaker":"Fr Stephen De Young","text":"And part of what made it so important was that within about a hundred years or so of Solomon's Temple."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":499.94,"end":521.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. And if people want to take a look and see what this looks like while you're listening, you can go to Wikipedia and look up Aindara A I n space D A R A and, and click the, the, the. The article that says archaeological site, and you'll see some really great pictures of the place that we're talking about right now. Including the footprints."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":521.94,"end":560.19,"speaker":"Fr Stephen De Young","text":"Yes. But now, to give you an idea, since I claimed these were across time and all around the globe, if you go to Bagan, I'm guessing That's how it's pronounced. Which is in Myanmar, AKA Burma. Right. Bagan is one of the holy cities there, which contains several temples. And at one of them, right at the entryway to the small shrine, it's a Buddhist shrine, is carved into the stone the right footprint of the Buddha."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":560.91,"end":570.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. And. And also, again, there is a Wikipedia article called something like Buddha's footprints or something like that, which is. That's kind of fun."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":571.15,"end":579.47,"speaker":"Fr Stephen De Young","text":"Yeah. And that's from the 11th century AD, so we have kind of a symmetry there. That's from the other side of the globe, from northeast Syria."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":579.79,"end":580.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":583.22,"end":617.43,"speaker":"Fr Stephen De Young","text":"So why do we have these outside temples? Well, these footprints sometimes joined with other footprints in the temple itself and other depictions, whether in statuary or in frescoes or bas relief or what have you. Carvings in the walls trace a path that was walked by the God or divine or semi divine being, or in the case of Buddha, enlightened being."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":618.15,"end":618.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":619.11,"end":628.15,"speaker":"Fr Stephen De Young","text":"From the entrance of the temple structure to the place where they were seen to be sitting."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":629.11,"end":629.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":629.47,"end":633.8,"speaker":"Fr Stephen De Young","text":"That covers both the Buddha and Bail and whoever else."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":634.44,"end":704.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I think it should be noted that especially if you start looking around for these things and you look at pictures of them, in some cases they are very realistic looking in terms of actually shaped like a human foot, although, again, very big. And then in other cases, they're very stylized. Right. And in some cases, it seems like the locals are saying, no, this is where this God or, you know, demigod walked. This is an actual footprint that was left in the rock by this being. And in other cases, like, especially the stylized ones, you can see, like, no one is saying that. Right. It is. It is. It is deliberately made to be, you know, beautiful or symbolic or whatever. And it's. It's a footprint. They made a footprint in the rock, either, as you said, right outside the temple or inside the temple. So there's some variation on this point as to whether or not there's a claim of some kind of divine intervention that happened at that particular place. Right. So that's another kind of important point."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":704.46,"end":707.42,"speaker":"Fr Stephen De Young","text":"I think, also some people just have weird feet, man."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":708.86,"end":718.02,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Maybe in some cases. Yeah. The Buddha has a. A foot that has, like, flower petals and stuff you know, engraved in it. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":718.02,"end":718.54,"speaker":"Fr Stephen De Young","text":"Never know."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":719.18,"end":719.98,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":720.46,"end":746.21,"speaker":"Fr Stephen De Young","text":"So. Yeah. And so. Well, why. Why would this be embedded, like, in the temple structure? Right. Why would you. Why would you do this? And it's because we tend to think of temples in very modern American terms. We think of them as, like, worship spaces. Right, right. So you. We're going to do this worship activity."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":746.61,"end":747.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":747.89,"end":777.3,"speaker":"Fr Stephen De Young","text":"Even if we have kind of a concept of ritual, we're going to do this ritual activity and we need a space that will hold the number of people we're going to have. And then we need certain objects to actually do the thing. And that's how we think about the space. But that, of course, wasn't the case in the ancient world. In the ancient world, the space itself is, is part of the ritual and part of the liturgics. Right, right. So it's not just a question of capacity and accoutrement."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":777.54,"end":777.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":777.86,"end":784.66,"speaker":"Fr Stephen De Young","text":"It's a question of how, how, how is what we're doing embedded in the structure itself."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":784.82,"end":885.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, and you know, we still have that concept. Right. So like, if you walk into a theater, it's designed to make theater possible. Right. Or if you walk into a basketball arena and you see the basketball hoops up there and, you know, the kind of flooring that's down there and the seating that's around it, all these things are designed to make basketball possible. It's not just, okay, we need a space to play this game in. The, the space and the way it's set up is designed for what's happening. Right. So it's, you know, it's. It's not like we don't have that concept. And it's interesting. I mean, this is kind of a rabbit trail somewhat, but it's interesting to look at, for instance, where there's actually a book which I've never bought, but I think I kind of get the point from just the title. The book is titled When Church Became Theater. And it's basically about how church architecture altered in the last couple of hundred years in many places from the traditional church architecture to a theatrical style space. And what that says and does with regards to the kind of thing that happens inside that particular place. So this is something that we know, but it's not something we tend to think about when it comes to religious practices these days. It's mostly about, like you said, capacity and decoration, you know, rather than a sense of setting up the space to do a particular thing in it. And, you know, and, and it's designed for that. It's part of the ritual itself, as you put it, which I think was a good way of putting it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":885.47,"end":888.51,"speaker":"Fr Stephen De Young","text":"Right. This, the space itself is doing part of the thing."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":889.23,"end":890.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":891.31,"end":930.21,"speaker":"Fr Stephen De Young","text":"It's. It's doing its part in, in the thing that's being done by the, by the ritual. And so this sort of Path traced using these footprints and using generally also the, the image of the God is setting up for what's going to be happening there. So that path is the path that the God or the divine being walked in order to go to bed enthroned after having achieved some kind of victory."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":930.93,"end":931.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":931.49,"end":939.17,"speaker":"Fr Stephen De Young","text":"And that's the broad strokes, because we're trying to be broad. So we include both BAAL and Buddha. Right, that's the alliterative."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":939.57,"end":942.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes, they don't."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":943.73,"end":955.72,"speaker":"Fr Stephen De Young","text":"But both of them walked a path, achieved a kind of victory and then ended up seated at the back of the shrine. Right. And, and portrayed in that way."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":957.16,"end":957.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":958.36,"end":970.52,"speaker":"Fr Stephen De Young","text":"And so, yeah, so there's, there's a variety of different forms that that victory can take. Right. So if you're talking about a Buddhist temple like in Myanmar, you're talking about achieving enlightenment. Right, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":970.52,"end":992.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And you go in there and you've got, and you see the Buddha, an image of the Buddha and he's in his enlightened state, you know, sitting in the load, not, not that I'm an expert in Buddhism, but he's sitting in the lotus position. And, and you know, often has this sense of this is the, this is not the Buddha as he's going through his struggle, this is the Buddha after he's achieved enlightenment, you know."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":993.68,"end":1011.95,"speaker":"Fr Stephen De Young","text":"Right. And so in the ancient world that we're talking about in the ancient near east in particular, so the, the, the world that the scriptures come out of, it was not quite so placid and it was not sort of a spiritual victory in that sense."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1012.19,"end":1013.07,"speaker":"Fr Andrew Stephen Damick","text":"No, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1013.63,"end":1017.07,"speaker":"Fr Stephen De Young","text":"It was much more blood and guts sometimes, literally."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1017.47,"end":1089.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And you know, we've talked, of course, especially in our, some of our earliest episodes and I think we've alluded to it since then, but we've talked about what's called the succession mythology. Right. And just to kind of recap what that is, that's in many mythologies you have, you know, a most high God and then there's some lesser God who goes and kills the most high God to send himself up as that. Sometimes it becomes a little bit more complicated where you've got a father son pairing that are in place and another, you know, goes in to set his own dad up on the throne and have himself as his, you know, right hand man. And, and that's what's being talked about with baal, Right, that this is his defeat, as we've mentioned in the past of Yam and Nahar, the ocean and river gods. So he defeats them, he walks this path and he goes and is enthroned. And when, you know, we were talking about this during the. Our prep period, I was reminded of playing Warcraft 3, the Frozen Throne expansion, where the bad guy, you know, although you're playing the bad guy, if I remember correctly, it's been some years."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1090.71,"end":1096.95,"speaker":"Fr Stephen De Young","text":"Arthas is the champion you're playing there, and you sort of. He sort of falls and becomes possessed by Ner', Zhul, the Lich King."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1098.95,"end":1118.89,"speaker":"Fr Andrew Stephen Damick","text":"And at the very end, the last thing that happens in the game is him having defeated all of his enemies, he sits down and is enthroned and he's now, you know, the guy in charge. I mean, this is a trope. You see it in a lot of literature, a lot of movies. Right. You know that when someone wins, they go and sit on the throne and that means that their authority has been set up."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1119.13,"end":1121.57,"speaker":"Fr Stephen De Young","text":"Right, right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1121.57,"end":1121.93,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1122.01,"end":1133.59,"speaker":"Fr Stephen De Young","text":"And sometimes it's not so much they're having to fight the last most high God and given the boot. Right, right. And replace them. Sometimes they're. And even BAAL is a little bit that bail kind of mixes the."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1133.74,"end":1134.14,"speaker":"Fr Andrew Stephen Damick","text":"The two."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1135.42,"end":1138.7,"speaker":"Fr Stephen De Young","text":"But a lot of sometimes it's what's called chaos. Kampf."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1138.86,"end":1142.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Another word for everyone to. This is today's second secret word."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1142.58,"end":1150.62,"speaker":"Fr Stephen De Young","text":"Our German word for today, chaos Kampf. Straight from the 19th century. Our favorite people over there in Germany in the 19th century."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1150.62,"end":1163.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. Kampf means struggle. Right. You know, which. You know, probably a lot of people know that word, Kampf, because it's the title of an autobiography by a certain very horrible person. Mein Kampf. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1163.39,"end":1168.99,"speaker":"Fr Stephen De Young","text":"But chaos conf's poor. Really poorly written too. Like, it's not even like. Yeah, anyway."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1169.31,"end":1171.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, writing was not his forte."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1172.11,"end":1174.75,"speaker":"Fr Stephen De Young","text":"I knew he was in jail. Anyway."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1175.71,"end":1210.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So chaos comp. The struggle against chaos. And that's basically a God versus a chaos monster. Right. So there's. And this. This takes lots of different forms and different kinds of mythology. Right. So you've got Odin with his brothers VI and V. They go up against Emir, who is this sort of primeval giant. They take him out. In Greek mythology, you've got Kronos, who takes out Uranus, or Uranus, who is sort of like the heavens, you know, and then. And then in Babylonian, you've got Marduk versus Tiamat, who is a big dragon."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1210.99,"end":1213.31,"speaker":"Fr Stephen De Young","text":"And kind of his. Kind of his mom."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1213.71,"end":1215.27,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, that's. Yes, that's."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1215.27,"end":1218.59,"speaker":"Fr Stephen De Young","text":"How you going to kill your own mom to make. That's so weird."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1218.83,"end":1241.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. Yes. Right. So like, as you said, it's sometimes this, this, this chaos conf results in the creation of the world or the creation of humanity or in some cases both. In the Norse one, it ends up. It results in the destruction of most of the giants. There you go, everybody. But when I think it's blood comes out of Ymir's toe and floods the."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1241.03,"end":1248.04,"speaker":"Fr Stephen De Young","text":"World, though usually, usually when it does create the world, slash, humans, especially the humans are sort of an accidental byproduct."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1249.07,"end":1249.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1249.55,"end":1253.07,"speaker":"Fr Stephen De Young","text":"It's like, oops, I did it again. I made humans."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1254.43,"end":1261.15,"speaker":"Fr Andrew Stephen Damick","text":"That may be our first Britney Spears reference. That's good. Could be first, maybe last, never again."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1261.79,"end":1262.11,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1262.11,"end":1273.55,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there's this notion of chaos conf that sometimes is what precedes this. Walking the path to enthronement. Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1273.79,"end":1326.16,"speaker":"Fr Stephen De Young","text":"And so that's being traced there in the, in the physical space. Right. Of the, of the temple in order to assist with the sacrificial ritual that's going to take place there and to play a part of it. And so, yeah, as, as a reminder with our sacred geography. Right. The reason you would have this traced into the physical space is that when the ritual is in process, that space and that time becomes the space and time of the enthronement of the God, of the victory and enthronement of the God. And this is what's being reenacted in sort of your typical, your typical pagan ritual."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1326.64,"end":1327.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1327.76,"end":1362.62,"speaker":"Fr Stephen De Young","text":"So we've talked about sort of the breakdown of the liturgics of sacrifice in one of our previous episodes on sacrifice. But in terms of what is being participated in and you're just day to day pagan sacrifices that you're doing on a day to day basis. It's this sort of recapitulation of that victory and enthronement being reenacted and participated in again and again."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1362.78,"end":1483.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. And why. So why would the community want to do that? Well, if you remember what we talked about when we talked about sacrifices, so we had an episode called Eating with the Gods, we talked about sacrifices. You know, the point is that you're making the God part of your community. You're offering the God hospitality. Especially in the most ancient versions of paganism, that God is considered local to you. So why would you keep recapitulating, participating in not exactly reenacting? Because again, the understanding is this is happening in a sense now by doing this ritual. Why would you do that over and over again? Well, it's basically like, you know, welcoming dad home, so to speak. Right. You know, it's, it's recognizing the authority of your God, it's welcoming him. It's, it's, you know, often there's a lot of flattery and stuff that goes along with it, but it's, it's really this, it's, it's this affirmation of his authority within your community and his, his, his ability to bind everybody together. Right. So enthronement is not just like, oh, you won, you got the throne. It's, it's really, that's the center of the community's life is the throne of the God. Just as a throne of, you know, your local warlord or your king or whatever becomes the focal point of the community. Right. So that's why this is part of the daily normal sacrifice. You know, it's not a special occasion in that sense. In the sense that this is something that, you know, only happens once in a great while. It's something that you're doing all the time. They're constantly recapitulating, constantly reaffirming the authority, the victory, the enthronement of their God. And so that's why these temples are set up this way with these footprints and other things that are involved as well. And you know, part of it is to keep him pleased. Right, here's your big chair. Oh, thank you."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1483.42,"end":1524.79,"speaker":"Fr Stephen De Young","text":"Right. You're participating in his alleged victory. So you're saying, yeah, Bale, you totally won, man, you totally won. Totally the best. You're great. Right? Yeah. And this understanding, here's, here's a place in the scriptures where this understanding lies behind sort of what seems like an offhand comment, right. In Pergamon or Pergamos, depending on the era in which you're talking about the city, there was on the, at the top of the acropolis in the city. So at the highest point in the city there was a gigantic great altar to Zeus."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1525.69,"end":1525.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1526.41,"end":1557.44,"speaker":"Fr Stephen De Young","text":"And it's now in the University of Berlin. But the reason it's at the, the University of Berlin Museum is that it has these incredible sculptures, like human sized sculptures on the side. It is this massive thing with massive steps leading up to the, the top of it. And depicted in those sculptures is the gigantomachy. It's the victory of the Olympian gods over the giants."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1558.08,"end":1558.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1558.8,"end":1627.72,"speaker":"Fr Stephen De Young","text":"And you went up the steps to the footstool of the throne of Zeus to make the offerings. And so this sat at the top of this high point of the city, belching smoke of these sacrifices day and night, towering over everything, celebrating the supposed victory of Zeus over the giants. And when St. John attaches his sort of COVID letter to The Book of Revelation to Pergamon. He refers to this as the throne of Satan. Right. And. Yeah, this is how he's making that connection. Right, right. Zeus is part of the succession myth. He's the devil claiming he won in his revolt when he didn't. Right. This is his throne. They're covering and buttering him up and offering him tribute, assuring him that, no, he really did win. And the, the. He's writing to the Christians and talk about how they live in the shadow of that every day as this persecuted Christian minority in the city. But it makes perfect sense to call that the throne of Satan, if you understand what's going on there."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1628.04,"end":1628.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1628.88,"end":1630.36,"speaker":"Fr Stephen De Young","text":"What the pagans understood was going on."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1630.99,"end":1675.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. And another aspect to this, which I think is really important, I mean, I said earlier that this kind of binds the community together, but also this is. This underlies the notion of foundings of civilizations and cities and peoples. Right. This is a foundational myth. And, you know, myth, remember, within ritual theory, myth is not, you know, just a story that isn't true. It's a story that everyone participates in and actually shapes the community. Right. So this is foundational. This is about the creation of this city or whatever it is, you know, and. And so again, the throne becomes the focal point. That's what it's all founded on, you know, so."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1675.76,"end":1713.91,"speaker":"Fr Stephen De Young","text":"So in, in Athens, right. Athena and, And Hephaestus. Right. Were. Were the gods who were assigned that area according to the Athenians. And so that land, the land they were working for, food, belonged to those gods. And those gods created the Athenians as this special race out of that ground. Yeah, Right. And so it was all bound together, Right. In their minds. And what kept that bond going was the ritual cycle of sacrifices. And this is, this is why Christians opting out was not seen as an option."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1714.47,"end":1739.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. And also, like, just as a kind of side note, you know, most kinds of paganism had this sense that their local gods had created them and that other gods had created other peoples. It's within the worship of Israel that you have this idea that all of mankind has a single origin, which then implies that all of mankind has a single God. Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1739.91,"end":1740.63,"speaker":"Fr Stephen De Young","text":"Which point?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1740.87,"end":1741.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1741.63,"end":1743.39,"speaker":"Fr Stephen De Young","text":"Which point St. Paul makes in Athens."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1743.79,"end":1744.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1744.59,"end":1747.07,"speaker":"Fr Stephen De Young","text":"From one man, he made all the peoples of the world."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1747.63,"end":1748.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1748.11,"end":1749.83,"speaker":"Fr Stephen De Young","text":"Talking about the most high God who's."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1749.83,"end":1756.19,"speaker":"Fr Andrew Stephen Damick","text":"Which they would have argued with that like, no, no, we were. No, no, we were made by Athena and. No."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1756.67,"end":1762.03,"speaker":"Fr Stephen De Young","text":"Right. And that makes us better. Yeah. The Athenian democracy was not as democratic as we Might like to think."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1762.19,"end":1763.15,"speaker":"Fr Andrew Stephen Damick","text":"Alas, no."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1764.99,"end":1806.26,"speaker":"Fr Stephen De Young","text":"Yeah. And then another thing that was celebrated, another sort of aspect that was sometimes celebrated that has some interesting biblical echoes, was the marriage of the God to the city as his bride. So that bond we were just talking about, like the one that the Athenians saw in Athens, Right. They would talk about this in terms of, you know, Hephaestus having Athens as a bride. Right. And the goddess Athena being sort of a personification, as feminine, of the city itself."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1806.82,"end":1807.94,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1808.1,"end":1828.14,"speaker":"Fr Stephen De Young","text":"Or the city itself being a body of Athena. And so that. That language is common all over the place in the ancient near east and in ancient Greece, I think we've said before on the show, ancient Greece was not the first Western civilization. It was the last ancient Near Eastern civilization."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1829.1,"end":1829.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1830.3,"end":1853.47,"speaker":"Fr Stephen De Young","text":"But this has some resonances then in the scripture, especially the Old Testament, this idea where you'll see over and over again Zion and Jerusalem and sometimes even Samaria, the captain, the capital of the Northern kingdom, being referred to as the wife or the bride of Yahweh, the God of Israel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1854.11,"end":1881.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And then that's the origin of the language that gets used in the church, that the church is the bride of Christ. It comes from this notion of the community being married to the God. And here's one. This is not. This is not we ruin Sunday school. This might be we ruin, I don't know, modern Orthodox myth. Liturgical myth."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1881.28,"end":1882.08,"speaker":"Fr Stephen De Young","text":"Urban legends."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1882.16,"end":1970.04,"speaker":"Fr Andrew Stephen Damick","text":"Urban legends, yeah. Right. So you'll often see in Orthodox liturgical texts the people of God being described as being a city. So, like, for instance, addressing God or sometimes addressing the Virgin Mary, I thy city ascribe to thee praise. Whatever, whatever. And a lot of times people, because they have this big shadow in their minds of the Eastern Roman Empire and all that kind of thing, they assume that that city that's being referred to is Constantinople. So it's not the city is the church. Now, Constantinople, in as much as it has been Christian, can be being that city. Right. But it's not the city of God. You know, the city of God is the church, and it's the city of God that addresses God and addresses the Virgin Mary and the saints and so forth. It's not. It's. It's. You know, there may sometimes be references to Constantinople or other cities, great cities, in liturgical texts as they personify this. But the origin of this language is the Scripture, actually. And other cities can participate in that reality, but only in as much as they are being Christian. Right. It's not just. It's not sacralized for all time, as one particular city here or there, there is a religion that kind of does that. And this isn't that one. There's a couple of them that do that actually. This isn't that religion."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1970.6,"end":1985.75,"speaker":"Fr Stephen De Young","text":"And when we understand that the church is a police, that has all kinds of ramifications, locations that we're going to talk about probably in some future episode. Yeah, about two politics."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":1986.63,"end":2037.17,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Police as being the ancient Greek word for city, although it's a bigger concept than that. I mean, right here in Emmaus, we pray for this city in every city. Well, Emmaus, if you walk around and it's three square miles, no one would call it a city in modern English. But it is a police in that sense. You know, it's a community, it's a people, it's a. Right. So, yeah, yeah. I love this and I love how. I mean, we've talked about this many, many times. But I just want to underline it in this case about how all these notions that are going around the ancient near east about what it means to have a devotion to your God and what the God's relationship is to the community, how all of that is fulfilled in the scriptures and shown to really be truly about the relationship of the people of God with. With Yahweh, their creator. So this is just a beautiful example of that."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2037.73,"end":2095.81,"speaker":"Fr Stephen De Young","text":"Right. The way it's the. The instinct that's still latent to humanity that gets distorted due to a lack of knowledge and due to demonic manipulation in other. In the other nations, is sort of purified and restored and brought to its proper place within the actual police of Yahweh, the God of Israel. Right, yeah. And just to finish up this first half, if you were to go to the Mount of Ascension in the Holy Land and you were going to go to the site, it's no longer able to function as a church, unfortunately, it's within an Islamic compound. But if you go to the site of the original church of the assembly, Ascension, on the Mount of Ascension, what you will find there is in a stone, the print of Christ's right foot, a petrosomatoglyph."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2097.97,"end":2107.65,"speaker":"Fr Andrew Stephen Damick","text":"So. Yes, exactly. All right, well, that wraps up the first half of the Lord of Spirits tonight. So we're going to go to break, and as soon as we come back from break, we're going to take one of your calls."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2108.29,"end":2124.59,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 8552-37-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2129.95,"end":2190.64,"speaker":"Announcer","text":"No end of books these days offer us techniques for self improvement. But in the newest release from the Ancient Faith store, Gratitude in Life's Trenches, Robin Phillips takes a different tack. He shows us that God meets us where we are in the pain and heartache of the present moment. Instead of looking for a way to escape from hardship, we can cultivate an attitude of gratitude, peace and self acceptance that will transform our experience of suffering. Drawing on his own experiences and his work as a consultant in the behavioral health industry, as well as stories of saints and sufferers, teachings of the fathers, and recent discoveries in neuroscience, Phillips shows us that the journey to personal well being is one we can all travel, regardless of the hardships we may face. To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2190.64,"end":2205.65,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2207.41,"end":2220.85,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the second half of the Lord of Spirits on this feast of the Ascension. And we're going to start taking your call. So we actually do have a caller here right at the top of the second half. John from Atlanta. John, are you there?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2222.38,"end":2223.98,"speaker":"Unregistered: David","text":"I am, Father. Good to talk."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2224.62,"end":2227.66,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, John, to the Lord of Spirits podcast. What's on your mind?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2228.7,"end":2232.7,"speaker":"Unregistered: David","text":"I was hoping you'd slip up and say Westview hall, but okay, oh, Westview."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2232.7,"end":2236.86,"speaker":"Fr Andrew Stephen Damick","text":"Hall, be thou well in Old English."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2237.74,"end":2314.45,"speaker":"Unregistered: David","text":"Thank you. And Father Stephen is free to know me, but I have long wondered about this. We read the eighth Eothanon gospel less. And then this being Ascension, we read today gospel from Luke. And when in the Oath 8 Mary Magdalene, she's the gardener and don't touch me, I haven't yet ascended to my father, right? And then we know, 40 days later, he ascends to the Father. And in this gospel in Luke, he's saying, handle me. And of course, with Thomas, he says, you know, put your hand at my side and feel the prints of the nails and all this. And then in this gospel from Luke at the ascension, he says, he says, handle me and see. And it makes long maybe wonder if there's some ascension we don't know about that occurred after he meets Mary Magdalene in the garden, when he's saying, you can't touch me. I've just come From Hades. And then later it's okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2316.05,"end":2404.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the one thing that I can say to that, because it just leaped into my mind right off, is that the hymns that discuss St. Mary Magdalene's encounter with the Lord there, they actually give an explanation as to why he says that to her, which is that her mind was on earthly things. It says that. Right. So that she was thinking. I mean, you can expand that whatever way you like, but that's what the hymns say. Right. So in other words, that it's not that he can be handled after the Ascension, it's that her mind is not where it should be. And so it would not be appropriate for her to embrace him that way. Right. So that's the way that the hymns interpret it is that the change is not that Jesus did something and changed so he can be touched later. It's that St. Mary Magdalene's state of heart is not appropriate to be able to do that. Now, I can't say I totally understand exactly what that means, but that is what the hymns say is that she's thinking. Sometimes you see it translated carnally, which doesn't mean anything prurient. It just means thinking according to earthly things, according to the flesh, you know, that kind of thing. So that's the liturgical interpretation that I can remember off the top of my head. So, Father, did you have something you wanted to add to that?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2405.84,"end":2409.41,"speaker":"Fr Stephen De Young","text":"Yeah, let me try and connect those dots for you."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2409.41,"end":2409.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2409.97,"end":2431.85,"speaker":"Fr Stephen De Young","text":"Between the two things in terms of how you get from one to the other. So, yeah, it isn't. It isn't like when. When Christ had just gotten back from Hades, he was too hot to handle and too cold to hold or something. It's the. And touch isn't really the best translation of the word that's used there."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2432.09,"end":2437.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like hold or grab onto or like. Yeah, hold or cling to. Cling to. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2437.96,"end":2469.5,"speaker":"Fr Stephen De Young","text":"And that's in. That's in St. John's gospel. So it comes at the end of a whole. A long piece that we read most of actually on Holy Thursday night of teaching from Christ to his. To his disciples. And in that he talks about this is one of the major themes of that whole back half of St. John's gospel is about Christ ascending and the coming of the Holy Spirit. And remember, he teaches that, you know, it's to your benefit that I go."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2470.22,"end":2470.58,"speaker":"Unregistered: David","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2470.58,"end":2532.16,"speaker":"Fr Stephen De Young","text":"Because then the Holy Spirit will come. And so the idea is he's saying, don't cling to me. Because what. What St. Mary Magdalene is thinking is, oh, I'VE got him back. Right. I thought I had lost him, but now I have him back and I want to keep him and I want to cling to him. Right. And that's why he's saying, don't cling to me, because I still have to do this. I have to ascend. The Holy Spirit has to come. So it. It's sort of parallel to what happens on the Mount of transfiguration when St. Peter is like, hey, let's build little. Little tents for you and. Yeah, for you and. And Moses and. And Elijah. And we'll all just stay up here. Right, right. And it's like, no. Right. Yes. This is this moment of joy. Yes. This is this wonderful thing, but we. We can't camp out here. Right? There's. There's something more happening. There's something more coming. And. And that was the Ascension and then what came after."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2534.48,"end":2535.6,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, John?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2536.24,"end":2536.88,"speaker":"Unregistered: David","text":"It does."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2537.6,"end":2542.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's only one Ascension. Just the one."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2542.63,"end":2552.31,"speaker":"Fr Stephen De Young","text":"That's the idea behind these. She was thinking cardinally or in a worldly way. Right. She was thinking of, oh, I've got him back. Right. And I want him to stay here with me now."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2553.83,"end":2554.95,"speaker":"Unregistered: David","text":"Right, Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2555.03,"end":2569.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. All right. Well, thank you very much for that call, John. And we have another caller, Samuel, from the God Blessed Commonwealth of Virginia, my natal state. Samuel, welcome to the Lord of Spirits."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2570.83,"end":2573.71,"speaker":"Unregistered: David","text":"Thank you, Father. You said something similar last time I called."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2575.39,"end":2577.71,"speaker":"Fr Andrew Stephen Damick","text":"That is because Virginia is a blessed land."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2580.35,"end":2594.76,"speaker":"Unregistered: David","text":"So when you were talking about the depictions of pagan gods being enthroned on mountains, mountain temples, I was wondering if you guys had any insight on."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2598.2,"end":2598.52,"speaker":"Fr Stephen De Young","text":"A."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2598.52,"end":2603.48,"speaker":"Unregistered: David","text":"Particular example of that in today's popular culture."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2603.88,"end":2604.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2605,"end":2607.24,"speaker":"Unregistered: David","text":"Are you familiar with Warhammer 40,000?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2608.6,"end":2610.76,"speaker":"Fr Andrew Stephen Damick","text":"I bet Father Samuel is. I'm aware of it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2611,"end":2612.04,"speaker":"Fr Stephen De Young","text":"Father Samuel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2612.2,"end":2618.76,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, Father Stephen, we're talking to Samuel. Your father's. Yeah, yeah, I do know a Father Samuel in West Virginia."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2619.14,"end":2619.9,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2619.9,"end":2620.5,"speaker":"Fr Andrew Stephen Damick","text":"As we both."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2620.98,"end":2623.14,"speaker":"Fr Stephen De Young","text":"Which West Virginia is the best Virginia."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2623.14,"end":2630.22,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, it's the rest of Virginia, Sir Warhammer 40K."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2630.22,"end":2632.74,"speaker":"Fr Stephen De Young","text":"Yes, yes, I am, somewhat. Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2633.7,"end":2636.98,"speaker":"Fr Andrew Stephen Damick","text":"Was there some particular thing in there, Samuel, that you had in mind?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2637.86,"end":2659.49,"speaker":"Unregistered: David","text":"I was thinking about how in that setting, humanity is ruled over by an emperor who is around 15ft tall and now sits on a throne on the highest mountains of Earth. To halt and requires regular sacrifice."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2660.05,"end":2661.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How about that?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2661.81,"end":2668.53,"speaker":"Fr Stephen De Young","text":"Yeah. He's a. He's a God Emperor. And. Yeah. In return, he enables interstellar faster than light travel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2669.73,"end":2687.81,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go. Yeah. You'll see. I mean, once you see these patterns from the ancient World, you'll start to see them in lots of places. Right. It just keeps getting repeated in culture, whether it's popular culture or classical literature. It's everywhere. It's everywhere. So does that answer your question, Samuel?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2689.01,"end":2694.05,"speaker":"Unregistered: David","text":"Yeah, well, actually, this emperor was said to have been born in the ancient Near East."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2694.29,"end":2695.33,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you are."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2696.05,"end":2698.77,"speaker":"Fr Stephen De Young","text":"Right. Quelle surprise."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2700.85,"end":2705.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. All right, well, thank you very much for calling tonight, Samuel. It's good to talk to you again. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2705.96,"end":2709.64,"speaker":"Unregistered: David","text":"I was actually reading Wikipedia's article, Buddha footprints earlier today."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2710.04,"end":2710.84,"speaker":"Fr Stephen De Young","text":"How about that?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2712.68,"end":2720.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a fun article. All right, well, thanks for calling. All right, well, next we have just. Hannah. I'm sorry. Go ahead. Go ahead. Father Stephen."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2720.76,"end":2724.48,"speaker":"Fr Stephen De Young","text":"I don't want to bash a caller after they. They get off the phone, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2724.48,"end":2725,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2725.32,"end":2727.72,"speaker":"Fr Stephen De Young","text":"Samuel, clearly not a careful listener."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2728.2,"end":2728.68,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2728.68,"end":2733.57,"speaker":"Fr Stephen De Young","text":"Because I have made a blood for the blood. Blood God reference."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2733.81,"end":2734.65,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2734.65,"end":2735.89,"speaker":"Fr Stephen De Young","text":"On a past episode."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2735.97,"end":2736.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2736.53,"end":2738.85,"speaker":"Fr Stephen De Young","text":"And he apparently missed it or he would have known."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2739.17,"end":2740.29,"speaker":"Fr Andrew Stephen Damick","text":"Not everybody can be."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2740.37,"end":2741.45,"speaker":"Fr Stephen De Young","text":"Anyway. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2741.45,"end":2751.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Well, it's okay, Samuel. You live in Virginia, so you're. You're great. All right, we have. We have Hannah calling, so. Hannah, are you there? What's on your mind?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2752.53,"end":2755.73,"speaker":"Hannah","text":"I'm here. Thank you for taking my call."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2756.13,"end":2756.69,"speaker":"Fr Andrew Stephen Damick","text":"Welcome."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2757.41,"end":2770.78,"speaker":"Hannah","text":"I have recently been learning and studying more about the actually natural family planning, and you can't get very far in natural family planning without coming across the theology of the Body."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2771.66,"end":2772.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2773.1,"end":2803.91,"speaker":"Hannah","text":"And some things that have come up in the theology of the Body is that. Well, a quote is that the body and it alone is capable of making visible what is invisible, the spiritual and the divine. It was created to transfer into the visible reality of the world, the mystery hidden since time immemorial in God and thus to be a sign of it. My question is, how well does this fit in with orthodox theology?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2805.35,"end":2807.51,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Do you have a few hours."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2810.23,"end":2811.03,"speaker":"Hannah","text":"But you don't."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2811.51,"end":2816.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, we theoretically could, but we'd lose listeners left and right after five hours."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2816.35,"end":2816.71,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2817.35,"end":2819.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2820.79,"end":2832.63,"speaker":"Hannah","text":"I've heard through. Through my orthodox development, different at different times. Hints about the. The body of man and woman being changed after the fall."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2833.03,"end":2834.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2834.19,"end":2845.45,"speaker":"Hannah","text":"And so I'm wondering how. How much we can really take as signs of the divine from. From our fallen bodies."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2847.29,"end":2981.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there is the problem that we are in this state. Right. So human bodies get altered. They. They. Now we. We talked about this in some detail in the Body episodes. Right. You may recall earlier this year. But. But they just to kind of recap. Right. So when Adam and Eve sin God and so that they would not be crystallized in evil. God gives them mortality. What the. You know this phrase, the garments of skin. Right. As some of the Fathers interpret that phrase from Genesis. And they become mortal, they become corruptible. And the point of this actually was not God, you know, being so mad at them. He just had to punish them and give. Give them this mortal state, but rather he was giving them the ability to repent because you can't repent if you don't have a mortal body. Saint John of Damascus says this. It's, you know, it's. And he says it as a kind of sideways way of talking about why it is that. That demons won't repent because they don't have mortal bodies. But also it's useful to remember that when you're parted from your mortal body, you don't then have the ability to repent because. Because you don't have it anymore. It's your mortal body that gives you that ability. So. Right. We can't start with humanity as it currently exists now and then analogize outward from there to talk about the divine. That's completely backwards. Right. Human beings were created according to the image of God. So we are, as we described it, theomorphic. We're cheap imitations of God, in a sense. And we're in this sort of weakened state of being mortal which was given to us so that we could repent. So, yeah, any theology of the body has to take that into account. It cannot absolutize our current state and come up with a model for understanding who we are in relation to God as a result of that. Right. Because this is. It's not just broken. It has a purpose. This broken state we have has a purpose so that we can repent. Father, I don't know if you wanted to add anything to that."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2982.98,"end":2992.02,"speaker":"Fr Stephen De Young","text":"Yeah, a couple things. I think the quote you read is talking about the body qua physical and material. Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2992.02,"end":2992.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":2992.66,"end":3044.69,"speaker":"Fr Stephen De Young","text":"Not always the way we use body on this show, but is part. Right, Right. And so the sin qua non sort of fulfillment, that quote you just read is of course the Theotokos giving birth to Christ. Right. It's through her human body that the mystery capital M of the ages. Right. Christ himself is manifest, manifest in the world. It's through humanity taken from her body. So that's sort of. That's. That's a synchronon of that. And that's what St. Paul is getting at, by the way, when he says that woman will be saved by childbirth. People come up with really bizarro world understandings. Of that. That, like women having babies makes them saved or something."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3045.41,"end":3048.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it's about the woman, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3048.21,"end":3141.82,"speaker":"Fr Stephen De Young","text":"Because the word he uses there is not a woman, the word for a woman. It's the word for woman. Like womanhood, right? Like woman is a concept. The same way that there's, you may know, in Greek, there's anthropos, right? Which is sort of humanity, man humanity kind of thing. And then anir, which is just a man, right? This is talking about woman is saved through childbearing. So it's talking about womanhood, what, what God created women to be we see fulfilled in the Theotokos. So that's the sort of core fulfillment of that. But also humanity is both material and immaterial, and humanity, therefore, in orthodox theology, functions as the bridge between the spiritual world and the material world to bring the two together. And that's sort of the basis of all of our sacramental theology. Right. That God's grace comes to us through the created world and through matter and through our physicality. Right. So Adam was created in the first place, visible and invisible, in order to serve as a priest and bridge those two realities and bridges bring them both to perfection, which of course, as we know, he failed to do. But Christ then does that perfectly."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3145.26,"end":3146.7,"speaker":"Fr Andrew Stephen Damick","text":"Does that help there, Hannah?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3147.34,"end":3148.66,"speaker":"Hannah","text":"It does, it does."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3148.66,"end":3149.18,"speaker":"Fr Andrew Stephen Damick","text":"Awesome."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3149.82,"end":3154.86,"speaker":"Hannah","text":"Thank you. And Father Andrew, I'm still waiting on the edge of my seat for talk of dragons."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3157.26,"end":3172.83,"speaker":"Fr Andrew Stephen Damick","text":"Well, you're in luck. We're about to mention a dragon. Yeah. Yeah. So thanks for calling, Hannah. Okay. I know we have some other callers. Thank you. But we're gonna move on and start talking a little bit about a dragon. So, boy, that was just a perfect segue."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3173.23,"end":3249.98,"speaker":"Fr Stephen De Young","text":"We're gonna move on through fire and flames, indeed to Genesis 1. Yes. We're going to leave the. The pro devil propaganda and go to the Scriptures for the corrected version. And we will see. This is an in joke that only a handful of people will get, but we'll see that there are continuities and discontinuities with the Scriptures. So we talked a little bit in the last half of the about the way the creation myth kind of got worked into the victory stories of the gods, particularly the creation of humanity, sometimes the creation of the earth. And so when you read Genesis 1 and the first couple verses of chapter 2, because why did they put the break there anyway? There are some striking things, right, that you notice over against it. And probably the first one is that in Genesis 1, at least there's no element of chaos conf."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3251.66,"end":3252.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3252.02,"end":3258.06,"speaker":"Fr Stephen De Young","text":"Yahweh doesn't have to fight anybody. There's no throwdown between him and the forces of chaos."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3258.38,"end":3258.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3258.86,"end":3261.66,"speaker":"Fr Stephen De Young","text":"Chaos is there in Genesis 1, verse 2."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3261.82,"end":3264.43,"speaker":"Fr Andrew Stephen Damick","text":"And he just founds the earth upon it. Boom."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3264.9,"end":3266.82,"speaker":"Fr Stephen De Young","text":"Right. And he just kind of bosses it around."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3267.7,"end":3289.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. He doesn't have to. He doesn't have to have a wrestling match with Leviathan, with a dragon. There you are, Hannah. You know, like, there is, like, there is a sense of God against Leviathan. Right. But it's mostly God pushing Leviathan around. Right. I remember you said at one point, father, someone asked about Leviathan. You said, oh, yeah, God plays with Leviathan like a cat."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3290.83,"end":3293.39,"speaker":"Fr Stephen De Young","text":"Yeah. That's the way he's depicted in some of the Psalms."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3294.03,"end":3294.83,"speaker":"Fr Andrew Stephen Damick","text":"That's amazing."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3295.47,"end":3352.02,"speaker":"Fr Stephen De Young","text":"Yeah. And so there. There is these. These motifs from the chaos conf. Idea in the surrounding countries get picked up at places of the Old Testament. And I'll do the. The quick list here so that people can pause it or look it up in the transcript when such a thing materializes. But that's in Psalm 74, Psalm 89, Psalm, Psalm 93, Job 26, 12, 13, and Isaiah 51, verses 9 and 10. You see that imagery sort of taken over and played with in one case, like you mentioned, rather than him fighting Leviathan, like, he makes Leviathan as a sort of house pet to play with. And another place, he catches Leviathan like a fish, apparently as a hobby and. Right. So that's this. This huge contrast."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3352.5,"end":3357.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it doesn't create the world when these things happen."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3357.94,"end":3361.54,"speaker":"Fr Stephen De Young","text":"Right. No, this is something that happens, you know, later."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3362.42,"end":3362.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3365.54,"end":3397,"speaker":"Fr Stephen De Young","text":"And in addition to there being no chaos comp. There's, of course, no succession myth. Right. There's. There's no other most high God who, Who Yahweh has to show up and defeat to take over. And there's not anyone who he's worried about. I mean, somebody. Somebody has a go at it in Genesis 3, but he loses badly. And there's not even a fight. It's not like in Genesis 3, God has to fight, Fight the devil and beat him."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3397.4,"end":3399.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's just chased out."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3399.56,"end":3402.36,"speaker":"Fr Stephen De Young","text":"Yeah. Throws him out and tells him to buzz off, you know."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3402.36,"end":3490.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Enjoy the underworld. And, you know, there was. So last night, we're talking about, you know, shameless plug for your new book Religion, the Apostles. We're talking about your book in a class that we're doing here in Emmaus. And someone. I was talking about the succession myth, because that's in chapter four. And someone brought up. They just said, What a beautiful contrast. I thought this was so, so beautiful that they brought this up. What an amazing contrast where you've got in all of these pagan myths, there's this divine father and son, and often what's going down is the son killing his father. But in the worship of the God of Israel, you've got a perfectly obedient son who reigns alongside his father and works alongside his father, you know, and it's a picture of humility and not of struggle. Because, I mean, if you're omnipotent, why would you. There's no such thing as struggle. Right. I mean, you know, like, we see this in the Gospels, right, Where, you know, they're on the Sea of Galilee and the storm is picking up whatever, and Christ simply says, peace, be still. And the disciples are like, who is this that the wind and waves just simply obey him. You know, he doesn't have to, like, cast a spell or wrestle against the demons of the waters or whatever. They just simply obey him. Boom. You know what a contrast that is."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3491.54,"end":3497.62,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And it's. I mean, it's stark if you read the two side by side."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3497.86,"end":3498.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3498.58,"end":3527.9,"speaker":"Fr Stephen De Young","text":"This is not even a star. Similar story. And. And this is what, for example, in Isaiah, when Yahweh says, you know, before me there was no God, and after me there will be no other. This is what he's talking about. He's talking about. Because we're talking about Assyrians and Babylonians now, in contrast, right? There was no God before Yahweh who he overthrew, and there's nobody coming along who's going to change the situation in the future."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3528.3,"end":3528.86,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3529.26,"end":3530.86,"speaker":"Fr Stephen De Young","text":"This is the way it is."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3531.42,"end":3533.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's the Creator."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3535.26,"end":3565.99,"speaker":"Fr Stephen De Young","text":"And. And so we also see then in that story, as we've talked about before in a previous episode in Genesis 1, that the cosmos, as it's constructed, as it's put in order by Yahweh, is this sort of giant temple, right? With Eden as the sanctuary of that temple, and then Adam created by God as his image in that sanctuary, in that temple, right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3565.99,"end":3580.77,"speaker":"Fr Andrew Stephen Damick","text":"Which is a contrast with the way paganism works, in which man sets up a temple and creates an image of the God and puts it in there. Instead, you get. God creates the temple, puts his own image, which is human. Human beings, right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3580.77,"end":3607.38,"speaker":"Fr Stephen De Young","text":"And so it's. It's an. And we're going to talk about this more as we go on in this half. It's. Things are getting inverted. They're getting turned on their head. So we've talked about that. Before in a previous episode. So that was quick review. So. But the element we want to focus, focus on for our purpose tonight when we eventually actually directly talk about the ascension in the third half, which you should have expected by now, because that's how these things work on this show. That's right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3607.7,"end":3609.54,"speaker":"Fr Andrew Stephen Damick","text":"The third half is inevitable."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3609.94,"end":3647.64,"speaker":"Fr Stephen De Young","text":"Right. Is the seventh day. The seventh day, which talk about things that are treated as afterthoughts. Right. This one of the most. Even though I refuse to talk about it, one of the things that, that most interested sound slashed entertained me about some of the debates about the length of the days of creation in certain circles was that there were times where people were literally arguing for seven 24 hour days, not six, seven."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3648.2,"end":3648.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3648.68,"end":3652.68,"speaker":"Fr Stephen De Young","text":"So they wanted to say that God literally rested for 24 hours."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3654.53,"end":3673.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And which I always found a little amusing. Right, right. And. And it comes from this idea that, and I think a lot of us were probably raised with this notion like God works six days and then rests. Well, and, and because we tend to think of him anthropomorphically and we think, ah, yes, I too need a weekend."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3674.21,"end":3674.61,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3674.61,"end":3733.49,"speaker":"Fr Andrew Stephen Damick","text":"You know. Right. And so that's what the Sabbath is, is about. It's a weekend because God needed a break because he worked so hard. So we need to take at least one day off. Right. But that's not what is meant by when Christ says that the Sabbath is made for man, it's actually this God entering into his rest. Entering into his rest. And so when the Sabbath then is given to man, it's to do the same thing. Right. So what that means is that when God completes his work in creation and then goes and rests, it's not because he needs a break. He's God. God does not need a break. Right. He does not need to take some time off, does not need a weekend. Again, that's thinking anthropomorphically."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3734.18,"end":3744.26,"speaker":"Fr Stephen De Young","text":"Right. And the idea of Israel entering into his rest even isn't, if I just lie here, would you lie with me and just the world."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3745.3,"end":3745.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3747.46,"end":3757.46,"speaker":"Fr Stephen De Young","text":"Because. Oh, it's been so difficult. Right, right, right, right. This is rest, like coming to rest, like sitting down, like we just talked about in temples."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3757.62,"end":3758.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Enthroned. Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3758.82,"end":3777.38,"speaker":"Fr Stephen De Young","text":"This is the end of the path. Yeah. You get to the end of the path, you've completed. Right. You've completed your, your victory, you have built your temple. And now you go and you go and sit down on your throne, you take your seat. And so joining God in his rest is coming to be seated with Him."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3777.78,"end":3809.55,"speaker":"Fr Andrew Stephen Damick","text":"Right. So when the Sabbath, when the Sabbath is given to man and not man, you know, the Sabbath is made for man, not man. For the Sabbath, the Sabbath is made for man. That is God saying, walk this path to the place of my throne and sit here beside me. In other words, that the Sabbath being made for man is actually an image of theoses. It's actually about becoming like God, becoming co. Enthroned with him."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3811.56,"end":3868.64,"speaker":"Fr Stephen De Young","text":"Right. So in the Old Testament, by observing the Sabbath, they are in the liturgical week enacting the promise to Abraham to become like the stars. Right? The promise to Abraham at the end. That's why it's at the end of the week. They're looking forward to it at the end of the week. That being the. The goal and the destiny. And so as, as we were mentioning. Right, and we're going to break down a little more here, right? The story we're told, the myth, the story you could participate in, that we're told in the Old Testament is taking the pagan one and flipping it on its head. That's how a pagan would have experienced it. Now, from our perspective, of course, this is the true story. And the demons have taken that and flipped it on its head and sold it as a lie to the nations."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3868.88,"end":3869.28,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3870.96,"end":3926.57,"speaker":"Fr Stephen De Young","text":"But in terms of reality. But a pagan experience says, okay, you've taken this story. We all know, I mean, we disagree about the names of the gods involved, but we all know this story. You've taken it and flipped everything around. And the main way to describe that flip overall is that the pagan story makes ritual and makes worship all human directed toward the divine. Right? Meaning it's the human who goes and makes the body for the God so that the God will have a body and they can interact with each other. It's the humans who have to come and feed and dress and care for and honor and celebrate and appease and please the God."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3927.05,"end":3927.45,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3929.05,"end":3948.4,"speaker":"Fr Stephen De Young","text":"So all of that motion is directed in that way as opposed to God creating his own image, as you mentioned, as opposed to what we talked about in a previous episode, the showbread. Right. Which is rather than them bringing food to God in the tabernacle in the temple, God feeds his priests during their service."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3948.88,"end":3949.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3949.76,"end":3951.76,"speaker":"Fr Stephen De Young","text":"In the tabernacle. In the temple."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3951.92,"end":3976.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, and then, okay, just to extend it into the direct experience, everyday experience really, of Orthodox Christians, at the very beginning of the Divine Liturgy, you know, the deacon says to the priest, it is time for the Lord to act. Right. And which is why, I'm sorry, for those of you who have this translation. Sometimes you hear, it is time to begin the service to the Lord. That is exactly backwards. Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3977.45,"end":3979.81,"speaker":"Fr Stephen De Young","text":"It's actually more accurate to the original, though."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3979.81,"end":3980.49,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is it really?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3980.65,"end":3981.81,"speaker":"Fr Stephen De Young","text":"I'm actually. You a little."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3981.81,"end":3982.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay, that's fine. That's fine."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3982.85,"end":3984.97,"speaker":"Fr Stephen De Young","text":"I agree with you in terms of my preference. But."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":3985.13,"end":4014.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, right. But, yeah, but the point is, is that it is an action by, you know, the Divine Liturgy is an action by God towards us. You know, he's feeding us us. He's doing this work for us. It is a divine Liturgy for the people. It is a public service. Right. I can hear Father Lucas Christensen, whom I don't think we've referenced before in this show before, hearing in his head, he's saying, that's right. It's not the work of the people. It's the work."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4014.34,"end":4017.22,"speaker":"Fr Stephen De Young","text":"Well, that's true. It's definitely not the work of the people."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4017.38,"end":4019.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4020.33,"end":4028.65,"speaker":"Fr Stephen De Young","text":"Resolved. But. But, yeah. And so the idea is the pagan gods need a bunch of things from humanity."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4028.81,"end":4029.21,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4029.45,"end":4034.49,"speaker":"Fr Stephen De Young","text":"Right. Whether it's flattery and praise, like, oh, no, bail, you're the best. Everybody you fought, you won."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4034.65,"end":4035.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4036.09,"end":4051.19,"speaker":"Fr Stephen De Young","text":"Or whether it's food, whether it's to be dressed, whether it's to be cared for. Right. They require all of these things. And if not, they get people peevish. They don't do what you want them to do."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4051.19,"end":4052.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have to keep them happy."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4052.99,"end":4198.14,"speaker":"Fr Stephen De Young","text":"Yeah. And so there's all these demands imposed on humanity. And so it's literally in there when you read Sumerian religious texts, for example, that basically humans were created to be the God's slaves and serve them. Right. Which what do you expect from demons that are trying to enslave humanity? Right. They're being honest. They're saying the quiet part out loud to the Sumerians. But the reality is, since God created all things, Yahweh, the God of Israel, created all things. Everything belongs to him. He doesn't need anything of yours. In fact, everything that you think is yours belongs to him anyway. That's why we say the liturgy, thine own, of thine own we offer unto thee. Right. Because we don't actually have anything. It all belongs to him. So he doesn't need anything. Rather, the whole perspective of Old Testament religion, of Old Testament religion is that God shares out of his love the things that are his with humans whom he loves. The whole idea is that he moves outside of himself. Right. He gets up off of his throne, he creates the cosmos for us and puts us in it, and then he sits back down again after he, out of love, has left his throne to do that, right? And this is, this is Old Testament. This is what they, they understood in the Old Testament. This isn't just a new thing that starts in the New Testament, right? So when Christ goes and feeds 5,000 people, he's enacting what Yahweh, the God of Israel has been doing all along, from the matta in the wilderness to the showbread, right? And he's showing that he's the same God. That's part of how that's revealed in the New Testament. And so this, this changes, like the context of praise and in worship, right? In Israel, praise and worship is primarily Thanksgiving. That's why we call it the Eucharist, right? It's Thanksgiving because we're acknowledging all the goods that we've received from God. It's not flattery. It's not trying to meet God's needs for approval, like he's insecure, like BAAL is."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4198.46,"end":4225.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And most, like, most, you know, even orthodox prayers that specifically ask God for something, the. The usual narrative structure that they take is to say, God, once you did this, and then often include a thanks, can you please do it now again for us? Right? That's the way that it goes. It's not like, oh, you know, like you said, it's not flattery, it's not obsequious, right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4225.31,"end":4251.96,"speaker":"Fr Stephen De Young","text":"And we've all heard, unfortunately, from some of our Christian friends, prayers that are sort of like, okay, I'm gonna butter God up for a few minutes and then I'm gonna read him my list of demands, right? I'm gonna try and get him good and buttered up, and then I'm gonna ask him for things, right? But that's. That's not correct. That's not right. Pray as Christians, right? No, what it's about, he doesn't need your flattery. You're not fooling him. You're not tricking him."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4252.36,"end":4333.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, you know, so part of then the way that that gets expressed liturgically, meaning ritual participation, right. In the, in the Old Testament. And then frankly, also, you know, in the New Covenant as well, you've got these, the two of the big feasts, particularly Passover, right? Which is a renewal of the Exodus, and that is about the creation of the people of Israel. And of course, it's also about God's defeat of the Egyptian gods, right? And then you've also got Pentecost, which is about the giving of the law. So it's a renewal of the Covenant. And so these things are baked into the liturgical cycle. It's a participation in creation as being always renewed by God, something that we receive from God. Right. And so both of those acts, right, the Passover is an action by God. You know, the giving of the law at the end of the 50 days is an action by God. Right. And so our participation in those things is to renew our experience of them, our reception of them. You know, for me and my generation to do the same thing, to have the exact same experience that those who did it first. Right. So that's just baked into the way that we do this."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4334.41,"end":4336.89,"speaker":"Fr Stephen De Young","text":"And those two feasts were the creation of Israel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4337.45,"end":4337.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4338.25,"end":4340.49,"speaker":"Fr Stephen De Young","text":"Before that, there was no Israel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4341.13,"end":4342.17,"speaker":"Fr Andrew Stephen Damick","text":"Yep, exactly."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4342.17,"end":4344.81,"speaker":"Fr Stephen De Young","text":"Right. And. And afterwards there was."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4345.69,"end":4352.97,"speaker":"Fr Andrew Stephen Damick","text":"It begins with Passover, and it's completed in Pentecost right now as a tease."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4354.09,"end":4400.45,"speaker":"Fr Stephen De Young","text":"Right. We've been talking about sort of this continuity between. Between Old and New, New Testament. But now here's one of those points of discontinuity, and that is that in the Old Testament, with the tabernacle in the temple, God is dwelling there with the people, and the people are near him. But not that many people could actually go into the tabernacle or the temple, and only one guy, once a year could go into the actual holy of holies, the actual sanctuary. Right. Right. At that time. So they couldn't actually commit. So humanity was still kind of outside, though he had been brought near. And that's a tease for two weeks from today when we talk about Pentecost."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4400.53,"end":4441.53,"speaker":"Fr Andrew Stephen Damick","text":"Indeed, it wouldn't be a Lord of Spirit episode if we didn't at one point say, well, we'll talk about that in a later episode, but this one is soon. Yes, Quite soon. Yes, indeed. All right, so, okay. There's some cool structure stuff that goes on in the New Testament and in some of the early fathers that we want to talk about how we participate in God's creation, his renewal of creation. And the thing you pointed out, like, for instance, Saint Irenaeus of Lyon, who is second century. Or am I blanking?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4441.53,"end":4442.49,"speaker":"Fr Stephen De Young","text":"Is it third century? Second."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4442.49,"end":4464.7,"speaker":"Fr Andrew Stephen Damick","text":"Second, yeah. Yes. Super early on, because. Yeah. His spiritual father was Saint Polycarp, who is a spiritual son of the Apostle John. Yeah. So it's got to be second century. He talks about some of this stuff, but he's getting it ultimately, as you pointed out in our earlier conversation from St. John. So why don't you talk about how that works out in St. John's New Testament literature?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4465.5,"end":4484.22,"speaker":"Fr Stephen De Young","text":"Right. Well, if you know One thing about St. Irenaeus it's probably annoying people pointing out that they think he said Jesus was 50 years old when he died. But if you know two things about St. Irenaeus, it's pro. The second one is probably you have some idea that he talked about what's called recapitulation."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4484.62,"end":4485.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4485.9,"end":4518.91,"speaker":"Fr Stephen De Young","text":"Which literally would mean to re. Head to head again. But anyway, and that's the idea that he has theologically, in terms of the relationship between the Old Testament and the New Testament and on a general, broader theological scale of this renewal and recreation taking place. And he gets that from St. John. It's baked into the Johannine literature in the Scriptures, and that's even at the level of structure."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4519.47,"end":4520.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4520.11,"end":4555.84,"speaker":"Fr Stephen De Young","text":"So the St. John's Gospel and the Book of Revelation and First John all have a similar structure in this way. Second and Third John are kind of too short to have much of a structure. It's hard to structure a paragraph in a complicated way. But, I mean, I've given you. St. Paul could give it a try. Yeah, he's given it a try a few times yourself. But the. The. And the way they're structured is sort of like a spiral or a corkscrew, meaning it moves in circles or cycles, but it also progresses forward."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4556.4,"end":4557.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4557.56,"end":4563.4,"speaker":"Fr Stephen De Young","text":"So it's not just spinning its wheels, sort of going around it, you know, in a flat circle like time or."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4563.4,"end":4564.48,"speaker":"Fr Andrew Stephen Damick","text":"The wheel of fortune."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4564.64,"end":4666.19,"speaker":"Fr Stephen De Young","text":"Right. It's moving forward, but it's moving forward in this circular path. And so in St. John's Gospel, it's structured around the three years of Christ's ministry. And each of those three years he sort of goes through the festal cycle of Israel, the cycle of feasts, and it progresses through three cycles of feasts in the Book of Revelation. This is real obvious even if you just read the subject headers in your English translation, because you get seven, you know, seven churches, seven lampstands, seven bowls, seven seals, seven trumpets. Right. There's sort of these repeating cycles of seven, and each new cycle of seven sort of takes off from the seventh of the last cycle. Right. So the narrative kind of moves forward, but it moves forward in these. These cycles of seven. Seven because of the Sabbath. That's part of what St. John is aiming at in the Book of Revelation that we'll probably talk about more in a future episode. But so the one we want to kind of focus in on here because of what we've just been talking about, the creation is sort of the primary point in view of the regular daily liturgics of the tabernacle and temple in the, in the Old Covenant is connected to specifically St. John's gospel and the way in which. In that, in that. Not just the back half that I mentioned earlier when we were talking about that question, but the, the Passion narrative itself, which we also of course read on. On Holy Thursday, because we read almost everything on Holy Thursday."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4666.59,"end":4668.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4670.68,"end":4790.22,"speaker":"Fr Stephen De Young","text":"And specifically the way that St. John, when he gets to describing Christ's passion and death on the cross, he swirls in all of this language drawn from the Greek of the story of creation in Genesis 1 and 2. And we see this in a bunch of places that we don't have time to develop them all right now. But you see this with the Theotokos and this parley makes with Eve where the Theotokos goes from being referred to as woman over and over again throughout the Gospel to now being referred to as mother in the same way that Eve's name is actually woman before Genesis 3 and then after the expulsion from paradise, her name is changed to Eve to Evah from Isha because she is now the mother of the mother of all the living. And you see the opening of Christ's side, like when he dies, like the opening of Adam's side when Eve, his bride, is created. But specifically here related to the Sabbath language that we've just been talking about in one of the interminable run ins that Christ has with the Pharisees throughout the Gospels where they're after him about doing something or his disciples doing something on the Sabbath comes up over and over and over and over again because they just don't get the sabbath. In John 5:17 this time Christ says something very particular in that he says that his Father is still working until that very day. And that he says, I am working. Christ is working. Right. Still."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4790.78,"end":4791.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4792.46,"end":4798.62,"speaker":"Fr Stephen De Young","text":"And that doesn't mean, by the way, until that very day doesn't mean that that's the day he stopped."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4798.7,"end":4799.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4799.78,"end":4804.3,"speaker":"Fr Stephen De Young","text":"Let the, Let the listener understand who has questions about Matthew anyway."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4804.3,"end":4804.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4806.18,"end":4924.56,"speaker":"Fr Stephen De Young","text":"So, meaning what? Well, if. If our understanding of the rest of Yahweh at the end of creation is that God leaves His throne, he works, and then when he's done, he is re. Enthroned. Right. This is what Christ is approaching, appealing to the work is not done. Right. What work? The work of the creation in the cosmos. We talked before the previous episode about how Adam and Eve's job was to continue putting things in order and filling the world with life, to continue that work of creation. And they failed. And now Christ has left his throne in the heavenly places is now at work to bring that together completion, after which he will be re enthroned. And when Christ dies on the cross in St. John's gospel, he says tetelestae, which is usually translated it is finished. But that's the same verb that's used at the beginning of Genesis 2 to say that when God completed his work, he rested on the seventh day. And so Christ says that now it is finished and then he rests in the tomb on the seventh day. And so this is where the language that you'll hear in the Orthodox Church and Orthodox theology about the eighth day, the beginning of a new creation, the beginning of a new cycle when Christ rises, this is where that comes from. But that first cycle is completed by Christ, as he says several times in St. John's gospel, right? Father, restore to me the glory which I shared with you before the world began, right? That Christ is going to return to the throne that he left and be enthroned again."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4928.16,"end":4937.91,"speaker":"Fr Andrew Stephen Damick","text":"And with that, that ends the second half of the Lord of Spirits for tonight. And we're going to go ahead and go to a break, and we'll get back to some of your calls. We'll be right back."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4938.79,"end":4955.11,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4960.68,"end":4991.33,"speaker":"Announcer","text":"Big in Heaven, a collection of short stories available now on the Ancient Faith Bookstore. Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes convicting, these stories of life in an inner city, immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and face in a new they are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4991.65,"end":4993.69,"speaker":"Fr Andrew Stephen Damick","text":"And you didn't have to ask Raskova."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4993.69,"end":4999.93,"speaker":"Fr Stephen De Young","text":"For help cleaning, polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":4999.93,"end":5004.05,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a tovarish you could count on."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5004.77,"end":5009.22,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look at into her eyes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5009.78,"end":5016.9,"speaker":"Fr Andrew Stephen Damick","text":"It surprised me that most of the church folks at St. Alexander the Whirling Dervish parish didn't even know her name."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5017.3,"end":5019.46,"speaker":"Fr Stephen De Young","text":"It wasn't anything they thought about."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5020.18,"end":5031.9,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5031.9,"end":5046.94,"speaker":"Announcer","text":"The Lord of Spirits. The Father Andrew Stephen Damick And Father Stephen DeYoung, if you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5048.38,"end":5062.78,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody. This is the third half of the Lord of Spirits and I see we have some callers that have been patiently waiting. So first we're going to take a call from Daveed. Daveed, are you there?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5064.08,"end":5064.64,"speaker":"Unregistered: David","text":"I am here."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5065.04,"end":5068.24,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, David. Welcome to the Lord of Spirits. What's on your mind?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5070.16,"end":5100.43,"speaker":"Unregistered: David","text":"So I was wondering if there was anything sort of tying into the last episode about Christ's body. There's anything to the idea why the reason his wounds are still present after the resurrection is related to Hebrews 9 and him re entering into the heavenly temple to sprinkle his blood as the once and for all sacrifice as opposed to the annual day of atonement sacrifice."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5101.95,"end":5107.15,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that's a great question. I'm going to punt that directly to Father Steven."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5107.39,"end":5109.55,"speaker":"Unregistered: David","text":"I don't think I have any follow up. So I'll listen."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5111.47,"end":5115.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. Well, great. Father Stephen, I am sending that directly to you."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5117,"end":5300.68,"speaker":"Fr Stephen De Young","text":"Yes, there we go. All right, good night, everybody. Right, so yeah, Christ, Christ's wounds in particular are special, obviously, right? But what I mean by that is, you know, this isn't like Beetlejuice, right, where you know, you die in some particular way and you're sort of like your spirit is that way forever or something. Right, Obviously. So that's what I mean by special, right? Christ's wounds are different. And so he is the lamb slain before the foundation of the world. And so his sacrifice has an eternal reality to it that enters into the time and space of human experience at a certain point, but is an eternal reality. Right? And so the, the what, what's going on in Hebrews and, and this would take a lot of time to unpack, but future episode, what's going on in Hebrews is not that St. Paul, and I'm not going to go into all that now either. St. Paul is not saying that there was this sort of the way we tend to think of it, that there's this sort of big transition. Like, yeah, the goat blood was doing it up until now, but now, right, this thing happened. And so now, right, it's different. It's different going forward. The reason the goat blood worked, right, what the goat blood did, what the Day of Atonement ritual did, was bring the people of the Old Covenant into participation in Christ's sacrifice beforehand, right? So in Hebrews, St. Paul is saying that his offering of his blood in the sanctuary, this goes with him being slain eternally is an eternal reality. Right. Meaning not just a spatio. Temporal reality, but a reality that is eternally. Capital T. True. But that enters into human experience at various points in time, and it enters into our experience, too. Right. So we then celebrate the Eucharist where Christ's blood is right. And drink his life. And that's us now after the fact that participating in that as we're cleansed by his blood."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5302.44,"end":5306.2,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, David? Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5307.48,"end":5309.64,"speaker":"Unregistered: David","text":"Glad that I was on a little bit of something there."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5310.12,"end":5319.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's pretty cool. Okay, well, thanks for calling. All right, we have one more caller we're going to take right now, and that's David. So, David, are you there?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5320.76,"end":5321.32,"speaker":"Unregistered: David","text":"I am."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5321.88,"end":5324.36,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, David, to the Lord of Spirits. What's on your mind?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5326.65,"end":5330.25,"speaker":"Unregistered: David","text":"Yeah, I guess this is probably the wrong place for a pragmatic question."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5331.21,"end":5335.01,"speaker":"Fr Stephen De Young","text":"No, no, those are Father Andrew's questions."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5335.01,"end":5339.13,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah. Right. Finally, something I can answer, perhaps."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5341.05,"end":5375.3,"speaker":"Unregistered: David","text":"I guess the question is kind of in a simple form. How do we know what we are ritually participating in? We make a lot of statements about liturgical bodies and ritual participation in them with, you know, us having physical bodies and spiritual beings having other bodies. How do you. How do you know what you're participating in or if what you're doing is active or passively participating in something? But I'm not sure if that makes sense."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5375.78,"end":5392.03,"speaker":"Fr Andrew Stephen Damick","text":"I. I think so. So let me see if I can restate your question in a way that makes sense to both of us. So I think what you're asking is essentially, how do we know that it's working and what it's doing when it's working? Is that what you're saying?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5393.23,"end":5393.71,"speaker":"Hannah","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5393.87,"end":5401.15,"speaker":"Unregistered: David","text":"How do you know that it's working? How do you know what you're doing is working? And I guess how do you know what you're doing is right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5402.2,"end":5403.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you know, they're."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5404.76,"end":5430.75,"speaker":"Unregistered: David","text":"You know, coming from a Protestant background, we're often taught that, you know, just by, you know, if you're lusting after somebody or if you're greedy or, you know, if you struggle with X, Y or z, sin. Well, that's really what these people who are worshiping these gods were doing. So by de facto, you are worshiping Mars or Nike or Aphrodite. Is there any validity to that?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5433.15,"end":5563.6,"speaker":"Fr Andrew Stephen Damick","text":"So the short answer to that is yes. Right. Whenever we sin, we are participating with demons in one way or another. It's not exactly the same as a ritual participation in terms of actual worship, but it's not totally dissimilar in that both bring you into contact with, with and participation with whatever it is that you're worshiping, right? So when you do good, you're participating in the life of God, right? But there's a way that you participate when you receive the Eucharist that is not the same way that you're participating when you say, for instance, give food to the hungry. Right? It's the same God. It's the same God and you're still participating in his life. Right? So to the epistemological question of how do you know that it's working? How do you know what it is you're doing? I mean, on one level there is kind of this epistemological problem of how do you know anything at all? Right. Ultimately, most of the things that we know and act upon are just chains of trust, right? But the chain of trust that is the church is founded upon the revelation of God and Christ. Christ, and it's renewed, you know, so it's not only that we believe because someone told us, who was told by someone on back to the apostles, it's because God has revealed Himself over and over again throughout the history, throughout human history, right. So we don't only have to say, well, I hope that, you know, this long game of telephone that went from the apostles to me got it right. Right. Which is, I think the way that a lot of skeptical, secular minded people would, would see it. Right. You know, well, it's just, you know, this big game of telephone throughout 2000 years that's going to be wrong, right? That's, that's not what it is. And at the same time, God reveals himself to us in various kinds of ways. Are they ways that would satisfy someone who's looking for some kind of empirical experience? I don't think so. Because in the end, like what exactly would that be?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5563.76,"end":5564.16,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5564.16,"end":5710.43,"speaker":"Fr Andrew Stephen Damick","text":"So for instance, someone could say, well, I really feel that God is here tonight. And you know, the skeptical part of my brain says, oh yeah, what does that feel like? And how do you know that that feeling is God? Right. You know, like I've heard people say things like that. And ultimately, if we're going to be Christians, then what we look at first is the Holy Scriptures. And if we're orthodox Christians, we're looking, looking at the Holy Scriptures within the tradition of the orthodox church. And so when God shows up in the scriptures, I mean, he shows up in lots of different ways. Almost never does it describe how people feel, although the occasional bit of, you know, fear and trembling going on but it's not someone's like, oh, I really just felt a sense of peace and happiness. And that's how I knew God was here. Right. That's not there. Right. So there's actually something much more spiritually objective about it. So, you know, I, as a priest, if I go and offer the Divine Liturgy, but I've had a terrible night and all kinds of things on my mind and I'm very worried and maybe I was a jerk to my wife and kids. Am I still objectively offering the Holy Eucharist? Yes, I am. And the people receiving it are still receiving it. Even though I might feel like garbage the whole time that I'm doing it. Right. It still is what it is. Right. So if we're looking for something that feels or seems supernatural to us, that is a wild goose chase. Right. And it can be frankly, spiritually deceptive because there are demons that would be happy to provide you with a quote unquote, spiritual experience. Right. So I don't know if that's a little too roundabout way of saying it, but I mean, I think ultimately we have to found it upon trust and faithfulness to Christ and, you know, believing the gospel. If we believe the gospel, then we are faithful in the following ways. And sometimes we have to be faithful even if we don't understand or know in a way that makes sense to our analytical brain. You know, because the analytical brain, while useful, can only see certain things. It can't see everything. And so we shouldn't expect it to be fed with the stuff that's going to prove, for instance, that God shows up on the altar when we ask him to. So I don't know if that helps or hinders, but. Okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5710.91,"end":5712.67,"speaker":"Unregistered: David","text":"It provides a lot of clarity."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5712.91,"end":5719.01,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. I don't know. Father, did you have anything you wanted to add or actually. Or not actually, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5719.01,"end":5774.72,"speaker":"Fr Stephen De Young","text":"But a lot of times we over intellectualize this stuff. Yeah. St. Gregory Palamas said, you know, for every argument there's a counter argument, but you can't argue with life. And so, you know, if I come to you and I say, hey, you know, my car's not running, it made this noise. And I imitate the noise. You and I could sit there all day arguing about what the of the rest right thing to do is to fix the car. Right. We could go back and forth, we could debate it, we can, we can hash it all out. And we could do the same thing with theology. What's the right way to worship? What's the right interpretation of this? What's the. We could go back and forth forever. This is exactly what St. Gregory Palabos was talking about because he said it at the end of three debates with Barlum. But if I go to my car and I say, okay, this is what I think would. Will help with the problem, and I do it. It will either help with the problem or it won't."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5775.44,"end":5775.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5776.88,"end":5783.28,"speaker":"Fr Stephen De Young","text":"And so I think the most pragmatic level answer to your question is fruit."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5785.04,"end":5786.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5786.4,"end":5840.03,"speaker":"Fr Stephen De Young","text":"If your habit of prayer and the worship you're engaging in and your pattern of being behavior, the things you're doing in your life, are drawing you closer to Christ and are bearing fruit, you'll know. And if you're doing things in your life that are making things worse and you're honest with yourself, you'll know that being honest with yourself part could be very hard. Right? Yeah, but. And sometimes you need. We need some help from somebody else. That's why the Orthodox Church, we have a spiritual father who's not me, who, when I'm deluded, can point out to me, like, yeah, the fruit you think you're getting, you're not getting. Right. You're on the wrong track. That's also why I have a wife. I get it from both sides and my whole Dutch family. But anyway, we have people outside who could check for fruit."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5840.19,"end":5840.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5840.83,"end":5842.71,"speaker":"Fr Stephen De Young","text":"And help tell us when we're on the wrong track."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5842.71,"end":5904.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And to add to that, this is also why we have know the experience of the saints saying, okay, we have these. All this experience, and this is what worked. So maybe you don't know or trust yet that that's going to work. But, but throughout all of these centuries, we've seen this work. So do that. You know, it's like, you know, often if you got kids, right, they're like, you know, if they, you know, sprained their, you know, they scraped their knee, whatever, and you say, now you need to go clean that up or else it's going to get infected. And like, no, I mean, my own kids have done this. That's not going to help. I want a band aid. Like, no, no, no, you got to clean it up first or it's going to get infected. And then you may have the band aid, you know, and they don't have the experience to know that that's what needs to be done. But I'm there, their mother is there. She's there for them much more than I am to tell them, look, this is what you're going to do. And that's what the saints do for us. They're spiritual parents for us."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5906.15,"end":5906.71,"speaker":"Unregistered: David","text":"Okay."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5907.27,"end":5909.83,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for that call, David."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5909.83,"end":5912.31,"speaker":"Unregistered: David","text":"Yeah, thank you. I really appreciate it, Father."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5912.55,"end":5920.31,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. Okay, well, here we are in the third half of the show, and now we're going to talk about the Ascension finally."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5921.11,"end":5930.72,"speaker":"Fr Stephen De Young","text":"Yes, we're going to talk about. We're going to start with the first place in which the Ascension is seen and described in the Scriptures."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5930.96,"end":5931.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5931.44,"end":5932.8,"speaker":"Fr Stephen De Young","text":"Which is in the Book of Daniel."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5932.96,"end":5945.92,"speaker":"Fr Andrew Stephen Damick","text":"In the Book of Daniel. That's right. It's depicted in Daniel, Daniel, chapter seven, verses nine through 16. And then skipping ahead just a touch, verses 26 and 27."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5946.16,"end":5959.93,"speaker":"Fr Stephen De Young","text":"And if you want to know why we're skipping, because we don't want to get into who all the beasts are and that they're not China and they're not Russia. No helicopters."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5961.61,"end":5981.31,"speaker":"Fr Andrew Stephen Damick","text":"People get excited when we talk about the Book of Revelation as well. And Daniel. Yeah, but this is Daniel, and he's talking about the Ascension. So I'm going to go ahead and read this because I think this is really good to just have in your head as we have this conversation. So, everybody, if you've got your Bible, pull that out to Daniel, chapter seven. I'm starting with verse nine."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5981.55,"end":5982.43,"speaker":"Fr Stephen De Young","text":"Sword drill."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":5982.75,"end":6103.59,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Oh, yeah, I caught that reference. All right. Okay, so verse nine of Daniel, chapter seven. And this is Daniel describing his vision. As I looked, thrones were placed and the Ancient of Days took his seat. His clothing was white as snow and the hair of his head like pure wool. His throne was fiery flame. Flames. Its wheels were burning fire. A stream of fire issued and came out from before him. And a thousand thousands served him. And 10,000 times 10,000 stood before him. The court sat in judgment and the books were opened. I looked then, because of the sound of the great words that the horn was speaking. And as I looked, the beast was killed and its body destroyed and given over to be burned with fire. Fire. As for the rest of the beasts, their dominion was taken away, but their lives were prolonged for a season and a time. I saw in the night visions. And behold, with the clouds of heaven, there came one like a son of man. And he came to the Ancient of Days and was presented before him. And to him was given dominion and glory and a kingdom that all peoples, nations and languages should serve him. His dominion is an everlasting dominion, dominion which shall not pass away, and his kingdom, one that shall not be destroyed. As for me, Daniel, my spirit within me was anxious and the visions of my head alarmed me. I approached One of those who stood there and asked him the truth concerning all this. So he told me and made known to me the interpretation of the things. But the court shall sit in judgment and his dominion shall be taken away to be consumed and destroyed, to end the, the end and the kingdom and the dominion and the greatness of the kingdoms under the whole heaven shall be given to the people of the saints of the Most High. His kingdom shall be an everlasting kingdom, and all dominions shall serve and obey him. And that's the end of verse 27. All right, so what's going on there?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6104.71,"end":6137.45,"speaker":"Fr Stephen De Young","text":"Well, so now that we've read that, let's point it a few features. People probably noticed some things while you were reading, right? But just to point out a few things and to fill in a little bit of the context that we, we left out so as not to be reading all night. And that. So Daniel, right, before this sees the, this succession of beasts, right? And when he sees them in the vision, they come up out of the sea, right? Which should have us thinking Lotan Leviathan, beast from the sea, right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6137.45,"end":6140.01,"speaker":"Fr Andrew Stephen Damick","text":"Dragons. Yeah, dragons, Hannah, dragons."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6141.21,"end":6164.62,"speaker":"Fr Stephen De Young","text":"So and these are described by the angel who, Daniel asks to explain it to him as being a succession of empires that are going to come. And so these are not any modern day contemporary, contemporary countries. It's not the eu. This is."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6165.42,"end":6166.14,"speaker":"Fr Andrew Stephen Damick","text":"Oh man."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6166.62,"end":6172.78,"speaker":"Fr Stephen De Young","text":"I know, I know. Sorry, Hal, Lindsay, what about the third."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6172.78,"end":6173.98,"speaker":"Fr Andrew Stephen Damick","text":"Eagle of the Apocalypse?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6173.98,"end":6268.37,"speaker":"Fr Stephen De Young","text":"Yeah, this is the, the Assyrians or, sorry, the Babylonians and then the Persians and then the Greeks, the Seleucids and then the Romans finally. And there's another vision in Daniel with similar content of these, these four empires. And so in the period of the Roman Empire, something is going to happen, right, which, which Daniel is foreseeing. And that's when this scene is, is convened. Now it's interesting that we noticed, noted Leviathan in the part we scared skipped, where the angel explains to him that part of the vision, he describes them as, as four kingdoms that will arise from the earth. So the beast from the earth symbolism is more Behemoth, Right? Behemoth, right. So between the vision and the interpretation, you get these empires as a combination of both, right? They participate in both of these sort of demonic forces. And so in response to this, when we're in the period of the Roman Empire, we read that the thrones are set, or in the description that the court will sit. And this is a description of the divine council. So the divine council happens. Yahweh, the God of Israel comes and Takes his seat, the Ancient of Days, so surrounded by his divine council. Note that his throne has wheels."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6268.93,"end":6270.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6270.13,"end":6340.59,"speaker":"Fr Stephen De Young","text":"That's because it's a chariot throne. But this, this being convened to deal with this last beast, right? To deal with this beast and to judge it and to destroy it. And in this context, then this other figure arrives who's described as one like a son of man. Like a son of man who looks like a human. Right. There is throughout the Book of Daniel. Maybe we'll do a whole episode on the Book of Daniel at some point in the future. But there is in the Book of Daniel at several points, a heavenly man. He's encountering these heavenly beings and several times this man who is there comes and talks to him. So spoilers. That's Christ. But yeah, yeah, so. And so is this figure, right, who looks, looks like a Son of man, this human looking one who's comes riding on the clouds and is brought before the. The Ancient of the days."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6340.75,"end":6347.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Who's described as looking like an old man, you know, long white beard, the whole nine yards. Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6348.43,"end":6381.36,"speaker":"Fr Stephen De Young","text":"And then the Ancient of Days, Yahweh, the God of Israel, because he possesses this, gives all of the authority and dominion to the Son of Man. Right. And so he then has this power to rule over all the dominions. Right. The territorial spirits who have had been governing the earth are now subject to him. He now rules everything. But notice also in the description, right. Of the. In the explanation of the vision, it says that the kingdom is received by the people of the Saints of the Most High is how."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6381.36,"end":6385.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's translates verse 27. Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6386.04,"end":6437.14,"speaker":"Fr Stephen De Young","text":"So it's both received by the Son of Man and by the saints, Right. The people made up of the Saints of the Most High. So those are just pointing out some features. So what those features would have clued in to an ancient reader, right, in the ancient near east, is that this is sort of a remix again and an inversion in many ways of a story from the BAAL cycle. Yeah, Here comes our old friend BAAL again. And that is the scene of his enthronement, which we've told a couple of the stories in a little more detail from the BAAL cycle. This one we haven't gone through in the same detail, but so this story involves BAAL the Son and his father."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6437.14,"end":6437.5,"speaker":"Fr Andrew Stephen Damick","text":"El."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6439.26,"end":6447.75,"speaker":"Fr Stephen De Young","text":"Who is depicted in Canaanite depictions of El as a very old man with a long white beard."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6448.55,"end":6462.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So the Daniel language for the Ancient of Days is basically saying the Most High God, who is the Father, is not El, it's Yahweh."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6463.03,"end":6463.39,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6463.39,"end":6525.82,"speaker":"Fr Andrew Stephen Damick","text":"And is taking the El imagery and applying that to Yahweh. And I think it's important to realize that this is not syncretism. Right? This is not syncretism in the sense of like saying, oh, we're going to take this L language and we're going to, you know, we're going to worship him, we're going to change his name and we're actually worshiping the same God. Just like for instance, and we didn't mention this in this episode, but you know, the priests of Israel, the way that they're dressed, the way that God commands them to be dressed is basically the way that BAAL idols were dressed. Right. You know, that same, you know, this idea that, well, that's the way you treat an image of your God. Well, actually we're the image of the one true God. And so the imagery is being co opted, not in a syncretistic way, but to make an actually, to make polemical point, really. Right. And so this is another example of that."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6526.22,"end":6550.71,"speaker":"Fr Stephen De Young","text":"Right. And, and this is saying, you know, all those things that you keep saying are true of L aren't true of L. Yeah, right. They're actually true of Yahweh. And likewise, the imagery that's usually attributed to baal, one of his primary titles as a storm God is the cloud rider."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6551.27,"end":6552.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6552.27,"end":6584.72,"speaker":"Fr Stephen De Young","text":"He's the one who rides on the cloud. So not only is the real most high God, not El, it's Yahweh, but the, the real divine son in the council, the one who really rides on the clouds is this human looking one, Son of man. Right. Who is the son of man, who is the true son of God, who appears human and who is also Yahweh. Right. He doesn't have a different name."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6585.44,"end":6645.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, and, and another thing that's a big contrast is the relationship between the two figures within each narrative. Right. So in the BAAL story, BAAL shows up to El and demands, give me a palace, give me a temple to reside in so I can be enthroned. And El is actually kind of afraid of BAAL because he remembers how he got in that position. Right. You know, he's like, yeah, he doesn't want to give it to him. You know, he's afraid of setting him up and, you know, having him be powerful. And note again the contrast between the Father and our Lord Jesus Christ, the Son of God, who is simply approaches his Father and his Father gives him the dominion. There's no struggle there's no rivalry. It's just love and humility. You know, it's completely different. Completely different."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6646.39,"end":6661.67,"speaker":"Fr Stephen De Young","text":"And here's where the BAAL story really goes off the rails. This is the fun part. Part. So since El doesn't want to give Bale this. This palace temple, Bale goes and talks to his wife, who also happens to be his sister."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6662.39,"end":6662.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6663.35,"end":6731.76,"speaker":"Fr Stephen De Young","text":"And El's daughter, who is named Anat. And Anat, as you might imagine, if you're gonna have, you know, the main goddess of an ancient Near Eastern pantheon is a fertility goddess. Seen as a fertility goddess. And there's sort of a parody there where you've got BAAL as a storm God. Right. Sends the rains, and then those rains are received by the ground, and fertility brings forth crops. So you've got a certain parallel there that all seems nice. Except Anat is also a goddess of brutal warfare who is described and depicted as wearing a necklace made of severed human heads and a belt made of severed human hands. So I hope if we ever have a Lord of Spirits convention, that we have it in November so that people can hit up the spirit Halloween store clearance sale before it closes down and get there. Anatomy cosplay together. Right. Because that would be great."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6735.36,"end":6737.28,"speaker":"Fr Andrew Stephen Damick","text":"Just lost a bunch of parents amongst her."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6738.64,"end":6739.28,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6739.28,"end":6740.08,"speaker":"Fr Andrew Stephen Damick","text":"Turn that off."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6741.2,"end":6752.24,"speaker":"Fr Stephen De Young","text":"So she goes. And again, this is kind of awkward, but uses her feminine wiles on her own father."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6753.04,"end":6753.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6754.25,"end":6778.57,"speaker":"Fr Stephen De Young","text":"To convince him to give her brother husband what he wants in terms of the. The palace. And El sort of finally agrees. I think it is probably not coincidental the way the story of the beheading of St. John, the forerunner, kind of mirrors this."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6779.38,"end":6782.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But that's another future episode."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6782.3,"end":6788.94,"speaker":"Fr Stephen De Young","text":"I'll leave that to Pedro. So, but."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6788.94,"end":6789.22,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6789.22,"end":6814.52,"speaker":"Fr Stephen De Young","text":"And then it says in the BAAL side that BAAL then has all. All rule in the heavens once he's been enthroned. And now contrast this with all dominion in heaven and on Earth. Earth in the Daniel story. Right. Because El and BAAL don't have control over the whole earth."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6815.64,"end":6817.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're local, relatively speaking."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6818.68,"end":6844.13,"speaker":"Fr Stephen De Young","text":"And so. Yeah. And so this is. But this is related to the way the whole kingdom of heaven language that comes up in the. In the Gospels, in particular the Synoptic Gospels, we tend to. Because it's translated with the word kingdom, that's very reified. It's a noun. Right. We think of kingdom as an object, but the word is really more about the rule or dominion."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6844.37,"end":6846.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kingship or of God."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6847.01,"end":6863.2,"speaker":"Fr Stephen De Young","text":"Right. It's about that. The extension of power and authority. And so when we, for example, in exclamations and worship, say, thine is the kingdom and the power and the glory, we mean thine as opposed to anybody else's who may claim."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6863.92,"end":6864.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6864.44,"end":6865.36,"speaker":"Fr Stephen De Young","text":"That it's theirs."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6865.52,"end":6893.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's so much language in Scripture and in the orthodox liturgical tradition that is precisely expressing. I was going to use the word rivalry, but it's, it's not rivalry because God has no rival, but it's, it's, it's, it's, you know, it's offering these corrections, like, for instance, the earth is the Lord's and the fullness thereof. The earth is the Lord's and not anyone else's. Thine is the kingdom, not anybody else."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6895.17,"end":6933.19,"speaker":"Fr Stephen De Young","text":"Right, right. So then when we get to the New Testament. So if you understand Daniel's vision and you understand how it's reworking and inverting this BAAL story and what's going on there, Daniel's vision, when you read about. We're finally getting to the Ascension here at the end of the episode, when you finally get to the descriptions of the Ascension in the New Testament, in the Gospels and in Acts, you find that they're deliberately connecting what's going on to what Daniel saw."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":6933.91,"end":7033.81,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. Yeah. So then the most probably obvious would be in Matthew, chapter 28, verses 18 through 20. And this is part of. Is it the whole thing? I don't think it's the whole thing, but part of the first Eothenon Gospel. And of course, also some of this is read at a baptism. So chapter 28, starting with verse 18, Jesus came and said to them, all authority in heaven and on earth has been given to me. Go, therefore, and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you. And behold, I am with you always to the end of the age. This is what the Lord says right before he ascends into heaven. All authority in heaven and on earth has been given to me. So he's entering into his rest. He's going up to his enthronement. Right. And so because he's taking that position, he says, now you go out now and make disciples of all nations, baptizing them, teaching them to do all these things, teaching them to become faithful, and I'm with you always to the end of the age. Which is not an ironic statement because he's about to ascend and go away somewhere. It's actually, I'm going to go and be enthroned. And now you are going to participate in my rule. You are going to co claim this. You're going to do the thing that Adam failed to do by bringing the paradisaical experience of God's presence into all the world and driving out the demons who have been oppressing it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7035.17,"end":7039.25,"speaker":"Fr Stephen De Young","text":"And that. That has been given to me. We gloss over really quickly."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7039.81,"end":7041.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To get to the rest of it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7041.82,"end":7048.22,"speaker":"Fr Stephen De Young","text":"Has been given to me. Right. By who? By the Father. Which is exactly what Daniel saw."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7048.62,"end":7049.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7049.26,"end":7055.42,"speaker":"Fr Stephen De Young","text":"The Father giving Christ all authority and all dominion in heaven and on earth."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7055.74,"end":7061.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, we got a passage from Acts, Father, you want to address that one?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7062.46,"end":7177.4,"speaker":"Fr Stephen De Young","text":"Sure. So in Acts 1, verses 6 through 11, which also describes the ascension. This is St. Luke has a brief description at the end of his Gospel of the Ascension, very brief. But then at the beginning of the Acts of the Apostles, he fleshes it out a little more. And so in Acts 1, beginning in verse 6. So when they had come together, they asked him, lord, will you at this time restore the kingdom to Israel? He said to them, it is not for you to know times or seasons that the Father has fixed by his own authority, but you will receive power when the Holy Spirit has come upon you. And you will be my witnesses in Jerusalem and in all Judea and Samaria and to the end of the earth. And when he had said these things, as they were looking on, he was lifted up and a cloud took him out of their sight. And while they were gazing into heaven, as he went, behold, two men stood by them in white robes and said, men of Galilee, why do you stand looking into heaven? This Jesus who was taken up from you into heaven will come in the same way as you saw him go into heaven. So a couple things there, right? One of the most obvious and important ones is that cloud that shows up. So this isn't a reverse of the opening to the Simpsons, right? Where just like Christ goes up into the sky and then a cloud drifts over and you can't see him anymore. Right? This is. This is talking about, right? The cloud taking him away is actually carrying him away. He is riding on a cloud, which is exactly how. How Daniel sees him arrive in heaven, Right? So same event. And you notice that, that. That kingdom language is here too, right? Is now when you're going to restore the kingdom to Israel, right? That's not saying. Or you're going to give us your. Our own king now."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7178.36,"end":7180.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7180.4,"end":7195.72,"speaker":"Fr Stephen De Young","text":"Are we. Are we going to be an independent kingdom from the Romans Again, like we were with John Hyrcanus. Right. That's not what they're getting at. Right. Because remember, kingdom is this, this rule, the power of God. Right. That's what Israel's been missing."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7197.33,"end":7197.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7197.65,"end":7218.45,"speaker":"Fr Stephen De Young","text":"That's what Israel has been missing. And so he says, look, you don't worry about the big picture stuff. Here's your assignment. Right. And the assignment he gives them is actually how that dominion is going to be returned to the Israel of God, which is going to be them. Right, Church?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7220.53,"end":7286.12,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Okay, now we've got one from Mark, chapter 14. This is again from the ascension account. And Jesus said, I am and you will see the Son of Man seated at the right hand of power and coming with the clouds of heaven. And in our pre show discussion, Father, you pointed out that the verb about them seeing him is a little odd and it kind of means from now on. So I am. And from now on you will see the same Son of man seated at the right hand of power and coming with the clouds of heaven. And again, this is the exact same imagery of the ascension as depicted in Daniel. You know, he's the cloud rider. He's seated there at the right hand of power. Everything that's about to proceed after that with the apostles going out into all the world and the expansion of the church, all of this is about the extension of the rule, rule of God into the world. Yeah. Mark, of course, much more terse as, as always in his gospel. So. Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7286.12,"end":7345.8,"speaker":"Fr Stephen De Young","text":"And. And of course, right. This is also, if you want an Old Testament verse that's talking about this Psalm 110 or 109, verse 1. The Lord said to my Lord, sit at my right hand until I make your enemies your father. Footstool. This is the most quoted Old Testament text in the New Testament over and over and over and over again. Right. Christ quotes it to the the scribes of the Pharisees. Big chunk of the verse of the the book of Hebrews is based on interpreting shows up everywhere. And that's because this is the place where the apostles and the new test other New Testament writers found themselves. Right. That Christ had ascended and was seated at the right hand of the Father and now was ruling for this period of time until the ultimate defeat of his enemies."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7346.2,"end":7352.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, cool. Okay, so the last one we're going to look at is from Revelation to."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7352.68,"end":7354.04,"speaker":"Fr Stephen De Young","text":"Disappoint all the Baptists."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7354.28,"end":7524.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. I was a disappointed Baptist once. Revelation 20, verses 4 through 6. Then I saw thrones, and seated on them were those to whom the authority to judge was committed. Also, I saw the souls of those who had been beheaded for the testimony of Jesus and for the word of God, and those who had not worshipped the beast or its image and had not received its mark on their forehead, foreheads or their hands, they came to life and reigned with Christ for a thousand years. The rest of the dead did not come to life until a thousand years were ended. This is the first resurrection. Blessed and holy is the one who shares in the first resurrection over such. The second death has no power, but they will be priests of God and of Christ, and they will reign with him for a thousand years, right? So obviously, this is the. I say obviously. Obviously. If you've listened all the way to this 20th episode of the podcast, you can see that this is the divine council, you know, these thrones set up, plural, notice again, it's plural. And that, you know, these who have been these martyrs, those who have been beheaded, right, they come to life and they reign with Christ. They are given this authority to judge, right? They are participating now in the ascension. Because the ascension is not just a matter of going up. It's a matter of this path. This is where we started, right? With the big footprints, the path to the throne, the path to the enthronement, the victory at the end of all the works being done. And now these saints have participated in that. They have been doing the works of God. They have walked the same path with Christ, and they are now seated on thrones beside his, and they reign with Christ. And this is, as St. John says here, this is the first resurrection, this experience of these saints, right? And, you know, they are priests, as it says, of God and of Christ reigning with him. What does it mean that they're priests? Well, priests basically have two jobs. They offer sacrifices and they intercede for others. And we see them, especially there in Revelation, interceding before the throne of God. So this is the telos of mankind's possibility that he joined Christ in his ascension and that he reign with him next to him. He participates in those same works, having participated in those works along the way, having walked the path, you know, with the big footprints, you know, the path of God himself, right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7525.51,"end":7533.99,"speaker":"Fr Stephen De Young","text":"And St. John here, I mean, it's beyond doubt. He's using the same language Daniel used about the thrones being set."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7534.47,"end":7534.87,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7534.95,"end":7591.32,"speaker":"Fr Stephen De Young","text":"And right after the passage you read is where the dragon is judged, just like the beast is judged in Daniel, right? So St. John is describing the same scene that the prophet Daniel is. And so this isn't you know, Daniel talking about one thing and St. John talking about something else in the future. This is part and parcel of the Ascension and the enthronement. And this is part and parcel of. He's drawing on what Daniel is talking about when he described how the vision was interpreted to him, that when the kingdom is entrusted to Christ, when he receives the dominion, that dominion is also received by the people of the Saints of the Most High. And they reign and rule with him for this period of time in the midst of his enemies. Right. And they. And they live to serve as priests and intercede, and they rule with him until the time comes for the end."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7594.6,"end":7963.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that's the end of our third half. And just to give some final thoughts, you know, so there are a couple of things that struck me in this discussion. One, of course, is like we were just talking about where these visions that are seen in the Old Testament and these actions by God in the Old Testament are not just predictions of something that's going to happen in the New Testament or some other time in the future. They are participating in the same reality. Right. So now there is a change. I mean, we pointed out a couple of discontinuities between the Old and the New Testament, or things that are transformed along the way. So what you get with the coming, of course, Christ into the world is fulfillment of the Old Testament. And as Father Stephen loves to point out, fulfill does not mean there was a prediction and then it came true. Nor does it mean, like in the case of the Mosaic Law, it's abolished, it's over, but rather fulfilled is what it actually says. It's fulfilled. It's filled up to the full. Right. So the cup has something in it, and then it's filled up to the. The full in the end. So Daniel sees the ascension. I mean, he's not predicting the future. He sees it happening. He's participating in his way in his time, if we need to talk about it that way. And then St. John sees it as well. And he's also participating in his own vision, even though, if we think about it in terms of timelines, he's seeing it after it's already happened. Right. But he's not just seeing the event of Christ ascending into heaven, but he's also seeing what that means in terms of his enthronement and the saints enthroned alongside him. We're seeing John himself now is one of those as well, participating in the first resurrection. Right. So that was one thing that really occurred to me. And the other one was I was really just struck by the Sabbath imagery. You know, that God enters into his rest after creating the world, that Christ enters into his rest after completing the creation, right? It's not that the creation gets completed multiple times, once in Genesis and later there again they're participating in this same singular reality of the acts of God. It doesn't work out in terms of chronological timelines and time travel and whatever doesn't work out because that's not the way to understand the way that these things work. But then also, I mean, this for me was actually sort of almost a personal revelation really, because I had never heard this before. But looking at all this now, it's so clear that the Sabbath that was made for man, it's not, as we said earlier, it's not man needs a break so he can take the weekend off or one day. The Sabbath that's made for man is the ascension and the enthronement and the participation in God's rule that was made for man. That's what was made for man, right? And so that's astonishing to think about on the macro level, right? But if you think about it just in terms of your own daily, quote, unquote, mundane life, right? You might think, well, that's not what I do on the weekend. I'm not ascending into heaven and ruling with God like, well, actually, if you're going to worship, then you are. You are. You're walking that path. You're going to the place where the Lord's enthroned. You're participating in his rule, right? And the beautiful thing is that the Sabbath is not just a day on the weekend. Now, that's one of the ways that we ritually participate in it, right? But really, we're being called to extend the Sabbath out outwards so that all of our lives involve this. Now, by that, I don't mean that your whole week becomes a weekend. That's not what I'm saying. Again, that's a very sort of material way of reading this. But the point is that we turn the world by participating in God. We turn the world into participation in his rest, in his harmony, his creativity, his beauty, his rule, his love for all mankind. There's a reason why when a parish community is working well and it's at peace and everyone's serving one another, that there is this warmth of love that's there. And the reason is because the people are actually experiencing this rest, this ascension, this enthronement, this rule, this order, this beauty, this harmony of God that's What they're experiencing, they are participating in it, and so it changes them. And then they are sent at the end of the Divine Liturgy, just as the apostles were sent to go into all the world and to bring this Sabbath everywhere that they go. And it's not the only way of looking at the Ascension, but to me, it is now just a really answer, utterly, astonishingly powerful way of looking at it and then being inspired to participate in it. So, yes, we go to church and celebrate the Feast of the Ascension, but in doing that, we're actually seeing on a day what it is that we do all the time and what it is we're called to do every day and what our final destiny in Christ, Christ through faithfulness, actually is. Father."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":7965.66,"end":8275.77,"speaker":"Fr Stephen De Young","text":"So when Daniel had his vision, and that vision was recorded and given to God's people, and when the Gospels and the Acts of the Apostles were written and described Christ's ascension, and when St. John refused, received his vision and wrote the Book of Revelation, and they wrote about this reality we've been talking about tonight. They did it to people who were suffering. Not people who are suffering from insecurities, not people who are suffering from sort of low grade inconveniences and minor problems, but people who were suffering, people who were enslaved, people who had family members being killed, sometimes in front of them, sometimes tortured to death for trying to be faithful to God. And in all of these cases, what this vision proclaims very powerfully is that regardless of who claims to be Lord, whether it's Nebuchadnezzar, whether it's Cyrus or Darius, whether it's Antiochus Epiphanes, whether it's Caesar, whoever claims to be Lord isn't. Whoever claims to be Lord is a pretender and a fake, just like the gods they worship. Because the one who is truly Lord, our Lord Jesus Christ, he is the one who has all dominion and authority on earth. The only thing the fake lords can do is kill and destroy. They're sort of like Janus and Jambres, the magicians in Egypt, right, Who come to this sometimes gives people problems because they're like, well, how could they replicate what Moses did? Well, think about what they replicated. Right through Moses, all of the drinkable water in Egypt is turned into blood, except for a very little bit. And the magicians show up and turn that last little bit into blood and make it undrinkable. Thanks. And then, you know, Egypt is infested with frogs and vermin and they're like, hey, well, we could make more frogs and vermin. So, yeah, they can destroy, they can kill, they can't create, they can't do what God does. And so in their anger and to try to prove that they're really Lord, they will come and they will inflict suffering. They will come and kill the people of God. They will come and attack them at the behest of the gods that they worship. But what we see in the saints and the martyrs is because they had had this same vision, like St. Stephen had this vision, the vision we see described of Christ enthroned. They would literally, in some cases, mock the people who were torturing them to death. They would make jokes as they were being fried on Iraq that they were done on the one side and needed to be flipped over like St. Lawrence. They would ignore, right, the sufferings. They were unimportant. Because the truth is that no one can harm the righteous man, the person who loves Christ and belongs to Christ. The worst they could do to you is kill you. And when that happens, you go to rule and reign with him, including ruling and reigning over and eventually judging that person who murdered you. That's the promise that we have in this vision. And so if we really understand what the ascension is about, this should give us a lot more confidence in the way that we live our life. This is where St. Paul got his confidence. Despite the shipwrecks and the beatings and the. The persecution and the hatred and the mocking he took. He knew that for him to live was Christ and to die was gain. And so he didn't have to be afraid of anything or anyone. Anything anyone did to him would ultimately work for his benefit, for his blessings and his glory, and blessings and glory that are eternal over against sufferings that are temporary, even if they go on for our whole lives here on this earth. So that, to me, I think, is sort of a takeaway. If we really have this vision before us, then all of a sudden we don't have to worry about who's president. We don't have to worry about whether certain bills pass Congress. We don't really have to worry about any. Anything anymore, because we serve and more importantly, are loved by the God who rules over all of it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8280.01,"end":8309.06,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that is our show for tonight. Thank you, everyone, for tuning in and listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast. Facebook page. We read everything but cannot respond to everything. You guys send us a lot of email. We love it though we do save a lot of what you send for possible use in future episodes."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8310.02,"end":8320.51,"speaker":"Fr Stephen De Young","text":"And I'm back off Facebook, but never again is what I swore the time before. Join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8320.99,"end":8331.23,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, like our page and join our discussion group, leave reviews and ratings everywhere. Most importantly though, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8331.79,"end":8339.07,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8339.47,"end":8343.23,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you and Happy Feast of the Ascension."}
{"episode_id":"LOS - #021 - 2021-06-10 - The Heavens Made Ready His Throne","start":8355.72,"end":8392.78,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of of many angels round about the throne, and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
