{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":0.24,"end":64.92,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":67.24,"end":249.23,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits Podcast. Merry Christmas. I'm Fr. Andrew Stephen Damick on the edge of Pennsylvania Dutch country in Emmaus, Pennsylvania and with me is my co host Fr. Stephen DeYoung, broadcasting from the middle of Cajun country in Lafayette, Louisiana. And this is a pre recorded epis to the podcast. So even though you're going to hear the voice of Steve telling you how to call in, if you call during this episode you're not going to get anybody. Everybody's either having some kind of Christmas Eve dinner or at church or something like that. So yeah, this is a pre recorded episode but we have tried to incorporate some of your pre recorded messages that you sent us. So it's a little bit different. But the this is going to be a great episode and I think you're going to enjoy this one. This is our Christmas special. So in response to a Judean uprising, the Romans leveled Jerusalem and destroyed the Temple in the year 70, later renaming the city to Elea Capitolina and refusing re entry by any Jews. But less well known however during this period of Judean revolt from A.D. 66 to 73 is that the Romans also invaded Galilee in A.D. 67. During the first century the Romans leveled and rebuilt a number of places in the Holy Land. This was the Roman way of letting a local populace know that their rule and culture would dominate and brook no competition. A paradoxical benefit of this campaign of leveling and burying of settlements is that many places have been preserved and are now being excavated by archaeologists. And among those places are synagogues in the area of Galilee where Jesus Christ was raised and where he himself would have entered for prayer and teaching. So if we imagine for a moment Jesus entering into one of those Galilean synagogues, we can see in our minds the stone construction details, like the names of donors and important community members inscribed in mosaics. But there's something else in the mosaics that have been unearthed in our time that may surprise and even shock you. When Christ entered to pray and even to preach in nearly any Galilean synagogue in the first century, quite prominently displayed in mosaic would have been an image of the 12 signs of the zodiac. What can this possibly mean? Were ancient Judeans syncretistically incorporating pagan astrology into their synagogues? And if so, why didn't Jesus protest this? Astrology means stars. And of course, we all know that Christmas famously involves a star, the star of Bethlehem. For this very special Christmas episode of the Lord of Spirits, we're going to be talking astrology. So, Father Stephen, why would first century Jews put zodiac imagery in their synagogue? What's that about?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":250.19,"end":351.27,"speaker":"Fr Stephen De Young","text":"Well, it turns out Jewish astrology is a thing. Yeah, there's Jewish astrology and not just sort of a. Some medieval thing that happened in Western Europe where Jewish people sort of took on astrology as it existed in sort of alchemical circles or hermetic circles or as an esoteric thing, but goes all the way back to ancient Israel. And basically all of ancient Israel's neighbors in the ancient near east having a firm sense of what we would now call astrology. And so we've read a bunch of times. We won't read it again because it's long, but we've read a couple times now in discussions about the sun, moon and stars and angelic beings, that quote from Philo of Alexandria where he's talking about really this difference, the difference between the nuances between the Jewish view of the sun, moon and stars, and therefore astrology, and the more general pagan view. But we may recall that in that quote, he talks about how the sun, moon and stars aren't sort of. He calls them gods. He doesn't hesitate to do that. But they aren't gods in the sense of being worshiped and being sort of independent powers in the heavens, separate from Yahweh, the God of Israel, but that they're sort of lesser ranking officials in his divine government over the. Over the creation."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":351.27,"end":371.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So both Jews and pagans have in common this idea that heavenly bodies are closely associated with divine beings, but the difference is that you don't worship them if you're the worshiper of the one true God and you're not subject to them either. Right. Which is really important for what we're talking about tonight."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":371.94,"end":377.46,"speaker":"Fr Stephen De Young","text":"Yeah. Well, not in the same sense. There is still that they are still part of the government."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":377.7,"end":385.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So in a lesser way, you're under their authority, but they're not controlling your life."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":386.42,"end":425.23,"speaker":"Fr Stephen De Young","text":"Right. But the language of the sun to rule the day and the moon and stars to rule the night is all over the place in the Old Testament. And we gloss over that rule verb very quickly, but it actually is there. And so what Philo really wants to hammer on is that they're not independent, meaning God rules and acts through them. They don't sort of act on their own or have their own authority or control."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":425.23,"end":430.91,"speaker":"Fr Andrew Stephen Damick","text":"They're his emissaries or exarchs or ambassadors or however you want to put it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":431.39,"end":477.47,"speaker":"Fr Stephen De Young","text":"Right. And this isn't just talking about the individual stars and the sun and moon. For example, in the book of Jubilees, which is one of the many Old Testament adjacent texts in the Orthodox Church, if you are Ethiopian, then it's in your Old Testament. Otherwise it's adjacent Jubilees 1215, it says all the signs of the stars and the signs of the moon and of the sun are all in the hand of the Lord. And the signs language there is important. It's not just the sun, moon and stars, but the signs of the sun and the moon and the stars, meaning their movements, their positions, their tracks."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":477.47,"end":494.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now we're talking astronomy sort of. Right. At least that's how we'd understand in the modern world is, you know, these things moving around or at least appearing to move around from our point of view. But for ancient people, they saw them moving. I mean, they. They understood that they were in motion."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":496.06,"end":523.83,"speaker":"Fr Stephen De Young","text":"This is one of the big barriers for us as modern people trying to read ancient Near Eastern texts. To put a fine point on it, we don't know much or care much about ancient astrology. We've kind of written it off as. We've written off, as we've talked about on the show, as sort of materialists. We've written off a lot of ancient things as silliness and superstition. But astrology is probably exhibit A."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":524.39,"end":602.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. There's this. Yeah. I think that. That just as, you know, we've talked about, for instance, the modern view of ancient pagan gods is like, oh, look at those ancient pagans. They saw lightning and thunder and earthquakes and the ocean, and they. And they made up gods to explain all that. I think the modern view of ancient astrology is, oh, look, you know, ancient Peoples looked up at the sky and they saw the stars and the sun and moon moving around, and they assumed that. That they could sort of read some kind of. It's like fortune telling, you know, like they could read something in there or, or they, since they saw them moving around, they assumed, well, that they must have some direct influence on us. And you know, a modern person then says, well, like, okay, yes, maybe some distant star is actually exerting gravitational force on you. But it's so microscopic as there's no way it's going to determine your. Your personality and the outcome of your life. And much less coming up with a horoscope that shows up in the daily paper, it just becomes kind of a big joke. Because of course, we're scientific and we understand and know that you can't read the future by looking up at constellations. Right. But that's not the way that ancient astrology actually worked. Right. That's not what they understood themselves to be doing."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":603.46,"end":670.08,"speaker":"Fr Stephen De Young","text":"Right. And when you look at any ancient Near Eastern text, and just to take an example that we've referred to before, we referred to back in the 5ish falls of the Angels episode when we were talking about the fall of the devil and we were talking about the different accounts of that in the Old Testament, the one in Isaiah that refers to him as hello, Ben Shakar, that would later get translated, Lucifer, son of the morning. That the Helel Ben Shakar language and the way it's told in Isaiah seems to draw on ancient texts about the fall of the God Enlil. So just to use those Enlil texts as an example of this, on Earth, there's what we would call a political shift at that time, where Babylon in particular takes political supremacy away from Sumeria. And so there's this shift in the power base from one city to another within Mesopotamia."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":670.08,"end":670.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":670.72,"end":721.26,"speaker":"Fr Stephen De Young","text":"We would say there's a political shift. Then mythologically, there are stories that the God Enlil of the cities that are losing power sort of falls, ends up in the underworld, and is replaced in his position in the council of gods by another God, by Marduk in this case. And then there's also layered into the text various astrological signs that this has happened where stars and constellations that are related to these gods change their position in the heavens. And these are seen to be signs of this shift that has happened in the council of the gods."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":721.42,"end":721.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":723.1,"end":767.98,"speaker":"Fr Stephen De Young","text":"And that even bleeds into the biblical account. Right. Because he's Lucifer, son of the morning, he's associated with the morning Star, which is the planet Venus, strictly speaking. So that astrological connection even comes over into the prophet Isaiah's reference to it. But within these enlil texts, the writer and the reader moves back and forth between these layers, sort of what we would call the political layer, what we would call the mythological layer or the mythical layer, and the astrological layer. Back and forth. These are all interrelated and mirror. They're like layered transparencies, one over the other."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":768.06,"end":776.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's like one sort of set of events that's playing out both in heaven and on earth at the same time."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":777.34,"end":792.97,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. In heaven, earth and the heavens. Yeah, in all three. Because it's all connected. Because it's all connected and they move back and forth. In our modern materialist view, we, of course, have separated these things."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":793.05,"end":793.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":794.09,"end":807.37,"speaker":"Fr Stephen De Young","text":"So we've got the political, the religious astrology that we would assign to superstition. Right. And we separate these things. And if you're a real materialist, you say only the political one is real."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":807.53,"end":808.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":808.65,"end":828.29,"speaker":"Fr Stephen De Young","text":"The other ones are just sort of imaginary and are being used to justify things in the political realm or explain things in the political realm. But they're. They're not real. But for ancient people, all three of these are real, and you have to have sort of all three transparencies layered over each other to look at it and see the whole event and really understand what's going on."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":829.01,"end":847.15,"speaker":"Fr Andrew Stephen Damick","text":"Now, would they have understood it in a sort of causative sense? Like there's this thing going on between gods, and so therefore, we on Earth are being deterministically made to play this out politically or. I mean, what exactly is that relationship?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":848.19,"end":868.03,"speaker":"Fr Stephen De Young","text":"Yeah. Determinism in this case is like turtles. It's determinism all the way down. So this is. And this is something people miss. An ancient myth, the gods had their fates determined just like everybody else."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":868.03,"end":911.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's not like they're the ones with free will. And in an absolute sense, and we're just ants that they're stepping on. Yeah, I recall. So, like, for instance, in Greek myth, you've got the idea of the three fates. Right. Who are measuring out these cords that are people's lifetimes and then cutting them at the appropriate moment. And that's what determines your fate. It's fate fatalism. But that applies to gods and to men. It's not just us lowly mortals. Right. Because gods can die, gods can lose their battles, they can be cast into the abyss."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":912.05,"end":953.17,"speaker":"Fr Stephen De Young","text":"Yeah. And in Norse mythology, you've got the nornir who are the same kind of thing. Who are these three sort of witches who determine the future, determined fate? And all of the Norse gods are fated to die in Ragnarok, and they can't sort of escape that. In fact, a lot of Norse myth is them trying to escape that fate. Right. They have this doom hanging over them, which is also, of course, paralleled in the Christian story, because all of those demons do have doom hanging over them, coming at the end, and are unable to escape it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":953.17,"end":1002.78,"speaker":"Fr Andrew Stephen Damick","text":"It's an interest. Interesting. It's an interesting thing, actually. I'm about to study Norse myth much more deeply as part of the MA work that I'm doing. And it's an interesting point, actually, that almost all Norse myth that we have. So for instance, the Eddas are one of the big sources of Norse mythology. They're all written down and preserved by Christians. And I kind of wonder sometimes, like. So a lot of mythology, as we've said, is kind of demonic propaganda. But I wonder sometimes, like, Snorri Sturlson, who is the guy who, who put down the eddas, he's a 13th century Christian, you know, did he kind of say, well, that's wrong. I'm going to fix this? You know, was there a little bit of editing happening? I don't know. I'm not a textual critic of Norse myth. But it's an interesting point, though, something."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1002.78,"end":1008.82,"speaker":"Fr Stephen De Young","text":"Something useful to ponder and. Yeah, spoilers. There was a lot of editing."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1009.94,"end":1015.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, I've known that there was. I'm just not sure exactly what the details are. Yeah, the."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1015.91,"end":1027.75,"speaker":"Fr Stephen De Young","text":"The most obvious example of that is Beowulf, where versions we have of. Of the Beowulf story. Grendel's descended from Cain, right? Yeah, it's completely been."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1027.91,"end":1029.71,"speaker":"Fr Andrew Stephen Damick","text":"There's biblical stuff in there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1029.71,"end":1051.92,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So, yeah, so this is. This is all layered together. And the Bible is an ancient Near Eastern text. So what's true of those texts, including this astrological layer, is also true of the Bible."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1052.8,"end":1166.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Welcome, everybody. Here's another surprising thing going on in the Bible. Yeah, Astrology in the Bible, it's not just poetic language. I mean, we've kind of talked about this a little bit before that, you know, the references to the sun and moon, stars are not just poetic language. But now we're kind of going deeper into the rabbit hole that there is actually astrology going on in the Bible. And I think it's important. Again, I mean, we've already said this, but let's just underline that the astrology of the scriptures, the astrology of Israel is not the astrology of ancient pagans. And it is also not, although it's related, it's closely related to, and it is also not the astrology of the horoscope in your local paper. I don't know if they even do those anymore, but it's barely related to that, if at all. So we should just kind of point that out. When you heard that word astrology, we're not engaging in syncretism again. We're going to be looking closely at the scriptures and seeing what's actually going on there. All right. Yeah, I think that's some good preliminary ways to. To point it out. And related to that, we got a question that was sent to us and recorded for us from Richard Roland, who is a listener of this podcast and also is now becoming the co host, the persistent co host of the Amen Seoul Podcast, thus continuing this idea that these are really just one podcast with two different iterations. So let's listen to the question that Richard sent us. Greetings, fathers. Christ is born. I would like to hear your take on astrology and its possible impact on one's personality traits, characteristics, etc. And here I'm not really talking about or even interested in the modern horoscope, but more in things like where in."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1166.09,"end":1168.69,"speaker":"Fr Stephen De Young","text":"Medieval literature, for instance, in Dante's Divine."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1168.69,"end":1173.61,"speaker":"Fr Andrew Stephen Damick","text":"Comedy, we do encounter the idea that because the stars and planets are angels."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1173.61,"end":1177.53,"speaker":"Fr Stephen De Young","text":"Who do have some impact and even influence on the world, there is some."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1177.53,"end":1181.31,"speaker":"Fr Andrew Stephen Damick","text":"Kind of a relationship there between us and them, but not to the extent."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1181.31,"end":1189.27,"speaker":"Fr Stephen De Young","text":"That it either overrides our free will or takes away sort of our personal responsibility. I would love to hear this discussed from an orthodox point of view."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1189.59,"end":1221.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what about that? I mean, you know, Richard seems to be alluding. You know, he mentions he's not talking about modern horoscopes, but he's trying to help us figure out what's going on here. What is the sort of relationship between us and the stars, angels, and what does that have to do with free will? We've touched on that a little bit, but let's just kind of flesh that out a little bit. Especially the difference between the pagan understanding and the understanding of the scriptures."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1222.26,"end":1227.78,"speaker":"Fr Stephen De Young","text":"Yeah. And since we've said we were doing this episode, we've gotten a lot of questions about modern horoscopes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1227.78,"end":1237.06,"speaker":"Fr Andrew Stephen Damick","text":"Astrology. Yes. Yeah. Lots of people sent us long questions about horoscopes and modern astrology. And I hope that this episode actually helps with a lot of that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1237.7,"end":1256.34,"speaker":"Fr Stephen De Young","text":"Yeah. So we've already talked about A couple of distinctions. One being that obviously we don't see the sun, moon and stars as being gods that function independent of the creator of the universe."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1256.34,"end":1256.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1258.42,"end":1312.69,"speaker":"Fr Stephen De Young","text":"And not as a separate. Separate entities who control things of their own independent wills. And that means the flip side of that, that what we are saying is that like all angelic beings or spiritual beings, that these are beings through whom God can work in his creation, both in terms of governance, as Philo talked about, but also, I mean, the word angel means messenger. We talked about how that's a job they do. So that means that as angelic beings, they can serve as messengers. God can communicate through them. We lose the element of determinism because that's not part of our religion."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1313.25,"end":1323.63,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's not the God. The God we worship does not do that to us. And so of course he's not going to do it to us through his divine beings."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1324.35,"end":1341.47,"speaker":"Fr Stephen De Young","text":"Right, right. Or through anything else. Right. And so, yeah, so it's not that all of these things are playing out in the heavens and in the council of the gods and on earth according to some woven plan somewhere."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1341.63,"end":1343.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God is not the Fates."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1344.03,"end":1346.11,"speaker":"Fr Stephen De Young","text":"Sorry Calvinists, but."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1347.92,"end":1348.8,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. Not sorry."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1353.04,"end":1370.88,"speaker":"Fr Stephen De Young","text":"But it's that just like humans, as we've talked about in the last couple episodes, angelic beings are creations of God through whom God works and through whom he can communicate to the rest of his creation."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1371.04,"end":1371.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1373.13,"end":1388.65,"speaker":"Fr Stephen De Young","text":"And you see, I mean, you see this explicitly in a bunch of places in Scripture. One just real quick shorthand, one is at the beginning of the Book of Revelation, you have the seven stars that are the seven angels of the seven churches."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1388.73,"end":1389.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1390.73,"end":1395.85,"speaker":"Fr Stephen De Young","text":"And who are all each given a letter to bring as a messenger to that church."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1396.09,"end":1396.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1399.3,"end":1419.14,"speaker":"Fr Stephen De Young","text":"So right there you have this connection of stars as messengers in a shorthand way, but there's actually a much deeper biblical theology that you find in the Scriptures regarding the sun, moon and stars in particular as messengers and agents of God."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1419.3,"end":1467.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just, Again, it's not just a poetic image like, hey, you know, okay, there's this association between angels and stars. And so, you know, but again, it's. It's watching their motion and how they relate to each other in the heavens is incorporated into the scriptures. That I think is one of the big. That's. I think that's one of the hurdles that we have to kind of get over is that again, it's not just like, oh, I think they're like stars. You know, it's. It's. So once you take seriously that the actual stars are associated with angelic beings, then what they're doing up in the sky becomes really interesting. But maybe not in the way you think. Sorry, dispensationalists. Sorry."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1467.35,"end":1472.23,"speaker":"Fr Stephen De Young","text":"This isn't. This isn't. Tis the east and Juliet is the sun."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1472.71,"end":1473.11,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1473.35,"end":1473.91,"speaker":"Fr Stephen De Young","text":"Is it?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1474.63,"end":1475.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1475.99,"end":1476.75,"speaker":"Fr Stephen De Young","text":"Poetic thing."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1476.75,"end":1484.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And it's also not. This is not some other version of the Bible code either, to take it the other direction."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1488.39,"end":1496.71,"speaker":"Fr Stephen De Young","text":"This is, as we were saying with other ancient texts, this is a layer of meaning that's there in the Scriptures."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1497.03,"end":1615.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not an overriding thing that then determines everything else. So. Yeah, yeah, okay, so I know that we have. So a really important passage that we want to look at is from Psalm 19, or it's going to be 18. If you're looking at a Bible with a Greek numbering and verses one through six. I'm just going to read this for you. And as you listen, everybody, you may notice that the translation here is a little bit different from what you're used to, and we're going to talk about that. Okay? So just listen. So there's a Psalm Again, Psalm 19, if it's a Hebrew numbering, or 18 if it's just a Greek numbering. The heavens declare the glory of God and the firmament proclaims his handiwork. Day to day pours out speech, and night to night reveals knowledge. There is no speech, nor are there words whose voice is not heard. Their line goes out through all the earth and their words to the end of the world. In them he has set a tent for the sun, which comes out like a bridegroom leaving his chamber. And like a strong man runs its course with joy. Its rising is from the end of the heavens and. And its circuit to the end of them. And there is nothing hidden from its heat. And what's notable about that, if you just read it, whatever translation is, there's clearly a sense of astronomy at the very least going on here. Right? There's. Okay, it's talking about the movement of heavenly bodies, but there's something very specific here, and I think it. And it's connected with that verse that probably sounds different from what you're used to, especially you Orthodox people, you're used to hearing their voice has gone out through all the earth. And we're going to talk about that in just a second. But. But the way I read it was their line goes out through all the earth. So, Father, what is that about? What's that line? And why, like, why are we saying voice most of the time, right?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1615.97,"end":1657.15,"speaker":"Fr Stephen De Young","text":"Well, so the. Just to drop back for just a second, it's important that we see this isn't just talking about. There are other texts, for example, when you get to Psalms 147, 50, that talk about the sun, moon and stars praising the Lord. And we've talked about how you shouldn't really read those as purely poetic, but you can. It's a possible reading. But what this says here in Psalm 19 is that they're pouring forth speech and revealing knowledge. So that's different. That means there's actual content. There's actually. There's something being communicated."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1657.15,"end":1660.71,"speaker":"Fr Andrew Stephen Damick","text":"They're saying that the heavenly bodies are saying something to us."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1660.71,"end":1694.12,"speaker":"Fr Stephen De Young","text":"Right. Not just like a general sense of joy or something, or, you know, creation praising God in sort of this vague sense. But yes. So the word there that we translated line, which you will find translated. If you get most English Bibles, they'll have something like voice in the main text, probably, and then they'll have a footnote that says, you know, literally line down at the bottom of the page."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1694.28,"end":1697.88,"speaker":"Fr Andrew Stephen Damick","text":"Because what could that possibly mean? So we're not going to."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1698.48,"end":1713.92,"speaker":"Fr Stephen De Young","text":"Yeah, they sort of don't know what to do about it. If you get a Bible that's priding itself on being very literal, they'll just have line there the way we did. Because that's what it says. Right. And so that word line is referring to."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1714.56,"end":1741.42,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say. Sorry to interrupt. I just looked up in the. Net Bible and this is what their note says. I just have to read this because it's just proof that what you're saying, it says the MT reads. So that's the Masoretic text. The Masoretic text reads their measuring line. The noun qav measuring line makes no sense in this context. That's what it says. Makes no sense in this context. In other words, they don't see it, what we're about to say."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1741.74,"end":1763.42,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah. And there's a reason why. Because they're not interested in and don't know about astrology because, you know, they've written that off as irrelevant. But. So what this measuring line here is referring to is what's called the ecliptic. And that may not be a word you've heard either."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1763.9,"end":1765.66,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I know the word eclipse."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1766.38,"end":1787.55,"speaker":"Fr Stephen De Young","text":"Right. And it's not unrelated. But the ecliptic is the path, sort of lines that you could draw if you were making a. An astronomical or astrological chart. The ecliptic is the path that the sun follows over the course of the."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1787.55,"end":1792.03,"speaker":"Fr Andrew Stephen Damick","text":"Year because it doesn't rise and set in exactly the same spot on the horizon."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1792.03,"end":1793.75,"speaker":"Fr Stephen De Young","text":"Exactly the same spot. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1793.75,"end":1795.39,"speaker":"Fr Andrew Stephen Damick","text":"It moves around. It moves around."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1795.39,"end":1825.56,"speaker":"Fr Stephen De Young","text":"Right. Days get longer and shorter and. Yeah. So there's this path, right. Of the sun through the sky, and that's called the ecliptic. And if you have any doubt that that's what this is talking about in Psalm 19, verse 4, you just have to read the next couple verses. He said, is set for the sun, which comes out like a bridegroom leaving his chamber, like a strong man runs its course."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1826.04,"end":1834.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's talking about the rising and setting of the sun, comes out in a quote unquote tent, you know, and."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1834.32,"end":1873.79,"speaker":"Fr Stephen De Young","text":"So there is this. The line they're talking about is that. That path of the sun. And so the ecliptic, that line, that region of the sky, is the region where the different constellations that we would now call the zodiac enter and leave over the course of the year. Yeah. So it's their position relative to the path of the. The path of the sun at that time of the year. And this is. At some point, inevitably, we're going to do an episode or five about the Book of Enoch."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1874.27,"end":1876.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1877.39,"end":1905.99,"speaker":"Fr Stephen De Young","text":"And there's a huge central portion of the Book of Enoch that's just about the calendar and the calendar you're supposed to follow. And it talks about the different gates of the sun at the different times of year, the gates it comes out of and the gates it goes back into. So this is sort of a key thing that everyone in the ancient world knew about and could just reference something we haven't probably thought much about."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1906.23,"end":1977.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because I woke up this morning with an alarm clock and I still got up and I still did the same things, and I still walked out of the house at the same time on my clock without any reference to when the sun was coming up. I mean, I've noticed that it tends to be darker when I leave, but that's about it. That's about it. Because our lives are governed so much by mechanistic processes now that the naturalistic processes of sunrise and sad and so forth really don't govern our lives. And so we don't really notice them that much. And indeed, we even attempt to control them by something called daylight saving time. You know, it's, it's, it's. Yeah, there's just so much that I think we're not seeing because we're just not paying attention to it. You know, it's. It's happening, but we're just not paying attention because We've got our attention on something else. I can tell you what time my alarm is set for each day, but I couldn't tell you what time the sun is rising or setting unless I ask Google. Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":1980,"end":2021.57,"speaker":"Fr Stephen De Young","text":"And it's important. When we take these six verses together, this means that the psalm is saying that part and parcel of how the heavens communicate, what they're communicating from God has to do with this path of the sun and the specifics of the movements. You could say, well, a psalm is poetry, and it is. But we're going to get into it in a little bit, and we're going to see that when this text is cited later in the Bible, it's not just cited as sort of poetry and imagery."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2022,"end":2022.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2023.68,"end":2024.6,"speaker":"Fr Stephen De Young","text":"But we'll get there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2024.6,"end":2047.46,"speaker":"Fr Andrew Stephen Damick","text":"And it's. And this is interestingly specific and astronomical. It's really like. Yes. You could just say, you know, the poet is taking an image and really running with it. But it. But he really has run with it at the very least. Right. Like, this is not just throwing out, you know, astronomical imagery. This is about specific astronomical events."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2048.49,"end":2051.45,"speaker":"Fr Stephen De Young","text":"Yeah. And that this is a means by which God communicates."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2051.77,"end":2053.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's saying something."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2054.17,"end":2066.73,"speaker":"Fr Stephen De Young","text":"And we find. Because this is our Christmas episode, we find reference to this in our liturgical hymns for the Nativity."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2066.81,"end":2068.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2070.49,"end":2072.25,"speaker":"Fr Stephen De Young","text":"So I don't know if you want to. You could sing it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2073.85,"end":2122.95,"speaker":"Fr Andrew Stephen Damick","text":"I'm not going to sing for everybody. Okay. Yeah, yeah. So this is the Nativity Apolitikian. And this is going to be the Christmas hymn in the Orthodox Church that everybody knows. Whatever, they do it in their particular tradition. So there are little variations in translation, and we're going to talk a little bit about that, but I'm just going to read to you this one. Thy Nativity, O Christ our God, hath given rise to the light of knowledge in the world. For they that worshiped the stars did learn therefrom to worship Thee, O Son of righteousness, and to know that from the east of the highest thou didst come, O Lord, glory to thee. And of course, it's that hymn which is the source of the title of this particular episode."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2123.99,"end":2124.47,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2124.55,"end":2129.43,"speaker":"Fr Andrew Stephen Damick","text":"So what's going on in here that has to do with this ecliptic of Psalm 19?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2130.87,"end":2139.36,"speaker":"Fr Stephen De Young","text":"Well, so we'll get into the Magi later on, because of course, it will be in the third half of the program that we get to our actual advertised topic."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2139.76,"end":2140.6,"speaker":"Fr Andrew Stephen Damick","text":"They that worship."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2140.6,"end":2141.36,"speaker":"Fr Stephen De Young","text":"This is our want."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2141.44,"end":2146,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, exactly. This is the podcast that is. Wait for it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2149.2,"end":2163.06,"speaker":"Fr Stephen De Young","text":"So, but we have this element of the Son of righteousness. And this phrase that was translated, as you read it, from the east of the highest. Sometimes it's the Orient from on high."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2163.22,"end":2175.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we should note that sun of righteousness there is s u n, not s o n, it's s u n. So it's all astronomical here or astrological."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2176.5,"end":2217.37,"speaker":"Fr Stephen De Young","text":"And the. The actual language that's translated from the east of the highs is actually from the song of Zechariah, St. John the Forerunner's father at St. John's birth. That's where it's been picked up from. But what is it referring to? Well, the reason people have trouble translating it into English is that the word that's translated east there is quite literally the word for east. It's the Greek word anatoli. And the highest is literally just a form of the preposition up, like high place."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2217.53,"end":2226.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I've seen this also translated as Orient from on high. And of course, orient is just another word referring to east."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2227.21,"end":2237.53,"speaker":"Fr Stephen De Young","text":"Right. And so the word anatoly, though, also means the sunrise, because that's where the."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2237.53,"end":2239.17,"speaker":"Fr Andrew Stephen Damick","text":"Sun rises is in the east. Right?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2239.17,"end":2273.58,"speaker":"Fr Stephen De Young","text":"It is in the east. In fact, that's how it came to mean east. Right. The word actually refers to the sun rising. And so if you were going to talk about that direction, you'd say over there, where the sun rises, head that way. Right. Or head in the direction of the sunset, if you were talking about west. But so the point that's being referred to here is it's not the sunrise in the sense of the event, it's the sunrise in the sense of the location."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2274.14,"end":2274.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2275.5,"end":2294.28,"speaker":"Fr Stephen De Young","text":"So this would be. And that highest is really sort of just a way of saying extremity. So this is talking about the one end of the ecliptic. This is talking about the extreme of the ecliptic, which is the point of origin where the sun, like a bridegroom, leaves his tent."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2295.16,"end":2308.92,"speaker":"Fr Andrew Stephen Damick","text":"And so, I mean, does that then connect with the fact that here we are around the winter solstice? Is this the end? Is this the point at which the sun leaves, the bridegroom leaves his tent?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2309.64,"end":2313.52,"speaker":"Fr Stephen De Young","text":"Well, yeah, it's not directly related to the solstice."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2313.52,"end":2317.32,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, good. Well, I figured there was some people going to be thinking that, so we."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2317.32,"end":2319.03,"speaker":"Fr Stephen De Young","text":"Should throw that out there right now. Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2320.79,"end":2321.51,"speaker":"Fr Andrew Stephen Damick","text":"A little bit more."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2322.15,"end":2366.29,"speaker":"Fr Stephen De Young","text":"It's the point in the sky. Right. That's the point of origin of the sun. In the same way that the Magi come to know the point of origin of Christ. Right. That point of origin of the sun and this bridegroom language related to the sun here, obviously that bridegroom language is something that's related to Christ. And so the troparian is taking all of that into account. Right. But when it refers to the point of origin of Christ, it refers to this point on the ecliptic. It refers to this sort of point of origin. So this troparian, which of course comes later than the Scriptures, also has this astrological layer of meaning in it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2366.37,"end":2368.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is orthodox astrology now."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2369.49,"end":2369.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2372.13,"end":2373.01,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, everybody."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2374.69,"end":2414.89,"speaker":"Fr Stephen De Young","text":"Connecting to the. To the magi. So it's referring to that place. But so as I mentioned, we have this idea in the psalm that's not just a poetic idea. You could try to write it off as a poetic idea that somehow the movement of the stars in relation to the ecliptic conveys knowledge. You know, God speaks through it. It's just some sort of poetic thing. But St. Paul in particular takes this super literally."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2415.13,"end":2419.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, now we're in Pauline astrology."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2419.69,"end":2420.25,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2420.73,"end":2498.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So then the first example from our notes is from the book of romans in the first chapter, starting with verse 18 and going through verse 20. For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who by their unrighteousness suppress the truth. For what can be known about God is plain to them because God has shown it to them. For his invisible attributes, namely his eternal power and divine nature, have been clearly perceived ever since the creation of the world in the things that have been made. So they are without excuse. I mean, I remember reading that verse, you know, when I was an evangelical, and I just read it as like, oh, yes. You know, the creation has this amazing design and glorious, you know, complexity. And so that means there must be a Creator. And so I'm responsible for. For what I do with that natural kind of conclusion to be derived from that. But you're saying that Paul is actually saying something much more specific than just look at the complexity of creation. And you're responsible for thinking that there's a creator."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2498.58,"end":2521.91,"speaker":"Fr Stephen De Young","text":"Right, right. And this also isn't just natural law that, hey, everybody knows from nature that murder is wrong. So if you're a murderer, that's bad, even though you didn't have the Torah. Right, right. Yeah. I took kind of a cheap shot at my Calvinist friends earlier. So as consolation, I offer you Romans 1:18 through 20."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2523.91,"end":2525.67,"speaker":"Fr Andrew Stephen Damick","text":"You're going to have to explain that to everybody now."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2526.31,"end":2532.63,"speaker":"Fr Stephen De Young","text":"Yeah, but this is a very popular passage among my Calvinist friends."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2532.63,"end":2533.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2534.31,"end":2588.98,"speaker":"Fr Stephen De Young","text":"So this is talking about the fact that. And this is still kind of vague. We're going to see later in Romans, St. Paul's going to get more specific. But here St. Paul is saying that St. Paul always lays out sort of his themes and the things he's going to talk about at the beginning of his epistles and then develops them over the course of the Epistle. So this is chapter one. Here's one of his themes that he's introducing here, that there is actual concrete knowledge about God that is found by observe the observance and perception of created things, which includes God's power, his divine nature, his attributes. That's more than just there's some kind of God who created things. Right. Because everyone St. Paul was writing to thought there were gods who created things."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2589.06,"end":2589.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2589.42,"end":2590.74,"speaker":"Fr Stephen De Young","text":"So there were no atheists."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2590.82,"end":2597.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. He doesn't need to address that. It's not a live question in the first century."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2598.3,"end":2682.67,"speaker":"Fr Stephen De Young","text":"Right. And so he's saying he's talking to particularly former pagans in this part of Romans 1. He's going to turn to Jewish Christians in Romans 2, but he's talking specifically to former pagans here, saying that the pagans are accountable for. He goes on in chapter one to talk about specifics like idolatry and their religious ritual, that they should have known that was wrong because they should have come to know at least about, in some kind of broad strokes, enough about the true God to not do that. And so they're accountable for having. It's not that they. Well, they didn't know about Yahweh, the God of Israel. They had been assigned to these lesser spiritual beings and they had worshiped them, which they weren't supposed to. But how are they supposed to know any better? St. Paul's saying, no, no, you had a way to know through created things, if you'd paid attention, that there was the true God, God Most High, and that you shouldn't have been worshipping these other powers. And so you're accountable because you could have known, but you chose to sort of suppress that knowledge."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2682.67,"end":2708.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now here he doesn't go into detail exactly how they should know or what exactly they should have known or how they should have known it. But he says that it's revealed from heaven against all of that ungodliness and unrighteousness. And he says that they've suppressed the truth. So there is this problem of like, you knew the truth, but you know, you were hiding it. You didn't want anybody to know."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2708.68,"end":2719.56,"speaker":"Fr Stephen De Young","text":"You hid it for yourself and you wanted to do some other stuff. And so you did it, but you weren't. It wasn't a sin of ignorance. It was a sin of deliberate deliberation."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2719.56,"end":2720,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2720,"end":2721,"speaker":"Fr Stephen De Young","text":"It was voluntary."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2721,"end":2721.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2721.56,"end":2722.04,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2723,"end":2726.28,"speaker":"Fr Andrew Stephen Damick","text":"But he does develop that later. Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2727.16,"end":2728.76,"speaker":"Fr Stephen De Young","text":"Specifically in Romans 10."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2728.84,"end":2731,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Why don't you read that one for us then?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2731.57,"end":2807.41,"speaker":"Fr Stephen De Young","text":"Okay. This is Romans 10, 12, 18. He says, for there's no distinction between Jew and Greek, for the same Lord is Lord of all, bestowing his riches on all who call on him. For everyone who calls on the name of the Lord will be saved. So I'll just pause and do a little on the way through. Not the way I do in my Bible study. We don't want to be here all day. But. So he's saying, look, there's one God and one Lord Jesus Christ over everybody. Whether you used to be a Jew or you used to be a pagan, now you're a Christian. Everyone who calls on the name of the Lord will be saved the same way. But he says, how then will they call on him in whom they have not believed? How are they to believe in him of whom they have never heard? How are they to hear without someone preaching? How are they to preach unless they are sent? Right? So this gets quoted a lot in evangelism circles. These people can't call on the name of the Lord and be saved unless they hear about who Christ is. And they can't hear who Christ is unless someone preaches it to them. And they can't have it preached to them unless someone's sent to preach it to them."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2807.57,"end":2809.01,"speaker":"Fr Andrew Stephen Damick","text":"So go out there and preach."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2810.04,"end":2840.8,"speaker":"Fr Stephen De Young","text":"And then St. Paul says, quoting Isaiah as it is written, how beautiful are the feet of those who preach the good news, who preach the gospel, says, but they have not all obeyed the gospel. For Isaiah says. He quotes Isaiah again, lord, who has believed what he has heard from us. So faith comes from hearing and hearing through the word of Christ. So, so far, so good. I think everybody gets what that's saying, right? That not everyone who hears actually is obedient to it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2840.88,"end":2841.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2842.16,"end":2902.72,"speaker":"Fr Stephen De Young","text":"Notice St. Paul uses the word obeyed there, not the word believed. That it was true, but sorry to some people again. So look, you come to faithfulness, you come to Christianity and the gospel by hearing it. You hear it through the word of Christ, the gospel that's proclaimed. Then he says, but I ask, have they not heard? So who's the they? Here is the pagan world out there, the people who haven't heard the gospel. So now he asks this question, have they not heard already? Right. Implying have they not already heard the gospel? He says, indeed they have, for their voice has gone out to all the earth, and their words to the ends of the world. And he quotes Psalm 19, but that's."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2902.72,"end":2911.88,"speaker":"Fr Andrew Stephen Damick","text":"That's the language we're more used to. Their voice has gone out to all the earth. Why does he say voice there and not line like we said there about the ecliptic?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2912.52,"end":2915.8,"speaker":"Fr Stephen De Young","text":"He's quoting an already existing Greek translation."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2915.88,"end":2919.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which would you say got it a little bit wrong?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2920.61,"end":2927.25,"speaker":"Fr Stephen De Young","text":"I think they had the same problem most English translators have. They weren't sure what to do with the word, but the meaning is still clear."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2927.57,"end":2928.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2928.77,"end":2953.78,"speaker":"Fr Stephen De Young","text":"Because if you go to Psalm 19. Right. St. Paul is saying, hey, that knowledge that's communicated in Psalm 19 by the heavens, by the stars, the speech that's poured out. St. Paul is saying, regardless of how you Translate that word, St. Paul is saying the Gospel is the content that's being communicated, the word of Christ."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":2954.34,"end":2999.28,"speaker":"Fr Andrew Stephen Damick","text":"And we should emphasize that most of the time when the New Testament quotes the Old Testament, especially the Psalms, like one line is quoted, but the point is to isolate that one line and use it. But rather to say, but I ask, have they not heard. Indeed they have. For Psalm 19, you know that he's essentially just referencing the Psalm by quoting that one line. Although that's probably the most relevant part of it for the argument that he's making that, yes, actually everybody has heard the gospel and they heard it because of these things that are observable in the sky. Yeah, that's what he's claiming, that the gospel is being preached by the movements of the heavens."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3000.08,"end":3000.84,"speaker":"Fr Stephen De Young","text":"Absolutely."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3000.84,"end":3032.97,"speaker":"Fr Andrew Stephen Damick","text":"Which. So how does. I mean, like, okay, thinking about that sort of skeptically for a moment or just like, okay, so yes, let's say I did pay attention to where the sun rises every day, and I do have this concept of the ecliptic and all that kind of stuff. How do I get from there to the gospel? You know, that Christ is God and man and he has conquered his enemies and here's what he expects of us. How do I get there from that?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3033.93,"end":3039.01,"speaker":"Fr Stephen De Young","text":"Right. In five easy steps, God loves you."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3039.01,"end":3040.57,"speaker":"Fr Andrew Stephen Damick","text":"And has a wonderful plan for your life."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3046.73,"end":3058.12,"speaker":"Fr Stephen De Young","text":"And we're picking up. See, again, this is, as you said earlier, we're going further down a rabbit hole that we already gazed into in previous episodes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3058.12,"end":3065.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. It's a kind of spiral shaped podcast. Just keep circling and getting deeper and deeper."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3066.12,"end":3125.42,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Well, I would prefer to say an upward spiral than a downward spiral, but. Okay, so the we talked about how the promise to Abraham. Right. Was. The promises to Abraham were made in terms of star language. Right. Where we were talking about introducing the concept of theosis, that his descendants would be like the stars and that they would camp in the gates of their enemies. And this had to do with this replacement idea of human beings, divinized human beings, Human beings who experienced theosis replacing the fallen. The fallen spiritual powers. Well, now we're going further down that rabbit hole into some of the particulars in how that was seen and how that's reflected in the scriptures. So new word for today is. New Hebrew word for today, at least, is Matzarote."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3125.42,"end":3128.7,"speaker":"Fr Andrew Stephen Damick","text":"Matzarot, which doesn't have anything to do with mozzarella, apparently."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3129.67,"end":3157.05,"speaker":"Fr Stephen De Young","text":"Nothing to do with mozzarella. Nothing to do with matzo balls, to my knowledge. If someone knows there's some connection to matzo balls, let me know. But right into Hebrew scholars. Yes. Yeah. Scholars of rabbinic Judaism. So that's the Hebrew word that roughly means constellation. Right, Right. One of the signs of the stars that we talked about in the book of Jubilees earlier. And there are 12 of them."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3157.05,"end":3157.69,"speaker":"Fr Andrew Stephen Damick","text":"What do you know?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3158.01,"end":3179.53,"speaker":"Fr Stephen De Young","text":"Just like there are 12 constellations in pretty much all of the other ancient Near Eastern understandings of what we would call the zodiac. What we may not have connected in our heads, though, but which ancient Israel and Second Temple Judaism did connect, is that there are also 12 tribes of Israel."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3180.09,"end":3183.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So does each one of them have their own sign?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3183.99,"end":3184.47,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3184.63,"end":3185.19,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3186.55,"end":3187.11,"speaker":"Fr Stephen De Young","text":"Here we go."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3187.11,"end":3188.39,"speaker":"Fr Andrew Stephen Damick","text":"Everybody, hold on."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3190.47,"end":3193.67,"speaker":"Fr Stephen De Young","text":"There is a constellation associated with each of the tribes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3193.91,"end":3203.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now, are these the constellations that we would be familiar with? You know, like Orion and Sagittarius and, you know, Cassiopeia."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3204.23,"end":3213.63,"speaker":"Fr Stephen De Young","text":"Yes. And they're roughly the same. These are the. What we would associate with the zodiac signs, man. And in many cases, they're associated with the same animals."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3214.67,"end":3215.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3215.39,"end":3235.83,"speaker":"Fr Stephen De Young","text":"Right. So Judah with the lion is kind of obvious. You could guess which one that is and some of the others. So. And this. This imagery of those signs was directly connected to the 12 stones that were in the high priest's ephod, his breastplate."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3235.83,"end":3236.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3236.19,"end":3239.53,"speaker":"Fr Stephen De Young","text":"They can read about in Exodus 28, 15, 21."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3239.77,"end":3240.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3241.85,"end":3261.85,"speaker":"Fr Stephen De Young","text":"And that was part of the markings on them when he bore those into the tabernacle and then later the temple. And this means there was likely. We've mentioned before, I think, that we don't know exactly how the Urim and Thummim worked."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3262.33,"end":3265.24,"speaker":"Fr Andrew Stephen Damick","text":"Some kind of divination, something."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3265.24,"end":3301.74,"speaker":"Fr Stephen De Young","text":"Yeah. That was. If you had some really tricky Case where you couldn't figure out, based on the written Torah, what you should do. This was sort of your last ditch way. You'd go to the high priest and he would use the Urim and Thummim to determine what God's will was. And we don't know exactly how that worked, but the fact that there were stones in his breastplate that were with these others implies that there may have been some kind of astrological component of this involved with the Urim and Thummim making that determination."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3302.3,"end":3310.14,"speaker":"Fr Andrew Stephen Damick","text":"And then in Genesis 49, right. There's all of this animal imagery. What's going on there?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3311.74,"end":3321.4,"speaker":"Fr Stephen De Young","text":"So Genesis 49 is the testament of Israel or the Testament of Jacob. A testament is actually a whole genre of literature. There are tons of these."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3321.48,"end":3322.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3323.56,"end":3326.52,"speaker":"Fr Stephen De Young","text":"Adjacent to the Bible and Second Temple literature."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3326.52,"end":3364.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if you haven't read it recently, if you pull out your Bible and look at Genesis 49, you will see basically Jacob calls all his sons together. Right. And then he sort of lists them off, you know, by name. It starts out, you know, gather together and hear you sons of Jacob, and listen to Israel, your father. That's of course the name that God gives to Jacob. And he starts off talking about Reuben and then Simeon and Levi, and it goes on and on and on. And if you read closely, you'll see that there's animal imagery that seems to be connected to these various sons. And of course, these sons are the origin of the 12 tribes of Israel."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3364.47,"end":3409.35,"speaker":"Fr Stephen De Young","text":"Right. And so you get the lion imagery with Judah, you get serpent imagery with Dan. That's not just sort of poetic stuff, it's prophetic in that he's talking about what's going to happen with these tribes. So, for example, when he talks about his son Judah, he talks about the kingship coming from Judah and maybe one of our Lent episodes, we'll end up talking about Palm Sunday. And the imagery there in the prophecy about Judah with Daniel, that's been widely associated the prophecy there with the Antichrist. But it also talks there about a viper. And so you have. And Benjamin also. But there's. There's this."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3409.59,"end":3411.59,"speaker":"Fr Andrew Stephen Damick","text":"Benjamin's a wolf. Verse 27."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3412.55,"end":3412.87,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3412.87,"end":3419.83,"speaker":"Fr Andrew Stephen Damick","text":"I mean, Naphtali is a deer. I mean, it just goes on and on. It goes on and on. Yeah. Issachar is a donkey."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3420.39,"end":3423.51,"speaker":"Fr Stephen De Young","text":"And these are associated with constellations."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3423.93,"end":3424.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3424.49,"end":3450.09,"speaker":"Fr Stephen De Young","text":"So there's this astrological layer here where that's being put into. It's called a testament because Jacob's dying at the time. And so these are sort of his parting words. Sons parting. Prophetic words. But there's this astrological layer there associating these 12 tribes with those constellations, which makes total sense."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3450.5,"end":3527.11,"speaker":"Fr Andrew Stephen Damick","text":"If you go back again, as we mentioned, the promises to Abraham that his descendants are going to be as the stars, and we're not just talking about kind of like an individual sort of ascension to be like an angel, although that is certainly part of what we're talking about. But also there is this association with stars in a much more complex level now, systems of constellations and so forth. If that's how Israel understands its identity, that this is their destiny, then it makes total sense then that they would have this association with stars, even on this level of zodiac signs in the sky. I mean, this is. This is cool stuff that I had. Again, no idea was in there, you know, but. But here it is. Here it is. And then that would have been what's seen. Like when we started out talking about these mosaics and synagogues, this is what would have been there. So when Jesus walks into a synagogue and there's the zodiac, it's the zodiac of Israel. It's the twelve tribes of Israel and their zodiacal signs. That's what's going on there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3527.11,"end":3560.6,"speaker":"Fr Stephen De Young","text":"Right, right, right. And connecting that to their sacred calendar. Yeah, yeah, yeah. And how that relates to the. So by virtue of the stars, that the people are not only connected to the heavens, but also to time itself. Yeah, right. Is directly connected to. To their lives on this earth through the means of the sacred calendar."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3560.68,"end":3568.12,"speaker":"Fr Andrew Stephen Damick","text":"Part of something much bigger than yourself. And this is one of the ways they understood that that worked. Yeah, yeah. Cool."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3569.64,"end":3591.03,"speaker":"Fr Stephen De Young","text":"So there's a very concrete example of taking that camping in the gates of your enemy's imagery and applying it through the tribes to constellations in a place that we probably haven't read much."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3591.11,"end":3592.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Judges."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3593.67,"end":3598.23,"speaker":"Fr Stephen De Young","text":"And that's in these. Yeah, the song of Deborah in Judges 5."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3598.31,"end":3598.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3600.15,"end":3607.4,"speaker":"Fr Stephen De Young","text":"So there's this whole. And this is a cool story for anybody who hasn't. Who hasn't read it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3607.4,"end":3611.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's one of the brighter spots in Judges, which is largely just dark and awful."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3612.56,"end":3657.41,"speaker":"Fr Stephen De Young","text":"Well, for some there are problems here, too, but the biggest problem is that there's a man named Barak who's chosen to be the judge of Israel and is sort of a wimp and doesn't do it. And so God sends a prophetess, Deborah, to sort of go and take command of Israel's armies, since he just sort of embarrass Beric. And so they have to make war against Sisera, this enemy General who ends up getting a tent bag driven through his skull into the ground by another woman named Jael. So it's cool stuff, especially if you're like a teenage boy."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3657.49,"end":3658.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3658.77,"end":3659.81,"speaker":"Fr Stephen De Young","text":"This is great Bible."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3660.45,"end":3664.93,"speaker":"Fr Andrew Stephen Damick","text":"I remember the tent peg. Yeah, yeah, yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3666.13,"end":3675.61,"speaker":"Fr Stephen De Young","text":"But so. So after this, the teenage boys quickly lose interest because Deborah sings a song when it becomes a musical. Teenage boys check out."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3675.61,"end":3676.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3678.21,"end":3687.81,"speaker":"Fr Stephen De Young","text":"So. But there are details of the way in which she describes the victory that Israel has won that are important."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3688.05,"end":3688.61,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3688.61,"end":3690.38,"speaker":"Fr Stephen De Young","text":"For what we're talking about today."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3690.38,"end":3690.94,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3691.98,"end":3730.58,"speaker":"Fr Stephen De Young","text":"We're focus on two verses in particular. In Judges 5:20, it says they fought from the heavens. The stars from their courses, fought with Cicera. So leading up to 5:20, Deborah has gone through all the tribes, has listed all the tribes. So she's sort of arraying. Here's the forces, Right. Who are opposing each other in battle. Here's all the 12 tribes who we've talked about are associated with these 12 constellations. And then on the other side, there's Sisera and his human army and the stars in their courses."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3730.66,"end":3731.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So he's got."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3731.66,"end":3733.78,"speaker":"Fr Stephen De Young","text":"Right. So sort of a bunch of rebellious."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3734.58,"end":3736.18,"speaker":"Fr Andrew Stephen Damick","text":"He's got astral allies."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3736.98,"end":3739.7,"speaker":"Fr Stephen De Young","text":"Yes. Fighting on his side."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3739.78,"end":3740.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3741.7,"end":3813.77,"speaker":"Fr Stephen De Young","text":"And we know, of course, who won. But then in describing that victory later on in chapter 5, verse 31, it says, Thus let all your enemies perish, O Lord, but let those who love him be like the sun when it comes out in full strength. So when the sun comes out, the stars disappear. It's the idea. Right. The sun. The sun shows up. So she's saying, yeah, yeah, you had these spiritual powers on your side. We had our 12 tribes, but. Oh, yeah, we had Yahweh, the God of Israel. And when he comes out on the battlefield, it's like the sun coming out in the sky because all those stars disappear. They all vanish. They all scatter. They're all defeated. And so the. What she's describing is this defeat by Yahweh, the God of Israel, of these spiritual forces that have arrayed themselves with Israel's enemies. That he does by and through the tribes of Israel who are going to sort of supplant them."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3813.85,"end":3814.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3815.29,"end":3821.45,"speaker":"Fr Stephen De Young","text":"And so this is still. This is a little deeper down the hole, but this is establishing a pattern."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3821.83,"end":3822.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3822.31,"end":3826.87,"speaker":"Fr Stephen De Young","text":"That's later going to find its fulfillment later on in the New Testament."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3827.19,"end":3827.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3827.99,"end":3846.83,"speaker":"Fr Stephen De Young","text":"And so when. When we're reading Psalm 19 or 18 in the Greek and we read that line about their line or their voice going out into all the world and their words to the ends of the universe. Our orthodox listeners who are attentive might have recognized that as a procumenon."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3846.83,"end":3880.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. It's the procumenon that gets sung, you know, before the Epistle for feasts of the apostles. But of course, also it gets done weekly as well on particular days for Thursday. But, yeah, it's associated with the apostles, especially Peter and Paul, but kind of any apostle, actually, their sound hath gone into all the earth, and it's sung as a communion hymn for feasts having to do the apostles as well. So it's connected with this preaching ministry of the twelve apostles in particular."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3881.35,"end":3881.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3882.79,"end":3896.31,"speaker":"Fr Andrew Stephen Damick","text":"And probably usually we read it as like, okay, yeah, their sound hath gone into all the earth. Yeah, those apostles, they really traveled long distances. They really got the word out. But that's not what this is talking about, actually."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3896.47,"end":3913.98,"speaker":"Fr Stephen De Young","text":"Right, right. Because as we've seen, that's not what the psalmist talking about. That's not how St. Paul uses the Psalm. And so this is talking about quite literally the apostles having become stars."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3914.22,"end":3914.78,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3915.42,"end":3939.3,"speaker":"Fr Stephen De Young","text":"Right. And we say that even more directly, actually, when we talk about the Fathers, when we do. The part of the fathers says that they've become like luminous stars upon the earth. But the apostles have now made this move. And that's not just a general reference to theosis, because, of course, there's 12 apostles."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3939.54,"end":3939.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3940.18,"end":3943.82,"speaker":"Fr Stephen De Young","text":"And Christ had told them they'd sit on 12 thrones and judge the 12."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3943.82,"end":3954.18,"speaker":"Fr Andrew Stephen Damick","text":"Tribes of Israel, who, of course, as everyone knows, in the first century in the Holy Land, are associated with zodiac signs."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3955.14,"end":3969.46,"speaker":"Fr Stephen De Young","text":"And so this is now the apostles taking over that function. And so this is a fulfillment of the kind of move that Deborah was talking about in her song."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3969.54,"end":3979.22,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. All right. Well, connected with that, then we got another question. And this is from Ray Reek, and he left us this message."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":3979.62,"end":4018.53,"speaker":"Fr Stephen De Young","text":"Hi, my name is Ray Reek, near Hershey, Pennsylvania. I'm really enjoying the show, and I've learned a lot. My question tonight for you is this. There's been some talk in some evangelical circles over the years and even sermons preached regarding the real meaning of the zodiac. Specifically, I'm thinking of the late Dr. D. James Kennedy, but I'm sure there are others. He essentially said that the zodiac was the gospel written in the stars and reinterpreted many of the astrological signs to promote that narrative. Are you at all familiar with this, and is there any basis for it in historical Christian thought? Thank you."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4018.69,"end":4023.33,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we will answer that when we come back from our break."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4023.73,"end":4040.06,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 8-5AF radio."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4044.3,"end":4082.71,"speaker":"Fr Andrew Stephen Damick","text":"Introducing a new podcast on Ancient Faith Radio, the Filled with Less show. Living the Christian life with simplicity and intention, featuring Molly Sabret and Cynthia Damascos. Each month, Cynthia and Molly bring you interviews and practical tips for developing and maintaining a peaceful mindset, healthy body and productive life, all from an orthodox perspective. Molly is an author, a blogger and a podcaster for Ancient Faith Ministries and the director of content for Filled With Less, while Cynthia Damascos is an integrative nutrition health coach specializing in functional nutrition and lifestyle management."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4083.19,"end":4088.87,"speaker":"Fr Stephen De Young","text":"Listen to their podcast today@ancientfaith.com that's ancient faith."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4096.3,"end":4112.06,"speaker":"Steve","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AFRA."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4116.57,"end":4173.28,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the second half of the show. And despite what you just heard from the voice of Steve, we're not actually taking calls because this is a pre recorded episode. So even if you are listening to this in its live premiere on Christmas Eve, don't call because we're not on the other end of the phone. But we are very happy to have received some of your questions and comments. And of course, we finished off the first part of this, this episode with that question from Ray Reek. Yeah, well, the answer to his question is basically this part. So now we've looked at ancient Jewish astrology and explained how ancient Israelites understood their relationship to the stars. How exactly does that apply to the birth of Jesus Christ, to the gospel? This is our Christmas episode, so we should probably talk about Christmas episodes a little bit. So, so, yeah, so, yeah, so, so how, how does that apply? How does that apply?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4173.52,"end":4180.52,"speaker":"Fr Stephen De Young","text":"Well, I do, I, I do want to drop just a note about the late Dr. D. James Kennedy."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4180.52,"end":4181.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4181.52,"end":4183.92,"speaker":"Fr Stephen De Young","text":"Mentioned, mentioned in that question."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4183.92,"end":4185.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4185.6,"end":4191.44,"speaker":"Fr Stephen De Young","text":"Who was a Presbyterian pastor in Florida."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4191.44,"end":4191.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4193.37,"end":4208.6,"speaker":"Fr Stephen De Young","text":"And had a television ministry as well that was very popular amongst us old folks. So he passed away probably close to 20 years ago now, I think 2007."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4208.78,"end":4209.61,"speaker":"Fr Andrew Stephen Damick","text":"2007."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4209.77,"end":4251.17,"speaker":"Fr Stephen De Young","text":"Oh, not that long. He had a being. Being a Presbyterian, he very much enjoyed St. Paul's Epistle to the Romans and saw the things that we were just talking about in Romans about the stars and the constellations proclaiming the gospel. And he kind of took that and ran with it and had a very, very developed, I mean, not just like a general gospel presentation, but all kinds of events from the Gospels and things all connected to various astrological things in a very detailed and elaborate way."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4251.25,"end":4253.09,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Presbyterian astrology."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4253.41,"end":4308.4,"speaker":"Fr Stephen De Young","text":"Yes. So he was a Florida man. Yeah. And I think, I mean, obviously I agree with the initial insight that started all that in Romans. I think that is what St. Paul is saying in Romans. But I think it was a little like he discovered a hammer and all of a sudden everything looked like a nail, you know, and so we need to sort of hammer that in. So, yeah, we're going to be talking about in the second half now, since I'm going to say. Yeah, he kind of ran with it a little too far. What is. How would you see the Gospels, the Gospel of Christ being portrayed in the stars? How would that have been communicated? And we're going to give some examples."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4310.72,"end":4324.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So to begin, we actually have one of my favorite quotes from one of my favorite saints, and it's a saint we just celebrated on the calendar, and that's St. Ignatius of Antioch."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4325.29,"end":4328.73,"speaker":"Fr Stephen De Young","text":"Somebody should write like an orthodox book about him."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4329.05,"end":4332.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's an idea. And we can call it Barrenness."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4332.21,"end":4337.13,"speaker":"Fr Stephen De Young","text":"It could be available from ancient faith. Make a perfect last minute Christmas gift."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4337.69,"end":4488.41,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Very last minute. Yeah. Yeah. Let me think about who should write that one. So, yeah, so St. Ignatius and probably, I mean, he wrote seven epistles, but the one that probably gets the most traffic, and rightly so, is his Epistle to the Ephesians. There's just a lot of cool stuff in there, but they're all amazing. And this is from the 19th chapter of his Epistle to the Ephesians. And he's talking specifically now about the birth of Christ. Well, you'll hear it. So listen, this is what he says. And hidden from the ruler of this age was the virginity of Mary and the one born from her, and likewise the death of the Lord. Three famed mysteries which God worked in silence. How then was he made manifest to the ages A star in heaven shining beyond all of the stars. And its light was ineffable, and its great newness brought about wonderment. The remaining stars with the sun and moon became a chorus for for that star and it exceeded with its light them all. And there was confusion. From whence did this great newness and strangeness come to them? By this all magistrate was destroyed, and every evil chain disappeared. Ignorance was taken away. The ancient kingdom is destroyed utterly. God appeared humanized in order to bring about the great newness of unending life. And that which had been planned by God was given a beginning. Therefore, they all were troubled because the destruction of death was being prepared. It's a cool passage, and it goes right from Christ's birth up through the Resurrection, which, you know, Ignatius talks about the Resurrection over and over in his Epistles because he's on his way to be martyred. And it's definitely on his mind, and it's what's giving him so much joy and hope because he knows that Christ has risen, which, from his vantage point, happens just a few decades before, you know, because he's. Early first century is when he's writing second century. Excuse me, early second century when he's writing this. And so the resurrection comes up over and over again. But for him, it's always connected. As he says, this destruction of death was being prepared. So. All right, well, let's talk about this. He definitely talks about stars here, but there's this interesting thing where he talks about all of this happening being hidden from the ruler of this age."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4488.57,"end":4555.24,"speaker":"Fr Stephen De Young","text":"Right. There are these three mysteries that he talks about, and they're, of course, famed mysteries, that God works in silence. So he uses a nice paradox there. They worked in silence, but they're famous. And the three mysteries are, number one, the Theotokos and the virgin birth, number two, Christ's divine identity, that Christ is God himself. Right. And the third one is Christ's death and the subsequent defeat of death. So Those are the three mysteries that St. Ignatius is talking about. And he's mainly here and we're focusing on, because Christmas episode on the first two of those that have to do with the Incarnation sort of directly. The third one, which is the Christ's death and resurrection and the defeat of death is what gets referred to by scholars a lot in the Gospels as the Messianic secret."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4555.88,"end":4556.6,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4557.4,"end":4566.77,"speaker":"Fr Stephen De Young","text":"Which is especially prominent in St. Mark's Gospel, where Christ will heal someone or tell the disciples something and then say, hey, don't tell anybody."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4567.25,"end":4568.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, that happens all the time."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4568.89,"end":4571.33,"speaker":"Fr Stephen De Young","text":"And they usually end up going and telling everybody, but."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4574.29,"end":4595.65,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And kind of the material and, you know, I think sort of the materialist reading of that maybe seems like that the Messianic secret is a secret that he's keeping from everybody except his disciples. That, you know, which is weird because, like, he's going around preaching. So it doesn't make sense if you think that the secret is being kept from human beings."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4595.65,"end":4596.93,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4597.17,"end":4602.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, so who is it being? I mean, Ignatius talks about the ruler."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4602.57,"end":4624.99,"speaker":"Fr Stephen De Young","text":"Of this age hidden from the ruler of this age. That's who it's being hidden from. And St. Ignatius is using language from St. Paul, for example, in First Corinthians 2, verse 8, where he's talking about Christ's identity. He says, which none of the rulers of this age knew, for had they known, they would not have crucified the Lord of Glory."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4625.31,"end":4637.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which, again, the rulers of this age, it's not Pontius Pilate and Caesar. And I mean, they are rulers, but they are not the rulers of this."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4637.47,"end":4646.2,"speaker":"Fr Stephen De Young","text":"They're the spiritual powers who stand behind Caesar and were motivating Judas and the Jewish authorities."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4646.68,"end":4668.84,"speaker":"Fr Andrew Stephen Damick","text":"Right? Which then makes sense when St. Ignatius says, Hidden from the ruler of this age was the virginity of Mary and the one born from her, etc. Like, he can't be talking about Caesar. Of course, Caesar knew nothing about it. Why say that it was hidden from him? You know, like, that doesn't make any sense. You're like, oh, we've kept this secret from Caesar. It's a big whoop. He doesn't care what's going on in Judea."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4669.79,"end":4687.23,"speaker":"Fr Stephen De Young","text":"If Caesar had known who Jesus was and believed that he was God, why would he not have wanted him to die? It was good for Caesar. It was good for every human that Jesus died. If you're a demon, then Christ's death is the worst thing that ever happened to you."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4690.35,"end":4702.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thus, you know, Ignatius says the ancient kingdom is destroyed utterly. And again, he doesn't mean the Roman Empire, he means the kingdom, the rulership of demonic forces."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4702.24,"end":4720.32,"speaker":"Fr Stephen De Young","text":"Right. St. Paul is saying if they'd known that he was going to use his death to invade Hades and pillage it and destroy it and bind the devil and take his authority, then. Yeah, the devil wouldn't have killed him. He would have said peace and long life."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4723.36,"end":4730.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. But. But basically they. He's killed. And so that's opening up the gates and so that's."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4730.35,"end":4747.71,"speaker":"Fr Stephen De Young","text":"And. And you see that motif over and over again in the Church Fathers when they talk about Christ's death. St. John Chrysostom using this, you know, imagery of like a fish hook. Right. St. Gregory the Theologian does too, that, you know, hell or Hades or the devil thinks they're getting this human body."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4748.91,"end":4751.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is being baited. He's being baited."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4752.04,"end":4756.52,"speaker":"Fr Stephen De Young","text":"Once the hook is set, then that's it, they're done for. Right. They're yanked."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4757.64,"end":4764.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like in Chrisostom's Paschal Homily, where It says that hell took a body and then met God."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4764.68,"end":4874.07,"speaker":"Fr Stephen De Young","text":"Surprise. And so that's related to this idea of the secrecy surrounding that. Right. That it's sort of the secrecy before an invasion. Right. Where they think, you know, it's defeat in our moment of triumph. Right, yeah. So that's the third mystery. So the ones we're talking about here are those first two. And so the virgin birth that happens in Bethlehem, the event and who Christ is. So the incarnation, the fact that he's God himself, is kept from them. And the way St. Ignatius talks about that is the reaction of the stars to this sign appearing in the heavens. So this sign appears in the heavens to announce the birth of Christ from the Theotokos. And that's how the other stars find out that it happened. Right. That's where it's revealed. It's revealed to them by the sign in the heavens. And when they see it, here's how we know it's talking about demons. They're all troubled and disturbed and shaken. And there's this imagery of the sign. It's light sort of being greater than the rest. That imagery we saw about the sun in the Song of Deborah. Right. Sort of causing all the stars to disappear. So they're troubled by it and disturbed by it because these are rebellious powers. And then when it talks about the remaining, that. That remaining is not like the other ones, other than the new one. The remaining are the ones who aren't disturbed and troubled by it. So these are like the elect angels."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4874.87,"end":4879.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The stars that remained after the other."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4879.03,"end":4934.56,"speaker":"Fr Stephen De Young","text":"Ones rebelled and left, they rejoice and form this chorus. Right. And then the other ones, the rebellious powers. But these are all stars. These are all things going on in the heavens. And that's where it's revealed to them. And we see those events in the stars that Saint Ignatius is talking about in the Gospels themselves and the accounts of Jesus birth, Obviously, in Matthew 2:2, the Magi see the sign Saint Ignatius is referring to that leads them to know, hey, a king's been born in Judea. Let's go. Right, right. And sometimes I think we kind of soft pedal this, like, Judea was not an independent nation. It was just a Roman province. So, you know, Herod was the king. Herod's heir being born was not a big deal that would cause people to come from Mesopotamia."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4934.88,"end":4936.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4937.04,"end":4950.32,"speaker":"Fr Stephen De Young","text":"So the sign we're talking about was not just like a birth announcement from the Ethnarch of a tiny backwater Roman province. The sign we're talking about was Bigger."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4950.32,"end":4950.76,"speaker":"Fr Andrew Stephen Damick","text":"Than that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4952.52,"end":4974.96,"speaker":"Fr Stephen De Young","text":"To draw people from that far to take a multi year journey. So a king has been born in Judea. It's not a new king of Judea has been born. This is an astronomical event that signals something of, of epochal importance to these pagan magi."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":4975.12,"end":5033.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And then, and then the other thing we see is in Luke chapter two, where the angel appears to the shepherds and announces to them the birth of Christ. And then it says in verse 13, 14, suddenly there is with the angel a multitude of the heavenly host praising God and saying, glory to God in the highest on earth, peace, goodwill toward men. And you know, it's funny, I, I again, you know, sort of rewriting my reading of scripture here, right? I think many times I read that as like, okay, so God sends this one angel and he kind of tells them the message and then he sends a bunch of other ones to just really reinforce it, you know, like, hey, but, but what we're actually witnessing here is the rest of the angels finding out and saying, oh yeah, you know, like there's this sort of applause breaking out, so to speak. You know, it's news to them too. It's news to them too."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5033.19,"end":5035.99,"speaker":"Fr Stephen De Young","text":"And this is, this is the stars singing."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5036.71,"end":5038.23,"speaker":"Fr Andrew Stephen Damick","text":"This is stars singing."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5038.63,"end":5054.5,"speaker":"Fr Stephen De Young","text":"Yeah, the shepherds see the stars singing, which is also referred to in Job 38. And Job 38 is part of Job getting balled out at the end of."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5054.5,"end":5064.18,"speaker":"Fr Andrew Stephen Damick","text":"The book of Job where yeah, yeah, God is basically saying, look, dude, what is your deal? How dare you bring these complaints to me?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5064.18,"end":5148.51,"speaker":"Fr Stephen De Young","text":"Yeah, and so God is talking about, you know, sort of like, you know, you want answers for me. You know, you're demand sort of demanding I explain to you why these things have happened to you. And he's sort of saying, what makes you think you could even understand if I did? And so he's sort of asking a bunch of rhetorical questions, right? So okay, Job, so you're so savvy, you're so wise, how about this? Can you answer these questions? Do you know about this? And so he's talking about, in verses 6 and 7 of Job 38, he's talking about the creation of the world. And so Yahweh asks him to what were its foundations fastened, the foundations of the earth, or who laid its cornerstone when the morning stars sang together and all the sons of gods shouted for joy. So this is the stars singing and the angels rejoicing here in parallel because of course the angels and stars are the same thing. But this is talking about stars singing and if you go on in job 38, it's not just, again, using stars as poetic imagery, but it refers to specific constellations in the Pleiades and Orion. It talks about particular constellations that Job is asked about."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5148.75,"end":5313.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's especially notable that the scripture talks about two times when the stars sing. Number one, this one from Job, where it happens at the creation of the world, which, again, for those of you who love JRR Tolkien and you read the Silmarillion, the angels sing at the creation of the world at the beginning of that. So just want to point that out for all you Tolkien nerds. But the other thing is, because Tolkien reads the Bible, the other. The other thing, of course, is this here, and then Luke, chapter two. So, like, this is a moment, the birth of Christ is a moment that is so world shaking, to use Ignatius's language, so stellar, to use an absolutely appropriate pun, that. That it's appropriate now that the stars themselves should sing again. So, like, this moment that is an announcement of the recreation of mankind is. Is an echo of that original creation. And one of the things that I loved about that passage from St. Ignatius, which just leaped out at me when we were going over this beforehand, he says, God appeared humanized in order to bring about the great newness of unending life. And I mean, this is just essentially echoed for those of you who know a little bit of Saint Athanasius of Alexandria when he says that very famous line, God became man, that man might be divinized or deified or might become God, you know, that this event is the new life of mankind. It's the new creation of mankind. He's the new Adam. Right. It's just. I don't know, it's just astonishing. It's just so beautiful. So beautiful. I mean, just to try to imagine, you know, when I was in seminary, actually, I went to. I had a classmate who, unfortunately, God rest his soul, he passed away pretty young from cancer. And I remember when he first got to the seminary, one of the things that often the seminarians would do in the beginning days of the new school year is kind of go around the room and everyone would say their name and then what their home parish was. And so he was from Palestine. And he said, my name is Iyad Acher and I'm from Beit Sahur, and my parish is the parish where the shepherds heard from the angels. We're like, wait, what? So he was literally from this place that we're talking about now. And, you know, he and his family worshiped at the church where this event happened."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5313.88,"end":5314.54,"speaker":"Fr Stephen De Young","text":"It's just."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5314.54,"end":5315.02,"speaker":"Fr Andrew Stephen Damick","text":"It's just."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5315.1,"end":5315.98,"speaker":"Fr Stephen De Young","text":"Yeah, I don't know."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5316.14,"end":5317.14,"speaker":"Fr Andrew Stephen Damick","text":"It's overwhelming."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5317.14,"end":5349.98,"speaker":"Fr Stephen De Young","text":"And that's the positive side. Right. So Christ's birth and his appearance as man is the good news, the beginning of the Gospel. Right. The beginning of this newness of unending life, of eternal life. Because that which was planned by God was given a beginning. St. Ignatius says. And then the flip side is that the demons, when this is revealed to them, are all troubled because the destruction of death was being prepared. So for them, this is the beginning of the end."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5351.98,"end":5358.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because death is their power. That's what they have in their control, especially the devil."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5358.78,"end":5432.91,"speaker":"Fr Stephen De Young","text":"This is D Day. It's the beginning of the invasion of their territory. It's sort of a divine insurgency. And so when we see Herod going and slaying the infants, this is the first counter attack. This is their counter attack on the invasion that's beginning. And when St. Matthew describes it, he's very obviously and very clearly making this parallel between Herod and Pharaoh. When Pharaoh at the beginning of Exodus slays all the firstborn of Israel, Herod slays all the sons under two years of age. And because we had to, because it's this show, remember, Pharaoh is the persecuting giant of old. And Herod is, in the sense that we've talked about it, is a giant here. How? Because he's imaging he's bringing the works of these evil, hostile powers into the world by murdering small children."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5433.15,"end":5435.31,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Which is a very giant thing to do."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5435.47,"end":5448.68,"speaker":"Fr Stephen De Young","text":"To try. Yes, to try to. To destroy. So he is participating in the works of the evil one here, quite literally in that first. First counterattack."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5449.23,"end":5541.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, you know, to just kind of underline this idea that we've been talking about now about these things being hidden from the angelic powers. You know, if you go to church a lot, if you're an Orthodox Christian, you go to church a lot. If you're in. You know, so there's what's called tone of the week. So for all you Byzantine chanters out, or all you chanters Byzantine or not all you chanters out there, people do church music. There's the tone of the week, which begins being used on Saturday night at Great Vespers and the Theotokion. So it's a hymn about the Theotokos or to the Theotokos that is appointed for tone four, and it's in the resurrectional tone of the week, tone four, but also gets used at other times as well, for certain feast Days, it goes like this. And maybe you never thought about this very much, but now you're never going to be able to hear it the same way. So this is the translation that we use in the Antiochian Church. It goes like this. The mystery, which was hidden from everlasting and was unknown of the angels was revealed through thee to those who dwell upon earth. In that God, having become incarnate, in unconfused union of his own goodwill, accepted the cross for our sake, whereby he raised again the first created and hath saved our souls from death. It's just a summary of what St. Ignatius says. Well, it's again, a summary of what's."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5541.68,"end":5554.72,"speaker":"Fr Stephen De Young","text":"In the scripture, kind of from the flip perspective. Right. Because it's through her that Christ is revealed to those who dwell upon Earth. And St. Ignatius was talking about how it was revealed to the stars."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5554.8,"end":5557.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. Not to the stars, to us, to the angelic beings."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5557.89,"end":5564.77,"speaker":"Fr Stephen De Young","text":"And it's through her that it's revealed to those who dwell upon earth. Because the shepherds find her with the infant Christ."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5566.05,"end":5569.17,"speaker":"Fr Andrew Stephen Damick","text":"The demons are being attacked and we're being rescued."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5569.57,"end":5618.14,"speaker":"Fr Stephen De Young","text":"And so when we say these things are mysteries, we're saying that we're unknown even to the angels. We're saying that these are things that belong to God's, what we call internal counsel. Now, there are two different words, both pronounced council. And this causes great trouble for a lot of people with the name of my other podcast. Because they are spelled. Yes, they are spelled differently. So when we talk about the divine council, we talk about God's counsel and the angelic beings. That is counsel. C O U N C I L Council, which is like your parish council. This is a deliberative body."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5619.98,"end":5622.14,"speaker":"Fr Andrew Stephen Damick","text":"I hope the parish council is like the divine council."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5625.58,"end":5627.9,"speaker":"Fr Stephen De Young","text":"I was going to make a joke about only some members being alive."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5627.9,"end":5629.1,"speaker":"Fr Andrew Stephen Damick","text":"You're on parish council, everybody."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5629.1,"end":5643.48,"speaker":"Fr Stephen De Young","text":"I just did it. But yeah, so the. The other word, council, C O U N S E L refers to wisdom, like keeping your own counsel."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5643.64,"end":5644,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5644,"end":5752.05,"speaker":"Fr Stephen De Young","text":"Like wizard. Right, yeah. Now, a council cil might offer counsel sel to someone. A counselor would be that sel spelling. So when we say this is God's sort of internal counsel, we're using that sel language, meaning we're talking about the Holy Trinity. We're talking about. This is something that is restricted to the Godhead, to the three persons who share the divine nature, the mind, the mind of God, and revealed at a certain time. Right. So we're talking about how the first two mysteries were revealed, how they were revealed to the angels, how they were revealed to those who dwell upon earth. And then, of course, the third mystery that St. Ignatius talks about is still kind of a mystery, still kind of a secret, until the time of Christ's crucifixion, and then is revealed through the resurrection to everyone, to the angels and to men. And then there is a fourth mystery that has still not been revealed, that is still held within the internal counsel of God, and that is the time of Christ's glorious appearing. The reason I use that glorious appearing language for everybody is that comes from St. Paul's Pastoral Epistles. So it's biblical language. But when we translate the Greek word parousia as return or as second coming, that kind of implies in English that Jesus went away somewhere, right? Like he's gone, like he's not here now and he's going to come back and be here again. And of course, that's not what we believe as orthodox Christians, especially because most liturgies we say Christ is in our midst, and he is and ever shall be."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5754.13,"end":5761.45,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, there's that bit where he said. There's that bit at the end of the Gospels where he said, lo, I am with you always, even to the."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5761.45,"end":5791.09,"speaker":"Fr Stephen De Young","text":"End of the age, wherever two or three, three of you are gathered in my name, I am there in the midst of you, et cetera, et cetera. Right? So, yeah, so he's not gone somewhere. But we don't see him the way the apostles saw him. And that's why St. Paul's glorious appearing language, that he will appear to us all, that we will all see him, I think is better language to use in English to communicate it. But when exactly that is, no one knows the day or the hour."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5791.88,"end":5792.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5792.36,"end":5859.85,"speaker":"Fr Stephen De Young","text":"And that doesn't mean, as some, as certain preachers on television, the Internet would have you believe, well, you can't know the day or the hour, but you can know the month and the year. No, no, that means nobody knows when at all. Not even a ballpark figure, except that it hasn't happened in the past. Sorry, preterists, no one knows. And there's this, this verse that gives a lot of people a lot of trouble and that various people will use to try to prove various things. Where Christ says, not only does. Does no human know the day or the hour, he says, not even the angels or even the Son, but only, but only the Father. And this gives people a lot of trouble. Some honestly, some not so honestly, because they're trying to use it for some agenda. The idea that Christ, who's a Person of the Trinity who's fully God, is he saying he doesn't know? How could one person of the Trinity know something and the other two not know it?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5860.17,"end":5860.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5860.49,"end":5888.74,"speaker":"Fr Stephen De Young","text":"And so that. That gives people a lot of fits. But if you look at how the earliest readers, which would be the church fathers and early Christian writers, how they read that, they didn't read that as Christ saying he didn't know. They read that as Christ saying that it was not his to make known, that it was not his to reveal it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5889.06,"end":5899.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is the same kind of mystery then as the ones that we were just talking about, which now have been revealed, except this one still hasn't, as you said."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5899.07,"end":5923.32,"speaker":"Fr Stephen De Young","text":"Right. And there's going to be a time and a place when that is revealed to angels and to men. But it was not for Christ to do before his ascension. That was not the. The point at which that was going to be revealed. It, like Christ's incarnation and his resurrection is going to be revealed when it happens. Yep."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":5923.4,"end":6013.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right, so before we take our second and final break for this episode, we got a message from Alex Rodulescu, who asked this. Bless fathers, my name is Alex and I'm calling from sunny Orlando, Florida. Thank you for producing this illuminating, edifying, and entertaining podcast. You touched on Satan not fully realizing Christ's identity in a previous episode, I believe. Can you expand on how much Satan would have known as a former member of God's council who had fallen from that position, especially in the light of the miracles that surrounded Christ from the earliest days of his conception and the prophecies which he fulfilled. Thank you so much again for the podcast, and I look forward to hearing your latest episode. All right, so this is obviously related to a lot of what we were talking about, and I guess it raises for me the question of, you know, if the Satan is part of the divine council before he falls, he knows the things that they know. Are there things that he. That he missed out on later right after his fall? Right. There seems to be the sense of hiding these mysteries from all the angels, because even if you. Even if you reveal it to the elect ones, then the rebellious ones also would find out. Is there something about being an angelic being, whether you're obedient or fallen, that you know, that they. They're sort of. Their access to knowledge is the same. I don't know. I'm just trying to work. Work this out. Help me out here."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6013.56,"end":6017.32,"speaker":"Fr Stephen De Young","text":"Right. Well, that's. This isn't something that was known by the members of the divine Council."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6018.2,"end":6019.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so there's that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6019.96,"end":6045.72,"speaker":"Fr Stephen De Young","text":"Yeah. The. The end for which man was created was known, and that provoked the devil to jealousy, for example. But these details were not known until they happened and were revealed to any of the angelic beings. So none of them knew. Yeah, we have to. Again, angels are vast cosmic intelligences."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6046.44,"end":6046.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6047.4,"end":6057.2,"speaker":"Fr Stephen De Young","text":"So their knowledge is not sort of restricted by sensory organs like ours."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6057.2,"end":6064.16,"speaker":"Fr Andrew Stephen Damick","text":"I feel like that should be on a T shirt now. It's gonna be one. Yeah, yeah. We should just call them the vcis from now on."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6066,"end":6089.37,"speaker":"Fr Stephen De Young","text":"Right. But they're also not omniscient. Right. They're created beings. They're finite. Right. So they don't know everything. Right. But they. They know far more than we do, and they know it differently. They're not like taking in knowledge through their five senses. Right there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6090.01,"end":6096.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So, so what would be sort of available to be known by any angelic being?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6096.73,"end":6097.13,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6097.53,"end":6111.01,"speaker":"Fr Andrew Stephen Damick","text":"All angelic beings would be able to know that. I know, I'm just sort of repeating myself. But, but, but the point being, the point being that if. If obedient angels can know it, they can't keep it secret from the rebellious ones."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6111.09,"end":6131.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So the image that St. Ignatius is giving us is this sign appears in the heavens. The angels all go, wait, what? And sort of the elect angels go, wait, what? Yay. And the fallen spirits, the rebellious spirits say, wait, what?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6131.82,"end":6132.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6132.38,"end":6136.78,"speaker":"Fr Stephen De Young","text":"No, this is bad. You know."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6138.3,"end":6138.94,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6141.18,"end":6141.74,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6141.98,"end":6148.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, fascinating. Okay, well, let's go ahead and go to our second and final break. We'll be right back."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6148.38,"end":6164.63,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6175.75,"end":6199.69,"speaker":"Fr Stephen De Young","text":"This is Father Tom Sirocca inviting you to join me every Tuesday evening at 9pm Eastern, 8pm Central for Ancient Faith Today live. We'll be discussing issues that you care about from a distinctly orthodox perspective. That's every Tuesday evening at 9pm Eastern, 8pm Central here on Ancient Faith Radio."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6203.05,"end":6219.17,"speaker":"Steve","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6222.37,"end":6286.94,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the third half of our show and just a reminder that this is actually not airing live. So this is a pre recorded episode. So, you know, don't, don't call that number tonight. But we'll get back with you live on our next episode, which will be in just a couple of weeks. All right, well, so, you know, connected with all of that then, because it all shows out to be connected in the end. We got this from our friend Matthew Namie, who wrote in and asked this question about this event that actually just happened when this airs. So this is airing on the 24th of December. Just a few nights ago, there was this big conjunction in the sky that happened between the planets Jupiter and Saturn, if I remember correctly. And, you know, was visible even to the naked eye, although unfortunately out here in eastern Pennsylvania, it was very overcast. So I looked, you know, but I couldn't. I couldn't see a thing. I had to look at other people's photos. I don't know. Were you able to see it or did you. Did you look for it, Father?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6286.94,"end":6289.22,"speaker":"Fr Stephen De Young","text":"I did. I did not. We've been getting rain."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6289.48,"end":6352.59,"speaker":"Fr Andrew Stephen Damick","text":"You did not. Oh, yeah. Well, there you go. Yeah. But anyway, so. So there's this event that happened and. And Matthew wrote in to ask about that. He writes this. What would the ancients have said about the whole planetary star thing happening on the exact date of the winter solstice? Would have. Would it have had good or bad connotations to them? I'm reading that a great conjunction like this has happened only once since the birth of Christ in the 1200s, and it didn't coincide with a solstice or equinox of which the ancients were obsessed. So, yeah, I think, just as a comment on that, I think that. I think that another one of these is supposed to happen in like 60 or 70 years or something like that, but I don't know that it's going to happen on the solstice. Again, I think that's maybe part of what is making it so relatively rare. Yeah. So what about this? I mean, are we seeing the star of Bethlehem here in 2020? Is that what's going on?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6354.35,"end":6394.51,"speaker":"Fr Stephen De Young","text":"My answer to that is no, because as we're going to talk about in this third half, I think the sign in the heavens is something else. And we're going to talk about what that is. But this kind of thing absolutely is the kind of thing that ancient people took notice of and had various means for interpreting things like planetary alignments. Planetary alignments on particular days, comets, anything going on in the. In the heavens, especially if it broke the regular pattern, like a comet or a meteor shower or if it was rare."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6394.83,"end":6395.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6395.55,"end":6492.78,"speaker":"Fr Stephen De Young","text":"Something that very, very rarely conjunctions that very rarely happen. And there were very elaborately developed means of interpreting these things in the Mesopotamian world all the way up to with Rome. They had the Sibylline books, which were kept underneath a temple in Palatine Hill, and only a particular class of priests were allowed to go and reference them. And whenever something like this happened, whenever there was some kind of military disaster or there was a plague, any kind of disaster, or just anything weird in the heavens, those weren't separated. Right? Anything rare or odd or strange, any of those things, and they needed to say, okay, what's going on? Is this good or bad? What do we need to do? Those priests would be sent to consult those books, and those books would sometimes, I mean, we don't have the books and I'll explain why in a second. But it's unclear whether these books just had an excruciating level of detail or whether the priests were really good with PR and would just sort of come out, say, hey, we looked in the books and this was all prophesied, Right. And I mean, it may have been books of vague prophecies that you could sort of shape, you know, and the priests could sort of interpret how they wanted to and then come up with something. So maybe a little of both. But they would say things like, we need to take a couple of slaves and bury them alive and then the disaster will pass. I mean, it was that level of stuff."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6492.78,"end":6493.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6494.46,"end":6530.86,"speaker":"Fr Stephen De Young","text":"And the reason we don't have them is that when the Western Roman Empire was falling at the beginning of the fifth century and the barbarians were invading, a bunch of the still pagan sympathetic citizens of Rome decided, hey, the gods are mad at us because we became Christians. So we need to go check the books, the pagan books, and see what we should do to make things right with them so the barbarians will go away. And so the Christian governor of Rome burned them publicly. So that would not be an option."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6531.66,"end":6533.1,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry, this is over now."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6533.98,"end":6558.19,"speaker":"Fr Stephen De Young","text":"Yeah, we're not going back to that. So, yeah, but. So, yes, they did notice these things, and they were things that there was a special class of priests or like the magi in Mesopotamia in Persian religion, who. Their job was to interpret these kind of things."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6558.19,"end":6559.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's who."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6559.43,"end":6561.03,"speaker":"Fr Stephen De Young","text":"To understand and interpret them."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6561.03,"end":6572.11,"speaker":"Fr Andrew Stephen Damick","text":"That's who the magi are that show up as at Jesus's place of birth, although, what, a couple of years later? Because. Right. Am I, am I reading that correctly?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6572.75,"end":6577.19,"speaker":"Fr Stephen De Young","text":"Right. Two years. Because when they show up, Herod kills everybody who's 2 years old and younger."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6577.19,"end":6582.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they're in a house. I remember there's a detail that they're in the house by that point, they're not still hanging out in the cave."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6583.23,"end":6591.46,"speaker":"Fr Stephen De Young","text":"Yeah. More Father Stephen ruins your Sunday school. It was two years later when the Magi showed up and there's nothing that says there were three of them."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6591.46,"end":6610.9,"speaker":"Fr Andrew Stephen Damick","text":"Yes. There's three gifts, there's three traditional names, but. Yeah. Yes. Yeah. And for those of who don't know, the three traditional names of the Magi are Melchior, Caspar and Balthazar. So there you go. See, I knew that one off the top of my head, so I'm very proud of myself."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6610.9,"end":6620.71,"speaker":"Fr Stephen De Young","text":"Yeah, there you go. So. Yeah. So if we're going to determine what it is that they saw."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6620.79,"end":6621.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6622.71,"end":6642.71,"speaker":"Fr Stephen De Young","text":"We need to have an idea of when it was exactly that Christ was born and what might have been. Once we have an idea of when he was born, we could have a very good idea of what was going on in the sky at the time. Right. On any given date."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6643.35,"end":6648.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Fortunately, figuring out what's happening astronomically is just a matter of a lot of complex math."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6649.43,"end":6649.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6649.83,"end":6650.31,"speaker":"Fr Andrew Stephen Damick","text":"Basically."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6652.15,"end":6655.63,"speaker":"Fr Stephen De Young","text":"Which people more mathematically inclined than me have done, fortunately."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6655.63,"end":6659.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I'm not. This is not me either, by any means."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6660.63,"end":6705.21,"speaker":"Fr Stephen De Young","text":"So we'll start with what year was Jesus born? There is no year zero. Here's another, by the way. Here we are. There's one bc there's one BC and then there's one ad. Right. So zero would be like a point. It would be like exactly midnight on that particular day. And so our dating system in terms of BC and AD was worked out in the medieval period and isn't accurate to when Christ was born. Pretty much. For sure."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6705.37,"end":6706.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6706.97,"end":6713.29,"speaker":"Fr Stephen De Young","text":"Because by the time you get to that zero point, Herod had already been dead for a while."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6713.69,"end":6720.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. So that wouldn't work. Because assuming that the biblical account is true."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6720.99,"end":6721.55,"speaker":"Fr Stephen De Young","text":"It's true."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6721.55,"end":6728.91,"speaker":"Fr Andrew Stephen Damick","text":"Which we do. Right, right. You know, we're. We're not saying let's debunk the Bible. The opposite, actually."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6729.71,"end":6730.07,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6730.07,"end":6745.23,"speaker":"Fr Andrew Stephen Damick","text":"But then. Then if Herod is dead, then that means that the events of the Gospels didn't happen because he's a pretty significant character in. In what's happening there. So he. So, so it couldn't. It couldn't be your. It couldn't be that zero point, you know."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6745.72,"end":6763.24,"speaker":"Fr Stephen De Young","text":"Right. And you don't have to be. You don't have to be an orthodox Christian or a Christian at all to realize that, you know, the New Testament documents, the Gospels, have at least some valid Historical information, right. About when Jesus lived."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6763.24,"end":6763.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6763.96,"end":6837.7,"speaker":"Fr Stephen De Young","text":"When he was born and when, when he died and when he was crucified. Right. I mean, at least that there are those people out there who claim Jesus never existed, but they're not scholars. If you've ever wanted to cheer for Bart Ehrman, which is a hard thing to do and a rare opportunity, he wrote a book, Did Jesus Exist? Where he just as an atheist who doesn't believe the Bible is true, who thinks that most of the stuff in the Gospels is not true, just goes and dismantles those people who want to say Jesus didn't exist pretty epically without any kind of Christian perspective coming into it from a historical perspective. It's ridiculous. So, yes, when Herod the Great is alive, when Jesus is born, he has to die about two years after. And so this has been historically, what scholars try to figure out exactly when Jesus was born. The death of Herod, therefore, is their benchmark, right? Because the gospel writers don't give us the year and don't even try."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6838.26,"end":6844.82,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, a ruler dying is the kind of thing that makes it into records, right?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6844.9,"end":6958.24,"speaker":"Fr Stephen De Young","text":"Roman records, you know, just all the nations, you know, Herod the Great dying, right? Herod the Great. Calling him the great is sort of like calling Michael Jackson the King of Pop or something. You know, it's very relative to a certain time and place. He's not Alexander the Great, right? There's a difference there in greats, but his death is recorded. Now, even with that said, though, his death is recorded in ancient records in a certain way because, of course, they didn't have like our BCAD system. So, for example, what Josephus tells us as a historian, when Herod died, he gives us a couple benchmarks. He says, well, he died when around the time this Olympiad was going on, and he died around the time that these two Roman officials came to power. And the problem with that is those were at the same time those officials came into power who Josephus mentioned. I don't want to go too granular on this, but the officials he mentions came to power like a year after the Olympiad ended. So even with the ancient records like Josephus, ancient historians who talk about Herod's death, there are some vagaries involved. And because of that, back in 1890, here come the 19th century German scholars again, a German scholar identified the date of Herod's death, put forward an argument that Herod died in 4 B.C. and so based on that, a couple generations of biblical scholars just said, okay, well, that must mean Jesus was born in 6 B.C. because it had to be two years before."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6958.24,"end":6959.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6960.89,"end":6977.53,"speaker":"Fr Stephen De Young","text":"And so you will still see this a lot in this is the, the older scholarly consensus. People who went to universities and studied this at a certain time were just taught that Herod died in 4 B.C. and Jesus was born in 6 B.C."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6977.69,"end":6978.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6978.17,"end":6984.49,"speaker":"Fr Stephen De Young","text":"Because of that. Now that causes some problems with other parts of the biblical story."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6984.89,"end":6987.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because we've got other sort of data points."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":6989.21,"end":7011.37,"speaker":"Fr Stephen De Young","text":"Right. And one of those is in Luke 3, verse 23, it says that Christ begins his earthly ministry when he's in his 30th year. So he's 30 years old. St. John's Gospel, when it describes Jesus ministry, has his ministry being three years long."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7011.61,"end":7012.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7014.25,"end":7021.85,"speaker":"Fr Stephen De Young","text":"And that's been taken to be accurate. So that would mean Christ was 33 years old when he was crucified."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7022.09,"end":7022.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7023.85,"end":7034.01,"speaker":"Fr Stephen De Young","text":"Well, if he was born in 6 B.C. that would mean that Christ would have been crucified and risen in 27 A.D. 27."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7034.09,"end":7034.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7037.45,"end":7055.44,"speaker":"Fr Stephen De Young","text":"And first of all, nobody says that's what He. He was crucified. But more importantly, the gospel accounts all agree that the Saturday, the Sabbath day was the Passover. The Passover fell on the Sabbath."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7055.44,"end":7055.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7055.84,"end":7057.36,"speaker":"Fr Stephen De Young","text":"That Sabbath was a high day."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7057.52,"end":7059.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. It was the Passover."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7061.12,"end":7074.52,"speaker":"Fr Stephen De Young","text":"In the year that Christ was crucified. That's why he had to be taken down from the cross so quickly. That's why the legs were broken, of course, the robbers, et cetera, et cetera, et cetera. And so that doesn't work because."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7076.68,"end":7081.32,"speaker":"Fr Andrew Stephen Damick","text":"Because in A.D. 27, it wasn't. Passover did not fall on a Sabbath."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7081.88,"end":7100.42,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So there are several problems with them making that date gel. Now, fortunately, that's we've had in the last 25, 30 years or so, people going back to the question of when Herod the Great died."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7100.5,"end":7101.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7101.86,"end":7119.99,"speaker":"Fr Stephen De Young","text":"This is one of the good things. I sometimes kind of pick on biblical scholarship because I say, well, you know, people need to write dissertations. So you get some of this weird stuff sometimes. Right. But this is a place where it's good. Right. People need to write dissertations, so they're always going back and reexamining old consensuses."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7119.99,"end":7120.91,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7120.91,"end":7136.27,"speaker":"Fr Stephen De Young","text":"So we all had this consensus, he must have died in 4 B.C. everyone just says that. But some people who had dissertations to do and journal articles to write went back and said, hey, how firm is that date? Right. Do we really know that?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7137.15,"end":7137.55,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7139.55,"end":7166.53,"speaker":"Fr Stephen De Young","text":"Again, without going super granular about it, if you follow through, like the way Josephus dates things and the way he counts Years of people's reigns and you look at the dates when the things he refers to happen, you actually come to Herod having died in 1 B.C. and if Herod the Great dies in 1 B.C. that means we have the birth of Christ in 3 B.C."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7166.61,"end":7171.15,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which then means that the crucifixion happens in A.D. 30."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7171.3,"end":7176.32,"speaker":"Fr Stephen De Young","text":"30, when Passover fell on, on a Sabbath day."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7176.32,"end":7176.8,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7177.2,"end":7190.48,"speaker":"Fr Stephen De Young","text":"So it all lines up, then it all lines up. And there's other things. I mean, like I said, you could go granular with it. There are people who Herod is supposed to have met and things he's supposed to have built that wouldn't be possible if he died in 4 B.C."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7190.48,"end":7190.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7191.44,"end":7199.4,"speaker":"Fr Stephen De Young","text":"So it's not just a. Well, there's alternate theory that he died in one B.C. there's a much better argument that he."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7199.4,"end":7205.38,"speaker":"Fr Andrew Stephen Damick","text":"Died in one C. It makes sense of data, both biblical and extra biblical, to date it this way."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7205.54,"end":7212.9,"speaker":"Fr Stephen De Young","text":"Yeah, archaeological. Yeah, because he did a lot of building projects that helps with things too, because he can figure out when things were built."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7213.94,"end":7243.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, so we've got the year figured out. Right? Or we should say that a model that fits all of the available data very well. Jesus is born in 3 B.C. well, what about. And here's the one that everyone loves to argue about. And I actually wrote a blog post titled no, Christmas is not pagan. Just stop it. Because of December 25th. Right?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7243.99,"end":7244.47,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7244.95,"end":7259.48,"speaker":"Fr Andrew Stephen Damick","text":"So the dating of the feast of The Nativity for December 25th is the claim being made that that is when Jesus was born. Born on that date."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7259.64,"end":7280.28,"speaker":"Fr Stephen De Young","text":"Right, right. And there are some people who respond to, well, it's pagan. Right. That comes from a pagan source. That's a remaking of a pagan holiday. There are some people who try to respond to that by doubling down and saying, no, Jesus was born on December 25th. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7280.68,"end":7317.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I should probably say that actually, you know, even if you, if you accept this idea that is derived from paganism, that the data is derived from paganism, there are some people that, their response to that is, aha, checkmate Christians. And then, and then there's some people that like, like, oh no, oh no. This was chosen quite deliberately to, to crush paganism that existed, you know, the pagan festivals that exist on this. So like there, there are both sort of anti Christians and Christians who both accept this idea that the date has something to do with paganism. And the question is just whether that's good or bad."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7318.74,"end":7377.36,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But I just want to say that there is a fundamentalist reflex, right. Where liberal Theory or wacky theory comes along and we respond to that, not by a reality based approach of, okay, what really happened? Where does the December 25th date really come from? But with, I have to defend the December 25 date because if I don't, all of Christianity falls apart. Which of course is not the case. Right, right. So there are several problems with that whole hypothesis. You talk about some of them in your article. For example, a lot of the things that are pointed to when these pagan feasts, they say, oh, look, here's these elements of these pagan feasts that sounds kind of like Christmas, even though a lot of it is stuff that didn't come into the celebration of Christmas until centuries later."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7377.36,"end":7396.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it sounds a lot like Christmas and is geographically local to particular places. Like, oh, look, you've got Christmas trees. Ha ha, there's paganism. I'm like, okay, Christmas trees. You know, not everybody uses them. And you know, yeah, Prince Albert was."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7396.58,"end":7401.58,"speaker":"Fr Stephen De Young","text":"German and so he and Queen Victoria had one. That's why people have Christmas trees today."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7401.58,"end":7402.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's the."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7402.62,"end":7408.34,"speaker":"Fr Stephen De Young","text":"Because of Queen Victoria. It does not go back past that. No one in England had a Christmas tree before that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7408.34,"end":7408.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7408.78,"end":7410.06,"speaker":"Fr Stephen De Young","text":"Anyway, so."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7410.22,"end":7410.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7413.46,"end":7461.59,"speaker":"Fr Stephen De Young","text":"Yeah. And in many cases, the ones that are valid, a lot of them are from the post Christian version of those pagan feasts. People tend to forget that things went both ways, that especially in the late second and early third centuries when Christianity was waxing and paganism was waning, a lot of pagan groups and cults and even philosophical schools started taking on elements of Christianity to try to appeal to what clearly the masses were looking for in religion. From their perspective, that this seems to be where people are going. They're gravitating to these things in Christianity. Well, we need to take those things on board in our pagan religion to keep these people."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7461.59,"end":7475.28,"speaker":"Fr Andrew Stephen Damick","text":"And then there's another layer which we mentioned earlier when we were talking about Norse myths, which is the. That a lot of the information that we have about ancient paganism is preserved and commented on and edited by Christians, you know."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7475.52,"end":7489.4,"speaker":"Fr Stephen De Young","text":"Right. And so, yeah, so there's editing that goes on too to try and integrate things. So all that has to be taken into account. So there's all that evidence in terms of the actual practices kind of falls apart when you push on it."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7489.4,"end":7489.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7490.16,"end":7499.91,"speaker":"Fr Stephen De Young","text":"Yep. You also have the basic issue of it presupposes that Christians didn't have any kind of winter festival."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7500.31,"end":7503.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they needed one because they saw pagans had one."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7504.23,"end":7533.68,"speaker":"Fr Stephen De Young","text":"Pagans have one. And we have all these people who used to be Pagans that are now Christians, and they're gonna keep celebrating the pagan festival unless we come up with something. Right. Like is the theory. And the big problem with that is there were already a bunch of winter Christian festivals. Part of this is because American Christianity is Puritan Christianity. And so the only two feast days we even kind of have left are Christmas at Easter."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7533.68,"end":7534.2,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7534.44,"end":7542.36,"speaker":"Fr Stephen De Young","text":"Right. Like, in the American religious consciousness, those are the only two Christian feast days. And for Puritans, Christmas wasn't even one. But."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7544.12,"end":7547.56,"speaker":"Fr Andrew Stephen Damick","text":"The original war on Christmas was being waged by Christians."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7548.8,"end":7562.16,"speaker":"Fr Stephen De Young","text":"Yeah. So there's only those two sort of in the popular mind. But if you go into any, you know, if you go an inch deep into any traditional form of Christianity, you find out there's a whole lot of feasts. There's feasts of saints every day of the year."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7562.24,"end":7562.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7563.76,"end":7629.64,"speaker":"Fr Stephen De Young","text":"But already you have, for example, the feast of St Stephen on December 27th. There's a strong argument, and, you know, again, I won't go granular with it, but that the reason St. Stephen's martyrdom is so prominent in the Book of Acts is that it's actually explaining the origin of his feast day, that his memory and his martyrdom already being celebrated. Yeah. Were being celebrated already by the end of the first century. Yeah. That he was being remembered since he was the first martyr. Right. And the memories of martyrs were like the Maccabean martyrs were already being celebrated by Jewish groups at this time. So this wasn't like this huge new thing. This was a lateral move for early Christians from a Jewish background to commemorate him as a martyr. And so he has this chunk of the Acts of the Apostles devoted to him because it's explaining, here's the origin of this feast. But even if you don't want to go there, we know for a fact that the Feast of Theophany, called Epiphany in the west, but centering around Christ's baptism."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7630.04,"end":7630.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7631.16,"end":7632.64,"speaker":"Fr Stephen De Young","text":"On January 6th."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7632.64,"end":7647.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And that. And that. That actually is my understanding of liturgical history, that that feast originally was a combination. It was essentially a feast of the appearing of Christ, which then included both his birth and his baptism."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7647.96,"end":7648.44,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7648.52,"end":7671.05,"speaker":"Fr Andrew Stephen Damick","text":"So, like, that's the sort of Original Christmas is January 6th. In. In the. The December 25th feast date is added a little bit later, but comes later. Yeah. The point being that Jesus's birth was being celebrated, but on a different date. Again, not too far away. I mean, it's just 12 days later. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7672.33,"end":7673.09,"speaker":"Fr Stephen De Young","text":"In the winter."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7673.09,"end":7677.61,"speaker":"Fr Andrew Stephen Damick","text":"But, yeah. And then eventually they get sort of separated out to be two different feasts."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7677.85,"end":7747.96,"speaker":"Fr Stephen De Young","text":"Right. And so if they had been worried about pagans still celebrating the pagan feast, Right. What you would expect to see is a bunch of the pagan stuff being taken over by St. Stephen's Day and. Or theophany. You wouldn't expect them to add another day. Yeah, right. You'd expect the pagan things to be integrated into those, which of course isn't what we see. So again, that argument that it comes from paganism falls apart. So when you get at the beginning of the 4th century, starting in the west and then coming east, we know when Christmas, when the feast of the Nativity was first celebrated in Constantinople, because we have St. John Chrysostom sermons and he says, hey, this is the first time we're celebrating this here in the homily. Yeah, thank you. In the homily. So we know 401 and 402 is when it showed up in Constantinople as a feast. But it started earlier in the three hundreds in the early fourth century in the West. So why does it show up then? Right. Paganism does not adequately explain it, as we just said, at all."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7748.12,"end":7755,"speaker":"Fr Andrew Stephen Damick","text":"Especially because paganism is kind of on the wane. Especially by that point. Right. It's starting to."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7756.2,"end":7770.29,"speaker":"Fr Stephen De Young","text":"It may not be dead, but it's coughing up blood. Right. It's almost, it's in its last gasps at that point in history. And this really comes out of, though a bit indirectly, the Council of Nicaea."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7770.29,"end":7770.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7772.05,"end":7779.97,"speaker":"Fr Stephen De Young","text":"And one of its decisions, the Council of Nicaea did not say anything about what's in the Bible and what's not. But they did."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7780.05,"end":7781.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they didn't set a canon."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7782.37,"end":7795.79,"speaker":"Fr Stephen De Young","text":"They did say something about when we should be celebrating Pascha, when we celebrate the Christian Passover. Right. That now gets called in Germanic languages, Easter."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7796.27,"end":7850.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. Another false flag pagan is paganizing. Right. I mean, I'll just say, I'll just point this out. Right. So, so, so people will sometimes say, oh, Easter, well that's, that's the name of a goddess. Blah, blah, blah, blah, blah. I'm like, okay, number one, there is only a handful of places in the world where it's even called that. And they're all Germanic language speaking places. Okay. Most are calling it some version of the word Pascha. Number two, it's really just about the fact that it fell at a certain time of year that happened to have been named for that goddess. So it just was kind of named after the month. And as I like to point out, if you celebrate the fourth of July, that does not mean you are celebrating the Divine Julius Caesar, after whom that. That month is named. You know, it has. The Fourth of July has as much to do with Julius Caesar as Easter has to do with the goddess oyster, or however you pronounce it. So just wanted to put that in there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7850.53,"end":7850.89,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7850.89,"end":7855.49,"speaker":"Fr Andrew Stephen Damick","text":"As an aside, since we're in full debunking mode now."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7856.05,"end":7917.36,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So at the time of the Council of Nicaea, there were different groups of Christians who were. Everybody was celebrating the Christian Passover, the death and resurrection of Christ. Yeah, Right. Which. Which happened at the Jewish Passover. And so they saw it as we're continuing to celebrate the Passover, but we're celebrating it in this fulfilled sense because there's been a fulfillment of what was seen as sort of an icon or image in the deliverance of Israel from Egypt now has come to its fullness in Christ's delivery of humanity from slavery to sin and death. But they're disagreeing on exactly when to celebrate it. So you have Christians who are celebrating it basically at the same time as the Jewish Passover. Just whenever the Jewish Passover falls, that's when we celebrate."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7917.36,"end":7918.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which could be any day of the week."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7919.64,"end":7991.22,"speaker":"Fr Stephen De Young","text":"Right. Could be Thursday. Could be. But just going by the Jewish. The Jewish calculation, you have other Christians who. It was determined that it happened on March 25, historically. And so they were doing it on March 25, whatever date that fell on, sort of the way we celebrate a lot of other feasts. And then there were Christians who were doing sort of a variation of what we're doing now. Either they were doing it on the Sunday nearest the Jewish Passover or the Sunday nearest the 25th or. Right. They said it needs to be on the Lord's Day. Right. It needs to be on the day of the week that Christ rose, but in that vicinity. Right. And so this all had to be settled. Right. Because it was determined, hey, Christians need to all celebrate this together at the Council of Nicaea. And so they settled on the means of calculating that they settled on, which is related to the way in which the date of the Passover was calculated by the Jewish community, but slightly different and not done by the Jewish community."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7991.38,"end":7995.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this episode is not about all of that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7995.9,"end":7996.5,"speaker":"Fr Stephen De Young","text":"All that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":7996.66,"end":8008.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But the point is that they came up with this dating, and then out of that comes the date of the Annunciation. March 25th."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8008.35,"end":8029.91,"speaker":"Fr Stephen De Young","text":"Right. The settlement. So we have these Christians who are used to celebrating on March 25th. And so what is proposed in the deliberation of the councils is that there was a Jewish tradition that the date of a prophet's death would be the same date as his conception."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8030.15,"end":8039.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which is this idea called integral age, that your age is exactly an integer, basically."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8040,"end":8047.36,"speaker":"Fr Stephen De Young","text":"Right. We won't get into. Go down the rabbit hole now of whether there's ever any evidence that there was such a Jewish tradition."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8049.76,"end":8053.36,"speaker":"Fr Andrew Stephen Damick","text":"But how that all works. Yeah, they seemed to think that there was."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8053.44,"end":8068.57,"speaker":"Fr Stephen De Young","text":"Yes. That was set forth as part of the settlement. And therefore. Therefore, if the Jewish date that Christ was crucified is March 25, then that would also have been the date of his conception."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8068.81,"end":8069.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8070.09,"end":8078.05,"speaker":"Fr Stephen De Young","text":"And so that was the beginning of the celebration of what we now call the Feast of the Annunciation, or in Greek, the Evangelism of the Theotokos."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8078.05,"end":8078.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8078.81,"end":8100.88,"speaker":"Fr Stephen De Young","text":"When the Archangel Gabriel comes and announces to the Theotokos that she's going to give birth to a son that was going to be celebrated on March 25th. And if you're using the old Julian calendar because of that, sometimes pascha Falls on March 25th."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8100.88,"end":8101.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8101.84,"end":8110.24,"speaker":"Fr Stephen De Young","text":"Right. And you end up with what's called Curio Pascha, which is this mix, this liturgical mix of the Annunciation and Pascha."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8110.24,"end":8112.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Mega, mega feast."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8113.4,"end":8122.6,"speaker":"Fr Stephen De Young","text":"Yeah. Combines like Voltron and you get. Yeah. Sort of the Megazord of feasts, to mix my metaphor."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8122.6,"end":8166.05,"speaker":"Fr Andrew Stephen Damick","text":"And I should add, since we just said all that, actually, if you're interested in kind of a little bit of the homework behind some of that, there's a good article out there by Dr. William Tighe, t I G H e called Calculating Christmas, which appeared a number of years ago in Touchstone magazine, and you can find it online, actually, you can just read it. And it talks specifically about this question of integral age and the Enunciation. And the whole point is the one that we're about to make, which is if you know that the annunciation is on March 25, then nine months after a baby is conceived, he's born. So therefore, December 25th, that's where December 25th comes from."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8166.28,"end":8177.56,"speaker":"Fr Stephen De Young","text":"Right. Therefore December 20th. So that's where that date comes from. Right. And. And it's not based on a historical memory of the Church that that's the calendar date that Jesus was born on."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8177.88,"end":8178.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8178.28,"end":8183.16,"speaker":"Fr Stephen De Young","text":"It's not based on that. It's. It's a liturgical date when it's celebrated."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8183.16,"end":8194.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I'll say, like, you know, even if it had been the case that the Church chose to pick something to replace a pagan feast, that's not syncretism."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8196.83,"end":8197.31,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8197.55,"end":8250.64,"speaker":"Fr Andrew Stephen Damick","text":"That's, you know, that's saying, we're taking this, you Know, we're taking. We're reclaiming territory. We're reclaiming. Yeah, right. It's not the case for Christmas's date. It's not. But the point is, is that's not a problem. And it's not syncretism. It's. It's. It. It wouldn't, it wouldn't be syncretism. It's really about sort of conquest, really, you know, that the one true God is retaking what belongs to him wherever. I mean, the same thing happens like for instance, where pagan temples where the altars would get destroyed by Christians and then. And then a Christian altar would be set up and then the place would be sanctified and they would put relics of saints in there so as to drive out the demonic presence. Right. So it's not syncretism. But again, that's not what's going on in Christmas. In any event, the date is really about the Annunciation. It's related to the Annunciation."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8251.52,"end":8268.08,"speaker":"Fr Stephen De Young","text":"Right. And this is kind of important because we don't take into account the fact that all the months and all the days and everything were dedicated to and governed by these spiritual powers represented by the stars and constellations we've been talking about."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8268.08,"end":8270.16,"speaker":"Fr Andrew Stephen Damick","text":"That's why you got to have a liturgical calendar."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8270.32,"end":8276.06,"speaker":"Fr Stephen De Young","text":"So the Christian. The Christian festival calendar is reclaiming time."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8276.46,"end":8277.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8277.34,"end":8278.86,"speaker":"Fr Stephen De Young","text":"From the demonic powers."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8278.94,"end":8279.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8279.42,"end":8280.78,"speaker":"Fr Stephen De Young","text":"Hi, Dr. Rokus."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8283.18,"end":8284.86,"speaker":"Fr Andrew Stephen Damick","text":"I don't know if she listens to."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8284.86,"end":8296.73,"speaker":"Fr Stephen De Young","text":"Or not, but anyway, I don't think she does either. But just in case someone tell her, maybe she'll listen to this one. She's busy editing a really poorly written book manuscript right now."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8296.88,"end":8301.24,"speaker":"Fr Andrew Stephen Damick","text":"Know by you hint, everybody."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8301.24,"end":8302.12,"speaker":"Fr Stephen De Young","text":"So I could say that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8302.12,"end":8302.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8303.28,"end":8316.08,"speaker":"Fr Stephen De Young","text":"But, but yeah, it's. It's the reclaiming of time from the. As the same way you reclaim physical space as sacred space with those temples, we're also reclaiming the days and months of the year."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8316.32,"end":8316.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8318.08,"end":8354.92,"speaker":"Fr Stephen De Young","text":"For God. And, and those are being given over to the saints, too, taken from the powers that have them and given to the saints like St. Stephen. But to our thrust here. Hey, we're finally going to get to our topic now. That means that looking at December 25, 3 BC and trying to figure out what was going on in the stars isn't going to lead us to the sign in the heavens. That's not going to do it. What will lead us to it, I think, interestingly, is what I think is ultimately a bad interpretation of Revelation, chapter 12."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8355,"end":8357.48,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, what's that all about then?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8359.16,"end":8383.41,"speaker":"Fr Stephen De Young","text":"This is a case where you do the Math problem. Wrong. But you still come up with the right answer. I think you arrive at the correct answer through the wrong procedure. So some folks, and by some folks, I mean a few scholars and a lot of people on the Internet, have looked at Revelation chapter 12, which begins with St. John saying he saw a sign in the heavens."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8384.29,"end":8384.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8385.17,"end":8415.79,"speaker":"Fr Stephen De Young","text":"So, boom, okay. Something going on in the heavens. And then goes on to describe the woman standing on the moon, clothed with the sun, the dragon at her feet. Right. This is this. This apocalyptic description of the birth of Christ and the. The dragon, the devil's attempts to destroy Christ and the church. And we'll end up doing an episode on Revelation 12. I'm sure at some point. We've already talked about it a little, a couple of times in terms of the fall of Satan."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8415.79,"end":8416.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8417.79,"end":8428.04,"speaker":"Fr Stephen De Young","text":"In the podcast. But so they say, well, if this is a sign in the heavens, what if this is talking about astrological phenomena?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8428.2,"end":8430.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. Natural question."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8430.92,"end":8454.96,"speaker":"Fr Stephen De Young","text":"What if the woman is the virgin Virgo. Right. And what if clothe with the sun means the sun's in this position and standing on the moon. So the moon's in that position and things start to stretch a little. Right. Like the dragon becomes like Scorpio, because it's some of the Babylonian stuff. He's more of a dragon than a scorpion."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8455.2,"end":8455.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8455.64,"end":8458.32,"speaker":"Fr Stephen De Young","text":"There's some stuff where maybe fudging that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8458.32,"end":8459.12,"speaker":"Fr Andrew Stephen Damick","text":"Needs to go on."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8460.08,"end":8493.21,"speaker":"Fr Stephen De Young","text":"Yeah. And it starts out strong and then it gets a little shakier. But what you end up getting described, and there's a star that appears related to the constellation Leo the Lion Judah. Right. So you end up coming up with this conception. And I think it's a little bit of work to get it to fit Revelation 12. But it just so happens that this sort of massive conjunction of stars, planets, etc. And the sun and the Moon all happens in 3 BC on a particular day."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8493.45,"end":8494.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8494.89,"end":8582.86,"speaker":"Fr Stephen De Young","text":"And so this is why I say, I don't think that's a good interpretation of Revelation 12. I don't think it works for interpreting that text to say that St. John gets to what we now call the beginning of chapter 12 and says, oh, by the way, do you want to know what day Jesus was born? And then sort of goes back to his other topics. Right. I don't think that works. Yeah, other people do, but I don't. But I think that going through all that has led us to, Hey, 3pc is the year Jesus was born. And there is this conjunction that happens in 3 BC on this particular day that has all of this massive symbolism regarding kingship, the tribe of Judah, all of these things, and is exceedingly rare to happen at all. One of the reasons I say a lot of people on the Internet talk about this is there was a big furor because this particular conjunction happened again in 2017. And so certain people were super certain that, well, hey, if this is what happened when Jesus was born, then that means when this happens again, he's coming back. That's just one of several apocalypses that I've survived over the course of my life."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8583.85,"end":8587.61,"speaker":"Fr Andrew Stephen Damick","text":"It's the end of the world again. Right. So that I feel fine."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8588.25,"end":8636.25,"speaker":"Fr Stephen De Young","text":"Right. So I don't buy that. And I want to make clear I don't buy that as the correct interpretation of Revelation 12. But it has gotten us to, hey, in 3 BC the year Jesus was born, this confluence of celestial things happened. That would definitely be the most prominent and rare thing that happened that year for the Magi to notice, and is the kind of thing that they would have noticed and would have clued them in that a king, a significant king had been. Had been born. And this happens to be a date. Another point for this is that this happens to be a date that was very significant for the Judean people."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8636.25,"end":8650.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so. So just to kind of underline the point that you're making here, it's yes, something really big did happen in the sky. Like, really big did happen in the sky in 3 B.C. but that's not what Revelation 12 is talking about. Yes, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8650.17,"end":8651.69,"speaker":"Fr Stephen De Young","text":"Okay. That's what I'm saying."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8651.85,"end":8652.49,"speaker":"Fr Andrew Stephen Damick","text":"All right, good."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8652.49,"end":8652.89,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8652.97,"end":8655.05,"speaker":"Fr Andrew Stephen Damick","text":"Just. I just wanted to spell it out in case."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8655.05,"end":8656.45,"speaker":"Fr Stephen De Young","text":"Yes, very clear."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8656.45,"end":8657.49,"speaker":"Fr Andrew Stephen Damick","text":"I'm not sure how to follow that."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8657.49,"end":8692.03,"speaker":"Fr Stephen De Young","text":"Okay, yeah, but, but, yeah, so, but, but through that sort of biblical interpretation, chicanery, we discovered this astrological thing that happened in that year. And so the date that. That fell on on the Jewish calendar that was being used by the second temple Judeans at that time is Tishri 1, the first day of the month of Tishri on the Jewish calendar. This is a majorly significant date on the calendar. First of all, it's New Year's Day."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8692.51,"end":8693.99,"speaker":"Fr Andrew Stephen Damick","text":"Right. So Rosh Hashanah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8693.99,"end":8698.03,"speaker":"Fr Stephen De Young","text":"Right, Rosh Hashanah on the Jewish agricultural calendar."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8698.03,"end":8698.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8698.99,"end":8710.03,"speaker":"Fr Stephen De Young","text":"I don't want to go too granular on this. There are actually two Jewish calendars. We may talk about that at some point. No, it's New Year's on the agricultural calendar. Pascha is New Year's on the festival calendar."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8710.03,"end":8710.67,"speaker":"Fr Andrew Stephen Damick","text":"Oh, fun."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8711.64,"end":8713.68,"speaker":"Fr Stephen De Young","text":"And we still kind of have that in the Orthodox Church."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8713.68,"end":8720.84,"speaker":"Fr Andrew Stephen Damick","text":"But I digress yeah. We do have kind of multiple calendars going on in the Orthodox Church, even just within a single parish."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8721.56,"end":8741.63,"speaker":"Fr Stephen De Young","text":"Right. This is the equivalent of the indiction on the modern Orthodox calendar. And it's around the same time of year. Not coincidentally, it's New Year's Day. This is also the day that David was coronated or crowned as King of Judah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8741.63,"end":8742.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8742.19,"end":8755.95,"speaker":"Fr Stephen De Young","text":"And so it became sort of the inauguration day for all the kings of Judah throughout Judah's history. So this makes it obviously a very messianically significant day."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8756.11,"end":8757.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8758.19,"end":8768.04,"speaker":"Fr Stephen De Young","text":"If the Messiah is the son of David, as we talked about last episode, this is a majorly significant day. This is also the day that Noah was born."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8768.52,"end":8769.16,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8769.64,"end":8776.6,"speaker":"Fr Stephen De Young","text":"Based on. You could kind of calculate his birthday based on how old it says he was during different months in the flood story."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8776.76,"end":8782.2,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, would the birthday of Noah. I mean, is that a liturgical commemoration on the Jewish calendar?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8783.24,"end":8829.36,"speaker":"Fr Stephen De Young","text":"Yeah, that was part of the understanding of that day, all the things going on that day. Yeah. And Noah, See, again, we just read the story of the flood. We start with beginning of Genesis 6 and the Nephilim and stuff, because we get excited by the giants. But when he's born, Lamech has this prophecy about Noah, about how God's going to save the world through him, save the creation through him. So Noah really takes on. He's this savior figure, and it's through him that the world's preserved. He becomes sort of the way that Adam was the father of that previous age. He becomes sort of the father of this new age that begins after the flood. So there's some New Year connection there."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8829.52,"end":8832.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's a new Adam. Yeah. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8832.48,"end":8851.78,"speaker":"Fr Stephen De Young","text":"Yeah. And there's. When you read again, when we do our inevitable series on first Enoch, there's traditions surrounding his miraculous birth, where he's born sort of glowing and talking and. And his father's sort of like, wait, is he a Nephilim? Like, what's going on here?"}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8851.78,"end":8855.62,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Is Noah a giant and has to."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8855.62,"end":8927.97,"speaker":"Fr Stephen De Young","text":"Be sort of reassured. Right. He has Edict show up. You know, God sends Edict to go and tell him, no, it's okay. He's really your son. And St. Matthew kind of inverts that whole story with the story of Joseph. When Joseph at St. Joseph the betrothed sort of doubts first. Like when the Theotokos gets pregnant, he's kind of like, you know, what's going on? And an angel comes to him and reassures him that it's not a son. Yeah. So it's sort of inverted there but so, yeah, there's all these Noah's birth traditions that get taken up in that day. So all of that is on that day. And there's this major, rare astrological, Judah King related event on that day in 3 B.C. so all of this comes together for a pretty strong argument if you're going to pick a day. Right. Everything we've laid out, this third half, I think, other than Revelation 12, makes a really good argument for this particular day. And that day on our modern calendar was September 11th."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8928.13,"end":8934.25,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Which, of course, now has a bit of an apocalyptic significance."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8934.25,"end":8938.45,"speaker":"Fr Stephen De Young","text":"Overtowed all its own for us Americans. Yeah, yeah, yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8939.49,"end":8959.28,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so are you saying then, that there's this astronomical. Astronomical event that occurs, some sort of major conjunction that they would have seen, and that is the star that the Magi see in the east."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8959.76,"end":8966.48,"speaker":"Fr Stephen De Young","text":"This is what the Magi see. This is what St. Ignatius is talking about. This is what St. Paul is talking about. Yeah."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8967.84,"end":8977.24,"speaker":"Fr Andrew Stephen Damick","text":"And is this then the same angel who speaks to the shepherds? Is that how we should read this? So that's a different angel making that announcement."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8977.24,"end":8978.4,"speaker":"Fr Stephen De Young","text":"Yeah. Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8978.72,"end":8980.42,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. Gotcha."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8980.74,"end":8981.14,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":8981.54,"end":9180.3,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Well, it's been a wild ride, but fun as always. All right, well, let's just offer some last thoughts. Number one, one of the reasons I love doing this show is because I read the Bible in a new way that I did not before. And honestly, it makes so many things kind of fit together. But the other thing that I wanted to especially say is, you know, we talked about pagan astrology and syncretism and all that kind of stuff over and over again. And I think that sometimes modern Christians understandable fear of those things makes it so that we throw out the baby with the bathwater, so to speak. Right? So we know that horoscopes are nonsense, and so therefore anything that looks like astrology is bad and not Christian. Well, as we've seen, that's simply not the case. I mean, the Bible has astrology in it. It is a different character for sure than pagan astrology. And it's definitely a different character than the kind of modern fortune telling type. Right. And this is one of our persistent themes in this podcast is the things that paganism got right, but then also commenting on the ways that they got those right things wrong. And to me, this particular one really shows that, and I hope has opened up your eyes, listeners, to, as Father Stephen described it, layers of meaning that are also present there and actually show how utterly rich the scriptures are. Just rich. So rich. So many layers upon layers. Upon layers of meaning, and that it's not just stuff for us to hear and say, oh, that's cool. I mean, there are definitely moments that I was saying, oh, that's cool, because it is cool, but rather that as we marvel at the complexity and the glory and the beauty of the astonishing revelation of God to man, that we would be drawn to love him and to worship Him. And one of the things that this also does for me is just seeing how all of these pieces fit together so seamlessly is for me, a reassurance of the truth of all of is more than any human being could ever design. It really is. And that what God is saying to us in all of this has a very specific content, which is that he has sent His Son, and He sent His Son to defeat these evil powers that we're enslaved to, to rescue us from that bondage and to set us among the stars, among his divine counsel. So, you know, glory to God in the highest. I mean, that's what the angels say. So that's what we say as well."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9181.1,"end":9492.6,"speaker":"Fr Stephen De Young","text":"In terms of my final thought, when we. When we talk about the fallenness of humanity, and we're inevitably going to go into more detail about that and how there's actually three falls of humanity, when we talk about the fallenness of humanity, we've got a pretty good lock in our understanding of our fallenness, of this separation and this disjunction, this alienation between us and God. In fact, in some circles of American Christianity, that's about all you've got in terms of human fallenness. But many of us have a little larger view of that. We understand our fallenness in terms of not only the alienation between us and God, but the alienation between us and our fellow human beings, that there are rifts and gaps and pain caused by sin that separate us from each other. And we understand that in Christ the communion between us and God, the communion between us and each other is restored. But there's a third major element of our fallenness in the Scriptures that we've lost sight of almost completely. And that's the separation and the disjunction and the separation schism between us as humans and the rest of the creation. This alienation that Adam receives between him and the ground from which his food is going to come, the even more complete alienation that Cain experiences after he sins. We don't go outside and hear the stars sing to us anymore. We don't relate to them. We don't relate to the animals. We don't feel the ground under our feet and we don't work it for most of our food. We don't know or raise the animals that we eat or the animals that serve us. We're completely disconnected. And in this way, as in all three ways, secularism and materialism are the denouement. They're the apex of the fallenness of humanity. Secularism and materialism deny that God speaks and he acts, and often even that he exists, denies that the whole spiritual world that we talk about so much on this podcast exists, deny that our departed loved ones still exist and the departed saints still exist. It denies and rejects the real communion between people. It separated us as individuals and isolated us. And it's also separated us, modern materialism has separated us from the rest of the creation that are just rocks floating in space or gas balls that have nothing to do with us and our lives. Trees are trees, rocks are rocks. Concrete is better because it's smoother and it's man made and we're completely alienated and separated. But the truth is that part of what Christ does in our salvation is also reunite us with the rest of creation. He also reunites us with our departed loved ones. He reunites us with the angelic beings in worship and in praise, and through theosis, unites us with them truly in his counsel and in the heavens. But he also reunites us with the earth that we live on. He reunites us with the nature that surrounds us. We see the saints who are even reunited with sometimes wild animals who come and serve them and live with them. And so a big part of what I hope this podcast can help all of us do is try to break down that barrier as well, that we would not only, as we talked about in the last couple of podcasts, get to know the saints, but we would also get to know our fellow creatures, that we would get to see how all of creation, all of God's creation is connected, connected to us, connected with itself and how God works His love and communicates with us, shows his love for us and works out of love to bring us closer to him and to work at our salvation through all of the creation, including the stars in the sky and the sun and the moon. So I hope we've done a little piece of that today, a little piece of that beginning of that reunion where we could sort of take our place again in the whole world of God's creation that he's made and he's blessed us to be a part of."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9493.16,"end":9522.78,"speaker":"Fr Andrew Stephen Damick","text":"Amen. That is our show for today. Thank you very much for listening. This episode was not live, but in the future if you would like to connect to us during a live broadcast, you can call in. You can also email us@lordofspiritsancientfaith.com you can message us at our Lord of Spirits Podcast Facebook page. We read everything, but unfortunately we can't respond to everything. But we do save what you send for possible use in future episodes and."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9522.78,"end":9541.15,"speaker":"Fr Stephen De Young","text":"Join us for our actual live broadcast on the second and fourth Thursday of the month at 7pm Eastern, 4pm Pacific. Don't forget to like our Lord of Spirits Podcast Facebook page. While you're at it, leave a recommendation, join our Divine Council Facebook discussion group and then invite all your friends to both."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9541.55,"end":9549.95,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts, then that raises the visibility of the show and gets more people connected."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9550.99,"end":9558.52,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9558.76,"end":9562.6,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. God bless you. Christ is born. Glorify Him."}
{"episode_id":"LOS - #010 - 2020-12-24 - Taught by a Star to Worship the Sun of Righteousness","start":9563.32,"end":9600.53,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
