{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":0.56,"end":65.23,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":66.99,"end":94.01,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, giant killers and dragon slayers. You are listening to the Lord of Spirits podcast. And my co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Daemick in Emmaus, Pennsylvania. And we are live. Unlike two weeks ago where we were live but not live, but we saw you. It was weird. I don't know. I mean, it's strange having met so many of you now. Like, it. Did it make it weird? What do you think, Father?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":94.33,"end":94.81,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":95.29,"end":114.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But we're gonna, you know, soldier on. So if you are listening to us live, you can call us tonight at 855-237-2346. Talk to us. We're gonna get to your calls in the second half of the show. And Elijah is going to be taking your calls, so he's sitting in for Matushka Trudy tonight."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":114.13,"end":132.5,"speaker":"Fr Stephen De Young","text":"And listen, listen, folks, I just found out this is a kid, right? This is an ingenue. He has a certain playful insouciance, if you will. Don't be calling in with your sailor talk and teaching him words he's never heard before. Okay? Keep it cool."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":133.62,"end":228.44,"speaker":"Fr Andrew Stephen Damick","text":"Duly noted. You know, the sad thing is, Elijah, like, it would be really uncouth for him to just, like, break in and say, hey, now I've heard some words. No, he won't. All right, now it's time to sell some coffee. So Lord of Spirits podcast is brought to you by our listeners with help from Lore Coffee Roasters. Lore Coffee Roasters is a specialty coffee company owned and operated by two Orthodox Christian families working to glorify God in all things, the Lore team is focused on sourcing and roasting the highest quality coffee from all over the earth, even Vanuatu. Ah, maybe not. And having it delivered to your door. In a seamless experience, they have built a subscription platform on their website, making it easy for you to choose your coffee, how much of it you would like, how often you want it delivered. They are also equipped to provide wholesaling solutions for select partnerships. Help support Lord of Spirits by choosing coffee from Lore Coffee Roasters and Orthodox Specialty Coffee Company and be a part of the story behind good Coffee. You can view their coffee library and subscription plans@loreroasters.com you can follow them on Instagram and Facebook at Lore Coffee Roasters. And hey, there's a discount. 10% off your first order. You can use the discount code LOS10LOS10. So get your coffee. I've had some. It's good. Liked it. Would drink again. So yes, I have a little advertisement of my own. Everybody."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":228.68,"end":230.28,"speaker":"Fr Stephen De Young","text":"Shameless self promotion."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":230.36,"end":295.6,"speaker":"Fr Andrew Stephen Damick","text":"Shameless self promotion. I. I mean, you did say that I get to be the Stan Lee of online orthodoxy, so. Excelsior. Right. So if you've been living under a rock, which is one of my favorite expressions, the idea that someone who doesn't know what's going on lives under a rock. If you've been living under a rock, you may not be aware that there is a new book written by your humble servant with a foreword by the Very Reverend Dr. Ogre sitting on the other end of the line for me. And it is titled simply the Lord of Spirits An Orthodox Christian Framework for the Unseen World and Spiritual Warfare. And it is a distillation of much of the podcast, but also a lot of new material that even super, super ravenous Lord of Spirits listeners have never encountered before. At least not from us. So get yourself a copy store. Ancientfaith.com they're apparently selling like hotcakes, which apparently hotcakes sell really well with, thus lending us that metaphor. I've never bought that. I can recall."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":295.6,"end":297.08,"speaker":"Fr Stephen De Young","text":"Is IHOP stock doing that?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":297.08,"end":305.59,"speaker":"Fr Andrew Stephen Damick","text":"Well, I do not know. I have not been to the International House of Pancakes in some time. But yeah. And is the."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":305.83,"end":308.71,"speaker":"Fr Stephen De Young","text":"There was a. There's a marketing error with this book, though."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":309.11,"end":309.59,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":310.31,"end":317.35,"speaker":"Fr Stephen De Young","text":"Because, I mean, I think the big selling point was like the first three pages and you gave those away for free in the sample."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":317.59,"end":322.63,"speaker":"Fr Andrew Stephen Damick","text":"It's true. People can read your forward for free in the sample and the introduction and chapter one."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":323.11,"end":327.11,"speaker":"Fr Stephen De Young","text":"Yeah. And it's like, you know, you got the best part."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":327.51,"end":333.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I know well, you know, I mean, this podcast is free."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":334,"end":335.76,"speaker":"Fr Stephen De Young","text":"You don't serve people the dessert first."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":338.64,"end":342.68,"speaker":"Fr Andrew Stephen Damick","text":"It is one of the best forwards I have ever read this week."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":342.68,"end":344.08,"speaker":"Fr Stephen De Young","text":"You read a lot of forwards."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":345.68,"end":362.92,"speaker":"Fr Andrew Stephen Damick","text":"I am one of those people who, like, okay, you know, like, this is a really boring introduction on this major academic work, but I will read it because it is in the book, so everyone should be a completist. Unless you're Jamie Bennett. He never finishes books he doesn't like."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":367.24,"end":377.08,"speaker":"Fr Stephen De Young","text":"See, I feel I don't finish books I don't like is really an excuse for the stack of unread books that he and many other people have. He's just not willing to man up and admit it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":378.76,"end":382.04,"speaker":"Fr Andrew Stephen Damick","text":"Call us, Jamie Bennett. Let us know what's going on with all that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":382.28,"end":385.56,"speaker":"Fr Stephen De Young","text":"Gird up your loins and admit that you just haven't read all your books."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":385.82,"end":424.93,"speaker":"Fr Andrew Stephen Damick","text":"Let's get your wife on. I want to hear what she thinks about this big stack of books that you've got lying around. Partly read. So. All right, well, tonight we're heading back into deep waters, discussing questions of interpretation of the Scriptures and the church fathers. What do these texts mean? How do they get applied? And is our thinking on this question usually kind of modernist? And if so, how do we get out of that way of thinking? So turns out that the answers to these and so many other questions starts in Genesis, chapter one, which. Big shocker, right? Like, we don't ever do that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":426.21,"end":433.65,"speaker":"Fr Stephen De Young","text":"Well, yeah, well, you're bearing the lead here. You're making it sound like we're starting with the creation of the world, but we're actually going to go back before that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":433.81,"end":437.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's true. That's right. Genesis 0."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":438.13,"end":445.83,"speaker":"Fr Stephen De Young","text":"Yeah. We're going as far back as you could go back. There's no more back after that. Before that back was not in existence."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":445.83,"end":450.71,"speaker":"Fr Andrew Stephen Damick","text":"Yet, which we can say words like nothing, but you can't think of nothing."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":451.11,"end":454.71,"speaker":"Fr Stephen De Young","text":"Yes, yes, because when you think of nothing, you're thinking of something."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":456.95,"end":460.79,"speaker":"Fr Andrew Stephen Damick","text":"Like in the Never Ending Story. I mean, the nothing was definitely something."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":462.15,"end":467.52,"speaker":"Fr Stephen De Young","text":"People. You're traumatizing people about the horse. You don't need to do that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":467.84,"end":482.8,"speaker":"Fr Andrew Stephen Damick","text":"You know, I watched that. I watched that movie again, like, a couple of years ago. Did not hold up for me. I don't know. I felt really bad about that, too, because it had this wonderful little space in my childhood memory, and then I kind of killed it by watching it again."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":483.28,"end":496.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. People should post more courtesy lists of things to not revisit. Mm, right. Like, I'll put on the list Super Friends and Thundercats, like, ooh, yeah, I never."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":496.51,"end":497.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I haven't gone back."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":497.63,"end":498.47,"speaker":"Fr Stephen De Young","text":"Don't go there, man."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":498.47,"end":510.07,"speaker":"Fr Andrew Stephen Damick","text":"Now, now that you've said that, I think I won't. Yeah, I will. Occasionally I do say things like thundercats hoe. I mean, every so often just in my life. But, yeah, yeah, I'm not watching the show."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":511.35,"end":520.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Usually you're throwing gang signs when you yell that, too, which is the weird part. But we will discuss your lifestyle outside of the show."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":523.86,"end":524.14,"speaker":"Fr Andrew Stephen Damick","text":"Thank you."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":524.14,"end":589.74,"speaker":"Fr Stephen De Young","text":"Your personal life should remain your own on the mean streets of Emmaus. So, yeah, we're starting at the beginning of Beginnings. Right. And also, fair warning, we're going kind of deep in this show, so we're kind of. We're kind of going into the deep end. We do that every once in a while. It's been a minute since we did that, but we're doing it again, so everyone's warned. But we're starting out by sort of reviewing a little bit of stuff that we've talked about in the past. This episode as a whole, we're going to be, like, picking up information. We're picking up some threads from some past episodes and kind of weaving them together to look at. Bring some things together and look at some things from a certain perspective. So we're going to start out with some comfortable review before we dive into the deep end."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":589.82,"end":592.46,"speaker":"Fr Andrew Stephen Damick","text":"Settle in, kids. These are all parts of the book you've read before."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":592.78,"end":637.63,"speaker":"Fr Stephen De Young","text":"Yeah. Play the hits here for a minute before we get into the new material. So one of the. Probably the overriding theme tonight that we're going to be talking about, because we're talking tonight about meaning, Right? And meaning is inextricably related to order. And so order, as in patterns, as in systems, as in structures, Right. You kind of can't have meaning without it. Right. Chaos does not have meaning. Sort of by definition."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":638.35,"end":644.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Gibberish is not meaningful until you, like, put some kind of order on it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":644.75,"end":720.61,"speaker":"Fr Stephen De Young","text":"Yeah. Nothingness cannot be put in order. Right. Because it's nothing. And if it gets put in order, it becomes something. Right. And that's how we've talked about creation in the past. That the way Genesis 1 presents God's creation of the world is in terms of this twofold pattern, right? He's dealing with the two problems of the Earth at the beginning of his creative act, being formless and empty. And so on the first three days, he puts cosmos in order. On the second set of three days, he fills it with life. And that these two things are Commensurate that things being put in order is what allows life to flourish. So this is not an order at the expense of life, like a kind of tyranny. But this is also not life grown out of control and turning into chaos. Right. These two mutually go together. So we've talked about this a lot in creation, but the question we maybe haven't asked and therefore haven't answered is what is order?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":722.45,"end":732.29,"speaker":"Fr Andrew Stephen Damick","text":"You just sort of assume people have some idea of what that is, which we do. But maybe let's look underneath that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":732.77,"end":769.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And what would the definition of order be? How do we define it? How do we understand what that term means? And you can't. Right. Sometimes when you've got something that's in kind of a polarity. Right. Or a distinction. So we've got order. Order is. As opposed to chaos. Right. You have order on one side, you have chaos on the other. Right. Being and non being. Right. But you can't define order in terms of a lack of chaos."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":771.06,"end":772.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":772.66,"end":783.7,"speaker":"Fr Stephen De Young","text":"Which is sometimes how we're tempted to do things. Right. You define darkness as an absence of light. Absence of light. Right. But you can't define light then as an absence of darkness."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":785.22,"end":785.62,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":785.62,"end":793.14,"speaker":"Fr Stephen De Young","text":"Or at least if you try to, it makes it clear that you don't know what either term means if you're just describing them as the lack of the other. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":793.62,"end":815.54,"speaker":"Fr Andrew Stephen Damick","text":"Although when I was a stagehand, we used to. We used to tell people, some performers that would come to our theater, that we had spray cans of light be gone because they would complain about light being on a particular part of the set or something like that. And, like, can you, like, light this? That's two inches from that, and then not that. Like, oh, let me just go get my can of light pecan."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":817.38,"end":820.5,"speaker":"Fr Stephen De Young","text":"You know, there is that black paint now. Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":821.3,"end":823.86,"speaker":"Fr Andrew Stephen Damick","text":"It sucks all light into it, absorbs all light."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":823.86,"end":824.34,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":824.66,"end":834.96,"speaker":"Fr Andrew Stephen Damick","text":"One time we were actually asked to light a dancer, but not the floor. Floor that she was standing on. And we're like, okay, we're going to have to have a meeting."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":835.6,"end":841,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":841,"end":841.44,"speaker":"Fr Andrew Stephen Damick","text":"Good times."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":842.8,"end":844.4,"speaker":"Fr Stephen De Young","text":"So that dog don't hunt, Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":844.56,"end":845.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":845.68,"end":890.87,"speaker":"Fr Stephen De Young","text":"Because what chaos is definitionally right. Because chaos, as we've talked about it, is non being. Right. Non being. The very structure of the word. It's a negation of being. Right. So of the two terms order and chaos, chaos is the one that's in a negation. Chaos is an absent absence of order, not vice versa. Right. And I know this already was a hard concept. Right. Because we still get Questions about this from people who listen to the old order and chaos episode where we talk, talked about God being presented as creating things out of primordial chaos. And we get the question, well, who made the primordial chaos?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":891.83,"end":898.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because they would probably think of the primordial chaos as being like the nothing in the never ending story. Like it's this big roiling cloud of darkness."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":899.35,"end":921.75,"speaker":"Fr Stephen De Young","text":"Yeah. It's a thing. Right. And the whole point of it is that it's no thing. If someone created it, it wouldn't be chaos anymore. Right. And that question is sort of like asking when someone says God created ex nihilo out of nothing, you're saying, yeah, well, who created the nothing? Right. Nothing created. It's nothing, it's not a thing."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":921.83,"end":922.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":922.19,"end":976.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So I know that's already hard. Right. But chaos is just a negation of order. Okay, so then what is this order that we're talking about when we say that God ordered the creation? There are different ways that this can and has been understood. So for example, some folks, Plato's, one of them will posit that there is some kind of order, some kind of pattern that is external to God, meaning it's not God himself. Right. And that imposes some kind of necessity on God as he creates."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":976.51,"end":980.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He has to obey it, follow it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":980.31,"end":992.31,"speaker":"Fr Stephen De Young","text":"Yeah, Follow that pattern. Follow that. Right. Plato in the Timaeus. Right. The demiurge. Right. Creates everything after the pattern of the eternal forms."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":992.31,"end":992.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":996.01,"end":1012.09,"speaker":"Fr Stephen De Young","text":"So they're. The eternal forms are external to the Creator, for Plato. And the Creator is beholden to them. Right. Now there's obviously a big problem in terms of that with the Christian God."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1012.33,"end":1015.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because God doesn't have to obey anything."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1016.09,"end":1041,"speaker":"Fr Stephen De Young","text":"Right. There's certain people on the west coast with three initials who don't follow that. Right. Who say that God has to obey the laws of logic. But those people are fractally wrong, so you'd expect them to be wrong about this too. So that is not the Christian God. Right. So that's a. Nope. The idea that there's some external pattern or order or system of justice that God has to obey."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1041.24,"end":1045.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because again, if there's something above God, then you should worship that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1045.7,"end":1061.38,"speaker":"Fr Stephen De Young","text":"Yeah. Then that's actually God. Yeah. So there's another way of looking at this where this order or this pattern is something that is not God himself, that is separate from God."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1062.58,"end":1062.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1063.62,"end":1089.55,"speaker":"Fr Stephen De Young","text":"But is not above him, or does not impose any necessity on him, meaning it's contingent. So either God created this pattern and then created everything else according to the pattern. Right. Or this pattern is some other way, subsidiary. Or God could have used a completely different pattern if he wanted to."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1090.43,"end":1095.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of God as a divine architect who makes blueprints beforehand."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1095.87,"end":1096.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1096.23,"end":1124.75,"speaker":"Fr Andrew Stephen Damick","text":"And which he could have made in whatever way. And this, by the way, Tolkien fans, is the model that's presented at the beginning of the Silmarillion, the Ainulindale. Easy for me to say. Where, you know, there's the music, which is basically the blueprint for creation, and then creation follows from that. But that's not what's in the scripture. It's not the Christian tradition, as cool as that is in Tolkien. But that's not what."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1125.15,"end":1125.55,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1125.55,"end":1126.51,"speaker":"Fr Andrew Stephen Damick","text":"That's not what we see."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1127.09,"end":1129.73,"speaker":"Fr Stephen De Young","text":"But this is a different view. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1129.73,"end":1130.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1131.17,"end":1151.25,"speaker":"Fr Stephen De Young","text":"So in order to get at the biblical view, we have to go to one passage that I know is always at the forefront of everyone's mind. That's Proverbs, chapter 8, verses 22 through 31. You probably don't even have to read it. You probably have all memorized this."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1152.29,"end":1169.68,"speaker":"Fr Andrew Stephen Damick","text":"Proverbs is one of those books that I think really gets ignored by a lot of Christians. But if you just at least read it or listen to it and try to do some of what it says, that's kind of. I mean, it is a blueprint for good Christian living."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1170.64,"end":1178.64,"speaker":"Fr Stephen De Young","text":"Yeah. And if you. And this passage in particular, if you're not aware of this passage, you will not understand any church father ever."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1179.92,"end":1181.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1181.75,"end":1182.59,"speaker":"Fr Stephen De Young","text":"Quite literally."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1183.23,"end":1249.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Proverbs 8, verses 22 through 31. The speaker here is identified as Wisdom. So starting with verse 22. The Lord fathered me at the beginning of his work, the first of his acts of old ages ago. I was set up at the first, before the beginning of the earth. When there were no depths, I was brought forth. When there were no springs abounding with water. Before the mountains had been shaped, before the hills, I was brought forth. Before he had made the earth with its fields, or the first of the dust of the world, when he established the heavens, I was there. When he drew a circle on the face of the deep, when he made firm the skies above, when he established the fountains of the deep, when he assigned to the sea its limit, so that the waters might not transgress his command. When he marked out the foundations of the earth, then I was beside him like a master workman, and I was daily his delight, rejoicing before him, always rejoicing in his inhabited world and delighting in the children of man. That's a cool passage. Yeah, but it's very. It's in Proverbs, which no one."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1249.59,"end":1254.79,"speaker":"Fr Stephen De Young","text":"No one reads, so people don't even know it's there. You know, they're busy talking about the ideal woman in chapter 31."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1255.03,"end":1260.07,"speaker":"Fr Andrew Stephen Damick","text":"That's right, yeah. So Proverbs, people know."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1260.55,"end":1286.23,"speaker":"Fr Stephen De Young","text":"So this is. This is. Let me go ahead and break a few hearts, because I know that despite my best efforts, there's some people out there, the audience, who are still clinging to this whole. Some version of the Greek. Old Testament is the canonical Old Testament. So the Greek actually completely bollocks this text in a heretical way."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1286.55,"end":1291.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Especially the first verse. Well, verse 22."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1292.13,"end":1298.05,"speaker":"Fr Stephen De Young","text":"Yeah. You got to deal with that. You're going to be a Greek OT supremacist."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1298.21,"end":1311.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So here's what the Greek says. It says, the Lord created me at the beginning of his work. That's what it says. The Lord created me. But what does the Hebrew say?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1312.05,"end":1313.57,"speaker":"Fr Stephen De Young","text":"Rather than fathered me."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1313.81,"end":1317.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, fathered or begot. Begot is just a good old older."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1317.71,"end":1323.67,"speaker":"Fr Stephen De Young","text":"English word for that. I was brought forth is again, it's the Hebrew verb yeled. It's giving birth to."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1324.15,"end":1339.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so here's the thing. I mean, you can try to understand the Greek in an Orthodox way, but it's a big stretch, which, you know, the Arians knew that. And so they said, see, See, He's a created being."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1340.15,"end":1345.83,"speaker":"Fr Stephen De Young","text":"There's. There's a line in the creed, begotten, not made, that is specifically correcting this."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1347.27,"end":1354.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So it's just not the best translation there in. In the Septuagint."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1354.03,"end":1396.88,"speaker":"Fr Stephen De Young","text":"Yeah. And we could understand why in the third century BC Rabbis in Alexandria, dealing with a gentile audience who's going to be reading this would be uncomfortable with the idea of talking about God begetting, fathering, giving birth. Right. And so they kind of shrank away from it and changed it. But, yeah, the original was important. Right. And you notice in the passage, Right. All the language, Right. About mountains and springs and the depths and the limit of the sea. This is all the language of the first three days of creation."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1397.48,"end":1405.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where God brings order to the chaotic world, creates the structure."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1406.68,"end":1435.57,"speaker":"Fr Stephen De Young","text":"And so here in Proverbs 8, 22, 31, the pattern by which, through which, after which God creates the cosmos is his wisdom. His wisdom which is here personified. So this right here, this is how Trinitarianism works."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1435.65,"end":1435.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1435.97,"end":1463.17,"speaker":"Fr Stephen De Young","text":"The original version, not various versions that are around today. Right. So we're talking about Yahweh. That's the Lord at the beginning. Right. Talking about God, capital G, God the Father. Right. Because he's fathering. Right. God is never without his wisdom. Right. There wasn't a time when God was foolish and then he acquired wisdom."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1464.37,"end":1464.77,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1465.97,"end":1499.75,"speaker":"Fr Stephen De Young","text":"Right. This is basic. Right. God is never without his wisdom. Yet here we can see that his wisdom is distinguished from Him. Right. Can be said to be with him, to be alongside him, to be working with him, to be his delight, etc. Right. But his wisdom is not external to him. It is not as if he has no wisdom and he has to consult with wisdom as this separate being."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1500.22,"end":1500.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1500.38,"end":1501.42,"speaker":"Fr Stephen De Young","text":"It is his wisdom."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1502.14,"end":1502.54,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1503.58,"end":1505.5,"speaker":"Fr Stephen De Young","text":"Right. Right. It's his wisdom."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1506.14,"end":1519.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the biblical trinitarian theology that the later, more philosophical formulations are protecting, frankly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1519.18,"end":1548.2,"speaker":"Fr Stephen De Young","text":"Yeah. And explaining in Greek. Right. And the relationship between the two. Right. These two personal beings who are not external to each other is described as one of beginning, again, begotten, not made. Right. And one is begotten from the other and not vice versa."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1549.56,"end":1553.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a derivative relationship."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1554,"end":1579.04,"speaker":"Fr Stephen De Young","text":"Right. Between one and the other. That derivative relationship is why there's still one God. Because there's one first principle. And the Son, the one who has given birth to is the image of the one who gave birth. Remember, this is how Father and Son works. We've talked about this a lot of times Biblically."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1580.87,"end":1581.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1581.27,"end":1627.99,"speaker":"Fr Stephen De Young","text":"They're the same thing. They're not different things. The Son is the exact image of the Father. Right. So when the Hebrew scriptures, when the Old Testament describes this pattern, this order in which and through which God creates everything, it describes it as this divine person who is begotten of God before anything is created, but has to be begotten timelessly. Because, again, God is never without his wisdom."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1628.63,"end":1633.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So eternal begetting is right here in Proverbs 8."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1634.2,"end":1771.62,"speaker":"Fr Stephen De Young","text":"Yeah. And who is the exact image of God? And the original readers of this, ancient Israelites, Second Temple Jewish people, understood this and they interpreted Genesis 1 in light of this. In light of this understanding. And so when you go Back to Genesis 1 with this in mind, what do you find? Well, God creates by speaking in Genesis 1. We kind of take that for granted. Right. But God doesn't take his hand and, you know, burrow things out and build up mountains. Right. He speaks. Right. And so it's His Word that is the mediating factor between God and the creation. And so an even more common name for God's wisdom in this context becomes the Logos. The Logos of creation. Right. The pattern of creation. But the Logos, again, Like wisdom in Proverbs is a person, right? A person who has always been with God. God has never been mindless, right. He's never been without his Logos. Right. He's never been speechless. He's never been without his Logos. And so his Logos is not external to him, is not contingent. Right. This isn't a contingent being, right. God's Logos couldn't be a different Logos. Right. God's wisdom couldn't be a different wisdom because this is an eternal, timeless person whose begetting was timeless. God couldn't have a different Logos. And you find this very clearly, right. First century B.C. philo of Alexandria. You find this very clearly, this fully developed line of interpretation. And it's right there for, say, St. John to pick up at the beginning of his Gospel."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1773.06,"end":1778.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, yeah, St. John, you know, John chapter one is basically recapitulation of all this."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1779.14,"end":1797.02,"speaker":"Fr Stephen De Young","text":"Right. The state it was at that point. Right. This was the understanding derived from and of the Hebrew scriptures previous to that point. So now we need to put a pin there for a second."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1797.98,"end":1803.3,"speaker":"Fr Andrew Stephen Damick","text":"There's gonna be a lot of pins in this episode, people. Yeah, get out your pin cushion."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1803.3,"end":1822.07,"speaker":"Fr Stephen De Young","text":"The Charlie Day Wall of Lord of Spirits episodes. So we're gonna pin there for just a second. We've got a couple more threads to pick up from another old episode. And that's actually the episode we did about God's body."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1824.31,"end":1826.39,"speaker":"Fr Andrew Stephen Damick","text":"Those are early episodes, I think, Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1826.55,"end":1829.27,"speaker":"Fr Stephen De Young","text":"Yes. We're digging in the crates. We're setting the way back machine."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1829.43,"end":1829.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1831.59,"end":1874.22,"speaker":"Fr Stephen De Young","text":"So in that episode, right, we talked about how man is made in the image of God. We've talked about that a lot. Right. But man be made in the image of God. But we specifically in that case talked about the fact that the language that often gets read, especially in the Christian Old Testament, the Hebrew Bible, as being anthropomorphic language. Language that talks about the eyes of God. Right. Or the ears of God, or God being long of nose. Right. That tends to be read by modern people as anthropomorphism."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1874.86,"end":1877.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That God is being made to look like a man."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1878.22,"end":1899.71,"speaker":"Fr Stephen De Young","text":"Right. That humans are sort of imagining God in some kind of human form or mold. Right. But we talked about there is that for the Hebrew scriptures, the opposite is true. Right. And this is the key to understanding man being made in the image of God. That humanity is actually theomorphic."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1900.59,"end":1934.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, one of the ways that this gets illustrated iconographically is if you ever see an orthodox icon of the creation of Adam number one, the one doing the creating is. Is Jesus, you know, it's not some faceless jack chick, God on his throne. It's Jesus. It's clearly Jesus. Right? He's creating Adam, and Adam is made to look like him. Adam looks like Jesus as the creation is happening. So that gets expressed in icons in that particular way."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1934.91,"end":1946.59,"speaker":"Fr Stephen De Young","text":"Right. So when we talk about God's eyes, we're talking about the power of sight. We're talking about that in the truest sense. And then human sight is a derivative. Right. Type of that power."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1946.99,"end":1955.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God's powers are not just big versions of human powers. Human powers are little versions of God powers, small, diminished. Yeah, yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":1958.06,"end":2053.35,"speaker":"Fr Stephen De Young","text":"Right. And so God creates essentially little potential small G gods. Right. This is the front side of what we call theosis. Right. And the way they move toward that goal is intended to be by imaging God, meaning by continuing the work of God in creation, continuing to set creation in order, continuing to fill it with life. Right. We've talked about this before. And so humanity, God is continuing that work, and humanity participates in it. Participates in it. God in his grace, allows that work, work to be mediated through humanity. And that is transformative to humanity, shaping humanity further in the likeness of God. Right. And so we've talked about how in paradise, when man and woman are created, they're created with the intent that the two of them would leave the garden because the garden is not the whole of the earth. Leave the garden, taking paradise with them, and spread out and turn the world into paradise by putting it in order and filling it with life, filling the earth and subduing it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2053.51,"end":2055.75,"speaker":"Fr Andrew Stephen Damick","text":"Edenization, as it were, of the world."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2056.15,"end":2085.63,"speaker":"Fr Stephen De Young","text":"Right. And to do this is to humanize the world. Right. Because that action is mediated through humanity. And even though humanity disobeys, the relationship between humanity and the rest of creation is such that the world is humanized anyway. So Adam gets told, cursed is the ground because of you."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2086.44,"end":2089.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No matter what we do, we're gonna affect the world."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2089.72,"end":2145.05,"speaker":"Fr Stephen De Young","text":"Right. And so if we're not doing what we've been called to do by God, then our sin, our wickedness, is going to despoil, taint, twist. Right. The rest of creation around us, because this humanization is unavoidable. But that's because of the relationship of humanity to the rest of creation. And so what this fundamentally shows is that the order, the pattern in which the whole creation is made is fundamentally human shaped. Right. The pattern is human. The pattern is human, which means the Logos is human. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2146.25,"end":2146.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2146.97,"end":2165.54,"speaker":"Fr Stephen De Young","text":"The Logos is human. And it is this divine human logos that is Made flesh in the person of Jesus as the Father, say, without change or alteration."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2166.5,"end":2175.86,"speaker":"Fr Andrew Stephen Damick","text":"Which is again another mind bending concept that we've talked about a number of times. You know that the incarnation is eternal."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2176.9,"end":2189.14,"speaker":"Fr Stephen De Young","text":"Right? Right. And so the perfect image of God in Christ is also the perfect humanity."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2191.1,"end":2195.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's the man. The man."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2197.42,"end":2262.76,"speaker":"Fr Stephen De Young","text":"Right. At the same time. At the same time. And this means that Christ is both the origin of humanity in being, the pattern through which humanity, the rest of creation and the relationship between humanity and the rest of creation comes into being. And he's the telos, Right. The end, the purpose, the goal of humanity. Theosis of the Orthodox Church means becoming by grace what Christ is by nature. Christ in his person is the perfect union of God and man. Right. And so we become by grace, meaning our humanity is united to God perfectly in Christ. And we experience that through the participation in the work of God in the world. And this is what it means that Christ is the alpha and the omega, the first and the last, the beginning and the end."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2262.92,"end":2265.32,"speaker":"Fr Andrew Stephen Damick","text":"It's really astonishing just to contemplate that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2265.96,"end":2266.36,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2267.48,"end":2268.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2268.52,"end":2277.29,"speaker":"Fr Stephen De Young","text":"And I know this is mind bending stuff we just did in the first half. I'm about to not help. If you want to read more about this, read Saint Maximus the Confessor."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2277.93,"end":2278.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2278.89,"end":2281.93,"speaker":"Fr Stephen De Young","text":"Who is not easier to understand than what I just said."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2282.33,"end":2282.73,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2283.61,"end":2285.25,"speaker":"Fr Stephen De Young","text":"But that is who to read of."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2285.25,"end":2295.77,"speaker":"Fr Andrew Stephen Damick","text":"Saint Photius the Great, you know, one of the greatest scholars in the history of the orthodox church. He described Saint Maximus as being like a labyrinth. He felt lost."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2297.05,"end":2356.35,"speaker":"Fr Stephen De Young","text":"So, yeah, so this is heady stuff, but this is. Right, this is the key to understanding the way in which the fathers, the way in which the Church, the way in which Christianity, frankly, this is why the person of Christ is at the center of all seven councils, seven ecumenical councils. Right. Because this is the key. Christ, the person of Christ is the key to understanding everything literally. Right. The creation. And he's. He's our way to come to know God. So literally everything. And this is Saint Paul comes back to this again and again and again and again, Right. In him all things hold together. Right. Through whom and for whom and to whom all things were created. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2356.75,"end":2357.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2357.23,"end":2360.51,"speaker":"Fr Stephen De Young","text":"Talking about Christ. This isn't just rhetorical flourish."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2361.23,"end":2366.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's not some object floating in space. He's the one who fills all in all."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2366.35,"end":2373.63,"speaker":"Fr Stephen De Young","text":"Right. And this isn't a love song. Baby, you're everything to me. You're the sunrise, you're the sunset. Right. That's not what's good."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2375,"end":2375.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2377.24,"end":2384.04,"speaker":"Fr Stephen De Young","text":"This is actual communicative this is trying to convey who Christ is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2384.28,"end":2386.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is big. Like, this is bigger than."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2389.64,"end":2412.7,"speaker":"Fr Stephen De Young","text":"And the role he plays, not just rhetorical flourish. Right. And so as heavy as this is, and the reason why statements about this, like the ones from St. Paul I was just referencing, sound almost rhapsodic, almost hymnic sometimes is because this is so big and so heavy."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2412.86,"end":2413.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2413.3,"end":2415.18,"speaker":"Fr Stephen De Young","text":"Poetry, the enormity of it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2415.34,"end":2422.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Poetry is kind of the only way to talk about this, you know."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2422.78,"end":2436.39,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. The sheer enormity of it. Right. Is something that can. Right. And again, again, this is not this thing that Christians come up with in the fourth century."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2437.75,"end":2438.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2438.55,"end":2470.57,"speaker":"Fr Stephen De Young","text":"This is something in the Hebrew Bible that was understood by Jewish people centuries before the birth of Jesus. Right. They understood it. Right. They understood who the divine Logos was. They had these ideas. They hadn't met him yet. Right. But so what the New Testament is saying, what St. Paul is saying, what the Gospels are saying is, now we've met him."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2472.09,"end":2488.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And he became flesh and dwelt among us. Yeah. All right. Well, with all of that, while you ponder that a little bit, we're going to take our first break and we'll be right back."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2489.28,"end":2505.52,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2510.74,"end":2603.1,"speaker":"Announcer","text":"Ancient Faith Radio is brought to you by our listeners with help from faithtree Resources. Have you ever felt distracted or disengaged in church but weren't quite sure what to do about it? Divine Liturgy the greatest invitation is the newest video course brought to you from faithtree Resources and will help you better understand and experience the peace God offers to us in the Divine Liturgy. This four part series, taught by some of the church's most respected leaders, will equip you with resources and tools to help you more deeply encounter the one true God. Whether you're a parent hungry to teach your children, a pastor looking to equip your faithful, or someone who wants to learn how to actively be present in the Divine Liturgy, this course is for you. Go to Ancient Faith Radio is brought to you by our listeners with help from Faith Tree Resources. Have you ever felt distracted or disengaged in church but worked quite sure what to do about it? Divine the Greatest invitation is the newest video course brought to you from Faith Tree Resources and will help you better understand and experience the peace God offers to us in the Divine Liturgy. This four part series, taught by some of the church's most respected leaders, will equip you with resources and tools to help you more deeply encounter the one true God. Whether you're a parent hungry to teach or a pastor looking to equip your faithful, or someone who wants to learn how to actively be present in the Divine Liturgy, this course is for you. Go to faithtree.org to get your copy today. That's faithtree.org."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2606.94,"end":2623.08,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2624.12,"end":2624.88,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2624.88,"end":2626.2,"speaker":"Fr Stephen De Young","text":"Deja vu all over again."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2626.44,"end":2633.96,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know what happened. Those Faith Tree people must have paid like 75% extra for that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2634.6,"end":2641.88,"speaker":"Fr Stephen De Young","text":"Remember, there's, we got a kid engineering the show. He's got small fingers, small hands. He's doing his best. Wow."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2642.12,"end":2643.48,"speaker":"Fr Andrew Stephen Damick","text":"Really throwing him under the bus."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2643.48,"end":2644.12,"speaker":"Fr Stephen De Young","text":"It's great."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2645.4,"end":2678,"speaker":"Fr Andrew Stephen Damick","text":"He's never going to want to do this again. Like, like, no, forget those people. Welcome back, everybody. Yeah. So feel free to give us a ring. 855-AF-RADIO. 855-237-2346. Just like the voice of Steve just said. Although, I don't know, should we call him the voice of Steve anymore? I think he feels a little bad. Like people meet him and like, are you the voice of Steve? I mean, I'm sure, pretty sure he'd rather they say, aren't you the be the bee guy? Which is what he got before. Right. So I don't know."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2678,"end":2679.64,"speaker":"Fr Stephen De Young","text":"He knew the job was dangerous when he took it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2679.88,"end":2680.68,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2682.28,"end":2682.76,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2683,"end":2685.08,"speaker":"Fr Andrew Stephen Damick","text":"My boss was just saying that to me the other day."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2685.32,"end":2686.92,"speaker":"Fr Stephen De Young","text":"In for a penny, in for a pound."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2687.24,"end":2694.12,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Because apparently there was some show called Super Chicken, which was like a sub show. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2694.12,"end":2694.48,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2694.48,"end":2702.1,"speaker":"Fr Andrew Stephen Damick","text":"And apparently the line you knew this job was dangerous when you took it is in that, that show, Super Chicken."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2702.18,"end":2702.74,"speaker":"Fr Stephen De Young","text":"Yep."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2704.02,"end":2714.74,"speaker":"Fr Andrew Stephen Damick","text":"That was a reference I didn't know until Melinda mentioned it to me, which she was so happy that she knew a pop culture reference that I did not. So I was like, well, you know, welcome to my world."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2715.14,"end":2719.78,"speaker":"Fr Stephen De Young","text":"Yeah. She was happy. She knew a pop culture reference that you didn't."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2720.02,"end":2732.49,"speaker":"Fr Andrew Stephen Damick","text":"Correct. Exactly. Exactly. She grew up, not that we're here to talk about her, but she grew up in a Sweden Borgian enclave or whatever."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2732.49,"end":2738.73,"speaker":"Fr Stephen De Young","text":"Yeah. Okay. But that's like they weren't, hey, I'm the world's tallest Short person. I mean."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2738.81,"end":2740.65,"speaker":"Fr Andrew Stephen Damick","text":"I mean, they weren't watching Hanna Barbera."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2740.97,"end":2747.29,"speaker":"Fr Stephen De Young","text":"If she knew one. I didn't know that would be something to brag about. But of course, I have heard of Super Chicken."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2747.45,"end":2748.5,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2748.5,"end":2750.58,"speaker":"Fr Stephen De Young","text":"And even mimicked his battle cry moments ago."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2750.9,"end":2756.02,"speaker":"Fr Andrew Stephen Damick","text":"Indeed, indeed. So, yes. All right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2756.74,"end":2762.7,"speaker":"Fr Stephen De Young","text":"A super Chicken. Yeah. Not in flavor. I don't know. I don't know if he."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2762.7,"end":2773.62,"speaker":"Fr Andrew Stephen Damick","text":"Danger Mount. Yeah, I remember. Danger Mouse. Yeah. So, oddly enough, we actually do have some calls coming in. All right, so, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2773.62,"end":2775.22,"speaker":"Fr Stephen De Young","text":"Are they coming from inside the house?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2776.98,"end":2792.98,"speaker":"Fr Andrew Stephen Damick","text":"I don't see anyone in my studio. No. This one, I think, is coming from Tennessee. So we've got Will, who's calling, and he has a question about Sophia and Logos, which. Yeah, yeah. So, Will, welcome to the Lord of Spears podcast."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2794.18,"end":2795.78,"speaker":"Will","text":"Thank you. Fathers, can you hear me?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2796.1,"end":2796.98,"speaker":"Fr Andrew Stephen Damick","text":"We hear you."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2798.66,"end":2819.53,"speaker":"Will","text":"Fantastic. So question, I suppose, first off, just to clarify for myself, is when we're talking about Sophia as portrayed in Proverbs and Wisdom of Sirach, and we're talking about the Logos. Are we. Do those have the same reference? Those are both Christ."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2821.45,"end":2822.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2822.09,"end":2825.05,"speaker":"Fr Stephen De Young","text":"In those, I'd have to look at what passage in Sirach you're talking."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2825.05,"end":2825.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2825.73,"end":2828.05,"speaker":"Fr Stephen De Young","text":"Proverbs. And. Yes, yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2828.05,"end":2843.63,"speaker":"Fr Andrew Stephen Damick","text":"Because sometimes, if I'm not. If I'm not mistaken, sometimes doesn't. Or maybe some of the fathers, I'm not sure, refer to Wisdom and identify that as being the Holy Spirit, but in this case, it is the divine Logos. It is Christ, the Son of God. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2843.63,"end":2848.47,"speaker":"Fr Stephen De Young","text":"Right. And we have plenty of hymns that talk about Christ as the wisdom and word and power of God."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2848.71,"end":2850.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes. From the Paschal Canon, for instance."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2852.07,"end":2900.63,"speaker":"Will","text":"All right, so following up on that, in that passage in Proverbs, when it's referring to Sophia, it is using feminine terminology there. Feminine her. I believe it starts out within a verse, one or two. But when the Logos, it's using masculine terminology. And my question is, one, is this important or is this just like some grammar thing of different languages have different grammars? And so those are just. Grammatically, one is feminine and one is masculine. But if it is important, then what's going on there? Why is. When we're thinking about it as Sophia, is it portrayed in the Scripture as feminine? Whereas when it talks about Logos, it's referred to in masculine terms."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2901.51,"end":2915.51,"speaker":"Fr Andrew Stephen Damick","text":"It's really just grammatical gender. Like, it has. Like. Like, why is a table female or feminine in French? It's nothing particularly feminine about tables. It's just the grammatical gender, really."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2918.95,"end":2919.31,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2919.31,"end":2920.39,"speaker":"Fr Andrew Stephen Damick","text":"Did we lose you there?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2921.5,"end":2922.94,"speaker":"Will","text":"No, no, I'm. I'M still here."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2923.34,"end":2923.82,"speaker":"Fr Stephen De Young","text":"Ok."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2926.14,"end":2927.9,"speaker":"Fr Andrew Stephen Damick","text":"Like really, really? Are you sure?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2928.38,"end":2971.88,"speaker":"Fr Stephen De Young","text":"Yeah. And part of the, part of, part of the issue here is that in Anglophone America in particular, this has become this huge, bizarre political thing. Not recently, I mean, over the last 70 years. I mean the whole pronouns thing is relatively recent, but this sort of hyper focus on gender and its relation to sex. I mean the bigger question in this Proverbs passage is how come the verb yelad that means to give birth to keeps getting used to refer to God the Father?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2973.72,"end":2974.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2975.13,"end":2981.21,"speaker":"Fr Stephen De Young","text":"Fathers don't give birth to children. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2981.21,"end":2983.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2983.81,"end":2986.33,"speaker":"Fr Stephen De Young","text":"So that's not the normal use of the language. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2986.41,"end":2987.77,"speaker":"Fr Andrew Stephen Damick","text":"You can't absolutize."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":2989.13,"end":3005.69,"speaker":"Fr Stephen De Young","text":"Right. So this passage is very clearly sort of comfortable using these terms that normally be feminine. Right. And you can't avoid that with the way we talk about the Holy Trinity."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3006.89,"end":3007.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3007.17,"end":3043.08,"speaker":"Fr Stephen De Young","text":"We say begotten of the Father, Christ does not have a mother in terms of his divinity. He has a mother in terms of his humanity. Right. We have that hymn in Vespers that says he's without mother on the side of his Father and without father on the side of his mother. Right. So yeah, this, the, the, the scriptures are fairly comfortable with that. There's not, it's not making any kind of political or gender or feminist statement."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3043.56,"end":3043.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3043.88,"end":3065.81,"speaker":"Fr Stephen De Young","text":"When it uses this kind of feminine language about God or language that's typically used for, about women for God. It just does. That's sort of a hang up. We have as modern people one way or another specific, almost entirely specific to the United States."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3066.13,"end":3071.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It looks like we actually lost Will, but hopefully he."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3071.81,"end":3072.61,"speaker":"Will","text":"Can you hear me?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3072.85,"end":3074.77,"speaker":"Fr Andrew Stephen Damick","text":"Oh yeah, we got you back okay."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3074.93,"end":3077.49,"speaker":"Will","text":"Yeah, I was lost but now I am found."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3080.08,"end":3081.76,"speaker":"Fr Andrew Stephen Damick","text":"Hopefully you're blind and now you see."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3083.28,"end":3106.24,"speaker":"Will","text":"Well, I see better after listening to these podcasts. So I am one of those people who made the Peterson Pageot Lord of Spirits pipeline. And I know one thing that the pageos talk quite a bit about is about masculine feminine, that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3108.78,"end":3113.42,"speaker":"Fr Andrew Stephen Damick","text":"Oh, we lost you again, Will."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3115.5,"end":3116.86,"speaker":"Fr Stephen De Young","text":"What was that clicking sound?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3116.94,"end":3118.94,"speaker":"Fr Andrew Stephen Damick","text":"I know that's. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3119.1,"end":3119.9,"speaker":"Will","text":"Oh dear."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3121.1,"end":3121.98,"speaker":"Fr Andrew Stephen Damick","text":"Are you back now?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3121.98,"end":3149.15,"speaker":"Will","text":"Sorry. Yeah, I will try to make this quick because I, I don't know what is happening but they talk about how the pages talk a lot about reduce masculine feminine down very narrowly to just talking about sex and particularly focusing on human sex. But that's a much broader concept and that's more of a relational concept and I was wondering if those are talking about different perspectives of relationships or something like that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3150.83,"end":3184.8,"speaker":"Fr Stephen De Young","text":"Right, right. It's talking about, it's about the relationship between God and his wisdom, we would say between the father and the son. Right. And even though it's a little bit of a weird use of the term in that that would usually be used to refer to a mother and a son. Right. That verb. Right. It correctly describes the relationship because it's trying to differentiate that relationship from something that's created or made. Right. That's external."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3186.81,"end":3187.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3187.37,"end":3195.05,"speaker":"Fr Stephen De Young","text":"Right. Whereas giving birth, that's an internal. Right. Function."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3197.37,"end":3197.93,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3198.01,"end":3201.37,"speaker":"Will","text":"Well, thank you. And I'm going to take my leap before I'm kicked off again."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3204.73,"end":3213.97,"speaker":"Fr Stephen De Young","text":"Like, man, I've been playing Alan Wake too, and that clicker's freaking me out. I'm in the only room in the church with a light on too."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3213.97,"end":3218.69,"speaker":"Fr Andrew Stephen Damick","text":"This is. Man, there's a squirrel calling from somewhere inside the church."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3219.81,"end":3227.09,"speaker":"Fr Stephen De Young","text":"Do recommend the Alan Wake game. Anyway, they have paid no promotional anymore, but if they'd like to, I'm here."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3227.73,"end":3241.25,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Indeed. All right, well. All right, well why don't we go ahead and roll on and. Yeah, so it's hard to summarize what we talked about in the last, the last half, but."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3243.39,"end":3247.75,"speaker":"Fr Stephen De Young","text":"Hopefully you were listening. Just tuning in now. Sorry, this is gonna be a rough one."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3247.75,"end":3254.75,"speaker":"Fr Andrew Stephen Damick","text":"True. It's true. But we, we talked a lot about Proverbs 8:22 through 31, which is what we're just discussing with Will."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3255.07,"end":3255.55,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3255.95,"end":3268.31,"speaker":"Fr Andrew Stephen Damick","text":"And how, how Christ is the wisdom, who is the basis of the order of the world. I think that's probably the best way to summarize what we just said. There's so much more, but."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3268.31,"end":3324.8,"speaker":"Fr Stephen De Young","text":"Yes, yes. Yeah, right. So, yeah, we were talking about, I mean, basically in a nutshell, and I do not know what kind of nut has a shell such as this, but in a nutshell we're talking about what order is when we say that God created the universe by putting it in order, what is that order we're talking about? And ultimately, that order, that pattern, that logos, that wisdom is Christ as a person of Christ. That's my nutshell summary, what we said. And so now we're going to turn here, the second half to looking at how that order in creation functions. So this half we're going to be talking about the meaning of life briefly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3325.52,"end":3328.64,"speaker":"Fr Andrew Stephen Damick","text":"Which as Everybody knows is 42."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3329.04,"end":3580.46,"speaker":"Fr Stephen De Young","text":"Yes. And as I said to you earlier, the thing that disappoints me about that reference is that the part that's really funny to me is what comes after that in context, which is that, right, they create this planet sized computer that they have churning to determine the meaning of life, the universe and everything over, like, century. I think it's millennia. And it finally spits out the answer. The answer is 42, right? And the immediate response is that all of the universe's philosophers, theologians, scholars and thinkers all begin to now study what is the question, the answer to, which is 42, that explains the meaning of life, the universe and everything, right? So, like, it solved nothing. Getting the answer, right? Because sometimes it's the journey and not the destination. People and the friends we made along the way. So long and thanks for all the fish. So, yeah, so meaning in life. Meaning. Meaning. See, it's hard to talk about meaning without using the word meaning. Like, what does meaning mean? You know? But so what does it mean to even ask the question about the meaning of life, an individual life, life in general, the meaning of the world, right? What does it mean to try to uncover the order and the pattern of the world, right? And you can just give the right answer based on the first half and say, it's. It's Jesus, right? But now you have to do what all those philosophers and theologians and scholars had to do. Now you have to come up with the right question to understand the answer, right? So we're moving on to what's the question? What's the right question? All right, so we've talked before. Now we're going back to another episode. Pick up some more threads from. I think the episode about the noose is where we talked about this, about the order that is out in the world, in the world around us, in the nature of things, that there is a system or a web of relationship, relationships between people and things in the world, right? And it is within that system and web of relationships that any given person or thing finds its identity, what it is, right? This is an important concept, right? Because the way most of us have been taught to think about. And there's a heavy amount of Aristotle in this, right? Is that what a thing is? Right? The identity of a person or a thing, an object, anything is based on some kind of internal patterning of the object, right? So it's something that's internal to the. To the object or internal to the person who a particular person is. Their identity is something internal to them is sort of what we've been taught. And this is the opposite of the case, right? So if we imagine an island in the middle of the Pacific where no humans have ever been, and we imagine that there is a naturally occurring shard of metal laying somewhere on it that is shaped like a hammer. Shaped like a hammer. That object is not a hammer."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3582.62,"end":3583.02,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3583.42,"end":3588.3,"speaker":"Fr Stephen De Young","text":"But it's not even an object shaped like a hammer until someone sees it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3588.75,"end":3606.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is. On some level, this is the. If a tree falls in the forest and no one is around to hear it, does it make a sound? Phenomenologically, the answer to that, of course, is no, because sound has to be heard to be a sound."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3606.91,"end":3643.89,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. It will create vibrations in the air, but that's not a sound. Yeah, but so that object is just an object. Right. Until it enters into some system of relationships with something else. Right. So if a crab has to crawl over it. Right. It is still not a hammer. Now it's an obstacle. Right. Because the crab has to go around it or go over, climb over it or whatever."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3645.33,"end":3645.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3645.65,"end":3655.17,"speaker":"Fr Stephen De Young","text":"And when the crab is gone, it ceases to be anything, really. Right. It is just an object. And. Yes. It doesn't cease to exist."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3656.13,"end":3656.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3656.61,"end":3688.34,"speaker":"Fr Stephen De Young","text":"In the modern sense of existence. Right. Continues to have all of the mathematical. Right. You could go. But again, this would require you to go see it. But hypothetically, if you went and saw it, you could take the measurements, you could do all those things, and even when you weren't looking at it, it would maintain those measurements and everything. Right. But it wouldn't be anything in particular. And any given object can actually be a variety of different things."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3689.7,"end":3695.9,"speaker":"Fr Andrew Stephen Damick","text":"Sure. I mean, you know, how many people here haven't used a screwdriver as a hammer at some point?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3696.54,"end":3697.66,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3697.74,"end":3699.18,"speaker":"Fr Andrew Stephen Damick","text":"Which. Please don't do that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3699.66,"end":3739.01,"speaker":"Fr Stephen De Young","text":"Or if I walk out, you know, in my front lawn and I find a hammer. Right. I could say, I'm going to use this for a hammer. Right. I can say, I'm going to use this to crack walnuts. It's going to be my nutcracker. I could say, I'm going to use this as a weapon to go knock around my neighbor who's been bothering me. Right. And so whether this is a food utensil, a household tool for driving nails, or a weapon depends entirely on me as a human. Right. As a human observer and interactor and how I choose to relate to this object."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3742.45,"end":3742.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3743.17,"end":3752.91,"speaker":"Fr Stephen De Young","text":"I could even fail to recognize that it's a hammer. I can just say, oh, there's some piece of metal trash here in my yard and interact with it as that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3753.55,"end":3759.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Especially if you've never seen one before, maybe, you know, so you have no."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3759.07,"end":3762.75,"speaker":"Fr Stephen De Young","text":"Intentions for that shape or if it's rusted and corroded. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3762.91,"end":3765.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or in pieces or whatever, you know. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3765.95,"end":3773.55,"speaker":"Fr Stephen De Young","text":"Right. And so it has its identity within this system of relationships, abstracted from all those relationships, it isn't anything."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3775.79,"end":3797.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah. Which I know is hard for people to understand, but, like, consider again, the problem of the set of molecules that you're carrying around right now. Those all belonged to something else. They were put in relationship to something else and were something else, you know, so this works on the macro level too, not just the sort of the molecular or atomic level."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3798.27,"end":3902.27,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Yeah. And, you know, this is observable with familiar objects, right? So if I have an object that used to belong to my father, who has now departed this life, right? Even if it's a random object like a stapler, right. That stapler is something different to me because balled up with it are memories of my father that may have nothing to do with stapling things, right? But because it was his stapler, there are all these things that, when you see that stapler, simply do not exist for you. That probably don't exist for anyone but me and maybe my siblings and my mother, right? If they even recognized it as my dad's stapler, which they might not, in which case it would be gone for them too, right? And then when you move to people, right, People could look at my wife and see that she's a woman, right? But I look at her and I see my wife. That is different. She is someone different to me than she is to other people, right? So this is. This is just a reality in our every everyday lives, right? And when we try and take a materialist, scientific kind of view of the world, we're. We're just denying all of these things. We're trying to fake denial of all these things."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3904.67,"end":3905.03,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3905.03,"end":3963.61,"speaker":"Fr Stephen De Young","text":"But there's. They're still true to us, right? I don't care how much of a scientist you are, you value the lives of your close family members more than people you've never met and never will. Yeah, you may feel horribly guilty about that, but it's the truth, right? These are just truths, right? Of how we operate in the world. And we couldn't operate otherwise if we tried to interact with everyone and everything in the world based on its, like, mathematically computable measurements and that's it. With no associated memories, with no intent, with no relational subjective element. Like, you couldn't function in the world, right? You wouldn't be a human. At least you'd be a Roomba, right? Like."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3965.85,"end":3969.85,"speaker":"Fr Andrew Stephen Damick","text":"This may be the first Roomba reference on the podcast. It's amazing."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3970.17,"end":3986.73,"speaker":"Fr Stephen De Young","text":"My. My vacuum cleaner is named Rosie. She has googly eyes. She vacuums the floor. But even though I have personified her, she is not a person. She is operating based on mathematics and is not even really a she."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3987.93,"end":3988.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":3990.11,"end":4008.19,"speaker":"Fr Stephen De Young","text":"So that's just my sexism. She vacuums. So, so, and so any sense of meaning and purpose for anything or anyone requires an external observer."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4008.67,"end":4011.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There has to be a relationship in place."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4011.63,"end":4113.79,"speaker":"Fr Stephen De Young","text":"Right. There has to be an external observer looking at the thing. Right. And relating to it in some way. And there is no view from nowhere. As we've talked about the second most common quotation from Thomas Nagel that's on this show. Right? Yeah. And for there to be a human order, we talked about how the order of creation is a human order. Right. That requires a human observer. Because the first most common quote, we don't know what it's like to be a bat. We know that a bat perceives the things in the world according to its own relational qualities. But we don't know what that is because we're not a bat. Right? But we know what it is to be human. And so we observe things, we give things purpose. We utilize them according to the human mode of understanding and consciousness. We put things into that human order. But when we're talking about putting things in order. Right. So we talked about in the first half that the way human beings participate in this is by continuing the work of God. Participating in the work of God in the world. To put things in order and fill them with life. Right. On this level of order, there are two inseparable elements of it. One of them is a passive recognition of the order that already exists in the world."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4116.27,"end":4116.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4117.71,"end":4125.36,"speaker":"Fr Stephen De Young","text":"We don't come to the world as this sort of clean slate that we get to then connect all the dots however we want."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4125.6,"end":4129.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You're born into a world that exists."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4129.76,"end":4165.61,"speaker":"Fr Stephen De Young","text":"That is already ordered to some extent, rightly or wrongly. There's already a system of relationships in place between people and things. And so we come to passively recognize that order. But the other inseparable element is our actively putting things in order. Our actively relationally interacting with and through the things in the world. Interacting with other people."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4166.41,"end":4166.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4167.45,"end":4199.08,"speaker":"Fr Stephen De Young","text":"Which serves to shift the order of things in one direction or another. To establish order where it's breaking down, to shore it up. Right. And these two things always go together. So what does this mean in terms of the meaning of life? And there I use the verb, or I use the word mean. Right. What does this mean again? But so on one hand, there are people who approach questions of meaning and purpose."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4200.33,"end":4200.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4201.05,"end":4208.09,"speaker":"Fr Stephen De Young","text":"And the meaning of Life from the perspective purely of that kind of passive discovery."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4208.89,"end":4211.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Meaning is out there. We have to find it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4212.09,"end":4212.41,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4212.41,"end":4221.53,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is the same idea behind when people say things like words mean things, that this is what they mean by that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4223.05,"end":4224.65,"speaker":"Fr Stephen De Young","text":"I'm going to go find myself."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4225.53,"end":4226.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4226.73,"end":4227.77,"speaker":"Fr Stephen De Young","text":"Discover who I am."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4228.24,"end":4233.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like the sense of like it's. Like it's an archaeological activity."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4234.16,"end":4237.04,"speaker":"Fr Stephen De Young","text":"Yes. You know, the truth is out there. I will go find it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4237.12,"end":4237.84,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4238.64,"end":4316.31,"speaker":"Fr Stephen De Young","text":"But in a way where we're totally passive. Right. There is some meaning of life. I'm going to learn what it is passively. God or someone wise or something is going to tell me. He's going to inform me. Some experience I have is going to cause me to see what it all means. Right. And so that is wrong. Right. Because that is taking purely that passive approach. The other pole is to take only the active approach. Right. Where meaning formation and purpose formation is the triumph of the will. This is Nietzsche, frankly. Right. I am going to go out and I am going to order the world after my own will. And if I can't order the world, I'll at least order my world. Right. I will force it to become what I desire it to be. Right. It is just all moldable, all malleable. I can actively shape it into whatever I want. Right. And people have varying degrees of success with that. Right. Some people, like Napoleon, have pretty good runs and then the run ends. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4317.75,"end":4318.15,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4319.99,"end":4326.95,"speaker":"Fr Stephen De Young","text":"You keep getting confronted by the non malleable parts. Right. So that is also an error."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4328.07,"end":4328.43,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4328.43,"end":4400.14,"speaker":"Fr Stephen De Young","text":"That is also an error. So the reality is in between the active and the passive taking place at the same time. Right. Where as we actively live and make choices and give order to our lives and to the world around us, we also discover the order that is already there and discover how we fit. These two things happen at once. So this doesn't mean. Right. This doesn't mean we can also take those two poles and talk about variety and lack thereof. Right. So views which say the order, the meaning, whatever is. Is out there's completely out there and we just have to find it. That tends to mean that the order and the meaning that are out there are very general. Right. People who think of that way talk about the meaning of life, not the meaning of my life."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4401.98,"end":4402.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4403.34,"end":4415.87,"speaker":"Fr Stephen De Young","text":"Right. So the idea is that this meaning, this order is kind of general. Right. It's for everybody, Right. There's just this one order, right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4415.87,"end":4418.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's. Every rose has its thorn."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4418.31,"end":4418.71,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4418.71,"end":4420.55,"speaker":"Fr Andrew Stephen Damick","text":"Every night has its dawn. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4420.79,"end":4433.19,"speaker":"Fr Stephen De Young","text":"Every cowboy sings a sad Song So. So then the other side, Right. The sort of I'm going to shape the world to my will is very individualistic."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4435.36,"end":4435.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4435.56,"end":4440.96,"speaker":"Fr Stephen De Young","text":"I'm going to assert my meaning in the world, but that's my meaning, not yours."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4441.84,"end":4442.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4442.4,"end":4500.87,"speaker":"Fr Stephen De Young","text":"It's over against yours, if you even have one. Right. If you even have the kind of will that I have. Right. And so then there's this sort of infinite variety of orders to which the world could be subjected by your will. Right, right. Which is kind of trying to make you an unfettered creator God, which. Good luck with that. Right. And so again, neither of these polls is accurate. Right. So what we have when you have both the active and the passive working together, is you don't have a variety of orders, but you have a variety of instances of a pattern of the same pattern. And I think a good visual example of this, drawing it back to what we were talking about in the first half, is in orthodox iconography of the saints."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4502.39,"end":4509.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Because they look different, but they kind of all look the same as well."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4510.23,"end":4588.22,"speaker":"Fr Stephen De Young","text":"Right, right. There's this level where they all look the same, and that's deliberate. That's not bad art. That's not stylistic. Right. They look the same because these are all humans who have been formed into the image of Christ. They've been formed into the same image, the Logos, Christ. Right. And so they all kind of look the same, but at the same time they're all different people who have been so formed, and so they all look a little different. And so the saints show us myriad ways of being Christlike in different places, times, situations for men, for women, for children, for elderly, people, for people in between, all the way across the gamut. Right. And the. The to fulfill our purpose. Right. If our purpose is to humanize the world, if our purpose is to turn the world into a garden, if our purpose is to put everything else in order first, humanization of the world requires the humanization of humans."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4590.7,"end":4641.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that we're going to get into application a lot in the third half, but just as a piece of application here. Everybody wants to change the world, as it says, but no one thinks of changing himself. There's an order in which this has to happen. We can't effectively make the world in the way that God desires us to. And if we're not already on the path to holiness ourselves, it just doesn't. Doesn't work. So one can have a lot of opinions and do a lot of things, but unless one is actually engaged in this humanization for Oneself, it's going to end up being distorted because you're going to shape it according to how you are. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4642.21,"end":4647.73,"speaker":"Fr Stephen De Young","text":"Although I heard the saying is, everybody wants to change the world, but nobody wants to change the toilet paper roll."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4650.45,"end":4651.57,"speaker":"Fr Andrew Stephen Damick","text":"Also true."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4651.97,"end":4656.21,"speaker":"Fr Stephen De Young","text":"Yeah. And if they do, they hang it up backwards and then you're like, what?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4659.41,"end":4659.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4661.41,"end":4736.42,"speaker":"Fr Stephen De Young","text":"Right. So this means for there to be any kind of broader meaning to the universe. Right. There first has to be a meaning to your human life. Right. And that isn't something that's just discovered. That's something that's discovered and constructed at the same time. Right. But this isn't an individual human life for the reasons we've just described. Right. That abstracted from relationships, no one and nothing is anything. So if you are completely alienated and isolated and alone, as our culture is desperately trying to do to you, you're going to have all kinds of issues about your identity because you're not in active relationships with other humans, which is what that identity is based on. Right. And so for meaning to happen, it has to happen in terms of not just human life, but communal human life."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4736.9,"end":4748.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're meant to be together. I mean, you come into this world with a communal relationship, namely your mother. Inescapable."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4750.16,"end":4773.92,"speaker":"Fr Stephen De Young","text":"Right. And that communal life is active, it's dynamic, it's participatory. Right. And on our own, we're nothing. This is why the church was established. Whether we're talking about the assembly of Israel in the Torah that we're going to talk about the third half, or we're talking about the church as we know it today."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4775.53,"end":4830.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And even, I mean, even the ancient concept of what a person is like, it's reflected in both Greek and Latin. The word in Greek for person generally is prosopon, and then Latin, it's Persona. And both of these refer to the face. So if you think about this for a second, your face is not really available to you. It's only available to the people around you who see your face. You know, And I mean, now we have mirrors, and so we have this idea of seeing our own faces. But mirrors that did exist in the ancient world weren't super common and they weren't that great. So most people never really saw what they truly looked like, only other people. And so even the ancient idea of a person is about relationship with other people."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4832.33,"end":4853.13,"speaker":"Fr Stephen De Young","text":"Right, Right. And this can't be emphasized enough. Right. That just like in the Old Testament, in the New Testament, a community is formed. Christ doesn't ascend into heaven and leave a book for people to go and read and find all the answers."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4854.57,"end":4854.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4855.72,"end":4927.58,"speaker":"Fr Stephen De Young","text":"About life and its meaning and whatever else. He creates a community. Right. A community in which scriptures are read, in which there's a way of life that is practiced. Right. In which there are rituals that bring the community together and bind them together. And bind them together to God. That's what Christ leaves. That's what he sends his apostles to do. Right. That's how this meaning is formed. And so again and again we have to point out, because our culture is so aimed at alienating and isolating everyone and leaving them alone. Right. Because then you're easily manipulable. You could be told who you are. You could be taught to express who you're supposed to be now by what you consume. Right. Et cetera, et cetera. We've talked about this before, right. In the face of that, the answer to that. This sounds overly simple, but it's. Go to church."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4928.78,"end":4930.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4930.46,"end":4932.62,"speaker":"Fr Stephen De Young","text":"I think it's really that simple."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":4933.62,"end":5023.84,"speaker":"Fr Andrew Stephen Damick","text":"One of the big problems of our. I think one of the reasons why we're so fragile and. And by this, I'm not just saying, you know, you guys are a bunch of snowflakes, although kind of no. Is because we have so few or so shallow relationships. Right. Anti fragility is. Is about a dynamism of. Of a complex web of relationships. Right. Like, if there's only one person whose opinion you care about, if that opinion shifts in a way that's negative, it's going to be devastating for you. But if you. If you are within a web of relationships of people who love you and value and interact with you and admire you and respect you and treat you as a human, and then one of them kind of goes off the deep end, you can handle that much better because of that whole web of relationships that you're in. You know, you have resilience because of that. And I think that one of the things that the. This sort of late capitalism age that we're in has done, as you said, Father, you know, is isolating everybody. And so it's increasing fragility because we have fewer relationships and our relationships are not as deep. So it really is a problem. And I think it's creating these crises of meaning and understanding. Meaning, which of course is what this whole episode is about."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5024.32,"end":5042.97,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And there are Internet communities out there, for example, that are really trying to keep this plate spinning and are really trying to keep isolated and alienated people out there from completely losing their minds. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5043.21,"end":5043.61,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5043.61,"end":5065.42,"speaker":"Fr Stephen De Young","text":"And going off the deep end and Going into self harm. And it's good that they're doing that. But those aren't a substitute for real community. Those are trying to do triage. Those communities are trying to do, you know, intensive care for people who really need in person, community and relationships."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5065.42,"end":5085.86,"speaker":"Fr Andrew Stephen Damick","text":"It's like, it's like, you know, if someone's, if someone's suicidal and they happen to, you know, thank God, call a suicide hotline and there's a voice on the other end talking to them that, you know, God willing, helps them not to do that thing. That's good. But it's nothing like if there's someone there with them, you know."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5086.1,"end":5086.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5086.82,"end":5088.22,"speaker":"Fr Andrew Stephen Damick","text":"The only reason why that support system."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5088.22,"end":5090.7,"speaker":"Fr Stephen De Young","text":"Where they don't need to call a stranger."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5090.78,"end":5094.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. When they reach that point exist is because of the isolation."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5095.34,"end":5099.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So better to have someone. And you can."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5099.98,"end":5100.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5100.94,"end":5169.82,"speaker":"Fr Stephen De Young","text":"You, you can. The church is maybe the last place. The union halls are gone. All this other stuff is gone that used to provide community. The neighborhood pub. Right. All that's been stripped away. Right. But the church can still be that. So what does this all mean? This means that as I said at the beginning of this half, right, trying to formulate the question, right, to which Christ and the meaning he embodies is the answer is that the way we formulate the question is by actively living, by actively giving meaning to our life and discovering the meaning that is already there. Discovering the order that's already in the world, discovering who other people are and how they relate to us. Discovering the things in the world and how they relate to us and being discovered by them. And then through that, making a life."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5172.63,"end":5172.87,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5172.95,"end":5201.27,"speaker":"Fr Stephen De Young","text":"Crafting a life. I'll say something nice about Jean Paul Sartre, right? Jean Paul Sartre once said that by making choices you can make your life a melody which is a little Frou Frou. But what he's saying there is that you could live your life in a way that's intentional."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5203.03,"end":5203.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5203.99,"end":5207.03,"speaker":"Fr Stephen De Young","text":"That gives it meaning, that gives it beauty, that gives it purpose."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5208.07,"end":5208.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5208.43,"end":5226.87,"speaker":"Fr Stephen De Young","text":"But that inquires not just a passive approach, but an active. Right, an active approach. An approach in which we struggle to embody the order that is in the world. That we struggle to embody who Christ is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5227.34,"end":5227.5,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5227.5,"end":5273.76,"speaker":"Fr Stephen De Young","text":"This is what justification being put in order ourselves. This is what justification is about. This is what repentance is about. Getting ourselves right first. And so meaning is discerned and created at the same time. Right? And ultimately the end of the day, as we pursue this path, the meaning we find is embodied in us because we become a human person. And in becoming a human person, because Christ is the human person. Right. We also become like Christ. We also are united to God in Christ. Right. We also find salvation."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5275.84,"end":5296.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, I know these first two halves have been pretty heady stuff, but it's going to become much more applicable in the third half. So you've come this far. We're glad you're here with us. We're going to go ahead and take our second and final break and we'll be back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5296.51,"end":5312.84,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-223-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5318.44,"end":5323.24,"speaker":"Fr Stephen De Young","text":"What are we to make of the unseen world and spiritual warfare?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5324.12,"end":5331.6,"speaker":"Announcer","text":"The Lord of Spirits book version is now available@store.ancientfaith.com written by Fr."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5331.6,"end":5332.68,"speaker":"Fr Stephen De Young","text":"Andrew Stephens."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5334.51,"end":5365.7,"speaker":"Fr Andrew Stephen Damick","text":"To the modern mind, dragons and demons are just the inner demons of psychology. And angels are often reducible to the better angels of our nature, that is, to our better human impulses and virtues. Talk of spirits is really about psychology, but to the ancient mind of millennia ago, even up to the premodern mind of just sentiment centuries ago, these are real beings with personal presence who inhabit our world and affect us."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5366.42,"end":5372.54,"speaker":"Announcer","text":"Father Andrew provides a distillation and explanation of the material in the popular podcast."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5372.54,"end":5379.58,"speaker":"Fr Stephen De Young","text":"The Lord of Spirits, which he co hosts with Father Stephen DeYoung. Get this brand new book today at."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5379.58,"end":5384.92,"speaker":"Announcer","text":"Store.Ancientfaith.Com that's store ancientface faith.com."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5385.08,"end":5401.16,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5402.12,"end":5404.84,"speaker":"Fr Andrew Stephen Damick","text":"I didn't even know that that commercial existed."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5405.48,"end":5408.76,"speaker":"Fr Stephen De Young","text":"You drug that poor man out of retirement just to introduce you?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5409.57,"end":5410.29,"speaker":"Fr Andrew Stephen Damick","text":"No, I didn't."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5410.29,"end":5417.81,"speaker":"Fr Stephen De Young","text":"Hasn't he suffered enough? Hasn't his reputation been drug enough without you associating it with yourself?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5421.97,"end":5423.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, yeah, you know, I."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5423.57,"end":5424.89,"speaker":"Fr Stephen De Young","text":"Wouldn'T have done the plug earlier if."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5424.89,"end":5428.13,"speaker":"Fr Andrew Stephen Damick","text":"I'd known I was going to, you know, we're going to hear an ad from John Maddox himself."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5428.61,"end":5430.73,"speaker":"Fr Stephen De Young","text":"Yeah, that, I mean, that does, you."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5430.73,"end":5454.65,"speaker":"Fr Andrew Stephen Damick","text":"Know, it's a little redundant, I don't know. But yes, with the clip from the audiobook, everybody, by the way. Oh, is that what it was? Yeah. Yeah. Right now you can only get the paperback, but the ebook and the audiobook should be available within weeks. We're not sure exactly when, but. But God willing, they'll be out there. But yeah, you can get the paperback right now. So does the."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5456.25,"end":5458.33,"speaker":"Fr Stephen De Young","text":"Does the audiobook come with a gag reel?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5460.97,"end":5462.01,"speaker":"Fr Andrew Stephen Damick","text":"Only from the forward."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5462.81,"end":5508.97,"speaker":"Fr Stephen De Young","text":"Okay, I see. I've wanted to do a gag reel. I've suggested it. I'm going to peel back the curtain. I'm going to peel back the curtain. Consider this a worker protest. Folks who have purchased my audiobooks, write to Father Andrew at Ancient Faith. Oh, man. And let him know that you believe in my freedom to do bits and make jokes during my audiobook readings. They have been stifling my creativity and making me just read the text of the book and not allowing me to do clever asides. So if you want my clever asides, write to Father Andrew and demand them."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5511.13,"end":5516.89,"speaker":"Fr Andrew Stephen Damick","text":"Make up an expanded, revised, bonus edition of the audiobook."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5518.22,"end":5525.94,"speaker":"Fr Stephen De Young","text":"Includes all the. I got more books coming. They could be at least 27% more entertaining if I."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5525.94,"end":5527.74,"speaker":"Fr Andrew Stephen Damick","text":"And we have an army of editors."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5527.74,"end":5531.26,"speaker":"Fr Stephen De Young","text":"My friend, to make sure that doesn't happen. That's my point."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5531.9,"end":5533.18,"speaker":"Fr Andrew Stephen Damick","text":"That's right, exactly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5533.58,"end":5537.26,"speaker":"Fr Stephen De Young","text":"People reach out. Express your. Express your will."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5538.62,"end":5541.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All the hate mail comes to me anyway, so."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5542.71,"end":5549.67,"speaker":"Fr Stephen De Young","text":"Yeah, well, this will. This is the suggestion category. Hashtag free Father Stephen."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5550.07,"end":5559.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, like free as in audible free speech or free as in free beer, because speech. Okay, okay."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5560.47,"end":5562.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5562.11,"end":5562.55,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5563.03,"end":5565.27,"speaker":"Fr Stephen De Young","text":"Well, if you have any of the other. I am Dutch."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5565.83,"end":5578.16,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yes. Yeah, yeah. So welcome to the third half. Now we're going to. Actually, now you'll be like, wait, I thought this episode must be supposed to be about biblical interpretation or something."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5580.32,"end":5582.96,"speaker":"Fr Stephen De Young","text":"When do we get to the topic before the end?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5583.36,"end":5585,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, rarely. One out of ten."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5585,"end":5593.68,"speaker":"Fr Stephen De Young","text":"You had to start before the foundation of the world to get here to how to read the Bible. That's just how these things work."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5594.22,"end":5595.82,"speaker":"Fr Andrew Stephen Damick","text":"It's true. It's true."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5596.38,"end":5648.58,"speaker":"Fr Stephen De Young","text":"Yeah. So. So now we need to talk about how this human mediation of meeting meaning into the world, right. Into God's created world, how that works functionally within the community we were talking about at the end of the last half. And so we're going to start with Moses. So we've now at least moved to Exodus from Genesis over the course of an hour and a half. And so Moses is the first leader of the Ecclesia, as the Greek of the Old Testament has it. Right. The assembly of Israel."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5648.58,"end":5648.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5648.78,"end":5678.73,"speaker":"Fr Stephen De Young","text":"He's the first leader. And so Moses is the image we get in the Torah, right from the beginning of how human leadership is going to function within the community of God's people. And one of the things you notice when you read closely through the Torah is that the words that God says to Moses and the words that Moses then says to the people are not identical."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5680.73,"end":5684.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can compare them. It's not simply Moses."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5684.69,"end":5686.65,"speaker":"Fr Stephen De Young","text":"They're right there. Usually one after the other."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5686.89,"end":5688.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5689.45,"end":5698.97,"speaker":"Fr Stephen De Young","text":"God comes and says something to Moses very often prefaced with say to the sons of Israel. Xyz."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5700.18,"end":5701.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5702.58,"end":5704.1,"speaker":"Fr Stephen De Young","text":"Usually relatively terse."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5704.74,"end":5705.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5706.1,"end":5718.98,"speaker":"Fr Stephen De Young","text":"And then Moses goes to the aforementioned sons of Israel and says, X, X1, X2, Y, Z1, Z2, Z3. Right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5718.98,"end":5723.54,"speaker":"Fr Andrew Stephen Damick","text":"Which on its face might seem like, wait, Moses, you're not obeying what God said to do."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5724.34,"end":5728.1,"speaker":"Fr Stephen De Young","text":"Right. You're adding to what God said. You're not supposed to add or take away. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5728.44,"end":5730.92,"speaker":"Fr Andrew Stephen Damick","text":"But the scriptures never treat him that way."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5731.96,"end":5736.28,"speaker":"Fr Stephen De Young","text":"No, no, quite the opposite. He's doing what he's supposed to be doing."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5737.32,"end":5745.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. When he does this, he's creatively engaging with what God said because this is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5745.04,"end":5746.56,"speaker":"Fr Stephen De Young","text":"What his change is as a prophet."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5746.56,"end":5748.68,"speaker":"Fr Andrew Stephen Damick","text":"He's not. Yeah, he's not changing it. He's."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5748.84,"end":5751.88,"speaker":"Fr Stephen De Young","text":"He's explaining, adding detail, fleshing out."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5752.36,"end":5753.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5753.32,"end":5755.93,"speaker":"Fr Stephen De Young","text":"Applying. Right. So a good example of this."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5757.77,"end":5758.17,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5758.65,"end":5807.12,"speaker":"Fr Stephen De Young","text":"When God commands to Moses and then tells Moses to speak to the Israelites concerning the dedication of the firstborn. Right. Meaning God says, all, every firstborn male that opens the womb is mine. This is after the death of the firstborn in Egypt. He says, therefore, firstborn of any animal you will take and you will sacrifice to me, firstborn human son, you will go and make this offering instead. Because he doesn't want human sacrifice. Right. That's what God says to Moses. Then when Moses gives this commandment to the Israelites, he fleshes it out with all of this detail. One of which detail is, don't sacrifice donkeys."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5811.11,"end":5814.59,"speaker":"Fr Andrew Stephen Damick","text":"Did God surely not say, thou shalt."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5814.59,"end":5816.15,"speaker":"Fr Stephen De Young","text":"Not sacrifice yon donkey?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5816.55,"end":5817.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5819.35,"end":5850.01,"speaker":"Fr Stephen De Young","text":"So this has. Right. This gives you a window into modernist biblical studies. In that biblical studies, people read that, and here's where they instantly go, right. Because this is the hermeneutic they've been taught. Aha. There must have been some kind of pagan donkey sacrifices going on in ancient Israel. And a later author is putting into the mouth of Moses that these donkey sacrifices must stop."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5850.89,"end":5852.53,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5852.53,"end":5863.05,"speaker":"Fr Stephen De Young","text":"If you don't believe me, go do a search of journal articles. You'll find them on donkey, pagan donkey sacrifices, some of them trying to connect it To Lilit, the donkey rider, right? You get all that?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5863.05,"end":5865.23,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, Right. Yeah, yeah, too."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5865.23,"end":5866.23,"speaker":"Fr Stephen De Young","text":"And so forth, right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5866.23,"end":5867.23,"speaker":"Fr Andrew Stephen Damick","text":"Hey, everybody."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5867.63,"end":5957.67,"speaker":"Fr Stephen De Young","text":"But again, as as usual, if you just read what it says, right? Let's at least try to take it at face value first, right? Let's see how that goes. Then we could do other things. It seems pretty clear, right, that Moses, as he's explaining this to the people, sees, well, wait a second, they're animals that we don't sacrifice because they're unclean, right? So we're going to need to weigh in with an opinion here, right? God said every firstborn animal you sacrifice to him, unclean animals were not supposed to sacrifice to him. So what do we do about firstborn male unclean animals, right? And so Moses gives a ruling. He says, no, your firstborn male donkey, you don't go sacrifice, that you offer this other sacrifice instead when your firstborn male donkey comes. This is very simple. We don't need to do any weird research, right? We don't need to hypothesize different dates of authorship. Just Moses has to make a rule, a very practical ruling, right? This is a question that would come up, hey, my donkey just gave birth, right? Like, do I sacrifice it?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5958.87,"end":5959.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5960.47,"end":5969.35,"speaker":"Fr Stephen De Young","text":"And Moses as the prophet, as the leader appointed by God is the one who has to make these calls. And God doesn't expect him to be."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5969.35,"end":5969.91,"speaker":"Fr Andrew Stephen Damick","text":"Like, oh."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":5972.16,"end":6267.34,"speaker":"Fr Stephen De Young","text":"You know, God didn't explicitly mention that. Let me go, let me pray on it. Let me go toss the Urim and Thummim, right? And get a ruling on the donkey sacrifices, right? The authority that God has invested him with is precisely the authority to make these calls, right? The authority to apply what God has said to the practical life of the people. So that's a micro scale example, if you want a macro scale example. And again, this has ridiculously confused and spawned so many journal articles and dissertations. It's amazing, right? In terms of biblical scholarship, the differences between Exodus and Leviticus on one hand and Deuteronomy on the other, and you could take any particular feast, any particular sacrifice or observance, right? These must be by different authors. These must have been written centuries apart. These da da da da da da. Okay, let's try again. Let's take it at face value. Let's see how that works out before we do anything else, right? So what's actually presented in the Torah is happening, right? What's presented in the Torah is happening is that Moses speaks to God face to face. God gives him the Torah. God gives him commandments And Moses comes in Exodus at Mount Sinai. Leviticus also takes place while they're at Mount Sinai, by the way, at Mount Sinai. And Moses then takes and applies, like we were just talking about, right, with the firstborn, and applies that to the life that those people are going to live. Because these people are living wandering as nomads in the Sinai Desert in a camp with the Tabernacle at the center, right? So if you're living in a camp in the desert with a Tabernacle in the center, right? Then the way you observe Passover, the way you observe any of the other feasts on the calendar that involve sacrifices, that's going to take one shape because you, you always have access to the Tabernacle. It's right there, right? And these are people who are going to end up living their, the whole rest of their lives living in this camp, living in the desert, moving nomadically. Right? Again, taking it at face value, what Deuteronomy says is happening is that Moses is giving the law, giving the Torah. Again, that's what Deuteronomy means. Second Law, Deveros, Nomos. He is speaking to the next generation. All those people he was talking to at Exodus and Leviticus are dead, except for Joshua and Caleb and himself. This next generation is about to go into the land and settle there, and they're going to settle all across it. They're going to settle all across Canaan. Some of them are going to settle in the Transjordan. He already knows at the time he's saying this within the text, right? And so when he gives instructions, say, for observing the Passover, if you're living in the Transjordan, if you're living in Dan, if you're living right, the Tabernacle is only going to be in one place and it's not going to be near you. So your relationship to the sacrifices of the Tabernacle is about to change. The way you celebrate the feast is going to have to change. You're going to go to supporting your family by farming instead of scooping up manna off the ground every morning. There's going to be a whole change in their way of life. And so the same commandments of God, the same patterns revealed to Moses by God, the same Logos that Moses sat and talked to face to face, is going to be applied to a generation of people settled, living an agrarian life in the land in ways that are different in various ways from how that same Logos applied to them when they were living nomadically in the desert in a camp with the Tabernacle at the center. Not radically different. Not black is white, white is black. Not. This was a sin before and now it's wonderful."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6267.5,"end":6273.98,"speaker":"Fr Andrew Stephen Damick","text":"It's going to be consistent. It's going to be. It's going to be consistent and not contradictory, but it's not going to be identical."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6274.7,"end":6338.87,"speaker":"Fr Stephen De Young","text":"Two different instances of the pattern. Two different instances of the same pattern applied to a different generation of people living a different way of life, but the same pattern being applied to it, taking a subtly different shape. Right. And Moses Job in Deuteronomy, because he's still alive right. Until the very end of Deuteronomy, is to continue to do that, to take it and apply it. And in chapter 31 of Deuteronomy, he gives that. Passes that authority on to Joshua. Right. Passes that authority on to Joshua. Joshua. But even within that, this is something of an aside, but we may do an episode on this at some point. This is the tease for the apostolic succession episode that might happen in the future. Even in the context of Joshua becoming Moses successor, there's the reiteration that there is no prophet like Moses."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6341.33,"end":6341.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6342.37,"end":6344.97,"speaker":"Fr Stephen De Young","text":"And that there is a difference there as well. Like apostles."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6344.97,"end":6345.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6345.57,"end":6346.45,"speaker":"Fr Stephen De Young","text":"But we'll get to that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6346.53,"end":6350.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Successors to the apostle aren't just new apostles. They're."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6350.37,"end":6350.77,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6351.01,"end":6351.65,"speaker":"Fr Andrew Stephen Damick","text":"Successes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6351.65,"end":6353.41,"speaker":"Fr Stephen De Young","text":"But that's a future episode."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6353.65,"end":6354.53,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6355.41,"end":6361.01,"speaker":"Fr Stephen De Young","text":"That's a. That's a bingo card box. We haven't checked in a while referencing a future episode, but there it is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6361.65,"end":6370.22,"speaker":"Fr Andrew Stephen Damick","text":"People. People were starting to believe that the podcast really was almost over because we stopped doing so."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6371.58,"end":6397.04,"speaker":"Fr Stephen De Young","text":"That's against. Keeps them tuning in, though, Right. You never know when it'll go away. Don't know what you got till it's gone. Paved paradise put in a parking lot. So, as we were just speaking about bishops, right. This role that we see Moses play, right. This is the role of leadership. This is the role of the bishop in the church, right. From St. Ignatius on."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6397.68,"end":6398.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6400.72,"end":6439.97,"speaker":"Fr Stephen De Young","text":"The bishop is there to bind and to loose, to rightly divide. Right. All of these terms that we've extracted from the King James Version of the Scriptures, to apply the scriptures, the canons, the teachings of the church, to apply those to the communal life of the church. And so when you look at the historical life of the church, we see this vast variety of instances of the same pattern."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6443.01,"end":6443.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6443.81,"end":6458.61,"speaker":"Fr Stephen De Young","text":"You could take the church in Russia in the 13th century, the Church in the Roman Empire in the 7th century, even the church in the United States."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6458.69,"end":6459.09,"speaker":"Fr Andrew Stephen Damick","text":"Today."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6461.17,"end":6471.25,"speaker":"Fr Stephen De Young","text":"The church of Japan in the 18th century. Pick your century and your local Orthodox Church. That is an instance of the same pattern."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6472.21,"end":6487.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And notably, they're not identical to each other. They're consistent with each other. Right. But they're not identical to each other. I mean, the more you read church history, the more you see this."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6488.99,"end":6536.85,"speaker":"Fr Stephen De Young","text":"Right, right. And so despite this, and part of what we're going to be decrying for the rest of this half. Right. Is there is a tendency for people to treat the past applications of bishops. Right. The ways in which the leadership of the Church has put. Applied this pattern to its life in some particular place at some particular time, and treat that as precedent, as establishing a precedent. What do I mean by that? By essentially elevating that particular contextualization to the level of the Logos itself."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6539.01,"end":6539.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6540.05,"end":6544.21,"speaker":"Fr Stephen De Young","text":"Saying that is not part of the contextualization. That is part of the pattern."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6546.45,"end":6547.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6547.89,"end":6548.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6548.21,"end":6584.1,"speaker":"Fr Andrew Stephen Damick","text":"And it's, you know, as you look at church history, you see this, that there are some things that are constant. For instance, we always have bishops, but there are some things that are not constant. Like, we no longer have the minor clerical role of doorkeeper or exorcist. You know, so there's. There's things that keep going, there's things that don't, and there's new things. That's the thing that scares a lot of people is that sometimes there's new things that, that, that are introduced, you know, but they have to be consistent with, with the pattern in order to be actually orthodox."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6584.82,"end":6585.18,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6585.18,"end":6586.14,"speaker":"Fr Andrew Stephen Damick","text":"You know, you can't just."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6586.14,"end":6588.02,"speaker":"Fr Stephen De Young","text":"There are new technologies. Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6588.1,"end":6589.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6589.1,"end":6602.82,"speaker":"Fr Stephen De Young","text":"At some point, we're going to have to come up with an orthodox ethic of engagement on social media. It doesn't just exist. Right, right. But it's not going to get just pulled out of the air either. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6602.82,"end":6609.37,"speaker":"Fr Andrew Stephen Damick","text":"And we also can't just simply say, well, you know, anything new is bad. We must not do that."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6609.37,"end":6611.97,"speaker":"Fr Stephen De Young","text":"Because number one, social media, because that's bad."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6613.09,"end":6667.39,"speaker":"Fr Andrew Stephen Damick","text":"But number one, that's just not true. There have been new things in the life of the Church, but number two, like, no one is consistent about that. You know, everybody has. I, when I was younger, I formulated the idea in my head of what I call the Luddite line, which is the level of technology. I will not, you know, this past, this point, I start to refer to pieces of technology as this thing. Right. This is the point at which I become a Luddite. I don't do that. But I mean, people do this in church life too. Like, well, you know, I'm okay with using codices, but there better not be Some kind of digital thing being used at that chance stand, you know. But I mean, codices were a brand spanking newfangled technology. At some point, I'm sure all the old scroll singers were like, yeah, where'd my scroll? I don't know. I don't know about that. You shouldn't be turning pages. That's wrong. You know."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6667.47,"end":6694.92,"speaker":"Fr Stephen De Young","text":"Right. But also, you can imagine, right. Because we have the equivalent now, right. Somebody hearing Deuteronomy who had talked to their parents before they died in the desert, right. Saying, well, wait, that's not what you said before. You said we were supposed to celebrate Passover this way. I'm going to keep doing it the whole way because that's the way God said."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6695.72,"end":6696.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6698.76,"end":6724.89,"speaker":"Fr Stephen De Young","text":"That'S a good way to get the ground to swallow you up in the Torah. Like that's not good. But that's what people do now, right? By trying to take, well, this is the shape it took in 19th century Russia or in my reconstructed imagination from having read a bunch of books or whatever. Therefore, this is it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6725.69,"end":6738.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's always this sense that the church, as I'm experiencing it now in my local parish, does not measure up to this idea that I have of some other time and place."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6738.73,"end":6777.92,"speaker":"Fr Stephen De Young","text":"Right, Right. And so to get at this. To get at this, we're gonna come at this a little bit different direction because we're gonna go now to the level of texts. Right. So one question that I still get occasionally, right. Despite the way I react, and I'm sure Father Andrew gets it once in a while too, is right. But I'm talking about scripture all the time, is somebody will hear something Scripture they haven't heard before or that strikes them as odd or that they disagree with. And you get what Church Father said, it means X, Right? Whatever you just said."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6778.16,"end":6779.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6780.4,"end":6786.4,"speaker":"Fr Stephen De Young","text":"This is an incoherent question. Now, by that I don't mean this is a dumb question."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6787.28,"end":6788.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's understandable."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6789.12,"end":6797.23,"speaker":"Fr Stephen De Young","text":"There are no stupid questions. There are many inquisitive idiots, but there are no stupid questions. It's not the question's fault."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6798.11,"end":6802.67,"speaker":"Fr Andrew Stephen Damick","text":"You are an inquisitive idiot. We'd like to hear from you. We already have."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6804.59,"end":6824.73,"speaker":"Fr Stephen De Young","text":"Right. When I made incoherent question, I mean, the question itself does not make sense. Right? It does not make sense because there are presuppositions that undergird the question. There are things that would have to be true for the question to make sense that aren't true."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6826.01,"end":6912.08,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. And one of them is like, it's funny like, like, just think this through for a second, folks. If, if, if orthodox life equals doing things that are locatable in some text of the Church Fathers, then that means, because the text of the Church Fathers did not simply drop out of heaven along with the creation of Adam, then that means that there was some point in the life of the Church where certain things were not written down when certain Church Fathers had never been born. And yet they, they at point, some point said or wrote a new thing, you know, and so then you have to decide like, oh, well, okay, so up to this point it's all like, this is what orthodoxy is. And then after that it's all kind of optional or suspect or whatever. Like that's just one level in which this is incoherent, is. It doesn't. Actually, you could not apply this standard throughout most of Church history. Setting aside the problem that throughout most of Church history, most people did not have even access to the Church Fathers to most of what the. Even if you were living like, let's say you're living relatively later in the period, like if you were St. Gregory Palomas, you still didn't have access to all the writings of the Church Fathers. He didn't. You had the ones he had access to."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6912.16,"end":6917.04,"speaker":"Fr Stephen De Young","text":"Yeah. And he had access to an awful lot. Compared to 99.9% of Christians."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6917.44,"end":6918.8,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6918.8,"end":6927.52,"speaker":"Fr Stephen De Young","text":"Who are illiterate on top of everything else. Yeah, but. Yeah, and I really want to focus on the. It means X part."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6928.01,"end":6928.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":6928.81,"end":7033.02,"speaker":"Fr Stephen De Young","text":"It means X. Right. It, the verse, whatever you want to plug in for it. The text means X. So this assumes that the Church Fathers or any Church leader with teaching authority, when they are interpreting texts, Scripture and whatever else, are appealing to an external free floating, objective meaning that there is for each text of Scripture, a meaning. That meaning is objective. It is, it is not related to any kind of context. It is objective. That's. It's free floating out there. And usually I'm guessing people would say something like, through the, the illumination of the Holy Spirit, the Church Father sees it and grasps it and tells it to us. Right. But that's not what any of the Church Fathers thought they were doing or were doing from their own perspective. That's not how they thought meaning works. Right. And it's incoherent in terms of how meaning works. Right. Like the idea that St. Paul, when he wrote his, his letter to the Church in Rome. Right. That essentially what it amounted to was a bunch of lines of code that when read properly with the correct kind of spiritual illumination would reveal to you some truths not contained within the text itself."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7035.01,"end":7035.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7036.13,"end":7061.76,"speaker":"Fr Stephen De Young","text":"That doesn't make sense. That's not coherent. Right, that's not coherent. What the Church Fathers did was they took texts, scripture, other texts, the writings of other church fathers, previous Church fathers, hypnographic texts, whatever else. Right. And they applied those texts to the lives of actual communities, the communities over which they were leaders."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7063.36,"end":7064.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7065.04,"end":7100.41,"speaker":"Fr Stephen De Young","text":"So they took the text and they applied it. Right. And so again, their particular application of that text. Their particular application of that text is an instance of a pattern. It is not the pattern itself. So when St. John Chrysostom preaches. Right. You may be reading a florilegium or a quote mine of St. John Chrysostom quotes, you might be reading it in a book on a topic."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7100.41,"end":7101.05,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7101.29,"end":7128.98,"speaker":"Fr Stephen De Young","text":"But when St. John Chrysostom says most. Most of St. John Chrysostom's writings are bits, pieces, chunks, however much. Maybe the whole homily, sermons he stood and he gave and delivered to an actual group of people at the end of the fourth or beginning of the fifth century in a church, in a place who were dealing with issues at the time. Some of them are very topical."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7130.58,"end":7131.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7131.34,"end":7134.34,"speaker":"Fr Stephen De Young","text":"Homilies on the statues dealing with current events."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7134.5,"end":7138.5,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or, you know, all those things about horse racing and so forth."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7138.74,"end":7146.17,"speaker":"Fr Stephen De Young","text":"Yes, Right. And he is applying the scripture that he just read that he's preaching on to their lives."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7147.21,"end":7147.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7150.09,"end":7182.26,"speaker":"Fr Stephen De Young","text":"So to take St. John Chrysostom's, any of his contextualizations into the life of those people, to take that and treat it as if it were the scripture himself itself would probably. I don't think St. John Chrysostom was probably too holy to smack you upside the head. Right. But you might get the verbal equivalent from him. Right. To act like what he said in his homily was the same thing as scripture."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7183.46,"end":7187.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. He."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7187.62,"end":7197.6,"speaker":"Fr Stephen De Young","text":"In no way. And they're not getting that from nowhere. Right. That's what he observes the apostles doing in the New Testament."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7197.92,"end":7198.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7198.32,"end":7203.36,"speaker":"Fr Stephen De Young","text":"St. Paul writes letters to actual people in an actual church, in an actual city dealing with actual issues."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7203.92,"end":7232.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not. I mean, and just read the epistles. It's obvious that they're two people. And, you know, and from a person, you know, like there's. There's a particularity to it. And I think that's one of the problems is that for whatever reason, we often are not comfortable with that particularity. We want them to be basically like these philosophers who are simply stating principles, abstract theological principles. Yes, yeah. Exactly."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7232.97,"end":7236.65,"speaker":"Fr Stephen De Young","text":"That are eternally true have nothing to do with human life."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7237.77,"end":7240.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7241.05,"end":7247.46,"speaker":"Fr Stephen De Young","text":"Yeah. But that's not. So the eternal truth has everything to do with human life because it's Christ. See our first half."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7248.1,"end":7249.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There's always."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7250.34,"end":7251.46,"speaker":"Fr Stephen De Young","text":"Can't separate the two."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7252.26,"end":7285.39,"speaker":"Fr Andrew Stephen Damick","text":"There's always. You know, what, what in our. In our dogmatics classes were called, called the soteriological motive, which everything that the Church Fathers write or the apostles or the prophets is for the salvation of the people who receive it. It's not just to set up, you know, okay. I've got this theological system in my head and I want to put it on paper. It's for people to receive it so that it can be salvific for them."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7286.11,"end":7303.35,"speaker":"Fr Stephen De Young","text":"Right. In their particular lives. Yeah, right. In their working out of the meaning of their life. Right. That we talked about in. In the last half. Yeah. And the reason the apostles are doing that in the New Testament is because that's what they saw Moses doing."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7304.39,"end":7307.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7309.59,"end":7337.36,"speaker":"Fr Stephen De Young","text":"That's how leadership works in the people of God. Right. And so if you have read any of the Church Fathers, you very quickly realize that another way in which that whole idea of it means X fails. Right. Is that the fathers are always talking about there being multiple layers or levels of meaning to texts."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7337.76,"end":7339.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, all the time."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7340.24,"end":7349.33,"speaker":"Fr Stephen De Young","text":"Right. Yeah, all the time. Even if it's just at the sort of basic literal and then spiritual level. But then you get way more advanced than that too. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7349.57,"end":7462.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And. And sometimes, like, just to give one example, you know, this upcoming Sunday in a number of churches, I'm not. Fits all of us, the Gospel reading is the. The Good Samaritan. So I mean, there's a bunch of different ways that the Church Fathers read this passage, but like two of them are that the. The man who gets beaten up and is by the side of the road is the soul. Right. And that the Good Samaritan is Christ and that, you know, the innkeeper is the church and it gets read that way. For instance, you can find that in St. Theophylact of Okrid, who I think is basically just taking that from Chrysostom, if I recall correctly. But then also you get exhortation that you should be as the Good Samaritan or that you should be as the innkeeper. That's not completely like, it's not identical with saying that the Good Samaritan is Christ. Right. You know, it's. In a logical sense, it's contradictory to say that the Good Samaritan is Christ and should Be you. But these are different ways of reading this to apply it for different purposes. So, like, talking about yourself as the. The soul that's beaten up on the side of the road is an important part of application. And it's about, you know, Christ's salvation of you. But then also, you know, you should be like the Good Samaritan or you should be like the innkeeper is another side of it, which is, okay, you have a duty to behave this way to your fellow man. You know, so they're not. They're not completely compatible with each other. There was those readings. But they're compatible with the overall pattern of what it means to be saved and what Christians should be doing, as one example."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7462.55,"end":7471.59,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And so part of the problem here with understanding the layers of meaning thing is bluntly bad education."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7472.79,"end":7473.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7474.55,"end":7483.67,"speaker":"Fr Stephen De Young","text":"People who have learned, you know, this is why. This will be another one of those I don't care moments. This is why M. Div. Degrees are such a bad idea."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7485.67,"end":7488.83,"speaker":"Fr Andrew Stephen Damick","text":"And you've got one and two thirds of an."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7488.83,"end":7489.59,"speaker":"Fr Stephen De Young","text":"Almost two."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7490.15,"end":7490.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7491.85,"end":7500.89,"speaker":"Fr Stephen De Young","text":"This is why abdiv. Degrees are a bad idea. Because one of the worst things that could be done to someone is to teach them a little about a topic."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7501.69,"end":7502.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7502.41,"end":7506.49,"speaker":"Fr Stephen De Young","text":"And adeptive degree is one in which you are taught a little about a whole bunch of topics."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7507.37,"end":7530.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And unfortunately. Yeah, I was gonna say unfortunately. Sometimes people. I mean, I. I'm guilty of this. Clergy think that their favorite subject in seminary. They are an expert on that because they studied it in seminary. You know, but it's supposed to be a broad sampling of stuff. That's what it. That's what it is."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7530.43,"end":7539.95,"speaker":"Fr Stephen De Young","text":"It's a survey. Yes. And the little bit that you get taught about patristic biblical interpretation is what is. There's Antioch and there's Alexandria."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7540.35,"end":7542.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7542.11,"end":7547.68,"speaker":"Fr Stephen De Young","text":"Yeah. And Alexandria, they interpret things allegorically in Antioch. They interpret things literally. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7547.68,"end":7550.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is an oversimplification, as it is just."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7550.72,"end":7551.6,"speaker":"Fr Stephen De Young","text":"It's bunkum."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7552.08,"end":7552.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7552.96,"end":7595.05,"speaker":"Fr Stephen De Young","text":"It's nonsense. It is false. That is literally not true. Right again, first of all, literal and allegorical are not opposed to each other. That's not a choice you have to make. That's not a choice anyone made. Okay. Actually read some of Origen's origin, Mr. Allegory. Read some of his commentaries. He talks about the literal meaning all the time. He just also talks about other additional levels of meaning. Read St. John Chrysostom. He never uses an allegory. Is that what you're going to tell me? Because he's from Antioch."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7595.61,"end":7596.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7596.81,"end":7612.76,"speaker":"Fr Stephen De Young","text":"It's nonsense. Yeah, it's nonsense. And it gives this impression to people, having learned that nonsense, that allegory and literal are opposed to each other. And they're not."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7613.64,"end":7614,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7614,"end":7649.51,"speaker":"Fr Stephen De Young","text":"Right. Allegory is a mode of application. It is a way of taking a text that does not seem to have any immediate direct application to the life of your community and applying it to your community. Do not eat the owl. The nighthawk or the sparrow has no direct application to my parish community here in Lafayette, Louisiana, because they are not bound by kosher food laws and they're Cajuns. So they'll eat an owl, a nighthawk or a sparrow if they darn well want to."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7649.83,"end":7650.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7650.39,"end":7712.79,"speaker":"Fr Stephen De Young","text":"Fry it out. It'll taste good with enough hot sauce. Right. Tabasco. All good. Right. But that doesn't mean that text is now, like, irrelevant. Right. I can go through and talk about in a Bible study on Leviticus, the food laws, why they were what they were. Right. How they're structured. And I can bring things out of those structures, maybe using a little bit of allegory that are applicable and are helpful to the life of my community now. Right. So allegory is literal plus. Right. And we even have to define literal. Because what passes for literal now in our modern world, in certain circles, literal means. What would the average bonehead reading this in English think? So that's number one."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7713.27,"end":7713.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7714.63,"end":7718.83,"speaker":"Fr Stephen De Young","text":"What is the plain meaning of the text if you just read it to someone in English? Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7718.83,"end":7730.07,"speaker":"Fr Andrew Stephen Damick","text":"And it's so funny, sometimes people, if it's not super obvious or something, people, like, will say things like, well, you're confusing people because. Because this could be read in some."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7730.39,"end":7732.43,"speaker":"Fr Stephen De Young","text":"Wacky way, Arcane way. Yes."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7732.43,"end":7734.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, well, welcome to all of text."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7734.95,"end":7737.75,"speaker":"Fr Stephen De Young","text":"Yes. Any text can be read in an infinite number of way."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7738.22,"end":7741.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7742.38,"end":7764.7,"speaker":"Fr Stephen De Young","text":"That's what literal means. Or literal means. You take some scientific, materialist interpretation of it. That's literal. Right. Neither of those is literal. You could go and read St. Augustine's literal interpretation of Genesis. That'll tell you what literal is. Right. Literal is the original context."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7766.24,"end":7766.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7767.12,"end":7856.5,"speaker":"Fr Stephen De Young","text":"That's the literal level of meaning. This is what it meant in its original context when Moses said this to them at the foot of Mount Sinai or on the plains of Moab. Right. When Christ said this to the people of Galilee standing on a hill. Right. That's the literal meaning. And if you deny that, by the way, if you deny that original context, you're not going to get very far in terms of understanding and applying the text. If you just toss that out for some bizarre reason. Right. That's the literal meaning. And so then the further layers of meaning, the other levels of meaning, the spiritual meanings, the allegorical meanings. Right. These are new and renewed contexts into which the text is being applied. And of course, we now have the issue that we're living more than a millennium after the vast majority of the Church Fathers, meaning they themselves have to be interpreted and applied. I have to look at what St. John Chrysostom was saying about the statues and what was going on with the statues, right. In the Roman Empire, the end of the 4th century. I have to understand that in its original context, and then I have to apply that in today's context."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7856.66,"end":7857.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How do I apply."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7857.38,"end":7859.3,"speaker":"Fr Stephen De Young","text":"We don't have an emperor with statues of himself."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7859.3,"end":7861.54,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say, how do I apply that to municipal art."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7862.02,"end":7912.68,"speaker":"Fr Stephen De Young","text":"Yeah, right. There's a move there that has to happen. Right. That has to happen. And the bishops of the church are the one charged with making that move. And they delegate partially, some of that teaching authority to the presbyters who they send out to represent them in the parishes. It's how church government works. So an example of this that I like to give because it's part of my dissertation. Right? Part of my dissertation. I look, what did everyone ever say about 1 John 2, verse 2? Right. And so what you find in most of the Church Fathers who comment on 1 John 2:2 is they say something on the order of. Here, St. John refutes the Donatists."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7915.08,"end":7915.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7915.8,"end":7918,"speaker":"Fr Stephen De Young","text":"Like 4th century Donatists."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7918,"end":7922.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say, remember, everybody, the Donatists are from hundreds of years after this New Testament."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7922.92,"end":7940.17,"speaker":"Fr Stephen De Young","text":"And if you read what the Church Fathers say, they're not just saying like, oh, here, St. John refutes the error that people like the Donatists made. They're saying the 4th century donatists in Africa. Like, they're very specific that St. John is refuting them."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7941.53,"end":7942.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7942.17,"end":7943.77,"speaker":"Fr Stephen De Young","text":"These Donatist churches in Africa."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7944.17,"end":7952.49,"speaker":"Fr Andrew Stephen Damick","text":"And by that they don't mean St. John is prophetically predicting that Donatism will exist and giving a response to it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7952.92,"end":7972.76,"speaker":"Fr Stephen De Young","text":"Right. And writing this verse for that. And therefore, so like, when Bede writes that the Venerable Bede writes that in the sixth century. Right. He's not saying, oh, yeah, that was about those African donatists in the 4th century. So now just don't worry about that verse. Just skip it. That was about that. That's what."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7972.76,"end":7973,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":7975,"end":8005.48,"speaker":"Fr Stephen De Young","text":"He doesn't do that, obviously. Right. He still thinks it applies to them that he records that. Right. But so the idea that that's what the Fathers were saying was that St. John had a vision of the Donatists and wrote this verse just for them in Africa is ridiculous. Right. And that the verse has no other layers of meaning. This is a contextualization, right. This is an application made by the Fathers of the Church to a situation in the Church in their day."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8007.98,"end":8008.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8008.18,"end":8038.29,"speaker":"Fr Stephen De Young","text":"There was this schism that happens in Africa of the Donatists. And the Donatists claim that the salvific grace of God is confined to their churches in Africa. Right. And that no one else has valid sacraments. No one else could be saved. Right. Except their churches in Africa. And the Church rather say, ahem, right, and point to First John 2 and."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8038.29,"end":8040.73,"speaker":"Fr Andrew Stephen Damick","text":"Make an arch atonement for the whole world."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8041.05,"end":8087.54,"speaker":"Fr Stephen De Young","text":"Yes, Right. And so, but that's just one contextualization, right? That text can be recontextualized, right. That pattern can be reinstanced in manifold different ways. They're not going to be radically contradictory, right? But they're not going to be identical either because different eras of the Church in different places are going to face different issues, right. That they need to deal with, but they're all going to be dealing with them according to the truth, that is Jesus Christ, according to the Logos. Right. And so there is this strange quest for contextlessness."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8089.38,"end":8093.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. This thing means that it may just be Plato brain."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8093.74,"end":8106.1,"speaker":"Fr Stephen De Young","text":"We're all looking for the ideal form, right? We're all trying to get away from particularity and the material and the messiness of human life. We don't want that. We want to extract ourselves from that. But that way lies nothingness. That's nihilism."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8107.14,"end":8107.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8107.94,"end":8139.2,"speaker":"Fr Stephen De Young","text":"As we already said, a person not related to anything is nothing, has no identity. Right? Platonism ends in nihilism. So the key thing here is there is no system of interpretation or rules or processes that are freestanding, that are objective, that stand outside of reality. Against which you judge reality."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8140.8,"end":8141.28,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8143.2,"end":8165.57,"speaker":"Fr Stephen De Young","text":"Right. Against which you judge reality. And so that means anyone who says, anyone who makes a statement of meaning, this verse means this. This quote from the saints means this. This situate what's going on in this situation means this, right? They are doing the act of application, Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8167.97,"end":8168.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8168.85,"end":8176.13,"speaker":"Fr Stephen De Young","text":"That is what they are doing. And all such statements, therefore, are opinions, Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8176.13,"end":8198.36,"speaker":"Fr Andrew Stephen Damick","text":"And you know, opinion doesn't mean not true or, you know, like that's just your opinion, man. Like it's. It's a ruling, right? Judges issue opinions and, and people don't. I mean, I'm sure maybe some People do say to them, but people normally would not say to them, well, that's just your opinion. Your Honor, I know this. This is the ruling."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8198.36,"end":8199.84,"speaker":"Fr Stephen De Young","text":"It's just your legal opinion."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8199.92,"end":8208,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. But the thing that they issue is called an opinion because it's their. This is their application of the law in this case."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8208.4,"end":8215.68,"speaker":"Fr Stephen De Young","text":"Right, right. They're ruling. Right. It's opinion in that sense. And therefore opinions issued by various people."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8216.09,"end":8216.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8216.29,"end":8242.73,"speaker":"Fr Stephen De Young","text":"Here is how the canons ought to be applied in this instance. Here's how the Scripture ought to be applied in this instance. Here's how whatever ought to be applied in this instance. Right. Whether that opinion, that ruling is worthwhile is something you should care about, is something you should pay attention to, is purely based on the authority of the one opining. Is this a person who God has entrusted with the authority to issue these opinions and judgments or not?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8246.59,"end":8246.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8246.83,"end":8255.39,"speaker":"Fr Stephen De Young","text":"If the answer is no, then that is just your opinion, man. That is irrelevant. Right, right. That is irrelevant."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8255.87,"end":8259.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, you can give advice, right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8259.95,"end":8267.47,"speaker":"Fr Stephen De Young","text":"Like someone could give their opinion on my pending court case, but unless they're the judge, it doesn't matter."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8268.19,"end":8271.38,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8271.94,"end":8282.74,"speaker":"Fr Stephen De Young","text":"Like it doesn't matter. They're not the person who got his. Has put the position. Right. With the authority to do that. Right. To make that call, to make that application in this instance."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8283.78,"end":8284.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8284.58,"end":8310.69,"speaker":"Fr Stephen De Young","text":"And that's what all of these things are, is they are the applications. Taking Logos, that is Christ, right. Applying him ultimately. Right. To the various situations in the life of the church, in our own life, applying them in a way that gives them meaning, that allows them to be navigated, and that ultimately leads us to salvation."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8312.13,"end":8606.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So to give some. Some final thoughts on this to me, a very fascinating and provocative conversation. I've talked about this a couple times before, but. And so hopefully this won't be too redundant with other things I've said, but within this context, God willing, it'll be something usefully new. So, you know, I myself, by my personality, by my training, by my habits, one of the things that I am is an antiquarian. I love old stuff. I love going to museums and seeing old stuff perfectly preserved or restored or whatever. The idea that you would take, you know, an old painting and just change it because you think it would look better in some other way like that horrifies me, as I hope it would most of us. Because, you know, one of my favorite museums here in the US is the Cloisters, which is in northern Manhattan. Beautiful museum of Medieval art. So therefore it's almost all Christian art. And I think that the way that a lot of Orthodox Christians approach Orthodox Christianity is an antiquarian way. You know, this is kind of a modernish idea that you take this thing from the past and you. You encase it in a display case and you look at it, and that's the thing that it is, right? And we treat orthodox Christianity that way a lot. And people tend to pick some particular time or place or maybe some, you know, potpourri of times and places, bits that they like from various things. And for them, then they say, this is Orthodoxy. This is the thing. And then they judge what other people are doing according to that. They judge often, maybe their parish priest, their bishop. All right, it sometimes was said about the Protestant Reformation that in. In the Reformation, everyone is a priest except for priests. And I think that this attitude for orthodox Christianity is everyone is a bishop except for bishops. That the opinions of people on social media about various things are given more weight by some people than the people whose job it is to actually take care of our churches. And I know that, like, it can be scary. You know, what if it all goes wrong? And I know that, Father, this is part of what you're going to talk about. So I don't want to get too deep into it. It's an important question, right? What if bishops make the wrong decisions? I understand America is founded on the idea that important people make the wrong decision. That's why we have a country. But what I will say is this on the positive side, that as you look at the history of the Church, there, it seems to me was always this assumption that the Church continues to be alive and active and that bishops have real authority in the moment to do their jobs, that the Church can act creatively in the moment to apply the life in Christ in that time, in that place, in those particular situations, what is said to one person or one community may not be applicable to another person or community, or it may need to be said in a different way, right? And that life in Christ, life in his body, the Orthodox Church, is not life in a museum. Now, I'm not saying that as some kind of revolutionary. I am the opposite of revolutionary. Anyone's ever met me or read anything I've ever written or listened to, what I say knows that that is not my deal at all. I didn't become Orthodox to, you know, make some improvements, right? There's nothing for me to improve. At the same time, and this is not contradictory, we see that the Church continues to function creatively. New things are being said which are consistent with all the old things, that's where it goes off the rail is if you say a new thing that's not consistent with the old things, that is not the application of the same pattern which is Christ."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8608.2,"end":8608.6,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8609.4,"end":8904.22,"speaker":"Fr Andrew Stephen Damick","text":"And so I think that, you know, we live in a world that's kind of messed up these days, particularly. There's a lot of really strange malaises and pathologies that we're living in here now in 2023. And so I understand the response to that, like, the feeling that the world is declining, the feeling that. That, like, wow, this is the craziest things I've ever been. And number one, that's simply not true. If you read the history of the world, there have been some way crazier times, way more apocalyptic moments. I mean, for some people, this is a very apocalyptic moment. I mean, there are people living in places where their world is on fire. So I get that. Right? I get that. But to me, the response to that, even, like, if. Let's say this is really it, this is really like, this is the true end, the final end of the world is coming very, very soon. Like within a year or whatever, five years, 10 years, 40 years, I don't know, like, let's go full Hal Lindsay, say that's true. The response to that is not to draw back and encase the Christian life and simply demand that everybody, you know, stare at this museum exhibit of Christianity. The response that the church has always had in various apocalyptic moments in confronting various antichrists, which St. John said had come multiple in his time, had come and more will come. The response of the church is creativity is building something new, Right. As things collapse around, the church builds something beautiful and new, number one, so the people who are running from the collapses have somewhere to go. But number two, because. Because our job is to. Is to participate in the kingdom of heaven, which is this building project. We're supposed to be engaged in the building project, right? And what's being built is not like a big fortress. What's being built is the new Jerusalem, right? And so to me, that's not only a way more hopeful approach to societal collapse and decline. You know, on whatever level that's actually true. I only see what I see looks pretty messed up in many ways where I am. But the truth is, is most of what I see that makes me think of collapse is stuff I see kind of out there. Like my life, my actual life, like my town is not collapsing. It's a good place to live, thank God. It's a Good place to live, right? I'm not saying other things aren't happening, but my life, that's the reality of my life. God is blessing us at this moment and this place and that our task in the world is continue to with confidence because Christ is our head. You know, I think sometimes to move forward with confidence and to do this building. I think sometimes people act. Christians act like atheists. They act like God is not with us, despite that being one of his names, Emmanuel, God with us, that he is not with us. That like, it all depends on us. So you had all better get it right. You had all better be perfect and pure. You had all better say the exact right things. Because if you don't, like, have some faith that God is here and he's working and he's going to take care of stuff, and even if someone gets deeply messed up and hurts a lot of people, God is going to bring justice and vindication to that situation. He will. Maybe not on the timetable that I would prefer, probably not, but he will. God has this. And our response to that is not to either act like he doesn't have it or to sit back and say, okay, you do everything in the Lord, but rather knowing that he has it, than to function creatively within that. Because that's what the church does. The church is alive. It's alive. It's not some moth with a pin stuck through it put up on the wall that everyone can admire and don't touch it. That's not what the church is. So, Father."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":8908.06,"end":9243.22,"speaker":"Fr Stephen De Young","text":"So yeah, I'll go. I'll double down on the provocative St. Siloan at one point says that if your spiritual father tells you to sin, you should do it for your salvation. He says that if your spiritual father tells you to do something and you do it out of obedience and it turns out that it was sin, God holds your spiritual father accountable for that, not you. And your obedience can save your soul. The problem is. The problem you have is that you sat there and you judged your spiritual father's words, trying to decide for yourself whether what he was telling you to do was right or not. That's the problem you have. Not that he might have told you to do the wrong thing, which he might very well have. Because as someone who is a spiritual father, I'm sure I get it wrong. Sure I get it wrong sometimes. At least sometimes one of the worst things that certain forms of Protestantism do to people is they set up this situation for a person. By the way, I have some Protestant friends who think this is a feature, not a buck. So your mileage may vary, but to me, this seems like a heavy weight to get thrown onto a person, that an individual person, as a Christian, has to essentially sort of figure out Christianity for themselves. They're responsible to go and read the Scriptures themselves, to read spiritual books, to decide what they believe and where they fall on all manner of theological issues and issues of church life. I mean, basic things. Do you baptize babies or not? Right. How often do you celebrate the Eucharist? What even is the Eucharist? You know, the Trinity. How do you view the Trinity? How do you view Jesus, humanity and divinity, the interpretation of all manner of Scriptures. You have to go and decide for yourself all of these things. And by the way, at least some of them, if you get them wrong, you'll go to hell for eternity. That, to me, is a burden no human can really bear if they understand what's being asked of them. That's an unbearable burden. Nonetheless, you don't have to go very far in the Orthodox world to encounter Orthodox Christians who try to approach the Orthodox faith in the same way. They think that what they are to do as an Orthodox Christian is to go, and usually not the Scriptures, to read church fathers and to read various books and decide where they stand on all of these issues and what the true Orthodox position is on all of these issues. Because if you get any of them wrong, you're not really Orthodox, therefore probably not on the path to salvation. If you're gonna do that to yourself, might I suggest that Protestant services are much shorter. They're scheduled more conveniently, and a lot of them, you can drink coffee. So why take all the bad parts and none of the good parts? The Orthodox Church has done this great favor for you of having preserved the Christian faith for 2000 years, handed down from the apostles, of having this rich history, leaders appointed by God. God even appointed the bad ones, God even appointed the heretics, leaders appointed by God who fallibly interpreted and applied the deposit of faith, fallibly interpreted and applied the Scriptures, fallibly interpreted and applied the canons all the way down to the present day, so that you can now come and be a part of a community that is working out its own salvation, that is overseen by fallible leaders who will be doing their fallible best to bring all of that to bear, which is ultimately the Logos, which is ultimately Christ himself. Bring them to bear on your life and help you find salvation so that you don't have to try to do this by yourself, so that you don't have to make this high stakes wager on your own theological acumen so that you can follow rather than lead and be secure in that. This is a gift that the Church gives you. To be able to follow your spiritual father in his guidance, to not have to do what is right in your own eyes and hope that its end is not destruction contra the scriptures."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9246.18,"end":9246.46,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9246.46,"end":9347.58,"speaker":"Fr Stephen De Young","text":"Do rather what is right of the eyes of the authority that God has established and put over you. Now, I'm not. I'm not saying this because I'm a priest and I don't want people to criticize me. Please criticize me. I enjoy it because, number one, nothing you could possibly say about me publicly is half as bad as the truth. And number two, I really do find it sickly entertaining when people say outlandish, negative things about me. So criticize me to the hill. I don't care. That's not what that. Right. And you certainly don't have to look very hard to find bishops misbehaving in all manner of ways, making bad decisions. Right? Again, everybody's fallible. I'm not, I'm not apologizing for anybody. Right? But I'm. I'm talking to you, right? I'm talking to you as a person. A person who's trying to become a human person, who's trying to figure out what their life means, is trying to become like Christ. You got to test the spirits, the spirit that wants you to decide what real orthodoxy is and then compare your priest and your bishop to it. Is that spirit leading you to become a fully participant part of your community and find salvation? Or is it pulling you away from that? Then you know what kind of spirit that is. Does it matter how it presents itself? Does it matter if it wears a cassock? Does it matter if it claims to be from the holy mountain or heaven itself?"}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9348.05,"end":9348.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9350.45,"end":9378.64,"speaker":"Fr Stephen De Young","text":"That'S not. That's not the Spirit that's leading you to salvation, right? Spirit that's leading you to salvation is the Holy Spirit who's leading you to become part of a community, to discover there who you are and how you relate to the other people in God's world, into God's world itself, and how you as a person can become like Christ and figure out what it all means."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9384.16,"end":9411.31,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that is our show for tonight. Thank you very much everyone for listening. If you didn't get through to us live this time, we'd still like to hear from you. You can email us@lordofspiritscientientfaith.com you can message us at our Facebook page or you can leave us a voicemail@speakpipe.com and if you have basic questions about Orthodox Christianity or need help finding a parish, head to orthodoxintro.org and join us for a."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9411.31,"end":9423.67,"speaker":"Fr Stephen De Young","text":"Live broadcast in the second and four Thursdays of the month at 7pm Eastern, 4pm Pacific, where we'll ask why are we here? What's life all about? Is God really real or is there some doubt? Well, tonight we're going to sort it all out. For tonight, if you're on Facebook Meeting."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9423.67,"end":9434.16,"speaker":"Fr Andrew Stephen Damick","text":"Of Life, you can follow our page and join our discussion group. Leave reviews and ratings in all the appropriate places, but most importantly, please share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9434.72,"end":9448.96,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. What is life? What is our fate? Is there a heaven or hell? Do we reincarnate? Is mankind evolving or is it too late? Well, tonight, here's the Meaning of Life."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9449.36,"end":9451.76,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless you all."}
{"episode_id":"LOS - #080 - 2023-11-09 - What Does Stuff Mean -","start":9457.29,"end":9494.34,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
