{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":0.24,"end":22.72,"speaker":"Fr Andrew Stephen Damick","text":"Hello Lord of Spirits listeners, this is Father Andrew. This program is recorded and streamed live, so sometimes the unexpected happens. In this episode you'll hear that we had technical problems with Father Stephen's audio connection. Despite this, we felt that the content was good and still accessible. So please bear with us on this one. A solution is already in place for next time."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":23.52,"end":88.35,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":91.55,"end":191.53,"speaker":"Fr Andrew Stephen Damick","text":"Good evening and welcome to the Lord of spirits podcast. I'm Fr. Andrew Stephen Damick in Emmaus, Pennsylvania. And with me is Father Stephen DeYoung in Lafayette, Louisiana. And if you're listening to us live, you can call in at 855 AF radio as 855-237-2346 and and we will get to your calls in the second part of today's show. And as always, this is a very content heavy show and so we try to balance it out with your calls. So if for some reason you don't get through today, don't feel bad and just wait until next time. And of course you can also contact us in lots of other ways. We've been talking a lot about demons over the last couple episodes, and you know that it's going to be a perennial topic on this show, but we haven't discussed too much yet about their actual order origins. Most Christians know that demons are angelic beings who rebelled against God and chose to do evil instead of good. But when did that happen and how did it happen? So tonight we're going to be talking about that. And you may especially be surprised to learn that the Holy Scriptures don't present just one angelic fall. It turns out that there May well be around five. Five falls of angels. So let's get started by talking about the misconception that most people seem to have about the fall of demons, the fall of these angelic beings and they're becoming demons. So, Father Stephen, what exactly is this idea, this misconception that people have and where does it come from?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":193.45,"end":200.27,"speaker":"Fr Stephen De Young","text":"Well, as I think we mentioned at least briefly last time, it comes from our puritan friend, John Milton."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":200.75,"end":201.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":201.63,"end":244.84,"speaker":"Fr Stephen De Young","text":"And Paradise Lost. And the idea that we're talking about is this idea that at some point before the creation of the earth, at some point before Genesis 1:1, God created the angels separately from the rest of creation. And then at some point between then and the creation of the world, the devil led this rebellion. Got a bunch of his. His guys together and they were cast down out of heaven. I'm not sure to where. I mean, the underworld wasn't there yet."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":245.4,"end":245.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":247,"end":271.39,"speaker":"Fr Stephen De Young","text":"For creation. But they literally fall, like fall out of the sky and all of the different kinds of evil encounter in the scriptures and tradition and the lives of the saints, all these angels who fell back then, who are still around."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":272.75,"end":273.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":273.95,"end":286.26,"speaker":"Fr Stephen De Young","text":"There's not usually a good idea of what the way they act, where that comes from."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":287.06,"end":396.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And in Milton. So like in Paradise Lost, which is, by the way, which is a wonderful poem, like, I love it. But we have to remember that it's fiction. In Paradise Lost, the almost the hero, the anti hero is the devil. And you know, he falls down, as you said, to where exactly? But he talks about he'd rather rule there than serve in heaven. And I think that that's the sense that we have. And I think also the reason why people have this misconception is that it seems to fit with what they read in the book of Genesis. Right. Because in the book of Genesis you get this tale of the creation of the world and there's Adam and. And then Adam and Eve. And then they're tempted and they fall into sin. And so while they're tempted by some kind of demonic creature, where does that creature come from? Well, we didn't see the creation of the demons in those first few chapters. So that must have happened. All that stuff must have happened kind of off camera before. Let There Be light. Right. I think that's. We sort of fill in the blanks with that. Right. And so then we proceed forward and having made this assumption that that's the origin of demons, then we end up misreading stuff that's in the scripture that actually talks about other moments when there are these Falls. Right, so, you know, so let's start talking about then. So we've talked about. There's about five. Like we've titled this episode the 5ish Falls Angels. So there's about five. So let's. Let's talk about the first one."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":397.3,"end":481.08,"speaker":"Fr Stephen De Young","text":"Yeah, well, one. One I go through is in most cases is a narrative or a story in the ancient surrounding world that represents in some ways a parallel to Fall that we're going to be talking about. Kind of approach this in two ways. You can approach this as, you know, this is the Israelite version story that is correct. Sort of correcting the record. Right. You all believe this, but here's what really happened. Or alternatively, actually. These aren't actually close to each other, but alternatively, you can look at it from the other perspective that if we take seriously the idea that all the gods of the nations are demons, that religious beliefs of the nations who are worshiping these demons can be seen to represent sort of demonic propaganda, you know, so it's actually they who are. And making themselves the winners, the heroes, even more directly than Paradise Lost did, which."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":481.08,"end":483.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":483.8,"end":487.8,"speaker":"Fr Stephen De Young","text":"Relied on sort of the love of antiheroes in Western culture."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":488.36,"end":654.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. So just a kind of a technical note, Father Stephen, you're kind of cutting in and out. So there. Our engineer, who is Matuska. Trudy. Hello. Trudy is going to be sending you a new link. But I just wanted to talk, while we're working on that, a little bit about what you're discussing. Just from my own experience, you know, when I was a kid, I read a lot of, you know, what we would call mythology literature, and we've talked about this a little bit in the past on the show, but this idea that these are just sort of stories, right? And that the modern people often have the sense that ancient mythology is ancient people who saw stuff that they couldn't. That they couldn't explain. And so they came up with the idea of gods who did things so like, you know, lightning and thunder or storms or the ocean moving or whatever. And they. They looked at that and they said, well, that there must be some kind of force behind that that's making that happen. Right. And the problem, of course, with that outlook is, number one, it doesn't take ancient people seriously. And number two, it doesn't account for the complexity of the stories. Right. And especially the similarity of them across different cultures. Right. And, you know, we're going to be talking about, like you said, that there's this kind of propaganda from the. From a Christian and ancient Israel point of view, that mythology, you know, that the stories of these ancient gods is not actually the true story of what really occurs, that it's an attempt to co opt what really happened in order to bring people under their subjection to make them think that they're kind of on the right team, so to speak, in worshiping these fallen beings. So, yeah, it's interesting. And one of the things that you note, if you read the scriptures closely, you'll note that some of these stories from ancient peoples and the worship that they engage in intersect at various points with the scripture. And of course, the one that you see the most often is baal. Probably especially in the Old Testament, BAAL is mentioned over and over again. But, you know, have you ever thought about who BAAL is? Exactly right. And why is BAAL mentioned so often in the Old Testament? It's not just that there's this other worship that's going on somewhere, but, but that this is a being that they're actually dealing with. So. Father Stephen, do we have you back here yet?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":655.42,"end":656.7,"speaker":"Fr Stephen De Young","text":"I believe so."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":656.94,"end":671.82,"speaker":"Fr Andrew Stephen Damick","text":"Okay, great. Okay. All right. Yes, listeners, I was just filling in a little bit, but hopefully that was actually good content too. Yeah. So, okay, so let's talk about some of this propaganda. Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":673.58,"end":784.84,"speaker":"Fr Stephen De Young","text":"And yeah, the, the first of these probably is what's referred to generally by scholars. All of these stories together is you find in pretty much every ancient culture some version of what's called the succession myth, which is bare bones. The idea that there was a. We talked before about how there was the idea of there being a council of gods and then a sort of divine father's high God and then a divine son who was the head of the council. We talked about how in Israel that was Yahweh in both cases. Right, so you already have at least built into ancient Israelite religion. But the idea in most of the other cultures of the ancient world, pretty much universally, is that there was an original most high God who was overthrown at least once by a later God who rose up from among the council by one of his sons in the council who overthrew him and took his place. Yeah, the most high God. So the, the most common. You mentioned BAAL already. This happens with baal. The BAAL cycle is primarily the story of Baal's insurrection. This happens twice in Babylonian mythology. It happens twice in Greek mythology, as people may be aware, when Kronos castrates his father, Uranus, or Uranus, and becomes most high God, and then Zeus later kills his father Kronos. And takes his place. So there are actually two successions there."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":785.08,"end":785.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":785.64,"end":794.76,"speaker":"Fr Stephen De Young","text":"Babylonian mythology. So you have this story of a rebellion, but in every case in these other nations, that rebellion was successful."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":795.48,"end":796.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":796.68,"end":838.11,"speaker":"Fr Stephen De Young","text":"And of course, the version that we are going to see in the Old Testament, in the Hebrew scriptures is going to be inverted in that this insurrection is going to have failed. And right now, this is the basis for what Milton does in Paradise Lost. But here's the key difference. By casting it before the creation of the world, there's a basic logical problem. So, same way an angel is a creature. So let's. Tomorrow you decide you're going to overthrow God and become God. What's your first step?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":840.51,"end":841.79,"speaker":"Fr Andrew Stephen Damick","text":"You gotta get an army together."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":843.87,"end":845.23,"speaker":"Fr Stephen De Young","text":"What's the army gonna do?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":847.23,"end":848.91,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. Attack some other gods."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":850.75,"end":856.75,"speaker":"Fr Stephen De Young","text":"Right. I mean, you literally can't attack God. Right. As a creature."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":857.23,"end":857.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":857.63,"end":860.35,"speaker":"Fr Stephen De Young","text":"Right. You can't, like, throw things at him. I mean, like, there's not."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":860.99,"end":861.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What do you."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":861.95,"end":883.86,"speaker":"Fr Stephen De Young","text":"There's not a way to do that. Right. And the key to this is that Gregory said in the quote that we read last episode when he said, where is God enthroned? God is enthroned in the minds, the hearts of his creatures."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":884.26,"end":886.74,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's everywhere."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":887.54,"end":906.67,"speaker":"Fr Stephen De Young","text":"And so if you're going to dethrone the most high God, the true God, the only way to do that, you can't dethrone him in reality. Right. But you can try to dethrone him in the hearts and minds of his creatures, but that requires there to be other creatures."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":908.03,"end":990.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So if creation hasn't happened yet, then. Yeah, yeah. And it's interesting, just as a point, that what did it mean for them to rebel? When we're talking about the true story, what does it mean for them to rebel? And it is, in some sense an internal process. Right. Casting him out, so to speak, from their own hearts and minds. Now, obviously, God is everywhere, so it's not a question of actually creating a space that God can't be in, because not a thing, but rather a space that you're not receiving Him. And that's exactly how human beings do it too. I mean. Right. That we dethrone him in our hearts, not in a way that makes it so he's no longer present because he's everywhere present, but in a way that we're no longer accepting him and receiving him and cooperating with him, and to use New Testament synergizing with him, you know, instead we're. We're resisting him. Right. And so that's What? That's what this means to cast, cast him out from the throne of their hearts."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":991.05,"end":996.01,"speaker":"Fr Stephen De Young","text":"Right. And, and you can't attack him, but you could attack your fellow creatures."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":996.65,"end":997.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":997.85,"end":1009.69,"speaker":"Fr Stephen De Young","text":"You can't destroy him, but you could try to destroy your fellow creatures. And that love of God and love of neighbor and hatred of God and hatred of neighbor are always linked together in the scriptures all the way through."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1010.5,"end":1010.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1011.54,"end":1053.59,"speaker":"Fr Stephen De Young","text":"Because you, you, you, if you have wrath against God or anger against God or rebellion against God, you're going to express that by taking it out on his creatures. And that's exactly what the devil ends up doing. And that's, that's the, the storyline that's going on in terms of the devil in Genesis chapter three. Okay, so much focus in Western religion is on Adam and Eve. Right. And what happens with them and what they did. Right. And in, in a later episode, I'm sure we'll be talking about the three falls of humanity in, in Genesis 1 through 11."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1053.91,"end":1057.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's three falls, people. There are three falls of humanity."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1060.15,"end":1152.61,"speaker":"Fr Stephen De Young","text":"Post, post St. Augustine, everything gets kind of pushed into Adam. But there's something that H to Eve. But there's also something here that happens to the devil, to the serpent. And there, there are sometimes people who want to read Genesis 3 a little overly literally and turn him into a talking snake. Right. And say, this is, well, this is, this is like a Rudyard Kipling just so story how the snake lost his legs. Right. That's, that's what happened. Six head legs. But then, oh, this one was bad. So now they don't have legs. But that obviously is not right. What, what the scriptures are spending their time talking about the word that's used here, that's translated serpent in Hebrew, nakash. There's actually a little bit of a play on words because of course in Hebrew you only write the consonants, right? The, the, the vowel points. If you read modern Hebrew or read a modern printing of the Hebrew Bible, it has vowel points added, and those were added in the medieval period, so thousands of years after it was written. But if you take the vowel points out, words become much more ambiguous. You just have three consonants. So the word nakash in this case can be a noun being used substantively being used like a noun."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1153.73,"end":1154.37,"speaker":"Fr Andrew Stephen Damick","text":"A snake."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1155.17,"end":1159.41,"speaker":"Fr Stephen De Young","text":"Or it could be a verb or a verbal noun, essentially a participle."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1159.49,"end":1161.49,"speaker":"Fr Andrew Stephen Damick","text":"Oh, a snakey."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1163.01,"end":1167.41,"speaker":"Fr Stephen De Young","text":"Well, if it's a noun, it means serpent."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1167.81,"end":1168.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1168.45,"end":1171.25,"speaker":"Fr Stephen De Young","text":"If it's an adjective, it means the shining one."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1171.94,"end":1172.98,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1174.58,"end":1182.26,"speaker":"Fr Stephen De Young","text":"If it's a verbal participle, it means the cunning one or the deceptive one, the deceiver."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1182.98,"end":1183.54,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1185.46,"end":1192.58,"speaker":"Fr Stephen De Young","text":"All three of those ideas. If you don't have vowel points, it makes it very easy to do a word play where it can mean all three of those things."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1192.98,"end":1193.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1194.66,"end":1293.49,"speaker":"Fr Stephen De Young","text":"This is a feature of Hebrew prosecution poetry to use a word in this kind of multivalent way to convey all of these things. So in terms of the snake part, remember that serpents are a class of angel. We talked about the seraphim last time, that seraph is the. The Egyptian word for a serpent. And just a moment, I'm going to talk a little bit about Ezekiel 28, where this story is told from another perspective. And in there, the devil before he fell is referred to as a guardian cherub. And remember, cherubs had a similar kind of role as a guardian of a divine throne in the ancient world. But so in Genesis 3, particularly in verse 14 and 15, is that the serpent himself is cursed by. By Yahweh. And that curse is important in terms of. Understand what's good, understanding what's going on here with the devil. And what Yahweh says to him in Genesis 3, 14 and 15 is, is because you have done this, cursed are you beyond all beasts, all creatures, and beyond all of the animals of the field, on your belly you shall go, and dust you shall eat all the days of your life. And I'll put enmity between you and the woman and your seed, and her seed he will bruise your head and you. Now that verse 15 is. Is meditated on a lot as being sort of an initial statement of the Gospel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1293.89,"end":1294.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1294.25,"end":1306.84,"speaker":"Fr Stephen De Young","text":"But that, that part about going on your belly and eating dust all the days of your life is the part that gets turned into, oh, well, he lost his legs. Yeah, ancient people weren't stupid."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1307.56,"end":1313.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's. It's not like they, they. That. That these snakes were eating dirt."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1314.6,"end":1368.53,"speaker":"Fr Stephen De Young","text":"You know, they knew that takes any dirt. They saw the meat mice, right. Just like we've seen the meat wise. They followed that. And so the, the dust that this is talking about, it's the same word, right? Because this is in the context of also then Adam and Eve receiving the curse, that dust they are, into dust they shall return. And so the imagery here is of the. The serpent, the devil, becoming the eater of the dead. See, in iconography, Hades depicted this way as this sort of serpent with a big wide open mouth, devouring, devouring people, devouring the dead. And so this is. What's happening here is not just about snakes, it's about the devil. This is where he falls, this is where he's cast down."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1368.85,"end":1376.37,"speaker":"Fr Andrew Stephen Damick","text":"And he becomes earth and he becomes the Lord of death. Right. He becomes associated with death."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1377.41,"end":1389.27,"speaker":"Fr Stephen De Young","text":"He's cast that. And the word here for ground, translated ground, cast out of the ground or the earth, is eretz in Hebrew, which is also a word that's commonly used to refer to the."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1390.47,"end":1391.55,"speaker":"Fr Andrew Stephen Damick","text":"So the underworld."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1391.55,"end":1409.92,"speaker":"Fr Stephen De Young","text":"Right. This is the, the devil being made. He's. He's made the prince of the underworld. He's made the Lord of death. And we see this reference in the New Testament. One big example is Hebrews 2:14, you know, which refers to the one who holds the power of death."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1410.48,"end":1426,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, right, right. Which is interesting. Interesting to put it that way. Like, it, it doesn't mean like, like, it's not like. And maybe correct me if I'm wrong, I'm getting this wrong. We're not saying that he's the one who gets to decide when people die."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1427.2,"end":1447.68,"speaker":"Fr Stephen De Young","text":"Right, Right. Yeah, yeah. That's not. He has the power to go around and kill whoever he wants. Right, that's. But, but that's Right. The idea in the curse that's put on Adam and Eve, you know, dust you are to dust you will return. Right. It's sort of God brought them from nothing and they're going to go back to being nothing."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1448.16,"end":1448.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1449.36,"end":1458.72,"speaker":"Fr Stephen De Young","text":"Right. And so essentially the devil here is being made the Lord of nothing as this kingdom of dust and ashes, which is what he receives."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1459.28,"end":1459.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1459.72,"end":1470.85,"speaker":"Fr Stephen De Young","text":"And then this, this whole idea that of course, in a lot of our hypnography of Pasca, that Christ then invades the underworld and takes even that away from him. So he doesn't even have that."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1471.25,"end":1471.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1471.93,"end":1472.45,"speaker":"Fr Stephen De Young","text":"To him."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1472.85,"end":1474.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1474.69,"end":1475.97,"speaker":"Fr Stephen De Young","text":"When all is said and done."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1476.45,"end":1476.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1477.41,"end":1484.13,"speaker":"Fr Stephen De Young","text":"And. And this story, the same story, gets retold again by the prophet Isaiah and the prophet Ezekiel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1484.93,"end":1485.49,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1485.73,"end":1501.35,"speaker":"Fr Stephen De Young","text":"About the devil. But they both tell it in terms of the stories being told in surrounding nations surrounding. Surrounding Israel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1501.67,"end":1508.63,"speaker":"Fr Andrew Stephen Damick","text":"So they're. They're co opting what we would call pagan mythology. Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1508.71,"end":1510.95,"speaker":"Fr Stephen De Young","text":"Right there. Or correcting it."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1511.19,"end":1511.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1511.75,"end":1512.95,"speaker":"Fr Stephen De Young","text":"Saying, here's your story."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1513.7,"end":1513.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1513.9,"end":1530.02,"speaker":"Fr Stephen De Young","text":"Here's the truth. And so for the prophet Isaiah speaking to Babylon, that takes place in Isaiah 14. Do you want to read that section, verses three through 21?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1530.34,"end":1702.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. It's kind of longish, but let's go ahead and roll through it. I'm looking at the King James version here, so if there's any translation problems, let me know. And it shall come to pass in the day that the Lord shall give thee rest. From thy sorrow and from th fear and from the hard bondage wherein thou wast made to serve. Thou shalt take up this proverb against the king of Babylon and say, how hath the oppressor ceased, the golden city ceased? The Lord hath broken the staff of the wicked and the scepter of the rulers. He who smote the people in wrath with a continual stroke. He that ruled the nations in anger is persecuted and none hindereth. The whole earth is at rest and is quiet. They break forth into singing. Yea, the fir trees rejoice at thee and the cedars of Lebanon saying, since thou art laid down, no feller is come up against us. Hell from beneath is moved for thee. To meet thee at thy coming. It stirreth up the dead for thee. Even all the chief ones of the earth. It hath raised up from their thrones all the kings of the nations. All they shall speak and say unto thee. Art thou also become weak as we art, thou become like unto us. Thy pomp is brought down to the grave and the noise of thy vials. The worm is spread under thee, and the worms cover thee. How art thou fallen from heaven, O Lucifer, son of the morning? How art thou cut down to the ground which didst weaken the nations? For thou hast said in thy heart. I will ascend into heaven. I will exalt my throne above the stars of God. I will sit also upon the mount of the congregation in the sides of the north. I will ascend above the heights of the clouds. I will be like the most High. Yet thou shalt be brought down to hell to the sides of the pit. They that see thee shall narrowly look upon thee and consider thee saying, is this the man that made the earth to tremble? That did shake kingdoms, that made the world as a wilderness and destroyed the cities thereof. That opened not the house of his prisoners? All the kings of the nations, even all of them, lie in glory, every one in his own house. But thou art cast out of thy grave like an abominable branch. And as the raiment of those that are slain thrust through with a sword that go down to the stones of the pit as a carcass trodden under feet, Thou shalt not be joined with them in burial. Because thou has destroyed thy land and slain thy people. The seed of evildoers shall never be renowned. Prepare slaughter for his children, for the iniquity of their fathers. That they do not rise, nor possess the land, nor fill the face of the world with cities. It's kind of a long Passage. But I think it's worth, you know, rolling. Rolling through it, actually. But yeah, I mean, it just. It's interesting just to read it. If you didn't know that this is essentially a repeat of the Genesis 3 story, then you kind of wonder what's going on here or when this is talking, what it's talking about, you know."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1703.85,"end":1745.6,"speaker":"Fr Stephen De Young","text":"Right. But you have this repeated language of being brought down to the maggots and worms, which are, of course, representative of death. You know, that he's brought down to shield laid on a bag of maggots and worms in verse 11. And it's I. This. I idea of this fall. Of course, probably the most famous part of this is since you read the King James, it had the name inserted into it. It's interesting to me how many modern orthodox authors have adopted the idea that. That the devil fell was Lucifer."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1746.24,"end":1746.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1746.8,"end":1750.24,"speaker":"Fr Stephen De Young","text":"This is. This is actually something St. Jerome came up with."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1750.96,"end":1751.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1753.6,"end":1823.76,"speaker":"Fr Stephen De Young","text":"In the fifth century. Now, he's. He's not wrong. What. What is actually there in the Hebrew is the. The name of this person is Helel ben Shakar is son of the morning star, which is where that sort of son of the morning comes from. But hell in the Hebrew most likely is actually a Hebraization of the name Enlil, who was the primary God of Old Babylon. Oh, so the. The Babylonian empire who shows up and takes Judah into captivity with Nebuchadnezzar, the one we're familiar with in the Old Testament is actually the Neo Babylonian empire, Old Babylon. Enlil was the chief of the gods and had been overthrown by Marduk, and Marduk was at this time the chief God. So. But Enlil had also been the subject of the succession myth. So Enlil had taken this place as the most high God by force and then was unseated by Marduk."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1824.71,"end":1825.19,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1825.19,"end":1847.91,"speaker":"Fr Stephen De Young","text":"And so Isaiah is deliberately playing with this story and correcting it to say that. That. No, you know, you. You tried to overthrow Yahweh, the true God, but you failed and were cast down to Sheol. Well, so when. When St. Jerome comes to this and is. Is looking for a name, he actually gets Lucifer from first Enoch."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1848.63,"end":1860.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting. So this is an importation. This is an importation from first Enoch that makes its way into the King James version of the bible."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1861.37,"end":1887.97,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. St. Jerome was a fair fan of First Enoch to the point of apologizing for it, to the point of coming up with an elaborate explanation about Noah taking a copy on the ark with him to explain its provenance wow. But in. In. In first Enoch, the name of Azazel. The name of Azazel before he fell was Rema El, which means the light, bearer of God."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1888.93,"end":1889.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1890.69,"end":1912.7,"speaker":"Fr Stephen De Young","text":"Who carries light for God. Lucifer is pretty much a direct Latin translation of that. And so he translates it Lucifer, son of the morning, to bring in the Ben Shakar. But Helel is. Is not really the basis for Lucifer. He's going through tradition to get."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1912.7,"end":1913.58,"speaker":"Fr Andrew Stephen Damick","text":"That's interesting."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1914.78,"end":1987.2,"speaker":"Fr Stephen De Young","text":"So, and then the. We won't read the whole story, but Ezekiel in chapter 28 tells it. In verses 1 through 10 of that chapter, he gives a prophecy against the Prince of Ty. And if you read it, it's very clear. He's talking about the human king. And then he gives a prophecy about the king of tyranny who would outrank him. And it's about the King of Tyre that he says mountain, that he stood among the. The blazing stones, and then talks about him being cast down to the underworld, which is, again, the same story of sort of a failed insurrection attached to Eden, which helps us with the connection to Genesis 3. But this is also formed around the story of Baal. Baal, likewise, as we mentioned, had this succession myth where he overthrew the most power. And then in the BAAL cycle, after doing that, he decides to go down to the underworld and build his palace there just of his own accord. Whereas in Ezekiel's version, in the correct version, he fails and is cast down into the underworld. And that is sort of the last little he is allowed to have."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":1988,"end":2004.54,"speaker":"Fr Andrew Stephen Damick","text":"Huh. Wow. So, all right, well, we've gone about a half an hour, so we're going to go ahead and take a break. And when we come back, we are going to talk about the next fall of angels that we want to discuss. So let's go ahead and go. To break."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2007.5,"end":2012.7,"speaker":"Fr Stephen De Young","text":"The ancient faith for the modern world. This is Ancient Faith Radio."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2015.5,"end":2015.82,"speaker":"Fr Andrew Stephen Damick","text":"Fr."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2015.82,"end":2033.2,"speaker":"Announcer","text":"Andrew Stephen Damick and Father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2038.16,"end":2041.04,"speaker":"Mother Alexandra","text":"Here is Mother Alexandra of blessed memory."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2041.36,"end":2043.88,"speaker":"Fr Andrew Stephen Damick","text":"It seemed to me that in this."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2043.88,"end":2046.48,"speaker":"Fr Stephen De Young","text":"Modern life of ours, where everything has."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2046.48,"end":2057.63,"speaker":"Fr Andrew Stephen Damick","text":"Become so frightfully materialistic, there is a very great need of transfiguration, of a change of our attitude, of our way."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2057.63,"end":2065.55,"speaker":"Fr Stephen De Young","text":"Of thinking, our way of behaving, our way of holding ourselves. Everything needs a new Christianization."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2065.79,"end":2069.63,"speaker":"Fr Andrew Stephen Damick","text":"We must become more aware of the Christ within us."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2070.27,"end":2125.74,"speaker":"Mother Alexandra","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the church as expressed in her theology, hymnography and iconography. For those who long to become better acquainted with these holy servants of God and to understand their role in our lives, this book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com we're."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2125.74,"end":2141.48,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2145.08,"end":2210.04,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, welcome back. This is the second part of the show, and it's where we begin to take your calls. You can reach us at 855 AF radio. That's 855-237-2346. And you can also send questions to our chat room. But we would especially love to hear your voices. So, you know, just to recap a little bit, we talked about the fall of the devil becoming the Lord of the dead. And it's interesting to me that when you look at the biblical narratives, while you do get occasionally this language of being cast down, the thing that and I think we'll see this as we proceed through these different five different events is that what's really happening is actually it's five rebellions or five apostasies even. Right. You know, there is this language of being cast down, but it's not necessarily just like a moral fall in the sense of like, oh, well, I guess that angel sinned. He's a demon now, you know. Right. That's not what we're talking about, is it?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2211.89,"end":2234.05,"speaker":"Fr Stephen De Young","text":"Right. It's not that all the feathers fell out of their wings and they turned into bat wings and grew hooves and a tail. Yeah. And, you know, as we talked about, there are different types of angels, and when those angels rebel against their creator, they turned into different types of evil spirits."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2234.69,"end":2235.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2236.05,"end":2267.17,"speaker":"Fr Stephen De Young","text":"That I mean, they have a there's there are certain commonalities, as we said, that they're going to attack God's creation, chiefly humanity, and try to destroy God's creation, chiefly humanity, out of their anger and rebellion toward their Creator. But they're not all going to do it the same way. And I'll go ahead and mention here, I think we've mentioned it before, but there's not like a hierarchy, right. Like, we just talked about the Devil. It's not like the Devil's the boss."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2267.73,"end":2268.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2268.37,"end":2310.29,"speaker":"Fr Stephen De Young","text":"All the other demons, right. And they all work for him and they have some. Some kind of authority structure. Right. We, we tend to, at least in popular culture, turn the demons in hell into whatever we think is bad. So if you're, if you're John Milton and you're a Puritan, it's a kingdom for sure, right. And the Devil's a king and he has all his courtiers and everything in this rag structure, this hierarchy. If you're in C.S. lewis's day, the worst thing you can think of is bureaucracy. So hell becomes this big bureaucracy full of middle managers and interoffice memos. That's got to be what hell is."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2311.33,"end":2311.73,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2312.13,"end":2327.58,"speaker":"Fr Stephen De Young","text":"But, but the spirits of chaos and lawlessness and destruction, so that, you know, hierarchy is a good thing. So they don't have one. Right. They're trying to destroy hierarchy and creation."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2327.98,"end":2340.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So before we get to this next apostasy that we're going to talk about, we actually have Bob from North Carolina calling in. So. Bob, are you there? Can you hear us?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2340.94,"end":2342.54,"speaker":"Mihaly","text":"Yes, yes, I'm here."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2343.18,"end":2345.74,"speaker":"Fr Andrew Stephen Damick","text":"Welcome, Bob. What is your question for us this evening?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2347.83,"end":2363.27,"speaker":"Mihaly","text":"I've always wondered what gave Lucifer, Satan, the idea that he would actually be able to conquer the supreme omnipotent being? Where did he get that idea?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2365.11,"end":2373.74,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that's a good question. So, Father Stephen, how does the Devil think that he can actually win this fight? Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2373.74,"end":2471.07,"speaker":"Fr Stephen De Young","text":"Well, right. And that's. That's part of. That's part of what we were saying before in terms of the sense that, you know, if this is. If this is a fist fight, obviously he. He doesn't have a chance. Right? That's. There's not a. There, there's not a. There's too much of a power disparity here for him to do that. But in terms of leading humans who are God's creat creation, leading them to their destruction, that he can do. So it's not a war of conquest, it's a war of attrition. It's an anger. We didn't really mention this in terms of the Devil, but what the fathers tell us. For example, I know I've quoted St. Andrew of Caesarea on this before, but he said that after the Devil fell through envy and that's envy of humanity, because humanity was created for this destiny in Christ, right, that angels don't have, that the Devil didn't have. And so that anger and resentment led him to try to destroy humanity. And so for him, there's no way in terms of unseating God or taking over the universe or avoiding his fate at the last judgment, do as much damage as he can in that time. That's why, you know, St. Peter says the Devil prowls about like a roaring lion seeking someone to devour. Right. He knows his time is short, and so he's trying to do all the damage and destruction that he rid of his creator."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2471.47,"end":2614.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And, you know, the thing that I would add is that this idea that a demon could overthrow the most high God is pure propaganda. Like, he knows that that's not actually possible. Right. This appears in these other myths, but it's not actually a thing that the demons think that they can accomplish. So as Father Stephen was saying, that instead they attack us in particular. And I think that that's a really important point to make, not just in terms of what does the Devil think he can actually accomplish by doing this, but rather understanding where we fit into the story that, as Father Stephen said, we often look at Genesis and we see it as being a story about mankind. And that is true. But the truth is that there is another story going on, and that is the story of these angelic rebellions and what happens with mankind falling into sin. We're going to talk about this, obviously, a lot more when we talk about the various falls of mankind. But what happens is that man is joining in an existing rebellion, and that's the rebellion of these demonic powers. Right? And to think that the fall of everything hinges entirely on what Adam and Eve do is not to see the whole story and not even to realize that it's actually not even chapter one of the story of rebellion, that there's an ongoing rebellion and mankind is joining in with it. And that explains, of course, why it is when we act like demons and rebel against God, then we become more and more like them. We're joining their side. And just to wrap up what I'm saying here, at the beginning of the orthodox baptismal service, there is what is called in Greek the apotaxis and syndaxis, which means basically the desertion, or, you know, the desertion and the pledging of allegiance, I guess, you know, the alignment. And, you know, it's where the person says that they're repudiating Satan and, you Know everything that he does. And saying, you know, now I align myself with Christ. So the idea is you're leaving that rebellion and you're joining yourself now with the one who created, created you, with the one who loves you, with the one who wants to make you like himself. So does that make sense, Bob?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2615.09,"end":2621.81,"speaker":"Mihaly","text":"Yes, it does. Seems like basically Satan was pure spite."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2623.49,"end":2645.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Envy. Envy, absolutely. Thank you very much for that call, Bob. Great. I'm glad that answered your question. All right, so Father Stephen, let's talk about the next apostasy or fall of angelic beings. What do we got next? What else? As we're taking this litany of bad stuff."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2647.47,"end":2733.9,"speaker":"Fr Stephen De Young","text":"Horrible things. Well, this one also has a corresponding pagan narrative in the surrounding cultures. And this is a narrative that we find in things like the Sumerian kings list and the story of the Apkallu or the story of the seven sages in the Sumerian kings list. And this is true in Sumerian and early Akkadian religion. They believed that this story that when humanity was first created, they lived in the these of the gods. But then at a certain point, the gods became angry at them and exprom from those cities. And so humanity had to go and build their own cities. Right. And we sort of see this in what happens with Kane. Right. Kane goes and builds the first city and he even the name of this, from these other stories we're told that Cain names the city after the son of his son, after his grandson Irad. And the belief, the Mesopotamian belief, was that the first city was Eridu. It's linguistically the same, the same name."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2734.22,"end":2735.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2735.9,"end":2778.91,"speaker":"Fr Stephen De Young","text":"So and then in the, the pagan version of the story, the gods then give kingship to as a gift, the other gods, not the most high God who threw them out of the cities. And the way it says is that the kingship comes and is given to them. You may notice with both this one we talked about that the most beginning is always cast as wicked and evil over against the new gods who have shown up."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2779.31,"end":2780.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2780.35,"end":2782.67,"speaker":"Fr Stephen De Young","text":"Who are humanities back."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2782.99,"end":2783.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2783.55,"end":2787.47,"speaker":"Fr Stephen De Young","text":"And are now going to do something to favor them."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2787.63,"end":2788.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2789.87,"end":2816.6,"speaker":"Fr Stephen De Young","text":"This narrative is a side note when you take the pagan narrative and apply the scriptures to it, rather than seeing scriptures as correcting the pagan narrative. But you fit, you end up with, well, there's this Old Testament most high God who's bad and then there's this new God who shows up in the New Testament and takes over."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2817.48,"end":2818.32,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2818.32,"end":2879.56,"speaker":"Fr Stephen De Young","text":"So they've sort of, sort of wedged it in, wedged it in There. But in this comes down from heaven, there's a narrative before the flood and then after the flood. And before the flood, that's the time of the seven sages, the Apkallu, who, the first of which comes out of the sea and things has an apkalu, has one of these lesser gods who's advising him. And because of this advisor, the king is able to create astrology, technology, all of these things based on this knowledge that he's given from these spirits. After the flood, the kings who are listed are said to be 2/3 APKALLU and one third human. So after the blood, there's. So what's supposed to be hybridized?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2880.12,"end":2886.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, how do you be two thirds of something that doesn't work out in terms of."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2886.68,"end":2931.34,"speaker":"Fr Stephen De Young","text":"Well, we'll get to that in a second. But there's a way it works out. But, but, and then, and then based on these stories, it was very common for various cultures to claim as part of their right of kingship when they would establish an empire or conquer territory, to claim that they had access to these lost secrets from before the flood that were imparted by these beings. The most famous one of those groups is probably the Amuru. And the most famous Amuru, they came in conquer from the west and conquered Mesopotamia. Amuru actually means Westerners. They came from what's now Syria and conquered Mesopotamia. Mesopotamia."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2931.5,"end":2932.14,"speaker":"Fr Andrew Stephen Damick","text":"Interesting."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2932.94,"end":2935.9,"speaker":"Fr Stephen De Young","text":"And the most famous one of those is probably Hammurabi."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2936.62,"end":2940.14,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah, right, the code guy."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2941.26,"end":2949.1,"speaker":"Fr Stephen De Young","text":"Right. And these are the same folks who are called Amorites in the, in the Torah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2949.5,"end":2950.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, oh yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2952.14,"end":2987.74,"speaker":"Fr Stephen De Young","text":"The Amorites who. They're facing the Amorite kings who are among the ones who they're told to wipe out. These are the same people who claim to have this knowledge. So we get a version of this story then in 4 through 6, a correcting of the record or a defeating of propaganda where you see Cain's line laid out. Cain founds the first city. The major figures in Cain's line who are named, it talks about the, the technological innovations that they produced."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2988.14,"end":2988.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":2990.62,"end":3001.66,"speaker":"Fr Stephen De Young","text":"Weapons of war, all of these things. So this idea is that these. Yes, these spirits gave technology demand, but it was not to benefit man. They were giving man technology that humanity wasn't ready for."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3002.38,"end":3002.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3003.42,"end":3004.54,"speaker":"Fr Stephen De Young","text":"Enjoying themselves."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3004.94,"end":3111.69,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this, this same story is played out in, in multiple other ancient mythologies. Right. So you know, the one that probably most of our listeners are familiar with is Greek mythology. And you've got the story of Prometheus, right. Who gives fire from the gods to mankind. But of course, in that story, it's depicted as Prometheus. It's correct in the sense that Prometheus is sort of rebelling. He's doing something he's not supposed to be doing, but it's presented as positive. Like, look at this wonderful gift that he gave mankind. But the problem, of course, is that, again, it's propaganda, right? This is these demons saying, look at all the good things that we gave you. Why don't you just go ahead and bow down and worship us? And you think about that. Isn't that the same thing that's happening when Christ is tempted by the devil, that the devil offers him stuff, look what I'll do for you if you just bow down and worship me. And. And even in our own lives, right? There's this promise of being great, being smart, being beautiful, being popular, being wealthy, being prestigious, if only you would serve whatever it is that you're being asked to serve. So it's a trick, as you said, it's for their destruction. Notice who this technology is given to. It's given to Cain, the first murderer, and to his, you know, his descendants. But the problem, of course, is, like, you look at this stuff and you're like, well, what's so wrong with, like, ironworking and with music and like, what's wrong with that stuff."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3114.17,"end":3208.27,"speaker":"Fr Stephen De Young","text":"Right? And it gets expanded first Enoch and the Book of Jubilees, you know, to include, you know, all kinds of things in terms of pharmaceuticals and sorcery and means of seduction of the. The opposite sex. And. But, but even if we're just talking about raw technology, again, it's not that it's evil any more than the tree of knowledge of good evil in and of itself, but it was wisdom for which humanity wasn't ready to use it appropriately, right? And so it comes to these men, as I'm giving you this knowledge, so that you can use it to gain power, to conquer your neighbors, to set yourself up as a king, to. To seduce members of the opposite sex so you'll have this power and wealth and authority, and that's what humanity uses it for, right? So from the pagan perspective, kingship, these kings are these glorious beings. From the. The perspective of scripture, they're these. These wicked beings who are destroying themselves at each other and the world around them. And that culminates in. In Genesis 6:1 through 4 with this story of the sons of God going into the daughters of men and having these children who are described as Nephilim, as giants. And we'll undoubtedly do a whole episode just Talking about giants."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3208.27,"end":3239.25,"speaker":"Fr Andrew Stephen Damick","text":"But oh yeah, there is going to be a giants episode. I know a lot of people are so ready for that and. Well you should be. But it's such a big topic. It's such a big topic. I know we actually had one person that emailed us and said stop saying you're going to cover something in a future episode. But the problem is it's such a, the stuff we're talking about branches so much that we have to constantly limit it and say, well, we're not going to go there yet. Eventually we will."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3239.25,"end":3242.71,"speaker":"Fr Stephen De Young","text":"We have to keep, we have to keep teasing. We have to tease future."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3242.95,"end":3246.15,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Because we want people to come back. Yeah, exactly."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3246.23,"end":3272.24,"speaker":"Fr Stephen De Young","text":"But so for our purposes, for our purposes tonight. Right, right. We get a hint into what this means. Right. Like we have angelic beings procreating with humans. Right. And, and of course in the, the pagan stories we have these people who are 2/3 divine, being one third human or, or demigods."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3272.32,"end":3273,"speaker":"Fr Andrew Stephen Damick","text":"Demigods."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3273,"end":3279,"speaker":"Fr Stephen De Young","text":"Right, right, right. And, and we see that in, in like in the Greek traditions, you know, Hercules being a prime."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3279,"end":3280.32,"speaker":"Fr Andrew Stephen Damick","text":"Hercules. Yep."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3281.04,"end":3292.4,"speaker":"Fr Stephen De Young","text":"These, these Nephilim, these men of, of renown. Gilgamesh is another one of them. We get a clue and they sort of. Exactly what's going on actually in Deuteronomy 3, verse 11."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3293.38,"end":3293.7,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3293.7,"end":3300.1,"speaker":"Fr Stephen De Young","text":"In a verse that no one has cross stitched above their door. I guarantee it."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3301.54,"end":3305.22,"speaker":"Fr Andrew Stephen Damick","text":"This is not anybody's life verse. No."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3305.7,"end":3313.06,"speaker":"Fr Stephen De Young","text":"No one has made this a theme for a retreat. Even I have not yet. Although now I take it as a challenge."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3313.3,"end":3314.02,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3314.02,"end":3319.7,"speaker":"Fr Stephen De Young","text":"Take it as a challenge now. But Deuteronomy 3, verse 11 describes OG's bed."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3320.46,"end":3320.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3320.7,"end":3344.7,"speaker":"Fr Stephen De Young","text":"OG is the king of Bashan, which we'll talk about more. He's the last of the Rephaim, which we'll also talk about. That's when we talk about giants. But it gives this description of this bronze bed of unusual size. It gives the measurement and you know, it's basically a 15 foot tall person."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3345.66,"end":3384.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Do you mind if I read this one? And I'm again looking, I'm looking of course again at the King James, which for all of its problems is still probably my favorite bible. So Deuteronomy 3, 11. For only OG, king of Bashan remained of the remnant of giants. Behold, his bedstead was a bedstead of iron, is it not in Rabbath of the children of Ammon, nine cubits was the length thereof and four cubits the breadth of it, after the cubit of a man. So as you said, about 15ft. Right. Nine cubits is about 15ft. I mean, nobody's got a cubit bouler in their house."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3384.91,"end":3420.28,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, well. And the size of a cubit varied the same way the size of a foot used to, because it was the measurement from the end of your middle finger to your elbow. Oh, but that varies a lot on different size humans. Right. It was usually the king's cubit. But, you know, it's. It's hard to tell sometimes in the text exactly how big, but roughly. And, and so basically this first tells us about this giant bed, this giant metal bed. Right. And that it's on display somewhere where you could go look at it."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3420.44,"end":3423.56,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Is it not there? Yeah, yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3423.56,"end":3547,"speaker":"Fr Stephen De Young","text":"And it. And people kind of skim over it, go, okay, he had a big bed. Right. But here's where this becomes important. When the. The Ziggurat of Edom and Nanki was excavated in Babylon, they found a bed with exactly these dimensions, a metal bed with exactly these dimensions in the temple. And this bed was a ritual bed that was used for pagan ritual. There was a time of the year, there was a festival where the king would go into the temple, he would be indwelt by the spirit of the God of the temple, and he would fornicate with one of the temple prostitutes to. In a. In a ritual act, a pagan ritual act that would ensure fertility and prosperity for the city in the future. But the future king was often conceived in this manner. The idea behind pointing out that this is Og's bed is telling us about something about his origin and the origin of giants in general. So a future king conceived in this way would have two fathers, the king and the God who the king was embodying. And one mother, Right. Who is the. The woman in the temple. And so the king was considered to be a God. The God they were worshiping was considered to be a God, and the woman was a human. So you end up with 2/3 1, 2/3 man. And that's how that works."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3547.48,"end":3562.36,"speaker":"Fr Andrew Stephen Damick","text":"You know, I'm suddenly thinking of. That was. What was that movie? Was it Twins? Was that the film that had two fathers? No, I don't know. I'm blanking on that. Anyways, clearly not about Nephilim."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3565.68,"end":3566.72,"speaker":"Fr Stephen De Young","text":"The TV show was."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3567.68,"end":3578.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, My Two Dads was Three Minute a baby. Yeah, Three minute. Not. Not about Nephilim. But now, listeners, you've got all kinds of great jokes to make that your friends are not going to get at all. So enjoy."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3579.92,"end":3602.77,"speaker":"Fr Stephen De Young","text":"Right? And so this is. This is what we're talking about. It's this, this demonic ritual origin to involve evil spiritual powers and human kings that is producing these quote unquote heroes of old. That's what we're talking about. We're talking about giants and Nephilim."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3603.17,"end":3603.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3604.05,"end":3613.01,"speaker":"Fr Stephen De Young","text":"In short form. But the, the spiritual beings involved in this then are spiritual beings who are obviously by doing this are entering into rebellion."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3613.33,"end":3613.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3613.65,"end":3618.37,"speaker":"Fr Stephen De Young","text":"Who are then, then punished first and second Peter and in St. Jude's Epistle."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3618.53,"end":3619.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3620.36,"end":3626.2,"speaker":"Fr Stephen De Young","text":"But are picking up on things that are already there in Jewish literature, preserving these traditions."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3627.64,"end":3639.08,"speaker":"Fr Andrew Stephen Damick","text":"So that's. The apostasy is leading mankind astray by giving him knowledge that he's not ready for that's going to lead him into destruction."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3639.56,"end":3651.63,"speaker":"Fr Stephen De Young","text":"Right. And that culminates in this sort of combination of sexual immorality and wickedness that humans are led into by these spirits."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3652.19,"end":3679.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, well, let's talk about the third fall or apostasy of demons. And, and this one's. Boy, I mean, looking at the notes here and it's just this amazing list. But yeah, let's, let's talk about that. So this is, this is, you know, we've got this listed as what they call the origin of demons. Right. Although, like, why would we say that? Haven't we been talking about demons the whole time? Like what, what makes this distinct?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3681.01,"end":3686.77,"speaker":"Fr Stephen De Young","text":"Right. Well, the origin of the demons that we read about in the Synoptic Gospels."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3687.33,"end":3706.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. So the demons that we meet at like for instance, the, the, the exorcism that happens with Legion, you know, into the pigs. Or, or what about, what about the, the, the, the spirit that's in the, the fortune telling woman that St. Paul gets. So Ann, it. Is that, Is that one of these people? Yeah. In Book of Acts."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3706.31,"end":3711.79,"speaker":"Fr Stephen De Young","text":"Yeah, Book of Acts. Same kind of thing that we see in Saul. The unclean spirit who comes to trouble. King Saul."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3712.35,"end":3712.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3713.47,"end":3752.58,"speaker":"Fr Stephen De Young","text":"The demonic spirit in the book of Tobit who appears there. There are these. That we've been talking about sort of fallen angelic beings. And even though there's at least one person who hates when we say this, we're talk bodies later. We talked, we mentioned it last week that angels do have a, A sort of body. It's just very different than ours. Yeah, but there are these demonic spirits who are bodiless because they come in or they go into idols and use idols as body."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3753.78,"end":3754.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3754.66,"end":3765.09,"speaker":"Fr Stephen De Young","text":"These bodiless beings. And so the short version of where they come from is the, the guys, we were just talking about the nephilim die."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3765.89,"end":3766.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3766.41,"end":3775.09,"speaker":"Fr Stephen De Young","text":"And their spirits leave their bodies and a portion of them become these spirits."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3775.81,"end":3793.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. So. So in this case, we're talking about spiritual beings who have. They fell when they led man astray. But then there's another. Another event that involves these same beings. Right? Is that what you're saying?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3793.99,"end":3797.99,"speaker":"Fr Stephen De Young","text":"These are the spawn, the spiritual spawn."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3798.39,"end":3799.07,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3799.07,"end":3800.51,"speaker":"Fr Stephen De Young","text":"Those beings which."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3800.51,"end":3806.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so are we talking about actual reproduction or what do we mean?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3806.91,"end":3809.27,"speaker":"Fr Stephen De Young","text":"We're talking about the product of this ritual."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3809.99,"end":3810.51,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3810.51,"end":3815.42,"speaker":"Fr Stephen De Young","text":"Right. We're talking the product of the. We. We aren't told how it all works. Right?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3815.42,"end":3816.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3816.06,"end":3821.14,"speaker":"Fr Stephen De Young","text":"There isn't dn. There isn't DNA, or at least knowledge of DNA in the ancient world. Right?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3821.14,"end":3821.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3821.9,"end":3914.63,"speaker":"Fr Stephen De Young","text":"So we have to sort of take what we have and this is sort of put in narrative form. For example, in the Book of Jubilees, where when these spirits, you know, the flood wipes out a lot. And we read in Scripture that the descendants of Abraham leading up to David wipe out the rest of the Nephilim, these giants. And it's named Mastema, in the Book of Jubilees, goes to God to cut a deal and says, sort of similar to what we saw St. Gregory talking about again. He says, well, if you allow some of us to remain in the world. World. And don't throw us all into the abyss. Right. Which is where the previous spirits were in prison. Says, if you don't throw us into the abyss, if you let us remain in the world until the last judgment, we will afflict the wicked sort of on your behalf. We'll go and we'll afflict the wicked. And you could use that to bring them to repentance. They kind of cut this deal. We'll only hurt bad people. And so in the Book of Jubilees, God sort of agrees that use the evil spirits the way St. Gregory talked about, even though they mean it for evil, God uses it for good. But this. This idea, even though we don't see it explicitly laid out in the Scriptures, is sort of resident all the way through. Right. Why are they unclean spirits? What makes them unclean? Not evil, but unclean."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3914.87,"end":3917.07,"speaker":"Fr Andrew Stephen Damick","text":"Why? Yeah, why would they be described that."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3917.07,"end":3939.23,"speaker":"Fr Stephen De Young","text":"Way in the Torah, when something is unclean, the easiest way to get unclean is for it to be mixed. Mixed? You mix two types of cloth, you plant two different things in the same field. You mix meat and dairy products. And so I won't use the word that the Dead Sea Scrolls use for these demons, but it refers to them being illegitimate."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3939.95,"end":3940.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3940.59,"end":3941.31,"speaker":"Fr Stephen De Young","text":"In birth."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3941.87,"end":3942.59,"speaker":"Fr Andrew Stephen Damick","text":"Interesting."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3944.35,"end":3960.61,"speaker":"Fr Stephen De Young","text":"And so that idea of their uncleanness, that that's how they're identified in the Old Testament. And then when they speak in the New Testament Testament, you know, we see them say to Christ, you know, have you come to trouble us before the time? Right. We. We still have some time left."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3960.93,"end":3961.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3961.29,"end":3963.25,"speaker":"Fr Stephen De Young","text":"Why are you coming here to throw us into the abyss now?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3965.25,"end":3966.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When is the time?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3967.33,"end":3979.39,"speaker":"Fr Stephen De Young","text":"Right. And so this is. This is reflected, right? It lays underneath. It's part of the tradition that lays underneath the scriptures. Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":3979.39,"end":4273.68,"speaker":"Fr Andrew Stephen Damick","text":"And I think that it's really important to underline at this point what exactly this has to do with us, because this, I think, is one of the sort of apostasies that we should pay attention to the most. Because the truth is that we do still have demons in the world. They are still functioning in the world, and they are here with God's permission, obviously, because if they didn't have his permission, they wouldn't be here. Right. And, you know, as you said, there was this deal struck that they said that they would only afflict the wicked and God permits them to stay and afflict. But, you know, one of the questions that some people might ask then is like, well, wait a minute, I'm not one of the wicked, and yet I'm having these problems. You know, I'm being afflicted by a demon. And I think that the way to understand that is that God, of course, knows full well, because he created all of us, that human repentance does not happen when we are comfortable. Right? And it just doesn't. We have kind of no reason to repent if we're comfortable. You know, there has to be a struggle, right? And so one of the ways that the struggle comes to us is through demonic affliction. Now, the demons have their own agenda. They are in this because they want to draw us away from God. And certainly sometimes you see, when people are afflicted by demons, they do of their own accord. They are drawn away from God. They enter into that rebellion. They join in the rebellion. But temptation also is actually valuable to the saint. So even the righteous person, because he's still, you know, there's still some part of his will that isn't totally aligned with God. He can use that as an opportunity to repent even more. Right. You know, demonic affliction is an opportunity to repent. And it's not only people that we think of as bad sinners, but it's all of us. All of us have this opportunity to repent. And you and I were talking about this a little bit a Few months ago when we were on Father Thomas Sirocha's show Ancient Faith Today, where he asked the question, you know, is the coronavirus a judgment from God? Right. And, you know, which is a lot of people are saying that. Actually, we just saw a, A, A survey, survey results today. I think it was from the Pew research people saying that something like a third of Americans believe that there's a lesson from God in the virus. And I think probably a lot of them think, well, God is doing this to us, like he's afflicting us with this suffering because we did something bad. And that's only kind of partly right. We do need to repent of our evil. But it's not, not God who sends out plagues in the sense of, like, that he's directly afflicting us. It's, you know, wherever you see especially mass suffering like this, there's demonic activity going on. And we do have an opportunity to repent. We see it over and over again in scripture, where a disaster befalls the people of God, whether it's disease or invasion or calamity, you know, earthquakes or whatever, and it becomes an opportunity for them to repent, so to turn back to God. So, I mean, this is one of the ways that we understand evil in the world. If we do not remember that there are demonic powers out there, then we can think, well, all the evil in the world is either mankind doing it and why doesn't God just stop them? Or even worse, it's God doing this to us. But we forget that there is this other force out there that is functioning with God's permission, but he's not attacking us, right? He's allowing them so that we can repent because he knows that we need it. So I don't know, I just wanted to kind of add that as a way of really connecting this directly to our own lives. And I'll say this, as I came to understand this better, I came to see it as being liberating, actually, because a lot of times when bad things happen to good people, right? This big question of theodicy. Why do bad things happen to good people? People say, well, why? You know, is God mad at me? Or whatever? But no, I mean, that's probably not what's going on. There are spiritual forces at work. There are evil spiritual forces at work, but we have to use them as an opportunity. Suffering is an opportunity, actually doesn't mean we like suffering or seek it out, but it is an opportunity. It is absolutely an opportunity. So I just wanted to kind of underline that as something that's really directly pertinent to all of us and not just trying to understand, you know, demonology or whatever."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4276.16,"end":4285.93,"speaker":"Fr Stephen De Young","text":"St. Paul can say of an unrepentant sinner that he needs to be headed over to Satan for the destruction of his body and the salvation of his soul."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4286.73,"end":4302.41,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep. Yep. I mean, that means something, you know, so. All right. Well, why don't we go ahead and go to our second break and we will be back in just a moment."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4304.57,"end":4322.3,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4327.34,"end":4380.47,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, Prayer, Fasting and Almsgiving. Book's now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4384.95,"end":4401.11,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4404.39,"end":4512.02,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the third half of our show. Like you heard the voice of Steve right now right there. You can reach us at 855-AF-RADIO. That's 855-237-2346. And before we get to what we're the last two falls or apostasies of angelic beings, I just wanted to let you guys know that, you know, normally, of course, we are on the second and fourth Thursdays of the month at 7 o' clock Eastern, 4 o' clock Pacific. So you're hearing us tonight and you'll hear us again in two weeks on the 22nd of October. But we have a special bonus episode on October 29th. It is our Halloween special So, so tune in for that. You're going to find it really fascinating. It's titled the Real Demons of Halloween. As you know, we talk about demons a lot, but we are doing a special bonus episode on October 29th for Halloween. I'm not going to give too many spoilers for that, but just wanted to make sure you put that on your calendars because it's a little about outside of our normal schedule. All right, let's move on to our next apostasy or fall of demons. And this has to do with one of my favorite accounts in the Old Testament, and that is the Tower of Babel. Right, the Tower of Babel, which. It's one of the most wonderfully depicted things, I think in Christian art. You see these massive, massive towers and it's depicted in lots of different ways. Sometimes you get something that looks kind of like the Leaning Tower of Pisa. Other times you see something that looks more like a pyramid. So what's going on in this one?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4513.94,"end":4700.61,"speaker":"Fr Stephen De Young","text":"Right. Well, this one also we have again a pagan narrative. The Other Nation is being corrected by Genesis chapter 11. And I won't read these, but if you, if you really want to nerd out, it's in the public domain online. And that's Plato actually gives, gives an account of this in two places. In the Critias B through D and in his on the laws 7, 13C through E. Okay. And what Plato is what he calls the age of Cronus, which is this earlier age when Cronus was the most high God and of course his son Zeus was the over the council of gods before things went badly between them. And in this, in this time, Cronus apportioned the world and the cities of the world to the various gods who were members of the council of gods. Okay, assigned them to their places. And Plato says that at first they guided them like good and faithful shepherds. And then things changed, started to demand sacrifice and appeasement. And this is not just a Greek thing. Greece was sort of the last ancient Near Eastern civilization. We're used to thinking of them as the first Western civilization, but in reality they're the last ancient Near Eastern one. And this is paralleled everywhere where you know, El, Baal's father, you know, appointed the 70 sons of El to rule over the 70 nations. This is, this is a commonplace and even socio sociologists will talk about this and anthropologists of religion that there's this period of time after the end of the Neolithic era where the idea of a most high God becomes very distant and. Yeah, and there are these sort of lesser gods who then become the object of worship and magic and ritual and, and all of these things. This is observable all over the world, really. And so it's this story and this narrative that the story of the Tower of Babel is really intending to correct. And this is another one where we have sort of a just so story attached to it where we think the problem was that these, these ancient humans were so dumb that they thought if they built a tall enough tower, they could get to where God was in heaven."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4700.85,"end":4701.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4703.33,"end":4709.81,"speaker":"Fr Stephen De Young","text":"And the biggest problem with that is that God then comes down and stops them. So that makes it sound like maybe they could have."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4710.53,"end":4710.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4711.41,"end":4723.33,"speaker":"Fr Stephen De Young","text":"Like if God hadn't stopped them, they would have actually built one that tall. Which of course is kind of silly. Right. But the reality is that the tower."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4723.33,"end":4723.65,"speaker":"Fr Andrew Stephen Damick","text":"Were."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4726.78,"end":4731.82,"speaker":"Fr Stephen De Young","text":"Which was ziggurat, like a pyramid, was a man made mountain."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4732.78,"end":4733.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4733.14,"end":4736.7,"speaker":"Fr Stephen De Young","text":"You were crafting the mountain of God yourself."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4737.42,"end":4737.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4739.34,"end":4755.27,"speaker":"Fr Stephen De Young","text":"And the, the name Babel, of course is, is related to Babylon, but it's the, the name for the city. And the name Babel comes from Babili in Babylonian, which means the gate of the gods."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4756.15,"end":4757.35,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4759.75,"end":4765.19,"speaker":"Fr Stephen De Young","text":"And this, this wasn't the gate for humans to get to the gods. This was the gate through which the gods came."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4765.59,"end":4767.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, that's so."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4767.43,"end":4768.39,"speaker":"Fr Stephen De Young","text":"So the idea was."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4768.39,"end":4768.87,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4769.43,"end":4769.91,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4769.91,"end":4780.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I was gonna say, like I suddenly I think about that, that movie Stargate, you know. Oh, man. Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4780.29,"end":4782.45,"speaker":"Fr Stephen De Young","text":"What you build the gate isn't aliens."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4782.77,"end":4790.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I promise, not aliens. I'm not saying it was aliens, but it was demons."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4791.25,"end":4791.73,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4794.37,"end":4798.45,"speaker":"Fr Andrew Stephen Damick","text":"This is not the History Channel, people. Yeah. The."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4798.45,"end":4825.65,"speaker":"Fr Stephen De Young","text":"The idea is that you would, you would build this, that would bring the God down to dwell on your artificial mountain. And so once you had him there, dwelling particularly in the idol or responsible to care for him, but that also gave you the ability, the leverage to manipulate him and get him to do what you wanted."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4825.97,"end":4828.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Which is the whole point of idolatry."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4829.58,"end":4842.14,"speaker":"Fr Stephen De Young","text":"Right. And we see this. They of course, say that they want to ascend to heaven. But what does St. Paul say? He says, do not ask who will ascend. That is to bring God down."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4843.5,"end":4856.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, yeah. So he glosses this idea of ascending to heaven as actually attempting to kind of trap God via idolatry."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4858.25,"end":4859.13,"speaker":"Fr Stephen De Young","text":"The human level."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4859.61,"end":4860.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4860.33,"end":4874.29,"speaker":"Fr Stephen De Young","text":"And as with Yahweh, the most high God, the true God, the creator. And it's not that they would have succeeded, it's just. This is really wicked. Yeah, this is."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4874.29,"end":4875.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's the worst."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4876.97,"end":4890.67,"speaker":"Fr Stephen De Young","text":"This is a massive rebellion, Right. To attempt to try to control heaven. And so what we see is that God says, let us. He speaks to and says, let us go down."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4890.83,"end":4891.23,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4891.31,"end":4893.71,"speaker":"Fr Stephen De Young","text":"He says, you want me to come down? Come down."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4894.03,"end":4894.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4894.75,"end":4896.99,"speaker":"Fr Stephen De Young","text":"And when he comes down."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4898.83,"end":4899.23,"speaker":"Fr Andrew Stephen Damick","text":"He."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4899.39,"end":4911.08,"speaker":"Fr Stephen De Young","text":"He confuses the languages. Right. He separates. He separates out the nations and they go there. They go there from that one place."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4912.12,"end":4912.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4913.72,"end":4946.05,"speaker":"Fr Stephen De Young","text":"But this story is returned to in the book of Deuteronomy. In Deuteronomy chapter 32 comes back to this story of the tower of Babel. And so probably the most famous place is Deuteronomy 32, verse 8, which, when the Most High gave to the nations their inheritance, when he divided humanity, he fixed the borders of the peoples according to the number of the sons of God."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4946.69,"end":4948.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's an interesting phrase."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4950.53,"end":4954.61,"speaker":"Fr Stephen De Young","text":"Yeah. And that phrase will be different depending on what English translation you're looking at."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4954.93,"end":4955.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4955.33,"end":4969.55,"speaker":"Fr Stephen De Young","text":"Right. Because the. What's called the Masoretic text. Text, the medieval Hebrew text that's the basis for, like, the King James Version and most English Bibles has sons of Israel there."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4970.27,"end":4974.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like in the King James is his children of Israel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4975.39,"end":4980.99,"speaker":"Fr Stephen De Young","text":"Right. Which sort of makes no sense. Tribes of Israel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4981.47,"end":4984.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because this is. This is the nations. Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":4984.59,"end":5013.57,"speaker":"Fr Stephen De Young","text":"Right. There's 70 nations. Right. And there happened to be 70 sons of El in the divine council in the ancient world. Now, the Greek tradition understood what this meant because it says when he did it, he did it according to the number of his angels. Right. So they had the idea that the sons of God. They disambiguated it. That the sons of God here wasn't talking about people, it was talking about angelic being beings."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5013.97,"end":5014.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5015.17,"end":5031.01,"speaker":"Fr Stephen De Young","text":"And when we recovered the Dead Sea scrolls In the 1960s, the Deuteronomy scrolls, among the Dead Sea Scrolls, which are, of course, a thousand years older than our previous Hebrew texts, they have. Sons of God was revealed to be correct."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5031.49,"end":5031.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5032.93,"end":5059.33,"speaker":"Fr Stephen De Young","text":"And that. That had been kind of covered over by later rabbinic Judaism that was less comfortable with the phrase. And so there is a certain school within our more liberal Testament studies that wants to see this not as a variation on the ancient story, but as the ancient story."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5060.13,"end":5060.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5062.05,"end":5076.09,"speaker":"Fr Stephen De Young","text":"So they want to say that this is just taking the BAAL version of the story, and they want to interpret it as saying, well, Israel believed that Yahweh, the God of Israel, was just the one who was given Israel."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5077.05,"end":5077.53,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5078.81,"end":5084.73,"speaker":"Fr Stephen De Young","text":"Like he was a lesser member of the council. And then they must have had some version of the succession myth."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5085.21,"end":5086.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5086.09,"end":5102.76,"speaker":"Fr Stephen De Young","text":"No record of, of course, but they hypothesize. Yeah, the, the, the, the key to understanding that this is not true is if you flip back a little bit to Deuteronomy, chapter 4, verses 19 and 20."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5103.48,"end":5105,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which I have in front of me here."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5105.88,"end":5107.56,"speaker":"Fr Stephen De Young","text":"Okay, why don't you go ahead and read it then?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5107.64,"end":5133.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. Deuteronomy 4, 19, 20. Unless thou lift up thine eyes unto heaven, and when thou seest the sun and the moon and the stars, even all the host of heaven shouldst be driven to worship them and serve them, which the Lord thy God hath divided unto all nations under the whole heaven. But the Lord hath taken you and brought you forth out of the iron furnace, even out of Egypt, to be unto him a people of inheritance, as ye are this day."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5134.94,"end":5151.26,"speaker":"Fr Stephen De Young","text":"Right. So we see here very clearly, right, that it's Yahweh, the God of Israel who allotted the hosts of heaven to all the nations. And it's also Yahweh, the God of Israel who took Israel for himself."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5151.81,"end":5152.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5152.09,"end":5153.81,"speaker":"Fr Stephen De Young","text":"It was not assigned by someone else."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5154.21,"end":5154.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5154.61,"end":5199.85,"speaker":"Fr Stephen De Young","text":"So that's just within the pages of Deuteronomy. That idea is refuted, but the idea stands that this was done by Yahweh, the most high God in terms of the nations. So this is a punishment. This is a punishment in that it's, it's not that the most high God who was Cronus, other gods, these other places, and so it was right for them to worship them. This was because they tried to drag him down to the human level and manipulate him, responds and punishment by stepping back away from humanity, withdrawing from humanity."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5199.93,"end":5250.12,"speaker":"Fr Andrew Stephen Damick","text":"Which actually, I was gonna say, which actually is a merciful act. Right. Because to be sinful and be in the presence of God is to have that sin burned. Or, you know, as you, you actually had a recent blog post called Death by Holiness, right, which is this exact comet subject. And so God is stepping back from, from humanity to give him a chance to repent, to reform. Because if he stays in contact with them, if he does come down and stays with them, that's going to be bad because they're sinful. And so he allots them to these angelic beings. So how does that constitute an apostasy or a fall on the part of the sons of God, these angels?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5251.24,"end":5275.58,"speaker":"Fr Stephen De Young","text":"Right. Well, it's important, though, to emphasize what you just said, that the purpose was, was both to protect them. And the idea was that these angelic beings would serve the same way as the angelic beings who we talked about who. And the moon and the things of nature and the other things of the creation, they're just assigned to these nations."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5275.82,"end":5276.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5277.66,"end":5291.64,"speaker":"Fr Stephen De Young","text":"And. And St. Paul says in Acts 17, When. When St. Paul's speaking to pagans, this is what he talks. He talks of about the most high God who assigned everyone their place of life and their time of living."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5292.36,"end":5292.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5292.76,"end":5333.01,"speaker":"Fr Stephen De Young","text":"And that he did all this so that they would seek after him. So the intent was not that he didn't want any of the nations except for Israel, but that. That. That they were put away for their own good with the intent that they would return, that they would come and return to him. But what happens is described in Deuteronomy 32, the same chapter in verse 17. And that's. There are different English translations, but a lot of them obscure what's going on here. So it's usually translated, they sacrificed to demons that were not gods. To gods they had never known."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5333.81,"end":5334.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5334.29,"end":5346.41,"speaker":"Fr Stephen De Young","text":"To new gods that had come recently, whom your fathers had never dreaded. Now, there's an obvious problem in that translation because it's contradictory. They sacrificed demons that weren't gods to gods they had never known. So gods are not."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5347.45,"end":5356.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In the King James, it renders that they sacrificed unto devils not to God, to gods whom they knew not to new God. So that's consistent."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5357.93,"end":5395.57,"speaker":"Fr Stephen De Young","text":"That's better. Right, because it says Elohim. Right. So the God part is right. The. The word for demons here, though, is also interesting because it's a word that occurs nowhere else in the Bible. It's the. It's the word shedim. And it doesn't occur anywhere else in the Bible because it's not actually a Hebrew. They've put a Hebrew ending, plural ending on it. But shedu is a Babylonian word, and a shedu in Babylonian religion was the piece of territory. A territorial God or a territorial spirit."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5395.97,"end":5396.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5397.41,"end":5408.13,"speaker":"Fr Stephen De Young","text":"So this is really saying they. The territorial spirits, the spirits assigned to that piece of territory, to their land, not to God, to the most high God."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5408.69,"end":5470.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so the apostasy then, on the part of these beings is that they receive that worship that they say, that's. Yeah, we'll take that. Whereas, you know, if you meet an angel of God and you see man, you know, you see a person attempt to bow down, then they're like, no, hey, whoa, whoa, no, no, get up. You know, they don't. Yeah, exactly. We do not do this. You know, and clearly human beings are tempted to do that. You see a divine being, you're like, oh, better worship him. And, you know, that's one of the reasons that the fathers, especially some of the monastic fathers, they basically say that the good default thing to do if you see some kind of divine being is to make the sign of the cross and tell them to get out. Because an angel will be cool with that. If it's a demon, well, that's what you should be doing. Don't do the thing that you're tempted to do, which is to fall down before them."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5471.75,"end":5490.29,"speaker":"Fr Stephen De Young","text":"Right. And so then these experience the demons that St. Paul talks about when he talks about demons, but he says what the nation sacrifice, they sacrifice to demons. When he talks about powers and principalities and is that's these beings."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5490.53,"end":5501.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right. Well, any. Did you want to say anything else before we take another call on this particular apostasy?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5501.66,"end":5502.86,"speaker":"Fr Stephen De Young","text":"That's four out of five."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5503.18,"end":5517.26,"speaker":"Fr Andrew Stephen Damick","text":"That's four out of five. We're almost done. Okay, well, we have a call and this I think is coming from someone whom I know, in fact. So we have Mihaly calling in. And Mihaly, are you in North Carolina?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5518.62,"end":5523.5,"speaker":"Mihaly","text":"Yes, Father Andrew, I'm in Raleigh, North Carolina, and you definitely know me."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5525.98,"end":5537.66,"speaker":"Fr Andrew Stephen Damick","text":"So well. It is great to hear from you and to hear your voice, folks. This is my wife's godfather, so I am really glad to hear from you. Mihaly, it's been a long time. So what is your comment or your question for us this evening?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5538.22,"end":5585.36,"speaker":"Mihaly","text":"Okay, so my question is very simple. If the evil spirits could interact directly with the physical world, of course they could interact with humanity via the mind. They could influence people. But there are some indications they could also interact directly. Like for the evil spirit to speak with Eve, he must have created acoustic waves or maybe the pigs that went over the cliff when the devils went into them. So if that is so, in what measure? And could it be safe, for instance, that disease or a storm or something like that was produced by a naval spirit? That's very much my question."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5585.43,"end":5585.67,"speaker":"Fr Stephen De Young","text":"Question."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5586.15,"end":5595.03,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that's a good question. So, Father Stephen, why don't you. I have some ideas about that, but Father, why don't you. Why don't you comment on that first?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5596.39,"end":5622.02,"speaker":"Fr Stephen De Young","text":"Well, we have biblical examples of them doing that. So for example, with Job, who we're going to talk about some more here in a minute. Of course, anything that demonic spirits could do, they're only doing within God permitting them to do it. But they're permitted to. The demonic attack on Job includes the collapse of a building on top of his family."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5624.18,"end":5624.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5624.54,"end":5628.02,"speaker":"Fr Stephen De Young","text":"And. And it includes him getting boils."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5628.5,"end":5628.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5628.86,"end":5656.6,"speaker":"Fr Stephen De Young","text":"And disease and. And it includes these things. So that seems to make it clear that. That, yes, that can happen. And of course, there. There are plenty of stories in our tradition and in the lives of. Of the saints of demonic spirits interacting. The demon in Tobit kills several people. And so again, within God's restraining power, there are examples of that happening."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5657,"end":5721.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and even stuff that might be a little bit more subtle to us. You know, we talked about demons being involved with plague and certainly in the Apocalypse. Not to steal some of our thunder for maybe a later episode. Everybody but the Four Horsemen of the Apocalypse definitely release very physical experiences upon mankind. You know, pestilence and war and death, you know, and so. So, yeah, there is this direct interaction. And, you know, certainly people experience these things sometimes in their own homes. Right. Things being thrown around or shoved. You know, the kind of stuff that makes it into horror films. I mean, that's not unreal. Those things are real. Now, that doesn't mean that every single bump you hear in your house is a demon that's, you know, closing a drawer or something like that. But it is. It is a thing, for sure. They can interact directly with the material world. So does that answer your question, Mihaly?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5722.23,"end":5729.61,"speaker":"Mihaly","text":"Yes, thank you very much. You just mentioned some new examples, and that makes it more clear. Thank you."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5729.93,"end":5767.43,"speaker":"Fr Andrew Stephen Damick","text":"Thank God. Well, again, good to hear from you, and I hope I see you again soon. All right, so we've got one more fall or apostasy of demonic beings to discuss today. And this is one that probably a lot of us know about because I think it is mentioned in scripture by Christ himself. Right. But maybe we didn't think twice about it. I think that this is another event. So, Father Stephen, take us on into this one. This is the fifth and final fall of our 5ish Falls of Angels."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5768.15,"end":5769.59,"speaker":"Fr Stephen De Young","text":"This is the ish."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5770.07,"end":5773.59,"speaker":"Fr Andrew Stephen Damick","text":"This is the ish. All right. Not to be confused with the Hebrew."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5773.59,"end":5778.31,"speaker":"Fr Stephen De Young","text":"Word ish, which is Eve's original name. Right?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5778.39,"end":5778.91,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5778.91,"end":5779.35,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5780.63,"end":5781.03,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5782.87,"end":5790.43,"speaker":"Fr Stephen De Young","text":"This depends. The reason there's an ish is this depends on whether the devil and Satan are the same."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5792.27,"end":5793.47,"speaker":"Fr Andrew Stephen Damick","text":"Whether they're the same person."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5793.63,"end":5802.91,"speaker":"Fr Stephen De Young","text":"Okay, right. Which many of us may have taken for granted for much of our lives, Right. That these are the same person. And they may be the same person."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5803.23,"end":5803.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5807.47,"end":5827.48,"speaker":"Fr Stephen De Young","text":"Of both Second Temple Jewish tradition and or birth of tradition. They are not the same person. And so, in fact, this is. This is alluded to by St. Andrew of Cesarea, who I've mentioned before."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5828.52,"end":5828.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5829.72,"end":5852.69,"speaker":"Fr Stephen De Young","text":"In terms of understanding, the Fathers saw what we're about to talk about. As sort of problem or an issue. At least. Least that needed an explanation. And there are two possible explanations. So there is this figure who we encounter in the Book of Job, who is referred to in the Book of Job as the Satan."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5853.17,"end":5855.01,"speaker":"Fr Andrew Stephen Damick","text":"Okay, right, the Satan."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5856.37,"end":5890.67,"speaker":"Fr Stephen De Young","text":"And the. The is important because in some languages like Greek, you could put a definite article before someone. We usually don't do that in English, the Father Stephen or. But in, in Hebrew, you also something has ha, which is the definite article in Hebrew in front of it. So that means it's a, It's a title."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5891.54,"end":5892.5,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5892.74,"end":5900.5,"speaker":"Fr Stephen De Young","text":"The person in Job is not named Satan. In the Book of Job, he is the Satan."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5900.98,"end":5907.06,"speaker":"Fr Andrew Stephen Damick","text":"Okay, and. And what adversary? Yeah, the adversary or the enemy. The enemy or the opponent."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5907.78,"end":5915.94,"speaker":"Fr Stephen De Young","text":"Right, yeah. Who comes into the divine council and presents this case against Job."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5917.15,"end":5917.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5918.67,"end":5936.75,"speaker":"Fr Stephen De Young","text":"And this figure people have probably in Jewish, even later rabbinic Jewish tradition, they don't see the Satan as necessarily an evil or pardon the pun, diabolical figure. Necessarily."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5937.15,"end":5937.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5938.75,"end":5944.13,"speaker":"Fr Stephen De Young","text":"He's sort of prosecuting attorney for sin and he points SIDS."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5944.69,"end":5945.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":5946.37,"end":6002.22,"speaker":"Fr Stephen De Young","text":"And so there is already. Yeah. In Second Temple Jewish tradition. So in the tradition between 500 B.C. and you know, the writing of the New Testament in that, in that Judaism, sometimes he's given an angelic form of the name like Satana L or Samael, sometimes considered one of the seven archangels archaeologist had before his fall. And so you have this figure usually seen as being in contest with St. Michael the Archangel, that St. Michael the Archangel is sort of defending Israel and the righteous of God. And Satana L is accusing, or Samael is accusing the, the righteous of God."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6002.62,"end":6003.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6003.1,"end":6065.11,"speaker":"Fr Stephen De Young","text":"Sort of continual back and forth. And of course St. Michael is said to have been the archangel of, or the guardian angel of Jacob, and Samael was the guardian angel of Esau. Right. And so this contest has sort of been going on for a long time. His name means. Means the venom of God or the poison of God. And he's usually identified as like the angel of death at the Passover, the. The one who brings the plague in. In response to sin. And so you could see how that dynamic sort of plays out. And that dynamic is Referred to by St. Jude in Jude My Satan contest over the body of Moses. Yeah, and that's, that's a, A play on this demand dynamic. So you could easily see how someone could say, okay, well, this is basically another name for the devil. Right. Like this is the same person."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6065.59,"end":6066.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6067.11,"end":6074.15,"speaker":"Fr Stephen De Young","text":"What causes the issue is largely Luke 10, verses 17 through 20."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6075.1,"end":6127.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah, yeah. I'm going to pull it up here right now. So Luke 10, verses 17 through 20. And so, and the 70 returned against the 70 apostles that Christ sent out. The 70 returned again with joy, saying, lord, even the devils are subject unto us through thy name. And he said unto them, I beheld Satan as lightning fall from heaven. Behold, I give unto you power to tread on serpents and scorpions, and over all the power of the enemy. And nothing shall by any means hurt you notwithstanding in this. Rejoice not that the spirits are subject unto you, but rather rejoice because your names are written in heaven. So I saw, or as I've often heard it, I saw Satan fall like lightning. Yeah. Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6127.18,"end":6136.13,"speaker":"Fr Stephen De Young","text":"So it's very clear from the. Something has changed here during the ministry of Christ. Something has happened vis a vis Satan."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6136.45,"end":6137.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6137.41,"end":6144.37,"speaker":"Fr Stephen De Young","text":"That he's. He's lost a role. He's no longer given access to the divine counselor. Something has happened here to say."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6144.53,"end":6144.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6146.45,"end":6167.85,"speaker":"Fr Stephen De Young","text":"And we find the same thing in Revel 1 through 9, where we read about Satan being cast down after Christ's birth. Christ's birth is described and then the fall of Satan. And so. Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6167.85,"end":6198.24,"speaker":"Fr Andrew Stephen Damick","text":"Kind of broke. You kind of broke up there a little bit. But I think that, like, a really important point to make here is, you know, like, I remember reading that, you know, I saw Satan fall like lightning. And my first thought when I. I recall from when I was a kid is thinking, okay, he's talking about things that he saw before the creation of the world. But like you said in Revelation, it talks about this fall that happens after the birth of Christ. So it's something current to when he's speaking."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6199.28,"end":6235.3,"speaker":"Fr Stephen De Young","text":"Right. And Christ says that because of that, he's giving them this authority over demons. Right. In Luke. And so when St Andrew looks at this, he says, well, wait a second. The fathers all say that after the creation of the world, the devil fell through envy. But now we have this fall in the ministry of Christ. And if you read Revelation 12, verse 9 in Greek, it says the dragon who is the devil and Satan are cast."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6235.3,"end":6235.74,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6236.14,"end":6249.1,"speaker":"Fr Stephen De Young","text":"Or is cast. So is it the dragon who is both the devil and Satan, or is it the dragon who is the devil, one guy, and Satan who's this other guy? It's ambiguous."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6249.42,"end":6249.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6249.82,"end":6260.39,"speaker":"Fr Stephen De Young","text":"And so the question is, are these two different figures who both fall, or is this one figure, one person who falls two different times in two different ways?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6260.46,"end":6260.86,"speaker":"Fr Andrew Stephen Damick","text":"Ways."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6260.86,"end":6288.07,"speaker":"Fr Stephen De Young","text":"And St. Andrew thinks it's one figure who falls in two different ways. But there, there are other places. For example, some of the icons of theophany will show instead of the little river gods, they will show. Instead of the river gods, they'll show what looks like a man with wings, like an arc, like a fallen angel down there and then a dragon."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6288.71,"end":6292.47,"speaker":"Fr Andrew Stephen Damick","text":"Oh yeah, I've seen that beings. Yeah, right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6292.55,"end":6301.35,"speaker":"Fr Stephen De Young","text":"So there are these elements of tradition where these are separate demonic powers and there are elements of tradition where they're put together into one."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6301.91,"end":6302.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6302.47,"end":6315.23,"speaker":"Fr Stephen De Young","text":"And it's not uncommon for, for all about tonight to be kind of mixed and matched in different texts. And that's part of no order, chaos, lying spirit."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6315.55,"end":6350.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. We shouldn't be surprised that, you know, as you said, lying spirits should be hard to pin down. You know, that they're gonna fool us. I mean, you know, they're, they're, they're, they're spiritual beings. They have great powers abilities. They're extremely experienced with tempting mankind. They're going to appear in the way that makes sense to them to attempt to tempt us. They're going to function in a way that tries to bring us into their rebellion. You know, they're not going to come up, show up and say, and here's my demonic id, you know, here's my picture on it."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6351.79,"end":6353.39,"speaker":"Fr Stephen De Young","text":"It's just demon third class."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6354.83,"end":6398.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And which, which is an interesting contrast to the way that, that, you know, a lot of people kind of want to, they want to have this all sorted out, right? And there are whole like spiritual systems, you know, religious systems that lay all these things out and they try to codify them and so forth, but they're just not. And this is, these traditions that we have are people who are, you know, encountering these beings and make, trying to make sense of what it is that they're actually experiencing. Like, this is not, this is not speculation, right? You know, this is actual direction experience of human beings over time saying, I saw this, I encountered this, this happened."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6398.9,"end":6434.85,"speaker":"Fr Stephen De Young","text":"You know, these are demonic spirits. These are different ways in which demonic spirits are encountered by false pagan, idolatrous worship in temptation to commit evil through knowledge that they're not prepared for through an attempt to displace God in their heart and mind and soul. These are all actual experiences that we have human beings since the beginning of human beings, of spirits of evil who are bent on the destruction of humanity."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6435.17,"end":6486.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, well, having said that, we're going to wrap up for tonight, but before we do that, I just want to. To give you a little bit of preview of what we're going to be talking about next time. So two weeks from today, on the 22nd of October, we're going to be talking about exactly the opposite of what we've been discussing this evening. And we'll be talking about the Sons of God, what that title means, what it means to become sons of God, human beings become sons of God. And of course, that word that every Orthodox Christian probably should know, which is theoses. So. So you may wonder exactly what all that has to do with all these things we've been discussing. So tune in again two weeks from tonight for that. Father Stephen, did you have any final comments you wanted to make before we wrap up tonight?"}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6488.98,"end":6518.51,"speaker":"Fr Stephen De Young","text":"Just that in relation to our second call, and this is important as a theme we're going to come back to again and again and again. The chain of cause and effect movement back and forth between the material and spiritual worlds. They're not separate. There's not a divider, there's not a partition. But everything moves back and forth because it is all one creation and one world that includes demons, demigods and staplers."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6519.95,"end":6570.35,"speaker":"Fr Andrew Stephen Damick","text":"And staplers. All right, well, don't forget on the 29th of October, we have a bonus Halloween special episode. So that is our show for today. Thank you very much everyone for listening. If you did not get a chance to call in during the live broadcast, we would love to hear from you either via email@lordofspiritsancientfaith.com you can contact us through the chat room which we had going tonight. You can also message us at our Lord of Spirits podcast Facebook page. And there is also, by the way, a Facebook group called the Divine Council. We read everything. We do, we really read everything, but we can't respond to everything. And we do save what you send for possible use in future episodes and."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6570.35,"end":6587.16,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Don't forget to like our Lord of Spirits podcast Facebook page while you're at it and join the aforementioned group. Leave a recommendation and then invite your friends."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6587.72,"end":6596.44,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts on Facebook or wherever you get your podcasts. And that raises the visibility of the show and gets more people connected."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6597.48,"end":6605.98,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to the Ancient Faith support and help make sure we lots of other AFR podcasters."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6605.98,"end":6609.82,"speaker":"Fr Andrew Stephen Damick","text":"Stay on the air. Father Andrew, Stephen Dick, thank you and God bless you."}
{"episode_id":"LOS - #004 - 2020-10-08 - The Five(ish) Falls of Angels","start":6610.14,"end":6639.03,"speaker":"Announcer","text":"Presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
