{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":0.24,"end":4.32,"speaker":"Fr Stephen De Young","text":"He will be a staff for the righteous with which for them to stand and not to fall."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4.48,"end":7.48,"speaker":"Fr Andrew Stephen Damick","text":"And he will be the light of the nations and the hope of those."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7.48,"end":12.2,"speaker":"Fr Stephen De Young","text":"Whose hearts are troubled. All who dwell on the earth will fall down and worship him."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":12.2,"end":14.48,"speaker":"Fr Andrew Stephen Damick","text":"And they will praise and bless and."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":14.48,"end":64.3,"speaker":"Fr Stephen De Young","text":"Celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":66.38,"end":116.44,"speaker":"Fr Andrew Stephen Damick","text":"Good evening and welcome back to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Fr. Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855 AF radio. That's 855-237-2346. John is going to be taking your calls tonight and we'll get to your calls in the second part of today's show. So the Lord of Spirits podcast is brought to you by our listeners. That's you with help from Saint Athanasius Academy of Orthodox Theology. Saint Athanasius is an online academy for K12 offering live classrooms and core subjects, foreign languages, various electives and Orthodox studies. To learn more about St. Athanasius Academy, please visit www.saaot.edu."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":117,"end":142.77,"speaker":"Fr Stephen De Young","text":"And I talked to Deacon Adam again over, oh yeah, Saint Athanasius Academy. And he wanted people to know because those, those photos the paparazzi took got got out of him at Tiffany's. And he wanted me to assure everyone that despite those pictures, he is not using Saint Athanasius tuition money to buy an engagement ring for J. Lo."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":143.33,"end":144.05,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":144.13,"end":145.81,"speaker":"Fr Stephen De Young","text":"So you don't have to worry about it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":145.81,"end":240.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Especially since he's already married. So tonight we're going to be talking about St. John the Forerunner and Baptist. Before we get to that, though, I just wanted to say thank you to all of the physicists and the many more people who wrote and said I'm not a physicist, but who filled us in more on the details of what Happens to matter, both biological and inert. In response to our previous episode, which was on Relics, and your emails actually confused me so much that I called my big brother on the phone. He's a chemical engineer, and he explained everything to me very, very thoroughly. Very interesting. So, you know, we don't claim to be physicists, biologists, chemists, though, thank God. So even though we might have gotten a few of the details last time, a bit off. The point, though, is about what matter has to do with being. That's the important thing. So thank you very much for all those emails. All right, well, let's talk about the one who is being the forerunner of Jesus Christ, St. John the Baptist, that enigmatic figure who is prophesied in the Old Testament and is the last of the prophets. In classic Lord of Spirits podcast fashion, we're going to go back first. So in this case, we're not headed all the way back to Genesis. I know it's a big shocker, everybody, but rather back to the books of Kings. And we're not talking first about the last of the prophets, but rather the prophet that is sort of the prophet, the paradigmatic prophet, and that is the prophet Elijah. So, Father Stephen, why is Elijah the paradigmatic prophet? Boy, that's easy to say. Paradigmatic prophet."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":242.13,"end":245.57,"speaker":"Fr Stephen De Young","text":"Lots of hard consonants. We're going Welsh tonight."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":248.13,"end":250.85,"speaker":"Fr Andrew Stephen Damick","text":"Too many vowels for Welsh. Too many vowels for Welsh."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":251.65,"end":255.81,"speaker":"Fr Stephen De Young","text":"And we are indeed varying up our usual format."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":255.97,"end":256.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that is true."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":256.89,"end":262.05,"speaker":"Fr Stephen De Young","text":"Just a touch this evening. Well, in a couple of ways. So we need to prepare people."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":262.45,"end":262.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":262.97,"end":290.22,"speaker":"Fr Stephen De Young","text":"People don't like change. A lot of them are orthodox. Right. They don't want things to change at all. So. But yeah, we're only starting with. With. With Elijah. So we're. We're still in the first millennium B.C. which is a rarity. And also, though people might be expecting this now, we're not going to spend the first act running through prophethood in the ancient Near East."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":290.38,"end":290.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":291.42,"end":337.72,"speaker":"Fr Stephen De Young","text":"The earliest prophet, though at some point we probably will in some other future episode. Mark that on your bingo card. Future episode. But we're starting with. With Elijah. And Elijah, or Saint Elias or Elias or Louis, if you're French speaking, is a. Is the paradigmatic prophet. Not just in the sense that, well, this is. This is the prophet we have a lot of information about, or a lot of other prophets look like him or act like him, but in the way, first and foremost, that he's treated by the text of the Old Testament."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":338.04,"end":347.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, so why isn't Moses the. I mean, that If I. If someone just threw that out me, who's the paradigmatic prophet? I would probably have guessed Moses. Why isn't Moses the one?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":348.37,"end":377.18,"speaker":"Fr Stephen De Young","text":"You could make a good argument for Moses in the sense that, you know, you have the prophecy of a prophet like Moses in Deuteronomy. Right. But Moses has a different role than most of the later prophets. And I don't want to go too far down this rabbit trail, but Moses at the beginning of his calling is actually sort of a prophet, a priest and a king all at once wants."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":377.18,"end":377.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":378.38,"end":381.58,"speaker":"Fr Stephen De Young","text":"And part of that gets taken away from him."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":381.9,"end":382.3,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":383.18,"end":429.87,"speaker":"Fr Stephen De Young","text":"And that's a. That's a whole other discussion. So when we're talking about Moses as a. As a paradigm, it's usually Moses as a type of Christ himself, the lawgiver. Right. Whereas when we're talking about who sets the standard for prophethood as such, and we're going to see a lot of ways as we go on, but it begins with how he's treated in the text, because we sometimes take for granted or haven't thought about the fact that the story of Elijah and Elisha, who we're also going to talk about tonight, that story is in the books of the kings. Neither of them are kings."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":431,"end":431.96,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":432.12,"end":452.68,"speaker":"Fr Stephen De Young","text":"So these books, first and Second Samuel and First and Second Kings, or first through Fourth kingdoms, if you're in the Orthodox study Bible, are very clearly written by the same person, but they completely change format in order to tell us the stories of Elijah and Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":453,"end":456.52,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, does that suggest we've got an insertion from some other author?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":458.43,"end":460.67,"speaker":"Fr Stephen De Young","text":"No, because they're very clearly written by the same author."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":460.75,"end":461.71,"speaker":"Fr Andrew Stephen Damick","text":"Stylistically."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":461.95,"end":507.63,"speaker":"Fr Stephen De Young","text":"Stylistically at everything. They match up and they're part of the overall arc of the story that's being told. But you get, you know, the story of Samuel, the story of David, or. Which leads to the story of Saul, which leads into David, Solomon. Then you get the divided kingdoms and the books of the kings, and you have these lists of the kings, a few things about them, whether they're good or bad. A few stories, there's this rhythm that gets set up, and then all of a sudden, once you get past Omri to his son Ahab, all of a sudden that pattern breaks and it's now we're going to follow the prophet Elijah and then the prophet Elisha, and then after Elisha, it goes back to that previous rhythm."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":507.95,"end":518.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which kind of suggests that, you know, God is sort of following the kings, and then. Because the king becomes a complete jerk, then."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":519.3,"end":519.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":519.62,"end":529.38,"speaker":"Fr Andrew Stephen Damick","text":"You know, I can say those kinds of things about Ahab, then, you know, the focus then is on the man of God who is the leader of the people, effectively."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":530.34,"end":546.35,"speaker":"Fr Stephen De Young","text":"Right, right. And there are other prophets. Most of the other writing prophets are alive somewhere in the time covered by that narrative. And a few of them are briefly mentioned. Like Jonah is briefly mentioned in Second Kings."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":546.75,"end":547.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":548.19,"end":599.42,"speaker":"Fr Stephen De Young","text":"But nothing really about it. Just he has this bare mention. So it's not just like, well, I'm writing about kings, but I really wish I was writing about prophets, darn it. Right. Like. And so he seizes this opportunity, but he feels the need to tell these, these stories of Elijah and Elijah in detail. And so that can then be seen as, okay, here's sort of the sin qua non of prophethood. So when I talk about someone else who is a prophet, this is the kind of thing I'm talking about from the perspective of the, what we call now the historical books, right. That they're the ones holding this up as here's the pattern of the prophet's life. And most of the books that we call the prophets now don't have tons and tons of details of the prophet's life."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":599.82,"end":605.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's mostly just thus saith the Lord and then whatever it is that the prophet had to deliver."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":605.98,"end":628.19,"speaker":"Fr Stephen De Young","text":"Right. And there'll be a little bit of a narrative frame, enough to tell you sort of when it happened and what was going on and who the prophet was talking to. Right. That kind of thing. But. Or if the prophet was doing some prophetic action that accompanied what he said. But you don't get this kind of detailed narrative of the lives of other prophets."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":628.51,"end":632.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, these are, in some, some sense, these very much look like saints lives."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":633.15,"end":633.47,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":633.47,"end":633.95,"speaker":"Fr Andrew Stephen Damick","text":"You know?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":634.03,"end":710.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And they, they become the life of Moses and the life of Elijah really become sort of the paradigms for that. The life of David becomes sort of the paradigms for how that's done later on for the saints. And even in extra biblical literature, the Old Testament, we're actually going to reference this later on in Act 3. But one of the older pieces of post 1st century AD Jewish tradition we have is a work called the Lives of the Prophets. And that is very much following this kind of paradigm in talking about the, the other prophets of Israel who don't have those biographical details in, in the Hebrew Bible itself. But so when we encounter Elijah, as we mentioned, it's within the context of this feud with Ahab. Right, right. And that's because even though there's very little about him. In the Bible, archaeologically speaking, in terms of material history, the most important king of the Northern Kingdom of Israel was Omri."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":711.25,"end":712.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":712.93,"end":753.9,"speaker":"Fr Stephen De Young","text":"And Omri was so important that the neighboring nations referred to the Northern Kingdom of Israel as Beit Omri, the House of Omri, pretty much until its destruction. From the time of Omri until it was destroyed, even though it wasn't actually his dynasty anymore, after it was still referred to as the House of Omri because of how he expanded it, built up its military, his building projects. The main one of those building projects is that he actually built the capital of the Northern Kingdom. He bought the hill on which to build the city of Samaria that was the capital of the Northern Kingdom."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":753.9,"end":758.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. And yet, like in the Bible, he gets what, like one verse, two verses?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":759.14,"end":759.9,"speaker":"Fr Stephen De Young","text":"He gets six."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":759.9,"end":761.06,"speaker":"Fr Andrew Stephen Damick","text":"He gets six verses."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":761.06,"end":805.83,"speaker":"Fr Stephen De Young","text":"Excuse me, a couple of which are talking about him buying that hill, and the rest of which are saying when he was born, how old he was when he died, that he was wicked. And the rest of the stuff he did is in the annals. Yeah, that's pretty much all we get about him. But his son is Ahab. And so another of the things that he did in terms of building up the Northern Kingdom of Israel's status and power in the world was form alliances with his neighbors. One of those neighbors was the Phoenicians, who were. Whose civilization at this time was centered around Tyre and Sidon. And so Lebanon."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":805.99,"end":806.51,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":806.51,"end":807.71,"speaker":"Fr Stephen De Young","text":"Yeah. What's now modern?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":807.71,"end":808.63,"speaker":"Fr Andrew Stephen Damick","text":"Modern Lebanon. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":808.63,"end":825.59,"speaker":"Fr Stephen De Young","text":"Right, right. And so he marries his son Ahab to the daughter of the king of Sidon, namely Jezebel, who has now become infamous with everyone, even if you've never read the Bible in your life."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":826.39,"end":826.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":827.75,"end":832.5,"speaker":"Fr Stephen De Young","text":"And so she brought with her her religion."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":832.66,"end":833.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":833.58,"end":834.26,"speaker":"Fr Stephen De Young","text":"Hometown."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":834.42,"end":839.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So she's a BAAL worshiper. It's our old friend baal. I'm still looking forward to that BAAL book, Father."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":839.78,"end":842.34,"speaker":"Fr Stephen De Young","text":"Yes. It's down the road of peace, but."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":842.42,"end":899.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, one book at a time. Yeah. So she brings in BAAL worship, and this is a major interesting point. She kills a whole bunch of the prophets of Yahweh, the God of Israel. And, you know, it's basically, you know, religious ethnic cleansing, so to speak. Right. You know, eliminate the religious leaders from the previous religion, bring in her own prophets that promote the worship of baal. And, you know, the idea is to essentially to convert the Northern Kingdom of Israel to BAAL worship. You know, there it is at the royal court. I mean, this is the way it tends to go in history. Right. You know, the royals convert, and then eventually the rest of the country kind of follow suit. And I mean, it seems from what's written in scripture that most people up there go ahead and join the king and queen in their BAAL worship. Right, right. Most people are doing it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":899.03,"end":909.71,"speaker":"Fr Stephen De Young","text":"And we have to remember before this. Right. So before the Omride dynasty, the worship in the Northern Kingdom was already not in a great place."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":909.79,"end":915.51,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah, right, right. They were already kind of verging on idolatry and engaging some idolatry."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":915.51,"end":957.52,"speaker":"Fr Stephen De Young","text":"Well, full on idolatry. Yeah. Jeroboam, son of Nebat, who was the first king of the Northern Kingdom as a separate kingdom of the 10 tribes, didn't want people making pilgrimage to the temple in Jerusalem. So he kept, at least in name, the worship of Yahweh, but he built the two shrines at Bethel and Dan, which were at the extreme north and extreme south of the Northern Kingdom. And he put golden calves there that were supposed to be Yahweh. And we've talked before about how idolatry works. Right, right, Full on. That was it. And then that was in addition to high places and shrines for other gods that he allowed to exist."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":957.76,"end":958.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":958.4,"end":1036.46,"speaker":"Fr Stephen De Young","text":"So what Jezebel is doing is not just like, oh, hey, I want to add in mine to the mix. Right. That that mix was already going on. This was a deliberate attempt to bring the Northern Kingdom under the religious and cultural and political. Because these things weren't separate hegemony of the Phoenicians. Right. To essentially make the Israel, the Northern Israelites, into Phoenicians, into one of the nations and just have them cease being Israel. Yeah. And so it is like you said, ethnic cleansing is really what it is. Right. It was trying to destroy this people as a people and make them, make them into another people. And we're told she murdered hundreds of Yahweh's prophets. Right. Because as you might imagine, you know, the, the, the Levites who are working at these high places and at these shrines in Bethel and Daniel were not sort of super strident fundamentalists about Northern Kingdom worship. Right. If they had been, they would have moved back to Judah and got to the temple."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1036.46,"end":1043.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They were, they were already compromisers and collaborators with pagan rituals."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1044.1,"end":1063.2,"speaker":"Fr Stephen De Young","text":"Right. And so the holdouts who are trying to rally the people against this pagan worship, against following the edicts of Ahab and Jezebel are the prophets. And among them, Elijah has this sort of forefront role."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1063.76,"end":1065.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1065.6,"end":1094.08,"speaker":"Fr Stephen De Young","text":"And so the, the whole, this whole battle ends up becoming between Elijah and Ahab who. Ahab is portrayed as exceedingly weak, and it's essentially between Elijah and Jezebel, but Ahab is the one who's kind of making the pronouncements and doing. Doing her bidding."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1094.96,"end":1096.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1097.12,"end":1099.2,"speaker":"Fr Stephen De Young","text":"And. Yeah, go ahead."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1099.28,"end":1144.43,"speaker":"Fr Andrew Stephen Damick","text":"I was just gonna say, you know, just to kind of. I mean, we've talked about bail lots of times, but just as to remind everybody, BAAL is depicted as a storm God. He's a thunder God. Right. He's the one who brings lightning and rain. And as we've talked before, his story says that he sets himself up as the. He's installed a new most high God who is his father, El, up on the divine council, and then he rules the divine council directly himself. So this is the one that they're worshiping and the one that they're. They're trying to assimilate the Northern Kingdom to. Right. Is this. This storm God, this usurper, Right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1144.43,"end":1146.75,"speaker":"Fr Stephen De Young","text":"He's. Cloud Rider is one of his titles."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1146.91,"end":1147.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1147.47,"end":1157.46,"speaker":"Fr Stephen De Young","text":"And we've talked before about how that imagery and stuff gets. Gets taken in the Old Testament and implied, applied instead to Yahweh to say, no, it's Yahweh who does this."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1157.78,"end":1158.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1158.18,"end":1181.7,"speaker":"Fr Stephen De Young","text":"And so this is going to be where sort of the rubber meets the road. Right? So what Yahweh, the God of Israel is going to do is through Elijah, he's going to demonstrate to Ahab, Jezebel and all the people of the Northern Kingdom who he is and who BAAL isn't."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1182.45,"end":1215.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. And, you know, one of the cool ways that it kind of starts out is the contrast between Elijah and the royals, right? So they're living, you know, in luxury, Right. Controlling everything. And where is Elijah? He's out in the Kidron Valley, Right. He lives by himself out in the wilderness. He lives next to this brook, a little river, and he's fed there by ravens, which you had a cool textual thing that we talked about in our."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1215.18,"end":1215.94,"speaker":"Fr Stephen De Young","text":"In our notes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1216.5,"end":1229.78,"speaker":"Fr Andrew Stephen Damick","text":"It's not super important, everybody, but you're just gonna sort of love this. So, yeah, fed by ravens. Yeah, fed by ravens is the way that most people understand what it says in Scripture, but there are those who actually say that it doesn't say ravens and instead say what?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1230.26,"end":1240.33,"speaker":"Fr Stephen De Young","text":"So, yeah, some of our. Some of our modernist friends, like our 19th century German friends at all, you know, somebody being fed by birds. That's ridiculous."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1240.65,"end":1241.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1241.61,"end":1257.77,"speaker":"Fr Stephen De Young","text":"No one could believe that birds are bringing him food. So they say that based on a similarity in the consonants, they say, oh, well, that word has the wrong vowel points. Right. Because of course, when you write Hebrew and most Semitic languages, you don't write the vowels."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1258.09,"end":1258.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1258.65,"end":1269.78,"speaker":"Fr Stephen De Young","text":"Right. And so later in the medieval period, they went and added vowels to the Old Testament. They say, oh, well, they did it wrong. What it really says is that Arabs came and brought him food, which."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1271.38,"end":1280.02,"speaker":"Fr Andrew Stephen Damick","text":"So that's apparently a lot more believable, that Arabs just came along every so often and supplied Elijah with food there at the Kidron Valley."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1280.34,"end":1314.78,"speaker":"Fr Stephen De Young","text":"Yes. Just wandered by. Because birds are ridiculous. Yes, Birds are ridiculous. Yeah. And so he. He's out there wearing, you know, camel hair. And even his. In the Hebrew, his dialogue is pretty curt and stunted. There's a lot of. We see a lot of. In the writing, prophets, like in Isaiah and Jeremiah and Ezekiel, these kind of eloquent speeches and imagery and. And all of this. That's not Elijah, right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1315.02,"end":1315.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1315.82,"end":1327.98,"speaker":"Fr Stephen De Young","text":"St. Elias isn't into that. So when he first comes wandering into the royal court to confront Ahab, he basically says the equivalent of, ain't gonna rain no more."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1328.7,"end":1330.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. Rain stopping."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1330.78,"end":1384.52,"speaker":"Fr Stephen De Young","text":"Yeah. No more rain. Right. Drop. Just drops that Mike drops and walks back out, and that's it. And he leaves and it stops raining for years. So he's just informing them that it's not gonna rain anymore. Now, this. This already is a display. Right. Because the fact that Elijah comes and announces it as the prophet of Yahweh means Yahweh is the one who's not sending the rain. Right, right. And the whole purpose of worshiping baal, Right. As well. There were two purposes of worshiping BAAL as a storm God. The first one was to get him to send the rains in their seasons. And the second one was to ward off, like, destructive storms. Yeah, right. Those were. That keep him happy. Right. So that he gave you the rain you wanted, and he didn't give you the storm and lightning that you didn't want."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1384.68,"end":1406.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because. Because idolatry is essentially a kind of spiritual technology. Keep the God happy. And this is what. Well, he's really good at this, so he'll do this thing for us. And Elijah making it. Or from Ahab's point of view, Elijah making it stop raining, what that really does is it says, yeah, this guy doesn't actually have control of the rain."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1406.49,"end":1406.81,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1406.81,"end":1407.85,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1408.09,"end":1413.53,"speaker":"Fr Stephen De Young","text":"Because they're still out there at the high places and at the shrines of Bethel. They're. They're doing the sacrifices."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1413.85,"end":1414.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1414.41,"end":1431.69,"speaker":"Fr Stephen De Young","text":"They're doing the rituals. They're doing the stuff. They're reading the guts of the animals. They're doing. I mean, not to get too dark, but. But we got to be honest. There's shrines to molech at this point. They're sacrificing children. And. And rain still isn't coming."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1431.77,"end":1432.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not working."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1433.13,"end":1434.69,"speaker":"Fr Stephen De Young","text":"Right. And. And it's not working."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1434.69,"end":1435.45,"speaker":"Fr Andrew Stephen Damick","text":"It's discredited."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1436.41,"end":1442.49,"speaker":"Fr Stephen De Young","text":"So this already is a. Is a display."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1443.05,"end":1443.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1443.85,"end":1455.78,"speaker":"Fr Stephen De Young","text":"So that's sort of the beginning. Right. And of course, we're more familiar with the culmination of that sort of showdown. Right. Which happens at Mount Carmel."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1455.78,"end":1586.28,"speaker":"Fr Andrew Stephen Damick","text":"Mount Carmel. Right. And, you know, this was always one of my favorite stories in Sunday school. I mean, I love this so much, I named my first son Elias. So that's pretty much the reason why. Yeah. So for those of you who don't remember this from Sunday school, what Elijah does is he proposes a showdown, right. Basically a kind of prophetic duel of sorts, and says, okay, I'm going to set up an altar to my God over here, you guys, you set up your altar to BAAL and you put your bull on your altar, and I'll put my bull on my altar. And you guys, you can call down fire from heaven. Like that's. That's what it says in the scripture, Fire from heaven. You just pray to your God and, you know, and if he sends it, then everybody will know that BAAL is our God. BAAL is God. Right. But if. But if my God sends it, then everyone will know that Yahweh is God. And so the. The prophets of baal, they set it all up and they, you know, dance in circles around it, and they call out to BAAL and they cut themselves with knives because apparently that's part of their ritual and nothing happens. And then this is the point where St. Elijah proves that he is the patron saint of sarcasm, and he begins to mock them. Very ecumenical move on Elijah's part. He begins to mock baal, actually, he mocks the demon from our point of view and says, you know, well, maybe he's out on a trip. Maybe he's somewhere relieving himself. You know, he's on vacation. Call out louder. You know, maybe he's. He's hard of hearing, but still nothing happens. And then after that, after that failure on the BAAL prophet's part, then Elijah says, okay, I want you guys to bring a bunch of water and soak my sacrifice with water and pour it all over the altar. And he digs, you know, they dig a trench around and they fill that with water, too. And Elijah prays to God and says, essentially, show them that you're God. And then God sends the fire from heaven, and it, despite all the water, consumes the sacrifice, consumes the wood, and even dries up all the water that's in the moat around the altar."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1586.28,"end":1586.41,"speaker":"Audience Member","text":"And."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1586.88,"end":1619.81,"speaker":"Fr Andrew Stephen Damick","text":"And all the people standing by say Yahweh is God. And it's a really embarrassing moment for Ahab and Jezebel and for those prophets. So that's the summary of the showdown. Very much worth reading. Just great. But, yeah, so fire from Heaven, is that like a big swirling thing of fire going? You know, like, I've always seen that in the comic books and stuff and the pictures and the flannel graphics, you know, swirling flames, like a small tornado of fire. Is that. Is that what we're talking about?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1619.81,"end":1663.09,"speaker":"Fr Stephen De Young","text":"Yeah, and, yeah. And I'm about to ruin your Sunday school, but, yeah. And in fact, when I was in seventh grade, we did a. We did a. A student film of this event. Oh, and special effects for the client. Yes. For the climax, we got some GI Joes and wrapped them up in toilet paper like robes, and then had them, like, standing around a little paper altar. Then we got a can of WD40 and a lighter off camera, and we, like, zoomed in and, like. And flamed the whole thing. And then we did, like, the slow zoom on, like, the melting GI Joe face to do, like, great value. Raiders of the Lost Ark."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1663.17,"end":1665.09,"speaker":"Fr Andrew Stephen Damick","text":"Please tell me you still have the VHS from this."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1665.09,"end":1673.97,"speaker":"Fr Stephen De Young","text":"I do not. But. But yeah, so that was the best we could do on our budget, which was nothing."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1674.37,"end":1674.77,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1675.49,"end":1690.77,"speaker":"Fr Stephen De Young","text":"But in actuality. In actuality, if you read the Bale cycle, for example, the Bale cycle, BAAL is the one who sends fire from heaven. But what that's referring to is lightning. It's the thunderbolt."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1690.93,"end":1692.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1692.61,"end":1695.89,"speaker":"Fr Stephen De Young","text":"Because of course, they didn't have the concept of electricity."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1696.39,"end":1697.43,"speaker":"Fr Andrew Stephen Damick","text":"That's the Bale fire."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1697.83,"end":1719.67,"speaker":"Fr Stephen De Young","text":"So fire. Yeah, fire from the sky, fire from heaven. So that's what it's actually talking about. The thunderbolt was sort of the symbol of Baal's power. And some of the BAAL statues we have uncovered, he's holding a thunderbolt. And you see, that was Zeus too, and with other. Yeah, storm gods."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1719.67,"end":1720.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1720.15,"end":1760.99,"speaker":"Fr Stephen De Young","text":"Like, that's. That's the symbol of their power. And so the idea that, you know, hey, try as you might, you can't get him to send it. Right. But it's actually Yahweh, the God of Israel, who has that power, who has the dynamics. Right. Who is able to do that. Right, that's then. And the conclusion here, we usually leave off there. But what happens immediately after that is two things. Number one, the prophet Elijah leads them to go and kill a few hundred of the prophets of baal, Right. Which is distributive justice. Right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1761.15,"end":1761.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1761.55,"end":1803.86,"speaker":"Fr Stephen De Young","text":"Jezebel had gone out and murdered, had murdered hundreds of Yahweh's prophets. Right. And this is not just directed at Jezebel. Right. Because Jezebel is serving baal. So in the same way that you get at the time of the Exodus, right. Remember what the Egyptians had done, they had gone and murdered all of the Israelite male infants. And so when the judgment comes, God announces that that 10th plague, the Passover, is his judgment on the gods of Egypt. And so the gods of Egypt then lose their children in the same way BAAL now loses his prophets."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1804.26,"end":1854.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, this is, this is spiritual warfare. God against a rebellious angel, you know, a demon. And, you know, if you don't, if you don't recall that act that Jezebel did on behalf of baal, then this always just seems like a really kind of vindictive, awful thing for Elijah to do. But again, if we believe that he is truly a prophet of God, which if we believe in the integrity of Scriptures and we believe that, then that means that the things that he does are on behalf of God. So when he takes out these BAAL prophets, he's not just doing it because he's trying to, you know, he just wants to kill him or whatever. It's, it's, it's God's response to this action that Jezebel had done earlier. Yeah. So that happens. And then also it begins to rain."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1855.04,"end":1855.4,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1855.4,"end":1855.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1855.92,"end":1856.8,"speaker":"Fr Stephen De Young","text":"And it pours."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1857.28,"end":1857.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1858.08,"end":1860.04,"speaker":"Fr Stephen De Young","text":"After not raining for years. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1860.04,"end":1877.04,"speaker":"Fr Andrew Stephen Damick","text":"Because God has the rain. It's not with baal, the lightning's not with baal. Like, this is about shaming baal, it's about utterly humiliating BAAL in front of everyone so that they won't worship him, you know, because why would you worship a powerless God?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1878.64,"end":1891.03,"speaker":"Fr Stephen De Young","text":"Right. And so Elijah's ministry, this, this central portion of Elijah's ministry as a prophet is basically serving as an officer in spiritual warfare."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1892.23,"end":1892.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1892.59,"end":1937.66,"speaker":"Fr Stephen De Young","text":"That's sort of literally what he's doing. And so he's sort of one of the officers. Right. If you, if you think about the. And we're going to talk about this more in a minute, but if you think about the heavenly host as a host, as an army. Right. Elijah sort of, even though he's a human, is sort of an officer in that army already and what he's doing and how he's operating in his life. And then if you're familiar with another Prophet Elijah story, and it's. I don't know how common do you think it is at Orthodox churches that at great vespers for the Prophet St. Elias, they actually read all three Old Testament readings in toto?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1939.1,"end":1943.58,"speaker":"Fr Andrew Stephen Damick","text":"I think it's usually. I think they're usually abridged a little bit."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1943.9,"end":1944.26,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1944.26,"end":1948.94,"speaker":"Fr Andrew Stephen Damick","text":"Although, I mean, I, I feel like the last time we did it, that, that I read rather long bits."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1948.94,"end":1951.38,"speaker":"Fr Stephen De Young","text":"So it's chapters and chapters."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1951.38,"end":1952.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's long. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1952.74,"end":1952.98,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1952.98,"end":1959.89,"speaker":"Fr Andrew Stephen Damick","text":"You basically get. You basically get, you know, kind of the highlights of the whole. Of his whole story, you know, the major events."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1961.41,"end":1973.57,"speaker":"Fr Stephen De Young","text":"But so you, if you, if you remember another story, it's. It's probably right after this, and it's usually portrayed as Prophet Elijah is at this real high and that he has this low."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1973.89,"end":1978.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's all bummed out in the wilderness. Yeah. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":1978.93,"end":2019.39,"speaker":"Fr Stephen De Young","text":"That's not really what's happening here. That's not really what's happening here. I, I won't go into the whole thing right now. Well, maybe we'll have another time to do that. But the theophany element of what happens. But what's important here for our topic tonight is that at the conclusion, God tells him that Elijah is not actually alone. He's not the last one left who's following. He's still faithful to Yahweh. He's not the last faithful one. But there are 10,000. Right. And we shouldn't think that that's a precise number. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2019.71,"end":2020.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2020.27,"end":2022.91,"speaker":"Fr Stephen De Young","text":"The idea is it's 10 myriad. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2022.99,"end":2023.75,"speaker":"Fr Andrew Stephen Damick","text":"There's a whole bunch."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2023.75,"end":2024.99,"speaker":"Fr Stephen De Young","text":"A lot. There's a lot."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2025.31,"end":2037.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Who have not as. And the line is, have not bowed the knee to baal. You know, the faithfulness to God is expressed explicitly in terms of not engaging in idolatry."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2038.2,"end":2054.76,"speaker":"Fr Stephen De Young","text":"Yeah. And this little story, while we look at it as sort of this vignette where Elijah gets bummed out and God encourages him, like, no, you're not alone, Elijah. Right. This, though, in terms of the Scriptures, becomes crucially important."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2055.48,"end":2056.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2056.2,"end":2070.45,"speaker":"Fr Stephen De Young","text":"This idea that, that no matter how bleak and how bad things get, what God is doing through throughout the history of the Old Testament is preserving and refining and purifying a remnant for himself."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2070.69,"end":2071.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2071.57,"end":2105.74,"speaker":"Fr Stephen De Young","text":"That it's never about. All of Israel is saved. All of Israel is blessed. All of Israel is. Is following Yahweh all the time. It cracks me up so much when people with PhDs in Old Testament say, well, hey, we found this archaeological evidence that Israel was worshiping gods other than Yahweh. So apparently the Bible's wrong. Have you read the Bible? Yeah, yeah. Have you read the Old Testament that you have a PhD in? The Bible says they were hours. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2106.22,"end":2107.5,"speaker":"Fr Andrew Stephen Damick","text":"So, wow."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2108.06,"end":2178.07,"speaker":"Fr Stephen De Young","text":"Yeah. So the idea is that there was this remnant. Right. And that's what God was about. And that's what he was doing, that the whole project, the Old Testament, was to create and preserve and refine this remnant. And again, someday, when we do our second episode of the Theotokos, we'll. We'll get into how the church's understanding of the Theotokos builds on that as well. But St. Paul, then, probably the most famous place that this is appealed to is by St. Paul in Romans 9, 11. I'll drop it as sorry, Calvinists now. But where St. Paul, in addressing the fact that most of the Judeans of his day, who were seen as right, because the Old Testament prophets picked up on this idea of a remnant, your average Pharisee saw himself, said, well, we're that remnant. They identified themselves with that remnant. Right. We are the remnant who's come through and survived and been purified."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2178.79,"end":2182.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which ironically, like, like, no, you guys are the establishment."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2182.95,"end":2190.07,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. Well. And that's what. That's what. What St. John, the forerunner and Christ are always telling them."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2190.15,"end":2190.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2190.87,"end":2198.28,"speaker":"Fr Stephen De Young","text":"Is you're not the remnant. You're the priests at Bethel and Daniel. You're the. That's who you are."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2198.28,"end":2200.4,"speaker":"Fr Andrew Stephen Damick","text":"You're the religious adulterers."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2200.4,"end":2214.28,"speaker":"Fr Stephen De Young","text":"So, yeah, you've wrongly identified yourself in this story. But. So they see themselves. But, but St. Paul's addressing, well, most of this, what was claiming to be the remnant, most of that did not accept Jesus as the Messiah when he came."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2214.92,"end":2215.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2215.48,"end":2231.73,"speaker":"Fr Stephen De Young","text":"How's that work? And his answer ultimately. And we won't go, you know, we could spend the rest of the night on this. But the answer he gives in Romans 9 through 11 ultimately is, why would it be any different now than it has been throughout the history of Israel?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2232.85,"end":2233.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2233.33,"end":2242.05,"speaker":"Fr Stephen De Young","text":"Where it was just this remnant. And he says, and there is this remnant that is faithful to Yahweh because they're faithful to Christ."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2242.85,"end":2331.63,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, you know, for me, there is a. There is an immediate kind of pastoral application to that. And even, you know, whether you're in pastoral ministry or not, you know, like, one thing probably a lot of pastors have noticed is, wow, you know, most of the people I work with kind of don't do the things that I advise them to do. There's only this handful that are actually really on board. Right. And, you know, but. But even if you're not a priest or a pastor and just kind of like, looking at the world and thinking, oh, man, look at the world, it's so awful, you know, this is the narrative that has always been. I'm not saying that there aren't lower and higher times in history. There definitely are. There are definitely times and places where things are worse than they have been at other times. But, like, this is actually the norm. The norm is that most are not following God truly and faithfully. But there is always this remnant. And the application for the individual is not to say, oh, I'm the remnant. The application is to say, okay, I need to be part of the remnant. I need to be faithful, because I'm not as faithful. I'm not faithful in the way that I should be. So, yeah, I mean, this is one of these things that if you misidentify yourself, then it can become a kind of sectarian impulse. But if you realize, like, no, wait, I need to apply this to myself. I'm the sinner, I'm the sinner, then you've got it. Right. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2331.63,"end":2341.51,"speaker":"Fr Stephen De Young","text":"Right. And by the way, especially to our Orthodox listeners, this is true of church history, too."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2341.91,"end":2343.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, totally."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2343.83,"end":2350.79,"speaker":"Fr Stephen De Young","text":"Just like King David, sort of the paradigmatic king, committed some awful sins. So did St. Constantine."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2351.43,"end":2351.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2352.55,"end":2355.43,"speaker":"Fr Stephen De Young","text":"That doesn't make him not a saint. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2355.43,"end":2355.95,"speaker":"Fr Andrew Stephen Damick","text":"But that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2355.95,"end":2358.91,"speaker":"Fr Stephen De Young","text":"The fact that he's a saint doesn't mean he didn't do those things. Things."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2359.55,"end":2359.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2359.95,"end":2378.91,"speaker":"Fr Stephen De Young","text":"Just like with David, and just like almost all of the kings of Israel and Judah were wicked men. Almost all of the Byzantine emperors and almost all of the czars were wicked men. There are a few here and there who are really righteous and holy. Right. Most of the Byzantine emperors are not saints."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2379.23,"end":2401.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and you know, even, frankly, you know, not that we're trying to condemn everybody or whatever, but, like, there's a reason that, for instance, St. Gregory the Theologian said flee the reunions of bishops, like, I don't want to have anything to do with. With all. With my fellow bishops. Like, well, there must be a problem there. You know, if a saint says that about his own time and place."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2402.2,"end":2406.92,"speaker":"Fr Stephen De Young","text":"There was, but there was always a remnant. Yeah, yeah, There was always a remnant."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2407.16,"end":2407.52,"speaker":"Fr Andrew Stephen Damick","text":"Every."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2407.52,"end":2409.64,"speaker":"Fr Stephen De Young","text":"Every Saint Simeon, the New Theologian."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2410.22,"end":2412.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2412.54,"end":2418.7,"speaker":"Fr Stephen De Young","text":"There's. There's always a remnant. And that remnant was not sitting around cursing everyone else."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2419.1,"end":2419.5,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2419.66,"end":2427.02,"speaker":"Fr Stephen De Young","text":"And talking about how everyone Else was an apostate and just condemning everyone else. That remnant was busy being faithful to God."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2427.74,"end":2428.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2428.86,"end":2450.47,"speaker":"Fr Stephen De Young","text":"So if you're one of those folks, seem to be a lot of them on the Internet who are convinced that 90% of the Orthodox Church is corrupt. You know, we won't argue about numbers, but you need to find then that other 10%. You need to go find the remnant, the faithful people, the faithful Christians, and you need to get with them and get on board with them and be faithful yourself."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2450.71,"end":2454.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not going to be the ones, you know, cursing everybody else."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2455.11,"end":2455.67,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2455.91,"end":2588.15,"speaker":"Fr Andrew Stephen Damick","text":"That is not the Remnant. Yeah, Sorry. Okay, so the last major, you know, Elijah event is the, you know, the sort of succession. Right. Where. Yeah. The handoff, where it's time for Elijah to go and to be with God. And it. I mean, he doesn't. He doesn't die. Right. He gets taken up in a chariot of fire. Yeah, he gets. He gets taken up in a chariot of fire. And this also says a lot of interesting things about what it means to be, you know, as we said, the paradigmatic prophet. Right. And so, you know, one of the things that we talked about in our prep for this is a passage from Jeremiah 23, which talks about the sort of the mark of the true prophet. Right. And I just want to read this. So this is from Jeremiah, and this is what he has to say. For who among them has stood in the counsel of the Lord to see and to hear his word? Or who has paid attention to his word and listened? Behold, the storm of the Lord wrath has gone forth, a whirling tempest, it will burst upon the head of the wicked. The anger of the Lord will not turn back until he has executed and accomplished the intents of his heart. In the latter days, you will understand it clearly. I did not send the prophets, yet they ran. I did not speak to them, yet they prophesied. But if they had stood in my council, then they would have proclaimed my words to my people, and they would have turned them from their evil way and from the evil of their deeds. So the point of this is Jeremiah is making a contrast between false prophets and true prophets. And he says the true prophets are the ones who stand in the counsel of the Lord to see and to hear the Word. And he also says that they stand in the council and they proclaim his word to the people so that they would turn away from their evil ways. Right. So that's what Jeremiah says, that the prophet is one who's in the divine council and who is a messenger of the divine council. Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2588.39,"end":2600.31,"speaker":"Fr Stephen De Young","text":"And you see that very clearly with you. Look at the call of the prophet Isaiah. And he comes before the throne of God, and they say, who shall we send to make this announcement? And he famously says, here I am. Send me."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2601.37,"end":2605.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. He stands in the council. Lord becomes a messenger for the council."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2606.09,"end":2621.45,"speaker":"Fr Stephen De Young","text":"And the prophet Ezekiel, Jeremiah, in his call, and he says here, and by the way, if you haven't read Religion of the Apostles yet, this is what happens with St. Paul on the road to Damascus."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2621.61,"end":2624.29,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2624.29,"end":2627.8,"speaker":"Fr Stephen De Young","text":"So he says he's been sent with a message by Christ himself."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2628.2,"end":2660.89,"speaker":"Fr Andrew Stephen Damick","text":"And so this. This makes sense then, with the way that Elijah goes. Because what's happening is he's. He's being taken up into the divine council very, very visually. Like, it's not just, okay, he's dying. And now we believe he's, like, it's. It's quite literally happening before the eyes of Elisha, you know, that this chariot takes him up. And of course, what's the whole point of the chariot? This is. This is the image of the. The mobile throne of God, which is everywhere. So he's being taken up by the throne of God, so to speak."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2661.29,"end":2692.41,"speaker":"Fr Stephen De Young","text":"Right. And. And God's throne is a chariot because it's mobile. The whole council is mobile. Right. When. When you get to Daniel and when Daniel's standing in the divine council again. Right. Thrones are set. Yeah, right. And. And the council is seated around the throne of God. So. Yeah. So this is one of those throne chairs coming to get Elijah so that he can now be permanently there."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2692.89,"end":2693.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2693.69,"end":2724.36,"speaker":"Fr Stephen De Young","text":"But he's already been sort of acting, as we saw in this whole spiritual warfare. He's already been sort of an officer in the heavenly hosts. He's already sort of been serving in this role, but now is the time for him to go there permanently. And you see him still serving in that council role on Mount Tabor at the Transfiguration. Right. That's why it's. That's why when St. Elias and Moses appear with Christ, it says that they're conferring amongst themselves."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2724.84,"end":2727.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. This council function."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2728.28,"end":2728.68,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2728.76,"end":2734.57,"speaker":"Fr Stephen De Young","text":"And that's. That's the idea. That's what they're. That's why it says that they're talking about. They're not like, exchanging pleasantries."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2734.73,"end":2740.33,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like, hey, what you've been doing since you lived in that. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2740.57,"end":2764.44,"speaker":"Fr Stephen De Young","text":"Philosophical ideas or something. Right. That's what. That's what this is. Right. This is. And what it's meant to show us. So. And we know that this wasn't. I mean, we're going to get in more detail here in a second, into this transition from Elijah to Elisha. But we know that Elisha had the same experience from. From the whole incident with his servant Gehazi."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2764.84,"end":2765.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2765.64,"end":2785,"speaker":"Fr Stephen De Young","text":"Where they're facing an invading army and Elisha's servant Gehazi is terrified. And so Elisha prays, and Gehazi's eyes are open to see the heavenly host, to see the angelic beings arrayed around them, protecting them. But the reason in the text that Elisha wasn't afraid is that he already saw them."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2785.88,"end":2807.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which means he's kind of in the divine council all the time, even while walking around on this earth, because he sees them out there. You know, he sees that the hosts of heaven are also present. You know, he sees the bigger army, the more powerful army, which Gehazi can't see. So Elisha has to ask that his eyes be open to see that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2807.62,"end":2828.96,"speaker":"Fr Stephen De Young","text":"Right. And that's why this way of life, the way of life that we see with the prophets in the Old Testament, that we're going to see with St. John I, forerunner, begins to be referred to as the angelic life. Right, right. It's not just like it's angelic life because they're superhuman or because they're. They're not married or."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2829.2,"end":2855.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it's. They live with. They're basically. They live with the angels. And, you know, like, how many hymns do we have in our liturgical tradition that talk about saints as being companions with the angels? Like, that's everywhere. Like, almost every single day. The Manaean has something about that particular saint being a companion of the angels or dancing with the angels, or, you know, there's this. There's this equal to the angels idea, just like the Lord says in Luke 20."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2856.45,"end":2885.46,"speaker":"Fr Stephen De Young","text":"Yeah, right. And so this is. This is the means by which this happens is the Spirit, and it's particularly connected with worship. Right. Worship is being in the spirit. So the beginning of the book of Revelation, St. John is in the spirit, meaning he's worshiping on the Lord's day, and as he's worshiping, he sees Christ walking among the candlestands that are there in the church."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2886.02,"end":2897.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I think a lot of times when people see that in the Spirit, they're like, oh, he went into a trance, you know, or something like that. But, you know, like you said, there's this indication that it's a liturgical experience."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2898.75,"end":2908.75,"speaker":"Fr Stephen De Young","text":"Yeah. And so this, then, is what is continued in the church as the monastic way. Of life."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2909.23,"end":2909.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2909.71,"end":2913.31,"speaker":"Fr Stephen De Young","text":"Right. There are people who live in the church, who live in worship."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2913.79,"end":2919.47,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Because there's, you know, there's these Old Testament communities of prophets."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2920.11,"end":2920.87,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2920.87,"end":2929.22,"speaker":"Fr Andrew Stephen Damick","text":"Who are basically living in this way. I mean, it's not going to look exactly like, you know, modern monasticism, but the essence of it is the same."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2929.62,"end":2950.66,"speaker":"Fr Stephen De Young","text":"Right, yeah. And that's where Elisha goes after the transition, after he receives the mantle from that. We're going to talk about that more in a second. But as he was. After he receives the mantle from Elijah, he goes to the community of the prophets. Right. To begin his mission. But that community had existed a long time before that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2951.47,"end":2951.99,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2951.99,"end":2953.31,"speaker":"Fr Stephen De Young","text":"I mean, died before that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2953.31,"end":2956.67,"speaker":"Fr Andrew Stephen Damick","text":"Monasticism is not invented in the 4th century or whatever."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2956.91,"end":2962.67,"speaker":"Fr Stephen De Young","text":"Right. But these, these prophetic communities go way back. Right. To one of the craziest passages."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2963.63,"end":2964.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2964.11,"end":2965.55,"speaker":"Fr Stephen De Young","text":"In the story of David."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":2966.35,"end":3065.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah. I, you pointed this out to me the other day. I'm like, I don't remember this from Sunday school. Yeah. So first Samuel 19. This will be what from first kingdoms? If you're looking at the Orthodox city bible. Yeah, yeah. First Samuel 19, verses 18 through 24. This is part of the David and Saul story. I'm just going to read this now. David fled and escaped and he came to Samuel at Rhema and told him all that Saul had done to him. And he and Samuel went and lived at Nioth. And it was told Saul, behold, David is at Nioth and Ramah then, or Rama, I'm not sure the correct pronunciation. But then Saul sent messengers to take David. And when they saw the company of the prophets prophesying and Samuel standing as head over them, the Spirit of God came upon the messengers of Saul. And they also prophesied. When it was told Saul, he sent other messengers. And they also prophesied. And Saul sent messengers again, the third time, and they also prophesied. Then he himself went to Ramah and came to the great well that is in Sekou. And he asked, where are Samuel and David? And one said, behold, they are at Naioth and Ramah. And he went there to Naioth and Ramah, and the Spirit of God came upon him also. And as he went he prophesied until he came to Naith and Ramah, and he too stripped off his clothes and he too prophesied before Samuel and lay naked all that day and all that night. Thus it is said, is Saul also among the prophets Again, I've never seen a flannel graph of that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3065.87,"end":3068.27,"speaker":"Fr Stephen De Young","text":"I think that story is self explanatory. Don't you?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3068.59,"end":3079.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There's something about being at that spot. Like, you go there, you know, the spirit of God is going to sort of take you. And it even does this with."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3079.95,"end":3094.24,"speaker":"Fr Stephen De Young","text":"With Saul because. Because what we see here is Samuel standing as chief among them. So Samuel is there leading this community of prophets, this prophetic community in worship."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3094.48,"end":3098,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's like their abbot or bishop, effectively."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3098.72,"end":3215.51,"speaker":"Fr Stephen De Young","text":"And so what's happening is they have this worship going on in the spirit and every messenger who Saul sends come down there, right. Is sort of seized by it and ends up joining in and staying. Right. So a sort of modernization of this would be if some wicked king wanted to seize the land of a monastery, and so he sent messengers to them and they ended up becoming monks. And then he sent some more messengers and they ended up becoming monks. Right, right. Yeah. And that's. That's the idea with him, right. He prophesies as he goes, and then when he gets there, when he strips naked, he's taking off all of the symbols of his office as king. Right. All of that is stripped away from him. And then he just lays there naked, exposed before God and before Samuel, and then. And then leaves without troubling anyone. Right, so. So yeah, it's. It's a weird passage. It's a little bit of a weird passage, Right. But that's. That's sort of what's going on. And it gives us a window into these. These communities. Right. But we have stories from monasticism of things like, I mean, Saint Moses, the Ethiopian, right, is on the run. He goes into this monastery and he ends up joining it. Right. And, you know, the. The famous messengers of St. Vladimir, you know, come into the church and don't know whether they're in heaven or on earth. Right. There. There are times where the spirit is present in a place where worship is happening and grips people who come in, Right. People. People who enter are. Are seized by it. Hopefully they don't take off all their clothes and roll around on the floor. I'd prefer you not do that at my parish, if you don't mind."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3215.75,"end":3218.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes. We have a dress code and it involves."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3218.15,"end":3223.67,"speaker":"Fr Stephen De Young","text":"If it's. If it's all the same to you, but. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3224.47,"end":3225.51,"speaker":"Fr Andrew Stephen Damick","text":"Right, so."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3228.39,"end":3233.99,"speaker":"Fr Stephen De Young","text":"Then the last little piece of this we want to touch on here in terms of this transition."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3234.23,"end":3235.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the actual handoff."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3235.91,"end":3251.46,"speaker":"Fr Stephen De Young","text":"Yeah. That passing of the mantle, Right. Which is both a physical piece of clothing and a mantle in the way that we now use that term analogically. And I don't mean over your Fireplace. I mean, as in taking up the mantle."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3251.7,"end":3256.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's a long piece of cloth. Right, Right. Yeah. That's what it is."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3258.9,"end":3270.01,"speaker":"Fr Stephen De Young","text":"And so Elisha prays as Elijah is being taken up in heaven and join the council that he would have a double portion of Elijah's spirit."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3271.93,"end":3272.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What's that about?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3273.29,"end":3300.61,"speaker":"Fr Stephen De Young","text":"And that. That wording is kind of important. Right. Because he doesn't say, I want a double portion of the spirit of God that Elijah had. Like, this isn't. I want to be twice as good as Elijah. Right. Like I would be twice as powerful as Elijah. This is about. About his relationship with Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3301.33,"end":3301.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3301.73,"end":3308.93,"speaker":"Fr Stephen De Young","text":"Because what's happening is Elijah, his beloved friend and mentor, is now being parted from him."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3310.05,"end":3310.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3310.49,"end":3325.93,"speaker":"Fr Stephen De Young","text":"And he's praying that this would not separate him from Elijah. But their relationship now, as Elijah goes in heaven, their relationship would be more redoubled, would be deeper and richer and greater rather than less."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3326.09,"end":3329.61,"speaker":"Fr Andrew Stephen Damick","text":"Because it continues. It continues."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3330.57,"end":3364.5,"speaker":"Fr Stephen De Young","text":"Right, Right, right. And then. And then he receives the piece of cloth. Right. As a symbol of this being answered, of this being true. Right. He's going to walk around wearing this piece of Elijah's clothing. Right. As the sort of sign of this continued relationship. And what he does with it is because since he has to cross the Jordan is he takes that mantle, strikes the Jordan with it, and the Jordan splits in two so that he can cross over."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3364.82,"end":3379.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where is the God of Elijah? Yeah. As he says that. Which, of course, this is one of the passages that gets ready at theophany. Right. Where you get almost every single passage from the scripture having to do with water. But. But I."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3379.95,"end":3382.19,"speaker":"Fr Stephen De Young","text":"This one is not the real reason. But anyway."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3382.51,"end":3386.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right. Well, yeah, we'll have to do an episode of that. But it is true. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3386.11,"end":3390.43,"speaker":"Fr Stephen De Young","text":"This is connecting that to Joshua entering Canaan."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3390.75,"end":3394.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Where the Jordan parts in the same. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3394.39,"end":3409.2,"speaker":"Fr Stephen De Young","text":"The Jordan parted so they could march in. Marched in ark first. They. They marched in as an invading army. Right. And so this is the sign that that spiritual warfare that characterized The Ministry of St. Elias is now going to continue with Elisha."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3410.48,"end":3418.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Very cool. All right, well, that wraps up act one, and we're going to take a short break, and we'll be right back."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3418.72,"end":3450.44,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. Hi, this is John Maddox. You know, when you support Ancient Faith Radio. You're not only helping to make this ministry possible for you, but also for people like Bryce in Australia."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3451.22,"end":3453.02,"speaker":"Fr Andrew Stephen Damick","text":"I'd firstly just like to say that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3453.02,"end":3456.98,"speaker":"Fr Stephen De Young","text":"I love your show and what you do. It means a lot to all of us listening."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3457.3,"end":3459.7,"speaker":"Fr Andrew Stephen Damick","text":"I'm down in Australia and over here."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3459.7,"end":3462.02,"speaker":"Fr Stephen De Young","text":"Orthodoxy is basically unheard of."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3462.58,"end":3463.74,"speaker":"Audience Member","text":"I'm not Orthodox."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3463.74,"end":3466.58,"speaker":"Fr Stephen De Young","text":"I was raised into an Evangelical Protestant family."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3467.3,"end":3469.74,"speaker":"Fr Andrew Stephen Damick","text":"However, from a gradual exposure and desire."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3469.74,"end":3474.98,"speaker":"Fr Stephen De Young","text":"To learn more about Orthodoxy, I've come to agree and see truth in pretty much everything the church teaches."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3475.38,"end":3477.73,"speaker":"Fr Andrew Stephen Damick","text":"The nearest English speaking Orthodox church church."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3477.73,"end":3479.81,"speaker":"Fr Stephen De Young","text":"Is several hours away and I feel."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3479.81,"end":3485.69,"speaker":"Audience Member","text":"All alone in my pursuit of the faith here. Currently, my only exposure to Orthodoxy is through Ancient Faith Radio."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3485.69,"end":3489.45,"speaker":"Fr Stephen De Young","text":"And my friend, how should I introduce the idea that I may be inquiring."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3489.45,"end":3492.85,"speaker":"Audience Member","text":"Into Orthodoxy to my parents? Thanks again, Bryce."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3493.25,"end":3506.94,"speaker":"Fr Stephen De Young","text":"Would you consider a donation to AFR right now? You can do so on our app or go to our website@ancientfaith.com Support Ancient Faith Radio here for you and for."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3506.94,"end":3508.38,"speaker":"Fr Andrew Stephen Damick","text":"People all over the world."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3518.06,"end":3534.21,"speaker":"Fr Stephen De Young","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3535.97,"end":3549.65,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, voice of Steve. Welcome back, everybody. We have a couple of callers that we wanted to get to who have been patiently waiting. And so the first one that we've got is Perdomo in Texas. So are you there? Welcome."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3551.57,"end":3552.77,"speaker":"Audience Member","text":"Hello? Yes, I'm here."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3553.73,"end":3559.7,"speaker":"Fr Andrew Stephen Damick","text":"My audio. All right, good. Well, welcome to the podcast. What's your question for us this evening?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3561.38,"end":3589.31,"speaker":"Audience Member","text":"Well, I've got a question about the ur sacrifice, if you will, of Abel and I guess also the sacrifice of Cain, because those always come together. If you don't mind, I'll break it up into a couple little questions. The first being in the sense that, you know, since folks didn't eat meat until the time of Noah, so we're told, was the first sacrifice just a sacrifice of blood and smoke?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3593.47,"end":3598.39,"speaker":"Fr Andrew Stephen Damick","text":"So you're asking exactly what was being sacrificed in the time of Abel and."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3598.39,"end":3608.36,"speaker":"Audience Member","text":"Cain and what was being sacrificed and how. What was the nature of Abel's sacrifice, you know, at this block."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3609.08,"end":3663.69,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, so we're not given much in the way of details, but if you listen, for instance, to our episodes where we talked about sacrifice, then you can hear an outline of what we do know in terms of the details of, of sacrificial worship in the ancient world. But I mean, the basic Outline of it is it's. It's food being offered to your God. Right. And then it's a shared meal with that God. Right. So in Cain's case, he's offering vegetables, and in Abel's case he's offering from his flock. Right. But the scripture tells us that what's different about them is not. Just. Is not so much the thing that they offered, because, you know, it's not that God rejects vegetables because he commands vegetables later to be offered, especially grain and stuff, but rather that the way that they did it, you know, what was in their hearts was. Was really the difference. Father Stephen, Adam, did you have anything you wanted to add or correct for that?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3664.01,"end":3672.09,"speaker":"Fr Stephen De Young","text":"Yeah, well, I think he was getting at the. The eating part and. Yeah, presumably it would have been on Abel's part a whole burnt offering."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3672.89,"end":3680.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So offered completely to God then. And then probably a sprinkling or anointing or something like that with the ashes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3680.41,"end":3681.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3681.69,"end":3682.53,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3682.53,"end":3709.55,"speaker":"Audience Member","text":"Yeah, that makes sense. Purification of the space. And then with Cain's offering, since, you know, again, not a bad offering. And this, you know, our Eucharist is in part a grain offering, but so is it, you know, so. But even he was presumably partaking of it, which makes it a. Makes it a bit more like the."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3710.67,"end":3711.79,"speaker":"Fr Andrew Stephen Damick","text":"Fruit from the garden."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3712.52,"end":3723.96,"speaker":"Audience Member","text":"And is it, you know, is it safe. Would it be safe to say that the angels that Khalil taught came to make that sort of sacrifice before he was ready, before it was permitted?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3727.48,"end":3858.22,"speaker":"Fr Stephen De Young","text":"Yeah. There's famously not a lot in the text to tell us why. People have all kinds of suggestions and surmises about why Cain's offering was bad. And I think the best guess is as. As Father Andrew said, that it wasn't about the offering itself or even how he did it, but it was about what was going on in his heart and. And who he was. That's alluded to in First John, Right, where it talks about how the works of. Of Abel were good and the works of Cain were evil. And I don't think it's just talking about sacrificial procedure there. I think it's talking about works like their deeds, the way they lived in the world. Right. Because one of the big problems in the Old Testament is that most people had the idea because this is sort of how pagans operated. Like the pagan gods didn't care what was in your heart. Right. Like you make offerings to them and you tell them they're great. They don't care if you really mean it. Right. They're not like, you know, super investigative of this. And so we see points in the prophets where the Israelites are, you know, raising Cain, pardon the pun, and, but still doing the sacrificial offerings as if that makes it okay. Right. Well, God will still be happy with us because we're giving him his goats and his bulls and his blood. And so he's taken care of so we could just do as we please. Right. And so God eventually, through the prophets is telling them, just stop with the sacrifices. I don't delight the blood of bulls, of goats. I don't want them anymore. So I think that's probably the best idea of what's going on with Cain is it's not the problem isn't that he offered the wrong kind of sacrifice or followed the wrong procedure. Right. That would be how, how the pagans would think you, you would have God not accept your sacrifice. Oh, you blew the procedure. Right. You, you made a mistake somewhere. But that it's the fact that Cain's heart was far from God and so God wasn't interested in his sacrifice if he couldn't have his heart."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3859.18,"end":3861.34,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, does that make sense to you, Perdoma?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3863.1,"end":3882.5,"speaker":"Audience Member","text":"Sure, sure, that makes sense. I mean, is it. I mean, I guess one follow up question coming to me now is so then it's an open question whether Cain and Abel were taught by God how to make the sacrifice or not."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3883.22,"end":3884.74,"speaker":"Fr Stephen De Young","text":"Well, yeah, we're not told."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3885.14,"end":3889.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it doesn't say. It just simply doesn't say. We just see them doing it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3889.94,"end":3890.5,"speaker":"Audience Member","text":"All right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3890.58,"end":3898.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right, well, thank you very much. So we've got Nick on the line calling from California. So Nick, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3900.11,"end":3900.83,"speaker":"Audience Member","text":"Thank you, Father."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3900.99,"end":3905.63,"speaker":"Fr Andrew Stephen Damick","text":"Bless God bless you. What's your question or comment for us this evening?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3906.75,"end":3985.27,"speaker":"Audience Member","text":"So I was, when you were talking about David and his sin and repentance, come to my mind. Prodigal son. So he asked for his inheritance. The father gave it to him. He weighed wasted and came back. And the father was pleased and happy. And he gave him a dress, ring and a, and a piece. And the older son said, he asked the father why he's doing that. And the father said, because he was dead and he's alive. And also father said, oh, what is mine? It's yours. So my question is, what happened to the prodigal son inheritance? And I have teenager boys and I always compare this to in case if things go astray, I always tell them, boys, watch out for your inheritance because I'm not sure if you're Gonna get it back. And am I right or wrong or. I don't know, what should I say for that situation?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":3986.71,"end":4041.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I mean, the prodigal son definitely goes and wastes what he takes with him. Right? That's gone. But the point that the parable is making is that it's really not even about things that he gets from his father, but rather being part of the father's household and that what the father has is what's. Is what really is important. Right? So, I mean, it's not like, it's not like God has a finite amount of gifts to give mankind that he's going to run out. Right. So. So we shouldn't come away with a kind of economic reading of the parable, you know, in terms of application for our own lives. But, but, you know, so, I mean, if, if, yeah, it just doesn't work. It just doesn't work well that way. Does that make sense to you?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4043.03,"end":4071.36,"speaker":"Audience Member","text":"Well, then, you know, certain people can be priests, and if they commit something way sinful than appropriate to be a priest, they are not allowed to be a priest. So this, they, they lose their inheritance to be. To. I don't. For me, it's incomplete answer. I don't. Forgive me, Father, but you know, then why the father is saying, oh, what is mine? It's yours to the other son."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4071.92,"end":4074.72,"speaker":"Fr Stephen De Young","text":"Right? Let me, let me. Actually, Father Andrew."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4074.72,"end":4075.44,"speaker":"Fr Andrew Stephen Damick","text":"Okay, go ahead."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4076.8,"end":4087.66,"speaker":"Fr Stephen De Young","text":"So, and this is, this is why this is a really important question, is the term inheritance is incredibly important, important in the Bible."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4088.06,"end":4089.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4089.82,"end":4108.7,"speaker":"Fr Stephen De Young","text":"And understanding this is incredibly important. But one of the things we chronically misunderstand about the parable of the prodigal son, which is emphasized by the fact that we call it the parable of the prodigal son, is that it's not just about the prodigal son."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4110.3,"end":4111.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. His brother too."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4111.42,"end":4128.13,"speaker":"Fr Stephen De Young","text":"If you read the parable closely, it begins with, there was a man who had two sons. Two sons. Right, two sons. And it's also important that the other son, besides the prodigal son, is the older brother."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4129.73,"end":4130.25,"speaker":"Audience Member","text":"Okay."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4130.25,"end":4131.25,"speaker":"Fr Stephen De Young","text":"The older brother."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4131.49,"end":4133.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. He's the one who gets the inheritance."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4133.65,"end":4171.05,"speaker":"Fr Stephen De Young","text":"Right. So if things had functioned the way they were supposed to, right. Then when the father died. Right? And this is what he says. When the father dies, the oldest son inherits everything in that system, and then it is his job to then distribute the inheritance to his siblings to the other sons. Right. Because the, the, the daughters would have become part of other families. So part of why the older brother is upset is that the prodigal Son had no right to that money."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4171.61,"end":4171.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4171.93,"end":4173.05,"speaker":"Fr Stephen De Young","text":"That he took and wasted."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4173.05,"end":4173.37,"speaker":"Audience Member","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4173.37,"end":4287.66,"speaker":"Fr Stephen De Young","text":"That money would have actually gone to the older brother. But the, the theme is not just about the prodigal son. The theme of the parable is about the older son learning something. That's where it ends, is with the older son learning something. Because part of what the father is telling him is that when the father dies, it's going to be the older son's job to take care of his brother. Right. Because regardless, the prodigal son under no circumstances would have inherited anything directly from his father. Right. And so the older brother can either maintain that grudge against him and cut him off and throw him back into the pig pen. Right. Or he can learn the lesson and learn to love his brother the way the Father loves his son. So this parable was being directed by Jesus in part to the Pharisees who were begrudging the sinners, the tax collectors, the repentant, later on, the Gentiles who were coming to follow God. Right. And it wasn't just a question of God loving those people, so leave them alone. It was God loves. You need to learn to love them too. Because, in fact, you're the ones who have received the religious inheritance, like St. Paul is a Pharisee. You've received the Torah, you've received the oracles of God. You've received the revelation and the worship of God. You need to be loving them and taking care of them and helping them come in, not being resentful or angry toward them. So that's really what's going on, I think, in the, in the parable. So, so that's, you know, we, we all find our salvation in the church together, not as a bunch of individuals."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4288.3,"end":4288.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4288.78,"end":4305.55,"speaker":"Fr Stephen De Young","text":"And if inheritance is our salvation, we don't find that off on our own because we deserve it. And we have this direct relationship with. With no community. Right. With God. But we find that together as we love each other and support and help each other."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4305.79,"end":4382.69,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, and Nick, to your question about if a priest commits a particular sin, he can lose his priesthood permanently. I don't think that the reason for that is because of what's in the parable of the prodigal son. Rather, it's, you know, there are all kinds of things that are impediments to serving in the priesthood, you know, and some of them are sins and some of them are not sins. Like if, you know, say, for instance, someone is born without legs, he could not be ordained. That's an impediment to the priesthood. He didn't do anything wrong. Right, but there are some things that you can do wrong that make it so you could get deposed from the priesthood. And it's. Yeah, I mean, one could metaphorically call that squandering your inheritance, but. But that's a very broad use of it as a metaphor. I mean, the true inheritance is salvation. Right. It's not about serving in the priesthood, because even someone who's been deposed from the priesthood could become a saint. There's never a permanent loss for salvation as long as someone is going to be faithful. It's much more about what's expedient in terms of serving in the priesthood. So there's not exactly a one to one, you know, application of this to that particular situation. Does that make sense? Nick?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4383.89,"end":4400.53,"speaker":"Audience Member","text":"Yeah, I didn't frame my question properly. I meant to say if I do something, this will limit my abilities to advance in my orthodoxy, like become a priest or. I don't know. That's what I meant to say."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4400.77,"end":4402.21,"speaker":"Fr Andrew Stephen Damick","text":"Sure, yeah, already."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4403.34,"end":4423.82,"speaker":"Audience Member","text":"Because, you know, in the orthodoxy we have limitations, like who can be and who can't. So that's good thing, too. And thank you, Father, for this wonderful explanation. And can I follow up with the other previous caller about Canaan and Abel and Noah?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4424.22,"end":4453.59,"speaker":"Fr Andrew Stephen Damick","text":"Well, we have other callers waiting, so we need to kind of move on to them. But I just wanted to add this one thing to something you said, which is advancing in orthodoxy does not necessarily mean ordination. In fact, ordination for some people could actually be a regression in orthodoxy. It could be bad for their salvation. Yeah, yeah, yeah. All right, well, thank you very much, Nick. Okay, we're going to take one more call and then we're going to move on. And we have Matt calling from Houston. So, Matt, are you there?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4454.71,"end":4456.55,"speaker":"Audience Member","text":"Yes, Fathers, I am. Can you hear me?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4456.79,"end":4459.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4459.15,"end":4465.16,"speaker":"Fr Stephen De Young","text":"Now, is your name really Matt or is this a joke about the Matt Houston television program?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4467.24,"end":4468.44,"speaker":"Fr Andrew Stephen Damick","text":"Wow. No, no."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4468.6,"end":4476.56,"speaker":"Audience Member","text":"Okay, well, legally my name is David, but things get complicated digging in the."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4476.56,"end":4477.8,"speaker":"Fr Stephen De Young","text":"Crates on the tv. References."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4478.6,"end":4483.48,"speaker":"Audience Member","text":"Yeah, my full name is David Matthews, so there's an abundance of Dave Matthews references to be made, too."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4483.8,"end":4484.28,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4484.28,"end":4485.8,"speaker":"Fr Stephen De Young","text":"Ants go marching and all that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4485.8,"end":4486.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4486.52,"end":4488.12,"speaker":"Audience Member","text":"Oh, yeah, definitely."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4489.97,"end":4492.37,"speaker":"Fr Andrew Stephen Damick","text":"So what's up, David? Matthew from Houston."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4493.73,"end":4530.27,"speaker":"Audience Member","text":"Okay, so a few times on the show, you guys have talked about how humans interact with the cosmos in four primary ways. Right? So language, music, art, and ritual. And how one of the big issues that we have in Western culture amongst the many that there are, is that we tend to reduce the last three into language. So, you know, that's like people having their noses buried in their service books during liturgy rather than just participating."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4531.07,"end":4531.47,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4533.31,"end":4575.09,"speaker":"Audience Member","text":"That'S what bad looks like. But, I mean, presumably there is some value in using language to explain the last three forms and to attest to that. I mean, there's a. Sorry, there's a huge body of work on ancient faith that is using language to describe the liturgy and iconography. So I guess what my question is, could you all just flesh out a little bit what that balance looks like between using language. Well, to describe these things that sort of transcend language and how to know perhaps when you've taken it too far."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4577.73,"end":4719.74,"speaker":"Fr Andrew Stephen Damick","text":"So I would say the point at which you've taken it too far is when you're excluding the other things, you know, when you're distorting them or excluding them. Right? So, you know, the person who refuses to go to church but says, I can read it at home, and that's all you know, because I don't want to go to church. There's people there. You know, the priest is a bad preacher or the choir is terrible, or I don't like the way the incense smells. I'm just going to read. I'm just. I can read it at home. And that's the same thing. So that is. Wouldn't be an obvious distortion or reduction of it. You know, by no means are we, by saying that things should not be reduced to language, are we, you know, denouncing language. I mean, we're. This is a podcast, right? We're sitting here talking. So, you know, by no means, right. Father Stephen and I both love language and are dedicated to it in a lot of ways. But, yeah, I mean, there's a lot in the Bible about bad use of language, right? So lying is a misuse of language. You know, idle talk, right? Just going on about nothing useful, especially when it becomes harmful to other people around you. Those would be, you know, you know, persuading people for your own advantage rather than for the truth. Right? So there's all kinds of ways to misuse language, right? Just as there's ways to misuse music and, you know, misuse ritual. Like, these things can all. They all have their. Their abuse as well as their. Their proper use. But. But yeah, I think balance is the key. And. And I think that balance is maybe going to look a little bit different for. From one person to the next. Like, if you're a monastic, your engagement with ritual is going to be way more than the average person Right. If you're a, if you're a preacher, a teacher, your use of language is going to be way more and quite different from the average person. So I don't think that we can necessarily set up a one size fits all. But I think the point when you're cutting stuff out, it should be a red flag. And of course, like I said, abusing it for, for nefarious ends rather than to use it to the glory of God as all these things were designed. Father Stephen, did you have any, any actuallys or anything?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4720.14,"end":4731.9,"speaker":"Fr Stephen De Young","text":"Not an, um, actually per se, but I mean, I, I, I mean, I think there are examples, right, that might help explain because it's, it's a balance, right. It's like all virtue. It's the mean between two extremes, right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4732.06,"end":4732.62,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4733.5,"end":4755.95,"speaker":"Fr Stephen De Young","text":"So you look at, right, the hymns of the church, right? If, if you have no idea what the words are, and you're walking around humming tone eight, Right. You, you would very clearly know that. Okay, well, that's missing something, right? I'm missing the language, right. I'm missing the words. I'm missing the communication, the hymn, the words, what's being taught by it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4756.51,"end":4756.91,"speaker":"Audience Member","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4756.91,"end":4826.83,"speaker":"Fr Stephen De Young","text":"At the same time, we know full well that sitting there and just reading the text without the music, right. Without it being chanted without anything, just reading it as prose on paper, there's something missing. Right. Like that's not the same experience as, as singing the hymn. Right. And so the correct is when you have both of those together, right. And then when you're singing those hymns together in the liturgical space, in the context of the liturgy, now you've added ritual, right. And when it's on a feast day and you're singing the troparian of the feast and the icon is there of the feast, right. These things all get brought together. So the, the issue isn't just that like there's some perfect percentage of, or ratio of language to art, to ritual, to music. It's that these things have to operate together and can't be pulled apart and separated out without losing something."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4827.71,"end":4873.83,"speaker":"Audience Member","text":"Sure, sure. And now that y' all have fleshed it out a little bit more, I think that I've realized that my, that the area in which I'm, in which my mind is focused on is particularly engagement with non Orthodox Christians. I'm a very naturally argumentative person, say. And so I recognize that about myself and I try to limit that as much as I can, and I try to limit over explaining things to people because I really enjoy explaining things. But I've Heard stories of people who had a lot of questions and then they go and sit in front of the icon of the Virgin Mary and, and just somehow their questions feel answered."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4875.43,"end":4875.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4875.91,"end":4890.79,"speaker":"Audience Member","text":"And so I think that's a little bit more where my mind was thinking about perhaps encouraging non Orthodox Christians to just go to liturgy and then when they get there, don't over explain it to them maybe, but I don't know."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4890.95,"end":4902.28,"speaker":"Fr Stephen De Young","text":"Yeah, you were sort of reducing the question of reducing things to language. To language and. Which is like an inception. So."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":4904.68,"end":5074.69,"speaker":"Fr Andrew Stephen Damick","text":"You know, the other thing that I would add, Matt, as, as someone who's, who has a strong proclivity to be a talker is, you know, it's easy to spend time trying to convince people of something and, and that, you know, that, that maybe can be fruitful sometimes, but there is a use of language that is actually very powerful and that is to pray for those people. Right. We shouldn't enter into theological conversation without prayer before and after because it's just very dangerous to do that otherwise. Right. And I mean, I'll be the first to admit that I don't always do that because I often forget because I'm, you know, I'm a sinner. But I have found that when I'm going to have conversation with somebody about theological things or even just like, okay, I'm going to be, you know, interviewing somebody or being interviewed by somebody or just having a conversation with my wife or my children or whatever, I try to pray beforehand. Even if it's just to make the sign of the cross and say, lord, bless this conversation. Even if it's just that. Right. And then you're offering the words to God and asking him to bless them and shape them. And that's going to be much more powerful than, you know, even if you're just a really great debater. Right. People being convinced into worshiping Christ through the power of debate is just not a thing. You know, I mean, I've watched people be destroyed by the power of somebody else's debate who then later, who then later, you know, dedicated themselves to Christ. But generally speaking, when someone just sort of destroys someone else by the use, and I'm not saying you do that, I don't know you. But you know, this is as a distortion or abuse of the use of language. When someone destroys someone else with a debate, typically what happens in response to that is not faithfulness to Christ, it's usually that that person is like, you know, is turned away from Christ, especially if that person who's debating them sets themselves up as his representative. You know, there is a place for debate, you know, especially for defending the simple and the faithful against being undermined. But, you know, that doesn't happen that often in most people's lives. You know, that you're called upon to protect the flock. The flock has shepherds, you know, and that's not most of us. So, you know, for whatever that's worth. So is that helpful?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5075.57,"end":5077.01,"speaker":"Audience Member","text":"Yes, yes, very much so."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5077.25,"end":5091.09,"speaker":"Fr Andrew Stephen Damick","text":"Great. All right, well, thank you very much for calling, Matt. Okay, well, rolling along, and this is weird. Here we are, Lord of Spirits, and we're actually in Act 2, beginning to explicitly talk about the subject of our episode. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5091.09,"end":5092.63,"speaker":"Fr Stephen De Young","text":"So varying up the format."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5092.79,"end":5095.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's. Yeah, we got to shake things up a little. I just."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5095.31,"end":5104.63,"speaker":"Fr Stephen De Young","text":"I just wanted to add, since apparently we're getting a fair number of calls. Guys, go easy on John. It's his first day. Be nice."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5105.27,"end":5106.71,"speaker":"Fr Andrew Stephen Damick","text":"I'm doing fine, thanks."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5106.71,"end":5107.71,"speaker":"Fr Stephen De Young","text":"Oh, thank you."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5107.71,"end":5108.15,"speaker":"Audience Member","text":"Hey."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5108.71,"end":5134.29,"speaker":"Fr Andrew Stephen Damick","text":"Wow. So, all right. John Maddox, everybody. My boss, by the way. You know, after God and the bishop, but. Yeah, and my wife, but. All right, so. Okay, well, this episode is about St. John the Forerunner, and we need to establish exactly who he is. And what better way to do that than to talk about his parents dying? Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5134.77,"end":5136.21,"speaker":"Fr Stephen De Young","text":"It's like a Disney movie."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5136.37,"end":5147.98,"speaker":"Fr Andrew Stephen Damick","text":"Seems Right, Exactly. Why is it that so many Disney movies always start with the main character being orphans? Like Disney loves to kill people's parents. Man, that's frequent."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5148.62,"end":5150.98,"speaker":"Fr Stephen De Young","text":"Yeah, it's like every movie. But."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5150.98,"end":5151.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5153.5,"end":5187.68,"speaker":"Fr Stephen De Young","text":"Yeah. So, but that is. That is sort of how the story of St. John the Forerunner starts. But the specifics of this is important to. The reason we were talking about St. Elias, about the prophet Elijah, is that he is connected in many important ways to St. John the Forerunner. And so to show a very important one of those connections, we need to talk about the eventuality surrounding the death of his parents."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5187.76,"end":5188.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5188.16,"end":5214.49,"speaker":"Fr Stephen De Young","text":"Zachariah and Elizabeth, and so both saints in their own right. And there is not a lot, as in almost nothing about this in the New Testament itself. We've got basically one verse, and that's Luke 1, verse 80. Yes. There are more than 80 verses in the first chapter of St. Luke's Gospel."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5216.33,"end":5259.15,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, yeah. I mean, it's a very slight little reference to St John having been taken into the wilderness by his mother. And it says, and the child grew and became strong in the spirit, and he was in the wilderness until the day of his public appearance to Israel. And, you know, he's brought out there by St. Elizabeth because Herod is slaughtering all of the two year old boys and under in the region of Bethlehem. And so, you know, with this massive massacre going on, she takes him out to save him so that he doesn't get caught up in that."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5259.31,"end":5267.39,"speaker":"Fr Stephen De Young","text":"And that is. Well, first I want to highlight notice it says he was in the wilderness until the day he revealed himself."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5267.79,"end":5268.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5268.35,"end":5273.62,"speaker":"Fr Stephen De Young","text":"But lo and behold, when we read the story of him revealing himself, he's still in the wilderness. Wilderness."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5273.78,"end":5276.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't get it. Like an apartment in town."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5276.9,"end":5285.78,"speaker":"Fr Stephen De Young","text":"Yeah. And so there's, there's folks out there who need to hear this. The word until in the Bible doesn't mean that something changed afterward."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5286.18,"end":5289.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just means up to that point doesn't."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5289.26,"end":5292.26,"speaker":"Fr Stephen De Young","text":"Say anything about what happens after, you know who you are."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5292.82,"end":5298.26,"speaker":"Fr Andrew Stephen Damick","text":"So. Right, so living out there in the desert."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5298.67,"end":5375.08,"speaker":"Fr Stephen De Young","text":"Right. So we have this one that just he as a child is living out the desert and growing up out in the wilderness. That's all. That's the only reference we have. Now church tradition, which is a fancy way of saying the history of the Church that's been handed down to us, and we've talked before about how modernism somehow thinks that, that history written down by pagans is history and history written down by Christians is a pack of lies. But the reality is that, that it's just as valid, if not more so when written by Christians. And so they fill that out with this story that as part of, of Herod's murders, his slaughter of the innocents you were describing, they came for Saint Saint John. And when his father, Saint Zacharias at the temple refused to reveal his location, they killed him. And then his mother, St. Elizabeth, took St. John out into the wilderness as an infant and ended up dying there 40 years later."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5375.96,"end":5377.16,"speaker":"Fr Andrew Stephen Damick","text":"40 days. 40 days later."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5377.16,"end":5386.19,"speaker":"Fr Stephen De Young","text":"40 days later. Sorry, 40 days. Yeah, 40 days later. And so then St. John grew up in the wilderness, not alone."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5387.31,"end":5387.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5387.67,"end":5389.07,"speaker":"Fr Stephen De Young","text":"But with the angels."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5389.71,"end":5392.19,"speaker":"Fr Andrew Stephen Damick","text":"Right. Basically he was fostered by angels."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5392.51,"end":5427.79,"speaker":"Fr Stephen De Young","text":"Right. And that. So he was living this same kind of life. Right. That, that we see the prophets of the Old Testament leading. And there is actually another passage that refers to these events in the New Testament. But for reasons not entirely clear to me, people are very hostile towards reading this passage as endorsing what the Church has universally said about the childhood of St. John, the forerunner for 2,000 years."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5428.19,"end":5479.98,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. So this is Matthew, chapter 23, verses 34 and 35. And this is the Lord speaking. He says, therefore I send you prophets and wise men and scribes, some of whom you will kill and crucify some, you will flog in your synagogues and persecute from town to town, so that on you may come all the righteous blood shed on earth, from the blood of righteous Abel to the blood of Zechariah, the son of Berechiah, whom you murdered between the sanctuary and the altar. So the traditional reading is that when Christ makes reference to this Zachariah who gets killed between the sanctuary and the altar, that this is in fact the Zachariah who is the father of St. John the Forerunner. Now, the. The problem with this, you know, for those who don't want to believe that this is the same one, is that there's a lot of people named, like, it's a really common name. Zachariah is a really common name, right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5479.98,"end":5523.45,"speaker":"Fr Stephen De Young","text":"Well, yeah, there's a. There's a. Yeah, there's a bunch of. So for those who are motivated to just say that anything in church tradition is wrong for some reason. And these are mostly Christians. So again, I don't understand exactly why that's your race on debt, but, hey, that's where we are. So there's a whole bunch of problems with reading. So first of all, you have. Well, if he's not. Well, we'll start here. The natural reading is that he's talking about Saint Zechariah, Saint John's Father. And the reason I say it's the natural reading is that you may have noticed when Father Andrew was reading those two verses that you. And it's a plural you."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5523.77,"end":5524.13,"speaker":"Fr Andrew Stephen Damick","text":"Y'."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5524.13,"end":5524.33,"speaker":"Audience Member","text":"All."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5524.49,"end":5525.33,"speaker":"Fr Stephen De Young","text":"It's all y'."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5525.33,"end":5525.53,"speaker":"Audience Member","text":"All."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5525.69,"end":5526.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5527.77,"end":5530.41,"speaker":"Fr Stephen De Young","text":"Is used several times. Okay."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5530.49,"end":5534.97,"speaker":"Fr Andrew Stephen Damick","text":"I say you prophets, you abuse them, you fog them, you persecute them."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5535.29,"end":5568.16,"speaker":"Fr Stephen De Young","text":"Right? You will do this. You will do. That's future tense, right? So he's talking to the Pharisees and the scribes, right? It's very clear at the beginning. He's sending to them, to. To the leaders of Judah. He's sending them prophets. He's sending the people, and they're going to persecute them, right? And. And then they will come on you will come on the people. I'm talking to. All that blood from Abel to Zechariah is going to come on you. And then he says, zechariah, whom you killed."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5568.88,"end":5569.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5569.44,"end":5589.96,"speaker":"Fr Stephen De Young","text":"Right. So to take this as not referring to someone who died real recently, right? Unless this is someone who died in the last, you know, 40 years, right? The last generation. You have to say that. That you means something different than all the other use in those sentences, right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5589.96,"end":5592,"speaker":"Fr Andrew Stephen Damick","text":"Which doesn't make sense."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5592.32,"end":5596.92,"speaker":"Fr Stephen De Young","text":"Right? So that's the natural reading. Is this is someone who. This is something that just happened. Right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5596.92,"end":5597.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5597.48,"end":5621.04,"speaker":"Fr Stephen De Young","text":"Now you can add to this the kind of preposterousness of. Or preposterosity. I don't know what the word is, but of the counter suggestions, the. The funniest one that I've heard is someone who I guess was just reading this in the King James or something and only in English because they said, look, this is all the martyrs from A to Z. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5621.04,"end":5628.12,"speaker":"Fr Andrew Stephen Damick","text":"Abel to Zachariah. Yeah. Which, like, like, I mean, there is no A to Z in Hebrew or in Greek."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5628.52,"end":5628.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5628.88,"end":5630.28,"speaker":"Fr Andrew Stephen Damick","text":"Like that's not the way."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5630.28,"end":5633.88,"speaker":"Fr Stephen De Young","text":"Famously, the Greek Alphabet is alpha and omega."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5633.88,"end":5637.4,"speaker":"Fr Andrew Stephen Damick","text":"Omega. Yeah. Zeta is. Zeta is a way. A ways back."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5637.96,"end":5643.96,"speaker":"Fr Stephen De Young","text":"Yes. So not Hebrew, not Aramaic. Z is not the last letter. So that. That makes no sense."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5643.96,"end":5647.72,"speaker":"Fr Andrew Stephen Damick","text":"That's kind of zed for our Commonwealth listeners."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5647.8,"end":5680.19,"speaker":"Fr Stephen De Young","text":"Oh, yes, welcome Canada. So wither. Canada. Anyway, so one of the more common ones that's not utterly ridiculous. Right. Is people will point to the Zechariah, the. The priest who is killed in the temple, by the way, between the altar and the high place. Right. Remember the altar of burnt offering was. Was sort of outside the central building around the holy. This isn't in the holy of holies."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5680.35,"end":5680.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5681.07,"end":5699.55,"speaker":"Fr Stephen De Young","text":"This is between the place where the holy place and the holy of holies were and the altar of burnt offering that's outside. So this is in the temple courts that people are being killed. So there is a Zechariah who is killed in the temple in Second Chronicles 24, verses 20 and 21."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5700.59,"end":5703.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. So some people suggest that that's him and some."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5703.79,"end":5721.07,"speaker":"Fr Stephen De Young","text":"Right, Right. And. And I have a guess at the reason for this. And. And that's that in the ordering of what becomes the Hebrew Bible, once they collect all the books in Hebrew into the what, the Hebrew Bible, Second Chronicles is the last book."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5722.75,"end":5726.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. So again, this. This is an A to Z sort of argument."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5726.51,"end":5767.32,"speaker":"Fr Stephen De Young","text":"Genesis 2, right? Yeah. Abel, Genesis 4 all the way to the end of Second Chronicles. So this is. See, it's the whole quote unquote, canonical scripture. So if you're of the bent, and we all know who we're talking about who hold the Hebrew Bible to be the canonical scriptures, then you could say, ah, and I've even heard people use. Try to use this as a proof for the Hebrew canon. Turn it around and try and use it as a proof for the Hebrew canon. There's a couple problems with this. Number one, the books hadn't been compiled in this way yet at the time Jesus said it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5767.64,"end":5768.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5768.84,"end":5778.2,"speaker":"Fr Stephen De Young","text":"So if you think Jesus actually said it, which I do, then that doesn't work. There's also the problem that, that Zechariah in Second Chronicles is the son of Jehoiada."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5778.76,"end":5779.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5779.48,"end":5780.96,"speaker":"Fr Stephen De Young","text":"Not Berechiah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5780.96,"end":5781.64,"speaker":"Fr Andrew Stephen Damick","text":"Not Berechiah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5781.71,"end":5797.23,"speaker":"Fr Stephen De Young","text":"Yeah. And you will get some people who engage in some extreme special pleading to try and say, well, Jehoiada is his grandfather, so he's the son of both, you know, or something. But there's no evidence of that actually in the scripture. They're just trying to come up with something."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5797.63,"end":5806.67,"speaker":"Fr Andrew Stephen Damick","text":"Right, so there's another, there's another candidate, right, which is the, the Zechariah who writes the book of prophecy in the Old Testament. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5806.67,"end":5807.67,"speaker":"Fr Stephen De Young","text":"Called Zechariah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5807.67,"end":5823.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And he's. And he's. And, and, and slightly more believable, his father is named Barakaya. But again, these are both really common names, you know, and here's the problem is that Zachariah was not murdered."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5824.68,"end":5838.37,"speaker":"Fr Stephen De Young","text":"Right, right. There's nothing in the Old Testament whatsoever indicating that he was murdered. And the earliest record we have of his life, that lives of the prophets I mentioned earlier, the earliest Jewish source we have, says that he died peacefully and at a ripe old age."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5838.77,"end":5839.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5839.21,"end":5843.57,"speaker":"Fr Stephen De Young","text":"Not that he was murdered in the temple. Right. So. So that part doesn't fit."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5843.65,"end":5844.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5844.61,"end":5857.65,"speaker":"Fr Stephen De Young","text":"Now, Father, Father Andrew said a couple times now that that Zechariah is a very common name. There are 27 Zechariah in the Old Testament."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5858.69,"end":5859.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5859.73,"end":5868.38,"speaker":"Fr Stephen De Young","text":"27 different people, identifiably different people named Zechariah. And Barakaya means blessed by Yahweh."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5868.86,"end":5869.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5869.66,"end":5885.26,"speaker":"Fr Stephen De Young","text":"So again, very common name. Right. So there's. There's yet another Zechariah who was murdered in the temple who's mentioned by Josephus, but he was murdered in the temple in the 60s A.D. so after Christ said this."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5885.9,"end":5888.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Decades out. Yeah. So this would be."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5889.7,"end":5900.1,"speaker":"Fr Stephen De Young","text":"Yeah, right, right. So I mean, you would think. And people present as an argument, well, how many people named Zechariah do you think were murdered in the temple? Well, at least two or three, based on the records."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5900.1,"end":5902.18,"speaker":"Fr Andrew Stephen Damick","text":"Like this seems to be a thing."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5902.5,"end":5957.98,"speaker":"Fr Stephen De Young","text":"Yeah. And one of the reasons why people get murdered in the temple and, you know, in the. Basically from the Hasmonean period on, a lot of people became high priest by assassinating the previous high priest. Yeah, that was fairly common during that period. The Sadducees are not good folks. Right, right. So there were, unfortunately. Right. So all, all of that is to say that the Christian tradition that we've received uniformly for 2,000 years about this being a reference to St. John's father and him then going and being raised, living with the angels in the wilderness and coming of age there, just Occam's razor. Right, right. This is the only thing that really makes sense of the biblical and extra biblical data that we have."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5958.86,"end":5988.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And then, and then, you know, the traditional life of Saint Elizabeth says that she dies 40 days after she takes John into the wilderness. The, the text that I looked at didn't mention how she died, just simply said that she died. So the point is, is that he's two years old, living out there in the wilderness by the Jordan river and being raised by angels. Angels are basically his, his foster parents, so to speak."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5989.18,"end":5991.1,"speaker":"Fr Stephen De Young","text":"Literally living the angelic life."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5991.26,"end":5991.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5991.74,"end":5993.71,"speaker":"Fr Stephen De Young","text":"In the way we talked about in the Old Testament."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":5994.02,"end":6015.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah, yeah, exactly. Okay, so, so, yeah, now that might seem like a long, a long sort of divergence. Right. But you know, it's important to establish that his parents are dead from an early, early age because it shows the way that he, the way that he was formed."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6015.62,"end":6016.02,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6016.1,"end":6025.29,"speaker":"Fr Andrew Stephen Damick","text":"I don't think there's anyone else in scripture and you know, that, that we get who basically grows up as an angel, so to speak, than this man."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6025.93,"end":6027.45,"speaker":"Fr Stephen De Young","text":"The Theotokos is close."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6027.85,"end":6065.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right. You know, I mean, certainly like, like we said, we get other, you get other prophets living the angelic life. But, but he's getting it from the beginning from being a 2 year old. I mean, he's a toddler. Right. And, and that's the man that we meet out at the Jordan. Right. But there are prophecies about him that connect him directly and things said about him in the New Testament that directly connect him to the prophet that we talked about in Act 1. And that's the prophet Elijah or Elias."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6065.58,"end":6077.85,"speaker":"Fr Stephen De Young","text":"Right. So it's not just that he lived the prophetic life, it is a continuation of the Old Testament prophets. But there is also a particular connection between him and Saint Elias, the prophet Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6077.85,"end":6140.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a couple of very famous passages from the prophecy of Malachi. So you've got Malachi, chapter three, verse one. Behold, I send my messenger, and he will prepare the way before me. And the Lord whom you seek will suddenly come to his temple. And the messenger of the covenant in whom you delight, behold, he is coming, says Yahweh, Sabaoth, Lord of hosts. And then Malachi, chapter four, verses five and six. Behold, I will send you Elijah, the prophet, before the great and awesome day of the Lord comes, and he will turn the hearts of fathers to their children and the hearts of children to their fathers, lest I come and strike the land with a decree of utter destruction. So there's this prophecy about Elijah coming back, this. This messenger being sent to prepare the way before the Lord comes to his temple and the day of the Lord comes, right? So this is there, you know, that Elijah's coming back."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6141.12,"end":6192.98,"speaker":"Fr Stephen De Young","text":"And we see this. This is the concern for God's holiness again, right. If God just shows up, right. There's going to be utter destruction if there's no preparation. Right. Because of. Because of his holiness. And so he's sending this messenger to prepare them, right. By turning their hearts. Right. This idea of repentance. He's going to send someone to bring about repentance so that those who repent will not be destroyed. Those who don't will be. And so we could call those who then do repent and are purified through this remnant. Right, that remnant. Here's the remnant idea coming back and being associated with this ministry of Elijah when he comes, right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6193.22,"end":6226.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, this is what St. John preaches out there at the Jordan, right? You know, there's that point where he says, you know, who warned you to flee from the wrath that is to come? You know, he asked, did you come out to here to see a reed shaken in the wilderness or whatever? But it's. He is. By his preaching, he's fulfilling this prophecy about him, which is specifically about avoiding wrath that's to come. You know, St. John is out there gathering this remnant together by his preaching."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6227.15,"end":6232.36,"speaker":"Fr Stephen De Young","text":"By his baptism, and calling them to repentance. Baptizing them for repentance."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6232.6,"end":6243.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. And telling them how to repent. You soldiers repent. Yeah. You soldiers repent this way. You parent. You know, like he's giving specific pastoral instructions. You know, this is how you repent."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6244.12,"end":6246.2,"speaker":"Fr Stephen De Young","text":"They have to do something, not just feel bad."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6246.6,"end":6249.72,"speaker":"Fr Andrew Stephen Damick","text":"That's right. They have to do something, not just feel bad."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6249.8,"end":6266.29,"speaker":"Fr Stephen De Young","text":"I've also always been a fan of how St. John greeted inquirers, which was, you brood of vipers, who warned you to flee from the wrath that is coming. I think we should put that on a sign over the door of our churches just to greet people who show up for the first time, you know."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6266.29,"end":6271.89,"speaker":"Fr Andrew Stephen Damick","text":"Wow. So, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6271.89,"end":6301.66,"speaker":"Fr Stephen De Young","text":"So this is exactly what he's preaching, right? Exactly what Malachi was talking about. And the other main passage from the Old Testament that's quoted in terms of St. John the Forerunners ministry. And when I say one of the main ones quoted, I mean all four gospel writers, this is one of those rare things where even St. John's gospel is, is aligned with the, the SynOptics is Isaiah 40, verse three."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6302.38,"end":6352.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. This is the very, very famous, probably the most famous prophecy about St. John the Forerunner. A voice cries in the wilderness, prepare the way of the Lord. Make straight in the desert a highway for our God. And then it goes on to say, you know, every valley is going to be exalted, every mountain brought low, etc. So okay, so why, you know, a lot of times the way that this gets quoted, you know, sort of, it's about the punctuation, you know, of a voice, some will say a voice crying in the wilderness, prepare the way of the Lord. The, the esv, which is what I just read for him, wrote, a voice cries colon in the wilderness, prepare the way of the Lord. So what, what's the difference there? And why does that matter?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6353.31,"end":6376.04,"speaker":"Fr Stephen De Young","text":"Right, yeah, and, and the ESV is right on that, in my non humble opinion. But yeah, and because the way that's read is, you know, a voice crying in the wilderness and people sort of ignore the. Right. Like voice crying in the wilderness. Oh yeah, yeah. St. John's out in the desert yelling. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6376.2,"end":6376.6,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6377,"end":6384.84,"speaker":"Fr Stephen De Young","text":"Right, that's him. Right. See, prophecy fulfilled, but the focus is on preparing the way of the Lord in the wilderness."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6385.32,"end":6385.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6385.88,"end":6389.8,"speaker":"Fr Stephen De Young","text":"Because this is a part of a prophecy about the end of the exile."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6390.7,"end":6399.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, look at what the next thing it says. It talks about valleys being exalted and you know, hills. Like, it's literally talking about things happening in the wilderness."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6400.3,"end":6404.86,"speaker":"Fr Stephen De Young","text":"Yeah. You know, it's making a road from Babylon to Jerusalem."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6405.26,"end":6405.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6405.74,"end":6464.79,"speaker":"Fr Stephen De Young","text":"So that the remnant who has been preserved through the exile can return home. Right. That's what the prophecy is about. And so that's, that's what St. John is doing. And that's what they're saying with this quote. Remember the quote isn't just of one line and superficial things. He's in the desert, wilderness. Hey, there you go. It's, it's referring, bringing to mind that whole passage. Yeah, right. That this is what St. John is about. This is what he's doing. Preparing. A way is literally a way, a road, a path. Right, right. And he is, he is preparing it and he is gathering this remnant. Right. And so then we get, at the end of the main part of St. John's story in the Gospels, we get this transition at the Jordan Just like we saw with St. Elias and Elisha."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6466.31,"end":6466.71,"speaker":"Fr Andrew Stephen Damick","text":"Where."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6469.79,"end":6485.23,"speaker":"Fr Stephen De Young","text":"St. John hands over to Christ that remnant, who's been purified by baptism and repentance, gives that remnant over to him to be now the starting point of his people."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6485.71,"end":6500.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I have to point out that one of the people who are part of that remnant is my patron saint, the Apostle Andrew. So he's explicitly described as a disciple of St. John. And then, you know, John is like, okay, he's yours now. Jesus."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6501.13,"end":6502.73,"speaker":"Fr Stephen De Young","text":"I thought you were gonna say St. Stephen."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6503.37,"end":6504.49,"speaker":"Fr Andrew Stephen Damick","text":"Well, he's. All right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6506.57,"end":6509.29,"speaker":"Fr Stephen De Young","text":"I want to continue to confuse people about what your name is."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6509.37,"end":6511.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6514.09,"end":6528.09,"speaker":"Fr Stephen De Young","text":"Right. And we see. Right. In our hymnography and in our iconography. Right. Again, as we've commented on before at theophany, that this. That hypnography that iconography talks about and depicts the Jordan parting."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6528.65,"end":6571.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. So there's, you know, this. This echo then, of what happens with, you know, Elisha. Right. The Jordan parts as part of that handover. And I mean, it's not explicit in the scripture, but iconographically, hymnographically, we talk about Jordan turned back. Right. If you've ever gone to the theophany services, especially the great blessing of the water, you hear the priest say that over and over again, Jordan turned back. Jordan turned back. There's this idea that it parts when this handover happens from John to Jesus. Now, right, so again, this other echo from Elijah. Right. Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6574.23,"end":6589.72,"speaker":"Fr Stephen De Young","text":"So we've got St. John has the same kind of lifestyle, the angelic life, the. This prophetic way of life that Elijah does. He's doing the things that these Old Testament prophecies predicted Elijah would do when he comes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6590.28,"end":6590.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6591,"end":6599.72,"speaker":"Fr Stephen De Young","text":"And then probably the most superficial one, but nonetheless worth mentioning, is that they look alike and dress alike."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6601,"end":6653.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Yeah. So you've got, okay, 2nd Kings 1:8 and Matthew 3:4. Here's the 2nd Kings reference. They answered him. He wore a garment of hair with a belt of leather about his waist. And he said, it is Elijah the Tishbite. That's about Elijah. Matthew 3, 4. Now, John wore a garment of camel's hair and a leather belt about his waist, and his food was locusts and honey. So, yeah, they even look alike. You know, they dress alike. Right. And. And then. And then what's funny then, okay, like, it becomes very explicit in multiple passages in the New Testament, Matthew 11, 7, 15 and 17, 10 through 13. And then Mark 9, 11, 13. I'm just reading them off so you can look them up later, folks. But all of those basically Someone says, yes, this is Elijah. Yeah, this is Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6653.09,"end":6659.89,"speaker":"Fr Stephen De Young","text":"The question comes up, are you Elijah? Right. And all those Christ are basically Christ saying, yes, he's Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6660.36,"end":6675,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then John himself, John 1:1922 is basically John saying, no, I'm not. What's that about? How can he both. Why would he deny it if Jesus is saying that, yeah, he's Elijah, I."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6675,"end":6678.84,"speaker":"Fr Stephen De Young","text":"Think we found a contradiction in the Bible, so we're just going to have to chuck this whole thing and go home."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6678.84,"end":6679.72,"speaker":"Fr Andrew Stephen Damick","text":"Good night, everybody."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6680.04,"end":6687.8,"speaker":"Fr Stephen De Young","text":"Yeah. No, so there's this idea communicated that he is and he isn't. Right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6687.8,"end":6688.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6689.56,"end":6706.92,"speaker":"Fr Stephen De Young","text":"And part of the way through this, right. The way to understand what this relationship is, where he is and he isn't is comes through going back a little and looking at the prophecy that was made to his father, Saint Zechariah, before."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6706.92,"end":6778.85,"speaker":"Fr Andrew Stephen Damick","text":"His birth, back in Luke 1, verses 13:17. You'll hear this at the feasts of his, I think of his conception and also of his birth, if I remember correctly. But the angel said to him, do not be afraid, Zachariah, for your prayer has been heard. And your wife Elizabeth will bear you a son, and you shall call his name John, and you will have joy and gladness, and many will rejoice at his birth, for he will be great before the Lord, and he must not drink wine or strong drink. And he will be filled with the Holy Spirit even from his mother's womb. And he will turn many of the children of Israel to the Lord their God. And he will go before him in the spirit and power of Elijah to turn the hearts of the fathers to the children and the disobedient to the wisdom of the just to make ready for the Lord a people prepared. I mean, when Zechariah heard that, I'm sure he thought, Wait, wait, wait, wait. Malachi, chapter four. All that they wouldn't have verses or whatever. Yeah, I'm sure he was thinking of that passage from Malachi, chapter four, because it says, I will send you Elijah the prophet. He'll turn the hearts of the fathers to their children. The hearts of children of their fathers. I mean, it's like this echoes it directly. This is an angel speaking to Zechariah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6779.33,"end":6803.81,"speaker":"Fr Stephen De Young","text":"Right? And so, right. You see all that Malachi language. But note here the language used about Elijah that he comes. He doesn't say he's going to be Elijah reincarnated in the spirit. Yeah, right. He says, in the spirit power of Elijah. Where have we seen that kind of language before? Well, at the transition from St. Elias from Elijah to Elisha."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6804.21,"end":6804.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6804.85,"end":6808.37,"speaker":"Fr Stephen De Young","text":"Where he wants a double portion of his. Of Elijah's Spirit."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6808.85,"end":6809.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6809.25,"end":6837.85,"speaker":"Fr Stephen De Young","text":"And so what this is setting up is the idea that in the same way, Elisha continued to have this relationship with his friend and mentor, who had now been exalted to the heavenly places in the same way. Now St. John has a relationship with St. Elias who has been exalted to the heavenly places and is part of the Divine council. And so would have been one of those beings who he was growing up among."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6838.65,"end":6839.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6839.61,"end":6840.89,"speaker":"Fr Stephen De Young","text":"Out there in the wilderness."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6841.77,"end":6916.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. That he would have known him because he's living in the divine council. Yeah. And so then there's this reference. And it's funny, like, until we started talking about this, I didn't read this this way, but now it makes sense. So John 1:33. And this is. So this is John the Forerunner speaking, talking about recognizing Jesus. I myself did not know him, but he who sent me to baptize with water said to me, he on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit. Now, like, most of the time I read that phrase, he who sent me to baptize, I always thought, okay, well, God sent John to baptize. Right. But, like, if God appears to John the Forerunner, who, who, who is that that's appearing to him? That's going to be the Son of God, because that's who appears to people. Right. Why would he appear and say, now you're going to recognize me because the Holy Spirit's going to descend on me. Like, like you're like. Well, he would probably say, well, won't you just look like I see you now? You know? Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6916.92,"end":6917.32,"speaker":"Audience Member","text":"And."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6917.64,"end":6926.42,"speaker":"Fr Stephen De Young","text":"And while St. John is sent to go start baptizing, the second person of the Trinity is living in Nazareth."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6926.5,"end":6944.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Already incarnate. Living in Nazareth. Yeah. So he who sent me to baptize. It makes sense then to read this as Elijah sent him to baptize and said, this is how you're going to recognize the Son of God when you see him."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6944.74,"end":6963.55,"speaker":"Fr Stephen De Young","text":"Right. And we see this pattern that, that when one of the prophets, one of the human prophets is in the Divine Council. Right. In these scenes where they're commissioned, for example, like the prophet Isaiah, there's an angelic being who comes and is sort of their guide."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6964.03,"end":6964.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6964.83,"end":6977.34,"speaker":"Fr Stephen De Young","text":"And explains things to them and shows things to them and interacts with them. Right. This happens with Isaiah. You see this happen with Daniel in his visions. You see this happen with St. John in the Apocalypse. The Book of Revelation."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6977.42,"end":6977.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6977.74,"end":6993.98,"speaker":"Fr Stephen De Young","text":"He has these angelic beings who show him things and explain things to him and tell him and he asks them questions. They tell him. So presumably as St. John is living the angelic life, he has someone who is his guide. And we've been told that he's coming in the spirit and power of Elijah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":6994.22,"end":7028.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it makes sense that that's his guide. And, you know, we see this outside Scripture, too, obviously, Enoch, you know, when he in his in that text, he's guided by an angel. And of course, you know, the one that probably everybody's got in their mind now suddenly is Dante being guided when he, you know, makes his trip into into paradise. So, yeah. Yeah. Powerful, powerful stuff. Okay. Well, we are going to go ahead and and go to break and we're going to be right back and talk some more about St. John the Forerunner."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7031.69,"end":7122.48,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO. Ancient Faith Publishing presents I Live Again, a memoir of Ileana, Princess of Romania and archduchess of Austria, who in later life became Mother Alexandra, founder of the Orthodox Monastery of the Transfiguration in Pennsylvania, who wrote this memoir shortly after relocating to the US in the 1950s. It tells the story of a life full of suffering, tragedy and exile. But all is suffused with the author's deep faith, hope, love and even joy. This reprint includes additional material collected by the nuns of her monastery that sets the memoir in the context of Mother Alexandra's later life. To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancient faith.com we're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO. Okay."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7122.48,"end":7138.65,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the third half. Yes, I mean to say third half. We do have a couple of callers on the line. We've got Samuel calling from Virginia. Samuel, are you there? All right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7139.29,"end":7140.49,"speaker":"Fr Stephen De Young","text":"Speak to us, Samuel."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7140.57,"end":7141.41,"speaker":"Fr Andrew Stephen Damick","text":"Samuel, are you there?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7141.41,"end":7142.09,"speaker":"Fr Stephen De Young","text":"Are you all right?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7142.49,"end":7142.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7143.13,"end":7144.89,"speaker":"Audience Member","text":"So, okay, I'm here."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7145.21,"end":7145.77,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7146.73,"end":7147.29,"speaker":"Fr Andrew Stephen Damick","text":"Welcome."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7147.29,"end":7175.38,"speaker":"Audience Member","text":"My, my question is about how a lot of the talk of God speaking through the prophets in the Old Testament focuses on the third person of the Trinity, the Holy Spirit. But how, how Much of a presence of the. The second person, the Son, is in the. Speaking through the prophets explicitly in the Old Testament."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7176.58,"end":7198.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's a good question. I mean, I'm going to have Father Stephen mostly answer this, but I want to just begin by saying there's. In many cases it says, and the word of the Lord came to fill in the name of the prophet. Right. And who is. I mean, the word of the Lord is our Lord Jesus Christ as the Son of God. So, Father Stephen, take it away."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7198.49,"end":7220.1,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah, because there are a bunch of examples. Right. One of them is when. When Samuel is being called. Right. The beginning of that story, it says at that time, I think, that King James has. There was a poverty of the Word of God. There was. There was a lack of the Word of God. And then it says there were not many visions."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7220.66,"end":7221.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7221.46,"end":7240.66,"speaker":"Fr Stephen De Young","text":"It doesn't say there, you know, people weren't hearing from God. It said there were not many visions. And then the Word of God comes to Samuel and staying at the side of his bed, and there's a place with Jeremiah, the word of the Lord comes and touches him."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7241.67,"end":7242.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7243.35,"end":7294.01,"speaker":"Fr Stephen De Young","text":"So the word of the Lord is used in this sort of bodily way to represent a person throughout the Old Testament. And one of the key words for prophets, the Old Testament is actually Dear S E E R. So we have in the contemporary west, kind of weird idea of Old Testament prophet that's basically based on hearing a voice in their head. And then we associate that with the Holy Spirit or maybe even more subtle than that, that the Holy Spirit is just sort of nudging them or, you know, giving them ideas or just making sure they do say right things. But in the text of the Scriptures itself, what you see prophets doing is having visions."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7294.85,"end":7295.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7295.33,"end":7346.02,"speaker":"Fr Stephen De Young","text":"Entering the council of God, where the word of God, the second verse of the Trinity is. And he commissions them, talks to them and sends them. Right. And that's why, as we were talking about in the first half, this is why what happens with St. Paul on the road to Damascus is in such total continuity with what happens with the prophets. And this is. This is what St. John is getting at, sort of as a summary statement. St. John says at the end of his prologue to Gospel, he says, no one has seen God at any time, but the unique God who is in the bosom of the Father has made him known. He's not saying, hey, you remember all those times in the Old Testament where people said they saw God? That's all bogus. Nobody saw him until Jesus came."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7346.39,"end":7346.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7346.55,"end":7377.41,"speaker":"Fr Stephen De Young","text":"Because that doesn't make any sense. Right. St. John clearly believes that all that happened in the Old Testament. What he's saying is all those times where it says they saw God in the Old Testament and interacted with him and he spoke to them, that was Christ, that was the second person of the Trinity, that was the word of God, capital W, the Logos, who they saw and heard from and interacted, interacted with and now has become flesh among us."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7377.73,"end":7380.61,"speaker":"Fr Andrew Stephen Damick","text":"All right, does that make sense, Samuel?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7381.89,"end":7383.49,"speaker":"Audience Member","text":"Oh, yeah, it does. Thank you."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7383.81,"end":7409.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay, great. All right, so we're having a couple of audio issues with Father Steven's connection. So Father Steve, I'm just going to ask you to switch over to the other system that we have. But meanwhile, I'm going to attempt to take Christopher on my own while he does this. So Christopher calling from again, the holy state of Virginia. I think I hear a plane going over there in Virginia. So Christopher, are you there?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7411.35,"end":7412.63,"speaker":"Audience Member","text":"Yes, Sam, can you hear me?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7413.03,"end":7416.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we can hear you. What's your question or your comment, Christopher?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7418.07,"end":7420.47,"speaker":"Audience Member","text":"And forgive me for the background noise, I'm on a train."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7420.95,"end":7422.71,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you are on a train. All right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7422.95,"end":7497.04,"speaker":"Audience Member","text":"Yeah, sorry about that. My question was about St. John the Baptist and I recently was reading some work on a Catholic, a Catholic scholar who said that St. John the Baptist was part of the Essene community that produced the Dead Sea Scrolls. Not the same one, but of the similar community. And that's who he was living with while he was in the desert, that he wasn't alone. And I haven't heard about him being with angels like you guys were just not talking about. Or it could be that he was living the angel lifestyle like modern day monks do, away in the desert. I want to get your guys comments on that, if that was a plausible interpretation of history, St. John the Baptist and these scrolls and how that applies."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7498.4,"end":7552.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I think we've got Father Stephen back on yet. But the first thing that I'll just say is, I mean, in the scripture it talks about him living. You know, there's no indication that there's anyone else out there living with him, you know, that he's. That he is alone essentially. And like when it says that he. Let me look at the, the verse actually here. Yeah, it says the child grew and became strong in the spirit and he was in the wilderness until the day of his public appearance to Israel. That's Luke chapter one, verse 80. It makes no references to Saint Elizabeth. Taking him out there and handing him over to a community that's out there of human beings. Right. The church's tradition is that he was there living the angelic life. But Father Stephen, are you able to connect now? Are you there?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7553.84,"end":7554.88,"speaker":"Fr Stephen De Young","text":"Can you hear me now?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7554.88,"end":7557.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, good."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7560.69,"end":7563.01,"speaker":"Fr Stephen De Young","text":"So the question is about whether St. John was with the community."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7563.65,"end":7567.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Whether he was part of the Essenes, essentially, is the question."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7567.41,"end":7575.17,"speaker":"Fr Stephen De Young","text":"Oh, right. So there's a lot of vagary about who and what an Essene is."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7575.57,"end":7575.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7575.97,"end":7769.11,"speaker":"Fr Stephen De Young","text":"So Josephus refers to the Essenes. And for example, most people now think that Qumran, the group at Qumran, the Qumran community, was part of the Essenes. But even that is questionable because we don't know that the Essenes was a big organized group. And the group at Qumran, for example, was clearly not. They were a separatist group. They weren't sort of in line with anybody else. They were sort of fundamentalists and, ironically enough, Old Calendarists. That's why they split. But, yeah, so the idea of Essenes is historically tenuous. There's a lot of. Most of what you read when you read about the Essenes is conjecture, and it's sort of assuming that certain groups were Essenes that are never explicitly called Essenes and didn't call themselves Essenes. But, yeah, I was saying when I reconnected here, there is no discussion of any group with St. John anywhere in the Scriptures or anywhere. But most of the Essene groups. And like the group, if we. If we at the group, we have at Qumran, where we have a lot of information that they represent sort of what an Essene was, there really aren't a lot of things connecting St. John to that. The Qumran community, for example, split over the calendar. They followed the Anakin calendar. They believed that the Pharisees were liberals for using sort of an updated calendar based on the Old. And the Sadducees who used the Julian calendar were right out because the Julian calendar was clearly a pagan Roman calendar for Jewish groups of the first century. That's the main reason they split. And what they did is they went out in the desert as a community and reconstructed a version of temple rites because they said Herod's temple was legitimate. And they reconstructed the temple rights there so that they could carry on the worship, not including sacrifices, but so that they could continue, you worshiping God themselves, that community, to be the faithful remnant, the only remnant that was saved. And they believed that following the calendar and conducting these rituals was the way it oriented yourself toward God. And there's nothing about any of that with St. John reading about him doing any ritual work, worship, any calendar, feast days. So the things that were sort of sexually important, I mean, the, the. The Book of Enoch. There are more copies of the Book of Enoch book other than Genesis."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7770.95,"end":7771.27,"speaker":"Fr Andrew Stephen Damick","text":"Book."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7771.27,"end":7796.53,"speaker":"Fr Stephen De Young","text":"Of Enoch, and then fourth is Judah, and a huge portion of Enoch is laying out the calendar they were using, quote unquote, proving that it's divinely given. So there isn't a lot of evidence to suggest that there's any connection between that and St. John."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7800.37,"end":7833.7,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're unfortunately losing Father Stephen from his connection again, so. But Father Stephen, hopefully you can hear me. I'm just going to ask you to call in on the regular 855 AF radio, and hopefully we can get him on the phone because it's just been super, super choppy here this evening. All right, well, so is that useful to you, Christopher? I hope you were able to get something from some of that. I'm sorry about the bad connection."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7834.74,"end":7853.79,"speaker":"Audience Member","text":"Oh, no, that's. Ryan. I know this is. It's a relatively complex subject, and that modern scholarly work I always take with a grain of salt in terms of referencing it back to what's always been known to the Church."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7854.43,"end":7854.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7855.47,"end":7868.74,"speaker":"Audience Member","text":"I have a Catholic background, but I'm currently Orthodox. And so I understand a little bit between this current scholarly work and what the Church has always thought."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":7871.86,"end":8018.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, all right. Yeah, yeah. I mean, I think. I think part of it is just that what we see, actually see in Scripture doesn't indicate that he's with anybody else. Right. So, you know, conjecture can be interesting, but the, The. The tradition that we've received just simply makes more sense and actually makes better sense of what's actually there in the Scripture. So. Yeah. Yeah. Okay. So, Father Stephen, do we have you back on the phone now? Okay. John is still working on trying to get him on there, so. All right, well, okay, so just to kind of roll along. Thank you very much for calling, everybody. So the last thing that we wanted to talk about with regards to St. John, and I think if you've been listening to what we've said about St. Elijah, then this will become very clear. You kind of know where we're going with this. Right. And that is that St. John is part of the Divine Council. Now. We saw Elijah taken up on the chariot of fire to become part of the Divine Council and functioning as this guide now for the Forerunner, you know, who comes in his spirit and power. And so what does St. John do as part of the Divine council? So he's growing up in the Divine Council, but Then, you know, especially after his beheading, which on the new calendar, about to celebrate that feast in just a couple of days here on Sunday after his beheading, he takes up his place as a divine council. And if you look at, you know, the iconostasis on most, in most Orthodox churches, or if you especially look at an icon that is called the Deisus icon, what you see there is Christ on his throne. So he's seated on his throne. At his right hand is his mother. Right. And we've talked, you know, about why she's there at his right hand. There is an episode that we did late last year called the Queen Stood at the right hand. Okay, so go listen to that if you're interested in that. It's fascinating stuff. But at his left hand is St. John the Forerunner. At his left hand is St. John the forerunner. Father Stephen, if you're there, why would he be. Why would he be at the left hand? This is now the third connection, by the way, that we could have gotten him with us. So why would he be at the left hand?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8019.67,"end":8020.55,"speaker":"Audience Member","text":"Can you hear me?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8020.87,"end":8022.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8022.39,"end":8024.51,"speaker":"Audience Member","text":"Okay, good. Can you hear me now?"}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8024.51,"end":8026.55,"speaker":"Fr Andrew Stephen Damick","text":"Now I know."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8027.37,"end":8031.69,"speaker":"Audience Member","text":"Yeah. So this is how we celebrate our one year anniversary is technical difficulties."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8031.93,"end":8034.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah. But it brings me back."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8035.37,"end":8124.56,"speaker":"Audience Member","text":"This would happen. Yeah, I kind of warned you this would happen due to the seasonal weather out here. So we talked about in that episode, the queen stood, about how the royal court of David in particular was an icon of the divine council, the heavenly council. And so in the same way that we see the queen mother at the right hand of David, at the left hand of David is the prophet of the Lord who was there in the court. And we see several episodes. St. Elias was sort of Ahab's prophet, or should have been, but he did barge in, but, for example, would have had a more. Right, more clear role in Samuel before him. And so we see St John again taking that place as the fulfillment of that role is one reason why he's there at the left hand. And then there's also the traditional within the church that St. John, as he experiences theosis and takes his place in the divine council, replaces the devil who fell."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8125.12,"end":8125.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8125.92,"end":8156.68,"speaker":"Audience Member","text":"And the devil, as we talked about way back when, is described as having been a cherub. We talked about how the serpent description is connected to the idea of a seraph, seraph being the Egyptian word for serpent. And that is a throne guardian, a protector of the throne, someone who. And protecting, in terms of protecting the holiness. That's why there's a Cherub at the gate of Paradise."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8156.84,"end":8157.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8157.96,"end":8198.02,"speaker":"Audience Member","text":"Keep people out and protect them from the holiness. And so we could see St. John taking that role near the throne of Christ. And what, of course, was his ministry on earth was repent. Because the kingdom of God is at hand. You need to repent. You need to turn your heart back so that you will not face the wrath, so that you will not be destroyed by God's holiness. Not gatekeeping in the sense of trying to throw people out, but trying to prepare them to be able to come in. And so his standing at the left hand of the throne is a continuation of that ministry as well."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8199.7,"end":8222.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, yeah. And, you know, we mentioned. I think we mentioned the angel wings. I'm sorry, got a little discombobulated by the audio issues, but that's okay. You know, he's depicted often with wings and many icons of him. Not every icon, but certainly a lot of icons of him. He's got wings. And often people say, well, it's because he's like an angel, literally."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8222.77,"end":8223.17,"speaker":"Fr Stephen De Young","text":"True."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8223.97,"end":8284.95,"speaker":"Fr Andrew Stephen Damick","text":"But it's not that angels have wings. It's that wings are used as a way to signal that the figure you're looking at is a messenger, because a messenger is expected to go fast. Right. So wings on a bird or whatever, enable it to go fast, enable it to fly. Fly really quickly. And so when St. John is depicted with wings, it's not to say that he is the same. Has the same nature as the angelic beings. It's that he's functioning in the same. He's functioning in the same role that they do as one who is sent from God to speak on behalf of God. Right. So that's what's going on with the wings. But again, he's closely associated with the angelic hosts because that's what he's doing, their task like he's being one of them. He's being part of the heavenly hosts. Right."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8287.67,"end":8313.42,"speaker":"Audience Member","text":"Right, right. He is now continuing to share in the life of the angels. But in the same way that we see St. Elias making this transition. Right. We see Elijah, who's already living the angelic life on earth, already participating in the divine council, the spiritual world on earth. He comes to sort of the fullness of that as he goes into the heavenly places."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8313.66,"end":8699.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Beautiful. All right, well, we've now gone on for two hours and 20 minutes, just about. So I think we're going to go ahead and wrap up our conversation. I mean, there's so much more that we could say about this awesome, awesome saint. You know the fact that according to our tradition, he, you know, is the foreigner of Christ even into Hades and preaches the gospel there to those, both to the departed righteous and also to the wicked spirits who are in Hades, for whom it is not good news. It is good news to the righteous, obviously, but perhaps we'll just have to save a lot of that for another time. I wanted to make a few final comments, and it's something we've been sort of hinting at a lot along the way, but did not actually use, I think, the particular term. And that's this question of patron saints. Right? So we see this relationship between Elijah and John set up in the scriptures, you know, it's demonstrated very, very well. Right. You've got prophecies about St. John the Forerunner, talking about him as being in the, you know, in the spirit of Elijah, you know, that prophecy directly from the angel to his father, talking about him in this way. It's brought up again and again, you know, in the Gospels. Right. He does the things that Elijah does. He's clearly connected with him. And he's not just meant to remind us of Elijah, but it's clear that Elijah is part of his life, Right. Because he's connected to the divine council where Elijah lives and functions. So this is a patron saint. This is how a patron saint functions. Right? So if you have a patron saint, you look at elements from that saint's life and you try to imitate them in the way that's appropriate to you. Right? But then also you look to them for guidance. They are there to guide you in the divine council because they're part of it. They're there to lead the way for you, to show you what to do sometimes to send you to do what it is that God would have you do. You know, that's why we have patron saints. You know, we often bear their name. Right? Now, St. John did not bear the name of Elijah. They don't have the same name. But over and over again, he's basically called Elijah in one way or another. So even though he didn't literally have Elijah's name, he comes in the name of Elijah in a very real and powerful sense. Right. You know, patron saints. Sometimes when people become orthodox, acquiring a patron saint becomes kind of a difficult thing. Like, oh, I like this one, I don't like this one, or I feel attracted to this one, or not this one, or whatever. Most people get their patron saints by simply being born. And their parents assign, with the help of God, their parents assign that saint to them. By naming them after that person. But can you have more than one? Yeah, you can have more than one saint who functions in this way for you. Right? That's definitely a thing. The idea of patron saints is a concept that existed in the ancient world even outside of. Of Christian theology and practice. You know, you've got the ancient Romans concept of the. Of patronage, right, where an established person in the community has, you know, what they would call a client, right, that we don't use that word in quite that way in our time, but they would have someone, usually a younger person, who's being introduced into civic and public life. And the patron helps to provide for them, introduces them into it, you know, supports them, and then, you know, the, the younger person by excelling is a credit then to the patron, Right? That's the way that it works in the Roman world. And it's clear that this kind of arrangement is happening with St. Elijah and St. John the Forerunner, right? But you can have multiple patron saints. And of course, many of us have multiple names. You know, first name, middle name. And you might have a family patron saint at the same time you have the saint who is assigned to your church. Church, you might have a saint who's the patron of your nation. All of these saints can help you, all of the angels and saints can help you. So it's not necessarily that there's just one. And, you know, people can actually have their sort of main patron saint changed in their life. Like when someone becomes a monastic, their name is changed out and they have a new patron saint assigned to them by the abbot when they get that new monastic name. So, you know, when you're thinking about what the. The relationship of a patron saint to the Christian is, this is what you should think about. Look at this relationship between Elijah and John. Now, most of us are not sent in the spirit and power of Elijah, right? But we are sent to be a credit to the saint that we're named after. And we should look to them, and we should look to that name of theirs that we bear as being providential from God. Whether it's one that you chose when you became an orthodox Christian. And maybe the priest said, okay, you can choose one or one that was assigned to you by virtue of being born and your parents assigning that name to you, or in many cases, people who convert to the Orthodox Church, the priest assigns it to them, or having it assigned to you if you become a monastic, these are all ways that you can have the patron assigned to you. It's just as much of A blessing, Right. And sometimes the assignment is actually more of a blessing in some ways than picking somebody, because you're receiving that in humility and obedience. So it's a beautiful, beautiful relationship. That person does not get between you and God. That person is there to lead you to God. They are a guide in salvation, a guide in the divine counsel. They're not someone who stands between you and God. That's ridiculous. And they would never see themselves that way. Right. So it's a wonderful, amazing, remarkable, powerful, helpful relationship that we as Christians can have to have these guides, these patron saints to help us out along the way. Father Stephen, your final comments."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":8702.46,"end":9060.28,"speaker":"Audience Member","text":"Yeah. So I want to talk a little bit about. We brushed on a few places, including the answering one of the questions we answered tonight on the fact that even when we're talking about people like St. Elias and St. John the Forerunner, who lived alone out in the wilderness for a good chunk of their life, they still experienced what they experienced and did what they did and were working toward the purposes of God in terms of a community, not just the community the prophets that we talked about, that we saw that the prophet Samuel was a leader of and that Elisha went to, but in terms of the people of Israel, right, the people of the Northern Kingdom, who are apostates to paganism essentially, but who the prophet Elijah's whole purpose and these great spiritual victories he wins are all in an attempt to win them back to their first love, an attempt to bring them back to Yahweh. They are the important thing that community, the people that remnant within the broader community. And we tend very much as do not think in terms of community. We tend to think in terms of individuals ourself as an individual. When we think about family, we don't think about like a big extended family. We think about mom, dad, kids, right? We think about the nuclear family, the small unit. And we have certain responsibilities within that small unit and none outside of it. And even when we approach salvation, even when we approach church, we approach it as individuals and sometimes even as consumers. So for most of history, the church sat in the middle of a village. And the people who went to that church were the people who lived in the village. And so their worship life, their ritual life, everything that happened in the church was one with the rest of the life of the community. Everyone knew each other, right? And they were worshiping and praying together and then doing business with each other and living next to each other as neighbors, participating in all the aspects of community life. We don't have that anymore. In the United States, we live in cities. I live in a city with dozens of churches. Those churches are broken up ethnically, racially, economically. Right? There's different groups that go to different churches. We look at religion as sort of like a hobby that some people have and some people don't. And what they're into is different depending on who they are. And they go as an individual to the place of their choice or nowhere if that's their choice, and try to get what they want out of the experience and then come home. But that's not how salvation works, because that's not how God works. God doesn't work just with isolated individuals by themselves, unrelated to anyone else or anything else. The work that God is doing involves everyone. It involves the whole community. To experience salvation is to be part of something and to become part of something. And so our lives as Christians have to become part of the life of a Christian community. And that doesn't just mean staying for coffee hour and chit chatting a little bit. That means really getting to know the people in our church and having our church become a community, become people we talk to, not just on Sunday, not just when we bump into each other at church. People who we know what's going on in their life and they know what's going on in ours. People who, when they see our kids acting up, straighten them out for us. Or when they see us acting up, straighten us out, right? That we're responsible to all the time, that we're in communication with all the time, that we love all the time. So that what we do in worship is the fulfillment of that relationship and that love and that joy that we share with each other all the time, every day, everywhere we go. Because God doesn't save any of us as individuals and he doesn't save us as individuals as an end in itself. What God did in the life of St. Elias, what he did in the life of St. John the Forerunner, was not just, oh, he picked them to give them these special blessings and experiences and to have this role in heaven, but he picked them to bless the world. He picked them to proclaim a message to bring salvation to countless people, to countless generations of people, in the case of those two men. So if we're working out our salvation and God is saving us and we're being saved, it's because God wants to use us to do a whole lot more than just try to get our own act straightened out. It's to get our act straightened out and to do that by blessing the world, beginning with our community, beginning with our churches. So that's if it was audible in its entirety or near so is my final comment."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9061.16,"end":9085.51,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right, well, that is our show for tonight. Thank you everyone for listening. If you didn't get a chance to call in during the live broadcast, we would love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page page. We read everything but can't respond to everything. And we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9086.79,"end":9099.51,"speaker":"Audience Member","text":"Unless you're sending us an agri screed about why you're not listening anymore, in which case join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9099.83,"end":9112.48,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it, or maybe be just a little bit like it."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9114.24,"end":9120.88,"speaker":"Audience Member","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9121.28,"end":9125.2,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you through the prayers of his forerunner."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9134.25,"end":9165.06,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9165.06,"end":9168.02,"speaker":"Fr Andrew Stephen Damick","text":"Honor and glory and Blessing."}
{"episode_id":"LOS - #026 - 2021-08-26 - Make Straight the Paths for Our God","start":9168.34,"end":9171.3,"speaker":"Fr Stephen De Young","text":"Revelation, chapter 5, verses 11 through 12."}
