{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":0.72,"end":65.39,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation foundation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":68.43,"end":151.61,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Welcome back to the Lord of Spirits podcast, everyone. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-2372-3468. And Matushka Trudy will be taking your calls tonight, which we will get to in the second part of our show. So tonight we begin a four part series. That's right, four part series on the Christology of the Old Testament. And first we're going to be talking about the angel of the Lord. The angel of the Lord is mentioned dozens of times in the holy scriptures, yet the identity and nature of this figure remains kind of fuzzy for a lot of Christians. Is he an angel like one of the heavenly hosts? Is he a symbol of Jesus Christ? Is he the Son of God himself? Does he have a body? Is this figure compatible with trinitarian theology? So if you've ever wanted to take a really thorough look through the scriptures to understand what this phrase means and who this is, stick with us tonight. So let's start by looking at the words themselves. So, Father Stephen, where does this phrase the angel of the Lord come from linguistically, like the actual words Hebrew? Well, there we go. Good night, everybody."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":151.61,"end":161.37,"speaker":"Fr Stephen De Young","text":"Yeah, so also, I just want to say if you've never wanted to take a really thorough look through the scriptures to understand who the angel of the Lord is, you should also stay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":161.85,"end":162.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes, please."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":162.57,"end":176.5,"speaker":"Fr Stephen De Young","text":"Because there will be dad jokes and other stuff that might Entertain you. And also I hereby guarantee now that this episode will be 97% less horrifying than the last one."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":176.9,"end":188.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. We had a number of people contact us about the last episode, the monster menu episode, and say that they actually were experiencing nightmares afterwards, despite the parental advisory that I gave at the beginning of the episode."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":188.9,"end":226.24,"speaker":"Fr Stephen De Young","text":"Yes. That we reiterated repeatedly. Right, yeah. Our content warning. But so, yeah, to dig into a little more, when we talk about the angel of the Lord. Right. Lord here is, of course, standing in as the English translation of Yahweh. So we're talking about the angel of Yahweh, the God of Israel. And so there's a. There's a bunch of different pieces to that. I think the first piece, you know, we'll do it word by word. So the first word is the."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":226.64,"end":227.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":227.68,"end":236.28,"speaker":"Fr Stephen De Young","text":"And it's important that we're talking about the angel of the Lord. Right. The angel of Yahweh. The definite article, as it were."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":236.28,"end":237.44,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":238.08,"end":277.45,"speaker":"Fr Stephen De Young","text":"That there are places. There are bunches of places in scriptures that talk about an angel of the Lord. Right. With. Without a definite article. An example of that is in Matthew 1, verse 20, we're told that an angel of the lord comes to St. Joseph the betrothed to tell him about the conception of Christ and that it's of the Holy Spirit. And someone out there may be about to say, well, yeah, but in verse 24 it says the angel of the Lord. Right, but the Greek article is not a definite article."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":278.25,"end":282.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's more of a demonstrative, like this or that, that angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":282.41,"end":294.01,"speaker":"Fr Stephen De Young","text":"That angel, you know, it's referring back to say, the same one. Right. The same one that was mentioned before. That's the anaphoric use of the Greek article for the language nerds out there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":295.13,"end":296.33,"speaker":"Fr Andrew Stephen Damick","text":"And you know who you are."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":297.05,"end":335.92,"speaker":"Fr Stephen De Young","text":"Yeah, but in Hebrew, the ha prefix. Right. In ha malak, Yahweh is a real live definite article. Right. We talked about this before when we talked about the Satan in the Book of Job. Right, right, right. So this is indicating a very particular being, not just a good angel or an angel that is loyal to Yahweh or serves Yahweh. There's lots of those. Right. But this is the angel. Yeah, yeah. So then the next word is angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":337.12,"end":366.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And that comes, of course, from, you know, the. The English word angel, mind you, comes from the Greek angelos, which simply means messenger. Like that's really all that. The word itself just means. I mean, there's. We tend to think of it as A. A species. But it really is the name of a job, Angelos. A messenger, you know, because. Because you've got. Because it. And it comes from that word that means news, you know, so it's someone who delivers news is what the word means."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":367.86,"end":406.26,"speaker":"Fr Stephen De Young","text":"Right. And the Hebrew word behind that also means messenger. The Hebrew word that's used, malak, also refers to a messenger or an angel in the spiritual sense. And using it in that spiritual sense, by the way, is not confined to the Hebrew scriptures. That term is used for the sort of lower level spirits that serve pagan gods, like in. In ugaritic epic poetry. It's fairly commonly used in that regard."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":406.5,"end":423.53,"speaker":"Fr Andrew Stephen Damick","text":"You can find it in a lot of Semitic religious stuff. You know, even that's current in the Middle East. Like I think it's either the Yazidis or one of those religious groups there that there's a lot of discussion about. Malik, you know, as an. As an angel term."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":424.73,"end":454.96,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yep. So. And yeah, as, as you mentioned it, as we talked about back when we went through the ranks of angels, right, These aren't species, these are roles, these are job descriptions, right? The different ranks, it's what they do, what their service to God is about. And that's in part because angels don't reproduce after their kind the way people and animals and plants do."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":455.12,"end":463.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is kind of what species, that's the actual boundary of species is this sort of reproductive sense."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":464,"end":507.47,"speaker":"Fr Stephen De Young","text":"Right. And so that means that each angel is in a sense sui generis, right. Each one is its own genera, Right. It doesn't go to species. Right, Right. So it's its own type of thing. But so all that tells us right off the bat is that the angel of the Lord, this particular being is a spiritual being of some kind, right. That's really all that sort of tells us who at least one of this being's functions is to convey messages from. Right. From the divine realm. Then we get to. Of the."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":510.83,"end":512.75,"speaker":"Fr Andrew Stephen Damick","text":"Is this too granular? No, because."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":513.23,"end":515.79,"speaker":"Fr Stephen De Young","text":"Yeah, no, you should see my dissertation."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":517.55,"end":521.15,"speaker":"Fr Andrew Stephen Damick","text":"This isn't the show where that question is ever really applicable."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":521.39,"end":529.6,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. But so I mean, if you think about. Of in English, right? Can mean a whole lot of things, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":529.68,"end":537.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It can mean possessive, it can just mean associated with. It can mean. Yeah, yeah, just constituent."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":537.52,"end":559.34,"speaker":"Fr Stephen De Young","text":"So you could say like, you know, this is, you know, the mug of Father Stephen, right? It's like possession. Or you could say this is a mug of coffee. That doesn't mean coffee owns the mug, right. It's talking about what is in the mug. Right. So OF is very versatile and so it gets used as a punt all the time in Bible translation."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":559.58,"end":559.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":559.98,"end":628.32,"speaker":"Fr Stephen De Young","text":"Because there are a lot of complex constructions. So like the Greek genitive, this is for the nerds again. And in Hebrew, often there's just sort of an attributive position where you just to put two nouns sort of next to each other. Right. And by placing them in those positions, they are related to each other. And there's all kinds of nuance in determining exactly how they're related. And if you're translating and you don't want to weigh in and take a strong position, you could just put like of. Right. Then let the reader try to figure out of. In what sense. So there are at least two senses of. Of the. In this case or of really, because, you know, it's Yahweh, not the Lord technically. But so there's two senses of. Of at least that are valid. So one of those is that possessive sense. Because there are places in the Old Testament where Yahweh, the God of Israel, refers to the angel of the Lord as my angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":629.12,"end":629.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":630,"end":652.51,"speaker":"Fr Stephen De Young","text":"So that's clearly a possessive. So reading it as Yahweh's angel, that's one valid way to read it. But it's also valid to read it as almost like an attributive adjective. So that it would be something like, this is the Yahweh angel. Right, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":652.51,"end":654.31,"speaker":"Fr Andrew Stephen Damick","text":"Or the Lord angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":655.03,"end":671.87,"speaker":"Fr Stephen De Young","text":"Yeah, right. And so that you say, well, what would that mean? Well, that gets developed in Second Temple literature. There's a lot of literature in the Second Temple period. So this is between about 500 BC and 70 AD."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":674.51,"end":674.91,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":677.39,"end":724.49,"speaker":"Fr Stephen De Young","text":"There is a figure, this sort of angelic figure, this prominent angelic figure, who in some texts like the apocalypse of Abraham is called Yehoel, which means this is an angel whose name is Yahweh God. Right. So it's an angel, but it's named God's name. Right. So that's a development of this reading of the Yahweh angel. And as we go through tonight and look at these different passages and different texts in the Old Testament where the angel of the Lord appears, I think some of why this is and where such a odd sounding idea would come from will become more obvious."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":725.13,"end":748.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Because I mean, there's, like I said, this phrase gets used in piles and piles of places and we're going to look at probably most of them, I think. But if you look at them, then a picture emerges. I think that's the important thing. Once you realize that these are all referencing one figure, then it becomes much clearer."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":749.22,"end":779.63,"speaker":"Fr Stephen De Young","text":"And you have to. As we talked about very early on in the first couple podcasts, you have to get out of your head the idea that ancient Jewish folks and ancient Israelites were Unitarian monotheists, that they were monotheists at all, and that they saw that God was only one person. Because if you have that in your head, then finding out that they believed there was an angel named Yahweh God, there's no way to put that together. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":779.79,"end":781.07,"speaker":"Fr Andrew Stephen Damick","text":"It doesn't work."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":781.31,"end":804.26,"speaker":"Fr Stephen De Young","text":"Right. And so we're going to see how much that doesn't work in the Old Testament. So that is, again, that is a modern thing based partially in Rabbinic Judaism and partially in 19th century German idealism. Read back into ancient Israel and ancient Judaism. I was gonna say a bunch of."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":804.26,"end":812.9,"speaker":"Fr Andrew Stephen Damick","text":"People just marked their bingo cards. As soon as you said that, Father, we should put out Lord of Spirits bingo cards. That's an idea. Right now there's a fan making one."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":812.9,"end":858.73,"speaker":"Fr Stephen De Young","text":"Right now and who will complete the system of German idealism. But Victor couldn't do it anyway. So there, that is to say there is this idea of that, that this, the angel of the Lord figure represents not just an angel or a special angel, but an especially divine figure. And that then also gets attached in various places, a lot of places in Second Temple literature. But one place we're about to talk about in the Old Testament itself, that gets then attached to traditions about the Messiah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":859.29,"end":859.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":859.97,"end":864.17,"speaker":"Fr Stephen De Young","text":"And that includes in Isaiah chapter nine."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":864.57,"end":941.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so I mean, this verse, it's Isaiah 9:6 or 9:5, depending on whether you're reading a translation from the Hebrew or the Greek. And this is one that a lot of people know because, you know, you hear this around Christmas, Christmas typically. And I think that this is, you know, this is very memorably used as a. Lyrics to the Messiah by. By Handel. Right. So, you know, it goes like this. For, for to us a child is born, to us a son is given, and the government shall be upon his shoulder, and his name shall be called. And here's where there's a little bit of variation. Wonderful. Counselor. That's what it says in the Hebrew, or angel of great counsel. That's what it says in the Greek. Mighty God, everlasting Father, Prince of peace. So that's interesting. They're not quite the same. The Greek is clearly not simply translating that Hebrew. Although, I mean, as you've probably, I think you've remarked in the past that it seems that The Greek Old Testament in a lot of ways, seems to have been translating a different. A slightly different manuscript tradition than what we know of in extant Hebrew stuff in a lot of ways. And this would seem to be one of those instances where it's not exactly the same phrase."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":943.05,"end":948.25,"speaker":"Fr Stephen De Young","text":"Yeah. And there's a way to get from one to the other. But we'll talk about that a little later."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":948.49,"end":949.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":949.17,"end":956.82,"speaker":"Fr Stephen De Young","text":"Right. So they connected to the angel of the Lord, and the word wonderful, or that's translated here, is wonderful."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":957.06,"end":966.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Wonderful, counselor. Although sometimes you see that as wonderful comma, counselor. Yeah. Which in Hebrew, there's no commas."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":966.18,"end":968.22,"speaker":"Fr Stephen De Young","text":"Yeah. There's no punctuation at all. So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":968.22,"end":995.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, yeah. So the Hebrew is. I'm going to mispronounce this, but pele ya or something like that. And then the Greek is megalis vulis angelos, which, you know, for people who know a little bit of Greek, that's pretty clearly the great council angel mealis vulis angelos. So. Yeah, that's what it says there in Isaiah, chapter nine."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":995.56,"end":999.24,"speaker":"Fr Stephen De Young","text":"Yeah. And send your pronunciation hate mail to Father Andrew Damick."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":999.48,"end":1001.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we do occasionally."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1001.56,"end":1006.36,"speaker":"Fr Stephen De Young","text":"Yeah, we do. We do mostly about how you say Lafayette, Louisiana, though."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1007,"end":1007.72,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1009.35,"end":1010.11,"speaker":"Fr Stephen De Young","text":"You just can't do that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1010.11,"end":1010.47,"speaker":"Fr Andrew Stephen Damick","text":"Ah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1010.55,"end":1011.59,"speaker":"Fr Stephen De Young","text":"You just don't like it."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1014.15,"end":1015.11,"speaker":"Fr Andrew Stephen Damick","text":"Not from there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1015.51,"end":1047.41,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. So this. This idea of this angelic being there, you see, this is listed here within these messianic titles. Right. Clearly in the Greek, and I think in a kind of sideways way, even in the Hebrew, like there's a place the Greek is getting it, and. But the way it's expressed there is the angel of great council. Now, to be clear, this is C O u N S E L. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1047.41,"end":1050.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. Not counsel, like the divine council."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1050.65,"end":1056.81,"speaker":"Fr Stephen De Young","text":"Yeah. It'd be neat if it was the other one. But it is C o u n S E L. Like my other podcast."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1057.85,"end":1061.77,"speaker":"Fr Andrew Stephen Damick","text":"Yes. The whole council of God. Yes. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1063.44,"end":1146.01,"speaker":"Fr Stephen De Young","text":"So this is connecting that angel of the Lord figure not only to the Messiah, but also to this idea of the council, the deliberations. Right. The will, the expression of the will of God. Right. So even though it is C o u n S e L, that is not unrelated to the divine council cil. Right, right. In that the. The council cil is where those deliberations and those things take place that are then announced. Right. By the. By the messenger. Right. By the angel. And so that piece of the angel of the Lord tradition is actually one that's referenced a lot both inside the New Testament and outside the Scriptures, but it's done in this kind of subrosa way where people don't necessarily notice it. They kind of gloss over it because it requires either paying a lot of attention to detail in the New Testament or reading a lot of stuff that nobody but me ever reads outside of the New Testament. Right. So not a lot of folks or all the."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1146.01,"end":1151.37,"speaker":"Fr Andrew Stephen Damick","text":"Or all the people in our. In our Facebook group who are constantly asking for a list of those books that you can read at home."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1151.37,"end":1154.53,"speaker":"Fr Stephen De Young","text":"Yes, yes. Well, they do buy them."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1154.93,"end":1156.05,"speaker":"Fr Andrew Stephen Damick","text":"Kudos to you guys."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1156.29,"end":1162.13,"speaker":"Fr Stephen De Young","text":"But. But if they're honest, how many have read how much of them? Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1162.45,"end":1163.81,"speaker":"Fr Andrew Stephen Damick","text":"Hey, don't call me out, Father."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1163.97,"end":1167.17,"speaker":"Fr Stephen De Young","text":"Yeah. Of the buying of books I'm working on."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1167.65,"end":1168.29,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1168.45,"end":1190.74,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So, yeah, our shelves will speak out against us on the day of Judgment. And that tradition, the way that tradition shows up most obviously in the New Testament is in references to the Torah being given by or through angels."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1192.02,"end":1256.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which is. I mean, it's one of those things that's said very clearly in the Bible. But I think a lot of it just. People just walk right by. Like you said, it's a detail that unless you notice these kinds of details, it may not register. And that's especially because there's no place in the Bible where it sort of really lays it all out and where you might expect it. If you're looking for the Bible to be some kind of textbook, you know, there in Exodus, it's not set there. It's not said, you know, that angels gave the Torah to Moses, but it's referenced later. So, like Acts 7. 53, where you've got St. Stephen, right? You know, just as he's about to be stoned, right. He says to the leaders of the Jews that he says, you who received the law as delivered by angels and did not keep it, that's Acts 7:53. So, I mean, it's right there in the Bible. Like, this isn't. You don't even have to go to Second Temple literature to get. To get this. Or patristic sources or whatever. It's right. Right there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1257.7,"end":1266.1,"speaker":"Fr Stephen De Young","text":"Right. And now notice there, you know, they're angry and they stone him to death, but none of them say, what are you talking about?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1266.5,"end":1267.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1268.18,"end":1305.86,"speaker":"Fr Stephen De Young","text":"And there's actually that St. Stephen's sermon there, his final sermon in Acts 7 is full actually of these little tidbits. This is just one of them, all right? These pieces of Second Temple tradition and things that. That he and all of the people listening to him had Just received. Right, right. As. As part of their religion, part of their way of life, part of their practice. And they didn't sit there and distinguish. Well, that's just a tradition I heard. Right. You know, this. This is what's actually in the Bible. And then, oh, here's this other. They don't make that distinction."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1306.37,"end":1307.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's not a thing."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1307.97,"end":1339.34,"speaker":"Fr Stephen De Young","text":"And, you know, St. Stephen went. Went to school with St. Paul, with Rabbi Gamaliel. And you see St. Paul do the same thing all the time, just referencing these things as if they were right there in the Old Testament and they're not in the Old Testament in the actual text that. That most of us would consider canon at least. And there's a similar reference. Speaking of St. Paul, there's a similar reference in Hebrews 2. 2."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1340.14,"end":1375.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So this is another one where he says, for since the message declared by angels proved to be reliable and every transgression or disobedience received a just retribution, so it means this, you know, dependent clause. And then, you know, the next thing he says is, how shall we escape if we neglect so great a salvation? He's making a contrast. He's saying, if this is this serious, then, boy, you know, now that salvation's come, what are you going to do if you neglect that? But, yeah, this is, you know, this message declared by angels proved to be reliable, namely the law of Moses."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1376.31,"end":1390.09,"speaker":"Fr Stephen De Young","text":"Right. And if. If you're going to use that construction rhetorically. Right. If A, then B, to try to prove B, then your audience has to all accept A. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1390.09,"end":1390.93,"speaker":"Fr Andrew Stephen Damick","text":"A is assumed."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1391.33,"end":1435.97,"speaker":"Fr Stephen De Young","text":"Right. So that means, again, all the readers, all the hearers. Right. In Hebrews are just expected to acknowledge. Oh, yeah, The. The Torah declared by angels. Yep. And again, this isn't even. This isn't a thing where, you know, there's been this new New Testament revelation. Right. Like, if this is a gap that's being filled in St. Stephen or St. Paul had a vision or something, or the Holy Spirit led them to this additional detail or that kind of thing. Because we find this everywhere in Jewish sources outside of the New Testament also."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1436.45,"end":1482.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So Josephus, you know, who is a writer that actually probably a lot of Protestants are aware of. For whatever reason, he's kind of popular amongst a lot of Protestants as a. I think he's. Because he's. As a witness to a number of the things that are mentioned in the New Testament. But he's not Christian. He's. He's a Jewish writer. So in his Antiquities of the jews in chapter 15, or book 15, I think, paragraph 163, he says, and this is just, you know, he's just sort of telling the story, says we ourselves have learned from God the most excellent of our doctrines and the holiest part of our law by angels or delegates or one translation I saw said by angels or ambassadors, you know."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1483.64,"end":1491.96,"speaker":"Fr Stephen De Young","text":"Right. And so Josephus, who's a Pharisee, who becomes an apostate, basically."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1492.28,"end":1494.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He collaborated with the Romans."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1494.2,"end":1553.39,"speaker":"Fr Stephen De Young","text":"Yeah. Well, he eventually declared that Rome was the Messiah. So that's about his apostate, as you could get for a first century Jew. But. But he has this too. Right. And so this is in the antiquities of the Jews. What, what Flavius Josephus is doing is he's laying out like the history of the Jewish people and their way of life to his Roman patrons. Right. That's who he's talking to when he says, we ourselves have learned from God. Right. The most excellent of our doctrines. So this is how he's explaining and expressing the origin of the Torah to these Roman Gentiles who know nothing about Judaism. So this is just an accepted thing. Again. So the only place where we get this, as we mentioned, we don't get this laid out in Exodus. Right. Exodus doesn't lay out there being angels involved in the giving of the Torah. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1553.71,"end":1572.17,"speaker":"Fr Andrew Stephen Damick","text":"Which is why when you watch the Ten Commandments with Charlton Heston, it's him alone on the side of the mountain, you know, in the voice of God, Moses, you know, the letters shown up in the tablets and they just fall out of the stone."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1572.57,"end":1573.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1574.41,"end":1585.85,"speaker":"Fr Andrew Stephen Damick","text":"Which I love. I mean, I love that movie, but no. Yeah. Because it's not laid out in Exodus that the angels are present and yet you have these other references, not just in the New Testament, but other literature from the period."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1586.62,"end":1635.52,"speaker":"Fr Stephen De Young","text":"Right, right. And so the place where you find sort of this in narrative form is in the book of Jubilees, which, unless you're Ethiopian, is not part of your Old Testament, but which was a hugely influential work. It was the. At Qumran, where the Dead Sea Scrolls were found. In terms of number of copies of different texts that we've discovered there, number one is Genesis, number two is first Enoch, number three is the book of Jubilees. And when you read Josephus History, he incorporates a lot of details from the book of Jubilees. So it's very clear it was an influence on him too."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1635.76,"end":1646.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And for those of you who have not read Jubilees, it's basically a retelling of Genesis kind of from a different angle. You Know, it's essentially those same events. Yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1646.99,"end":1650.91,"speaker":"Fr Stephen De Young","text":"A little expansionist, you know, incorporating some other stories and details."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1652.19,"end":1796.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, I mean, there's this reference in Jubilees. I mean, this is right in the end of the first chapter and the very, very beginning of the second one. I'm just going to read it real quick because I think it's important to just sort of hear, hear how this fits into this narrative. It says this. And the Lord will appear to the eyes of all, and all shall know that I am the God of Israel and the Father of all the children of Jacob and King on Mount Zion for all eternity. And Zion and Jerusalem shall be holy. And the angel of the Presence who went before the camp of Israel, took the tables of the divisions of the years from the time of the creation of the law, and of the testimony of the weeks of the Jubilees, according to the individual years, according to all the number of the Jubilees, according to the individual years, from the day of the new creation, when the heavens and the earth shall be renewed, and all their creation according to the powers of the heaven, and according to all the creation of the earth, until the sanctuary of the Lord shall be made in Jerusalem on Mount Zion, and all the luminaries be renewed for healing and for peace and for blessing for all the elect of Israel, and that thus it may be from that day and unto all the days of the earth. And the angel of the presence spake to Moses according to the word of the Lord, saying, write the complete history of the creation. How in six days the Lord God finished all his works and all that he created and kept Sabbath on the seventh day and hallowed it for all ages and appointed it as a sign for all his works. And I'll just say this, it's interesting to me that bit at the end you get Moses being told, write down the creation, which this is probably a question that maybe some people have ever asked themselves is, okay, so the tradition is that Moses writes Genesis, but who was there during the six days of creation to write that down? And, you know, and. And it. It's. It. This is Jubilees explanation is that Moses gets told this by this angel of the Presence, right? And there, therefore, then he's able to write it down because Moses was not an eyewitness of the creation of Adam and Eve. Shocking. But he was not there. And Adam did, as far as we know, Adam didn't write anything down. So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1796.44,"end":1874.85,"speaker":"Fr Stephen De Young","text":"Right. Yeah. And people forget, right? Because. Because. And it's not St. Jerome's fault. He meant well, but because we've got that law word now, right? We instead of referring to the Torah, we refer to the law of Moses all the time. And so we forget that Genesis is part of it. Yeah, right, right, right. Because we're thinking of law as in commandments. So we think, oh, that's like that Leviticus stuff, you know, like Deuteronomy. That's. That's the law. But the whole thing is the Torah. The whole thing is the nomos. The whole thing is the lex, Right, Including Genesis. And so that's where it starts. This also means, of course, that the angel of the Presence was there when God created the world, which will be important next time. Vague foreshadowing. Also, in the little more immediate foreshadowing we have here, right. We saw in those first couple quotes this idea that there were angels, plural, who sort of mediated the Torah. But here we see that there are angels, but there's this one angel in particular called the angel of the Presence. And he's also the first time he's mentioned in the quote you just read identified as the one who went before the camp of Israel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1876.28,"end":1876.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1877.8,"end":1897.24,"speaker":"Fr Stephen De Young","text":"And so that is less vague foreshadowing for what we're going to talk about in the second half. But this angel of the Presence, this singular figure, gets referred to in the third reference in the New Testament to the law being given by angels that we haven't mentioned yet."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1897.8,"end":1922.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this is Galatians, chapter 3, verses 19 and 20. St. Paul says, why then the law, it was added because of transgressions, until the offspring should come to whom the promise had been made, and it was put in place through angels by an intermediary. Now, an intermediary implies more than one, but God is one."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1925.06,"end":1984.04,"speaker":"Fr Stephen De Young","text":"And so St. Paul has just been talking about Abraham, right. And Abraham's seed, right? And so that's what he means by so why the law? Why the Torah? Why is the Torah given? It's given because of transgressions, right? To handle, to deal with sin, to deal with transgressions, to manage sin and pollution and uncleanness, until the singular offspring of, of Abraham, the one who is the heir of the promises to Abraham, until he comes, the laws there. And then the Torah is put in place through angels by an intermediary. Now, if you stop at the end of verse 19, you might be tempted to think that intermediary is Moses, right? Moses is the mediator of this covenant. But if that's what St. Paul has in mind, then verse 20 doesn't make a lot of sense."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1984.28,"end":1994.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because he says, now, an intermediary implies more than one, but God is one. So he's saying that the intermediary is God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":1995.4,"end":2017.95,"speaker":"Fr Stephen De Young","text":"Right. In addition to the angels, plural, there is this intermediary figure called in Jubilees, the Angel of the presence, the singular intermediary figure. Right. But St. Paul wants to make clear, yes, we're referring to this figure as an intermediary between God and Moses."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2019.71,"end":2020.07,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2020.07,"end":2029.23,"speaker":"Fr Stephen De Young","text":"We'Re not implying that this intermediary is not God or is in some way separate from Yahweh, the God of Israel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2029.31,"end":2044.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if you listened to our episode about Abraham, you know that the seed, the ultimate seed that St. Paul is referencing here, the seed of Abraham, is Christ. That's who's being referenced here."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2044.7,"end":2087.22,"speaker":"Fr Stephen De Young","text":"Right. And so if we understand what St. Paul is saying, he's saying that Christ gave the Torah to manage and deal with sins and transgressions until he came. Right. That's literally what St. Paul is saying. And so if anyone is wondering, right, well, where does this come from? Right. I mean, if it's not in the text of Exodus. Right. And we're not going to say that Jubilees is quote, unquote inspired or something. Right, right. Which is fine to do if you're Ethiopian."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2087.22,"end":2087.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2087.86,"end":2089.3,"speaker":"Fr Stephen De Young","text":"You could just say, well, there you go."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2089.78,"end":2091.06,"speaker":"Fr Andrew Stephen Damick","text":"It is in your Bible. Yes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2091.7,"end":2104.57,"speaker":"Fr Stephen De Young","text":"So but for the rest of us, you know, where. Where does this idea come from? Well, it does actually come from the text of Exodus, if you read it very closely."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2105.53,"end":2106.49,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2106.49,"end":2117.05,"speaker":"Fr Stephen De Young","text":"And you read it in a big chunk. Right. Because this comes out of what seems to be an obvious contradiction in Exodus, chapter 33."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2118.1,"end":2118.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2118.7,"end":2130.46,"speaker":"Fr Stephen De Young","text":"And part of the issue with how we tend to read the Bible in general is that we only read it in little pieces. We read it one story at a."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2130.46,"end":2130.74,"speaker":"Fr Andrew Stephen Damick","text":"Time."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2132.66,"end":2156.68,"speaker":"Fr Stephen De Young","text":"Which is good. It's good. You have to understand the parts in order to understand the whole. We have to read the pieces, but we also need to sometimes read the whole. Like, read the whole thing so that we put the pieces together and see how the piece before relates to the piece after. Because there's a lot of meaning that comes out of that. And this is an example of that in Exodus 33. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2158.84,"end":2176.85,"speaker":"Fr Andrew Stephen Damick","text":"So in Exodus 33:11, in the first half of the verse, very famous passage, thus the Lord used to speak to Moses face to face as a man speaks to his friend. Right. So he's talking to Moses face to face."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2177.09,"end":2180.29,"speaker":"Fr Stephen De Young","text":"Yeah. And the Lord there is Yahweh in the Hebrew."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2180.69,"end":2181.05,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2181.05,"end":2183.09,"speaker":"Fr Stephen De Young","text":"Yahweh spoke to Moses face to face."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2183.65,"end":2194.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which I always point this out when people sometimes say, well, no, you know, you can't. No one saw God in the Old Testament. I'm like, but it says that he spoke to him face to face."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2194.81,"end":2196.09,"speaker":"Fr Stephen De Young","text":"Right there. Okay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2196.09,"end":2210.37,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, not too many verses down now. So again, this is Exodus, chapter 33. This is verse 20 now. And this is God speaking. But he said, you cannot see my face, for man shall not see me and live."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2211.81,"end":2212.69,"speaker":"Fr Stephen De Young","text":"To Moses."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2212.93,"end":2225.33,"speaker":"Fr Andrew Stephen Damick","text":"To Moses, Right? So like, yeah. So I mean, what's the explanation there? Literally, it says that God used to speak to Moses face to face as man speaks to his friend. And then later on, God says, you can't see my face because you're going to die, Moses."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2225.64,"end":2252.36,"speaker":"Fr Stephen De Young","text":"Yeah, nine verses later. Yeah, nine verses later. And this is. It's important that it's so close, right? Because again, you know, our 19th century German friends will rear their hoary heads and, you know, Von Rod and all of them will show up and say, well, that's because those are separate traditions that contradict each other. And they've all been edited together. It's like, okay, but this is nine verses apart."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2253.34,"end":2258.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. No one would have noticed that. That there's this quote, unquote contradiction written into it."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2259.18,"end":2270.38,"speaker":"Fr Stephen De Young","text":"None of these literary geniuses who crafted the Torah, one of the great works of the ancient world, even from a secular perspective, notice that they contradicted themselves nine verses apart."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2270.62,"end":2275.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Literally the most read text in human history. Yeah, they didn't notice."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2277.02,"end":2278.7,"speaker":"Fr Stephen De Young","text":"Which is pretty absurd."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2279,"end":2279.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2279.56,"end":2332.42,"speaker":"Fr Stephen De Young","text":"So instead. Right, what you see here is, and this is one of many passages that we're going to be talking about not just tonight, but in this four part series where you see that there is that Yahweh, right? The God of Israel is unseen and cannot be seen and have someone live in his holiness. He cannot be beheld by sinful humanity. He cannot be approached by sinful humanity. And yet at the same time, people see Yahweh, talk to Yahweh, eat with Yahweh, right? And so there is a Yahweh who is unseen, and there is a Yahweh who is seen. And they're not two, as St. Paul makes clear in verse 20, they are not two different gods. They are both the one Yahweh, the."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2332.42,"end":2334.95,"speaker":"Fr Andrew Stephen Damick","text":"God of Israel, because God is one."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2335.91,"end":2367.58,"speaker":"Fr Stephen De Young","text":"And so this is where, again, not to put too fine a point on it, but this is where the whole concept of two hypostasis, right, that later develops into three in the doctrine of the Trinity. Right. This is ancient. This isn't something they dreamed up in the 4th or 5th century as some kind of platonic logic puzzle at the councils so that somebody could claim authority because they didn't like an air. I don't know what the conspiracy theory."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2367.58,"end":2370.9,"speaker":"Fr Andrew Stephen Damick","text":"Is, nor even something brand new in the New Testament either."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2371.3,"end":2392.45,"speaker":"Fr Stephen De Young","text":"Right, right. So there is this idea, there is this figure, right. There's this second figure who is Yahweh, the God of Israel, but who is also a second person, a second figure. And one of the ways that this figure is spoken of is the way we're speaking about him tonight as the angel of the Lord."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2392.85,"end":2407.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Okay. So we're going to go to break very soon. But before we go to break, we had someone call in and leave us a message with a question very specifically about what we're talking tonight. And so we have a message from Kyle who called in from Ireland."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2408.45,"end":2410.17,"speaker":"Fr Stephen De Young","text":"Hello Fathers, my name is Kyle."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2410.17,"end":2411.25,"speaker":"Fr Andrew Stephen Damick","text":"I'm from Ireland."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2411.33,"end":2416.88,"speaker":"Fr Stephen De Young","text":"I'm loving the show. Thank you very much for it. My question is about the angel of the Lord and I'll keep it short."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2417.28,"end":2418.6,"speaker":"Fr Andrew Stephen Damick","text":"Are we to think of the angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2418.6,"end":2425.28,"speaker":"Fr Stephen De Young","text":"Of the Lord as the second person of the Trinity, God the Son in a post resurrectional body?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2425.52,"end":2426.48,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2426.48,"end":2426.96,"speaker":"Fr Stephen De Young","text":"Bye."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2428.16,"end":2431.92,"speaker":"Fr Andrew Stephen Damick","text":"All right, so do you have an answer for that, Father?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2432.8,"end":2433.28,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2433.68,"end":2436.32,"speaker":"Fr Andrew Stephen Damick","text":"Dun dun dun dun. Okay, let's go to break."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2437.28,"end":2455.73,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2456.34,"end":2464.5,"speaker":"Fr Stephen De Young","text":"St. Ignatius, first century bishop of Antioch, called the God bearer, is one of."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2464.5,"end":2466.58,"speaker":"Announcer","text":"The earliest witnesses to the truth of."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2466.58,"end":2482.05,"speaker":"Fr Stephen De Young","text":"Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God. Fr."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2482.05,"end":2487.73,"speaker":"Announcer","text":"Andrew Damoch recounts the life of this great pastor, martyr and saint and interprets."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2487.73,"end":2489.81,"speaker":"Fr Stephen De Young","text":"For the modern reader five major themes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2489.81,"end":2495.17,"speaker":"Announcer","text":"In the pastoral letters. He martyrdom, salvation in Christ the Bishop."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2495.63,"end":2497.95,"speaker":"Fr Stephen De Young","text":"The unity of the church and the Eucharist."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2498.11,"end":2509.87,"speaker":"Fr Andrew Stephen Damick","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense which that can be challenging for us because number one, he doesn't seem to have any reticence at all about going to martyrdom."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2509.87,"end":2513.83,"speaker":"Fr Stephen De Young","text":"Like there's no sense of, well, this is what I have to do. You know, I wish I didn't have to."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2513.83,"end":2518.11,"speaker":"Fr Andrew Stephen Damick","text":"But this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2518.43,"end":2544.88,"speaker":"Announcer","text":"To find this book and others like it. You can go to store Ancient faith again. That is store.ancient faith.com. we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2549.7,"end":2564.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back, everybody. I always like to end with a cliffhanger. We haven't done that very in a while, but like the voice of Steve said, you're welcome to call in. We want to talk to you about the angel of the Lord. Okay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2564.5,"end":2571.94,"speaker":"Fr Stephen De Young","text":"So, I mean, before we begin, I just want to say it was very good of you to record that book promo from within Leviathan."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2572.9,"end":2573.3,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2573.78,"end":2576.47,"speaker":"Fr Stephen De Young","text":"That's what it sounds like underwater somewhere."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2576.47,"end":2586.71,"speaker":"Fr Andrew Stephen Damick","text":"I know, I, I, you know, that's, that was from an interview that I did. Like it's been a few years and I think I did it like over the phone before I had the magical tower of podcasting in which I now reside."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2586.87,"end":2588.23,"speaker":"Fr Stephen De Young","text":"Like a rotary phone."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2588.47,"end":2589.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2590.15,"end":2594.95,"speaker":"Fr Stephen De Young","text":"Tap the thing and say like, give me Greenville 6 5000. Like that kind of thing."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2595.03,"end":2601.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All our ancient Gen X listeners know what that is, but you're the what, we're the last generation to see them. It's true."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2603.52,"end":2603.76,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2604.48,"end":2617.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay. So Kyle asks this question, is the angel of the Lord the second person of the Trinity in a post resurrectional body? Yeah, I mean, and you said."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2617.72,"end":2620.8,"speaker":"Fr Stephen De Young","text":"Yes, I stand by that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2621.44,"end":2707.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I mean, I think it's, I, I think it's worth noting that. Why is that true? Well, it's because. Right. It's because. And just in brief, it's because what exactly does it mean to be in heaven? What does it mean? What does it mean for Christ to be present? When exactly is he? And I meant when on purpose. Right. And we often describe him being incarnate without change. That's the phrase used a lot in our liturgical services. So, you know, that's a lot of what's going on there. And in a future episode, we are going to actually try to tackle some of these real mind bending concepts that play into why this is the case. Because otherwise, what are we talking about? Right. Because it's clear that he's embodied in the Old Testament as we're going to see. Right. But then to say that that's not his post resurrectional quote unquote body suggests that he was incarnate as something else for a while, right. I mean, that's kind of the only place or. Or that he made himself felt by, I don't know, force fields or something. I don't know where else you can go with that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2707.6,"end":2714.94,"speaker":"Fr Stephen De Young","text":"Yeah, well, yeah. And just to riff on it a little, take a tea break or something while I riff, if you need to."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2714.94,"end":2716.06,"speaker":"Fr Andrew Stephen Damick","text":"All right. But."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2719.5,"end":2736.31,"speaker":"Fr Stephen De Young","text":"Yeah, unless, right. You're. You're one of our Calvinist friends, you don't think that Christ's body is often someplace, somewhere as opposed to being other places? A little bit of a cheap shot, but they know what I'm talking about."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2737.51,"end":2739.11,"speaker":"Fr Andrew Stephen Damick","text":"They're used to it from you by now."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2739.11,"end":2807.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, sorry. Calvinists hit that bingo spot too. So we're used to the realization that when we talk about heaven, we're not talking about a place, a place up in the sky or a place somewhere far off or a place anywhere, right. That we're talking about an aspect of reality, a spiritual aspect of reality that isn't a different place. Right. Place extension in distance and space is something that we experience in this. Create. In this created world, right? And is experienced very differently by angelic beings and by God and by bats. But we're not used to, or as used to thinking about time in the same terms, right? That just as there's not like a direction, you could point, like heaven's that way, right? Or like GPS coordinates for heaven. That would be ridiculous. Right? You likewise. What time is it in heaven? Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2807.53,"end":2807.93,"speaker":"Fr Andrew Stephen Damick","text":"What."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2808.25,"end":2887.33,"speaker":"Fr Stephen De Young","text":"What time zone is heaven in? Right? What. What would that even mean? Like the whole way, we reckon time is based on the movements of like the earth and the sun, right? And the moon and the planets. So those time categories don't. Don't fit either. They don't fit any better. Right? So there are, and we've used this terminology before, there are eternal realities, right? There are eternally true. So that we could talk about Christ being slain before the foundation of the world, right? And we can talk about St. Paul could say to the Christians in and around Ephesus that they are already seated with Christ in the heavenly places while they're suffering on this earth. So there's this eternal reality. And that eternal reality enters into our human experience at certain points within our human experience. Time and space are descriptors and categories that. That frame our human experience and allow us to order it, right? So when Hebrews says that Christ is the same yesterday and today and forever, right? It means the yesterday part."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2888.13,"end":2890.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2890.29,"end":2901.67,"speaker":"Fr Stephen De Young","text":"Not just Christ is never going to Change. Right. But he never did. Right. That's why the Fathers and our hypnography are so clear. Christ is incarnate without change or alteration."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2902.95,"end":2918.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it kind of underlines also the notion that he is the firstborn over all creation as well. Not just. Not just in that place of being firstborn, you know, the one who distributes the inheritance, but that he's also the firstborn, you know."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2919.27,"end":2930.15,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah, yeah. So, yeah. And so that's hard for us to wrap our brains around because they're human brains and we experience everything in terms of time and space."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2930.39,"end":2930.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2931.17,"end":2949.41,"speaker":"Fr Stephen De Young","text":"And other categories of phenomenology. But we have to accept that that's for us humans, that's not for angels, that's not for bats, and it's definitely not for God. And Christ is God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2950.13,"end":2972.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. So in the second part of the show, we're going to be talking some more about this figure, the angel of the Lord, but now from a kind of a different angle, and particularly this angle is the angle of we're not referring to St. Michael."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2972.78,"end":2974.06,"speaker":"Fr Stephen De Young","text":"That's what this is about."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2974.94,"end":2984.96,"speaker":"Fr Andrew Stephen Damick","text":"So just kind of keep that as a framing device in your head that it's not St. Michael. I mean, we love St. Michael. We're big fans of St. Michael. We really need him. But this is not St. Michael."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":2985.28,"end":3054.24,"speaker":"Fr Stephen De Young","text":"Right. And this is. There are a number of appearances. We're going to go through pretty much all of them. Appearances of the angel of the Lord in the Old Testament. Right. But in this second half, there is one. You can't even really call it an appearance because it's an arc. It's a narrative arc covering, you know, close to a century of time. Right. Within the Scriptures, in which the angel of the Lord is directly involved. And so this second half is going to be talking about that narrative arc that involves a whole bunch of different humans, but also the angel of the Lord. And so that kind of arc begins with the angel of Yahweh, not so much appearing, but being designated and described by God. In Exodus chapter 23."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3054.72,"end":3083.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in Exodus 23, 20, 21, God says this. Behold, I send an angel before you to guard you on the way and to bring you to the place that I prepared. Pay careful attention to him and obey his voice. Do not rebel against him, for he will not pardon your transgression, for My name is in him. That's kind of a weird thing to say there at the end."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3083.95,"end":3098.33,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And remember, this is the payoff of that, that mention in Jubilees that the angel of the Presence who gave the Torah is the angel who led. Right. The camp of the Israelites."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3098.33,"end":3101.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. The one who went before them. So this is the same figure, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3101.73,"end":3111.49,"speaker":"Fr Stephen De Young","text":"So this is, this is who Jubilees was talking about. Jubilees is saying this angel figure is the one who also gave the Torah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3112.77,"end":3113.25,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3113.25,"end":3141.49,"speaker":"Fr Stephen De Young","text":"So a couple pieces, as you mentioned, that my name is in him, right. There's a tendency by some folks, including some folks online, that whenever they see name with a capital N, right, The name of the Lord or even in the Hebrew, the name of Yahweh, they interpret that as meaning, like Yahweh, like that means the four consonants, right? The tetragrammaton, Right? That's what that means."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3143.3,"end":3147.06,"speaker":"Fr Andrew Stephen Damick","text":"But there are the word itself in other words, Right, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3147.06,"end":3181.51,"speaker":"Fr Stephen De Young","text":"The actual four consonants, right. And there are a number of places, this being one of them, where that understanding just doesn't make any sense. Right. So if I will put my name in him means the four consonants. Like, what does that mean? Like, inside of him is going to be written somewhere, the. The name Yahweh, right? The four consonants are going to be written on an internal log as angels don't have internal organs, but maybe they do. I don't know. Like, that doesn't make any sense, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3181.51,"end":3181.75,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3181.75,"end":3283.24,"speaker":"Fr Stephen De Young","text":"And there are other places, you know, where it talks about, you know, the name of Yahweh protecting people, right? And that doesn't mean, like they're going to write it in the sand as a magical charm and no one will be able to cross the consonants written in the sand or something to protect them. Right? This isn't some ritual magic thing, right? It's talking about something else. Right? Name with the capital N in there is referring to something else. And, and specifically it's referring, right. Name. Someone's name in the ancient world also means their identity. And we, we still use it that way in English, right? This person made a name for himself or he has a good name in the community, right? Meaning like his reputation, his identity, how he's seen. Right? And there are lots of places where that's obviously what's going on with that term. So people will appeal to God in the Old Testament when they know they've done wrong, they know they've been wicked and they're seeking God's forgiveness. And they'll say, well, pardon us, like the people of Israel, pardon us, do not be wrathful with us for your namesake. Right? So that the nations won't speak badly about you, that you brought us out of Egypt. And then killed us all in the desert. Show mercy on us for the sake of your reputation, if nothing else. We don't deserve it, but don't let your day be drugged through the mud. But that idea of identity is important. And so when Yahweh, the God of Israel, says he's going to put his name, the place where I will put my name, referring to the Tabernacle and then the Temple."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3284.39,"end":3284.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3285.35,"end":3306.15,"speaker":"Fr Stephen De Young","text":"In Jerusalem, that's the place where he is going to be. Right. That's. That's what he means. So when he says, right, that his. His name is going to be in this angel, this being who's going to lead them. Right. That means that his identity, who he is, is going to be in him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3306.79,"end":3307.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3308.31,"end":3328.22,"speaker":"Fr Stephen De Young","text":"And that then we see elements of this in the New Testament with reference to Christ in a couple of different ways. So in one sense, when we talk about the name being placed in the tabernacle and in the first Temple, there's this. The. We're bringing it back. The Theophanic glory cloud."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3328.22,"end":3328.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3330.74,"end":3365.19,"speaker":"Fr Stephen De Young","text":"As I'm inclined to do, shows up. It appears. Right. And that's a manifestation of the Holy Spirit. Right. Just as the pillar of fire, the pillar of smoke. Right. This manifestation of the Holy Spirit, the presence of God. And so we see, for example, in John 1, verse 33, the way in which St. John the Forerunner knew who Jesus was. Knew who the Messiah was, according to him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3365.75,"end":3382.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is what St. John the Forerunner says. I myself did not know him, but he who sent me to baptize with water said to me, he on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3384.15,"end":3404.21,"speaker":"Fr Stephen De Young","text":"Right. And so the symbol that's given to Moses to say, this is how you will know my angel. Right. Who this is, who is going to lead you through the wilderness into the land, is the same sign that's given to St. John the Forerunner to identify Jesus in that sense. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3404.21,"end":3406.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The name, the Spirit."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3406.61,"end":3448.31,"speaker":"Fr Stephen De Young","text":"Right. And we also see in terms of the Holy Spirit dwelling within Christ, not only the references to himself as a temple, but this is what's going on. You note in that last part of the verses we read from Exodus, do not rebel against him, for he will not pardon your transgression, for my name is in him. Right. That this is going to be serious now, if you rebel against it because he's going to be with you, you are going to be more accountable. And there will not be forgiveness if you rebel against him. This makes sense of one of the passages that gets people really worried in Mark, that's also paralleled in Matthew."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3448.87,"end":3487.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This reference to, you know, if you blaspheme against the Holy Spirit, then it's not going to be forgiven you. And of course, you know, I, I remember when I was young, you know, growing up in low church Protestant circles, the people trying to figure out what exactly is the sin that is the blasphemy against the Holy Spirit, you know, because if you commit that one, well, there's no forgiveness and, you know, you're on your way to hell as a result. Kind of missing the point here, which is that it's an emphasis on the divinity of Christ and on, you know, the Holy Spirit as well."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3488.18,"end":3518.24,"speaker":"Fr Stephen De Young","text":"Right. That because Christ was in their midst, literally. Right. Directly there, speaking to them, that their rebellion against him, they're accusing him of being demon possessed in both of those cases. Right. That rebellion is not, is not going to find forgiveness. They are more accountable now. Right. Than they would be if he was not there. Right. Which he says repeatedly in St. John's Gospel, if I had not come to you, you would not have sinned."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3519.12,"end":3519.92,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3520.4,"end":3566.57,"speaker":"Fr Stephen De Young","text":"Yeah, but so we mentioned that there are a couple ways in which that the name being present, the identity of God being present in Christ is expressed. The other way is there are a series of references in St. John's Gospel. In St. John's Gospel 14, verse 11 and 20, and 17, verse 23, and a few others that talk about the Father being in Christ, the Father's in him. Right. This is the same idea that that is being expressed in the Old Testament. So in the Old Testament here, to be clear, right. This figure is being described, the angel of the Lord is being described in the same terms that Christ is described in the Gospels. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3566.57,"end":3572.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of co inhering, so to speak, of the persons of the Trinity with one another."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3572.41,"end":3641.73,"speaker":"Fr Stephen De Young","text":"Right. And he is now going to be leading Israel out of Egypt and into the wilderness. And we actually see him exercising this role in a few places. And again, it's easy to kind of skim over these and not notice. And there's one of these in Exodus, chapter 14, verses 19 and 20. And this is where Pharaoh's armies have sort of started now, chasing after Israel, after Israel has left Egypt and Israel has come to the Red Sea. And now they're kind of between a rock and a hard place. They've got the Red Sea on one side and they've got. And we've talked about how that death is involved with that. So They've got the Reed sea, they've got death on one side and they've got Pharaoh and his armies on the other side, and they're sort of squished in between. And Yahweh talks to Moses and says he hears his voice and says that he's going to protect him and to gather the people next to the sea. And then in verse 19, this happens."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3642.37,"end":3681.66,"speaker":"Fr Andrew Stephen Damick","text":"Which again, is not in the Charlton Heston film, which it should be. I mean, come on. Okay, so Exodus 14, 19, 20. Then the angel of God who was going before the host of Israel, moved and went behind them, and the pillar of cloud moved from before them and stood behind them, coming between the host of Egypt and the host of Israel. And there was the cloud and the darkness, and it lit up the night without one coming near the other all night. And so, you know, there's this. He becomes the rear guard, so to speak."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3681.82,"end":3682.54,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3682.7,"end":3685.3,"speaker":"Fr Andrew Stephen Damick","text":"So that Israel can escape. And. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3685.3,"end":3691.59,"speaker":"Fr Stephen De Young","text":"And here next to the water, we see the voice of the Father."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3692.07,"end":3692.43,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3692.43,"end":3715.91,"speaker":"Fr Stephen De Young","text":"We see, we see the angel of Yahweh. Right? Christ. And we see the Holy Spirit in the pillar of cloud. All manifest here by the water. Hint, hint for January. There you go. But, but also, right, it's this. All three are as one, acting to protect Israel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3716.88,"end":3717.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3717.08,"end":3730.8,"speaker":"Fr Stephen De Young","text":"To protect the people of God. And there is a place in the New Testament that very directly interprets this angel as being Christ."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3731.28,"end":3781.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is kind of hidden, again with translation issues. And we'll explain exactly why this is the case. Okay, so this is Jude, verse five. There's only one chapter, so it's Jude five. Now, I want to remind you, although you once fully knew it, that Jesus, who saved a people out of the land of Egypt, afterward destroyed those who did not believe. Now, the reason why this is a little hidden is because a lot of translations of the Bible, up to what just maybe a few decades ago, said the Lord who saved a people out of the land of Egypt, but here it's Jesus. So, okay, so what's going on? Why should it be? Why should the translation be Jesus? I mean, it's clearly. Those are two different words even in Greek, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3781.77,"end":3785.93,"speaker":"Fr Stephen De Young","text":"Well, yeah, of course, the Lord could there mean Jesus, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3787.45,"end":3790.85,"speaker":"Fr Andrew Stephen Damick","text":"It's not wrong. It's just not as specific as it could be."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3790.85,"end":3812.54,"speaker":"Fr Stephen De Young","text":"As specific. Right. And so basically what happened is we found a bunch of much older manuscripts. Well, not a bunch. We found some older, much older manuscripts of St. Jude's Epistle. And these older ones we found all have Jesus there. All have the name Jesus there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3812.94,"end":3816.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you got Jesus standing there on the shore of the Red Sea."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3816.7,"end":3829.39,"speaker":"Fr Stephen De Young","text":"Right. And it's now pretty clear. And it's. It's so clear now that there's really nobody out there who's arguing for Lord except for maybe some King James only folks, I should say."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3829.39,"end":3829.79,"speaker":"Fr Andrew Stephen Damick","text":"Nobody."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3829.79,"end":3874.45,"speaker":"Fr Stephen De Young","text":"There's somebody out there arguing everything on the Internet. But in terms of New Testament scholars. Right. There's nobody really arguing that that's not Jesus there. And it's fun to watch people who don't like talking about Christ in the Old Testament bend over backwards into bizarre yoga positions to try to explain what this is talking about, including, I won't name the person they name themselves frequently enough. But trying to argue that it's talking about Joshua, like Old Testament Joshua. Right. Who I guess in his mind saved people out of Egypt and then killed them all in the desert."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3875.13,"end":3878.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Afterward destroyed those who did not believe. That's what it says there in Jude 5."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3879.53,"end":3879.93,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3881.37,"end":3900.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because Joshua and Jesus are the same name is the claim. I mean, it is. They are the same name, but they're trying to claim it was Joshua who was the servant of Moses and becomes a successor who did this. But that doesn't make any sense in the whole verse."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3900.74,"end":3926.72,"speaker":"Fr Stephen De Young","text":"Right, right. And so this is very clearly talking about this figure. Right. Who led the people out of Egypt. And then who, as we're going to see some examples of in the third half, destroyed a lot of the. Those who did not believe. So a big part of this, you know, moving on in Exodus 23 after what we read already about the angel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3927.03,"end":3927.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3929.83,"end":3945.59,"speaker":"Fr Stephen De Young","text":"Yahweh, the God of Israel, in talking to Moses, goes on to outline sort of what this is going to be about. So he read up to the warning where if you rebel against him, it's not going to be forgiven. But then in verse 22, he makes a promise in the other direction."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3946.15,"end":3977.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he says this. But if you carefully obey his voice and do all that I say, then I will be an enemy to your enemies and an adversary to your adversaries. Which is interesting. You notice the shift there. If you carefully obey his voice and do all that I say, then I will be an enemy to your enemies and adversary to your adversaries. Again, this close association between the Father who's speaking and the angel of the Lord that's being sent out in front of the armies."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":3977.53,"end":4055.26,"speaker":"Fr Stephen De Young","text":"Right. And so they're completely on the same page. Right. And this is, again, the way this is going to get put by the fathers is One nature, one will, one energy. But they're saying and doing the same thing as Christ is going to say over and over again in St. John's gospel. He does what the Father does. He says what the Father says. But the call here, then the promise is that if the people of Israel align themselves, then with that will and that energy, with what God is doing in the world. Right. And with good desires, if they align themselves and participate in it, then they will be on the same side as Yahweh, the God of Israel. He will be their God. He will be the enemy of their enemies, the adversary, their adversaries. He will lead them into battle. They won't be on their own. It won't be subject to superior numbers, but God in the person of the angel of Yahweh will lead them. And this isn't just sort of a hypothetical thing about adversaries, because in the next couple verses in Exodus 23, those adversaries get listed."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4055.42,"end":4086.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Like these are actual battles that are about to happen. So verse 23, when my angel goes before you and brings you to the Amorites and the Hittites and the Perizzites and the Canaanites, the Hivites and the Jebusites, and I blot them out, you shall not bow down to their gods, nor serve them, nor do as they do, but you shall utterly overthrow them and break their pillars in pieces. No neutral ground, Right? Yeah, yeah. Don't bow down to their gods. Hello."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4086.72,"end":4090.63,"speaker":"Fr Stephen De Young","text":"And yes, folks, here's the giants. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4090.63,"end":4091.03,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4091.43,"end":4103.55,"speaker":"Fr Stephen De Young","text":"So gigantomachy here is the purpose of the Exodus. It's not just, I'm gonna free some slaves and give them a nice place to live. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4103.55,"end":4104.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're being sent out."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4104.95,"end":4119.28,"speaker":"Fr Stephen De Young","text":"They're sent on a mission. Right. To remove these giant clans. Right. Then. And notice here what how blotting them out is defined. Blotting them out is not defined as exterminating their DNA."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4120.08,"end":4136.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. It's about overthrowing their worship, breaking their pillars in pieces. This is about destroying temples and stuff. It's about getting rid of the gods and the paganism, the actual practices of worshiping these gods."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4136.56,"end":4140.16,"speaker":"Fr Stephen De Young","text":"Right. The religious rituals that constitute these people groups."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4140.48,"end":4144.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And of course, if you end the rituals, then the people groups don't exist at all anymore."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4144.31,"end":4148.99,"speaker":"Fr Stephen De Young","text":"Right. They dissolve into other people groups, preferably Israel. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4148.99,"end":4151.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, ideally. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4151.27,"end":4151.63,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4151.63,"end":4151.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4151.95,"end":4166.71,"speaker":"Fr Stephen De Young","text":"So this is. This is sort of the beginning of that arc that we mentioned at the beginning of this half. Right. That now we have this figure who's going to lead them so now we're going to check in, in the book of Joshua."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4167.19,"end":4167.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4167.83,"end":4236.93,"speaker":"Fr Stephen De Young","text":"Sort of in media race. Right. For the beginning of. Not really the beginning, but early on in those battles that we just heard about, specifically in Joshua chapter five. And the first part of Joshua chapter five, before we get to the angel of the Lord, is this. We've just crossed the Jordan river. Right. The Jordan has parted in front of the people. When they brought the Ark of the Covenant to it, they've passed through the Jordan on dry ground and they're now going to begin the conquest proper. They're now going to face off with these, with these giant clans. And so what does Joshua do with the people? Right. Well, what was Moses told to do? Right. If you want the angel of Yahweh to lead you into battle and defeat your enemies, who. Right. Then you need to align yourself with Yahweh, the God of Israel. And so he does that by first circumcising the people and then they celebrate the Passover."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4237.81,"end":4295.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you might wonder, like, wait, I thought that these people were circumcised. Right. Explains in Joshua 5, 4, and this is, I'm quoting. And this is the reason why Joshua circumcised them. All the males of the people who came out of Egypt, all the men of war had died in the wilderness on the way after they had come out of Egypt. What that means is that the ones who had been circumcised, they didn't actually circumcise their own sons, meaning they became unfaithful to Yahweh. They were not doing the thing that you were supposed to do for people to be in the covenant. And so this is a renewal of that covenant, which includes both the entrance into the covenant via circumcision and then the fulfillment of what it means to really be Israel, which is you celebrate the Passover. Right. Because that's what made them, that's what constituted them as a nation in the first place. And then it gets repeated over and over again and perpetuated, just as the."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4295.95,"end":4306,"speaker":"Fr Stephen De Young","text":"Giant clans are constituted by their demonic rituals. Right. It's circumcision and the eating of the Passover that constitute Israel generationally."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4306.08,"end":4307.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4307.2,"end":4313.28,"speaker":"Fr Stephen De Young","text":"And then that we've talked about before, and I'm sure we'll talk about again, how that plays into baptism and the Eucharist."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4313.76,"end":4314.88,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4314.88,"end":4319.84,"speaker":"Fr Stephen De Young","text":"Baptism and receiving the Eucharist in the church is what constitutes the church as a people, as a nation."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4320.4,"end":4331.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. So, yeah. So, you know, getting the people ready now, renewing their faithfulness to God, you know, bringing them back into alignment with him. And then this happens."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4331.61,"end":4333.05,"speaker":"Fr Stephen De Young","text":"So verse 13."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4333.05,"end":4333.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, go ahead."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4333.73,"end":4343.61,"speaker":"Fr Stephen De Young","text":"Yeah. They align themselves with God. Right. And then who shows up? Right, Verse as promised."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4343.93,"end":4392.96,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yeah, yeah, yeah. Verse 13 of Joshua 5, when Joshua was by Jericho. And I'm going to read a few verses here. When Joshua was by Jericho, he lifted up his eyes and looked, and behold, a man was standing before him with his drawn sword in his hand. And Joshua went to him and said to him, are you for us or for our adversaries? And he said, no, but I am the commander of the army of the Lord. Now I have come. And Joshua fell on his face to the earth and worshiped and said to him, what does my Lord say to his servant? And the commander of the Lord's army said to Joshua, take off your sandals from your feet, for the place where you are standing is holy. And Joshua did so. Lots of fun stuff there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4393.6,"end":4539.24,"speaker":"Fr Stephen De Young","text":"Right, right. And so we have to take note here with this passage. Right. That there is, within the tradition of the orthodox Church, there is a minority position, as you alluded to in your intro to this half, there's a minority position that identifies this figure, the commander of Yahweh's hosts, as Saint Michael. Right. There's at least one Synnexaurian that does that. I think there's a hymn. I know there are a couple of church fathers who do. Now, this is a minority position, but we're trying to be good corporate citizens here. Model. Model good. Good behavior. When we're. When we're talking about the tradition of the church, and we're talking about the writings of the church fathers, and we're talking about our liturgical tradition. Right. That doesn't represent a range of options for us. Right. That's not how you do it. Right. That's not how any of this works. Right. The. The. The way this works is we want to orient ourselves within the tradition as a whole. And so that means if we're gonna say that some part of the tradition that conflicts with other parts of the tradition got it wrong, we have to then explain how. We have to give an explanation. Right. Of, well, where does this minority report come from? Or at least why is that minority report not correct? Okay. And so that's. That's what we're now going to endeavor to do, is try to show from this text why we would agree with the majority position in the orthodox tradition that identifies this with the angel of the Lord and with Christ, starting all the way back with Saint Justin Martyr, Saint Justin the philosopher, in the second century in terms of Church tradition and before that in Jewish writings. So there are three details here in those three verses you read that we're going to point at. The first one is that Joshua sees him with this drawn sword next to Jericho, which they're about to attack. Spoilers. You may have heard that story."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4541.96,"end":4546.79,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I sang a song about this when I was quite young, along with many other children in Sunday school."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4547.35,"end":4559.03,"speaker":"Fr Stephen De Young","text":"Little known liturgical fact that I'm sure all of the liturgic scholars listening will vouch for. The reason we go around things three times instead of seven is that if we did seven, they would collapse. So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4560.79,"end":4561.63,"speaker":"Fr Andrew Stephen Damick","text":"Who would collapse?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4561.63,"end":4562.55,"speaker":"Fr Stephen De Young","text":"The walls or us?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4563.43,"end":4564.23,"speaker":"Fr Andrew Stephen Damick","text":"Maybe both."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4564.31,"end":4617.48,"speaker":"Fr Stephen De Young","text":"Yeah, Los dos. So, but, so this drawn sword, the seeing this figure with a drawn sword, this is imagery that's used elsewhere in the Old Testament both before and after. And so that the instance before or instances before they're connected is in numbers, chapter 22, which is the story of Balaam and his donkey, which we're going to talk about more in the third half teaser. But there the angel of Yahweh appears and he has this drawn sword. Right, right. And that's one of his identifiers. A later One is in 1st Chronicles 21:16. We're also going to talk about that one in the third half in more detail. But there also the angel of the Lord appears with a drawn sword."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4618.04,"end":4619.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To David."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4619.56,"end":4636.73,"speaker":"Fr Stephen De Young","text":"Right. And then the third time is where this drawn sword imagery appears is in Ezekiel 21. Really the whole. That's all through the chapter, but verses 4 and 5 and verse 28. And there it's Yahweh himself who has drawn his sword and has a drawn sword."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4637.37,"end":4670.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, you can see like there's an icon of Christ with a sword, which, which is. I mean, it's this. Right. I, you know, it's funny, I sometimes see that icon used in, in, in contexts where I think people intend it to be like, you know, this sort of, I don't know, you know, like here, here, look, here's Jesus with a sword. You know, back away, heretics. You know, that's. But, but that's not, that's not what's going on in any of these passages in the scripture."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4670.58,"end":4672.02,"speaker":"Fr Stephen De Young","text":"Judgment on Israel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4672.9,"end":4676.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, yeah, yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4676.93,"end":4698.37,"speaker":"Fr Stephen De Young","text":"But, so that's, so that's point one in our case. Right. That, that imagery is imagery that's used for the angel of the. Of Yahweh and for Yahweh himself elsewhere in the Old Testament, where it's used. Right, right. And so that's an identifier of this figure. Second point is that Joshua falls on his face on the earth and worshiped him. Yep."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4698.53,"end":4703.01,"speaker":"Fr Andrew Stephen Damick","text":"And he doesn't say, get up, man. I'm not, you know, I'm just like you."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4703.41,"end":4705.33,"speaker":"Fr Stephen De Young","text":"Yes. As we see angels do."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4706.16,"end":4707.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. They've been to that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4708.08,"end":4708.44,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4708.44,"end":4708.72,"speaker":"Fr Andrew Stephen Damick","text":"In."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4708.72,"end":4718.64,"speaker":"Fr Stephen De Young","text":"In the scriptures. And so if someone is going to say that this is St. Michael, they have to then explain why St. Michael is here allowed to receive worship."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4719.52,"end":4719.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4720.16,"end":4745.82,"speaker":"Fr Stephen De Young","text":"Why he doesn't say anything. And then the third point is the actual response when he worships him, rather than saying, don't is commander, Lord's army says, take off your sandals from your feet for the place where you are standing is holy. Which is an exact quote of what the angel of the Lord, the angel of Yahweh says in Exodus, which we'll also be talking about in Act 3."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4746.22,"end":4746.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4746.62,"end":4758.22,"speaker":"Fr Stephen De Young","text":"So each of those three verses, in various fairly clear ways, identifies this as the angel of the lord over against St. Michael. And so that's why we take that position."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4759.05,"end":4759.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4759.25,"end":4761.29,"speaker":"Fr Stephen De Young","text":"Within the tradition and think you should, too."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4763.29,"end":4766.01,"speaker":"Fr Andrew Stephen Damick","text":"But we're not going to come to your house and beat you on the head if you don't."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4766.89,"end":4767.53,"speaker":"Fr Stephen De Young","text":"I might."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4768.33,"end":4771.49,"speaker":"Fr Andrew Stephen Damick","text":"Father Stephen might. But no. Yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4771.49,"end":4775.69,"speaker":"Fr Stephen De Young","text":"No, I'm on probation, so I couldn't get it anyway."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4775.77,"end":4781.05,"speaker":"Fr Andrew Stephen Damick","text":"You're under orders. Yeah, yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4781.61,"end":4817.37,"speaker":"Fr Stephen De Young","text":"So that's then the sort of midpoint of this arc. Right. So the angel, the Lord, the angel of Yahweh leads them through the wilderness, leads them into battle and the conquest. So all that stuff that happens in Joshua that you can read about in my recent book, all of. All of that stuff is being led by the angel of the Lord. Keep that in mind. Is being led by Christ. All that gigantomachy. And then we get to the end of that arc in the second chapter of the Book of Judges."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4818.81,"end":4871.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is Judges, chapter two, verses one through five. Now, the angel, the Lord went up from Gilgal to Bohim, and he said, I brought you up from Egypt and brought you into the land that I swore to give your fathers. I said, I will never break my covenant with you, and you shall make no covenant with the inhabitants of this land. You shall break down their altars. But you have not obeyed my voice. What is this you have done? So now I say, I will not drive them out before you, but they shall become thorns in your sides, and their gods shall be a snare to you as soon as the angel of the Lord spoke these words to all the people of Israel. The people lifted up their voices and wept, and they called the name of that place Bohim, and they sacrificed there to the Lord. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4871.47,"end":4873.11,"speaker":"Fr Stephen De Young","text":"Bo Kim means weeping."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4873.67,"end":4874.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4874.95,"end":4876.55,"speaker":"Fr Stephen De Young","text":"That's why they called it that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4877.51,"end":4892.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I mean, this is, you know, so he's been. He's been with them all this time. They did the thing he told them not to do. And so he leaves and says, you guys are now going to lose. You're going to, you know, your enemies are going to overtake you, and their gods are going to be a snare for you."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4893.11,"end":4896.79,"speaker":"Fr Stephen De Young","text":"Yeah. And this is the exact wording from back in Exodus 22."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4897.52,"end":4899.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The thing I told you not to do."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4900,"end":4911.96,"speaker":"Fr Stephen De Young","text":"Destroy, he said, destroy all of those idols, because if you don't, they'll be a snare to you. Right. And so here you went and worshiped them. Right. And now they're going to be a snare to you."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4911.96,"end":4912.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4912.56,"end":4922.08,"speaker":"Fr Stephen De Young","text":"So it's exactly, you know, concluding. Concluding that arc. But we see here the angel of the Lord travels from one place to another."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4923.53,"end":4924.25,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4924.25,"end":4970.94,"speaker":"Fr Stephen De Young","text":"It's not just he appeared at this one place. He travels from one place to another, meaning he has continued to be with them this entire time. He has continued to be with the people of Israel this entire time until now when he leaves. Notice also that when the angel of the Lord speaks here, when the angel of Yahweh speaks here, he speaks in the first person. He says, I brought you up from Egypt and brought you into the land that I swore to give to your fathers. I said, I will never break my covenant with you. So now I say, I will not drive them out before you. Right. So this is all first person. Right. Your average angel, even archangel, St. Michael."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4970.94,"end":4971.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4972.26,"end":4974.26,"speaker":"Fr Stephen De Young","text":"Don't speak in the first person this way."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4974.52,"end":4974.64,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":4974.64,"end":5026.34,"speaker":"Fr Stephen De Young","text":"Because St. Michael didn't make any oaths to Abraham or any promises, Right? He didn't make the covenant. It's not his covenant. Right. So the angel of Yahweh is speaking in the first person as Yahweh here, saying he did things not just in terms of, you know, Yahweh said he bring them out of Egypt. Now the angel of Yahweh is saying he brought them out of Egypt, but also he's saying he did things that. That Yahweh did back in Genesis with Abraham in terms of the promises and the covenants. And so there are plenty of places we don't need to listen. There are plenty of places. The Old Testament where of course, Yahweh himself says he brought them and was going to bring them and did bring them out of Egypt. It's the beginning of the Ten Commandments, Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5026.42,"end":5035.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah. I mean, it's one of the classic things, like, hey, everybody, remember me? I'm the one who brought you out of Egypt. You know, like this is. This is God talking about himself."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5035.39,"end":5035.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5035.83,"end":5040.19,"speaker":"Fr Andrew Stephen Damick","text":"Over, over and over again. He just. He says he defines himself this way."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5040.67,"end":5043.71,"speaker":"Fr Stephen De Young","text":"Right. But here it's the angel of Yahweh who's saying that in the first person."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5044.11,"end":5044.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5045.47,"end":5078.69,"speaker":"Fr Stephen De Young","text":"And so, yeah, because of the idolatry, he now departs. I want to add one note here, Right. Because we talked about this in terms of the dynamic between the Flood and the Tower of Babel, Right. That God didn't want to destroy humanity again and so he had to leave. Right. So even in the angel of the Lord leaving, remember that lack of forgiveness? Right. Those dire consequences for rebelling against him while he was there. Right. So his departure is itself a mercy for this rebellious people."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5079.73,"end":5082.77,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Because you don't want to be doing that stuff right in his face."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5083.34,"end":5086.38,"speaker":"Fr Stephen De Young","text":"Right. It's better if he's not there, if that's what they're going to do."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5086.54,"end":5099.1,"speaker":"Fr Andrew Stephen Damick","text":"And you know, and honestly, it's. This is a sort of handing them over to Satan. Right. They're being ensnared by these false gods and they're going to suffer for that. The point being to help bring them to repentance."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5100.22,"end":5100.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5101.02,"end":5101.54,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5101.54,"end":5101.98,"speaker":"Fr Stephen De Young","text":"Yep."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5103.18,"end":5109.33,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that is our second half. And we'll be right back with the third half right after this break."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5110.28,"end":5126.44,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5132.04,"end":5135.64,"speaker":"Fr Stephen De Young","text":"Hi, this is John Maddox. You know, when you support Ancient Faith."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5135.64,"end":5137.72,"speaker":"Announcer","text":"Radio, you're not only helping to make."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5137.72,"end":5142.79,"speaker":"Fr Stephen De Young","text":"This ministry possible for, for you, but also for people like Bryce in Australia."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5143.43,"end":5145.39,"speaker":"Fr Andrew Stephen Damick","text":"I'd firstly just like to say that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5145.39,"end":5158.95,"speaker":"Fr Stephen De Young","text":"I love your show and what you do. It means a lot to all of us listening. I'm down in Australia and over here, Orthodoxy is basically unheard of. I'm not orthodox. I was raised into an Evangelical Protestant family."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5159.59,"end":5162.03,"speaker":"Fr Andrew Stephen Damick","text":"However, from a gradual exposure and desire."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5162.03,"end":5163.87,"speaker":"Fr Stephen De Young","text":"To learn more about Orthodoxy, I've come."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5163.87,"end":5165.68,"speaker":"Fr Andrew Stephen Damick","text":"To agree and see truth in pretty."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5165.68,"end":5167.28,"speaker":"Fr Stephen De Young","text":"Much everything the church teaches."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5167.68,"end":5170.28,"speaker":"Fr Andrew Stephen Damick","text":"The nearest English speaking Orthodox church is."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5170.28,"end":5172.32,"speaker":"Fr Stephen De Young","text":"Several hours away and I feel all."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5172.32,"end":5173.72,"speaker":"Fr Andrew Stephen Damick","text":"Alone in my pursuit of the faith."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5173.72,"end":5188.8,"speaker":"Fr Stephen De Young","text":"Here, currently my only exposure to Orthodoxy is through Ancient Faith Radio. And my friend, how should I introduce the idea that I may be inquiring into Orthodoxy to my parents? Thanks again, Bryce. Would you consider a donation to AFR right now?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5189.04,"end":5190.8,"speaker":"Fr Andrew Stephen Damick","text":"You can do so on our app."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5191.05,"end":5199.25,"speaker":"Fr Stephen De Young","text":"Or go to our website@ancientfaith.com Support Ancient Faith Radio here for you and for."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5199.25,"end":5200.73,"speaker":"Fr Andrew Stephen Damick","text":"People all over the world."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5213.69,"end":5229.82,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5231.9,"end":5281.59,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everybody. This is the third half of the show. Before we get into third half, I actually wanted to just pass on a question that we got on Facebook, which I replied to the asker, but I think it just might be useful for people to hear. It's not totally on topic, but it's kind of generally about the show. So Bradley asks this. He says, I have a sincere and curious question. What is your guys all time favorite Bible translation in English as in the most accurate for linguistics and hermeneutic studies and for following along with this podcast. And what I told him is that we often quote from the esv, but probably maybe just as often or maybe not quite as often. We're reading your translation, Father. I don't know."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5281.99,"end":5285.59,"speaker":"Fr Stephen De Young","text":"What do you think? Not commercially available and therefore does not help him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5285.83,"end":5304.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Exactly. Yeah. He lists off in his question. He says I own the osb KJV Dewey Rheims Knox NKJV RSV CE nrsvce NAB NAB R E N I V ESV NLT Jerusalem Bible and Revised Jerusalem. I don't see the Wycliffe Bible in there. Bradley."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5304.96,"end":5316.64,"speaker":"Fr Stephen De Young","text":"The BI B L E. That's the book for me. Yeah. Yeah. So you got most of them. Yeah. So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5318.56,"end":5318.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5318.92,"end":5322.08,"speaker":"Fr Stephen De Young","text":"It kind of depends on, on what you're doing. He said you wanted most accurate."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5323.04,"end":5325.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean if, if, if you're."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5325.24,"end":5351.1,"speaker":"Fr Stephen De Young","text":"Gonna do you and I know you've heard me do this before. If you're. If want to do more deep digging in Bible study and you're not able to do the language, the original languages, which is most people. Right. Who want to do more studying and that's fine. That's okay. I usually recommend that people get an net full notes version."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5352.38,"end":5390.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which if you haven't seen and by the way you can check this out yourself online. Right. If you just Simply go to netbible.org you can see what the content is. And what that is, is it's, you know, like, for instance, if you. If you turn to John Chapter one, you see this tiny little text in the middle at the top, and that's the biblical text. And then reams of translators notes underneath it, which is. Which is what I mean, that's what this book is. It's piles and piles. Now, that doesn't. That's not to say that, you know, we would necessarily agree with everything that's in the notes, but you can see what they're doing."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5391.68,"end":5422.75,"speaker":"Fr Stephen De Young","text":"Right, Right. That's what's important. And that's why it's important that you get the full notes edition. I don't think the translation by itself is a huge improvement over like the ESV or the RSV or a number of other English translations, but those notes, if you get the full notes, kind of let you behind the curtain as an English reader into what they're doing so that you can see what they're doing and decide whether you agree with them or not, which you don't get with most translations."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5422.99,"end":5423.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5423.35,"end":5434.11,"speaker":"Fr Stephen De Young","text":"Yeah, they kind of show their work. And because the scholars who did that and put it together made it public domain, you can get print copies relatively cheaply."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5434.43,"end":5438.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I have a decent hardcover one that I got for like $35 or something like that, I think."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5439.28,"end":5439.56,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5439.56,"end":5443.68,"speaker":"Fr Andrew Stephen Damick","text":"But remember, make sure you get the one that says Night Bible. With full notes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5444,"end":5445.6,"speaker":"Fr Stephen De Young","text":"Yeah, with full notes edition."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5445.6,"end":5446.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5446.56,"end":5496.29,"speaker":"Fr Stephen De Young","text":"So that's. That's really good in terms of you. If you're just going to read a translation and you don't want to dig into notes like that. The thing that's probably the closest is still the old nasb, not the newer edition they did recently. It's okay. The newer edition, but yeah, sort of. The NASB classic is fairly woodenly literal, fairly to the point that some of the sentences are unwieldy and hard to read. But, you know, so that's. That's something. The esv, which I'll let you in on the big secret, because I like doing this. The ESV is the RSV."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5497.33,"end":5498.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's just updated a little bit."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5499.01,"end":5501.89,"speaker":"Fr Stephen De Young","text":"Yeah. 96% of the text is identical."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5502.37,"end":5502.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5502.81,"end":5509.97,"speaker":"Fr Stephen De Young","text":"Between the RSV and the ESV. The other 4% are updates. Like that thing in Jude 5 that we talked about."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5510.29,"end":5512.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We were reading from the esv, just that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5512.97,"end":5531.5,"speaker":"Fr Stephen De Young","text":"That's based on new. New textual finds. Right. Is that where. And Dead Sea Scrolls, where they updated some things in the Old Testament and those Dead Sea Scrolls updates in the Old Testament mostly bring it closer to the Greek. So from an Orthodox perspective. Great. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5531.66,"end":5532.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5532.86,"end":5560.9,"speaker":"Fr Stephen De Young","text":"And the RSV is already. RSV is the first major English translation of the Bible that had Orthodox input into the translation. A lot of folks don't know that, but. So, yeah, the esv, because the ESV was the basis for the Reformation study Bible, it's gotten this rap as being like the Calvinist translation, but it's really not. It's just the RSV that's just propaganda. So, yeah, hopefully that's."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5561.38,"end":5590.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, my approach as. As you're, you know, as so many people, is I just own a lot of Bibles and Because, I mean, we live in an era in which owning a lot of Bibles or even having a bunch of them on your phone is not hard and not. Not really that expensive. So I think it's just worth it, you know, if you, especially if you're really trying to kind of get underneath the language a little bit to. To do that, you know, but. But there's no, there's no silver bullet, unfortunately, you know, that's okay. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5590.89,"end":5645.23,"speaker":"Fr Stephen De Young","text":"There is no perfect Bible. Even if I did from scratch do my own translation of the whole Bible, there would be plenty of people who would disagree with it and they're probably, they'd probably be right about some of the disagreements. Yeah, right. So I did the old NT Wright line that when he started teaching, he used to tell everybody at the beginning of his classes, 10% of what I'm about to teach you is wrong. I don't know what 10% or I would fix it. Right. Just keep that in mind. And he said after he had been teaching for 20 years, he started saying, 20% of what I'm about to teach you is wrong. So same applies to me. Right. Like, I get things wrong. That's not news to most listeners, I don't think. So There will never be a perfect Bible translation because no individual is perfect to do it and no committee has ever done anything well in the history of mankind."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5648.91,"end":5816.73,"speaker":"Fr Andrew Stephen Damick","text":"All right. Hopefully that helps Bradley and probably helps a lot of other people too, I hope, at least somewhat. So in the third half, we're going to simply talk about a bunch of other times that the angel of the Lord shows up. But I think it's important to just go over these just so we get some. Again, the whole point is to get a broad picture of who the angel of the Lord is as depicted in holy Scriptures. And this the first of four parts of Old Testament Christology Episodes that we're going to have. All right, so the first one we're going to look at is from Exodus, chapter three. And this is a big one. I mean, this is a really, really famous one. This is where Moses sees the burning bush. So Exodus 3, verses 1 through 6. Now, Moses was keeping the flock of his father in law, Jethro, the priest of Midian. And he led his flock to the west side of the wilderness and came to Horeb, the mountain of God. And the angel of the Lord appeared to him in a flame of fire out of the midst of a bush he looked, and behold, the bush was burning, yet it was not consumed. And Moses said, I will turn aside to see this great sight. Why the bush is not burned. When the Lord saw that, he turned aside to see God called to him out of the bush. Moses, Moses. And he said, here I am. Then he said, do not come near. Take your sandals off your feet, for the place on which you are standing is holy ground. And he said, I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob. And Moses hid his face, for he was afraid to look at God. And the first thing I want to mention here, just in terms of setting, because I think this is important, if you listen closely, notice it says that Moses went to Horeb, the mountain of God, and saw the burning bush. And, you know, you might think to yourself, wait a minute, I thought the burning bush was at Sinai. And you would be correct, because if you've listened to our sacred Geography episodes, you know that the mountain of God is wherever God has made that mountain be, being the mountain of God. So that means that the burning bush which Moses saw at Horeb is being the burning bush that is on Mount Sinai. Right. Now, that's in the monastery there on Sinai. So it is the same. It is being the burning bush. But I just wanted to point that out, because a lot of people. Oh, yeah, the burning bush is at Sinai. Yes, it is. But it also was at Horeb at this point in Exodus 3."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5817.13,"end":5835.61,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so, yeah, for our purposes here, in terms of the angel of yahweh, in verse 2 there of Exodus 3, it's the angel of the Lord who appears to him in a flame of fire out of the midst of the bush. And then God calls to him out of the bush."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5835.69,"end":5836.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Verse four."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5836.73,"end":5845.43,"speaker":"Fr Stephen De Young","text":"Right, right. And then he says that he's the God of Abraham and Isaac and Jacob. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5845.43,"end":5849.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Very clearly. The angel of the Lord is God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5850.07,"end":5864.23,"speaker":"Fr Stephen De Young","text":"Right. And There is a reason. It is not pure metaphor. It is not allegory, that when you see an icon of Moses at the burning bush, you see Christ in the bush."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5865.03,"end":5865.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5866.07,"end":5896.44,"speaker":"Fr Stephen De Young","text":"Right. You see Christ enthroned in the lap of his mother, the Theotokos, surrounded by the cherubic throne. Right. Because Christ there in Moses day is enthroned both on his human mother and on the throne of God, because he is God and man. But. Yeah, that's not a weird anachronism. That's not symbolic in a vague, frou frou sense. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5896.76,"end":5897.19,"speaker":"Fr Andrew Stephen Damick","text":"That's."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5899.26,"end":5904.38,"speaker":"Fr Stephen De Young","text":"That is who called tabosis from. From the bush. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5904.38,"end":5911.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, if this were a map, this would be the. You are here. You know, it is all those things at the same time."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5911.34,"end":5929.75,"speaker":"Fr Stephen De Young","text":"Yeah. And as we alluded to in the second half, that what is said here about taking off the sandals for the place you're standing on his holy ground is the exact same thing the commander of the Lord's host says to Joshua."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5929.91,"end":5930.47,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5930.55,"end":5935.91,"speaker":"Fr Stephen De Young","text":"When Joshua falls down and worship. Meaning it's the same person talking. Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5936.31,"end":5938.79,"speaker":"Fr Andrew Stephen Damick","text":"And has the same expectations of how to respond to him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5938.95,"end":5944.55,"speaker":"Fr Stephen De Young","text":"Right. And what makes it holy ground is not that this is some kind of sacred locale."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5945.51,"end":5945.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5945.91,"end":5946.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5946.19,"end":5948.71,"speaker":"Fr Andrew Stephen Damick","text":"Like Moses stumbled upon some ancient shrine."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5949.28,"end":5972.08,"speaker":"Fr Stephen De Young","text":"Yeah. It's. It's because God is there on that ground. It has become holy ground. It's because his presence is there. You're now in his presence. That means the same thing is true with the commander of Yahweh's hosts, with Joshua, when he says that, it's because God is standing there in front of him, that it's. That it's holy."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5972.64,"end":5973.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5973.44,"end":5977.7,"speaker":"Fr Stephen De Young","text":"And Moses is here, afraid to see."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5977.7,"end":5980.3,"speaker":"Fr Andrew Stephen Damick","text":"God, even though he hid his face."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":5980.3,"end":6040.51,"speaker":"Fr Stephen De Young","text":"Yeah. So that's one. Here's one. We're getting into the Book of Judges here. People love it when I talk about the Book of Judges. They're so thrilled every time I bring it up. This is actually in Judges six. And so this is. There's this cycle that repeats all through the Book of Judges that we saw. That cycle starts when the angel of Yahweh departs. Right. He. He leaves. And then because of that, because God is not there fighting their battles for them, these foreign oppressors come in. Right. They sin. The foreign oppressors come in and conquer them. Being conquered is bad. And so they cry out to God for deliverance and at least make a show of repentance. God raises up a judge to deliver them. They're delivered. They go back to sinning Right. This sort of endless cycle over and over."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6040.51,"end":6041.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it gets worse as you go."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6042.11,"end":6046.35,"speaker":"Fr Stephen De Young","text":"And it gets worse and worse. It's a downward spiral. Yeah. So."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6050.51,"end":6050.91,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6051.47,"end":6095.51,"speaker":"Fr Stephen De Young","text":"That and this part of the cycle here, Judges six, the. It's the Midianites, right, who are Edomites and Ishmaelites. Right. These are. These are the people who. Actually, Moses's wife was right, but they've come and they're now oppressing part of. Part of Israel. And the people right before the part we're going to talk about in judges 6, 7, 10, they cry out for deliverance. God sends a prophet, a human prophet to them who says, yahweh, the God of Israel has heard you. He is going to deliver you. And then in verse 11, he sends the angel of Yahweh, then appears to Gideon."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6095.91,"end":6096.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6096.63,"end":6129.83,"speaker":"Fr Stephen De Young","text":"For Gideon to be the guy who's going to do this, even though Gideon himself is not so keen on it necessarily. And so what we read there in Judges 6, verses 11 through 24, sort of briefly, is the angel of the Lord appears, and the angel of Yahweh appears, and Gideon speaks to him. And then verse 14 says, Then Yahweh turned to him and said, yeah, Which."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6129.83,"end":6135.27,"speaker":"Fr Andrew Stephen Damick","text":"Which, interestingly, in. In the Greek, it says the angel. The Lord turned to him and said, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6135.27,"end":6136.59,"speaker":"Fr Stephen De Young","text":"The Greek smooths it out."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6137.15,"end":6138.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6138.83,"end":6142.35,"speaker":"Fr Stephen De Young","text":"At least there's two versions of Greek Judges, but we won't get into all that."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6142.35,"end":6150.27,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, but the point being that the angel of the Lord is closely identified with Yahweh here in this, the whole Gideon story, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6150.35,"end":6182.68,"speaker":"Fr Stephen De Young","text":"The angel of Yahweh appears, and then Yahweh turns and says to him, right? And then Yahweh speaks again in verse 16. And then Gideon goes to get some food to show hospitality. And then it's the angel of Yahweh again, who's the actor, who extends his staff that he's carrying and touches it to the food that's sitting on a rock. And the food goes up in flames as a sacrifice, as a burnt offering."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6182.84,"end":6183.24,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6183.4,"end":6191.4,"speaker":"Fr Stephen De Young","text":"And the smoke and flame goes up to heaven, and the angel of Yahweh disappears. When he disappears, Gideon's like, oh, no, I'm going to die."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6192.64,"end":6194.72,"speaker":"Fr Andrew Stephen Damick","text":"Because. Because he's seen God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6195.04,"end":6202.16,"speaker":"Fr Stephen De Young","text":"Yeah. And then Yahweh, who's apparently still there, corrects him and says, no, you're not gonna die. You're okay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6202.32,"end":6203,"speaker":"Fr Andrew Stephen Damick","text":"Don't worry."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6203,"end":6203.68,"speaker":"Fr Stephen De Young","text":"Don't panic."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6203.68,"end":6205.28,"speaker":"Fr Andrew Stephen Damick","text":"Do not fear. You shall not die."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6205.52,"end":6211.76,"speaker":"Fr Stephen De Young","text":"Yeah. Now go destroy the local shrine to baal. But we won't continue the rest of that story until another time."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6212,"end":6213.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Perhaps another day."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6213.44,"end":6237.47,"speaker":"Fr Stephen De Young","text":"Yeah. But so you see there, right. That once again, there's this interchange as there was at the burning bush, as we've seen in some of these other instances between the angel of Yahweh, who by virtue of being referred to as the angel of Yahweh, the Yahweh angel is distinguished from Yahweh, but also is identified with Yahweh."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6237.87,"end":6241.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, God. And then God. Also God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6241.79,"end":6280.23,"speaker":"Fr Stephen De Young","text":"But there's only one God. Yeah, right, right, That's. Yeah. And so now we're gonna. We're gonna go into lightning round. Yeah, hopefully that fast. But it's still us. But we're just gonna sort of COVID briefly the other. The other appearances and references to the angel of Yahweh in the Old Testament. The first one actually, as you're going through the Old Testament is actually in Genesis 16. The first person who encounters the angel of Yahweh in scripture is actually Hagar."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6282.15,"end":6287.15,"speaker":"Fr Andrew Stephen Damick","text":"The handmaid of Sarah, Abraham's wife, who is, you know, pregnant by this point."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6287.15,"end":6300.1,"speaker":"Fr Stephen De Young","text":"With Abraham's son and has been cast out because she was jealous. This is that Hagar, not the one from Final Fight who became the mayor of town, but not Hagar the Horrible. No."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6300.1,"end":6300.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6301.5,"end":6331.27,"speaker":"Fr Stephen De Young","text":"So she's cast out by Sarah and abused, and the angel of Yahweh comes to her to strengthen her and care for her, show her mercy and tell her that her son also is going to be the father of a mighty nation and is going to be like a wild donkey, which is not recommended if someone, you know, has a baby. Right. Going. They would say, may your son be like a wild donkey in the desert. Probably won't be taken as a blessing. But in this case it was."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6333.35,"end":6359.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, okay, so the next one then is. And we talked about, you know, this scene a lot in our Abraham episode, but this is the. The sacrifice of Isaac where you get the. The angel Lord speaks from heaven. This is in Genesis 22, twice in verses 11 and 15. And it says, again, the angel of the Lord spoke to him. You know, Stop."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6359.88,"end":6371.48,"speaker":"Fr Stephen De Young","text":"Right, right, right. And this is not a case where there was a difference of opinion. Right. Like Yahweh wanted him to sacrifice Isaac and the angel of Yahweh didn't."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6372.12,"end":6373.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6375.57,"end":6382.57,"speaker":"Fr Stephen De Young","text":"They are on the same page. Right. So the angel of Yahweh is here carrying out what Yahweh's intent was. Right. Because."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6382.57,"end":6382.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6382.89,"end":6415.47,"speaker":"Fr Stephen De Young","text":"One will, one activity. Right. So then we Already alluded to this one. Numbers 22. This is Balaam and. And his donkey. And there, here is where one of the places where the angel of Yahweh appears with a drawn sword standing between Balaam, who's coming to curse Israel and Israel, much the way the angel stood between the Egyptians. Right. And Israel."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6415.55,"end":6419.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what's fun about this is that the scripture says it's the donkey that sees him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6420.43,"end":6435.93,"speaker":"Fr Stephen De Young","text":"Right. The donkey sees him and wants to turn back and Balaam is sort of beating the donkey trying to get it. The stupid donkey. Right. Balaam is actually mentioned in extra biblical inscriptions. He was sort of a Canaanite folk hero. Balaam son of Beor."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6436.49,"end":6437.13,"speaker":"Fr Andrew Stephen Damick","text":"Big deal."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6437.37,"end":6442.89,"speaker":"Fr Stephen De Young","text":"Who was. He was this great prophet, slash wizard, sage type."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6444.01,"end":6449.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the scripture gives the vision of the uncreated God to the donkey and not to Balaam."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6449.89,"end":6483.22,"speaker":"Fr Stephen De Young","text":"Right, right. So the idea is that the donkey, you know, insert your other word for donkey here, has more wisdom and spiritual insight than the great prophet Balaam. Right. And then that leads to Balaam getting sent back by the angel when he finally sees him to the king who hired him. And then Balaam does the thing where he tries to curse Israel and ends up keep blessing Israel. And there's this whole sort of sitcom moment with the king say, stop blessing them. Yeah, I paid you to curse them."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6483.22,"end":6486.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. Sorry, I'm trying."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6487.06,"end":6523.12,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, I'm giving her all she's got anyway. And just because people again, love to hear me talk about this. In Judges 13, before the birth of Samson, the angel of Yahweh shows up to announce Samson's impending birth and to try to explain things to Samson's father. And in their whole interchange between he and Samson's father, you really get clued into how far gone Israel is at this point and how little understanding they have of the Torah and of the things of God."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6523.28,"end":6527.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, It's a weird, weird exchange where."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6529.28,"end":6535.28,"speaker":"Fr Stephen De Young","text":"Samson's father in particular keeps wanting to worship the angel of Yahweh in addition to Yahweh."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6535.84,"end":6538.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He thinks it's some other God in front of him."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6538.97,"end":6551.61,"speaker":"Fr Stephen De Young","text":"Yeah. And so the angel of Yahweh keeps saying, yahweh is going to do this. And he says, okay, but what's your name? So we could worship you also and sacrifice to you also. It's like, you're not getting this, right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6552.33,"end":6552.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6553.29,"end":6568.9,"speaker":"Fr Stephen De Young","text":"But this is the place where finally the angel of Yahweh says, why do you ask my name for it is wonderful. Same word, payoff from the first."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6570.34,"end":6570.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6571.62,"end":6606.66,"speaker":"Fr Stephen De Young","text":"So. But yeah, so there's this whole interchange, and they clearly. And it's over and over, and clearly Samson's father doesn't get it. You know, ends up naming him after Shemesh, the pagan sun God. Right. That shows you that he never really gets it, but he does. He does appear there. And this. So this is the. The second time after Genesis 16 with Hagar, where the angel of Yahweh appears to announce an impending significant birth, which is interesting in and of itself."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6607.14,"end":6616.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So then there's another one where the lesson, the takeaway is, don't take a census when you're not supposed to."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6618.26,"end":6621.62,"speaker":"Fr Stephen De Young","text":"That shouldn't actually be your takeaway. Oh, okay."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6621.62,"end":6622.02,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6622.65,"end":6625.21,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6625.21,"end":6626.33,"speaker":"Fr Andrew Stephen Damick","text":"God sends a plague."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6627.37,"end":6630.97,"speaker":"Fr Stephen De Young","text":"That's sort of like the meaning of Genesis 3 is don't eat fruit."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6633.77,"end":6687.26,"speaker":"Fr Andrew Stephen Damick","text":"This is the part where I mentioned that the English word apple was once a generic term that meant fruit, by the way. So it was an apple, just not necessarily a modern apple. Yeah, okay. So, yeah, there's two parallel accounts. 2nd Samuel 24:16, 1 Chronicles 21:16. I'll read the 2nd Samuel 1. And when the angel stretched out his hand toward Jerusalem to destroy it, the Lord relented from the calamity and said to the angel who was working destruction among the people, it is enough now stay your hand. And the angel of the Lord was by the threshing floor of Araunah, the Jebusite. And it's a similar kind of thing in 1st Chronicles 21:16, but it's David in this case, seeing the angel of the Lord and has the drawn sword in his hand and so forth."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6687.74,"end":6693.26,"speaker":"Fr Stephen De Young","text":"Right. And the point of the thing with the census was that it was for taxation and military recruitment."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6693.82,"end":6694.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6694.62,"end":6740.77,"speaker":"Fr Stephen De Young","text":"Right. And money and power. And it represented a lack of trust in God. Right. To. To go forth and fight the battles. Right. Because it's like, no, I need more troops and I need more money. Right. Yeah. Relying on his own devices. So then the angel of Yahweh appears and interacts with Elijah at a couple of points in First Kings or Third Kingdoms 19 and Second Kings or Fourth Kingdoms 1. And what's interesting about those places is he comes and speaks with Elijah. And it's sort of paralleled in those same passages by the word of Yahweh coming to Elijah. Foreshadowing."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6741.33,"end":6744.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that'll be our. That'll be in our next episode."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6744.25,"end":6761.82,"speaker":"Fr Stephen De Young","text":"Everyone, by the way, coming to. Coming to Elijah and communicating with him. And then there is good old second kings 19, verse 35 and Isaiah 37, verse 36."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6762.62,"end":6766.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where you get 185,000 dead Assyrians."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6766.38,"end":6774.62,"speaker":"Fr Stephen De Young","text":"Yes, yes. Which is a good start. No, anyway, the Assyrians were particularly wicked and bloodthirsty."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6774.62,"end":6786.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, I mean, the context is that they've laid siege to Jerusalem to come, you know, carry people off after destroying the Northern Kingdom."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6786.94,"end":6816.2,"speaker":"Fr Stephen De Young","text":"Right, right, right, yeah. The 10 tribes. And now they're, they're after Jerusalem. And so there's this episode where they're camped around Jerusalem, they're laying siege to it. They stop up the water, as one does. They stop all the food being brought in. Siege. Right. To make them, make them surrender, after which they're going to do very, very horrible things to all of them that we won't describe here because I made a promise that this wouldn't be like last time. Anyway."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6816.76,"end":6817.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6818.12,"end":6830.68,"speaker":"Fr Stephen De Young","text":"So, yeah. And so sort of overnight, the angel of Yahweh goes through the camp and slaughters the Assyrian army. So when they wake up in the morning, everybody's dead."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6830.92,"end":6840.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, that's what it says. It says that night the angel Lord went out and struck down 185,000 in the camp of the Assyrians. When people rose early in the morning, behold, these were all dead bodies."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6841.4,"end":6882.09,"speaker":"Fr Stephen De Young","text":"Yeah. So now in the historical record, right, this actually, there's actually mention of this in the historical records, I should say. So this isn't, you know, this isn't one that the local atheist usually goes after because there actually is some back up on this one that something happened. Right. Now they're going to come up with a very naturalistic explanation of it. Right, yeah, we're going to talk about what that is here in a second. But because the Assyrian records themselves, right, say that they went, they laid siege to Jerusalem and then they left."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6882.33,"end":6882.97,"speaker":"Fr Andrew Stephen Damick","text":"They left."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6883.77,"end":6893.86,"speaker":"Fr Stephen De Young","text":"Right, right. Which Assyrians don't normally do that. Right. Like, they don't start laying siege to a city and they'd just be like, nah, I'm not feeling it."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6895.22,"end":6909.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. And you know, of course, in their own records, they're not going to say, we suffered this humiliating defeat and so we had to leave. No, yeah, that's not what you write into the history books."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6909.18,"end":6910.66,"speaker":"Fr Stephen De Young","text":"We returned home victorious."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6910.74,"end":6912.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Glorifying your people."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6912.9,"end":6926.02,"speaker":"Fr Stephen De Young","text":"Right, right, yeah, yeah. There are the Egyptians. The ancient Egyptians were especially bad at this. There are battles where they lost huge numbers of troops and massive amounts of territory and returned home victorious, according to their own records."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6926.58,"end":6926.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6927.22,"end":6932.26,"speaker":"Fr Stephen De Young","text":"So it's not too different from our own day. Yeah, yeah, we won."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6932.26,"end":6933.22,"speaker":"Fr Andrew Stephen Damick","text":"We Totally won."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6933.62,"end":6935.34,"speaker":"Fr Stephen De Young","text":"At worst, it was a tie. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6935.34,"end":6935.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6937.54,"end":6972.63,"speaker":"Fr Stephen De Young","text":"So. Yeah. And so in terms of other records, so Josephus talks about this. Josephus has come up a couple times tonight, and Josephus says he's referring to Egyptian chronicles that he has access to because the big rivals of the Assyrians during that period were the Egyptians. The Egyptians were the other superpower during that period. And so the Egyptian chronicle, according to Josephus, indicates that rats entered the camp. And the rats, Josephus says, ate their bowstrings."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6974.7,"end":6978.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they got up a weird detail, but there you go."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":6979.1,"end":7016.35,"speaker":"Fr Stephen De Young","text":"Yeah. Now, we've been dealing with church mice lately, and they will eat through stuff. Right. But that would be kind of bizarre if they just all woke up. They're like, oh, man, no bowstrings. Well, I guess we got to forget the siege didn't bring any other weapons. Right. Yeah, but. But what modern historians basically do with this is they say, well, wait a second, let's think about this. Right? They blocked up the water sources. They blocked up. That's in and out, Right. So they're basically blocking up the sewers. They're blocking up the sources of fresh water. Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7016.35,"end":7018.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's what you do when you lay siege."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7018.91,"end":7086.71,"speaker":"Fr Stephen De Young","text":"Right. So what lives in the caves and tunnels and sewers under a city? Rats. Right. So if you stop them up, the rats aren't going to have food either. They're going to come swarming out, right. Through. Through holes. And rats carry the plague. Technically, fleas on rats carry the plague, but. Right. Rats bring disease. Right. And so the generally accepted sort of secular explanation of this is that the Assyrians had to break the siege because there was a plague outbreak in the camp. Right. Now, this is not necessarily opposed to what the text says. Right. Because when we talked about Second Samuel and we talked about First Chronicles, where the angel of the Lord appeared with the drawn sword, that was in the context of a plague striking Israel. So this could be referring to a plague, but just saying that that plague was not like an accident. It was not a sort of natural occurrence. Right. Because there were plenty of sieges that got laid and there were no plague outbreaks."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7086.71,"end":7087.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7087.83,"end":7100.55,"speaker":"Fr Stephen De Young","text":"But that this was. That this plague outbreak was the result of the angel of Yahweh coming to protect the people of God because they repented and aligned themselves with God's will."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7100.88,"end":7104.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The ancient sources are not incompatible with each other."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7105.28,"end":7105.68,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7105.92,"end":7106.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7106.64,"end":7106.96,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7106.96,"end":7107.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7107.84,"end":7133.32,"speaker":"Fr Stephen De Young","text":"And so then finally, as the big tease for our next episode, the. Well, there is briefly, if you look at Psalm 34, 7 and 35, 5 and 6. Or 33 and 34, if you're in the Greek numbering. The angel of Yahweh is referred there as camping about and protecting the righteous. Right. Defending the righteous as a sort of military figure."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7133.48,"end":7134.04,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7135.64,"end":7175.02,"speaker":"Fr Stephen De Young","text":"And then finally, here's the segue, right? Zechariah, chapter one. The prophet Zechariah has this discussion with someone. And so the question is, who is this person? Because in verse seven, this person is referred to as the word of yahweh. In verse 9, it's referred to as an angel. In verse 10, it's referred to as a man. And in verse 11, the same figure is referred to as the angel of Yahweh, the angel of the Lord. And that's setting up our next few episodes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7175.18,"end":7184.14,"speaker":"Fr Andrew Stephen Damick","text":"Indeed, indeed. So, wow, we're going to do an episode that might be just a hair over two hours. Can you believe it?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7184.3,"end":7185.5,"speaker":"Fr Stephen De Young","text":"Oh, I'm going to ramble."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7185.82,"end":7541.97,"speaker":"Fr Andrew Stephen Damick","text":"No, that's good. Great. We can make up for the time. Right? So, okay, well, to try to wrap this up, you know, again, this is a series, so we're not going to try to draw all possible conclusions. But one of the things that I wanted to especially focus on, if you look at the angel of the Lord as depicted in scripture, he's often shown as being the one who is leading the armies of God and is protecting the people of Israel, sometimes punishing the people of Israel, defeating God's enemies, which is really good, especially when Israel is on board with him and is obeying him. You see the angel of the Lord, as we just heard about, you know, from the Assyrian siege, being the one that's described as responsible for killing a lot of people, right? You know, doing battle, right? This is. This is the angel of the Lord. This is the Son of God with a drawn sword. That's not the only thing, as we've heard, that the angel of the Lord is associated with, but it's a major, major element of the way he's shown in scripture. And I think a lot of times when people see this and we say, okay, this is Jesus, right? You hear there from Jude, where he said that Jesus saved the people of Israel from Egypt as they were about to cross the Red Sea, right? And if you read in Exodus 15, that's described as God defeating those enemies, that God has done this. And so, you know, not to allude too much to your book, Father, God is a man of war. But I mean, that's exactly where that phrase comes from. And that describes in many Ways, the angel of the Lord. Not the only way. Again, not the only way. But when people see this, if they're not used to looking at the whole of Scripture and understanding that this is who this is, and then they're told, okay, this is Jesus, that can seem like a contradiction because, you know, at what point in the Gospels does Jesus ever pick up a sword, right? You know, like, well, no, Jesus is nonviolent, you know, this sort of thing. And it can seem like this can't possibly be the same figure. But one of the things that I think it's really important to focus on is that for these many centuries that precede the Gospels, the angel, the Lord is shown to be not a violent figure in the sense of, like, being aggressive and wanting just to be the destroyer or whatever, but the one who bring. Who is bringing God's justice, the one who's. Who's making things right, right? And so if we understand that that's who he is, and then he comes, and he comes humbly, very humbly. He does not come as the son of a king, some earthly ruler. He does not come with a whole bunch of. With an army behind him. He comes humbly and offers himself. That's actually not a contradiction. Instead, what you're getting is something much more powerful. You're seeing that the one who, as he says he could command legions of angels, he says, don't, you know, I could do this? I mean, he's making a reference to himself as the commander of the hosts of the Lord, right? When he's being betrayed and arrested and so forth, it says, don't, you know, I could call down legions of angels? Because that's who he is, right? That. That one who can call down legions of angels and who has done that kind of thing before they know it. That's the one who offers himself. That's the one who enters into a kind of special ops mission, so to speak, right? Where you get what's called the messianic secret, that it's tricking the devil into the dark powers and to not realizing what his mission is and utterly destroying and defeating them. As St. John Chrysostom says in his great homily, hell took a body and met God, right? It was a, you know, like I said, special ops or however you want to think of it. But the point is that it's kept secret from the dark powers. They don't understand what's going on. And that's because of. He came in humility, right? And he defeats his enemies ultimately that way. And then continuing on, then the Christ who is preached by the apostles, and the Christ whom we see especially in the Apocalypse is again the Christ on his throne. The Christ who is the commander of the Lord's army is the Christ who is establishing justice. If we understand that this is that Christ all the way through, then that makes the Jesus whom we see in the Gospels, it's much clearer than what his suffering is about and what his sacrifice of himself is about. It's not a contradiction. These aren't two different figures. This is the same one figure, right? And so he offers himself, God in the flesh, offers himself as a ransom to death, as a sacrifice, as purification for the whole world. And only the one who is the angel of the Lord can do that. Only the one who is able to establish justice in the way that he does and can do that. And so, to me, looking at this is not dismaying at all. It makes what we see in the Gospels just so rich with meaning. When you understand that. That this is that Jesus."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7542.21,"end":7542.57,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7542.57,"end":7572.2,"speaker":"Fr Andrew Stephen Damick","text":"And we're going to see more about. We're going to see more of this over the next few episodes. But when you understand, like, what St. John says and the first, you know, the first chapter of his Gospel, when he identifies this figure whom they've always known and says this is Jesus, that's. That's big. That's really big. And that's what's going on in the Gospels. That's one of the things going on in the Gospels. And so this is just very, very powerful material for me, and I hope it has been for everyone listening tonight as well. Father Stephen?"}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7574.44,"end":7606.77,"speaker":"Fr Stephen De Young","text":"Yeah, so, yeah, as you mentioned, this is, this is the beginning of a series, and I think we've already seen, even in this beginning, right, that when it comes to the Old Testament, it's not just angels on the sidelines, puzzled and confused, but that Christ himself is actively involved and we're going to see Him. A lot of times when people talk about Christ in the Old Testament, you know, they think what you're going to do is you're going to say, every time there's a stick, oh, see, that represents the cross."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7607,"end":7607.28,"speaker":"Fr Andrew Stephen Damick","text":"Cross."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":7607.28,"end":8059.34,"speaker":"Fr Stephen De Young","text":"And, you know, every time somebody, somebody is raised from the dead, oh, that's the resurrection of Christ. But that's not what we're talking about. We're talking about Christ himself, active in the Old Testament. And I think the place where what we talked about tonight really rubs against where we are and how we think as modern people has to do with the very fact that this Is Christ in, in the Old Testament, this is Christ active, quote, unquote, before, before the Incarnation entered into our human experience, right? Because it shows us that there's a reality that is far beyond the, the day to day life that we experience. And individualism, modern individualism is very attractive to our ego, it's very attractive to our pride. Because what it does is it says whatever I'm dealing with today, whatever struggle I'm going through, whether Pam go through, whatever victory I'm experiencing, whatever success I have, that is the most important thing in the universe. This is what is really happening and this is what's really important. And so approaching things from that direction of individualism can be very attractive. And it's not just our individual self and our sort of pure selfishness, but we've even in our modern world whittled down families from the huge extended families and households that existed for most of human history to little nuclear families, families, if that, and even that now is starting to break apart into collections of individuals. And we see societies and communities as collections of individuals. Even church parishes, right? Individuals come, they experience the services and then they leave, right? As individuals that go home having received, they hope, what they were looking for when they came. But if we look at it from the other perspective, from the perspective that's required by what we've been talking about tonight, that there is an eternal reality that is being worked out that we're beginning to experience now, that's beginning to enter into our experience now, but that is the most real, right? Then that takes all of these things we experience on a day to day basis, both good and bad, and relativizes them. That takes a hit to our ego. My anxiety is not the most important thing in the universe. My success at something is not the most important thing in the universe. Christ is the center of what's going on in the universe at all times. But what this means positively beyond just, hey, don't worry, be happy, right? Is that, for example, when we think about St. Gregory the Theologian. If you read a lot of St. Gregory the Theologian, you'll find that he spends a lot of time talking about his irritable bowel syndrome, at least that's what we call it today. That may shock some people, but it's absolutely true. Read his letters. He wrote prayers to God that he said when he was experiencing this pain and distress and suffering. It's very human. That's not how we usually think about St. Gregory the Theologian. This, the, the hymnography, as far as I know, someone can correct Me, but I'm pretty sure the hymnography is his feast, and the Feast of the Three Holy Hierarchs does not mention his health problems at all. The St. Gregory who appears to us in, in the services, who we come to know through the services and through reading his writings preserved in the Church, is sort of a different St. Gregory than that, right? And it's not that. That's not the real St. Gregory. We've been taught by our 19th century German friends to think, well, the person who, if I got in a Tardis and went back to the 4th century and met Gregory, if I met that person, that person with the suffering and the bathroom problems and all that stuff, that's the real Gregory. And this other thing is this artifice of the church, this invented thing, this legendary thing that doesn't have reality to it, and that's getting it exactly backwards. The real St. Gregory is the St. Gregory in the church. The real St. Gregory is that St. Gregory who we come to know, because that's who St. Gregory is in eternity. That's who St. Gregory is at the end of his journey. That's who St. Gregory became, the Holy One, who he became. And the same is true, at least in potency, for each of us, right? The experiences we have, the struggles we go through, the victories, the failures, everything we go through in this life is the reality of who we are in Christ, entering into our experience gradually. Because we're human and we're finite and we're flawed, and that's how we have to process it a second and a bit and a piece at a time to try to grow and change into the likeness of Christ. And so that means that who I am in Christ is the ultimate reality of myself, not how messed up I may feel about myself, not how horrible I may feel about myself, not whatever the little voice in the back of my head is telling me is true about myself. Because that little voice isn't me, as we talked about in a previous episode, right? None of that is who I am. Who I am in Christ is something that stands out before me and that I'm working toward and coming to experience bit by bit and piece by piece, and hoping to eventually become fully in the age to come. And I think if we approach not just our own lives that way, but when we approach others in our community, in our family, in our parishes, not as who they may be right now, when I encounter them with all their flaws and all their difficulties and all their good qualities, right? But as the person who they are in Christ, the person, who they're coming to be, and understand that we can have the joy of experiencing that with them, then that will transform everything for us, for our communities, for the life of those communities. Because it's not just us, it's our families who could become what our family was created to be. It's our parishes can become what our parishes were created to be in Christ. Our communities all the way up right to the whole inhabited world can become in Christ what they were created to be. And I think to do that, we have to keep our eyes not on the day to day, struggle the moment to moment, pluses and minuses, rejoicing in the momentary victories and mourning the momentary failures, but keeping our eyes focused on eternity and on Christ who dwells there."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8060.95,"end":8083.83,"speaker":"Fr Andrew Stephen Damick","text":"Amen. It's a good word. Well, that is our show for tonight. Thank you very much everyone for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We do read everything, but we can't respond to everything and we do save some of what you send for possible use in future episodes."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8084.47,"end":8090,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8090.32,"end":8099.92,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook like our page, join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8100.4,"end":8108.48,"speaker":"Fr Stephen De Young","text":"Really, you should get off social media and Instead go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8109.2,"end":8112.49,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. Good night and God bless you all."}
{"episode_id":"LOS - #031 - 2021-11-11 - The Angel of the Lord","start":8132.65,"end":8169.87,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian prayers Priests Father Andrew Stephen Damick and Father Stephen DeYoung a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
