{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1.2,"end":65.84,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":67.52,"end":177.85,"speaker":"Fr Andrew Stephen Damick","text":"Good evening everyone. Welcome back to the Lord of Spirits podcast. It is Monster Month. My co Host, Father Steven DeYoung is with me from Lafayette, Louisiana on his Hot new fiber optic connection. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you are listening to us live, you can call in just like the voice of Steve said at 855-AF-RADIO. That's 855-237-2346. Matus Katrudi will be taking your calls tonight, which we will get to in the second part of our show. So on the Western Christian calendar, All Hallows Eve is approaching. And if you listened to our Halloween special from last year, you know that the Christian rituals traditionally associated with this liturgical celebration are about mocking demons and participating in the destruction of pagan worship of them. As such, people do tend to think about demons and other monsters around this time of year. And since that is part of what we address on this podcast, we're going to talk take a walk this evening through a variety of monsters that you find in the Bible and in adjacent traditions. Vampires, werewolves, Lamia, Lilith, and yes, unicorns. Yes. Sorry kids, unicorns are monsters. But before we begin, just a note for parents. While we're not going to get graphic or gruesome, some of the stuff from history and the scriptures that we're going to be looking at in this episode is pretty horrifying if you contemplate it. So we recommend that you listen to this one before you let younger kids listen with you. And I see that as a parent of younger kids myself. So in the first part of this episode, we're going to be talking about Straight up demons in the classic sense. And the first one is Lilith, which is not just the name of Fraser Crane's wife on Cheers. So, Father Stephen, who or what is Lilith?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":178.41,"end":182.17,"speaker":"Fr Stephen De Young","text":"It's a fair you go to to hear Sarah McLachlachlan and Fiona Ackley."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":182.73,"end":190.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, that takes me back to my stagehand days. I worked at Lilith fair back in 1997 for stop in Raleigh, North Carolina."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":190.76,"end":194.92,"speaker":"Fr Stephen De Young","text":"Did you have in scare quotes, delicious vegan treats?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":197.96,"end":200.92,"speaker":"Fr Andrew Stephen Damick","text":"I don't think so. Okay, probably not."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":201.8,"end":252.88,"speaker":"Fr Stephen De Young","text":"So, yeah, as you mentioned, we try to make this a family friendly show, although the priests of BAAL do not cooperate in that regard at all. But yeah, tonight some of this stuff is kind of scary. So be advised and send all your complaint emails to someone other than us because we warned you. So, so we're going to be talking about the actual Lilith after whom the fair was named. After we're done talking about it, you'll definitely wonder how that works, but. So this, this figure of Lilith that we're going to be talking about has been around pretty much as long as we have written literature."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":253.44,"end":256.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, she's one of the oldest scary things ever."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":257.76,"end":378.61,"speaker":"Fr Stephen De Young","text":"Yeah. So we're gonna be in a minute here when we talk about her sort of first literary appearance. It's gonna be sort of one of the first written things we have. But the name Lilith is sort of the normal Anglicized version of the name that you typically see, and that is sort of a transliteration of what is in Hebrew lilit, in Akkadian, lilitu, in Sumerian lil. And sometimes you will see folks who want to connect the name, especially in Hebrew lilit, to the Hebrew word lilah or layla, which means night. Like at the end of the day, night falls, night, not like on horses. So that is not related. So as we just sort of laid out, this is a proper name that comes out of Sumerian mostly intact. Right. At least the central syllable. Now this, this is a demon who does stuff at night after dark. Yeah, demons are want to do. That's when they tend to do things. But. And so you'll sometimes see things related to evening and night surrounding descriptions of Lilith, but they're not directly. And the reason I bring this up at all is that sometimes even in translations, there's sort of, as we've noted many times on this show, a sort of materialist bias in translations where they. Anything that they could interpret as not being the name of a demon, they interpret as not being the name of a demon. Right. They try to translate it Some other way."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":379.01,"end":387.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we're going to look at some of the fun stuff in that regard, especially looking at biblical translations, actually. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":387.26,"end":416.02,"speaker":"Fr Stephen De Young","text":"And so they'll do that with Lilith, too. They'll try and translate it as night or evening or, you know, darkness or something, rather than seeing it as a proper name. But this is a proper name going all the way back to its initial appearances. And the first of those appearances is in a poem, an epic poem called Gilgamesh, Enkidu and the Netherworld, which should."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":416.02,"end":432.38,"speaker":"Fr Andrew Stephen Damick","text":"Not be confused with the Epic of Gilgamesh, because it turns out that there's actually a number of Gilgamesh stories that are extant. And, I mean, but these are like hundreds and hundreds of years apart. Right, Compared to Epic of Gilgamesh. Yeah. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":432.38,"end":467.91,"speaker":"Fr Stephen De Young","text":"The Epic of Gilgamesh as we now know it today is the Akkadian version of that epic, which was written sometime. Took the form we have it in now, sometime between 1500 and 1000 BC. Whereas the poem we're about to talk about, Gilgamesh, Enkidu in the Netherworld, was written during our old friend the ur3 period, sort of ur3 Tokyo drift. But this is. So this is. If you want a biblical marker. So the poem we're about to talk about was written during Abra time."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":468.71,"end":469.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":469.35,"end":474.87,"speaker":"Fr Stephen De Young","text":"And the Epic of Gilgamesh, as we have it today, was written more like in Moses and Joshua's time."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":475.51,"end":480.07,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, is this. You know, these are on, like, clay tablets with cuneiform."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":480.15,"end":530.95,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. So the Gilgamesh and Kidu in the netherworld, this poem we're talking about is in Sumerian. So we have these. There are actually five sort of epic poems about Gilgamesh that we have in Sumerian from this period. And because journal articles and dissertations have to be written, you can find a lively literature about whether these five things are five separate traditions or whether the five of them together constitute an early Gilgamesh epic and all kinds of things like that. But for our purposes, we just want to talk about this one, which is Gilgamesh, Enkidu in the Netherworld. And if you're familiar with the Epic of Gilgamesh, you know that. Spoilers. Enkidu dies."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":532.71,"end":538.71,"speaker":"Fr Andrew Stephen Damick","text":"Hey, man, I mean. Yeah, don't give spoilers. That poem's only been around for 3,500 years."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":539.03,"end":574.44,"speaker":"Fr Stephen De Young","text":"And right after that, Snape kills Dumbledore. Anyway. Oh. So I told you it's gonna be scary for kids. Yeah. So. So Enkidu dies. And so this poem, this particular Poem is not so much focused on Enkidu's death, but focused on Enkidu dies. And then so Gilgamesh sort of makes the rounds to several of the. The gods, the Sumerian gods, to try to get them to help him out, to get his friend back out of the netherworld."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":575,"end":575.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":575.64,"end":602.32,"speaker":"Fr Stephen De Young","text":"So his. His bestest buddy has died and he wants him back, and in order to try to sort of persuade them to help him, he gets sent on these sort of side quests to go and do this or that, to try to help or impress the God in question, in order to try to convince that God or goddess to help him out with the whole underworld thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":602.48,"end":633.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, in some ways this trope is sort of echoed in, like, the Greek myth of Orpheus and Eurydice, where Orpheus goes down to get his wife out of the underworld. I mean, you see this kind of story in a lot of mythology, the idea of, you know, rescuing someone from the underworld. And often there are, like, things that you have to do in order to make this possible. So. Yeah, it's really common in mythology. I like the fact you call them side quests. I mean. Yeah, yeah, it's true. I mean, it really is true."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":633.81,"end":649.11,"speaker":"Fr Stephen De Young","text":"Yeah. So the particular. Yeah, the particular side quest that Inanna, who's also known as Ishtar, who's a goddess, sends Gilgamesh to go do is she needs some help with her hulupu tree."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":650.63,"end":652.39,"speaker":"Fr Andrew Stephen Damick","text":"And what is a hulupu tree?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":652.79,"end":657.35,"speaker":"Fr Stephen De Young","text":"Well, it's this particular tree. It's not like a species of tree, it's a particular tree."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":657.35,"end":658.55,"speaker":"Fr Andrew Stephen Damick","text":"The hulupu tree."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":658.55,"end":677.36,"speaker":"Fr Stephen De Young","text":"The hulupu tree, yeah. And so this is a tree that Inanna had planted and she had intended, once this sort of magical tree grew to sort of full size, that she was going to use the wood from it to make herself a throne and a bed."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":679.6,"end":682.16,"speaker":"Fr Andrew Stephen Damick","text":"Which basically says she's building a temple."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":682.48,"end":683.32,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":683.32,"end":691.84,"speaker":"Fr Andrew Stephen Damick","text":"So these are the temples have, you know, for sacrifices, that's what you got the throne there for. And for Nephilim making, that's what the bed's there for."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":691.84,"end":726.44,"speaker":"Fr Stephen De Young","text":"Yeah, right, right, right. And so this is her plan. And so she's cultivated this special tree to do that, and she's got a bunch of squatters who have taken up residence in said tree, and that is Anzu, who's sort of a giant bird creature who's living up in the branches of the tree, and then there's a serpent living in the roots of the tree down underneath, who's burrowed in there. And there is a demon named Kisikililu. Say that five times fast."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":726.44,"end":726.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":729.28,"end":763.74,"speaker":"Fr Stephen De Young","text":"Yeah, and I said it kind of fast. But the, the, the central syllable of that. And remember cuneiform, Sumerian and everything else that's written in cuneiform. Cuneiform is a syllabic Alphabet. Right. So each character is a syllable. So the third of the four syllables in Kisihileelu is Lil. So this is our first appearance of Lilith. She is this demon who is living in the trunk of the tree."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":765.34,"end":765.9,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":766.46,"end":808.93,"speaker":"Fr Stephen De Young","text":"And so because there's these demons and monsters and creatures and stuff living in and around the tree, and Nana can't go use it, so she sends Gilgamesh to go take care of her problem so she can use her tree. And Gilgamesh goes and he gets in a fight with. And he kills the serpent that's in the roots. And when they see that he killed the serpent, Lil and Anzu take off. They sort of say, cheese it, we're out of here, and they take off. So they don't get killed by Gilgamesh also. And so when he goes and turns in the side quest, Inanna still doesn't help him with the Enkidu problem."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":810.85,"end":875.2,"speaker":"Fr Andrew Stephen Damick","text":"She sort of tricks him into taking care of her issue, which is interesting because it kind of illustrates, it does illustrate that in, in pagan mythology that there are monsters that even the gods can't. Can't handle. Because. And I mean, I think this is. I mean, this is sort of a side point, but it's a really important point, I think, for us to underline every so often, which is that no God in any ancient pagan mythology even makes the claim to be all powerful like that, you know, that they can command anything and it has to obey. Like that is something that only the God of Israel actually even says about himself. The rest, it's sort of a world of stronger and weaker, you know, creatures that are kind of competing with each other in many cases for dominance. So even though you've got this goddess, Inanna, Ishtar, there's demons in her tree and she can't do anything about that. She needs to bring in Gilgamesh, who, by the way, is a giant. Right. To deal with it. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":875.28,"end":877.44,"speaker":"Fr Stephen De Young","text":"She can't just cast them out."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":877.44,"end":877.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":877.76,"end":885.33,"speaker":"Fr Stephen De Young","text":"And this is part of what's in the background when Christ comes and starts doing exorcisms, why everybody freaks out."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":885.65,"end":887.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because no one else can do that."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":887.81,"end":890.69,"speaker":"Fr Stephen De Young","text":"Because he could just tell a demon to split and the demon splits."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":891.09,"end":891.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":894.37,"end":895.65,"speaker":"Fr Stephen De Young","text":"No battle required."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":896.05,"end":896.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":896.53,"end":908.99,"speaker":"Fr Stephen De Young","text":"So this is sort of our first appearance of this demon. In later Akkadian texts, you get sort of liliths. Like there's. This is like a category."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":909.31,"end":910.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":910.35,"end":927.63,"speaker":"Fr Stephen De Young","text":"Of sort of female demonic spirits. And so there's three of them that are named in Akkadian texts are Lilu Lilitu and Ardot or Wardat Lili. And you can see that same syllable in all of those central."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":927.95,"end":928.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":928.39,"end":987.48,"speaker":"Fr Stephen De Young","text":"That these are the same sort of, type of. Of being. And these are related to words for the southwest wind. And so that gives. There's this idea that this is. This is a demonic creature that sort of flies. You'd say, well, what else would it do? Well, like we talked about in. In Genesis 4 with sin, you know, there were Acadian demons who sort of crawled up through cracks in the ground. So some of them crawled and stuck, slithered and that kind of thing. But this is more one that flies and sort of is associated with coming into homes through windows the way the wind does. And in particular, the Liliths did two main bad demonic things. The first was they would enter the homes of men and sort of seduce them and mate with them and then kill and eat them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":988.52,"end":995.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Sort of a succubus. A cannibalistic succubus sort of thing. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":995.04,"end":998.36,"speaker":"Fr Stephen De Young","text":"Or like a praying mantis. Yeah, praying mantis or a black widow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":998.36,"end":999.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1000.84,"end":1017.41,"speaker":"Fr Stephen De Young","text":"And the other nasty demonic thing that Liliths would do is they would come and rather than breastfeeding an infant with milk, they would breastfeed an infant with poison."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1019.25,"end":1025.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, we told you. We told you guys. Yes, yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1025.89,"end":1027.89,"speaker":"Fr Stephen De Young","text":"It's not gonna get prettier from here."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1029.97,"end":1030.37,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1032.45,"end":1054.81,"speaker":"Fr Stephen De Young","text":"The way this is talked about is there's this phrase associated with one of these lilith spirits that this is a woman that a man does not lay with as he lays with his wife. And that's a way of associating what she does with non procreative sexual activity."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1055.53,"end":1067.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I mean, the whole image that you get then is this kind of. She's an anti fertility, you know, demon. Right, like, right, yeah, yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1068.16,"end":1125.16,"speaker":"Fr Stephen De Young","text":"So, yeah. And sort of in both, in both ways, both of those demonic things she does. And interestingly to us nerds, this idea of. Of the Lilith spirit sort of demon traveling around and sort of looking for men, particularly young men, to do this to. There's also this imagery is also applied in Akkadian texts to Ishtar. Right. The goddess we were just talking about is also one who goes around looking around and looking in windows, looking for young men. But she was seen as being a fertility goddess. So it sort of sets up within these Akkadian texts this idea of sort of Lilith as Ishtar's evil twin. Right. Like the other. The other sort of the other side."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1125.16,"end":1131.8,"speaker":"Fr Andrew Stephen Damick","text":"Of the coin, the mirror universe Ishtar that comes in with. With a, you know, a Van Gogh and a weird sash."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1131.8,"end":1163.09,"speaker":"Fr Stephen De Young","text":"Yeah. So. Yeah. And so this. This idea, this. This demonic spirit has a lot of staying power. So there is a similar sort of spirit in Babylonian traditions called Lamashtu. And those two get kind of assimilated to each other, Lamashtu and Lilith, which."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1163.17,"end":1174.86,"speaker":"Fr Andrew Stephen Damick","text":"That often happens as these kinds of mythologies sort of clash into each other as demons and gods and goddesses get strongly associated. And then often said that they're the sort of the same thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1175.02,"end":1179.54,"speaker":"Fr Stephen De Young","text":"Yeah. Or two hypostasis of the same thing, if you've listened to previous episodes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1179.54,"end":1179.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1181.66,"end":1191.74,"speaker":"Fr Stephen De Young","text":"So, but the imagery that comes in, the imagery that comes into Lilith through Lamashtu, that's important is that Lamashtu is said to have the ears and teeth of a donkey."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1195.79,"end":1197.47,"speaker":"Fr Andrew Stephen Damick","text":"Like, why. I mean, that just seems so."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1197.55,"end":1198.51,"speaker":"Fr Stephen De Young","text":"She seems kind of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1199.71,"end":1200.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1200.27,"end":1206.19,"speaker":"Fr Stephen De Young","text":"Are you picturing that scene in Pinocchio suddenly now?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1206.19,"end":1209.07,"speaker":"Fr Andrew Stephen Damick","text":"Wow. This ruins Pinocchio for me forever."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1209.23,"end":1222.68,"speaker":"Fr Stephen De Young","text":"Yeah. So she had the ears and. Or would be riding on a donkey. And so one of Lilith's titles comes to be the donkey rider. This is going to be important in a minute."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1223.24,"end":1223.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1223.72,"end":1224.52,"speaker":"Fr Stephen De Young","text":"Yep, yep."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1225.24,"end":1225.64,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1228.36,"end":1298.05,"speaker":"Fr Stephen De Young","text":"From there, from the Babylonian traditions, it comes over into Syrian and Aramaic traditions. And the primary place where we see Lamashtu in those is in these sort of magical texts, like some. Some of the curse bowls, incantation bowls we talked about last time and on amulets and that kind of thing, because, of course, they're trying to ward her off. Right. You don't want her around. But so being that these are pagan Syrians and Arameans, they didn't have sort of. It's not like they prayed to their main God to kind of keep them safe. Right. Because as we were just talking about with. With Gilgamesh, Enkidu in the other underworld, that these guys are kind of all at the same power level. Right. So the way that these Syrian and Aramaic magical texts generally approach trying to ward off Lamashtu is actually by invoking another demon who didn't like Lamashtu."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1298.45,"end":1298.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1299.33,"end":1321.84,"speaker":"Fr Stephen De Young","text":"So they had this idea from their stories that this other demon, Pazuzu, who was a demon of famine and drought and Lamashtu hated each other. And so they would invoke this one demon of famine and drought to try to ward off the demoness of. Of sexual infertility."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1322.96,"end":1323.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1323.84,"end":1325.28,"speaker":"Fr Stephen De Young","text":"Like, to try to get them to fight."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1326.32,"end":1347.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean. I mean, how? I don't know. It's just. It's interesting, you know, like, and you kind of wonder if the cure is worse than the disease in some ways, you know, because they're. It's both about. Both of these demons are about destroying the things that are at the very heart of community, Whether it's, you know, having children or feeding people, you know, But. But there you go, I guess."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1348.96,"end":1363.59,"speaker":"Fr Stephen De Young","text":"Right? And so. Oh, just for the record, Pazuzu, if anybody didn't immediately jump on that, this is the ancient Babylonian demon and Syrian demon that stars in the Exorcist."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1365.35,"end":1366.79,"speaker":"Fr Andrew Stephen Damick","text":"There you go, Exorcist fans."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1366.95,"end":1374.99,"speaker":"Fr Stephen De Young","text":"Yes. So there you go, all you William Peter Blatty fans. It is Halloween coming up. I mean, come on."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1374.99,"end":1381.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. I've never seen that film. I was raised basically Baptist, so I'm."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1381.28,"end":1382.56,"speaker":"Fr Stephen De Young","text":"Shocked that you watched that."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1382.56,"end":1383.28,"speaker":"Fr Andrew Stephen Damick","text":"I know. Aren't you?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1383.28,"end":1383.68,"speaker":"Fr Stephen De Young","text":"Film."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1383.76,"end":1384.92,"speaker":"Fr Andrew Stephen Damick","text":"Aren't you shocked? Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1384.92,"end":1389.12,"speaker":"Fr Stephen De Young","text":"The person for whom Dr. Who is too creepy has not seen the Exorcist."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1389.2,"end":1390.96,"speaker":"Fr Andrew Stephen Damick","text":"What? It's true."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1391.6,"end":1392,"speaker":"Fr Stephen De Young","text":"I know."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1392,"end":1395.84,"speaker":"Fr Andrew Stephen Damick","text":"I know. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1396.4,"end":1417.12,"speaker":"Fr Stephen De Young","text":"So this. Then we talked about assimilation with Lamashtu. Lilith also ends up showing up through Lamashtu in Greek stories and through Greek and even Latin stories. And there the Greek name. And the Latin name just transliterates. It is Lamia."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1417.6,"end":1426.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's. Instead of Lamashtu, you get. They kind of cut the end off and sort of give it a Greek or Latin ending. Right. Lamia. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1426.64,"end":1452.46,"speaker":"Fr Stephen De Young","text":"Because Greek actually written Greek actually grew out of linear, baby. And linear B is a phonetic language, like cuneiform languages. It has a phonetic Alphabet. So with very old words, you have that same syllabic kind of thing where you have a syllable that gets picked up with. And then based on the language development, you get different endings put after it."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1452.62,"end":1453.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1455.1,"end":1466.07,"speaker":"Fr Stephen De Young","text":"So Lamia, in the Greek stories, in the Greek traditions, is one of the many lucky ladies who Zeus set his eyes upon."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1466.71,"end":1471.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, again, showing how their most high God is super duper creepy."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1471.27,"end":1471.75,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1471.75,"end":1474.07,"speaker":"Fr Andrew Stephen Damick","text":"Super duper evil. Yeah. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1474.15,"end":1478.79,"speaker":"Fr Stephen De Young","text":"So he went and we'll politely say seduced her."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1479.35,"end":1480.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1481.91,"end":1500.14,"speaker":"Fr Stephen De Young","text":"And then after he had done this, they had some children together. And when Hera, Zeus's wife, the goddess Hera, realized that once again, Zeus was cheating on her and it had kids, decided to curse Lamia."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1501.1,"end":1511.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As she. She does that kind of. I mean, you know, if you read Greek Mythology, you know, that this is a thing that happens over and over again. Hera is always going after Zeus's paramours."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1511.66,"end":1512.14,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1512.62,"end":1519.1,"speaker":"Fr Andrew Stephen Damick","text":"Or his victims, frankly, is the way really we should put it. But yeah, yeah, yeah. Blame the woman. Thank you, Hera."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1519.42,"end":1523.9,"speaker":"Fr Stephen De Young","text":"Yeah. So toxic femininity, anyone?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1524.14,"end":1524.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1525.66,"end":1544.62,"speaker":"Fr Stephen De Young","text":"So she puts a curse on Lamia and turns her into a serpent woman, sort of waist down snake, waist up human. And forced her to eat her own children and cursed her that. So that she could never sleep."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1545.81,"end":1549.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which kind of connects to that whole sort of nighttime idea."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1549.65,"end":1566.37,"speaker":"Fr Stephen De Young","text":"Right. So she's out and around at night. In the Greek stories, Zeus decided, you know, he felt a little bad after all this happened. And so the way he decided to help Lamia out was he made it possible for her to remove her eyes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1568.13,"end":1570.93,"speaker":"Fr Andrew Stephen Damick","text":"Because that'll help her go to sleep, I'm sure. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1572.3,"end":1575.58,"speaker":"Fr Stephen De Young","text":"Gets eye strain. I don't know, but I thought all."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1575.58,"end":1577.66,"speaker":"Fr Andrew Stephen Damick","text":"Religions were the same, Father Stephen."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1577.74,"end":1600.27,"speaker":"Fr Stephen De Young","text":"And paganism is beautiful. But Lamia, due to having all of this befall her, proceeded to operate very much the same way that Lilith did and Lalostu did. And that's prowl around at night looking for young men, mating with them, killing them, eating them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1600.75,"end":1601.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1603.15,"end":1607.15,"speaker":"Fr Stephen De Young","text":"So all that is background."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1608.03,"end":1609.31,"speaker":"Fr Andrew Stephen Damick","text":"And now we get to the Bible."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1609.55,"end":1619.07,"speaker":"Fr Stephen De Young","text":"Yes, all that Ancient Near Eastern languages. Lilith makes an appearance in Isaiah 34, verse 14."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1620.03,"end":1621.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1621.31,"end":1629.29,"speaker":"Fr Stephen De Young","text":"And you collected a cavalcade of interesting English translations for the word lilit in Hebrew."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1629.61,"end":1671.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, I mean, and we could probably double this list, but this I think, gives you a sense of the scope here. Okay, so the esv, the English Standard Version, translates it as Night bird. Nightbird. The King James, which, you know is my favorite in terms of the way that it sounds, is translates it as screech owl. Screech owl. The new King James has Night Creature. Night Creature. That sounds like it should be some kind of a TV show tonight on Night Creature. And then the RSV gets us a little bit closer and has Night Hag. So that's pretty good."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1671.63,"end":1690.56,"speaker":"Fr Stephen De Young","text":"Now, wait, we have to pause before this last one. I know, I know, because this is. There's going to be a couple first and only on this episode. One of them you're going to have to wait for the third half. But one of them you're about to get where this is the only time we're going to say something positive about something ever. Yeah, Here it comes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1690.96,"end":1721.05,"speaker":"Fr Andrew Stephen Damick","text":"So there is a quote unquote Bible translation called the Message. I'm sorry, it's Just hard to not be a little bit sarcastic about that thing. It's most. I mean, just open it up, people, you'll see what I mean. But as I was doing my little survey of the way that this word gets translated in English versions, the message has it as the night Demon Lilith, which is, I think, the best of any English translation I found I could."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1721.05,"end":1725.05,"speaker":"Fr Stephen De Young","text":"Not believe was proverbial stopped clock."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1725.21,"end":1733.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, exactly. I know. And it's so fun that it's right about this, you know, how weird is that?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1733.97,"end":1739.86,"speaker":"Fr Stephen De Young","text":"But, yeah, Christology or the Trinity or that, but this they nailed."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1740.1,"end":1757.14,"speaker":"Fr Andrew Stephen Damick","text":"So hats off to you for this one word message, people, whoever exactly you are. Yeah, the night Demon Lilith. That's what the message translates it as. So, yeah, so Lilith shows up in Isaiah, chapter 34. I mean, what's she doing there, you know?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1757.7,"end":1765.43,"speaker":"Fr Stephen De Young","text":"Well, she, along with some other demonic critters, is haunting the wasteland of Edom after it's been destroyed as."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1765.43,"end":1766.31,"speaker":"Fr Andrew Stephen Damick","text":"As one does."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1766.71,"end":1800.76,"speaker":"Fr Stephen De Young","text":"So this is. This is part of an oracle against Edom, where Isaiah is pronouncing that, you know, Edom, because of wickedness, is going to be destroyed. And it's going to be so destroyed that all that's going to be left of the great cities is going to be sort of rubble with sort of demons and wild animals prowling around in the. In the ruins. So that's the idea of why she appears here. She being one of those night demons who's going to be out there lingering around in the rubble."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1800.92,"end":1809.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, she's just sort of listed. It doesn't really treat of her, she's just sort of mentioned, but she is mentioned very explicitly right there in the Hebrew."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1809.96,"end":1859.54,"speaker":"Fr Stephen De Young","text":"Right. And so when we get to the old Greek, this is going to solve what may have been for many of you. It was for me for a while, one of the great mysteries about the Orthodox study Bible and its translation of Isaiah in particular. So in the old Greek translation of Isaiah, which is sort of the first layer of Greek translations of the Old Testament, they translated this word onocentavros, which, since I just said it in modern Greek pronunciation, you may not see. But the middle part of that, if you could see it written out, is Kantaur, like centaur."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1859.54,"end":1861.42,"speaker":"Fr Andrew Stephen Damick","text":"Centaur. Yeah, yeah, exactly."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1862.06,"end":1872.83,"speaker":"Fr Stephen De Young","text":"And Onos is a donkey, so donkey centaur. And so the Orthodox study Bible faithfully translated that donkey Centaur."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1872.83,"end":1874.95,"speaker":"Fr Andrew Stephen Damick","text":"Centaur. Yeah, it's a very literal."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1875.43,"end":1901.65,"speaker":"Fr Stephen De Young","text":"Yeah. In the ruins of Edom, there would be a donkey centaur wandering around. So what, what was actually happening here was that you think about when the old Greek was translated, right? This is following the Babylonian exile and the time that Judeans spent in Persia. Lamashtu is what, the donkey rider. Yeah, right, right, right. So that was the idea they were."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1901.65,"end":1907.17,"speaker":"Fr Andrew Stephen Damick","text":"Trying to convey, but a demonic donkey rider. So it becomes a center."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1907.17,"end":1928.5,"speaker":"Fr Stephen De Young","text":"Right, the donkey rider. This is Lamashtu. Right. That's what they're trying to say. And other Jewish translators understood that that's what was going on. So Aquila, when Aquila does his recension, he translates it as Lilith, just transliterates it into Greek."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1929.7,"end":1939.22,"speaker":"Fr Andrew Stephen Damick","text":"So these later Greek translations. I mean, I say later, but it's. I don't know how much later. But are they just sort of editing the old Greek? Is that what's going on?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1941.7,"end":1968.44,"speaker":"Fr Stephen De Young","text":"Mostly. They're mostly trying to correct it. So they just transliterated Lilith because he understood it as a proper name in Hebrew. Right, yeah. And then Symmachus, who is another one of the early translator translators, translated it as Lamia. Right. He just turned it into the Greek version of the creature. Right, The Greek version of the demon Lamia."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1968.44,"end":1968.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1969.84,"end":1978.35,"speaker":"Fr Stephen De Young","text":"And so St. Jerome, when he translated the Latin, Voguet also went with Lamia."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1979.07,"end":1983.23,"speaker":"Fr Andrew Stephen Damick","text":"5Th century A.D. so some centuries after all of this."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":1983.63,"end":2004.67,"speaker":"Fr Stephen De Young","text":"Right. He went with Lamia because Latin had maintained the same name for that demon. And he. A lot of people don't necessarily know this, but in addition to doing the actual translation, St. Jerome wrote introductions to all the books of the Bible and wrote commentaries on most of them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2005.16,"end":2007.16,"speaker":"Fr Andrew Stephen Damick","text":"So basically, St. Jerome made his own study Bible."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2007.4,"end":2007.88,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2007.96,"end":2008.52,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2010.68,"end":2043.06,"speaker":"Fr Stephen De Young","text":"So when. And at this point, when he puts Lamia, he says that the Hebrews held Lamia to be one of the Erinis, the Furies. So if you know a little bit about Greek myth and stories and traditions, then the Furies are these sort of demonic beings from the underworld that come and usually tear apart and drag down to Hades people who have done sort of horrible evil deeds."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2043.3,"end":2045.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right. So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2047.86,"end":2056.66,"speaker":"Fr Stephen De Young","text":"Like, you kill your father, you know, you. You do some terrible deed, and the Furies come after you. Right, yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2056.66,"end":2081.63,"speaker":"Fr Andrew Stephen Damick","text":"You sort of see that kind of image. I suddenly thought of that movie Ghost, you know, with Patrick Swayze and Demi. Is it more. Yeah, yeah. Where, you know, really bad, like, murderers get dragged off by these dark, horrifying, screeching, demonic black. You know, black, black, black figures. It's sort of that kind of thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2082.03,"end":2090.84,"speaker":"Fr Stephen De Young","text":"Yeah, that. That idea manifests itself all the time in popular culture. That's really the origin of slasher movies."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2091.24,"end":2091.8,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2092.04,"end":2137.69,"speaker":"Fr Stephen De Young","text":"Slasher movies are really Greek tragedies. Right. Because what's going on in your classic slasher movies is that your Freddy Krueger or your Jason Voorhees or your Michael Myers or whoever, they always come after some group of, usually teenagers of people their 20s, and everyone who isn't virtuous, everyone who isn't established as being virtuous, all gets massacred. Right. They sort of wreak this horrible vengeance on everyone for their sins. And there's usually only one person who survives at the end. It's almost always a female person. And they're pretty much always sort of portrayed as virginal and pure and chaste, and that's why they survive."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2139.77,"end":2142.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so I'll take your word for it."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2142.47,"end":2142.79,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2145.03,"end":2145.75,"speaker":"Fr Andrew Stephen Damick","text":"No, I know."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2145.91,"end":2151.59,"speaker":"Fr Stephen De Young","text":"It's the same kind of idea. The narrative is serving that kind of same function that Greek tragedy used to do. Right, Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2151.59,"end":2157.03,"speaker":"Fr Andrew Stephen Damick","text":"It's all moralistic. Be good or else horrible things will do terrible things to you."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2157.19,"end":2161.59,"speaker":"Fr Stephen De Young","text":"Right. Reinforcing this whole idea of justice and telling kids not to mess around before marriage."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2162.07,"end":2162.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2162.71,"end":2174.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So. But yeah, so this is how St. Jerome understands Lamia Lilith as being that sort of demonic spirit."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2174.83,"end":2175.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2175.11,"end":2181.83,"speaker":"Fr Stephen De Young","text":"Who sort of comes and he doesn't see it as like, goes around victimizing innocent men."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2182.95,"end":2183.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2183.75,"end":2191.91,"speaker":"Fr Stephen De Young","text":"He sees it as this demon is out there and God allows this demon to sort of punish sexually immoral men."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2192.31,"end":2193.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2193.51,"end":2234.41,"speaker":"Fr Stephen De Young","text":"For their lack of chastity and faithfulness. So this isn't sort of the end, though. We just talked about St. Jerome, who's obviously 5th century Christian, but Lilith also then has this sort of afterlife in rabbinic Jewish material. So when you get into the Talmud, for example, there's a whole statement in one of the tractates of the Babylonian Talmud about how men should never sleep in their house alone because if they do, Lilith might come in the window."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2236.09,"end":2240.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is rabbinic Judaism, basically warning against succubi."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2240.41,"end":2240.89,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2241.45,"end":2241.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2242.33,"end":2255.3,"speaker":"Fr Stephen De Young","text":"This can happen to you. So never sleep alone in a house, men. And there's another tractate that says that she is the daughter of Ahriman and. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2255.3,"end":2275.54,"speaker":"Fr Andrew Stephen Damick","text":"Which is kind of a weird. I don't know, is this, Is this. Is this from like Judaism in Persia? Because like Aharaman is. Is the shadow of Ahura Mazda, who's sort of sort of the most high God in. Well, he's sort of sort of sort of. He's the goose. Yeah, yeah. It's complicated in Zoroastrianism anyway."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2275.54,"end":2292.44,"speaker":"Fr Stephen De Young","text":"Yeah. But yeah, so they were sort of connecting that. Then you get into the Stuff that gets us to the Lilith Fair. Sort of late medieval Jewish legends."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2293.24,"end":2300.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The one that everyone's probably heard of is the idea that she was Adam's first wife and then they, I guess, got a divorce and he marries Eve."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2300.84,"end":2305.45,"speaker":"Fr Stephen De Young","text":"Later where she's sort of this jilted or wronged woman, sort of like Lamia."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2306.09,"end":2306.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2306.57,"end":2317.77,"speaker":"Fr Stephen De Young","text":"And so now she's been, like, done wrong by a man and she's out for revenge. Right. Kind of idea. There are also medieval Jewish legends where she's one of Solomon's wives."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2319.21,"end":2332.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's because I'm trying to think, like, how does that work? And maybe it's just sort of the idea that Solomon married so many and of course, did a lot of frankly sinful things that he picked up some real horrifying people along the way for his harem."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2332.69,"end":2337.41,"speaker":"Fr Stephen De Young","text":"Well, no, this is. This is. She was one of his first wives. Oh, I see. Jilted thing again."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2337.49,"end":2337.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2337.93,"end":2342.89,"speaker":"Fr Stephen De Young","text":"He goes and marries all these other women and she's jealous and angry and goes Glenn Close and."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2342.89,"end":2347.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2348.61,"end":2363.15,"speaker":"Fr Stephen De Young","text":"Yeah. And. But she is sort of always associated with and worrying and warned against in terms of infertile marital sexual activity."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2364.11,"end":2364.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2364.83,"end":2370.27,"speaker":"Fr Stephen De Young","text":"Sexual activity that is not reproductive or potentially reproductive in nature."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2370.99,"end":2371.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2372.67,"end":2384.99,"speaker":"Fr Stephen De Young","text":"Is something that sort of attracts this kind of thing. But my personal favorite, as I pointed out to you earlier, comes from the medieval."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2384.99,"end":2387.41,"speaker":"Fr Andrew Stephen Damick","text":"This is the one that I actually. This is the one I kind of love."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2389.65,"end":2406.21,"speaker":"Fr Stephen De Young","text":"In the medieval Christian west, they talk about Lilith, and she's still in this same kind of vein that St. Jerome talked about her, but somewhere along the line, and we're not sure exactly where amongst her epithets she picks up the title the devil's grandmother."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2408.61,"end":2410.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm not sure how that works exactly."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2410.49,"end":2421.76,"speaker":"Fr Stephen De Young","text":"I'm not either, like, daughter or granddaughter maybe, but I don't get how you go up the chain. So, like. And who was. Who's the devil's parents then?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2421.84,"end":2455.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I don't know. Maybe it's feeding into this idea that she's this super ancient demon that even precedes the big demon. I don't know. It's. It's. But fun. Yeah. The devil's grandma. Yeah. Right. Yeah. Okay. So that's one of the monsters that we see in the Bible and then in Christian tradition, as, you know, later Christian tradition as well, and Jewish tradition. But then, you know, like I said in the introduction, unicorns are monsters, too. Sorry, everybody."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2455.68,"end":2458,"speaker":"Fr Stephen De Young","text":"Having explained the donkey centaurs."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2458.48,"end":2462.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. We come now to unicorns. Unicorns. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2463.84,"end":2470.88,"speaker":"Fr Stephen De Young","text":"And unicorns are not so much in the original of the Bible as they are in the King James Version."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2471.77,"end":2473.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, man."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2475.05,"end":2476.97,"speaker":"Fr Stephen De Young","text":"And so, yeah, you're taking a beating today."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2477.29,"end":2478.45,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. It's all right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2478.45,"end":2486.89,"speaker":"Fr Stephen De Young","text":"It's all right. And you had to say nice things about the message that's kind of stuck in your craw and bad things about the King James."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2487.77,"end":2494.09,"speaker":"Fr Andrew Stephen Damick","text":"That'll be a great for, like, you know, party anecdotes, though, you know, like, you know, the one good thing I can say about the message."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2494.25,"end":2532.25,"speaker":"Fr Stephen De Young","text":"Yeah. So, and this. I'm just going to list them real quickly. We're not going to go through each one. But the places in the King James version where they mention unicorns are Numbers 23, 22, and 24, verse 8, Deuteronomy 33, verse 17, Job 39, 9 and 10, Psalm 22, verse 21, Psalm 29, verse 6, Psalm 92, verse 10, and Isaiah 34, 7. And you may notice that 34, verse 7 is not totally far removed from where Lilith shows up."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2532.25,"end":2534.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just seven verses away. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2534.57,"end":2545.69,"speaker":"Fr Stephen De Young","text":"So there's a reason for that. But those are the places where unicorn shows up. And again, we did a brief survey of some English translations."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2546.09,"end":2590.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay. So the King James does translate this word, whatever it is, which we're about to tell you as unicorn. The Douay Rheims, which has a lot to recommend it, in some ways translates it as rhinoceros. And a lot of modern translations render it either as wild ox or aurochs. A U R O C H S, which. An aurochs is a kind of ancient cattle breed. Breed of sorts. Yeah, yeah, yeah. That. It was especially like in Eastern Europe and the steppes, you know, of Central Asia and that kind of thing of old and would. Would have been known to ancient people."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2591.56,"end":2615.56,"speaker":"Fr Stephen De Young","text":"Yeah. So the. The Hebrew word that's behind all this is reem, which basically refers to an urus, which is like an aurochs. It's a sort of wild bull. Right. It's a type of cattle that was an ancestor of our current domesticated cattle, but was not domesticated."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2616.12,"end":2616.52,"speaker":"Deacon","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2618.28,"end":2640.75,"speaker":"Fr Stephen De Young","text":"And so they were sort of like water buffalo or wild dogs, that kind of thing. So those modern translations are kind of closer to what's going on in the Hebrew with reem. The Greek translates it as monokeros, which literally means one horned, one horn thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2641.23,"end":2650.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Those who know a little Greek would recognize that keros is being related to words like, you know, keratin. And that kind of thing has to do with horns."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2651.15,"end":2656.19,"speaker":"Fr Stephen De Young","text":"Yeah. And is the Ceres in rhinoceros."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2656.51,"end":2656.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2657.07,"end":2659.96,"speaker":"Fr Stephen De Young","text":"Which is where the Douay Rheims is thinking."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2660.2,"end":2660.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2661.56,"end":2683.56,"speaker":"Fr Stephen De Young","text":"So this gets. When, when St. Jerome comes to it, he's not sure what this is talking about, and so he just changes it into Latin and put unicornis, one horn thing. Right, right. And then the King James translators got to it, they didn't know what that was, so they just transliterated it into English as unicorn."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2684.36,"end":2695.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. So basically what we're saying then, if I'm following this correctly, is that the word unicorn is the result of biblical translation."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2695.7,"end":2696.18,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2696.5,"end":2714.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that the word is. I mean, obviously we're talking about a concept that, you know, is behind it, but that the word unicorn comes from biblical translation, basically, because translators weren't entirely sure what to do with this Hebrew word. Right, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2715.34,"end":2731.02,"speaker":"Fr Stephen De Young","text":"And so the trend you see, though, in all those English translations, once people start trying to figure out what it is, even the Dewey Rheims, is they're trying to associate it with a real world animal. Sort of like we saw last time with Leviathan and behemoth. Well, this has to just be some zoological creature."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2731.74,"end":2732.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2733.02,"end":2765.24,"speaker":"Fr Stephen De Young","text":"Who we need to associate this with. And there's some. I'm not going to go down this alley. But hey, if you've got a lot of time on your hands and an Internet connection, you could go down a whole rabbit trail with our KJV only friends trying to explain what a unicorn is, because they take the King James as being authoritative and it says unicorn. So this includes an argument of how it could be a narwhal on one website. Wow, wow, wow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2766.04,"end":2771.86,"speaker":"Fr Andrew Stephen Damick","text":"In case you don't remember what a narwhal is, kids, it's a sea creature that in fact does have one. Bas bighorn."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2772.74,"end":2773.22,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2774.26,"end":2777.7,"speaker":"Fr Andrew Stephen Damick","text":"But it's. But it's hanging around the ruins of a city, apparently."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2777.78,"end":2778.46,"speaker":"Fr Stephen De Young","text":"Narwhals."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2778.46,"end":2779.22,"speaker":"Fr Andrew Stephen Damick","text":"That's so great."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2779.3,"end":2792.02,"speaker":"Fr Stephen De Young","text":"Swimming in the ocean, causing a commotion. So what's it. But what's really going on here, as we talked about last time, is this is calling upon the whole bull imagery."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2792.26,"end":2796.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Of behemoth, Bale, the bulls of Bashan."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2796.74,"end":2843.6,"speaker":"Fr Stephen De Young","text":"The bull Bale, the APIs bulls of Egypt, the bull of Heaven. That's what this is drawing on. So this is another demonic creature. And so when you put these together, like in Isaiah 34, this is an idea that is common in Old Testament, in the Old Testament and in other ancient Jewish sources, that when a civilization collapses or a city is destroyed or collapses. And already at the time that the Old Testament is being written. Right. We talked about the ur3 period. Right. There are cities that are already thousands of years old. So whole cities, whole empires have risen and fallen by the time the Old Testament starts being written."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2843.84,"end":2846.72,"speaker":"Fr Andrew Stephen Damick","text":"So there's ruins around that people actually are noticing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2847.12,"end":2879.27,"speaker":"Fr Stephen De Young","text":"Yeah. Of these previous civilizations. And so they believe that when those civilizations collapsed, the gods of those cities and nations and empires, the spirits of their dead kings who they believed were divine, all kinds of demons would make their home in those ruins. Right. Ruins, graveyards, haunting, ancient tombs would have these. These are the only things that would live. There would be these sort of demonic creatures and evil spirits."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2879.59,"end":2884.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is where this association that, you know, is pretty much universal in."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2886.99,"end":2887.11,"speaker":"Announcer","text":"You."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2887.11,"end":2917.77,"speaker":"Fr Andrew Stephen Damick","text":"Know, human culture of. Of. Of, you know, like you said, hauntings of ruins and of course, you know, cemeteries. I mean, and all that kind of stuff is that these are places of the dead, the damned, the demonic, other things that start with D. Devils, demons. Yeah. And. And then, you know, there's. Then this shows up with this idea that we have now of, you know, where you get this, you know, modern Egyptology where, you know, mummies haunting tombs and all that kind of stuff or, you know."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2917.77,"end":2936.65,"speaker":"Fr Stephen De Young","text":"Yeah. Howard Carter comes and opens, you know, King Tutankhamun's tomb. And, you know, X number of people all died mysteriously from the expedition shortly thereafter because there were these sort of ancient Egyptian spirits down there in the tomb that you interacted with by going there."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2936.73,"end":2948.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah. Who disturbs my rest? Yeah. Right. Yeah. I mean, well, you know, and, you know, you get a whole film genre, Indiana Jones, you know, it's sort of all based on this kind of idea. So thanks."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2948.89,"end":2976.98,"speaker":"Fr Stephen De Young","text":"And so Isaiah, that's why this shows up at this oracle in Isaiah, is that, you know, right now, as he. As Isaiah is making this proclamation, edom is this prosperous civilization. They're conducting commerce. There's all kinds of life going on in their cities. And not only is that going to be gone, but the place where that was is going to be filled with death and evil and destruction. Right. That's the prophecy is that it's going to go the other way."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":2977.22,"end":3000.21,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. All right. Well, that is the first half of our show. We've talked about Lamia, Lilith, donkey, centaurs and unicorns, rhinoceroses, bulls hanging around in. In the ruins of once great civilization. So we're gonna go ahead and go to our first break, and we'll be right back with more monsters."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3001.25,"end":3018.68,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part. Of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3019.57,"end":3062.45,"speaker":"Announcer","text":"St. Ignatius, first century bishop of Antioch, called the God Bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God. Fr. Andrew Damick recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters he martyrdom, salvation in Christ, the bishop, the unity of the church and the Eucharist."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3062.61,"end":3082.66,"speaker":"Deacon","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense, which that can be challenging for us because number one, he doesn't seem to have any reticence at all about going to martyrdom. Like there's no sense of, well, this is what I have to do, you know, I wish I didn't have to. But this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3082.9,"end":3093.74,"speaker":"Announcer","text":"To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3093.74,"end":3108.72,"speaker":"Steve","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3110.24,"end":3115.68,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back. Well, sounds like the voice of Steve got a little confused there for a second. But we are back."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3116.08,"end":3121.04,"speaker":"Fr Stephen De Young","text":"I think. Actually, I think we're being nice. I think he really needed some extra residuals."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3122.32,"end":3124.64,"speaker":"Fr Andrew Stephen Damick","text":"That's true. How much are we sending?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3124.88,"end":3126.08,"speaker":"Fr Stephen De Young","text":"Shopping is around the corner."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3126.51,"end":3161.69,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Everybody tip your local Steve. So we are back. This is the second half of the show and like Steve said, you can call us at 855 AF radio and we are going to take a couple calls. But first I just wanted to give Father Stephen the opportunity to talk. Not that he can't, but to give him the opportunity to talk because he has a brand new book that literally just came out last week. So it's called God is a Man of War. You can get it from store.ancientfaith.com Father Stephen, what is that book all about?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3163.05,"end":3164.17,"speaker":"Fr Stephen De Young","text":"Violence and death."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3164.97,"end":3166.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's pretty much true."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3168.17,"end":3173.29,"speaker":"Fr Stephen De Young","text":"Yeah. The subtitle is the Problem of Violence in the Old Testament."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3173.53,"end":3173.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3174.65,"end":3235.63,"speaker":"Fr Stephen De Young","text":"So there are a lot of passages in the Old Testament. People probably have some that immediately come to mind that as modern people are deeply troubling to us because they don't just depict sort of violent and horrible things though they do. But sometimes it seems like God is kind of telling people to do those violent and awful things, or he's okay with it at least. And so these are really troubling to a lot of people. We also have a lot of our young people who have these things thrown in their faces by schoolmates, by co workers, etc. Your local atheist. And they don't necessarily know what to do with them themselves. So they don't have sort of a good answer prepared. And so I know some people are a little sketched out by the title, God is a Man of War. But that is a verse from the book of Exodus."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3235.79,"end":3238.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's a Bible quote. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3238.75,"end":3279.01,"speaker":"Fr Stephen De Young","text":"And so the book is about passages of the Old Testament that are troubling. And the title is a verse from the Old Testament that is troubling. So it kind of does what it says on the tin. And I'm hoping it will be helpful to people in that way to kind of both for people who sort of struggle with what to do with this, like, how is this beneficial to my life to read these horrible things and also to people who have had this stuff thrown at them and sort of don't know what to do with it, to kind of prepare you to be able to give some kind of answer to somebody who shows up and wants to throw those things at you."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3279.25,"end":3303.18,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Yeah, I'm about 40 or so pages into my copy and I'm loving it so far. So I do recommend it to everybody. So this is the second part and we are ready to take some calls. So we have Alexander, who is calling, and this is what it says on the call board from Transylvania, Romania, actually calling from Transylvania. So, Alexander, are you there?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3305.02,"end":3305.46,"speaker":"Alexander","text":"Hello?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3305.46,"end":3312.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes, welcome. Welcome to the Lord of Spirits. We are glad to have you. What is your comment or your question for us tonight?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3314.3,"end":3323.35,"speaker":"Alexander","text":"I was thinking of sharing some information about some local creatures we have here and see what you think about."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3323.51,"end":3325.51,"speaker":"Fr Andrew Stephen Damick","text":"Sure, yeah, sure. What's up?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3326.63,"end":3440.48,"speaker":"Alexander","text":"So, for example, there is this thing called freecollege, which I guess is kind of like a werewolf, but the thing with them is that it's seen kind of as a sort of thing you are born with. And usually it happens if you are the first generation or more born out of wedlock. And when you are born, there's like a sign on your body so people know. And the thing is that sometimes you can turn into A dog, but you don't know. So, for example, there's stories like a woman is attacked by a dog and he rips her shirt. And later she meets with her husband and tells her what happened, but parts of her ripped shirt were in his teeth, so she knew it was him turned into a dog and she broke up with him. That's one kind of creature. And there's also these wind spirits that lift people up in the air, and after that you can become crazy or stuff. And I read about spirits that do the same thing in Japan, so it seems to be common. So that's another thing. And the strangest one is being called Marzolia, which you could translate as Big Tuesday. And it's this demon that doesn't want, like, Tuesday is his day. So if women work on his day or her day, she's offended. And usually she comes as a woman and helps them to work, but harms them at the end. So, like, if they are boiling cloth, she pushes them in the water. In the boiling water or stuff like that."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3440.8,"end":3441.28,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3441.36,"end":3455.28,"speaker":"Alexander","text":"And there's these stories up to very recently, and people have, like, it's not like long, long, long ago type of story. It's like, I know someone or even myself already. It happened to me."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3456.09,"end":3543.81,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. So the first thing I'll say is, with regards to the first two kinds of creatures you mention, we are actually. That is literally. So we're going to be talking about, among other things, werewolves during this part of the episode. So just stay tuned for that. And then this idea of demons that make you go insane, that is, in fact, what we're going to be talking about in the third part. But I wanted to mention this thing about Tuesdays, which seems so sort of random and weird. The thing that occurs to me is, and this is the association in my head when you said this, and I don't know if Father Stephen knows something else that I don't probably, but I do know that the idea that Tuesday is considered to be a sort of unlucky or cursed day exists in the Balkans. And I know that some Greeks at least connect this to the fall of Constantinople, to the Ottoman turks back in 1453, on May 29th of that year, because it happened on a Tuesday. And so there's this idea that that's an unlucky or a cursed day. And so you don't want to especially, like, start anything on that day, any new venture that would be a bad day to start it. So, I mean, that's what I'm kind of aware of. I don't know. Father Stephen, are you aware of other stuff in regards to this?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3544.45,"end":3670.24,"speaker":"Fr Stephen De Young","text":"Well, yeah, as you mentioned, we're about to talk about Ricolakis and all that kind of stuff. But anyway, the second two, in terms of like an aerial type spirit and sort of a demon who has claim over a day, right. These are things that in the ancient past, remember, we've talked about how there were spirits that were assigned to sort of be over and help administer for God the different elements of creation, right? And how many of them became demonic, Right. So the devil himself at one point is called the prince and power of the air, right? Because he was in some way associated with the air. And aerial spirits are sort of a general category. And so part of what happens as the world is Christianized is that as we talked about particularly in our Halloween special last year, is that these demonic spirits who had control of these things are displaced. And saints and angels sort of take, take their place in helping Christ administer his kingdom and his dominion. But there's, there's sort of this constant tension, right, where the advantage, quote unquote, that pagans thought that they had was you can't manipulate Christ, right? There's, there's nothing you could offer Christ. You can't give Christ a sacrifice and get him to do what you want. Christ isn't going to give you a love potion to make the person you like like you back, right? That's not going to work because he doesn't need anything from you, right? But these sort of lesser pagan demonic spirits you can try and sort of bargain with and make deals with, right? And so if, when as paganism is displaced, right? And so the, the days of the week, like in their English names, are related to the pagan gods."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3670.56,"end":3671.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3671.6,"end":3727.15,"speaker":"Fr Stephen De Young","text":"It's Woden's day and Thor's day and right? These are these pagan spirits who. That was their day, right? There's this tendency to say, well, I want to have a good day tomorrow, or I really need X, Y or Z to happen. And what we're called to do as Christians is to be diligent followers of Christ, to pray, to commit it to God that Christ is with us no matter what happens, right? But if you have someone who used to be a pagan or maybe still is a pagan whispering in your ear and saying, yeah, but if you wear this amulet or use this charm or say this, or write this word on a pile of leaves or whatever, right? Well, then that'll kind of make the spirit of that day do what you want, right? Or That'll keep it at bay. If we're talking about one of these demonic spirits, that'll keep it away."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3727.63,"end":3728.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3728.27,"end":3760.9,"speaker":"Fr Stephen De Young","text":"There's this great temptation to sort of not trust Christ. Right. Not trust God. We see that the ancient Israelites do this over and over and over again. Right. Rather than just trusting in their God and being obedient and faithful, they also want to go on the side. And, well, I really need fertile crops, so I'm going to also sacrifice to baal. And so I think that's where a lot of these traditions and stuff come from. So the answer is. Not. The answer a lot of modern materialist Christians give is, oh, that's all nonsense and fairy tales. Don't worry about that. Come on."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3761.41,"end":3761.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3762.61,"end":3808.53,"speaker":"Fr Stephen De Young","text":"That's not the correct answer. The correct answer is there are demons who used to be associated with days of the week in the pagan past. There. There are demons who are aerial spirits. Right. And if you're not resting in Christ, then, yes, those demonic spirits can prey upon you. Christ is the protection from those spirits. And so the protection from those spirits is not to perform some kind of ritual or wear some kind of charm or, you know, paint something on a wall or do something like that. The answer is to trust in Christ and be faithful to him, because Christ is more powerful and. And command the demons not only to stay away from you, but can drive them out entirely and throw them in the abyss."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3809.01,"end":3814.53,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. Does that help, Alexander? Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3814.91,"end":3818.75,"speaker":"Alexander","text":"Thank you very much. Can I share a fun fact before I leave?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3819.23,"end":3820.67,"speaker":"Fr Andrew Stephen Damick","text":"Sure. A fun fact?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3821.79,"end":3843.42,"speaker":"Alexander","text":"Yeah. I have a friend who interviewed a lot of villagers like, 30 years ago, and not only did they have a lot of stories about giants, but they knew where they are supposed to be buried and tried to convince him to organize digging and stuff. And one of the villagers is actually named after Giant's daughter."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3844.38,"end":3845.02,"speaker":"Fr Andrew Stephen Damick","text":"Amazing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3845.82,"end":3847.82,"speaker":"Alexander","text":"If people want to dig, they can come."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3849.34,"end":3867.74,"speaker":"Fr Andrew Stephen Damick","text":"All right, we'll connect them with you. I think you're our very first caller from Romania, so welcome. We're really glad to have you with us tonight. Thank you. All right. Okay. Thank you, Alexander. Okay, we're going to take one more call, and we have James calling from Washington State. James, are you there?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3868.83,"end":3869.31,"speaker":"Alexander","text":"Hey, there."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3870.19,"end":3873.31,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Welcome to the Lord of Spirits podcast. What's on your mind, James?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3873.71,"end":3874.35,"speaker":"Deacon","text":"Thank you."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3874.67,"end":3879.23,"speaker":"Unregistered: James","text":"I have to make a correction. My phone number is from Washington, but I just moved to North Dakota."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3879.63,"end":3883.55,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, all right. Well, somewhere on the northern border anyway."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3885.07,"end":3886.51,"speaker":"Fr Stephen De Young","text":"You weren't cold enough."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3890.35,"end":3894.79,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, welcome, James from North Dakota."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3897.51,"end":3898.95,"speaker":"Alexander","text":"So thank you so much."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3900.31,"end":3996.85,"speaker":"Unregistered: James","text":"As a writer and a reader and lover of stories, and particularly fantasy and horror genres, I've observed a trend in the nature and role that certain kinds of monsters take in the stories. As it's changed over the years. And I never really thought too much of it until I started listening to Lord of Spirits and thinking about the reality of things and wondering those actually might be a deeper implication to how you started interacting with them and framing them. And the observation that I made it particularly is of note with, like, witches and vampires in particular. But where in the older stories a witch is something you became or something you did, right, you did witchcraft and therefore you are a witch, or vampirism, where you became a vampire by doing vampirism in a sense, or preyed upon and joined in with it type of thing. But in recent stories, notably, of course, Harry Potter and things like that, witches, wizards, sometimes vampires, werewolves are like a species or a race or something that you're born as. It's not something you choose and are therefore, quote, unquote, morally neutral. You can't, you know, condemn somebody for being a witch if they were just born that way. It's kind of the idea, and I've kind of thought of it in connection, like, maybe a connection with, like, the idea that you're born with particular sexuality or something, as a similar kind of argument. But I think there might actually be something deeper and I'm not sure. And I also might be completely wrong because I know Father Stephen has a much wider breadth of pop culture awareness than I do."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":3998.45,"end":4000.69,"speaker":"Fr Andrew Stephen Damick","text":"And then I do. God help us."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4002.8,"end":4007.84,"speaker":"Unregistered: James","text":"Like, here's that observation is valid in the first place, but also, is there something to this shift?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4007.84,"end":4008.24,"speaker":"Fr Stephen De Young","text":"Is it."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4008.24,"end":4011.84,"speaker":"Unregistered: James","text":"Can we blame it on the 19th century German philosophers or what?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4013.6,"end":4173.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I've. So, I've noticed this too. And I think alongside it also is an attempt to humanize the sort of the divine and the monstrous. Right. Like, I. I notice, for instance, that a lot of monsters are now sort of tamed, domesticated and kind of cute. And. And the example that I like to give, for instance, is even though I kind of like these films and my kids like them and I let them watch them. How to Train youn Dragon, where dragons are literally trainable. You know, I mean, and they're. They're, you know, they're fine. They're fine. Right. I'm not complaining against that, but it's. It's a thing. And, you know, like. Or like Pete's Dragon, I've noticed it especially with dragons a lot. Whereas, if you look at dragons in mythology, they are not beings that you. Yeah, yeah. They are not good beings ever. Right. They are monsters. They are just sheer demons. And I. So I. I think that part of what's going on is there's a materialism, right, which is this idea that human beings don't actually interact with a kind of an unseen world. It's all sort of inside them. But at the same time, there's a. There's a societal desire to interact, to, like, get in touch with the unseen, right? There's. There's a. There's a want for that. And so then that gets psychologized and internalized, right? So, yes, some people kind of are. Magic is sort of the idea, like with Harry Potter, for instance, you know. So, yeah, it's interesting. I'm not quite sure what to make of it, but I do think that it's part of the general kind of, you know, this sort of contested world that is talked about, for instance, in James Taylor's take on what he calls the secular three world, Right. Everything is contest, incontestable. There is no dominant narrative. And I think that it's a manifestation of that. And, you know, it's interesting. You know, this is just going to give more fuel to the one guy who claims that this is the same podcast as the Aman Sul podcast. But it's interesting to look at the way that Tolkien kind of deals with this, where there is this notion that some people have, like, divine blood, right? But that doesn't necessarily give them magical powers so much as it actually enables them to have the possibility of ennoblement, which the whole point is then to ennoble others is sort of the way that that goes. So I don't know. I don't know. I don't have any conclusions to any of that. But that's kind of my. Swimming around in some of what you're talking about, Father. What do you got?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4174.83,"end":4178.03,"speaker":"Fr Stephen De Young","text":"Yeah. I think it all comes down to the X Men."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4180.59,"end":4183.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. Mutants."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4183.47,"end":4279.94,"speaker":"Fr Stephen De Young","text":"Yeah. And here's what. So when Stan Lee and Jack Kirby came up with the X Men. Men, Stan Lee used to joke that the reason he made the mutants was he couldn't think of any more good superhero origins. So he just said, well, they're mutants. But in actuality, what's going on there is, you know, the mutants got their superpowers when they went through puberty, right? So this was to connect with, like, young readers who were the audience for comics at the time, not people in their 40s like me and and and to kind of say, you know, when you're. When you're a kid and you're going through puberty, all of a sudden your body gets weird and gross and you don't know what's happening to you, and you feel like an outcast and a weirdo. Right. And so that was sort of the idea behind it. But then, like, as it goes on, as the X Men comics went on, all of a sudden that became a metaphor for race in the late 60s. 60s. And then it became a metaphor for sexuality in the 90s. And then, you know, on and on. Right. And so it's this kind of trope. And this is why you see it so concentrated in, like, teen literature now, like Twilight or, you know, Harry Potter or whatever, right. That you have a group of people who feel weird, you know, and picked on and gross and that kind of thing. And appealing to them is the idea that, hey, that thing that makes you weird and everybody picks on you about is actually like your superpower. That's what makes you special and great."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4279.94,"end":4280.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4280.3,"end":4317.37,"speaker":"Fr Stephen De Young","text":"Right. And so this isn't to sort of apologize for it, because I think there are some problematic things there, right, where when you tell people what's important about you is how you're doing different from everyone else. Right? So, like, your rebellion is the core of your personhood. The ways in which you have rebelled against societal structures, that's what makes you unique as an individual and special. So if you don't have that right, if you're sort of normal, that's bad. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4317.69,"end":4320.17,"speaker":"Unregistered: James","text":"Like, that's a whole YA genre."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4320.65,"end":4380.87,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Like it's bad to be a Muggle, Right. Like, it's bad to just, you know, live a quiet and decent life in godliness and sanctity. Like as St. Paul says we should try to. Like, you need to be different than everybody else and unique and question everything and. Right. And that creates a certain idea of what identity is, where identity, again, is what makes you different from everybody else. Right. Whereas earlier and more ancient concepts of identity was, your identity was sort of a series of overlapping circles of where you fit, not where you didn't. Right. So my identity is made up of being my wife's husband and my parents, child and the community I'm a part of and the. The parish I'm a part of and the. Right. All of those roles and all those capacities. You pile those all up and you get my identity. My identity is not the way in which I reject all those."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4382.31,"end":4382.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4383.99,"end":4394.47,"speaker":"Fr Stephen De Young","text":"So I think that's at the core of what's going on. And I think it is super destructive to. To society. Right. To start to view your own identity that way."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4394.87,"end":4398.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Oh, yeah. Well, does that."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4398.31,"end":4403.49,"speaker":"Unregistered: James","text":"Does that becomes how to write a story that subverts those tropes?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4405.01,"end":4518.51,"speaker":"Fr Andrew Stephen Damick","text":"Well, cjr Tolkien, I don't know. You know, I mean, it's true. A lot of the things, for instance, that our friend Jonathan Pageau talks about is about reestablishing hierarchy in a healthy way. And that's exactly this. Right. It's exactly putting things in their proper order, you know, so, yeah, I mean, it can be done, and I think people do connect to it when it's done really, really well. I mean, you think about it. I mean, just think about the. Like, it's interesting. For instance, just look at the Marvel Cinematic Universe, which plays with both of these ideas. On the one hand, there is, you know, these people are weird, and that's what makes them who they are. But then on the other hand, there's like, okay, there's problems in the world, and we need to fix them and need to put things back to, you know, we need to have peace again. And, you know, this kind of. So it's constantly dealing with this problem of order versus chaos and how you navigate that. All right, well, thank you very much for calling, James. We're glad to have you on and help us. Let us nerd out a little bit. I mean, the whole thing is nerding out, but this is pop culture nerding out. All right, thanks. Okay, so now. Now that we've talked about just outright demons, now we're going to talk about human beings that are kind of functioning in demonic ways. And with the first, we're going to talk about werewolves. One of everyone's favorite Halloween monsters, werewolves. Right. Alexander brought up werewolves a little bit from Romania. But, yeah, I mean, werewolves, this is another one of these beasts that's, like, everywhere. Like, everyone has a werewolf. And, you know, it's in pretty much every culture and mythology and."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4518.51,"end":4523.23,"speaker":"Fr Stephen De Young","text":"And you can do your old English etymology here. I know you're chomping at the bit."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4523.47,"end":4548.66,"speaker":"Fr Andrew Stephen Damick","text":"I am. I am. It's a good old English word. So wer. Yeah, it's funny. Yeah. Wera is. Is one of the many words from Old English that means man. In other words, a human. And then wolf is wolf just. It's just. It's spelled with a U in Old English, typically. But werewolf is just man wolf, actually. That's. That's all it is. So, yeah, that's where we get werewolf. It's a good, good classic old English word."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4549.06,"end":4553.7,"speaker":"Fr Stephen De Young","text":"Yeah. And it's sort of a tri transliteration of the Greek lycanthrope."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4554.26,"end":4557.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4557.02,"end":4558.74,"speaker":"Fr Stephen De Young","text":"Except that's wolf man instead of man."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4558.74,"end":4568.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's. Yeah, it's a. What they call that a calc, A C, a L, Q, U, E. Where you translate each of the parts and then come up with a new word. You know, like that. Yeah, yeah. Lycanthrope."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4568.46,"end":4576.38,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Okay, so you have the classic television program Manimal, but that was a whole other thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4578.14,"end":4585.66,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so let's go to ancient Greece, Father Stephen, because that's where werewolves come from, at least the earliest ones that we know about."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4585.82,"end":4589.02,"speaker":"Fr Stephen De Young","text":"Well, and ancient, Ancient Greece, Right, yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4589.34,"end":4591.82,"speaker":"Fr Andrew Stephen Damick","text":"Super ancient, like Titanic, almost Greece."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4591.98,"end":4594.37,"speaker":"Fr Stephen De Young","text":"Yes, we're talking about, like the."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4594.61,"end":4595.01,"speaker":"Alexander","text":"The."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4595.09,"end":4601.09,"speaker":"Fr Stephen De Young","text":"We're talking about Arcadia or Greece. Yes. Or Elenos."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4601.09,"end":4601.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4603.01,"end":4637.22,"speaker":"Fr Stephen De Young","text":"So Arcadia is an area in Greece. Right. A mountainous area in Greece still. But it was in the ancient world considered to be the beginning. This is where Greek civilization began. And this was sort of the golden age back in the past. And I'd be remiss if I didn't here give a shout out to Arcadian Knights, the greatest wow. Guild in the history of Dragonblight. US Server."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4637.22,"end":4637.82,"speaker":"Fr Andrew Stephen Damick","text":"But anyway."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4640.06,"end":4659.65,"speaker":"Fr Stephen De Young","text":"So in Arcadia, right, the first king there, sort of in this Greek prehistory, was a fellow named Pelasgius. And that s. That Palas part, the Pulaskius part is important. This is Pelasgius, not Pelagius, but spelled."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4659.65,"end":4662.13,"speaker":"Fr Andrew Stephen Damick","text":"Basically the same, except with an S in there. Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4662.13,"end":4673.13,"speaker":"Fr Stephen De Young","text":"Now, if you want to scare the dickens out of your local Calvinists on Sunday, dress like Pelagius. But this is trying to imagine what."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4673.13,"end":4675.61,"speaker":"Fr Andrew Stephen Damick","text":"A Pelagius costume would even look like. I don't know."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4675.85,"end":4679.51,"speaker":"Fr Stephen De Young","text":"I don't know. You'd have to look like you were working really hard to earn your salvation."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4679.75,"end":4690.59,"speaker":"Fr Andrew Stephen Damick","text":"Scottish Toby. I mean, I remember there's an insult. I think the scene Jerome hurls at. At Pelagius, where he basically says that he eats too much haggis, if I remember correctly, which is."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4690.59,"end":4691.43,"speaker":"Fr Stephen De Young","text":"Well, he was British."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4692.07,"end":4694.55,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, it was definitely on the table."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4694.63,"end":4703.03,"speaker":"Fr Stephen De Young","text":"So there you go. Carry some haggis and. Yeah, so, yeah, this is the last."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4703.75,"end":4708.43,"speaker":"Fr Andrew Stephen Damick","text":"Only people who eat a lot of haggis could think that they could save themselves by their own merits."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4709.15,"end":4726.11,"speaker":"Fr Stephen De Young","text":"If you can manage to eat a large quantity of haggis, you are capable of many things. But anyway, so this first king, Pelasgius. The Arcadians are also later known as Pelasgians. And that's named after Pelasgius."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4726.19,"end":4730.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And again, the founder of their society or whatever."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4730.03,"end":4736.36,"speaker":"Fr Stephen De Young","text":"Right. That's like a G sound in there. Pulaski is. This is not like Dr. Pulaski of the second season of Star Trek the."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4736.36,"end":4737.96,"speaker":"Fr Andrew Stephen Damick","text":"Next Generation and second season only."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4739.72,"end":4818.74,"speaker":"Fr Stephen De Young","text":"So they're not Polish. More well known than Pulaskius, other than the fact that he lends his name to the people in some accounts, is his son Lycaon. And not only is his son named Lycaon, Mount Lycaon is a mountain in that region. That mountain has two peaks, and it is the southern peak which now concerns us of the two. And what's on that southern peak of Mount Lycaon is the oldest known altar to Zeus. Not just known to us today, but when you read ancient Greek sources, they say this is the first altar to Zeus. That altar is. Was so ancient and so sort of renowned in Greek religion that it was referred. It had its own name. They referred to that altar as the Bemos. And that is important in showing you the age of this tradition, because be most is derived from bima or bema in Semitic dialects, going back to Akkadian, which is the word for altar."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4819.54,"end":4831.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we use this even in, you know, Orthodox Christian Liturgics to refer to a particular location in the temple as well, the vima, you know, right in the middle of it, typically. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4831.7,"end":4871.8,"speaker":"Fr Stephen De Young","text":"So the. But. But this was not the regular word for altar. This one was just called the beamos. And we've mentioned this before on the show, but this is one of the reasons why Greece is the last ancient Near Eastern civilization, not the first Western one, is because when you get down to the Ur layer of all of these particularly religious words in Greek, they're derived from Akkadian. They're coming from further east, not further west. And so what. What the Bemos actually is, is regardless of what you may be thinking of, when you think of an ancient altar, it was actually a big mound of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4871.8,"end":4872.28,"speaker":"Announcer","text":"Ash."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4874.2,"end":4924.49,"speaker":"Fr Stephen De Young","text":"From centuries of sacrifices and then a retaining wall around it to mark out sort of the sacred precinct right around the altar itself. And the story was that anyone who walked into that sort of sacred precinct, who went inside the retaining wall inappropriately, sort of without permission or without the blessing to do it, who wasn't a priest, would be dead within a year for having trespassed. And the reason they said that the altar was there in particular is that they believed that that peak was the birthplace of Zeus. Lychaos sort of the local, the localized hypostasis of. Of Zeus from that place."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4924.89,"end":4925.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4925.21,"end":4938.73,"speaker":"Fr Stephen De Young","text":"The Zeus who was worshiped there was actually born there, and that's the reason for the altar. So this ancient site is there. Here's where things get ugly again. Repeat the parental advisory."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4938.89,"end":4939.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4941.13,"end":4968.99,"speaker":"Fr Stephen De Young","text":"So in the story of King Lycaon, he goes to this place and sacrifices a human infant who was an enslaved person, the child of an enslaved group who he had conquered and offered the infant as a sacrifice to Zeus, including eating some of the entrails."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4969.55,"end":4976.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because just as a reminder, everybody, human sacrifice, it doesn't involve just killing humans, it involves eating humans."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4976.66,"end":4983.3,"speaker":"Fr Stephen De Young","text":"Yes, Cannibalism. And in the form of blood drinking and in the form of cannibalism. Direct cannibalism."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4983.38,"end":4985.38,"speaker":"Fr Andrew Stephen Damick","text":"Eating piece. Yeah, yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4986.34,"end":4997.86,"speaker":"Fr Stephen De Young","text":"And so when he did this horrible thing, he was transformed into this sort of cannibalistic wild wolf creature."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":4998.5,"end":5015.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's kind of a. Here's the question I have, and this is a genuine question. Like it's a chicken egg issue. Like, is, is the Greek word for. For. For wolf derived from this guy's name lick on or. Or is his name Wolfie? I mean, what's, what's going on here?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5015.79,"end":5017.55,"speaker":"Fr Stephen De Young","text":"It probably goes the other way."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5018.99,"end":5021.55,"speaker":"Fr Andrew Stephen Damick","text":"That. That, that wolf is derived from his name."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5022.27,"end":5024.19,"speaker":"Fr Stephen De Young","text":"No, that. He's being named Wolfie."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5024.19,"end":5025.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's being named Wolfie."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5025.47,"end":5031.83,"speaker":"Fr Stephen De Young","text":"Okay, that. Yeah, this is Wolf Mountain and. Yeah, yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5031.83,"end":5100.26,"speaker":"Fr Andrew Stephen Damick","text":"And you know, I don't know if we've mentioned this on this show in the past, but just to say it now, like, you know, of course sacrifice puts you in communion with your God. And sometimes like big super sacrifices are done to have kind of big effects. And so to sacrifice a human is done in an attempt to, I don't know, have a really super intense communion with your God and like gain powers, you know, like it's considered a very powerful, powerful, big sacrifice to sacrifice a human being versus just like an animal or grain or drink or something like that, which is sort of the usual like, like this is, this is unusual even for paganism that you would sacrifice a person. Right. Because I mean, you get. In the ancient world, you get pagans who don't do that, looking down on and sometimes attacking and destroying other pagan tribes who did it, looking at them as sort of way beyond the pale. Like, that's just so wicked. Nobody should do that, you know, but the idea is that it's this monstrous thing to do in order to get monstrous results."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5101.54,"end":5137.09,"speaker":"Fr Stephen De Young","text":"Right. And it's interesting. You see this migrate in the telling of the story, too, the earliest Greek tellings of this story. It's kind of portrayed as this kind of powerful Ur magic thing. I need to stop using ur. I've used it too much tonight. But when you get to the later stuff, especially when you get to, like, Ovid talking about it, when you get to the ro. The Romans had a particular aversion to most, repeat most forms of human sacrifice, see the Punic Wars. So they saw him getting turned into a wolf as more of a punishment from."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5137.09,"end":5161.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like a curse from the gods. Yeah, that's. That's the version I think you usually see if you're reading, if. If people are reading this story at all, which it's not usually in most kind of collections of Greek mythology that are out there. But most of the ones you see, it's this idea that he did this wicked thing and so he was cursed by the gods to be like a wolf. But like you said in early ones, it's like. Like he was gifted by the gods to, you know, like he gained wolf powers."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5161.49,"end":5168.54,"speaker":"Fr Stephen De Young","text":"Yeah. And. And even the later Greeks got super embarrassed by this stuff. There's sort of some revision. They did some revisionism."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5170.94,"end":5172.54,"speaker":"Fr Andrew Stephen Damick","text":"As one does. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5173.98,"end":5194.08,"speaker":"Fr Stephen De Young","text":"As one would be a little embarrassed. So. But not only do you have this cultic activity going on, but related cultic activity. We don't usually think of it as modern people as cultic activity, but there were also Lycaean games that were held in the valley at the foot of Mount Lycaon."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5194.4,"end":5197.76,"speaker":"Fr Andrew Stephen Damick","text":"Like Olympic games. But they're cannibalistic werewolf games."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5197.76,"end":5241.12,"speaker":"Fr Stephen De Young","text":"Yeah. They weren't at Olympus. Yeah. So we. And it's worth noting, we don't think of the Olympics as cultic activity today. No, but they were. Games were in the ancient world. Many of the earliest games, especially the Greek games, did not have spectators. People didn't go to watch them as sporting events. They went out and they performed these things that they were performing for the gods in their mind. So this was a sort of a weird sort of offering. Right. Of their prowess and beauty and strength. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5242,"end":5242.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5243.2,"end":5247.55,"speaker":"Fr Stephen De Young","text":"To try to gain credit with the gods, try to impress them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5248.98,"end":5253.54,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's this whole notion of like doing quests to get. Yeah, yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5253.78,"end":5390.42,"speaker":"Fr Stephen De Young","text":"Raise your rep. Yeah. But. So the most famous champion of these games was the first champion, a fellow named Demarcus of Parhasia. And the way he won the games was before the games, he went up to the altar and offered an infant and ate part of it and got the wolf powers. And then the wolf, the wolf in transformation allowed him the additional strength and prowess and everything to be this great victor in the games and be crowned as the, as the victor. So much later in the second century BC There's a fellow named Pausanias who was a geographer who traveled around Greece and sort of, he was sort of the Anthony Bourdain of the ancient world. He went around and talked about the food and the culture and the geography and the way of life. Sacrifice, right? Yeah. And religion and all these things in these various places. And he tells us in the second century B.C. so this isn't that long before Christ. This is maybe 150 years before the birth of Christ tells us that these infant sacrifices were a regular occurrence there. This wasn't just this crazy thing that happened in the distant past, but this is something that, I mean, not every day, but every few years, this is a thing that happened. And there's a, there's a related story connected to this that's told by Pliny the Elder, who says that they chose a man by lot every 10 years. And this person who was chosen by lot would sort of go into this sacred forest and become this like wolf creature. And he would spend nine years roaming in the wilderness as this kind of wolf and creature. And if he didn't eat any human flesh during that nine years, then in the 10th year he would be restored to his humanity. But if he did, he would remain in that state permanently."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5391.46,"end":5392.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5392.9,"end":5497.6,"speaker":"Fr Stephen De Young","text":"And so when Caesar Augustus comes to power and he's putting together, he has Aeneas put together or not Aeneas, Virgil put together the Aeneid, the new history of the world that culminates in Augustus. He also had Ovid travel the world and collect sort of all the folklore of the stories so he could form them all into one sort of master epic again, leading up to Caesar Augustus. And Ovid includes in this Roman material both Pausanias and Pliny's accounts, forging them together, of this werewolfism thing. And so this is this, this well known phenomenon in the ancient world around the Bible about what happens with, with cannibalism, right. Particularly and this kind of human sacrifice and the spirits associated with it, such that St. Augustine talks about it in City of God 1817, and he recounts the same story that Pliny the Elder did. But he also talks about those who, in Lupum fusae mutatum, right, those who are changed into wolves, right, they're transformed into wolves and says that this is a particular Type of sorcery or witchcraft. Right. Pagan ritual that people participate in to do this, to have this effect that there are demonic spirits related to this. Right. And that by participating in these rituals, one takes on this sort of monstrous, animalistic, cannibalistic aspect."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5501.21,"end":5501.45,"speaker":"Fr Andrew Stephen Damick","text":"Then."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5503.37,"end":5522.17,"speaker":"Fr Stephen De Young","text":"In the. Going on from St. Augustine in the Latin west, there's this text called the Canon Episcopi or the Capitulum Episcopi. And this was believed for a long time in the medieval period to have been canons issued by the Council of Ensyra."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5522.73,"end":5524.4,"speaker":"Fr Andrew Stephen Damick","text":"Right. But. But wasn't actually."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5524.64,"end":5551.53,"speaker":"Fr Stephen De Young","text":"But was not actually. Yeah, but because they thought that they were, these canons entered into Western canon law. So they are still to this day. They're in there in Western canon law and includes this condemnation of what we would call werewolfism, of rituals to cause yourself to be possessed by these animalistic cannibal spirits."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5551.93,"end":5552.49,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5553.53,"end":5629.98,"speaker":"Fr Stephen De Young","text":"And because it's then in Western canon law, when you get to the Inquisition, the Inquisition has records of executing in various countries a handful of werewolves of people who had participated in these kind of rituals, had become demon possessed like this, and then who were executed for cannibalistic activities. And this becomes, in French, the. The loup garou, which for those of us in southern Louisiana is the origin of the Rougarou, his Cajun cousin who roams the bayous. Yeah. And you can see how this starts to participate in some of the stuff we said about Lilith, because, like, when you get to the Rougarou, this is something to scare kids with. Right. It's a sort of demonic being who's prowling around that's going to get you if you don't behave this kind of fury idea that we. That we talked about. And then you get Hispanic traditions, the Kukui, and some of these things that are also sort of similarly related. But, you know, now, now's your chance, Father Andrew. Talk about some Indo European paganism."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5630.46,"end":5763.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, so, like, as a lot of people probably know, I've been reading a. Of Germanic literature lately. You know, both like Norse pagan and. And of course then Beowulf, which is Christian literature. And like this idea of werewolfism is there all, all over the place. And it's often associated with. With warfare, particularly like you would engage, you would do something to become like a wolf or occasionally like a bear before you go into battle. In some of these. These stories, you see them, people actually being transformed into wolves. And interestingly enough, there's a Germanic word, like the word for wolf, which is wolf, is also Used to refer to outlaws in general. So this idea that outlaws are participating in this tradition in some. On some level. And what's interesting, if you read some of these Norse stories, particularly like in some of the Sigurd legends and stuff, and I noticed this when I was reading this in some of the classes I've been taking lately, that a lot of times right before they become quote, unquote, wolves, there's references to eating and drinking human blood and this kind of thing. So, like this connection between cannibalism and werewolfism, I mean, it's just. It stretches from one end of the world to the other, you know. So, yeah, it's. It's. It's crazy, crazy stuff. But yeah, I mean, there's a whole series of like these werewolf legends. And I know it's an interesting question, like, what's, you know, are like. And I know we're going to talk about, like you brought. There's Native American stuff too, but like underneath it, are we talking like, you know, there's the modern notion of werewolves, right. Like where you see in these movies and stuff, Twilight and all this kind of stuff, and then. And then Teen Wolf. Hello. That's about getting power so you can be really good at sports. Hello. Hi. Ancient Greece, you know. Sorry, Michael J. Fox."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5763.58,"end":5772.22,"speaker":"Fr Stephen De Young","text":"Yeah, you heard it here first. Michael J. Fox is a Nephilim. You heard it here first. The shortest one ever, but still."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5772.22,"end":5793.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because they're not necessarily tall everybody, but. Yeah, I mean, like, what's underneath it? Well, I mean, do we believe that if you go into communion with demons in weird ways like this, you can gain supernatural abilities? Yes. I mean, it's attested throughout history and in the Bible."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5793.86,"end":5799.86,"speaker":"Fr Stephen De Young","text":"And in the Bible, the demon possessed man, you know, who throws off the people who try to chain him and breaks chains."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5800.5,"end":5806.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so. Okay, so mention the. The Native American stuff because, I mean, that's on the other side of the oceans now, right? Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5806.84,"end":5813.84,"speaker":"Fr Stephen De Young","text":"And it's worth reiterating, like, especially the Indo European form. This is especially related to initiation rituals."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5814.16,"end":5824.48,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Becoming like crossing into manhood, crossing into soldierhood, you know, becoming a king. Like this stuff is connected to all of that. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5824.64,"end":5842.89,"speaker":"Fr Stephen De Young","text":"And so what that means is, as we talked about with the giant clans, what makes the giant clans, Giant clans is this ritual life and participation in it. Right. So what we're talking about here with werewolfism is really a subspecies of giantism. Right. If you want to use that term."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5843.13,"end":5848.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's about communion with demons in order to sort of gain powers. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5848.25,"end":5987.29,"speaker":"Fr Stephen De Young","text":"So the native of American version of this, this is actually across a wide swath of Native American groups, but the one that's been studied the most by sort of folklorists is the Ojibwe. And that's where these spirits are known as the Wendigo. And here's where I make like a ravenous joke that you won't get, but some listener will somewhere, and a hungry like the wolf joke. So it could get added to the playlist. But so the idea here in popular culture, when they do horror movies and stuff with Wendigo, it's usually some kind of hairy beastman kind of creature, but that's. That's white settlers assimilating the Wendigo stuff with werewolf stuff from Europe. Right, Right. And we're not saying it's unrelated, but when you look at sort of the original Ojibwe Wendigo stuff, this is actually a spirit, a demonic spirit, which is a giant. They describe it as being this giant spirit that appears as sort of a withered, emaciated human. And when I say withered and emaciated, I mean they describe it as like a skeleton with some skin hanging off of it that is sort of ice cold giant skeleton thing. But this spirit comes and possesses people who are greedy or who are gluttonous or who engage in cannibalism. And regardless of why it possesses you, it then causes you to engage in cannibalism. And so there's these initiation rituals involving cannibalism from ancient times in. Among North American, North American tribes as well. So this is one of those sort of universal, just like giants are universal, this sort of subspecies of giant that's associated with this kind of gluttony and greed, the devouring of flesh, both metaphorically and literally. Right. And these rituals involving the sacrifice of. Of humans and eating of flesh and blood. Right. It's sort of this cross the board thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5987.53,"end":5987.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5987.93,"end":5989.53,"speaker":"Fr Stephen De Young","text":"Of demonic activity."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":5990.09,"end":6006.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so we've talked about werewolves and now we're going to. As you'll see, everybody, the line between that and we're about to talk about is actually kind of narrow at points. But in popular imagination, there's another thing called a vampire."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6007.34,"end":6007.74,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6007.98,"end":6027.98,"speaker":"Fr Andrew Stephen Damick","text":"You know, and most people think of like the whole Bram Stoker thing and Dracula, you know, who by the way, is a Romanian folk hero. But weirdly enough, vampires are a thing in, wow, a lot of cultures. So what's the deal with vampires?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6028.46,"end":6140.53,"speaker":"Fr Stephen De Young","text":"Yeah, it's also not a feat. People living in New Orleans or people who sparkle in the Sunlight. So basically at its root, to sort of boil it down and bottom line it, right, what, what we're categorizing here as under the category vampire is a demon possessed corpse, a dead human body that has been possessed by a demonic spirit, as opposed to a living person who has been possessed by a demonic spirit. And so what you find in this phenomena is people who have died in some sort of cursed state. Right. So whether this is in paganism, they were under some kind of curse or had done some kind of horrible evil in life that had brought a curse upon them, or once Christianity comes into the picture, this is people who died excommunicated, were buried in unhallowed ground. Right. This kind of thing that then opens up the possibility of this demonic possession. And there's also, because, as Father Edu just said, the line between what we're categorizing for sakes of this episode as vampire and what we're doing categorizing as werewolf is pretty thin. There's cannibalism and blood drinking involved with this too. And in fact, sometimes you find this fuse. Sometimes the people who come back as some kind of vampiric thing are people who were sort of demon possessed, werewolf types. Right. Catalyst types in their life, and then they die and continue this sort of demonic existence."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6140.77,"end":6155.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and there's. I mean, and in a lot of ways, vampires are kind of closely related to imagery having, you know, zombies, you know, a demon possessed corpse coming back that wants to eat humans on some level. Yeah, yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6155.73,"end":6258.87,"speaker":"Fr Stephen De Young","text":"And this is also, I mean, the stream of everything we talked about, demonic liliths in the first half all flows into this too. Right. So you have this thing called a strix, which is striga in Latin or strix with sort of a G and an X, the way it's usually transliterated from Greek, which was a night demon who eats flesh and drinks blood, particularly preys on infants. From that word is derived screech strigoi. In Romania and in the Balkans in general, the first person in history who we have who is sort of publicly labeled and written about as being strigoi was a fellow, I'm assuming, I'm assuming this pronunciation, my Croatian is rusty, shall we say. But it looks to me like Yuri Grando Alovich, who lived in Croatia in the mid 17th century, in the year 1672, 16 years after he died, he showed up in Istria, where he came from and came back. And was this demon possessed being that attacked people in the area until he was decapitated. By the village priest. And numerous people wrote about this at the time. This was the talk of Europe. This guy was the talk of Europe at the time. And much reported on."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6259.35,"end":6259.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6260.47,"end":6274.4,"speaker":"Fr Stephen De Young","text":"And so we mentioned the Balkans when. When you get into Greek discussions of these creatures, they're referred to as ricolakus. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6275.04,"end":6518.56,"speaker":"Fr Andrew Stephen Damick","text":"Which is not, you know, the. The proprietor of your local Euro stand. It's. Yeah, yeah. I. So I looked this up so I could see where the stresses were. Vricolakas mentioned by a number of modern Orthodox saints. Yes. Surprise, surprise, everybody. So Saint Cosmas Etolos, who's 18th century, he said this. This is a direct quote. When we hear the word devil, it is he who is once the first among angels. It is he who moves people to pride, to murder, to theft. It is he who enters into a dead person, causing him to appear living. And we call him a vrikolakas. So Saint Kuzmas says that the devil enters into a dead person, causing him to appear living. And that's called a vrikolakas, which often gets translated as vampire, but it's sort of like part the way between, again, vampire and werewolf and zombie. And then. Okay, so here's another one. So much, much more, even more modern saint, Saint Paisios the Athenite, who just died in the 1990s. So this is from the life of Saint Paisios by his. His disciple, Elder Isaac, who writes that. Writes this. The elder related quote. I knew an old woman who was very stingy. Her daughter was very good, and whatever she wanted to give his alms, she would throw out the window so she could leave the house with empty hands, because her mother would always check to see if she was taking anything. But if she told her mother that the monk, that is me, had asked for something, then her mother would be willing to give it up. After her death, I saw a young man, her guardian angel, and he said to me, come so and so wants you. I couldn't understand what happened to me, but we were standing in front of a grave in Konitsa. He moved his hand like this, and the grave opened. Inside I saw a grimy mess and the old woman who had started to decay, she was calling out, monk, save me. My heart went out to her. Feeling sorry for her, I climbed down inside and without being repulsed, I embraced her and asked, what's wrong? She said, tell me, didn't I always give you anything? You asked willingly? Yes, I said, that's true. All right, said the young man, soothing her. He moved his hand like this again. And closed the grave like a curtain. And I was back in my cell. The sisters from Surroti asked me, by the way, I'll just say it. Sroti is the town where the monastery that he founded and where he finished out his life was. And that's where he's buried, by the way too. So the sisters from Surati asked me, what happened to you on the feast day of St. Andrew? I answered, Pray for so and so's soul. Two months later, I saw her again. High above an abyss. There was a plateau with places, a lot of houses and many people. The old woman was up there. She was very happy with the face of a small child that had just a tiny spot that her angel was also scrubbing to clean off in the abyss in the distance, I saw people being beaten and harassed and trying to climb up. I embraced her out of joy. I took her aside a little so the people in the abyss wouldn't see us and be hurt. She said to me, come on, let me show you the place where the Lord has put me. So in this, St. Paisios is brought to the grave of this woman who was, you know, mostly evil in life, very stingy. And then he sees her as like this sort of animated corpse, decaying and so forth. And then through his prayers, she's brought to paradise on the feast of St. Andrew. Hey, the feast of St. Andrew. So that's a couple of modern saints that refer to things that are like what we're talking about. We're going to talk a little bit more about modern Greece and this, but there's a couple other things we wanted to mention that are connected with this. Right?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6519.19,"end":6615.13,"speaker":"Fr Stephen De Young","text":"Yeah. So this is. This is something that goes way back again, back to the Neolithic period. We have found in Neolithic burial sites, and it's only certain burials within a burial site. There will be certain burials where the remains were, like, weighted down or pinned inside the grave with, like, heavy things, like rocks and things somewhere they were nailed down. And again, this isn't like every grave in the site is that way. This is particular graves in the site. And only those particular ones and very common in the ancient world are to find, again, just some of them buried sort of facing down. The idea being that if they came back, they would, since they're facing down, they would go down into the underworld, down into Sheol, rather than coming back up to where living people were. Those are sort of the. The pagan, ancient pagan ways of handling it. But you see this being seen as a possibility right away in the Byzantine period. Because we start finding certain. And again, it's only certain Byzantine burial sites. Where there are these wax crosses that had the. What looks like, in English, an IC xc, which is actually sigma."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6615.21,"end":6615.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6616.49,"end":6626.01,"speaker":"Fr Stephen De Young","text":"And then Nika. Right. Jesus Christ conquers on a wax cross that was put on a body as a sort of a seal to protect it from demons."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6626.33,"end":6630.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sort of sigil or sign against demonic influence. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6630.9,"end":6641.3,"speaker":"Fr Stephen De Young","text":"Christ is sort of the symbol of Christ's victory over the demons. Right. That would prevent the demons from disturbing the remains or attempting to use the remains."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6641.62,"end":6642.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6643.3,"end":6644.74,"speaker":"Fr Stephen De Young","text":"But the clearest thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6645.14,"end":6645.94,"speaker":"Fr Andrew Stephen Damick","text":"Oh, boy."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6646.5,"end":6649.3,"speaker":"Fr Stephen De Young","text":"That Father Andrew's gonna get to read."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6649.7,"end":6652.02,"speaker":"Fr Andrew Stephen Damick","text":"I'm so excited about this. You have no idea."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6652.18,"end":6653.56,"speaker":"Fr Stephen De Young","text":"You didn't see this coming, did you?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6653.63,"end":6659.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I did not when you sent this to me, as. This is great. So amazing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6659.47,"end":6674.35,"speaker":"Fr Stephen De Young","text":"In 1867, this little book called the Nomo Canon was issued to all of the orthodox priests in Greece. And it had. It's sort of like a small book of needs kind of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6674.43,"end":6674.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6674.79,"end":6690.01,"speaker":"Fr Stephen De Young","text":"It had. It had canonical rules for how to do certain things. And procedures for handling certain things canonically. And there's a section which Father Andrew is about to read. Which is called concerning those who Burn Vricolakas."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6691.53,"end":6837.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So this is what it says. Those who have burned vricolakas. And were coated in their smoke. Should not receive communion for at least six years. Vrykolakas are submissive instruments of the devil. Who appear at night, wandering to and fro, harming, destroying, and predicting the future. These are those who are many days or even many years dead. And return among the living as one who is young, with flesh and bones. Thus, when these people hurried to burn the dead. Having exhumed them and seen the vrikolakas filled with blood. With long hair and long nails. They should have known that his accursed relics would be resurrected again on the day of Judgment. When he would stand before the dread and impartial judge. Then he would be sent to the outermost eternal fire. Damned for eternity unless he truly repents of his impiety. When this kind of satanic demon is identified. The priests should have been called to perform a supplicatory canon to the Theotokos. And a blessing of the waters. Then they would serve a divine liturgy. And ask the help of the panayia for all of the people. And also celebrate a memorial service with koli va. Chant the exorcisms of the baptismal service. And the exorcism Prayers of St. Basil the Great. And sprinkle the entire community with holy Water. Pouring the remaining holy water on the vrikolakas. By God's grace, the demon will flee. So before we discuss this, I just want to point out that even if you were to say that, for instance, when St. Cosmas was talking about this phenomenon, that he was just sort of passing on some kind of tradition he knew about, or that St. Paisios was just having, like, a vision. I mean, you could explain what they said in those terms. This is a book of instructions to priests telling them what to do. Number one, if someone was going around burning the bodies of these people, and number two, what should be done instead of this kind of vampire hunter thing that was going on? So, I mean, this is. This is very. This is. This is. These are solemn instructions. Like, this is."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6837.36,"end":6837.72,"speaker":"Fr Stephen De Young","text":"This is."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6837.72,"end":6875.5,"speaker":"Fr Andrew Stephen Damick","text":"These are liturgical instructions. You know, like, this is not, you know, book of crazy things that priests should know about. This is, you know, instructions. Yeah. Like I said, these are liturgical instructions. This is a part of a manual. Right. So it's very clear. And it's not just like, you know, do exorcisms, whatever, but even includes this definition of what this. What this is, that these are human corpses that are inhabited by demonic presence and that come out of their graves and. And, you know, do bad things. Right. So, okay. Right, yeah. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6876.38,"end":6884.18,"speaker":"Fr Stephen De Young","text":"So, yeah. Okay. It's important how this is phrased, too, once you get past the initial. Like what? Right, yeah, Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6884.18,"end":6887.42,"speaker":"Fr Andrew Stephen Damick","text":"Which I'm still kind of there, but I've read this, like, 10 times now."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6888.06,"end":6905.8,"speaker":"Fr Stephen De Young","text":"Yeah. So, right. How is this phrase. Right. Concerning those who burn freakaloccas. Right. So the problem, from the perspective of this text, the problem is that there are people going around burning these bodies."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6906.92,"end":6908.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Digging them up and burning them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6909.16,"end":6930.66,"speaker":"Fr Stephen De Young","text":"That's the problem that this is. Is set out to address. Right. So taken for granted is the idea that there are these people who, through living an evil way of life, have ended up becoming these monstrous things, these monstrous dead things. Right. You didn't end up this way accidentally."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6931.3,"end":6931.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6933.46,"end":6956.58,"speaker":"Fr Stephen De Young","text":"They become these ones, and these monsters are menacing the community. Right. And the problem from the perspective of this text, then, is that in many of these communities, the response to it is for these people to go and identify the person who has become this monster. Destroy them. That's the problem."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6957.22,"end":6957.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":6957.86,"end":7032.42,"speaker":"Fr Stephen De Young","text":"Because what should happen, according to this text is what? That the community, the community that's being menaced by this monster, by this formerly human monster, needs to gather together and they need to pray to God for the soul of this person to try to drive out the demon and redeem this person, which they can't do if someone has burned them. Right. And so burning one of these gets you six years excommunication. Right? That's like murder. Right? This is seen as like murdering that person's soul by this text. And so that that to me is the key thing here is that, you know, you don't go and try to destroy the monster that's menacing your community. Your community gathers together to repent on behalf of that person because they're dead and they can't repent anymore. And to seek that that formerly human monsters salvation somehow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7036.24,"end":7043.2,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, with that, we are now going to go to our next break. And we will be right back with the third half of the show."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7044.08,"end":7060.38,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7067.42,"end":7118.04,"speaker":"Announcer","text":"Ancient Faith Publishing presents I Live a memoir of Ileana, Princess of Romania and archduchess of Austria, who in later life became Mother Alexandra, founder of the Orthodox Monastery of the Transfiguration in Pennsylvania, who wrote this memoir shortly after relocating to the US in the 1950s. It tells the story of a life full of suffering, tragedy and exile, but all is suffused with the author's deep faith, hope, love and even joy. This reprint includes additional material collected by the nuns of her monastery that sets the memoir in the context of Mother Alexandra's later life. To find this book and others like it, you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7118.04,"end":7133.04,"speaker":"Steve","text":"The Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7135.09,"end":7226.87,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everyone. We're going to take a couple of calls, but first, I wanted to just mention something that I think a lot of you out there are going to be into. So, you know, we've made reference a number of times on the show to our friend Jonathan Pageau's work on the symbolic world. And so I wanted to mention a new project that he's got coming out that I think is going to especially appeal to you Lord of Spirits listeners. It's a graphic novel that's called God's Dog. Now, this isn't an ad, but it's Just something that's really relevant that I think you guys are gonna like. He actually sent me a draft of the piece. I read through it. It's really cool, actually. Cool art, interesting writing. It's a fantastic and kind of imaginative weaving together of stories and figures from Christian tradition, including, Yep, the Nephilim, St. George, St. Simon the Stylite, and of course, St. Christopher. And, you know, of course, very relevant to tonight's episode. So, anyway, so Jonathan has a crowdfunder that's going up in just a few days. You can learn about God's dog and sign up for updates@gillsdog.com. so it's godsdog.com the Crowdfunder starts up on October 31st. But you can. Like I said, you can sign up for updates. All right, well, we do have some callers waiting on the line, and. And first is Jules. So, Jules, you've been waiting very patiently for a while, so welcome to the Lord of Spears podcast."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7228.23,"end":7229.11,"speaker":"Deacon","text":"Thank you, Father."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7230.95,"end":7232.55,"speaker":"Fr Stephen De Young","text":"Oh, man. It's this guy."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7234.63,"end":7236.71,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Okay, I guess we know each other."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7240.31,"end":7243.75,"speaker":"Deacon","text":"I thought for the sake of professionalism, we were going to pretend like we didn't know each other, but."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7243.75,"end":7243.99,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7243.99,"end":7247.43,"speaker":"Fr Stephen De Young","text":"Oh, no, no. I'm about to roast you in front of, like, 12,000 people."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7248.77,"end":7250.13,"speaker":"Fr Andrew Stephen Damick","text":"Wow, this is exciting."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7252.69,"end":7258.45,"speaker":"Deacon","text":"You know, I was gonna say something nice. I was gonna say after the last bit, you know, I just became even more pre modern than I usually was."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7259.97,"end":7260.65,"speaker":"Fr Stephen De Young","text":"Well, that's good."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7260.65,"end":7262.13,"speaker":"Deacon","text":"But I do have an actual question."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7262.77,"end":7263.33,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7263.57,"end":7335.5,"speaker":"Deacon","text":"So you guys are talking about, with respect to vampires, like, a possessed dead body. But I noticed that there's a lot of myths and stories where you'll see sort of like an innocent passerby who gets abducted in the night or walks, like, wrong side of the woods, and then they get, you know, they get abducted and turned into some kind of monster. And I think the example I wanted to go with was there's the vampire myth of Sava Savanovich. I think I mentioned this a couple times, but where I'm not gonna say the whole myth, because that's gonna take forever, but there's basically, you know, a woman who marries this young man, and they live in the middle, and the vampire usually used to live in the mill. And, you know, the woman sleeping one night, and the moth, there's like a moth that is the vampire that just enters into her mouth, and then that's all it takes to just turn her into a vampire herself. And so I'm kind of curious about that sort of thing where you have these sort of innocent people who didn't really live these. Like, it's at least not described as them living these sinful lives, but these monsters still get a hold of them and turn them into something demonic. Like, what's going on there."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7337.98,"end":7346.5,"speaker":"Fr Andrew Stephen Damick","text":"Father, since this is the guy you're gonna embarrass in front of 13,000 people, I thought."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7346.5,"end":7352.38,"speaker":"Fr Stephen De Young","text":"There was one place where I wouldn't have to answer his questions. And even though it's not safe anymore. No."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7352.78,"end":7354.98,"speaker":"Fr Andrew Stephen Damick","text":"I assume he's local to you, I think."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7354.98,"end":7355.42,"speaker":"Fr Stephen De Young","text":"I guess."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7356.24,"end":7356.8,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7356.96,"end":7358.24,"speaker":"Fr Stephen De Young","text":"All right, all right. Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7358.4,"end":7360.12,"speaker":"Fr Andrew Stephen Damick","text":"So this is love, then. That's good."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7360.12,"end":7376.16,"speaker":"Fr Stephen De Young","text":"He is. He is my prodigal, spiritual son, in fact. But so, yeah, so part of this is related to the answer we gave to a caller in the last half when you probably weren't paying attention."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7377.2,"end":7378.24,"speaker":"Fr Andrew Stephen Damick","text":"Where. Wow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7379.92,"end":7390.02,"speaker":"Fr Stephen De Young","text":"No, where there's this tendency. This is another place where paganism kind of tries to creep back in, Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7390.18,"end":7390.58,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7394.18,"end":7525.91,"speaker":"Fr Stephen De Young","text":"Sometimes, I mean, the way you've described the myth, I think it's this. Sometimes it's an idea of like, well, you need to conduct yourself in a certain way. This is more like St. Jerome's idea with the Lamia, right? You need to conduct yourself in a morally pure way in your life in order to be safe from these things. Right. Or something bad might befall you. But more often than not, we. We get into the mode of that paganism is creeping back in and saying, well, you need to do xyz, right? Eat a lot of garlic, right? Or, you know, do. Do these. What are usually ancient pagan practices and charms and that kind of thing in order to protect yourself from these demonic spirits and demonic creatures. Because otherwise, even if you're an innocent person, you may. May fall victim to them. And that ends up becoming a sort of more subtle temptation in its own right, in that it's tempting you to put your trust in those kinds of. What's really techniform of technique, a form of know how, even though it's magical, know how to try to protect yourself and control the world around you and your environment, rather than trusting in Christ and remaining faithful to him and having that as sort of your protection. And so the particular casting of a lot of those stories is where some of those old pagan things try to try to keep. Creep back in. And while it's subtle in a story like that, I mean, there were unsubtle forms of this in the ancient world. Like when. When the western half of the Roman Empire was collapsing, there was a huge move by the pagans, saying, this is because you Converted to Christianity. We need to go back to the pagan gods and then they'll. They'll save the Western Roman Empire. This isn't that sort of gross and unsubtle. It's a more subtle way for those same pagan rituals and traditions and things to kind of come try and creep back in under the radar and distract people from Christ and faithfulness more subtly."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7528.47,"end":7529.51,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7531.19,"end":7532.71,"speaker":"Deacon","text":"Yes, it does. Thank you, Father."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7533.03,"end":7536.39,"speaker":"Fr Andrew Stephen Damick","text":"All right, thank you very much for calling. Jules. I think you got off pretty well."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7538.07,"end":7541.03,"speaker":"Fr Stephen De Young","text":"Yeah, I went easy. It's in public. I went easy."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7541.35,"end":7548.19,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay. All right, we're going to take one more call, and that is Sarah. So, Sarah, are you there?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7549.31,"end":7571.8,"speaker":"Sarah","text":"Yes, I am here. My question is pretty basic. It's just. It's just wondering where in this discussion we put legends like Bigfoot, the yeti, the Abominable Snowman, just these giant beast creatures, are they just kind of another offshoot of the werewolf tradition or are they kind of their own unique thing?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7573.32,"end":7655.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, to me, it's interesting that they're often depicted as giants, right. That they're, you know, physically large and. But yeah, I mean, it's. To me, it seems like it's a merging of that. Of giant stuff along with werewolf stuff. They're sort of halfway between either wolves or bears and people. Right. You know, like this. This actually gives the opportunity to kind of mention one thing. Right. We sometimes refer to pagan stories as being demonic propaganda, and they kind of are. But there's also a layer of just human beings interacting with this stuff, you know, in ways that then it gets recorded in a particular way. And so, like, in this case, what's. I would say that the understanding is that there's these phenomena that people are aware of, but then the way that the stories get told manifest themselves as these creatures like this. Right. That there's this beast man that's out in the wilderness who's ready to maybe eat people or do violence in some way or another like that. So, I mean, that's kind of my take on that. So, Father, I don't know, do you have any actuallys or expansions or whatever on any of that stuff?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7656.67,"end":7774.67,"speaker":"Fr Stephen De Young","text":"Well, with. With Sasquatch and yeti in particular, what tends to get left out. Right. And leaving this out helps assimilate it to more of a werewolf type thing is that you especially see this with the yeti, but you see this with some of the Native American stuff regarding Sasquatch also is that the yeti is actually sort of the wise man of the wilderness. Right. That these weren't sort of seen as bestial creatures, but they're seen as sort of these ancient creatures that had this kind of ancient wisdom about them. Right. That, that they were in touch with something maybe that, that humans weren't or they occupied this kind of weird semi divine ground, even though they're kind of bestial at the same time. And so, yeah, I think, I think that's an important element that sometimes gets left out because, you know, you see a horror movie with a Sasquatch or on the other end you see Harry and the Hendersons, but. And we tend to think of them as creatures or as some kind of ape or some kind of caveman or that kind of thing. But the, the more ancient stories about them is always that, you know, you, you would go seek the yeti in Tibet because it had some kind of, in some cases even antediluvian kind of wisdom about it, you know, that it might be able to impart to you. Or it's sort of like, sort of more like Humbaba, if you're familiar with the Epic of Gilgamesh at all, in the cedar forests of Lebanon. Right. Who's sort of this creature favored by the gods. There's a little more of that element to it, I think, that is missing from some of the werewolves. So they're not clearly human in the way that like werewolfism is, is a human who's entered into this kind of relationship with the spirit."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7776.43,"end":7777.95,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense to you, Sarah?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7778.51,"end":7782.51,"speaker":"Sarah","text":"Yes, that does make sense. And then is there time for a quick follow up question?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7782.91,"end":7783.31,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7783.63,"end":7785.55,"speaker":"Fr Stephen De Young","text":"Is it about El Chupacabra?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7787.79,"end":7805.34,"speaker":"Sarah","text":"No, it's more about the werewolves, like going back of why is there a reason that the wolf form gets harped on? Like it's, it's not like a were beast, it's, it's. There seems to be this theme of wolf specifically. Yeah, you do see a linguistical thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7806.22,"end":7831.16,"speaker":"Fr Stephen De Young","text":"You do see some bear stuff mixed in there in the Indo European. But the, the wolf across the board is by far the most predominant. That may be related to dogs, which of course are related species, being one of the earliest domesticated animals. I'm partially conjecturing here."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7832.92,"end":7922.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, and well, and also like, you know, human interactions with wolves legendarily especially are, you know, not good. Like, especially human beings traveling in the wilderness and that kind of thing. And you know, wolves especially when they, they go in packs can be particularly dangerous. But then there's also, at the same time is, there's the, that especially wolves in North America, for instance, can act in a very solitary way, but they're huge. I mean, if you've ever seen a wolf in person, they're big, big animals and very scary. So even though they. They in sort of their. Their natural sort of biological state, often will avoid people and are therefore not that dangerous, people who encounter them, you know, are rightly kind of scared because of how big and scary they can be. But, yeah, it's just. It's really just this prototypical sense of a violent beast, you know, bestial, you know, presence amongst human beings. And, you know, it's not that people who gain this sort of demonic ability become wolves. It's that human beings understand what's happening to them as being in a wolfish way, if that makes sense. Like, this is the way that it gets talked about. It's not that they become that animal, you know, in reality. Yeah. Because a human being cannot take on the nature of a wolf."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7923.84,"end":7926,"speaker":"Fr Stephen De Young","text":"Right. It's a. It's a predatory thing."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7926.4,"end":7927.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7927.2,"end":7930.72,"speaker":"Fr Stephen De Young","text":"It's about predation, and bears aren't predators of the way a wolf is."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7931.44,"end":7936.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yep. That's true. How does that work for you, Sarah?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7937.2,"end":7937.56,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7937.56,"end":7940.08,"speaker":"Sarah","text":"No, that was perfect. That was very helpful. Thank you."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7940.32,"end":7952.2,"speaker":"Fr Andrew Stephen Damick","text":"Great. All right, well, thank you very much. I said we were. That. That Sarah was gonna be the last call we're gonna take, but we actually have a Deacon calling in who has an urgent question about the Nommo canon having to do with Vrykolakas."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7952.76,"end":7957,"speaker":"Fr Stephen De Young","text":"So is he facing this situation as we speak? I don't know."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7958.12,"end":7968.84,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. But we're gonna let him in under the wire before we talk about demon possession. So how about that? All right. So. Deacon, are you there?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7969.4,"end":7970.16,"speaker":"Unregistered: James","text":"I am here."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7970.16,"end":7970.6,"speaker":"Deacon","text":"Hello?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7971.08,"end":7976.95,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome. Okay, so what's your deal, Deacon?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7977.5,"end":7989.82,"speaker":"Deacon","text":"Well, so my original. Well, some people know I'm a vampire scholar myself, and I was originally Canons, but you guys kind of covered the question I was going to ask, so I had something different. It might be related to what you're going to talk about."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7990.46,"end":7991.98,"speaker":"Fr Andrew Stephen Damick","text":"All right. Laid on us."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":7992.86,"end":8017.74,"speaker":"Deacon","text":"I did a lecture once on heresy and exorcisms and vampires. And this thought that most of the time when these vampires appeared, but they weren't necessarily seen, they were just found in the grave, you know, incorrupt. So you think that the demons might have chosen that form of an incorrupt body to. Because holy people were usually incorrupt."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8019.5,"end":8020.38,"speaker":"Fr Andrew Stephen Damick","text":"Like. Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8020.38,"end":8021.26,"speaker":"Deacon","text":"With the saints."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8021.74,"end":8031.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, It's a kind of parody of holiness, you know. Yeah. I mean, that. That makes sense to me. I don't know, Father, what do you got on that?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8031.84,"end":8048.72,"speaker":"Fr Stephen De Young","text":"Yeah, I think there's. There's that element. And, you know, if you've read all this stuff, then you probably already know this. But part of what happens then once the. The demon is sort of dispelled is that the body decomposes normally."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8050,"end":8050.4,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8052.88,"end":8058.12,"speaker":"Fr Stephen De Young","text":"And that's connected to, of course, you know, our bodies. You know, ashes to ashes, dust to dust."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8058.12,"end":8058.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8058.56,"end":8097.82,"speaker":"Fr Stephen De Young","text":"Our. Our bodies return to the earth from whence from which they were formed. And so there's. There's an element there also of sort of what is natural, not being allowed to take its course, that there's this unnatural thing, that this. This demonic spirit is sort of rebelling against the natural order that God has set up for our life in this world. Right. Where we are mortal. But it's. Again, it's not actual resurrection or actual continued life. It's just this parody of it. Right?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8097.82,"end":8099.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. False life."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8099.9,"end":8106.06,"speaker":"Deacon","text":"Usually. It was just a misunderstanding of medicine. You know, they didn't. People didn't know how bodies decomposed back then."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8106.7,"end":8107.18,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8107.82,"end":8113.57,"speaker":"Deacon","text":"They viewed everything as something supernatural when it was really all bodies bloat and leak and things like that."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8114.12,"end":8119.32,"speaker":"Fr Stephen De Young","text":"Yeah, but sometimes. Sometimes it is. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8119.8,"end":8121.08,"speaker":"Deacon","text":"Sometimes it's giants."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8124.44,"end":8142.99,"speaker":"Fr Andrew Stephen Damick","text":"It's not always giants, but sometimes it is giants. All right, well, thank you very much for your call. Okay, well, this is the final half of the show tonight. We've gone on for a while, but we wanted to talk a little bit about demon possession and about King Solomon's magic ring. So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8144.03,"end":8152.35,"speaker":"Fr Stephen De Young","text":"Yes, do your thing. Yeah, I'm digging in the crates with the references tonight."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8153.55,"end":8154.63,"speaker":"Fr Andrew Stephen Damick","text":"One ring to rule."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8154.63,"end":8157.43,"speaker":"Fr Stephen De Young","text":"No, sorry, too obvious. Way too."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8157.43,"end":8164.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, too obvious. But I mean, super, super applicable in this particular case, as everyone will see in just a second. So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8164.27,"end":8218.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So we've talked about demon possession at several points along the way on the show. We talked about how that was seen in the ancient world in many cases in a positive light. I mean, like, we talked about with werewolves, that werewolfism was even seen in sort of a positive light very early on in a lot of pagan contexts. But, you know, we gave the example before of Socrates, who had this demon that wished whispered wisdom to his soul, and that was part of his defense. I'm getting this from a demon, guys, you know. Oh, okay. Let him go then. Yeah, so, I mean, this was seen in a very different way, and we see that reflected, of course, as we mentioned before in the Book of Acts, when there's the slave girl who is possessed by the demonic spirit who tells fortunes. Right. Like we saw one of the things that the recoil, I guess does is predict the future."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8218.35,"end":8218.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8220.03,"end":8246.67,"speaker":"Fr Stephen De Young","text":"Is possessed by demonic spirit. And St. Paul casts out the demonic spirit. And then the owners get mad at him because the owners of the slave girl get mad at him because they. They say, you know, how dare you? This is how we made our money. You know, and even. Even some modern Episcopalians think that was a horrible thing to do to her because that's what made her unique and special to. To go back to that point was being possessed."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8246.75,"end":8250.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes. You're not making that up. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8252.43,"end":8273.14,"speaker":"Fr Stephen De Young","text":"So this isn't a case where Christianity comes along and starts talking about people being demon possessed. Right. There's this phenomenon of people being possessed by spirits. Right. And Christianity comes along. Well, Second Temple Judaism, and then Christianity come along with a different interpretation of that same phenomena."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8273.69,"end":8275.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8276.41,"end":8297.77,"speaker":"Fr Stephen De Young","text":"And so we've talked about that before. So that was just sort of a quick review, but sort of a related element of this now that we see play out in a lot of stories about saints has one of its points of origin, at least in a. A text called the Testament of Solomon."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8298.01,"end":8313.93,"speaker":"Fr Andrew Stephen Damick","text":"And. And we should probably say right at the outset, we're not saying this is some kind of canonical scriptural text. We're not saying that anyone should regard this as anything but a really interesting text about some weird stuff. Yes, yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8313.93,"end":8326.39,"speaker":"Fr Stephen De Young","text":"This is definitely. This is. We've talked before about how. I'm sure we've talked before on this podcast about how in the east there were three categories of books."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8326.54,"end":8326.94,"speaker":"Fr Andrew Stephen Damick","text":"Books."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8326.94,"end":8334.14,"speaker":"Fr Stephen De Young","text":"Right. That there were books to be read in the churches, which is what we would call canonical. There are books to be read in the home."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8334.86,"end":8335.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8335.18,"end":8338.46,"speaker":"Fr Stephen De Young","text":"And then there are books not to be read because they're, like, heretical."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8338.54,"end":8345.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. And this is kind of on the. It's somewhat on the edge of the things you can read at home kind of text. Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8345.1,"end":8368.2,"speaker":"Fr Stephen De Young","text":"So. Yes, so that's what I was going to say. So some of the texts we talk about on this show, like for Ezra or the First Book of Enoch, and those kind of things are sort of on the borderline of what's read in the church and what's in the home, because some churches view them as canonical and some don't."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8368.6,"end":8369,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8369.32,"end":8377,"speaker":"Fr Stephen De Young","text":"So kind of on that borderline. The Testament of Solomon that we're about to talk about is on the borderline of read in the home and not read at all."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8378.2,"end":8379.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8379.53,"end":8382.45,"speaker":"Fr Stephen De Young","text":"Not a recommendation we should Take this."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8382.45,"end":8390.33,"speaker":"Fr Andrew Stephen Damick","text":"As a really interesting story that reflects certain motifs that we find."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8390.33,"end":8409.88,"speaker":"Fr Stephen De Young","text":"Yeah, there's a motif. We're going to run through this book quickly to highlight a single motif within the book and then talk about how that motif plays out within the Orthodox tradition. We are not saying that this text is in any way a part of the orthodox tradition. Yep, 83 disclaimers now finished. Okay."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8412.52,"end":8415,"speaker":"Fr Andrew Stephen Damick","text":"Delete that angry email you were working on, folks."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8415.32,"end":8415.8,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8417.48,"end":8417.88,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8420.36,"end":8466.74,"speaker":"Fr Stephen De Young","text":"This text also has. Just last Sunday we read. Once again, we read it a lot. But this time we read it from St. Luke's Gospel, the story of Legion running around in the tombs. Right? So demon possessed man is where. He's out in a graveyard. He's out in the ruins. That's where the demons are. This is the. This text is the other place where Legion shows up. So. But we'll get to that in a minute. So this, the Testament of Solomon, is a text that is probably. I mean, again, journal articles, dissertations. So we argue about it, but pretty much everybody agrees that this is late 1st century, early 2nd century in air quotes, Christian text."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8467.22,"end":8467.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8468.5,"end":8519.19,"speaker":"Fr Stephen De Young","text":"And by Christian, it just means this person is aware of Christianity. Right. It's not saying this person is Christian in any kind of apostolic sense. And we'll get to why here in a minute. But what this is doing is it's taking the story of Solomon from the Old Testament and then interpolating with it a lot of Greek and Jewish magic, like literal magic. Right. Traditions and superstitions and that kind of thing. Right. So there's a lot of pagan stuff in here is the short way of saying that. So in this book, at the beginning of the book, this angel shows up and gives Solomon this magic ring with a pentagram on it already. I know, right? We're not endorsing this."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8519.19,"end":8519.71,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8521.79,"end":8528.83,"speaker":"Fr Stephen De Young","text":"And what this ring allows Solomon to do is enslave demons as well."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8529.31,"end":8531.07,"speaker":"Fr Andrew Stephen Damick","text":"It is a ring to rule them all."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8531.07,"end":8545.58,"speaker":"Fr Stephen De Young","text":"Yes. He could use this ring to enslave demons. And so he enslaves a couple of demons, he ends up enslaving Beelzebul. Right? Who's baal? Who's the devil? Who's the prince of demons? Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8545.82,"end":8546.78,"speaker":"Fr Andrew Stephen Damick","text":"Lord of the Flies."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8546.94,"end":8550.7,"speaker":"Fr Stephen De Young","text":"Yeah. He ends up. Well, no, this is Baal's a bull. This is the original title."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8550.7,"end":8551.02,"speaker":"Fr Andrew Stephen Damick","text":"Not."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8551.02,"end":8568.06,"speaker":"Fr Stephen De Young","text":"Oh, excuse me, not the making fun of him version. Okay, so, but because now he's got, like, the demon boss. So now he's kind of got all of them now that are on the payroll working for him, subcontractors as it were. Yes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8568.46,"end":8570.29,"speaker":"Fr Andrew Stephen Damick","text":"So, wow. Okay."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8570.77,"end":8595.01,"speaker":"Fr Stephen De Young","text":"Solomon. Now, most of the text of the book is then Solomon sort of having chit chats with all of these different demons. And these demons are mostly less than impressive. These are kind of like the Bob Larson demons, if you've ever watched him exercise. Demons from middle class housewives, as is his want."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8595.35,"end":8600.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The demon of sore throats. The demon of there is spells. The demon."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8600.67,"end":8609.27,"speaker":"Fr Stephen De Young","text":"Yeah, there's literally a demon of like sore throats who he talks to. And he would then ask them like."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8609.27,"end":8609.67,"speaker":"Fr Andrew Stephen Damick","text":"Hey."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8611.43,"end":8625.34,"speaker":"Fr Stephen De Young","text":"What do we do to ward you off, demon of sore throats. And the demon of sore throats is like, well, you write this Greek word on a leaf and then you put it in a pile of leaves and then I won't be able to come and give you a sore throat. Like. So that's the level of this text."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8625.98,"end":8626.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8626.86,"end":8656.94,"speaker":"Fr Stephen De Young","text":"Not super worthwhile. So it's a lot of folk remedies and magic and this kind of thing. Right. So there's a couple other interesting little bits. So he goes and he catches Legion in a bag out of the desert, as one does. Yeah. And he explains why, what the whole my name is Legion thing means. Because he says it's because he's got a bunch of other demons who are like his boys, who he brings with him every place."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8657.26,"end":8660.86,"speaker":"Fr Andrew Stephen Damick","text":"So it's like a Roman army unit is what he's. Yeah, yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8660.86,"end":8701.35,"speaker":"Fr Stephen De Young","text":"And he's described as being lion shaped, which is presumably because of the lion banners that the Roman legions used. And then there's this bit. This is why they say whoever wrote this or whoever edited it at some point had some knowledge of Christianity, is because Solomon asked Legion, like, well, who's the angel who wards you off? Right. His usual thing. And Legion says, oh, there's no angel that can warn me, ward me off. Only one who will come and will suffer many things, obviously talking about Christ. Right. So he's obviously sort of like quote unquote, predicting the story that we read in St. Luke's gospel."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8701.43,"end":8701.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8703.27,"end":8708.71,"speaker":"Fr Stephen De Young","text":"So whoever it was was familiar with Christianity even though he was into other. All this other wonky."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8709.03,"end":8709.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8709.75,"end":8729.51,"speaker":"Fr Stephen De Young","text":"Stuff. Folk remedies. And so Solomon uses some of these enslaved demons to build the temple for him because you got to lift all these heavy stones and stuff, you know, and so there's sort of an ancient aliens elements element to this. We're like, who could have possibly built that? It must have been demons."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8729.51,"end":8733.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm not saying it was aliens, but it was demons. Yeah, yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8734.44,"end":8777.43,"speaker":"Fr Stephen De Young","text":"And he at one point he's trying to get one of the pillars for the temple, and for some reason it's at the bottom of the Red Sea. It's not quite explained. So when he pulls it out of the Red Sea magically, he also releases this ancient Egyptian demon that was trapped down there at the bottom of the Red Sea, who was the one who gave the magicians in Egypt their powers and who got stuck there when Pharaoh and his armies got drowned man. So Solomon sort of enslaves him too and makes him install the pillar. But so anyway, right. And I'm making light of all this on purpose because it's weird and goofy, right?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8777.83,"end":8778.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8778.71,"end":8819.27,"speaker":"Fr Stephen De Young","text":"And not to be taken super seriously, but at the end, Solomon meets a woman. So you come full circle back to Lilith, being his wife, meets this woman and really wants to lie with her. The text is kind of explicit on this point. It's not like he fell in love with her, he wants to lie with her. It's just. Yeah, so, yeah, makes. Makes her one of his wives and then because of sort of his lust, he loses all of his demon controlling powers."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8820.87,"end":8821.43,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8822.79,"end":8844.38,"speaker":"Fr Stephen De Young","text":"So the end of the book is sort of this cautionary tale, right. Like the end of Johnny Cash's Delia's Gone, where he sort of turns to the camera and breaks the fourth wall and says, hey, don't do what I did and let your lust make you lose your demon controlling powers."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8846.86,"end":8847.66,"speaker":"Fr Andrew Stephen Damick","text":"Wow. So."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8848.62,"end":8865.1,"speaker":"Fr Stephen De Young","text":"So again, we're not endorsing or recommending really this text, but. But this is one of the first incidents we have of this motif of a holy person, because of their personal holiness, being able to command or control demons."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8865.72,"end":8906.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I found recently this icon of St. John of Novgorod, who is a 12th century Russian bishop. And the icon is of him riding what looks like a pegasus, a winged horse, except you look closely at it like it's a serpentine winged horse. It has claws and a pointy dragon tail. And it turns out that the story is that while he was praying that this demon wouldn't leave him alone. And so he turned around and then he forced the demon to become this winged horse thing to take him on a day trip pilgrimage to Jerusalem and back to where he was in Novgorod. So it's one of those kind of things, like, stop it, demon. Okay, well, you're working for me now for at least a little while."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8907.86,"end":8915.46,"speaker":"Fr Stephen De Young","text":"Right? Right. And there are stories of like a monk who forced a demon to sing one of the hymns of Paradise."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8915.86,"end":8916.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8917.06,"end":8928.98,"speaker":"Fr Stephen De Young","text":"The whole thing we talked about last year with St Nicholas enslaving Krampus or Schwartzpia or Bill Snickel. Yeah, all of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8928.98,"end":8929.5,"speaker":"Fr Andrew Stephen Damick","text":"All of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8929.5,"end":8940.46,"speaker":"Fr Stephen De Young","text":"All of these kind of things. And like, with Solomon in this river, it's. While he's sort of holy, he has this ability. As soon as he becomes lustful and gives in to sin, he loses it."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8941.1,"end":8941.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8941.5,"end":8991.54,"speaker":"Fr Stephen De Young","text":"Right. So this is because of personal. And this is really. Ultimately, this whole motif is flowing out of what we see back in Genesis 4, when Cain is angry at his brother and God comes to him and says, sin is crouching at your door. Like this demon, it wants to master you. You must master it. Right, Right. And so what we're seeing in the lives of these saints, what this is about is not about, like, hey, you can make demons do tricks, right? Like, it's about the fact that because of their holiness and their way of life and having drawn close to Christ and being conformed to the image, they now have mastery over the power of darkness rather than the powers of darkness having mastery over them. So this is the inversion of demonic."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8991.54,"end":8996.06,"speaker":"Fr Andrew Stephen Damick","text":"Possession possessing demons rather than being possessed by them."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8996.3,"end":8997.5,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":8998.22,"end":8998.7,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9000.38,"end":9000.86,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9002.94,"end":9013.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. I mean, it's interesting that this whole episode is kind of about giants on some level, too. Even though, again, it's not about, like, tall people. It's not about tall people."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9013.51,"end":9018.23,"speaker":"Fr Stephen De Young","text":"It's not about tall people because. Yeah, because when."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9018.23,"end":9018.63,"speaker":"Fr Andrew Stephen Damick","text":"When."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9018.95,"end":9025.75,"speaker":"Fr Stephen De Young","text":"When the demons master you, you become less human and more like a beast, more like a monster."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9026.31,"end":9026.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9027.19,"end":9040.71,"speaker":"Fr Stephen De Young","text":"And when you become like Christ, you don't just become like God, you do become like God because Christ is God, but you also become more human because Christ is both where we see who God is and where we see what a human person is."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9041.19,"end":9128.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know, and there was one thing, you know, when I was. When I was, you know, trying to connect with some of the research for this episode, one of the things I ran across was this legendary account about Cain getting killed. Right. I mean, because the biblical text does not mention Cain's actual death, but it does mention Lamech, you know, who is his descendant either bragging about that he has killed people, or apparently in some. Some readings of the text, it's that he. He, He. He's. He's saying he's super prone to violence. Like, he's boasting that he's ready to kill people, including, like, you know, a boy. But either way, there's this legend about Lamech hunting out in the woods along with his son, Tubal Cain, and that they see, like, a rustling in the bushes and. And it looks like an animal and so Lamech shoots him with an arrow, and it turns out that it's Cain. And the reason why they didn't realize that it was Cain is because he looked bestial, that he looked like a beast. So there's this theme of human beings becoming bestial as they get demonized, as they become sinful, you know, so it's. It's interesting just how fractally this kind of plays out across cultures, across legends, across time, across geography. It's crazy, right? Yeah."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9128.35,"end":9169.61,"speaker":"Fr Stephen De Young","text":"And so to reiterate and sum up, when we. When we talk about giants as giants or any of the things we talked about tonight, giants are at the far end of that spectrum. It's not just tall people. It's not people who were born tall. It's not a genetic thing. It is people who have. Through the conduct of their life, through the rituals they have participated in, through the worship and relationships and fellowship, they've formed with demons, become demonized to the extreme. Right. They are at the far, far other extreme from the saint. Saints who have become like Christ."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9170.65,"end":9170.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9170.97,"end":9183.85,"speaker":"Fr Stephen De Young","text":"They represent the far negative end of human possibility. Right? Of what it is to cease being human, become inhuman, to become a monster, as opposed to becoming more human and being formed of the likeness of Christ."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9184.33,"end":9244.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay. Well, we're going to give our final thoughts. So, I mean, I think the bit that really hit me the most in this episode was the thing about the vricola. Cause, you know, Greek vampires, zombie werewolves. And the reason why it hit me is not because, like, monster stuff is cool or whatever or like, wow, you know, look at those. Those backwards mid 19th century Greeks who believe in this stuff, but rather that, number one, it's taking very seriously this reality of the interaction of the story, spiritual with the material, the immaterial with the material. It takes it very, very seriously. I mean, this is from a manual for priests. This is not, you know, a book of legends or whatever. But also the thing about it that really struck me, and this is where I think it comes home for all of us."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9244.39,"end":9244.79,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9245.75,"end":9534.72,"speaker":"Fr Andrew Stephen Damick","text":"Because again, the point of everything that we do on this podcast is actually to make our spiritual lives better, to be better at this thing called Christianity. It's interesting, number one. First, it condemns people who. Their approach to human beings who are monstrous is to burn their bodies, literally dig them up and burn them. And it condemns that. It says, don't do that. In fact, people who do that should be treated like murderers. You know, that they're excommunicated for years. Right. And Then it says what should have been done or what should be done is that there's. This needs to be, this cleansing done with holy water, with prayers of exorcism, with the Divine Liturgy, notice the Divine Liturgy being used to fight against demons, with praying for that person's soul, with Koliva, you know, so that there's, there's the memorial prayers that are prayed for them. And this is because this is a person who has died and so he doesn't have possession of his mortal body anymore, so he can't repent. And so the Church engages in acts of repentance on his behalf in hopes that God will grant mercy to him. Right? And so on the one hand, this is a pretty clear model based on, you know, uncontestable orthodox tradition about how to deal with demonic presence and how to deal with, how to, how to pray for people who are, who are departed, especially those who are departed and lived very sinful lives. You know. But on the other hand, we can also analogize this even to our day to day life, right? So there's a big temptation in our time, especially in our time, to look at people who are not just, you know, okay, so people we disagree with, but let's just go ahead and say people who we regard as super evil, okay? Now in many cases they're not, where they're just people we disagree with, okay? But let's just go ahead and say these, you know, people are super evil, right, that really are people who are super evil. What are we supposed to do with such people? Well, the way that the world wants us to deal with them right now is to burn them, whether metaphorically or whatever. That's what the world says. Destroy them. They must be destroyed. These are evil, subversive, horrible, destructive people. They must be destroyed, right? Whereas this instruction, this Nommo canon, says that the way you're supposed to deal with people who, again, admitting that they are monstrous, understanding that they are monstrous, right, is actually through spiritual acts of mercy, that that's the way to deal with them, to try to get the demon to go out. Because even if someone really has descended into evil, it's because there's a demonic presence there. You know, that's what's going on. A human being who is acting in a truly evil manner is a slave. They've enslaved themselves, okay? It's not like they're not culpable, but they're a slave. And what we want is to free them from slavery. And so that's the approach. Now a lot of the Time. Like I said, people are not actually evil. We just disagree with them and we're letting our passions take over and we're seeing them as monsters, even though they aren't. But even if they really are. Right. What does Christ say to do with our enemies? Love them. He says to love our enemies. That's what he says to do. It's very, very clear, right. We're not called to burn them and to destroy them and so forth. We're called to love them. So that's, I mean, that is an amazing takeaway for me in a really unlooked for place, frankly. I mean, despite being really interested in some of this kind of stuff, I have not ever wondered to myself, wow, I wonder if there's a canonical approach to what you're supposed to do with vampire hunters and vampires. But sure enough, there is. But it's not just about vampires and vampire hunters. It simply illustrates foundational, clear principles of what it means to live the good Christian life, what it means to actually be like Christ, to do what his, you know, to follow his commandments, to obey him and to. To live as he told us to live. Father Stephen."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9537.36,"end":9539.24,"speaker":"Fr Stephen De Young","text":"So dovetailing nicely off of."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9539.24,"end":9539.52,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9542.8,"end":9945.09,"speaker":"Fr Stephen De Young","text":"You know, the sort of. The whole theme of Lord of Spirits, the overarching thing is, as the voice of Steve says in the intro, is about trying to reunite our experience of reality, right. The spiritual and the material together that have been where they've been pulled apart. And one of the places where they've been pulled apart and one of the places where I think we least realize they've been pulled apart is in our understanding of our behavior of quote, unquote, morality. We have, in addition to separating all the other things we've talked about on the show, separating, we separate sort of religious acts from other acts. Right. So, you know, probably most of our listeners and even a lot of people who aren't listeners would say that, well, yeah, if you go and participate in a pagan ritual or some kind of ritual of another religion, some idolatrous ritual, if you eat, you know, meat sacrificed to idols, that, yeah, that would be participating in some kind of demonic activity, right? Yeah. But when it comes to sort of our day to day decisions about whether or not to lie, whether or not to cheat, whether or not to take something, whether or not to show mercy, whether or not to forgive, we tend to treat those in this other way, this sort of very material way of morality where as Christians at least most people would say, oh, well, there's these rules. God has these rules. If you follow those rules, you're a good moral person. If you break those rules, you're a bad person. But this is a question of God's judgment of your behavior, right? There's nothing particularly demonic or angelic or spiritual about it. Hopefully, as I said, that at least our orthodox listeners were saying, well, wait a minute, right? We have an understanding of theosis. We have an understanding that when we, quote, unquote, do good in a positive sense, we're not really doing good things independently, but we're. We're participating in the work that God is doing in the world. We're participating in God's activity in the world, and that's why it's transformative of us. It isn't this sort of separate thing that God kind of judges from afar. But we're actually working. And the reason God can call any work we do good is because it's actually his work that he's doing through us, right? That it's not coming from us, ourselves, but this has a coordinate on the other side that that means when we sin, when we do evil, it's not just that we broke a rule, but that we are participating in something demonic. Because the truth is, everything we do is on a continuum. When we come and celebrate the Eucharist together as a parish family, and when you gather around with your immediate family at the dinner table and pray and eat a meal together, those are not two different things. Those are two things that are on a continuum. The Eucharist, obviously is at the very top, right? At the very top of that continuum. But the fellowship you share in, the bread you break with friends is on that continuum. It is doing to a lesser degree in a smaller way what the Eucharist is doing to the nth degree. And so when you give a cup of water to someone in need, right? It's not that, oh, well, rationally, this person's in the image of Christ. And the rule is I should treat other people as I would treat Christ. Doing that is on the same continuum as serving Christ everything we do, and vice versa, right? I think there are very few people listening. I hope there's no one listening to this who has ever seriously contemplated sacrificing an infant to a pagan God in order to receive powers, right? I hope there's nobody who's even given that a moment's thought, right? But every time we participate in evil, every time we ignore it, every time we excuse it, every time we participate in it, every time we do it ourselves, right? We are performing actions that are on A continuum with that horror. We were on a continuum with that kind of nightmare, right? And. And you see this even in what we talked about tonight, right? Werewolfism doesn't start with that. Werewolfism ends with that. Werewolfism starts with being greedy and gluttonous, with always wanting more, with being ravenous, with wanting to devour and devouring other people metaphorically. Long time before you get to literally. But those aren't two different things. Those are on a continuum. Those are on a continuum. And so we need to take every choice we make and how we live and what we do and what we pursue very seriously. There isn't neutral. There isn't, well, I didn't do anything all that significant either way. All of these things are on one continuum or the other. All of these things are leading us closer to Christ and becoming more human and more like God. Or they're leading us in the opposite direction, to become less human and more bestial and more of a monster. As you pointed out, it's never too late. Even if you're dead, even if you're a demon possessed corpse, the Church presents that there is hope for you in Christ. But we need to reconsider the value of our everyday morality and actions and the kind or unkind words we share with people, even those smallest things. Because everything starts small and then gets bigger. And every footstep we take leads us down one road or the other."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9948.94,"end":9972.3,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you very much for that. Well, that is our show for today. Thank you very much everyone for listening. If you didn't get a chance to call in during the live broadcast, we'd love to hear from you, either via email@lordofspiritscientientfaith.com you can message us also at our Lord of Spirits podcast Facebook page. We do read everything, but we can't respond to everything. And we do save some of it for possible use in future episodes."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9973.03,"end":9978.95,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9979.59,"end":9992.23,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it. And don't forget to buy our books, please. Thank you."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":9993.03,"end":10002,"speaker":"Fr Stephen De Young","text":"And if you enjoyed hearing me uninterrupted this evening, that's thanks to Ancient Faith paying for my new Internet connection. If you really appreciate it, go throw them a few shekels to keep it going."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":10003.44,"end":10012.24,"speaker":"Fr Andrew Stephen Damick","text":"It's@ancientfaith.com support thank you very much, everyone. Good night and God bless you and be with you always."}
{"episode_id":"LOS - #030 - 2021-10-28 - Monster Manual (Halloween Special)","start":10020.8,"end":10058.02,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with the Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and blessing. Revelation 5, 11, 12."}
