{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":0.4,"end":65,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":67.08,"end":143.67,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, assorted destroyers of monsters. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania, the great megalopolis of Eastern Pennsylvania. And if you're listening to us live, you can call in at 855 AF radio. That's 855-237-2346 and Montesqua Trulli is taking your calls tonight, which we're going to get to in the second part of our show. Before we get started, I have a little advertisement to share and this time it's not for somebody else's thing, it is for our thing. On October 26th through 29th, 2023. So that's next year, assuming the world still exists at that time. At the Antiochian Village in Western Pennsylvania in the little town of Ligonier, we are going to be holding the first ever Lord of Spirits conference. Father Stephen and I are going to both be there, as well as Fathers David Subu and Lucas Christensen. Maybe more. Schedule is still being worked on, but you can find all the current details and you can register by going to store.ancientfaith.com events."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":144.3,"end":167.66,"speaker":"Fr Stephen De Young","text":"Burying the lead there's going to be a Dungeons and Dragons tournament, probably. No, there will be. It's in my writing. I said don't worry about the green jelly beans, but there will be a Dungeons and Dragons tournament. It may be me and eight attendees in the parking lot, but there will be one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":168.3,"end":207.62,"speaker":"Fr Andrew Stephen Damick","text":"It's happening. Yeah. Yeah, it's going to be A lot of fun. There should be at least one person dressed as a bat. You know who you are. Okay, moving on. We continue our series tonight on the sacraments of the Orthodox Church by looking at Chrismation. So what is chrismation? What does it do? How is chrism used in the Old Testament? Where is Chrismation in the New Testament? Is it even a thing? And what exactly does it have to do with the Holy Spirit? So that's what we're talking about. My first question, though is how many accidental references to cremation are we going to make tonight? I've heard people call it that. It's going to be cremated."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":207.86,"end":221.78,"speaker":"Fr Stephen De Young","text":"Yes. This is the shout out to my niece who more than 20 years ago, when I was preparing to be received into the Orthodox Church, asked, when is Uncle Steve's cremation?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":224.58,"end":225.78,"speaker":"Fr Andrew Stephen Damick","text":"She was ready for it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":226.1,"end":230.65,"speaker":"Fr Stephen De Young","text":"Yes. She has since been Chrismated, so. And survive the experience."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":231.13,"end":232.25,"speaker":"Fr Andrew Stephen Damick","text":"Baptism by fire."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":232.57,"end":233.13,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":236.41,"end":236.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":237.37,"end":241.37,"speaker":"Fr Stephen De Young","text":"So, yes, we're going to try to. We're going to try to avoid those. And they are not the same thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":241.69,"end":316.15,"speaker":"Fr Andrew Stephen Damick","text":"It's true. Yeah. So, yeah, the first thing is like, what exactly is Chrismation? Because especially if you're not Orthodox, that word might not be familiar to you. Maybe it is, but it might not be. So what exactly is it? So chrism is a special oil that is prepared by bishops, and depending on which church you belong to, the Orthodox Church, you might come from somewhere far away, might also be more local. It's got a lot of different elements in the recipe, but that's not the important thing. The important thing is that this special oil is then distributed to the priests and then they use that as part of baptism, as part of receiving someone into the Orthodox Church. Right. It also gets used in some circumstances for receiving converts whose baptisms are already considered to be workable. So that's what it is. It's an anointing oil. It's considered to be a baptism. Right. It's an anointing oil and it's applied to the forehead, the eyes, the ears, the mouth, nose. Now I'm going to miss stuff. Hands, feet, chest, back. Am I leaving anything out? I think this has to."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":316.15,"end":316.95,"speaker":"Fr Stephen De Young","text":"That pretty much covers it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":316.95,"end":318.07,"speaker":"Fr Andrew Stephen Damick","text":"That pretty much covers it. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":318.07,"end":320.07,"speaker":"Fr Stephen De Young","text":"It's also used for consecrating a church."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":320.31,"end":322.23,"speaker":"Fr Andrew Stephen Damick","text":"Also used for consecrating churches."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":322.55,"end":323.19,"speaker":"Fr Stephen De Young","text":"Altars."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":323.83,"end":329.83,"speaker":"Fr Andrew Stephen Damick","text":"Altars. I've heard in some cases that initial house blessings can include chrism as well."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":330.07,"end":335.2,"speaker":"Fr Stephen De Young","text":"They do, actually. You anoint the fourth four corners."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":335.36,"end":337.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we'll get to all."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":337.12,"end":342.96,"speaker":"Fr Stephen De Young","text":"I did an exorcism on a house, which I will further describe it. Just leave that tantalizingly there."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":343.2,"end":347.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, absolutely. So that's Chrismation in the West."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":349.6,"end":364.16,"speaker":"Fr Stephen De Young","text":"It's done normally as part of. Done to people. Right. Setting aside the consecrating a building, it's done to people normally within the baptismal service."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":364.48,"end":366.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's integral to the service."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":367.04,"end":388.4,"speaker":"Fr Stephen De Young","text":"Yeah. So within that there are. We probably should have done this earlier in our series on sacraments, but in certain ways, drawing out these as independent sacraments is a little artificial from an orthodox perspective."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":388.87,"end":390.47,"speaker":"Fr Andrew Stephen Damick","text":"Sure. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":391.91,"end":411.27,"speaker":"Fr Stephen De Young","text":"There is in the West a whole ordered theology of what is a sacrament and what is a sacramental. And then once you have that, once you get into the Reformation era, there are, of course, disputes."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":411.83,"end":414.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Is this a sacrament? Is that not a sacrament?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":415.13,"end":423.41,"speaker":"Fr Stephen De Young","text":"Yeah, you get. You get friend of the show John Calvin saying if he ever actually comes on, that would be amazing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":423.41,"end":424.81,"speaker":"Fr Andrew Stephen Damick","text":"But John Calvin."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":425.05,"end":427.25,"speaker":"Fr Stephen De Young","text":"Yeah, that would mean a whole lot."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":427.25,"end":429.21,"speaker":"Fr Andrew Stephen Damick","text":"Of praying has been done for his soul."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":429.45,"end":433.17,"speaker":"Fr Stephen De Young","text":"Yeah. For that to be possible and. Or necromancy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":433.17,"end":434.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. Oh, there's."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":434.17,"end":445.95,"speaker":"Fr Stephen De Young","text":"Yeah, that's okay. I didn't want to throw that out there, but. But no. John Callan, for example, talks about the five sacraments falsely so called."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":446.51,"end":446.99,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":447.63,"end":466.27,"speaker":"Fr Stephen De Young","text":"But that's referring to the list of seven sacraments that became official within Roman Catholicism with other things seen as sacramentals. There is not really such a list in the Orthodox Church."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":467.07,"end":477.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I think you can find lists, but it's not a super agreed upon thing that is dogmatically declared by the church, etc. Etc."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":477.71,"end":483.07,"speaker":"Fr Stephen De Young","text":"And the lists you find are usually lists in response to some Western interlocutor."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":483.31,"end":513.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. One big difference that people will probably notice is that sort of the parallel thing in the west is called confirmation, which usually is delayed until you're a teenager. But early on in the Western church's history, it was not delayed. We don't need to go into why all of that is. So it became this separate thing that was separated out from baptism, but we don't do that. It's part of baptism for the Orthodox."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":513.96,"end":534.21,"speaker":"Fr Stephen De Young","text":"Right, right. But because the lists don't sort of arise within the Orthodox Church organically, you get all different lists. So you get lists with like 10 things, you get lists with five things, you get lists with all these different numbers."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":534.21,"end":536.69,"speaker":"Fr Andrew Stephen Damick","text":"I think I've heard this one, like that's 20 something on it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":537.01,"end":549.3,"speaker":"Fr Stephen De Young","text":"Yeah. But also because there's a Western interlocutor, there's a tendency to sort of line them up. Right. With the person you're talking to."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":549.78,"end":550.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, for sure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":551.14,"end":599.29,"speaker":"Fr Stephen De Young","text":"So you'll often see in like, contemporary Orthodox discussions of the sacraments or the mysteries that they're laid out as basically seven, even though we have things that are kind of parallel to the ones of the Roman Catholic Church in a few instances, but that are not exactly parallel. And this is one of them, as you were just mentioning. Right. So part of the reason why, even though naturally, for us as Orthodox Christians, you have baptism, Chrismation and first communion all together in one thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":599.69,"end":600.25,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":602.01,"end":613.77,"speaker":"Fr Stephen De Young","text":"Because those have been split up in the west, we tend to talk about them separately because of the Western interlocutor."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":613.85,"end":624.17,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, and even baptism within itself as a. The service actually includes two separate anointings. It's kind of funny you don't sort of separate out that other one as another thing, you know."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":624.33,"end":628.81,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah, yeah, well. And there's tonsure in there. There's a whole bunch."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":628.89,"end":629.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":629.85,"end":656.68,"speaker":"Fr Stephen De Young","text":"Right. That could also be pulled out of sacraments, but because those aren't sacraments of the west, they tend not to make the list. But so all that is to say, I'm anticipating some potential questions and responses because they naturally go together. There's not sort of this super firm line between here's what's going on in baptism and here's what's going on in Chrismation."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":657.41,"end":658.61,"speaker":"Fr Andrew Stephen Damick","text":"Mm, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":659.41,"end":694.38,"speaker":"Fr Stephen De Young","text":"Right. The one does xyz, the other one does abc. Right. Because they're not naturally thought of as separate for us. So there is a blurry edge between the two because of that. So this is to save everybody time in typing. Well, wait a minute. I thought that was baptism or so charismatic does it, but baptism doesn't. So then what if somebody's charismatic and not baptized? Yada, yada. Right, yeah. Relax. Right. There's not a firm line between the two."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":695.1,"end":699.98,"speaker":"Fr Andrew Stephen Damick","text":"The important thing is that if you want to become Orthodox, you do whatever your priest tells you to do."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":699.98,"end":729.46,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. But so the core. The core thing, and like, if you give the one sentence definition of what Chrismation is, it's that a person is anointed with oil, this particular oil, but person is anointed with oil to receive the Holy Spirit. That's the one sentence thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":730.02,"end":730.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":730.38,"end":755.02,"speaker":"Fr Stephen De Young","text":"Of what. What Chrismation is in the Orthodox Church. And so everything we're going to say tonight now is going to be based on tracing the themes related to that, to both the reception of the Holy Spirit and anointing with oil through the scriptures to sort of show what that means."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":756.38,"end":758.14,"speaker":"Fr Andrew Stephen Damick","text":"All right, so where shall we begin?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":759.42,"end":760.78,"speaker":"Fr Stephen De Young","text":"We should begin at the beginning."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":761.78,"end":762.42,"speaker":"Fr Andrew Stephen Damick","text":"It's a very good."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":762.42,"end":792.1,"speaker":"Fr Stephen De Young","text":"Rogers and Hammerstein told us it's a very good place to start. And when those two guys agree. So all the way back in Genesis 1, verse 2. Right. So almost as far back as we can go in the Bible, that's the first place where we see a direct reference to the Holy Spirit. The Spirit of God."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":792.58,"end":794.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, from the beginning."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":795.14,"end":806.66,"speaker":"Fr Stephen De Young","text":"And when we first see him, it is actually feminine imagery that's used of."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":806.66,"end":806.98,"speaker":"Fr Andrew Stephen Damick","text":"Him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":809.3,"end":814.02,"speaker":"Fr Stephen De Young","text":"Because ruach in Hebrew is grammatically feminine."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":814.67,"end":814.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":816.27,"end":856.1,"speaker":"Fr Stephen De Young","text":"And he is described as. In English, it's usually translated as he's hovering over the waters. That word for hovering in the Hebrew is actually a word that's used to describe a mother bird brooding over its young, or potential young, in the case of eggs in the Nest. And St. Basil the Great actually makes this point about it. He doesn't know Hebrew, but he gets it through Syriac."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":856.9,"end":858.14,"speaker":"Fr Andrew Stephen Damick","text":"Oh, does he know."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":858.14,"end":859.86,"speaker":"Fr Stephen De Young","text":"He references the Syriac word."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":860.34,"end":862.58,"speaker":"Fr Andrew Stephen Damick","text":"Interesting. Is this the Hexameron?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":862.82,"end":913.85,"speaker":"Fr Stephen De Young","text":"Yeah, he references the Syriac word, which is available to him. And Syriac for folks who don't know is. Is a relatively late dialect of Aramaic. And so he makes that same point based on the Syriac cognate word. Right. But this imagery also becomes important in terms of where the imagery is coming from, as the Holy Spirit descending like a dove at Christ's baptism. And as we've said on the show before, he did not turn into a bird. He did not incarnate as a bird."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":913.93,"end":915.77,"speaker":"Fr Andrew Stephen Damick","text":"It's a symbolic bird, you guys."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":915.85,"end":930.59,"speaker":"Fr Stephen De Young","text":"He descends like a dove. His movement is like a dove. Right. And this is also describing movement or activity. Right. And as we've talked about before."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":933.23,"end":933.63,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":933.63,"end":970.78,"speaker":"Fr Stephen De Young","text":"Creation, before creation starts, which is where we are in Genesis 1, verse 2. Right. Creation is described in Genesis 1 as God putting things in order. And so before that, there is chaos, but this sort of primordial chaos, right? Or what Aristotle calls prime matter has the potential to be anything, but isn't anything. And so that's partially contained in this bird imagery also. Right, the brooding over the."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":971.9,"end":974.42,"speaker":"Fr Andrew Stephen Damick","text":"Over the young, sort of the potentiality thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":974.42,"end":977.63,"speaker":"Fr Stephen De Young","text":"Yeah, the potential. This is going to become something. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":977.63,"end":978.47,"speaker":"Fr Andrew Stephen Damick","text":"It's going to hatch."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":979.11,"end":1021.71,"speaker":"Fr Stephen De Young","text":"And that kind of language about the Spirit is all over the place. Like in our matins service of the Holy Spirit is the one who gives life and breath, Right. And that kind of ongoing creative power of the Holy Spirit. And so we also see in Genesis 1, a couple verses later, God starts to speak. So when St. John, at the beginning of his gospel says that God created everything through his Word. Right. That's a fairly literal reading of Genesis 1."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1022.03,"end":1023.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. He talked."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1025.07,"end":1057.14,"speaker":"Fr Stephen De Young","text":"So you have here already at the beginning of Genesis 1, you have God meaning the Father, you have the Logos, the Word, and you have the Spirit. And the dynamic that's described in creation already in Genesis is that the Logos. And so ultimately Christ is the order into which creation is brought."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1059.15,"end":1062.83,"speaker":"Fr Andrew Stephen Damick","text":"He's the principle that defines how it's all supposed to be laid out."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1062.99,"end":1155.91,"speaker":"Fr Stephen De Young","text":"Right, right. And the Holy Spirit is the one who inhabits and enlivens that order. So creation happens through the sun, right, through the Logos, then through the action of the Holy Spirit, it is brought back to God the Creator. And yeah, we're throwing everybody in the deep end right away in the first half at the beginning, which we normally don't do. We normally wait for this kind of thing, but this time we're just going straight from the deep end. So. And that's part of what, for example, Saint Irenaeus is getting at. That dynamic in creation, that trinitarian dynamic in creation is part of what St. Irenaeus is getting at when he talks about the Logos and the Spirit as the right and left hands of God. That there is this continual dynamic in creation. The idea of Christ, the Logos as the order into which creation is brought is not just connected to theosis as we've talked about it on the show, but that's where Saint Maximus, when he talks about everything in creation having logia."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1156.71,"end":1159.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a cosmic scale at which all this is happening."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1159.91,"end":1191.85,"speaker":"Fr Stephen De Young","text":"Yeah. Everything in creation has a logia that's all part of the Logos. Right. That's where he's getting that. Right. So all kinds of things break down out of this, this understanding, this trinitarian understanding of creation. But important for us tonight we're not going to focus on all that because, you know, I don't think. Well, my co host and our engineer don't want to stay here until 3am."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1193.42,"end":1194.58,"speaker":"Fr Andrew Stephen Damick","text":"You got nothing else to do."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1194.58,"end":1202.46,"speaker":"Fr Stephen De Young","text":"But I got. I would be happy to. Dear listener, I would remain with you throughout the long, dark, cold night, but."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1203.98,"end":1205.82,"speaker":"Fr Andrew Stephen Damick","text":"Does it ever get cold in Louisiana?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1206.46,"end":1293.9,"speaker":"Fr Stephen De Young","text":"No, it was 82 today, but it's dark. But for our purposes here. Right. We want to get at through this dynamic what it means to be filled with the Spirit, what it means to be filled with the Holy Spirit. Right. And so the idea that the Holy Spirit inhabits and enlivens the created order on a cosmic scale tells us what that means. And so from that, we get what that means on, for example, a personal basis. Right. And so, first of all, Right. That means to be truly alive is to be filled with the Holy Spirit. To be filled with life means to be filled with the Holy Spirit, who is the Lord, the giver of life. And it also means. Right. That when someone is filled, as we've talked about on the episode where we talked about what spirits are in general. Right. That a spirit has agency. And so a person who is filled with the spirit, then what they do is. Has the potential at least to become God acting through them."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1294.22,"end":1296.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's, you know, synergy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1297.02,"end":1347.02,"speaker":"Fr Stephen De Young","text":"Right. God acting through them in a way that is transformative them. So God loves people through them. And that love transforms the person who is cooperating with that love, for example. So when we move past creation and the creation of the world, we move down from the level of the cosmos in the Old Testament. We move forward in the Old Testament a little further to where we have humans. We see that there are certain people, certain individuals in the Old Testament who are described as having been filled with the Holy Spirit on an at least potentially permanent basis."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1347.42,"end":1351.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That the Spirit is abiding in them or resting in them."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1352.3,"end":1364.45,"speaker":"Fr Stephen De Young","text":"Right, right. Resting on them or in them or abiding in them or on them. And so an exhibit A of that is, of course, Moses."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1365.09,"end":1365.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1365.49,"end":1389.64,"speaker":"Fr Stephen De Young","text":"Right. So Moses possesses the spirit of God. This is one of the things that marks him out as a prophet. And the people in the Old Testament who are described as being filled with the Spirit on this potentially permanent basis are, by and large, prophets."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1390.04,"end":1397.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's this job that God is giving them to do. And so they need to be able to do it on an ongoing basis."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1398.36,"end":1427.39,"speaker":"Fr Stephen De Young","text":"Right. And they've been in the presence of God. Right. So they've met Christ. Right. And so now they've been sent by him into the world. Right. With this mission. And that's true to the point that when we see other figures who possess the Holy Spirit on this potentially permanent basis, like David, who's the king, he's not a prophet per se."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1427.71,"end":1434.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He doesn't live out in the woods and, you know, have this weird opposing sort of lifestyle."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1434.43,"end":1455.17,"speaker":"Fr Stephen De Young","text":"Yeah. And Samuel and Nathan are around at that time, and they're prophets. Right. Depending on which point in David's life we're talking about. Right. But David is still described as a prophet, and that's even within the pages of the New Testament. It talks about David prophesying."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1455.33,"end":1456.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The prophet king."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1456.53,"end":1481.1,"speaker":"Fr Stephen De Young","text":"Right. And that's because he is one of these who within whom the Holy Spirit is dwelling. And as Father Andrew mentioned, that is what the Holy Spirit does in that prophet is enliven and empower him to fulfill the role he's been sent to perform."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1482.86,"end":1487.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not just like a personal possession, like you're. You're powered up, dude. Now you're a superhero."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1488.14,"end":1548.54,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It's not going Super Saiyan. Right. It's like a. It's not even like the sun for Superman. It's you. The primary way in which, in fact, that sort of empowerment, what that concretely means is as we were saying, God acting through you. Right. So it's not that God is giving you superpowers to perform your own mighty deeds. It's that God is going. You've been called to do these things, and God is going to act through that person. And that puts the person who has received the Holy Spirit into a particular relationship with God. Right. That is. That is different than others who do not similarly have not similarly received the Holy Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1548.62,"end":1565.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They function as his agent, but they have their own agency. They're not being taken over. But at the same time. Not in this case. Yeah, not in this case. Right. At the same time, God is being an agent in them as well. At the same time."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1565.34,"end":1583.26,"speaker":"Fr Stephen De Young","text":"Right, right. And this is why that relationship is often described in terms of sonship. So the king in ancient Israel and Judah is the son of God in this adopted sense."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1584.94,"end":1589.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because what do sons do? They have to be about the business of their father."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1590.14,"end":1609.68,"speaker":"Fr Stephen De Young","text":"Right. So the son represents the father. Right. For as long as the father is alive. Right. Once the father's gone and the son becomes the head of the household, then his sons represent him. Right. That's the way ancient. Right. We gotta think ancient extended families again."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1611.6,"end":1612,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1612.32,"end":1691.04,"speaker":"Fr Stephen De Young","text":"Yeah. So. And it's important to emphasize. Right. Because even the language of agent can be kind of slippery. Right. Because my agent can do things independently of me. There are different ways we talk about agent. Right. So I could talk about someone as my agent in a way that means they're going to do only what I tell them to do. We could talk about an agent as being someone who has the freedom to act on my behalf and make their own decisions, but I'll be bound to those decisions. Or we could talk about an agent as being the one sort of through whom I act. And the agent has to cooperate in that case. And so it's important that someone like this who has been called and sent on some particular mission filled with the Holy Spirit to empower them. And that mission is not then a free agent, pardon the pun. Right. That's that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1691.6,"end":1692,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1692.4,"end":1713.13,"speaker":"Fr Stephen De Young","text":"God is not binding himself to whatever they do. Yeah, yeah, yeah, right. And God is not. But God also is not compelling. Yeah, right. That agent can still do things other than what God wants them to do."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1713.85,"end":1714.73,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1715.05,"end":1716.77,"speaker":"Fr Stephen De Young","text":"They're able to do that still stepping."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1716.77,"end":1718.57,"speaker":"Fr Andrew Stephen Damick","text":"Outside of that relationship if they do that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1718.81,"end":1737.66,"speaker":"Fr Stephen De Young","text":"Right. And so rather, it is the person through whom God is going to act. And what they do is they cooperate with that or they don't. Yeah, right. And you know, you don't have to read much of the Old Testament to see that folks often don't."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1737.81,"end":1740.69,"speaker":"Fr Andrew Stephen Damick","text":"But it is possible to, as they say, quench the Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1741.01,"end":1773.23,"speaker":"Fr Stephen De Young","text":"Right. And so this is why I said repeatedly as we got into this discussion that it is potentially permanent. So King Saul, when he was anointed as king, was indwelt by the Holy Spirit to empower him to be the king over God's people. But then there's a point in his life where the Holy Spirit departs from him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1774.03,"end":1775.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It says that in the Scripture."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1775.87,"end":1791.63,"speaker":"Fr Stephen De Young","text":"Right. And when we read Psalm 50 or 51 in the Hebrew. Right. David's psalm of repentance after his sin, he prays, do not take your Holy Spirit from me."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1792.31,"end":1793.43,"speaker":"Fr Andrew Stephen Damick","text":"Because he knows it's a thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1793.75,"end":1862.37,"speaker":"Fr Stephen De Young","text":"Right. That's what happened to Saul could happen to him. And he probably deserves for it to happen to him after what he's done. Right, yeah. And so that's part of his repentance is saying, you know, please. Right. Because he's aware of his sort of dependence on God. So that's why we say it's potentially permanent for these. These people in the Old Testament. There are also instances in the Old Testament and people in the Old Testament who we see the Holy Spirit abiding in or resting upon or filling on a sort of temporary basis. It still falls within empowering and enlivening for a particular task God wants to perform through them. But that task is not like an ongoing thing like being king or being God's prophet. It is for a sort of particular act, for a particular time and place. A particular thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1862.61,"end":1863.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For a mission."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1864.37,"end":1897.39,"speaker":"Fr Stephen De Young","text":"Right. And usually less than five years. This mission. The. So an example of that. One example is in numbers 11. We read this passage at great vespers before the feast of Pentecost, where the Spirit who rested upon Moses permanently, portions of it of the Spirit come to rest on the rest of the elders."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1898.23,"end":1899.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And they all Begin to prophesy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1899.99,"end":1923.27,"speaker":"Fr Stephen De Young","text":"And they all begin to prophesy. And Joshua and some other Moses loyalists get kind of offended. Right. They're like, no, Moses is the prophet. Tell them to stop. Right, yeah. And Moses says, no, I wish that all of Israel could receive the Spirit and prophesy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1923.43,"end":1926.65,"speaker":"Fr Andrew Stephen Damick","text":"Is this the one where there's the two guys that are in the camp."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1926.65,"end":1961.38,"speaker":"Fr Stephen De Young","text":"That they showed up late for church? I know that never happens now to anybody, especially the orthodox church, but the. Yeah. And so the reading actually ends right there with Moses saying that would that all of Israel could receive the Spirit prophesy. Foreshadowing. And then another example is in Exodus 31, when Bezalel and the other craftsmen are contracted to build all of the."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1961.38,"end":1966.14,"speaker":"Fr Andrew Stephen Damick","text":"Things, the ark, covenant and all the other stuff."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1966.46,"end":1976.3,"speaker":"Fr Stephen De Young","text":"The second half of the book of Exodus is where everybody starts to kind of fall asleep and get bored when they try to read straight through the Bible."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1976.54,"end":1978.22,"speaker":"Fr Andrew Stephen Damick","text":"Sort of verbal blueprints."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1978.78,"end":1988.78,"speaker":"Fr Stephen De Young","text":"Yeah, well, and you get them twice. So you get like the full detail of the blueprints and then you get the full details again as it describes them. Building the things from the blueprints."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1989.02,"end":1989.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":1990.46,"end":2041.56,"speaker":"Fr Stephen De Young","text":"All the measurements all over again. But within that 31, those craftsmen who are doing the building from the blueprints are filled with the Spirit to enable and empower their work. Right. And so while the tabernacle is made by human hands, it is all. You can also say that is divinely created. Right. So but there is is nothing in the text to indicate and everything to indicate otherwise that this wasn't sort of a permanent kind of gift that Bezalel had. So that sort of every chair he made for the rest of his life was holy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2041.72,"end":2047.48,"speaker":"Fr Andrew Stephen Damick","text":"A divine chair. He didn't become like a, you know, a smith God kind of figure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2047.48,"end":2063.89,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So it's aimed at this one particular, this one particular task. We also, I know we have mentioned at least briefly on the show before the very creepy sounding Holy Spirit possession."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2064.53,"end":2065.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2067.49,"end":2078.69,"speaker":"Fr Stephen De Young","text":"That, that. And I think that term for it is purely based on people trying to click bait you into reading their scholarly articles."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2080.29,"end":2080.65,"speaker":"Fr Andrew Stephen Damick","text":"Really?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2080.65,"end":2131.07,"speaker":"Fr Stephen De Young","text":"Because I kind of like Joshua and judges Holy Spirit phenomenon of Holy Spirit possession in ancient Israel. So this is next. Yeah, this is an even, like the previous examples is temporary, but it tends to be even more temporary. And the reason it's called Holy Spirit possession. Right. The reason why you would come up with another term for it is in most of these, at least implicitly and sometimes explicitly, the idea of human agency is removed."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2131.95,"end":2134.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Almost against their Will."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2135.48,"end":2136.52,"speaker":"Fr Stephen De Young","text":"Well, maybe not against."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2136.68,"end":2139.48,"speaker":"Fr Andrew Stephen Damick","text":"That might be a little strong or without their cooperation."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2139.8,"end":2176.46,"speaker":"Fr Stephen De Young","text":"Right, right. And the idea here being that these are acts that God does through a person that are being characterized as purely God's act. Yeah, yeah, right. It's purely God who is doing this. And so, unsurprisingly, often these actions in terms of that phenomenon are things that would not normally be morally acceptable to people. And what I mean by that is usually it involves smiting a whole lot of people."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2177.26,"end":2224.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. So like judges 3, 9, 11, we have a smiting. It says this, but when the people of Israel cried out to the Lord, the Lord raised up a deliverer for the people of Israel who saved them. Othniel, the son of Kenaz, Caleb's younger brother. The spirit of the Lord was upon him and he judged Israel. He went out to war. And the Lord gave Cusha Rishamthaim, King of Mahanaharayim, into his hand. And his hand prevailed over Cushan Rishathaim. So the land had rest 40 years. Then Othniel the son of Kenaz died. You have to love the rhythm of those names, though. It makes me think of, you know, Ricky, Tikki, Tavi."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2224.82,"end":2234.58,"speaker":"Fr Stephen De Young","text":"Yeah, it's the same kind of. Kind of rhythm, you know, Krishn Rishitayam of Mahanaharayam. I would suggest someone name their child that, but it would be a bad idea because."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2236.26,"end":2237.22,"speaker":"Fr Andrew Stephen Damick","text":"Because it means what?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2239.14,"end":2243.46,"speaker":"Fr Stephen De Young","text":"So Mahanaharayam is. The place is literally the place between the rivers."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2244.18,"end":2245.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2245.54,"end":2247.94,"speaker":"Fr Stephen De Young","text":"So it's a reference to Mesopotamia."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2248.1,"end":2248.98,"speaker":"Fr Andrew Stephen Damick","text":"All right, all right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2249.94,"end":2260.5,"speaker":"Fr Stephen De Young","text":"Which means it's a reference to Babylon. Etc. Etc. But Kushan Roshatayim is probably not the name his mama gave him because it means. It means the. The double dark evil one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2261.7,"end":2262.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2263.7,"end":2279.35,"speaker":"Fr Stephen De Young","text":"So I mean, if you name your kid that, that's a lot to live up to. Yeah, right. Or down to, as the case may be. But that's. So this was a bad dude."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2279.99,"end":2280.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2281.27,"end":2339.61,"speaker":"Fr Stephen De Young","text":"But what we see here, right, is that, that Caleb's younger brother Othniel, who's the first of the Judges of the Book of Judges, is. Is sort of seized by the Holy Spirit and then does a whole lot of killing. And we use this, an example, just because it's the first of the Judges. But all through the Book of Judges and several times in the book of Joshua, this happens. You know, Shamgar, who's the next judge, ends up killing several hundred Philistines with an ox goad, which is literally a pointy stick. But the idea here is that these actions are Being characterized as God's direct judgment. This isn't. God gave this person permission to engage in mass slaughter."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2341.53,"end":2342.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2343.93,"end":2366.82,"speaker":"Fr Stephen De Young","text":"This is. God judged this people, and instead of using fire from heaven or the ground opening up and swallowing them or an invading armory of a neighboring empire, he used Shamgar and his pointy stick. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2367.06,"end":2368.5,"speaker":"Fr Andrew Stephen Damick","text":"So pretty great name, though."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2369.94,"end":2372.58,"speaker":"Fr Stephen De Young","text":"And Shamgar is something you could name your kit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2372.74,"end":2375.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. What does that one mean? I don't happen to know off the top of my head."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2375.26,"end":2392.69,"speaker":"Fr Stephen De Young","text":"Well, no, it's just, you know, you could be Shamgar. Shamgar. I think that would mean foreign name if Gar is from Gore, anyway. But yeah, Shamgar. Not a lot of Shamgars."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2393.73,"end":2395.97,"speaker":"Fr Andrew Stephen Damick","text":"No, I mean, I don't think I've ever met one, actually."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2396.13,"end":2407.52,"speaker":"Fr Stephen De Young","text":"Yeah, Othniel. Okay. But Shamgar, that's impressive. That sounds like a barbarian name."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2407.92,"end":2417.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Probably because of that Gar ending, which, I mean, in Old English, gar means spear and is the origin of our word garlic."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2418.88,"end":2422.24,"speaker":"Fr Stephen De Young","text":"So maybe that's a very primitive version of the name Shakespeare."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2425.84,"end":2426.24,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2428.96,"end":2459.34,"speaker":"Fr Stephen De Young","text":"So. And this is, as we talk about this issue of agency. Right. And partially here and partially as. As a clarifier from our episode on spirits, that there's a difference between a spirit and an idea in that. And that difference is that a spirit has agency."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2461.55,"end":2462.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2462.35,"end":2501.34,"speaker":"Fr Stephen De Young","text":"That is the explicit difference. So when we're talking about spirits, the spirit of a place, the spirit of a group, the way we. The whole spirits episode, you can go back and listen to it again. That has a nature and a will and an agency. Right. An idea does not have that. Ideas arise at particular times in particular places for particular reasons. And ideas are used by agents like humans or angels. Ideas are used instrumentally. They're used as instruments, they're used as tools."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2501.5,"end":2508.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They don't have an independent existence. It's like meaning. Meaning does not exist apart from those who mean."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2509.5,"end":2533.26,"speaker":"Fr Stephen De Young","text":"Right. And we've talked about the noose, right. That ideas, thoughts present themselves Right. To the news. Right. And so in the same way that, you know, color doesn't exist without an observer. Right. That can see color. So if all the mantis shrimps die, right. Like 15 colors cease to exist."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2533.5,"end":2534.22,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2534.54,"end":2534.9,"speaker":"Fr Stephen De Young","text":"Effect."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2534.9,"end":2536.46,"speaker":"Fr Andrew Stephen Damick","text":"Well, we wouldn't know the difference, though, so."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2536.46,"end":2545.22,"speaker":"Fr Stephen De Young","text":"Because there's. We wouldn't. Right, but that's part of the point. Because those colors don't exist. Apart from. Right. The vision of the mantis shrimp."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2545.22,"end":2545.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2548.58,"end":2551.54,"speaker":"Fr Stephen De Young","text":"That would be a great book title. The Vision of the Mantis Shrimp."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2554.9,"end":2555.3,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2557.38,"end":2562.9,"speaker":"Fr Stephen De Young","text":"The Holy Spirit, obviously is not a holy idea."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2563.7,"end":2564.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2564.58,"end":2584.27,"speaker":"Fr Stephen De Young","text":"We're not saying that. But that's also true of evil spirits. Right. When we say that there are evil spirits motivating certain things happening in the world, we don't just mean people have some bad ideas. Right. In fact, we're deliberately rejecting that interpretation."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2585.79,"end":2590.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the actual bunch of interplay with other beings."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2591.07,"end":2672.55,"speaker":"Fr Stephen De Young","text":"This is not just a bunch of individuals who happen to have accepted bad ideas and agree with each other. And those ideas are making them do something horrible. Because ideas can't make you do anything. Yeah, right. This is. There are actual spiritual forces that have agency that motivate these things. And one of the things that they use as like a lever, as an instrument to move human persons is ideas. They bring those ideas to the fore. They tempt, they offer passions, they inflame passions. Right. They do those things. Right. To get humans to use their agency in the world to do those things. Right. But the ideas themselves can't do that. They're just ideas. And in fact, those ideas would not even arise if it weren't for those evil spiritual beings. Yeah, right, right, right. The thought would not appear to a person to commit abominations and atrocities if it were not. Right. So, yeah, that's a clarification. It'll also relate to some of the stuff we get into later this evening. So it was not totally just a random rabbit trail and interjection."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2672.55,"end":2673.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2673.35,"end":2698.88,"speaker":"Fr Stephen De Young","text":"Just mostly. So this brings us. So we've talked about now in the Old Testament, these sort of three levels of people being filled with the Holy Spirit, the sort of potentially permanent, the temporary and then sort of Holy Spirit possession as this particular phenomenon that of course changes in the New Testament, specifically at Pentecost."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2699.28,"end":2702.95,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Can we just jump right to the New Testament in the first half? Is that a thing?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2703.27,"end":2705.75,"speaker":"Fr Stephen De Young","text":"Well, we're going to jump back to the Old Testament two more times."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2707.43,"end":2710.23,"speaker":"Fr Andrew Stephen Damick","text":"Just not used to talking New Testament this early on in the show."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2710.63,"end":2713.99,"speaker":"Fr Stephen De Young","text":"So this is. We have departed from our usual structure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2714.39,"end":2717.11,"speaker":"Fr Andrew Stephen Damick","text":"I know we're just throwing stuff left and right here."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2717.19,"end":2735.17,"speaker":"Fr Stephen De Young","text":"Yes. Our usual structure is more like the Synoptic Gospels where we start someplace and take you on a journey. This is a journey into sound. But tonight this is more of a Johannine structure that it's kind of a spiral."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2735.17,"end":2736.21,"speaker":"Fr Andrew Stephen Damick","text":"The spiral, yes."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2737.65,"end":2748.61,"speaker":"Fr Stephen De Young","text":"Series of cycles moving ever forward. So, yes, we are now segueing into the New Testament. But don't worry, we'll be going back again."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2748.61,"end":2749.41,"speaker":"Fr Andrew Stephen Damick","text":"We'll go back."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2752.45,"end":2771.86,"speaker":"Fr Stephen De Young","text":"But Pentecost, in order to correctly understand what's going on at Pentecost, we not only have to have in mind what we just talked about, but also we need to talk about how Pentecost was spoken of prophetically in the Old Testament."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2772.34,"end":2778.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. So, yes, before we get to the New Testament, let's. Let's stay in the Old Testament for just a second."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2778.02,"end":2779.38,"speaker":"Fr Stephen De Young","text":"We're still in mid segue."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2779.54,"end":2808.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly. So Joel, chapter two. This is the classic bit. And we read this at Pentecost, verses 28 and 29. And it shall come to pass afterward that I will pour out my spirit on all flesh. Your sons and your daughters shall prophesy, your old men shall dream dreams, and your young men shall see visions. Even on the male and female servants in those days, I will pour out my spirit. And this is a difference from the way it works in the Old Testament."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2808.23,"end":2821.07,"speaker":"Fr Stephen De Young","text":"Right, right, right. And we actually read this twice at Pentecost because we read. We read from Joel at vespers the night before, and then this gets quoted in Acts."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2821.15,"end":2821.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2821.95,"end":2844.82,"speaker":"Fr Stephen De Young","text":"So we end up reading it again. But yeah, this is that primary locus. And there's a big shift here, right? Because in all three of those levels of phenomena that we talked about, the one thing that was consistent was we were always talking about individuals or small groups of individuals."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2844.9,"end":2846.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Just certain special people."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2847.3,"end":2892.88,"speaker":"Fr Stephen De Young","text":"But over against. Right. And this is. Joel is already emphasizing this difference, right. That it's all flesh, sons and daughters, young, old. Right. And even on male and female servants, Right. It's actually slaves. They're saying everyone, everybody. Right. And so you have these, you know, male, female, you have old, young. And then implied already is that. Well, yeah, kings would have it, but also slaves, which would be at the other end of the sort of social hierarchy, the sociopolitical hierarchy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2892.88,"end":2914.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And this is not only different from the way that it functions prior to this in the Old Testament, it's also going to be clearly different from the way that pagan religions understand enlightenment or interaction with the gods and so forth, is that suddenly now it's available to every single person and it's not just this esoteric elite, Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2915.6,"end":2945.69,"speaker":"Fr Stephen De Young","text":"But also a key difference all the way through this is part of why we're harping so much on agency, right. Is that in those other cultures, right, These quote unquote special people, right? The kings, the heroes, the culture heroes, right. These people had a divine identity. It was a question of identity."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2946.09,"end":2946.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2947.93,"end":2949.29,"speaker":"Fr Stephen De Young","text":"Not of relationship."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2950.65,"end":2951.69,"speaker":"Fr Andrew Stephen Damick","text":"They were gods."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":2952.25,"end":3007.26,"speaker":"Fr Stephen De Young","text":"Fundamental difference. Right? It's a fundamental difference. So a person filled with the Holy Spirit is not like the. The neutral good version of a neutral evil giant. Right. These are different, fundamentally different relationships with these spirits in question. Right. Because the person filled with the Holy Spirit, again, that is not just a possession of power that can be used how the person sees fit, and that does not identify all of their actions as divine actions. Quite the opposite. Right. There is a heightened potential for judgment is what we see play out in the Old Testament and even in the New Testament. I'm looking at you, Ananias and Sapphira."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3009.66,"end":3010.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3011.34,"end":3026.44,"speaker":"Fr Stephen De Young","text":"And so that's a fundamental difference. It's a fundamental difference. And that's the difference between what happens with a Nephilim and what happens with a saint who experiences theosis."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3026.68,"end":3027.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3027.72,"end":3036.28,"speaker":"Fr Stephen De Young","text":"Again, they're not just flip sides of the coin. Right. They're fundamentally different things."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3039.32,"end":3039.72,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3042.36,"end":3084.13,"speaker":"Fr Stephen De Young","text":"This we read from Joel because this is what gets quoted at Pentecost in the Acts of the Apostles. But this idea of the Spirit coming to dwell within everyone is fundamental to all of the passages that talk about the new covenant, like in Jeremiah 31 and in parts of Ezekiel. This is one of the marks of the new covenant being issued from the perspective of the prophets during and after the exile. In particular, that when the new covenant comes, there's going to be this shift and the Holy Spirit is going to come to dwell in everyone."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3084.45,"end":3084.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3084.93,"end":3105.66,"speaker":"Fr Stephen De Young","text":"And then we see that take place on Pentecost with the apostles, with the people who hear the preaching of the apostles on the day of Pentecost in Jerusalem. But then that plays out in a very particular way through the rest of the Book of Acts in terms of people receiving the Holy Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3105.82,"end":3106.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3107.98,"end":3131.83,"speaker":"Fr Stephen De Young","text":"And so there are. There are exceptional instances, but the normal pattern. Right, the normal pattern, and you see this, for example, in Acts 8, 17 through 19, and Acts 9, verse 17 and 19, verse 6, is that someone has been baptized, and then an apostle lays hands upon them."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3133.51,"end":3138.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then that gives that person the Holy Spirit. That's the means through which that happens."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3138.31,"end":3156.08,"speaker":"Fr Stephen De Young","text":"Right. And then the Holy Spirit comes into the person right after baptism, usually right after. Not in the case of the folks who were baptized by Saint John the Forerunner and didn't know who Jesus was. But for the most part, there's a little more time lag with those folks."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3157.2,"end":3162.8,"speaker":"Fr Andrew Stephen Damick","text":"And it's not an anointing at this point, it's just hands. Hands being put on people by the apostles."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3163.2,"end":3198.99,"speaker":"Fr Stephen De Young","text":"Right. And when you see an exception to that, that exception is there to make a point. So, for example, one of the Exceptions in the book of Acts is Cornelius the Centurion. Cornelius the centurion receives the Holy Spirit before he is baptized and without the laying on of hands. But why is that? Well, if you're reading Acts, Right. The whole build up to that is God sending St. Peter to go see Cornelius. And St. Peter's like the Gentile guy."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3199.55,"end":3203.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is a sign for Peter the Roman soldier."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3203.11,"end":3298.74,"speaker":"Fr Stephen De Young","text":"Right. He has the whole vision. Right. With the animals and everything. And then even when he gets there, he's kind of tentative. Right. And so when he sees that Cornelius and his household have received the Holy Spirit, the Spirit of God has come to dwell in them, then he's sort of like, well, I mean, for Pete's sake, right. We need to just go ahead and baptize you. Right. Because clearly this is the thing to do, sort of. It removes all doubts for him. And then in Acts 15, he testifies to that. And he uses that in Acts 15, talking to the other apostles to say, hey, they received the Holy Spirit. Right. If the Spirit of God comes to dwell in them, how can I not baptize them? So clearly, God has chosen to do this among Gentiles as well. So those are sort of exceptions that prove the rule. Right. Or that point to the rule and help us understand the rule. So the biggest question, I think, surrounding this is, okay, we've talked about it, like a theological level. We talked about it on a huge scope level in terms of the cosmos, then on a. On a smaller level with individual persons in the Old Testament. Now we're getting. Well, this is potentially everyone who's. Who comes to Christ, who's baptized."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3299.06,"end":3299.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3299.38,"end":3317.94,"speaker":"Fr Stephen De Young","text":"In the New Covenant. But what does this concretely do? And a lot of the time when that question is asked, and it's not just asked historically, it'll be asked about charismation now. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3317.94,"end":3321.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, should I feel different? Should I expect something to happen?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3322.22,"end":3341.1,"speaker":"Fr Stephen De Young","text":"You know, like, will I feel the whammy? Yeah. Is all of a sudden everything going to glow? Is. Is. Right. And I mean, there are. There certainly are people who, when they're baptized and when they're Christ, have various kinds of spiritual experiences. And this isn't to make fun of that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3341.18,"end":3342.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. It's a thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3343.18,"end":3354.44,"speaker":"Fr Stephen De Young","text":"But that is not primarily what happens. Meaning we don't charismate people to give them the experience of receiving the Holy Spirit. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3354.44,"end":3356.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As an experience. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3356.12,"end":3380.27,"speaker":"Fr Stephen De Young","text":"Right. So that's not the aim. That's not the purpose. That's something that sometimes accompanies it. Right. And so what, what are the things that this is actually doing according to the scriptures? Well, probably the first and most obvious is that the person begins to manifest the fruit of the Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3380.91,"end":3384.03,"speaker":"Fr Andrew Stephen Damick","text":"Right? Love, joy, peace, etc."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3384.19,"end":3387.07,"speaker":"Fr Stephen De Young","text":"Patience, kindness, goodness, faithfulness, gentleness and self control."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3387.47,"end":3388.11,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3388.67,"end":3392.03,"speaker":"Fr Stephen De Young","text":"I also know sleepy, happy, grumpy, dopey, sleazy, vashful, and talk."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3393.63,"end":3400.12,"speaker":"Fr Andrew Stephen Damick","text":"Wow, Dory, Nori, Ori. Yeah, some real dwarf names."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3400.2,"end":3407.36,"speaker":"Fr Stephen De Young","text":"Yeah. But so, I mean, and that's sort of obvious. They're called the fruit of the Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3407.36,"end":3408.44,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3408.44,"end":3410.04,"speaker":"Fr Stephen De Young","text":"That's why they're called the Fruit of the Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3410.28,"end":3439.49,"speaker":"Fr Andrew Stephen Damick","text":"You'll buy their fruits. I mean, like, it's, it's funny. I think sometimes it's so. I don't know. Assumed is the right word. But, but I've, I've seen this sometimes, you know, that, that if you say, well, is this person showing the fruit of the Spirit? Like, well, that doesn't matter. What matters is that they're right about this. You know, something like, like, well, the scripture kind of says, you know, you'll know them by their fruits, so it's okay to look at the fruits, you know?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3440.37,"end":3487.42,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, there's, there's an interesting. I won't go too far down this rabbit hole, but there's an interesting moment that happens when you really get into the writings of St. Augustine, as we all do, when he's involved in the Donatist controversy and he actually goes and meets some Donatists, just individuals who are part of Donatist churches, I should say. Right. These schismatic churches. And just. And he sees this love between the members of these communities, even though they're schismatic communities."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3491.66,"end":3492.06,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3494.14,"end":3502.86,"speaker":"Fr Stephen De Young","text":"You can tell as he writes about it, that it's kind of thrown his whole ecclesiology up in the air."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3503.58,"end":3507.42,"speaker":"Fr Andrew Stephen Damick","text":"No, because he expected to see that they were just all wicked and stuff. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3507.42,"end":3531.77,"speaker":"Fr Stephen De Young","text":"Because he's saying, how can these people, if they're cut off from the Church. Right. They've schismed from the Church, they've cut themselves off from the Church. And so how could they possibly be manifesting the fruit of the Spirit? How could the Holy Spirit possibly be acting within them collectively? Right. Within a schismatic community."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3532.57,"end":3533.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3536.33,"end":3561.4,"speaker":"Fr Stephen De Young","text":"And so it's too. I'm not going further down this rabbit hole because I don't want to get into all of St. Augustine's early and late ecclesiology, because that's off topic, but it is interesting. Right? So that, that he still had that understanding that, that of the fruit of the Spirit that when you see these, that means the Holy Spirit is there working within a person and working within a community. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3561.4,"end":3564.08,"speaker":"Fr Andrew Stephen Damick","text":"Because there's nothing good that doesn't come from God."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3564.32,"end":3564.64,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3564.64,"end":3565.68,"speaker":"Fr Andrew Stephen Damick","text":"No independent good."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3566.16,"end":3566.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3566.72,"end":3584.16,"speaker":"Fr Andrew Stephen Damick","text":"That's the thing. There's no independent good. And I mean, I'll just say, I know this is a bit of a rabbit trail, but I think it's worth pointing out, putting this out, because especially those of us who have, you know, cultural and theological inheritance from the Reformation, which probably everyone listening to this does on some level or another, whether they."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3584.4,"end":3585.2,"speaker":"Fr Stephen De Young","text":"Culturally, at least."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3585.2,"end":3609.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, culturally, yeah, at least. You know, there's this emphasis, like they'll take this where it says, you know, all your righteousness is as filthy rags and this kind of thing. And they'll basically say, well, someone might seem like they're doing good things, whatever, but it's actually just demonic garbage, like, well, no, it's not. All good things come from God. You know, all good things come from God."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3609.93,"end":3661.59,"speaker":"Fr Stephen De Young","text":"And, you know, I'm going to wrap it around and make it not completely off topic. So one question I get when I'm talking to people who have been in other Christian communities, not the Orthodox Church for a long period of time, and they're coming into the church and they're going to be Chrismated, and I say, well, this is Chrismation to receive the Holy Spirit. A very common question I get is, so you're saying I haven't yet. Right, Right. So you're saying I didn't before, that the Holy Spirit has not been acting in my life until I get Chrismated. Right. And the answer to that is no, that is not what we're saying."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3661.75,"end":3662.95,"speaker":"Fr Andrew Stephen Damick","text":"You wouldn't even be here."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3663.19,"end":3663.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3663.59,"end":3665.43,"speaker":"Fr Andrew Stephen Damick","text":"The Holy Spirit had not been acting in your life."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3665.96,"end":3673.16,"speaker":"Fr Stephen De Young","text":"Right. That's why I said it through St. Augustine's Ecclesiology up in the air. He didn't go become a Donatist."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3673.8,"end":3674.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3674.44,"end":3702.71,"speaker":"Fr Stephen De Young","text":"And he still thought the Donatists were dead wrong. Right. And that the schism needed to end, they needed to repent. Right. At least their bishops did. Right. But you can still acknowledge, not only. And this isn't just, oh, hey, there are good people, you know, that's not what we're talking about. They're good or nice or something. The Holy Spirit is at work in the world, all over the place. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3702.71,"end":3703.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3703.63,"end":3730.77,"speaker":"Fr Stephen De Young","text":"And the most obvious example of this would be, from my perspective, obviously, as an Orthodox priest. Right. I believe that the Holy Spirit brings people to the Orthodox Church. Right. Well, when he brings them to the Orthodox Church. They're outside the Orthodox Church. If the Holy Spirit only worked within the Orthodox church, no one would ever come."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3731.41,"end":3731.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3732.37,"end":3734.09,"speaker":"Fr Stephen De Young","text":"From outside we'd be one of those."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3734.09,"end":3736.29,"speaker":"Fr Andrew Stephen Damick","text":"Little sects where you have to be born into it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3736.37,"end":3762.32,"speaker":"Fr Stephen De Young","text":"We'd be like the Protestant reformed, cheap Dutch shot. But they're not listening to this anyway, so. Yeah. So it's not completely off topic. Right. So that isn't what we're saying. But the fruit of the Spirit are the evidence of that. Right. Why? Because those things aren't a human working."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3763.12,"end":3763.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3764.48,"end":3797.93,"speaker":"Fr Stephen De Young","text":"Right. Human love, like what we call love today, which is at best romantic love. Right. We'll go too far down the rabbit trail, either of love. But historically, when people talk about love, there's actually a Christian period. Love meant a certain thing in the pre Christian world, then there is Christian love. And then once you get to the high Middle Ages, that starts giving way to romantic love."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3798.84,"end":3800.12,"speaker":"Fr Andrew Stephen Damick","text":"And then you get baby, don't hurt."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3800.12,"end":3874.07,"speaker":"Fr Stephen De Young","text":"Me and then you get Freud. It becomes desire. It's just the first becomes desire. And now it's not even that. Now it's some kind of debased thing. So at best you get like romantic love out of humans, but actual Christian love. Right. The kind of peace that comes from Christ, not just, hey, that dude's real mellow. He's from California. Right. The fruit of the Spirit are God working. A human can't really do those things. That's God doing that in and through a person. And that's how we know the Holy Spirit is there. And this is also over against. Not to be mean, but got to point it out, our more Pentecostal friends, right. Who see certain kinds of miraculous and quasi miraculous manifestations as being the evidence of the presence of the Holy Spirit. And I don't think that's biblical. I think biblically, St. Paul tells us that the manifestations of the Holy Spirit are the fruit of the Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3874.87,"end":3875.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3876.15,"end":3912.54,"speaker":"Fr Stephen De Young","text":"And in fact, he explicitly says, and he mentions some of those other things, that if he has those that he doesn't have love, which is the first of the fruit of the Spirit, then it's all worthless. Right, Right. And I think that's because if he doesn't have the fruit of the Spirit, then that shows that those other things are coming from a different Spirit, not from the Holy Spirit. So rather than judging the presence of the Holy Spirit by those manifestations, I think biblically you would judge those manifestations by the presence of the Holy Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3913.02,"end":3919.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a miracle, sure. But is there Love and repentance and all that other stuff that we actually expect to see from the Holy Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3919.82,"end":3977.37,"speaker":"Fr Stephen De Young","text":"And the Scriptures are also really explicit that there could be lying signs and false miracles and. Oh, yeah, all sorts of things. So Fruit of the Spirit is one big piece of this. Right. There's another, I think, equally big piece tied directly to it by St. Paul. But that gets. Because of the Protestant cultural influence you mentioned, I think gets vastly underplayed. And that is that when you go back and read those new covenant passages in. In Joel and in Jeremiah and in Ezekiel, what you find is the other thing that the Holy Spirit is going to do is going to be to write the Torah on the hearts of those whom he indwells."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3977.93,"end":3988.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And the reason why that's especially important is that Pentecost as an Old Testament feast, because it's. It was. Is the feast of the giving of the law."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3989.31,"end":3999.07,"speaker":"Fr Stephen De Young","text":"Right. That's when the covenant was given at Mount Sinai. Yeah. And so the new Pentecost in Acts is when the new covenant is given."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":3999.71,"end":4000.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4000.51,"end":4003.87,"speaker":"Fr Stephen De Young","text":"And the new Covenant isn't toss the Torah in the trash."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4004.75,"end":4005.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4005.31,"end":4029.68,"speaker":"Fr Stephen De Young","text":"We've got this new thing now which is a little more ephemeral, so you can get away with more. This is. Right. This is the opposite. Right. This is the opposite. And that this is tied directly to the Fruit of the Spirit is made clear. The way that's usually interpreted is after the list, it says against such things there is no law."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4032.08,"end":4032.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4033.68,"end":4047.38,"speaker":"Fr Stephen De Young","text":"There is no commandment of the Torah. Right. Against those things. Meaning the reverse, that those things keep Torah. Right. Keep the law."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4048.58,"end":4050.9,"speaker":"Fr Andrew Stephen Damick","text":"Keeping in keeping. Yeah. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4050.9,"end":4075.93,"speaker":"Fr Stephen De Young","text":"And so this is. If you read this, will strike you immediately if you go and don't use the ancient Christian commentary on Scripture for this because everything's chopped up. Right. Grab St. John Chrysostom's homilies on Romans some afternoon that you have to kill."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4076.41,"end":4076.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4077.61,"end":4106.5,"speaker":"Fr Stephen De Young","text":"And go through the passages where St. Paul is talking about the Torah. He's talking about the law and its relationship to the Spirit. And what you will find is that St. John Chrysostom says over and over and over again that the Holy Spirit empowers the Christian to keep the law. The Holy Spirit empowers the Christian to keep Torah. That's what he says."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4107.7,"end":4116.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Straightforward. Yeah. I mean, I can't remember, is it in Ephesians where St. Paul says that you're saved for good works?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4117.14,"end":4117.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4119.08,"end":4123.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Meaning that the point of yours, that salvation has an actual goal."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4124.76,"end":4125.08,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4125.08,"end":4126.92,"speaker":"Fr Andrew Stephen Damick","text":"And it's not to be saved."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4127.72,"end":4172.08,"speaker":"Fr Stephen De Young","text":"Right. And it is impossible, Right? And this is in those New Covenant passages, right? That's the importance of this idea of the Torah being written on people's hearts. The importance of it is. And the no man having to teach his brother. Is that in their position, right? Jeremiah, the exile is happening. Everything is coming crashing down. The temple's on fire, right? Jerusalem is being sacked. People are being taken as slaves. As Ezekiel is writing. They're in exile, right? They can look at their own history and say, hey, this whole us trying to keep Torah thing didn't work out so well."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4172.77,"end":4176.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Didn't have what it takes, Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4177.41,"end":4205.88,"speaker":"Fr Stephen De Young","text":"We didn't pull it off. Right. And we're not going to make an excuse and say, well, we couldn't. What do you expect? Right? We're going to accept the consequences of our own actions and we're going to repent. Right? But the promises, right? The promise of the Spirit coming and dwelling people is that God is going to keep the Torah. He's going to keep his Commandments in and through us."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4208.76,"end":4209.16,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4210.04,"end":4230.21,"speaker":"Fr Stephen De Young","text":"Because God can do it. And for folks out there who are really well versed in Protestant Reformation theology, I know this undermines everything, right? But do the reading in the Scriptures on this, right? And look at what it says."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4232.29,"end":4232.61,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4232.61,"end":4247.41,"speaker":"Fr Stephen De Young","text":"Look at how the earliest fathers read and understood it, which is just this way. That this isn't a thing where Christ keeps the law, so keeps the Torah, keeps the law, keeps the commandments so we don't have to."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4249.9,"end":4250.14,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4251.98,"end":4265.74,"speaker":"Fr Stephen De Young","text":"It's the Spirit comes to dwell in us so that God keeps the Commandments in and through us. And keeping those commandments doesn't earn us eternal life. You can't earn eternal life."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4267.1,"end":4267.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4268.38,"end":4279.49,"speaker":"Fr Stephen De Young","text":"Not because we're humans and we're not powerful enough. Not because there's some standard and we can't meet it. You can't do is not a possible thing, Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4279.49,"end":4280.41,"speaker":"Fr Andrew Stephen Damick","text":"It's not how it works."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4280.57,"end":4284.89,"speaker":"Fr Stephen De Young","text":"It's like flying into space under your own power. You can't do it. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4285.05,"end":4288.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Keeping the Torah doesn't give you eternal life. It never was designed for that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4289.21,"end":4316.68,"speaker":"Fr Stephen De Young","text":"Right. That's not what it does. There's nowhere in the scripture that says, hey, if you keep the whole Torah, you will have earned eternal life. And to even think that way, you have to ignore the fact that there's the whole sacrificial system and everything that's in there for when you break commandments, right? So there's actually a whole bunch of people in Scripture who the Scriptures say kept the Torah, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4317.24,"end":4318.44,"speaker":"Fr Andrew Stephen Damick","text":"They lived Sinless lives."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4318.84,"end":4334.25,"speaker":"Fr Stephen De Young","text":"Yes. One of them is St. Paul. St. Paul says that he himself, as a Pharisee, before becoming a Christian, was blameless in terms of the Torah. Kind of throws a monkey wrench into a bunch of things, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4334.25,"end":4336.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4336.81,"end":4378.04,"speaker":"Fr Stephen De Young","text":"But that, that was never what the Torah was earning eternal life. Right. It's about. As we've talked about many times. You can go back to this episode, blessings and curses and that kind of thing. Right. But so those are the two core things. They're not unrelated. Right. The fruit of the spirit are the manifestation of the presence of the Holy Spirit, and they are how the Holy Spirit empowers the Christian to keep the commandments of God, which include one of the commandments, one of the primary commandments. It's actually One of Luther's 95 theses, believe it or not, is that we're commanded to repent. You can't keep that commandment if you never sin."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4380.6,"end":4381.32,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4381.32,"end":4383.32,"speaker":"Fr Stephen De Young","text":"Torah paradox. Yes."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4385.96,"end":4386.92,"speaker":"Fr Andrew Stephen Damick","text":"That could be a T shirt."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4388.68,"end":4393.48,"speaker":"Fr Stephen De Young","text":"Torah paradox. That could actually be like the opening act for Theophanic Glory Cloud."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4393.72,"end":4407.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right. There you go. They're the band that's just started out a little bit. You know, they're getting their feet wet. Yeah, yeah, yeah. All right. Well, all that said, we're going to go ahead and take a break, and we'll be right back."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4408.84,"end":4425.17,"speaker":"Announcer","text":"Father Andrew Steven Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4432.45,"end":4445.18,"speaker":"Fr Stephen De Young","text":"The Nativity season is a wonderful time to reach out to family and friends and wish them well with a Christmas card, this nativity. Share your faith with them as well by sending a beautiful Nativity card from."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4445.18,"end":4452.38,"speaker":"Fr Andrew Stephen Damick","text":"The Ancient Faith store. All of the Ancient Faith Christmas cards are vibrantly printed and feature images and."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4452.38,"end":4459.7,"speaker":"Fr Stephen De Young","text":"Words that point their recipients to Christ. Purchase your favorite packs of cards or several variety packs."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4459.7,"end":4461.58,"speaker":"Fr Andrew Stephen Damick","text":"If you can't choose just one favorite."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4462.86,"end":4472.79,"speaker":"Fr Stephen De Young","text":"Send your love and a bit of your faith this Nativity season with the help of Christmas cards from store.ancientfaith.com we're."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4472.79,"end":4488.59,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4490.43,"end":4547.46,"speaker":"Fr Andrew Stephen Damick","text":"You got your Christmas card sent out yet, Father Stephen? I'm gonna take that as a no. Anyway. Hey, Father you there? Do we lose you? I think we must have. Oh, man. I can do this all by myself now. All right, well. Well, while we wait for Father Stephen to come back, I just wanted to make sure that everybody pays attention to the fact that we have a conference that we're going to be doing next, October 26th through 29th, 2023, at the Antiochian Village. It is the Lord of Spirits conference. He and I are going to both be speaking. We've also got our friends, and I don't want to call them friends of the show because that's not always a positive thing, you know, to say, but our friends. It's true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4548.93,"end":4551.65,"speaker":"Fr Stephen De Young","text":"I love Bart Ehrman with all my heart. Do you?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4551.65,"end":4553.09,"speaker":"Fr Andrew Stephen Damick","text":"Are you, like, actual Buds?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4554.05,"end":4554.77,"speaker":"Fr Stephen De Young","text":"I wish."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4555.17,"end":4556.81,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, yeah. I don't know."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4556.81,"end":4558.13,"speaker":"Fr Stephen De Young","text":"Doesn't even know I exist."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4558.69,"end":4581.03,"speaker":"Fr Andrew Stephen Damick","text":"He may not, but yeah. So we're friends. Father Lucas Christensen, Father David Subu. They're going to be speaking and possibly some more. So it'll be a lot of fun. Go to store.ancientfaith.com events and you can sign up and you can see us in person and discover that we are, in fact, as we said in the very first episode, two separate persons."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4581.59,"end":4584.71,"speaker":"Fr Stephen De Young","text":"Yes. You will see us in the same room at the same time."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4584.79,"end":4586.95,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Absolutely."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4587.03,"end":4594.67,"speaker":"Fr Stephen De Young","text":"I also, before we continue, want to do my own commercial. Are you ready?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4594.67,"end":4596.07,"speaker":"Fr Andrew Stephen Damick","text":"I'm ready. Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4596.31,"end":4612,"speaker":"Fr Stephen De Young","text":"Okay. So if you are a big fan of this program and if you hear this live or in the next couple days, you need to go to Kickstarter, you need to search for historic vampire debate."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4614.48,"end":4615.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4615.28,"end":4621.68,"speaker":"Fr Stephen De Young","text":"And there you will behold a magnificent project which you will want to back."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4622.64,"end":4625.33,"speaker":"Fr Andrew Stephen Damick","text":"Are you involved in this somehow? No."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4625.33,"end":4627.61,"speaker":"Fr Stephen De Young","text":"Other than thinking it's awesome, you're just a fan."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4627.61,"end":4628.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4628.33,"end":4644.25,"speaker":"Fr Stephen De Young","text":"And so to. To those of you who might want me to do a commercial for your project, you could also go look. It has to be at least this cool. Wow. For me to do."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4644.65,"end":4648.09,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I'm seeing it. Who knows what this is about? But anyway."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4650.57,"end":4652.65,"speaker":"Fr Stephen De Young","text":"So go check that out in the next couple days."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4652.77,"end":4653.33,"speaker":"Fr Andrew Stephen Damick","text":"Here you go."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4656.53,"end":4658.13,"speaker":"Fr Stephen De Young","text":"But back to the topic at hand."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4658.37,"end":4663.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And hey, you know, everybody, you can give us a call. Yes, 855afraidio."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4664.77,"end":4669.41,"speaker":"Fr Stephen De Young","text":"Yes. Is it still a Fredio now that we're out of October?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4670.29,"end":4673.73,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I mean, it's always Halloween somewhere, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4674.61,"end":4678.29,"speaker":"Fr Stephen De Young","text":"Could we temporarily change the number to like, ho ho Hodio or something?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4680.44,"end":4681.56,"speaker":"Fr Andrew Stephen Damick","text":"I'll have to look into that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4681.88,"end":4685.36,"speaker":"Fr Stephen De Young","text":"Okay. I mean, you're the guy who works for the company. You're the company man."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4685.36,"end":4689.96,"speaker":"Fr Andrew Stephen Damick","text":"You need to. That's true. I am, but I don't. I'm not really. I don't do the telephony."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4690.92,"end":4693,"speaker":"Fr Stephen De Young","text":"Well, send a memo. Send a memo around."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4693.4,"end":4694.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4694.76,"end":4695.88,"speaker":"Fr Stephen De Young","text":"Did you get that memo?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4695.88,"end":4697.48,"speaker":"Fr Andrew Stephen Damick","text":"Trudy, get right on that, please."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4697.72,"end":4736.91,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, the memo. Get on making the memo. Yeah. So in this second half of the program, we're going to. As we said, we have a sort of Johannine structure here. We're going to circle back around. We talked in the first half about the indwelling, the filling of persons with the Holy Spirit. And so now we're going to come at this from sort of the other angle and talk about anointing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4737.39,"end":4751.23,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you know, it's funny you should say that, but we. We actually just got a call from someone who. Yeah, they want to ask about anointing. So, William from Tennessee, I think. William, are you there?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4752.19,"end":4753.79,"speaker":"Fr Stephen De Young","text":"I am. Fathers, can you hear me?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4753.95,"end":4758.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we hear you. Welcome, William, to the Lord of Spirits podcast. So what is on your mind?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4761.45,"end":4798.07,"speaker":"Fr Stephen De Young","text":"So my question is about the anointing oil used in the tabernacle. I was researching the Genesis. The Genesis creation accounts as a temple construction narrative, and I read that there is a parallel between the seven days of creation and the seven speeches that God gives to Moses for the tabernacle. But the article didn't go into detail about those parallels. And I was curious in particular about the connection between day four's creation of the sun, moon and stars in Genesis and Space 4 of the Tabernacle where God instructs Moses on anointing oil. So, one, is there a connection? And hopefully that's a monosyllabic answer. And two, what is it?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4799.59,"end":4801.91,"speaker":"Fr Andrew Stephen Damick","text":"I'm just gonna punt that right over you to father."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4801.91,"end":4802.95,"speaker":"Fr Stephen De Young","text":"You're just gonna punt?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4803.11,"end":4807.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, absolutely. I have no idea. I'm okay with that. I don't need."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4807.91,"end":4849.78,"speaker":"Fr Stephen De Young","text":"The monosyllabic answer is yes, yes, and the longer answer is yes, no. So this is a connection between. So the fourth day of creation. We have to understand. And if you're a lord of spirits listener, you probably already do. The sun, moon and stars in terms of heavenly beings. Angelic beings. Yep."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4849.78,"end":4850.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4852.26,"end":4861.94,"speaker":"Fr Stephen De Young","text":"And so this is referring to the. The coming into being of spirits and."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4864.74,"end":4865.38,"speaker":"Fr Andrew Stephen Damick","text":"The oil."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4866.34,"end":4882.41,"speaker":"Fr Stephen De Young","text":"The idea of anointing is connected. That you will see some people. We will try to make this argument that there is some connection between the Greek word for olive oil."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4882.89,"end":4887.61,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I know what you're going with this one. I know this one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4889.45,"end":4921.36,"speaker":"Fr Stephen De Young","text":"And the Greek word for mercy. Right, right. That is bogus. They're taking a particular conjugation of mercy and a particular conjugation for have, mercy for the verb, and a particular conjugation of the noun or declension of the noun for oil. That kind of looks similar to an English reader."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4922.8,"end":4923.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4923.28,"end":4929.08,"speaker":"Fr Stephen De Young","text":"I mean, but the two roots. Yeah, those two words have no connection. Going back to linear B. I verified this."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4929.32,"end":4937.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no etymological connection between them. They just happen to sound similar, which is okay if you're, you know, making puns. Like, that's fine."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4937.8,"end":4938.08,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4938.08,"end":4940.84,"speaker":"Fr Andrew Stephen Damick","text":"It's okay to do theological comments based on puns."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4941.16,"end":4941.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4941.72,"end":4943.76,"speaker":"Fr Andrew Stephen Damick","text":"But just etymology. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4943.76,"end":4945.44,"speaker":"Fr Stephen De Young","text":"Wordplay and stuff is fine. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4945.44,"end":4946.04,"speaker":"Fr Andrew Stephen Damick","text":"There's a."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":4946.12,"end":5057.21,"speaker":"Fr Stephen De Young","text":"But there is a direct connection between oil and the concept of grace. And one of the places where this connection is made explicit in the Orthodox Church is in the prayer that a priest prays when he puts on his stole or his epitrical that talks about God's grace upon the priest being like the oil that was used to anoint Aaron. Right. The. The high priest. It makes that connection. And grace, in our understanding, is divine action. Right. Grace for us is not like a created substance. As Orthodox Christians, it's not just God's mercy. Right. It's not just his favor, but it is God actually acting. Right. In the way that we've. That we've been describing, talking about the Holy Spirit. So you may see where this is going now. Right. So divine grace is really the acting of the Holy Spirit, and a connection is being made there with. With spiritual agency. So this has been a very long circuitous road to get to the point of when the objects are being anointed for the tabernacle, they are being removed from the world outside, where those objects even had spirits associated with them."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5059.93,"end":5060.49,"speaker":"Fr Andrew Stephen Damick","text":"That were."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5060.73,"end":5095.49,"speaker":"Fr Stephen De Young","text":"Because they're in the fallen world, not good. And by being brought in, they are now having spirits associated with them. The spirits who serve in the heavenly tabernacle. The angelic host. Right. Who worship along with us and participate in worship are being associated with them. And the marker of that new association is the anointing of the elements of the tabernacle. So that would be what I see as the connection between the two."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5097.09,"end":5100.21,"speaker":"Fr Andrew Stephen Damick","text":"Does that answer your question, William? It does."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5100.21,"end":5101.09,"speaker":"Fr Stephen De Young","text":"Yes. Thank you."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5101.49,"end":5103.97,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Awesome. Well, thank you very much for calling."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5105.89,"end":5111.09,"speaker":"Fr Stephen De Young","text":"All right, so tell me. Tell me the truth. Halfway through that, did you have any idea where I was going?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5111.56,"end":5111.8,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5112.28,"end":5112.84,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5113.8,"end":5118.36,"speaker":"Fr Andrew Stephen Damick","text":"This is all new to me. I may need to repeat it to me later, actually."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5118.36,"end":5120.44,"speaker":"Fr Stephen De Young","text":"So I think we recorded it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5120.44,"end":5121.56,"speaker":"Fr Andrew Stephen Damick","text":"So we did Record it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5121.56,"end":5123.04,"speaker":"Fr Stephen De Young","text":"Hey, that's. That'll make it easier."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5123.04,"end":5127.56,"speaker":"Fr Andrew Stephen Damick","text":"I could go back and listen to podcasts. Who listens to podcasts?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5128.6,"end":5130.2,"speaker":"Fr Stephen De Young","text":"I don't listen to my own, but."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5130.6,"end":5133.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5133.64,"end":5135.24,"speaker":"Fr Stephen De Young","text":"Okay. Listen to other people's."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5137.1,"end":5152.54,"speaker":"Fr Andrew Stephen Damick","text":"But I used to listen. I used to listen. I used to listen my own, to kind of go back and. And, you know, critique what I was doing, but now it's just, like. It's just too much, and I got to listen to other stuff, so. Yeah. Yeah. The Shatner rule. Right? He never watches any of his own stuff."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5152.54,"end":5160.14,"speaker":"Fr Stephen De Young","text":"No, he's never watched a single episode of Star Trek. Yeah, the only movie he's watched is 5, and he had to watch it because he directed it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5160.54,"end":5161.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5161.7,"end":5165.61,"speaker":"Fr Stephen De Young","text":"Might have wanted to watch it a little closer. Whoa."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5166.81,"end":5168.57,"speaker":"Fr Andrew Stephen Damick","text":"What does God need with a starship?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5168.57,"end":5172.09,"speaker":"Fr Stephen De Young","text":"You got to be honest, you know, no one's perfect. Even Shatner."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5172.17,"end":5184.01,"speaker":"Fr Andrew Stephen Damick","text":"I have. I have a. I have a warm, weird spot in my heart for Star Trek 5. I don't know. I'm not saying it's good, but there's something in me that kind of likes it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5184.49,"end":5188.45,"speaker":"Fr Stephen De Young","text":"Well, part of it, too, is there's been worse since. Right, it's true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5188.45,"end":5192.51,"speaker":"Fr Andrew Stephen Damick","text":"It's true. And then we got Star Trek vi, which is the greatest of them all, in my opinion."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5192.59,"end":5204.43,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, it's like the Star wars prequels were terrible. Then they came out with that sequel trilogy, and it's kind of like, I can put my thumb in front of Jar Jar."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5207.87,"end":5215.39,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, we're going to lose a few more listeners if we could keep going on about Star Trek and Star wars for too long. That's okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5215.39,"end":5215.87,"speaker":"Fr Stephen De Young","text":"In some."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5216.22,"end":5217.58,"speaker":"Fr Andrew Stephen Damick","text":"We'll gain some new ones. Yeah, that's true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5217.58,"end":5233.02,"speaker":"Fr Stephen De Young","text":"Right, Right. So, yeah, so as. As I was saying, we're gonna. In this second half, we're going to come back at this from the perspective of anointing. Right. The anointing of people."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5233.74,"end":5234.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5234.22,"end":5269.39,"speaker":"Fr Stephen De Young","text":"In this half, and then once we complete this circle, we'll see how those connect with the circle we made last. Last half. So when you think about anointed ones. Right. When you hear the word anointed One, most folks, at least from a Christian background, immediately think, okay, Anointed one. Right. Messiah. Mashiach in Hebrew."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5269.86,"end":5270.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5270.18,"end":5276.74,"speaker":"Fr Stephen De Young","text":"Christos in Greek. The anointed one. Right. The Messiah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5277.14,"end":5277.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5277.62,"end":5330.92,"speaker":"Fr Stephen De Young","text":"Sort of this. This singular figure. But in. In the Old Testament, there are actually a number of different figures who are anointed. Right. The king is anointed when he's made king. So this happens to Saul Happens to David in the hands of Samuel, the prophet comes and anoints the king. And as we mentioned when we were talking about this, historically, after the Western Roman Empire collapsed in Western Europe, the only thing really providing any kind of overarching social order was the Western church."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5331.4,"end":5331.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5332.84,"end":5386.65,"speaker":"Fr Stephen De Young","text":"And so as the Western church and a beleaguered populace is trying to figure out how to create new social structures with the various tribes of our barbarian ancestors, they took some socio political cues from the Old Testament. And so you pretty quickly have the anointing of kings. Some of these tribal chiefs and leaders are made kings by anointing by a bishop, by the bishop of Rome, sort of as the way of. Right, well, will default to the Bible in terms of form of government here. Right. But that brings with it that anointed status, that anointing ritual. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5386.65,"end":5393.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I think what, in just a few months here, we'll get to see Charles, King of England, anointed. This is still a thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5394.01,"end":5401.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. He was already not quite an anointing, but there was that fellow who threw eggs at him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5403.13,"end":5403.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5403.41,"end":5404.25,"speaker":"Fr Stephen De Young","text":"Did you hear about that?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5404.73,"end":5407.05,"speaker":"Fr Andrew Stephen Damick","text":"No, but what spirit did that grant him? I'm not sure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5407.45,"end":5418.65,"speaker":"Fr Stephen De Young","text":"Well, he was throwing eggs at him. And this is absolutely true. He was sentenced with a ban from the possession of eggs in a public place."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5420.81,"end":5421.29,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5421.37,"end":5423.13,"speaker":"Fr Stephen De Young","text":"Which is just the most British thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5424.01,"end":5424.89,"speaker":"Fr Andrew Stephen Damick","text":"That's so fake."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5424.89,"end":5427.77,"speaker":"Fr Stephen De Young","text":"You, sir, may now never possess eggs in a public place."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5428.06,"end":5430.54,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that really feels like it's a python sketch."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5430.62,"end":5433.02,"speaker":"Fr Stephen De Young","text":"Yeah. But it is absolutely true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5433.74,"end":5434.22,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5434.54,"end":5475.09,"speaker":"Fr Stephen De Young","text":"He cannot be trusted with eggs. Well, he had his kids, but. So that is not an anointing. But. No, but that's where it comes from in terms of European kingship. So in a sense, every king was an anointed one. Right. And that's probably pretty familiar in thinking again, to most people from a Christian background, because the Messiah is of course. Right. We're familiar thinking of the Messiah is going to be the king. Right. The king of Israel, the Davidic king in particular. But right. Priests were also anointed."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5477.01,"end":5477.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5478.05,"end":5575.29,"speaker":"Fr Stephen De Young","text":"As part of the ordination. Right. Priests and the high priest, any given time, were anointed. And in our next episode, two weeks from today, shortly before Christmas, we're going to be talking about ordination and holy orders and that kind of thing. And so we'll talk more about that there. Right. But for now, priests are also anointed and prophets were also anointed in some cases, particularly when we see sort of prophetic succession in the Old Testament, when we see like there are communities of prophets, or we see one prophet sort of initiate or hand over sort of the prophetic ministry to another prophet that's often explicitly accompanied by anointing. And so even though we're not necessarily now, as Christians, used to thinking about it this way, in Second Temple Judaism, for example, in the Second Temple period, there is an idea of messiahs, Right. That there are different ways in which the coming Messiah, the coming anointed one, is thought of. So the one we're used to is one of those. The one we're used to is. This is the Messiah, the son of David. Right? The king descended from David."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5575.53,"end":5576.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5577.69,"end":5603.38,"speaker":"Fr Stephen De Young","text":"As God had promised to David. That's slightly different in Chronicles and in First Samuel, but. Or First Kingdoms. But the promise was either a child of your. A son of yours will always reign on your throne, or a son of yours will always reign on my throne, my being God's throne."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5603.7,"end":5606.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And this is definitely a por quino los dos."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5606.82,"end":5661.94,"speaker":"Fr Stephen De Young","text":"Yeah. Right. So and David then was both a model of the kind of person or the kind of king that the Messiah would be. Right. David is sort of presented as the ideal king, especially in first and Second Chronicles, which doesn't talk about the whole Bathsheba thing, but it's also then the sort of fulfillment of the Davidic monarchy. Right. Of that institution or that continuity leading from David himself. Right. And yeah, again, we're all used to that. Christ is born in Bethlehem, royal David city, all that. Right, yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5661.94,"end":5662.26,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5664.26,"end":5699.19,"speaker":"Fr Stephen De Young","text":"But what's less well known to us today probably is that there are also a lot of Second Temple texts that talk about a messiah who is a priestly messiah. So a messiah who is a son of Levi rather than a son of David, a Levitical messiah. And one of those sort of exhibit A of this tradition is a text called the Testament of Levi."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5700.15,"end":5703.27,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what's that? Probably most people have not read that one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5703.67,"end":5707.99,"speaker":"Fr Stephen De Young","text":"Right? Well, it's part of the testament of testaments of the twelve patriarchs."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5708.47,"end":5709.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5709.51,"end":5789.1,"speaker":"Fr Stephen De Young","text":"But so testament in this case isn't like the Old Testament or the New Testament. Testament is a genre of Second Temple Jewish literature. And it's based around Genesis 48 and 49, where Jacob, Israel, the person, is on his deathbed and he sort of gives these prophetic words to each of his sons. And so that becomes a genre in the Second Temple period where all of these figures. There's a testament of Adam, there's a testament of Abraham, there's a testament of Isaac. Right. Everybody gets testaments. And so there's a Collection called the Testament of the twelve Patriarchs. And those are Joseph and his brothers. And each of them has a testament. Each of them has sort of a sub document that's part of this larger text. But it seems pretty clear that the individual testaments that are now in the Testament of the twelve Patriarchs also circulated separately because we found individual ones in different places."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5789.34,"end":5789.98,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5791.02,"end":5824.55,"speaker":"Fr Stephen De Young","text":"So the Testament of Levi in particular, Levi, of course, is one of those brothers. Right. He's the one from whom the Levites descend, who are going to be priests. And so these are always written as if. So it's written as the frame is. This is Levi giving his parting words to his son. But of course, it's portrayed as prophetic. It's portrayed as Levi is prophesying these things in advance. But of course this is being written post."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5825.19,"end":5825.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5825.83,"end":5828.47,"speaker":"Fr Stephen De Young","text":"Exile and return long, long after."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5828.47,"end":5829.91,"speaker":"Fr Andrew Stephen Damick","text":"So it's a literary thing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5830.23,"end":5837.83,"speaker":"Fr Stephen De Young","text":"Right, right. And so it includes things that happened in the intervening time and then things that are still future, still too happen."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5837.83,"end":5838.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5838.35,"end":5865.96,"speaker":"Fr Stephen De Young","text":"From the time it was written. Right. We found the Testament of Levi on Mount Athos where all 12 testaments are preserved. We've also found it in the Dead Sea Scrolls. So this pre Christian Jewish kind of schismatic community also had copies of the Testament of Levi. So pretty widespread thing. And something that's been preserved by Christians."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5866.28,"end":5867.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Good. Providence."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5868.36,"end":5959.52,"speaker":"Fr Stephen De Young","text":"Yeah. And we also have a lot of. Because of that providence, we can compare. Right. If anything's a later change or addition, we can kind of figure it out. But so as one might expect, through the Testament of Levi, it's talking about the priesthood. Right. And how the priesthood was going to not go so well over the course of the history of Israel and Judah. But it then prophesies a restoration of the priesthood and the temple. And this is going to come. Now, at this point that it's being written, the second temple was there. We'll talk about that a little bit more in the third half. So this isn't restoration as in rebuilding, but there's going to be a restoration of the priesthood in the temple, and it has in the Testament of Levi. And this is reflected in several other of the testaments of the twelve Patriarchs too. There are two different messianic figures. There is a Messiah, a messianic king who's descended from Judah, and there's a Levitical Messiah, a priestly Messiah who is descended from Levi. And from the perspective of the Testament of Levi, the Levitical, the priestly Messiah is the more important one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5960,"end":5960.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5960.68,"end":5970.12,"speaker":"Fr Stephen De Young","text":"Well, of course so at one point, it presents the priestly Messiah as being like the Son and the kingly Messiah as being like the moon."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5970.84,"end":5971.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":5971.64,"end":6003.71,"speaker":"Fr Stephen De Young","text":"To give you an idea. So both very important. Right. But one more than the other. Right. And so this idea that there are these two messiahs with two different characters actually gets reflected in a couple places in the New Testament. A good example of that is there's this episode where after St. John the Forerunner has been imprisoned by Herod, he sends messengers to Jesus who ask him, are you the one, or should we expect another?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6004.35,"end":6005.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6006.11,"end":6024.12,"speaker":"Fr Stephen De Young","text":"And a lot of times people read that as well. You know, St. John at the beginning of all four Gospels makes this really strong testimony that Jesus is the Messiah. And so it's often read as if, like, he was doubting himself now that he was in prison."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6025.08,"end":6025.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6026.84,"end":6048.15,"speaker":"Fr Stephen De Young","text":"But that's because people don't understand that this tradition was out there. What St. John was really asking was like, is there a second Messiah coming? Right. He was not taking back his identification of Jesus as the Messiah. He was asking for a clarification. Right. Are you one of two messiahs?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6048.31,"end":6048.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6048.67,"end":6079.04,"speaker":"Fr Stephen De Young","text":"Are you? How is this going to work now that you are the Messiah and you have come? Right. Because that was not immediately obvious. There were different traditions at that time. Right. This being one of them. And then we're probably at least generally familiar with the idea that that's king and priest, the idea with. With prophet, that there was a strong tradition of Elijah returning."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6079.28,"end":6080.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6082.32,"end":6090.8,"speaker":"Fr Stephen De Young","text":"And that was directly related to the coming of the Messiah. Right. And again, this would be an."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6090.8,"end":6091.28,"speaker":"Fr Andrew Stephen Damick","text":"At least."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6091.68,"end":6097.04,"speaker":"Fr Stephen De Young","text":"This would mean at least two kind of messianic figures, one of whom was Elijah, one of whom was a prophet."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6098.33,"end":6098.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6099.93,"end":6110.53,"speaker":"Fr Stephen De Young","text":"And so we see this reflected in the New Testament when Christ asks his disciples, who do people say that I am? And one of the immediate answers is, some say Elijah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6110.53,"end":6111.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Some say you're Elijah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6113.69,"end":6123.37,"speaker":"Fr Stephen De Young","text":"And also the questions regarding the identity of St. John the Forerunner. Right. You know, it is said elijah will come. Christ says, Elijah has already come."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6123.7,"end":6123.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6123.82,"end":6206.65,"speaker":"Fr Stephen De Young","text":"And points to St. John the Forerunner. Right. So there are potentially up to three. Right. Messiahs. There is also a fourth messianic figure who kind of emerges in Judaism. This is my take on this. Right. So the reason I'm couching this as my take is I think I can defend my take on this, but I'm not going to take all the time now it would take to defend my take on this. Okay, Right. So future blog post. Yes, listeners, citations needed. Right. So I'm not fully going to go into this, but for the sake of covering the ground, we need to mention it. So there is another messianic figure that goes very far back in Rabbinic Judaism and I think actually emerges in the Second Temple period. Although this messianic figure becomes more clearly defined as you move forward in time. Right. Within Jewish communities. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6206.65,"end":6207.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6207.49,"end":6227.46,"speaker":"Fr Stephen De Young","text":"And this is not a thing that you see in Christian communities. And that's part of the reason for my take. Right. And this is sometimes called the Messiah Ben Ephraim, meaning the Messiah, who's the son of Ephraim, as opposed to the son of Levi or the son of David. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6227.78,"end":6228.42,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6229.46,"end":6262.75,"speaker":"Fr Stephen De Young","text":"And so this is a figure. To understand this figure, you have to understand the tradition. And I know we've talked about this on the show, and I've talked about it other places. There is this prophecy. Not just a prophecy. It's a. It's a theme in several of the prophets in. In the Hebrew Bible or the Old Testament, in which Ephraim, meaning Israel, the northern kingdom."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6262.99,"end":6263.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6263.31,"end":6297.1,"speaker":"Fr Stephen De Young","text":"The northern tribes, 10 tribes are going to be reconstituted. Right. That when God finally delivers Israel, when the Messiah comes, new covenant, when all this goes down, all of Israel will be regathered, meaning all 12 tribes. Because Judah or Judea is like two and a half. Right. So the rest of these tribes will be regathered. That is like materially impossible."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6298.06,"end":6298.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6298.94,"end":6301.22,"speaker":"Fr Stephen De Young","text":"If you're thinking of this in an ethnic sense. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6301.22,"end":6303.74,"speaker":"Fr Andrew Stephen Damick","text":"What could that mean? Yes, Right, Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6304.38,"end":6313.47,"speaker":"Fr Stephen De Young","text":"Because those tribes get resettled by the Assyrians, they intermarry over the course of a few generations, they disappear as a. As distinct entities. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6313.87,"end":6314.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6314.43,"end":6429.73,"speaker":"Fr Stephen De Young","text":"And so there comes to be a very strong tradition in Second Temple Judaism that the way this is going to happen is through the Gentiles coming into some kind of covenant relationship with the Judeans. Right. With the Jewish people that will cause them to take the place of those lost tribes and be part of the reconstitution of Israel. One of the other testaments in the testaments of the twelve patriarchs, the Testament of Naphtali, everybody's favorite tribe, because nobody can remember who or what it is. But the Testament of Naphtali, which was one of the lost tribes. Right. That's why it comes up here in. I believe it's chapter five, verse eight, but I might be reversing that. It might be eight. Five just explicitly says that like the Assyrians, the Babylonians, the, you know, a whole list of foreign nations will receive a part in Israel Right. Through the exile of The Northern Kingdom or through the captivity of the Northern Kingdom. So there's this tradition. Right. And so there comes to be the later you go. Right. And the first place I know of where you see this clearly is in Second Enoch, which is sometimes called Slavonic Enoch because we have it preserved for us in Slavonic that clearly seems to describe this figure, a Messianic figure, a messiah figure, who is going to bring about this reconstitution. Meaning who is going to bring these Gentiles in."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6430.21,"end":6430.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6432.13,"end":6448.67,"speaker":"Fr Stephen De Young","text":"To sort of reconstitute those tribes. And so second Enoch is written probably between 70 and 80 A.D. somewhere."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6448.67,"end":6449.19,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6449.75,"end":6452.11,"speaker":"Fr Stephen De Young","text":"So first century A.D. so Christians are."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6452.11,"end":6454.87,"speaker":"Fr Andrew Stephen Damick","text":"Around, but not in Slavonic, obviously."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6454.87,"end":6457.83,"speaker":"Fr Stephen De Young","text":"No, not in Slavonic. It's preserved in Slavonic."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6457.83,"end":6460.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We don't have the. What probably Greek original."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6461.67,"end":6463.11,"speaker":"Fr Stephen De Young","text":"We think it's actually Aramaic."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6463.27,"end":6464.39,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6464.39,"end":6466.71,"speaker":"Fr Stephen De Young","text":"Because there are some Aramaic words that are transliterated."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6467.59,"end":6468.07,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6470.79,"end":6477.11,"speaker":"Fr Stephen De Young","text":"But so. But it's written in the first century A.D. so it's written while there are Christians around."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6477.95,"end":6478.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6478.83,"end":6502.43,"speaker":"Fr Stephen De Young","text":"And the albeit general description of this Messianic figure, who's not referred to as the son of Ephraim here in second Enoch, but is referred to as just the man, the man who comes, sounds a whole lot like Jesus."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6505.32,"end":6505.56,"speaker":"Fr Andrew Stephen Damick","text":"In terms."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6505.56,"end":6515.4,"speaker":"Fr Stephen De Young","text":"Of being rejected by his own people, going out to the Gentiles, bringing them to worship the God of Israel."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6516.44,"end":6520.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay. But the text is probably not written by Christians. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6520.52,"end":6522.04,"speaker":"Fr Stephen De Young","text":"It is not written by Christians."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6522.04,"end":6527.48,"speaker":"Fr Andrew Stephen Damick","text":"Not written by Christians. So these are non Christian Jews who have an opinion about Jesus having."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6528.12,"end":6531,"speaker":"Fr Stephen De Young","text":"Right. That's my take on it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6531,"end":6534.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Maybe having some kind of messianic role."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6535.56,"end":6556.84,"speaker":"Fr Stephen De Young","text":"Right. So there is. And my take, Right. And like I said, if I was going to take another three, four hours, I could lay this all out. But my take is that that tradition emerges within Judaism as a tradition."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6558.57,"end":6558.81,"speaker":"Fr Andrew Stephen Damick","text":"Of."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6559.93,"end":6595.36,"speaker":"Fr Stephen De Young","text":"Non Christian Jewish people who are looking at Jesus and at Christianity and at Gentile Christians. And even from the point of second Enoch, seeing this as number one beneficial to the Jewish people. Right. Because it decreases the hostility of those Gentiles toward Jewish people as turning them from idolatry. Right. As turning them from sexual immorality. Right. So they're seeing these positive things from their Jewish perspective."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6596.72,"end":6598.32,"speaker":"Fr Andrew Stephen Damick","text":"These are all net goods. Like you."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6600.16,"end":6604,"speaker":"Fr Stephen De Young","text":"See these good things. It's sort of like St. Augustine seeing the fruit of the Spirit and the tinnitus."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6604,"end":6604.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6604.4,"end":6621.46,"speaker":"Fr Stephen De Young","text":"They're looking at. They're not ready to accept Jesus as the Messiah. Right. But they're seeing these things happen with the Gentiles, maybe he's their Messiah. Right. And that's essentially what I think the tradition is, is maybe he's the gentile Messiah and our Messiah is still coming."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6621.78,"end":6622.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, interesting."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6623.62,"end":6650.99,"speaker":"Fr Stephen De Young","text":"So that is, that is a real thing. And I have, I have talked to an Orthodox Jewish friend who has told me that that is still a live concern within Judaism. Like that's not just an early tradition from before Judaism and Christianity completely separated. That's through history, that has been an element of Jewish tradition and a perspective."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6651.31,"end":6652.59,"speaker":"Fr Andrew Stephen Damick","text":"What do you do with Jesus?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6655.15,"end":6777.22,"speaker":"Fr Stephen De Young","text":"But back to our main thrust here. What connects sort of the idea of the Kingly Messiah, the idea of the priestly Messiah, the idea of the prophetic Messiah. Right. Is the idea of restoration. Right. So the Davidic Messiah is the one who's going to return the kingdom to Israel. Right. Who's going to restore the Davidic monarchy, who's going to restore sort of socio political Judea, Judah, Israel. Right. The way, for example, the testament of Levi sees the priestly Messiah, the priestly Messiah is going to come and restore the priesthood. Right. Reconsecrate the temple, restore the priesthood to what it should have been. Right. And Elijah is going to come to restore prophecy. Right. And so the, each of these Messiahs, however these different messiahs are conceived, they're coming to restore sort of the job or the task or the purpose of that office. Right. But also then through exercising it right, there is going to be this transformation of the world, right. Through the Messiah being the king, that's going to bring about this transformation of the social order and the spiritual order. Right. Through the Messiah being the priest, this is going to transform worship in a positive direction connected to that restoration. So it's not just about restoring institutions."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6778.14,"end":6778.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6778.38,"end":6787.82,"speaker":"Fr Stephen De Young","text":"But it's restoring institutions and then through those restored institutions, transforming the world, bringing about a new messianic age."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6788.14,"end":6795.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because I mean, it's the same dynamic then as being saved for good works. We're not saved to be saved."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6796.14,"end":6796.54,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6796.62,"end":6798.46,"speaker":"Fr Andrew Stephen Damick","text":"We're saved to be effective."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6798.94,"end":6812.2,"speaker":"Fr Stephen De Young","text":"Right. And yeah, folks who have managed to stay awake for the whole episode so far, hopefully all of you who are driving are probably seeing connections here."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6813.16,"end":6813.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6813.72,"end":6832.37,"speaker":"Fr Stephen De Young","text":"In terms of what we were talking about with the Holy Spirit filling people and now what we're talking about with the idea of being anointed, right. Being the anointed one. And those two are not something that gets put together like in later Christian theology."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6833.57,"end":6833.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6834.85,"end":6850.05,"speaker":"Fr Stephen De Young","text":"The idea of being filled with the spirit or the Spirit coming to abide in someone and being anointed is there right from the beginning. Exhibit A. You can look at 1st Samuel or 1st Kingdom, 16, 13 Samuel anoints David. He's filled with the Holy Spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6850.61,"end":6853.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. These things just go together and they always did."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6853.25,"end":6964.03,"speaker":"Fr Stephen De Young","text":"Right. So this isn't just sort of a. Oh, that seems kind of similar. Like these things are connected. Right. And they're so connected that when we get to the New Testament. So, for example, in St. John's Gospel, in John, chapter one, verses 32 through 40, 34, the sign that's given to St. John, the forerunner, to identify Jesus as the Messiah, as the Christ. Right. Is that the Holy Spirit comes and rests upon him and abides on him. Right. St. John is told, the one who you see that happen, that's him. So the Holy Spirit is this Messianic marker. Right. And so that connection isn't just a connection for these Old Testament figures who are anointed, which is, again, some certain individuals for particular tasks. Right. And it's not just Christ who is the anointed one, the Christ the Messiah par excellence, who does all this. Right. This is. This is part of why Hebrews spend so much time pointing out that Christ is both king and high priest, by the way, and the one who restores the priesthood and restores worship, but in the same way as what we talked about in the first half with the Holy Spirit. Now all Christians are anointed, not just literally with chrism after their baptism, but that's what Christian means."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6964.59,"end":6967.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, an anointed person."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6968.03,"end":6969.67,"speaker":"Fr Stephen De Young","text":"Yes. Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6969.67,"end":6989.15,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting, you know, like in certain sectors of, I don't know, especially Pentecostalism, anointing becomes largely a metaphorical term. You know, like he's got an anointing to preach, which is, you know, like this idea that anointing has to do something to do with a particular function is good. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6989.15,"end":6991.79,"speaker":"Fr Stephen De Young","text":"But being empowered by the Holy Spirit for some function."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":6991.79,"end":7010.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It becomes like, well, this person has an ability to do this thing. So that means they have an anointing from God. It's like, well, did they get anointed? You know, which is. It's just pointed as being a kind of a spiritual experience, you know, rather than any oil actually being transferred onto the person."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7010.75,"end":7016.11,"speaker":"Fr Stephen De Young","text":"Right, right. Where it's disassociated from the material and the community. Yeah, yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7016.11,"end":7016.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7016.51,"end":7030.12,"speaker":"Fr Stephen De Young","text":"So David wasn't just didn't receive a kingly anointing. Right. In a spiritual sense, but an actual prophet walked up with oil and anointed him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7030.12,"end":7031.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Put oil actually on him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7031.64,"end":7045.85,"speaker":"Fr Stephen De Young","text":"Right. And so these things are connected. Yeah, I think. I think that's trying to be winsome and ironic."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7047.21,"end":7048.49,"speaker":"Fr Andrew Stephen Damick","text":"Are so winsome, though."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7049.61,"end":7119.67,"speaker":"Fr Stephen De Young","text":"I think this is a. I think this is a difficulty not confined to our charismatic friends, but I think this is an across the board issue in a lot of. But not all, but a lot of. I mean, this gets back to something we were talking about in the last episode about the Eucharist. Part of the reason why it's so hard to number the sacraments and decide what is and isn't a sacrament or what is and isn't a mystery in the Orthodox Church is that fundamentally for us, when we're talking about sacraments or mysteries, we're talking about God acting through. Because that's what grace is, God acting through and within and permeating and transforming the material. Right. And that's something God does throughout the world all the time. So it's not that it's hard for us to identify things as sacraments. It's hard for us to identify things as not sacraments other than sin. Right. Like sin is very clearly not a sacrament. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7120.55,"end":7142.92,"speaker":"Fr Andrew Stephen Damick","text":"It's just like, you know, and I know I've mentioned this before on the show. In one of his homilies, St. Nikolay Vlimirovich says, you know, what is a miracle? A miracle is just a gift of God at which men marvel. But everything is, you know, everything is a gift from God. Everything, therefore, that comes from God is a miracle. But we just use that word to describe certain miracles."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7143.48,"end":7183.91,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so there's not that firm. Right. Distinction. So again, other than sin, sin can never be a sacrament contra certain Jesuit universities. But, yeah, almost everything else is. Whereas in a lot of. But not all Protestantism, when these terms are used, they're used in ways that do the exact opposite. They're used in ways that separate the spiritual from the material."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7184.31,"end":7185.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7185.91,"end":7198.47,"speaker":"Fr Stephen De Young","text":"Rather than seeing them as united. Right. So, you know, before a baptism, baptismal regeneration needs to be firmly denied. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7198.55,"end":7200.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I remember in my."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7200.15,"end":7201.11,"speaker":"Fr Stephen De Young","text":"This is doing anything."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7201.51,"end":7211.52,"speaker":"Fr Andrew Stephen Damick","text":"My evangelical, you know, upbringing, before almost every baptism I witnessed, there would be a little sermon about how baptism doesn't actually do anything almost every time."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7212.64,"end":7223.68,"speaker":"Fr Stephen De Young","text":"And so. Yeah. And so they're divided. So it's not just the concept of anointing without there being someone there actually anointing someone. Right. But it's across the board with a lot of these things."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7224,"end":7224.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7225.84,"end":7235.29,"speaker":"Fr Stephen De Young","text":"Where, Obviously. Right, right. And so that is a reaction to. And we talked about this a little bit last time."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7235.45,"end":7235.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7236.09,"end":7304.01,"speaker":"Fr Stephen De Young","text":"It's a reaction to a woodenly literal identification of those things. Right. So on one hand you have someone who says, we know who I'm talking about. But anyway, you have someone who says that if someone hasn't been baptized and they die, even an infant. Right. That they go to hell for eternity. Right, right. So it's the actual psychographic. That's it. If you've had it, you're good. If you haven't, that's it. Right. And the sort of terror that strikes into people for obvious reasons, to the point where you've got folks trying to do baptisms on miscarried children, man. Yeah, right. So you've got that. So you can understand reacting against that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7304.33,"end":7305.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7305.29,"end":7310.97,"speaker":"Fr Stephen De Young","text":"And saying, look, God's not legalistic like that. God's not bound by that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7311.32,"end":7318.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That's, that's, that's the magical. That's magic. That's magic. It's, you know, like, like the perfect formula and technique."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7318.92,"end":7324.2,"speaker":"Fr Stephen De Young","text":"And to be fair to them, right. The folks who take that view strongly would say, well, God has bound himself to that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7324.6,"end":7325.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7325.48,"end":7348.67,"speaker":"Fr Stephen De Young","text":"By choice, voluntarily. Right. So we've got to be fair. But I, you see, reacting to that strongly and saying, no, God's not bound by that. God's not restricted by that. God's love is bigger than that. Right. That, that doesn't work. Right. But then you move too far in the other direction of, well, don't even worry about that. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7348.83,"end":7349.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7350.11,"end":7352.71,"speaker":"Fr Stephen De Young","text":"Like that's sort of generally unimportant. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7352.71,"end":7402.73,"speaker":"Fr Andrew Stephen Damick","text":"Ethereal. Yeah, yeah, I recall, and I don't know, correct me if I get this wrong, but I recall reading one time a critique of an ecclesiology that starts with the Holy Spirit as being an ecclesiology that is excarnated, you know, because it doesn't, it doesn't. It's not ecclesiology that involves the, the material world. Right. Which is because Christ's incarnation is material, you know, that, that the, the self anointed prophet, the self ordained bishop or whatever, you know, someone who doesn't actually have to have a connection to anybody else is this kind of pneumatological ecclesiology, you know, this reaction extremely in the other direction."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7402.73,"end":7409.49,"speaker":"Fr Stephen De Young","text":"Like you're saying, right, right. Or just, you know, you have an invisible church that has literally nothing to do with the visible church."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7409.73,"end":7411.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7411.41,"end":7412.93,"speaker":"Fr Stephen De Young","text":"They're literally two different things."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7413.25,"end":7413.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7414.05,"end":7417.57,"speaker":"Fr Stephen De Young","text":"And no one has the power to excommunicate someone from the invisible church."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7418.13,"end":7436.75,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, and this is what. So there's no discipline, no Church, Right, Exactly. In the Reformation you get a lot of anti bishop stuff. And weirdly that pops up every so often, you know, anti bishop stuff. It's really pretty convenient not to actually be accountable to anybody."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7438.11,"end":7552.63,"speaker":"Fr Stephen De Young","text":"So. Yeah, so that I think is a general trend. And like I said, that's not every Protestant person, that's not every Protestant group. Right. But it's a lot, especially in America. There's a lot of. Especially American evangelicalism. Right. Is in that category of being very. There's a big disconnect between this, the spiritual and the material in that regard, rather than them being brought together. And so that's the primary thing we're actually saying in Chrismation when we say that you're anointed to receive the Holy Spirit, is that we're bringing those two things together at a point in time. And so the. The Christ goes beyond, right, fulfills, fills full. He doesn't just restore the monarchy, he doesn't just restore the kingdom, he doesn't just restore the priesthood, he doesn't just restore the temple and worship, he doesn't just restore prophecy. Right. Christ restores humanity right through the Incarnation. And so Christians as anointed ones are in being baptized and Chrismated become part of this new, restored and transformed humanity in Christ that he brought about with His Incarnation first and foremost. But so this is what. I'm sure I've said it on this show. I forget where I say things, there's things I say all the time. But I'm sure I've said it at some point in the show that the idea of justification originally, like in St. Paul, has nothing to do with courts. It's much more like justification in a word processor."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7553.11,"end":7554.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Line it up."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7554.94,"end":7660.98,"speaker":"Fr Stephen De Young","text":"Yeah. Left justified, lined up on the left. Right justified lined up on the right. Full justified lined up on both sides. Right. Put back in order, justice restored, that order restored. And so when humanity is restored, we are put back in order as a person, as a created being, and then once put back in order and repentance is the ongoing nature of this, we also receive a calling. And we can also then be correctly described as the elect, the chosen. The way the New Testament actually uses those terms. Sorry, Calvinists. Because the concept of being called and being chosen in the Scriptures always transitive meaning called is not a status. Chosen is not a status. It's not like USDA choice meet. Right. You're the best, you're the one God loves the most. It's always transitive. You're always called to something, called to do something. Called to be something, chosen for something. Right. It's true across the board. Right. Israel, God's chosen people, Right. That doesn't mean they were the ones who he loved the most. The Old Testament. They were chosen for a purpose, to be a light to the nations, to the other nations, the 70 nations."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7661.7,"end":7662.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7663.39,"end":7703.16,"speaker":"Fr Stephen De Young","text":"To be the nation through which he would bring forth the Messiah. Right. So Israel was chosen for purposes, for particular purposes, for things. And the same is true of us. If you are a Christian, if you are an anointed one, that means God is putting you back in order and he has called you and chosen you for particular things. And in St. John's Gospel, lo and behold, Christ says to his disciples that they had been chosen to bear much fruit. Right back where we ended the first half."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7703.16,"end":7707.4,"speaker":"Fr Andrew Stephen Damick","text":"Yep, exactly. All right, we're going to take another little break and we'll be back with the third half."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7708.52,"end":7724.81,"speaker":"Announcer","text":"Father Andrew Stephen Damick and Father Stephen DeYoung will be back in a moment to take your calls on the next part of the of the Lord of Spirits. Give them a call at 855-237-2346. That's 855, AF radio."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7729.85,"end":7817.22,"speaker":"Fr Andrew Stephen Damick","text":"Hi, I'm Father Andrew Stephen Damick and with my co host Father Stephen DeYoung. I'm one of the podfathers behind the Ancient Faith Radio Live Call in program, the Lord of Spirits. Father Stephen and I have been blown away by the overwhelming success and popularity of our little show about angels, demons, saints and yeah, giants too. Apparently there's a real hunger out there for content that addresses the spiritual reality that permeates all of creation in spite of the rampant materialism of modern society. But did you know that this programming on Ancient Faith Radio is only made possible by its listeners? Not only Lord of Spirits, but all of the live shows on AFR Orthodoxy Live Ancient Faith Today. Everyday Orthodox Search the Scriptures, Live with the lows and stewardship calling. All of these owe their existence to the generosity of people like you. Without your monetary support, there wouldn't be marathon discussions of Zeus or Hades or the Nephilim on Thursday nights. There wouldn't be an ancient faith radio at all. Take the opportunity today to add your contribution to those of the other faithful AFR fans who help keep shows like Lord of Spirits on the air. Participate in the ministry of Ancient Faith Radio. Partner with us to bring the Orthodox Christian faith to the world. Become a donor today by going to ancientfaith.com and clicking on Donate in the upper right hand corner. Thanks in advance for your support."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7825,"end":7841,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7842.68,"end":7850.66,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for voice of Steve. We're back now with the third half. It's always weird to me to hear those promos with my own voice on him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7851.14,"end":7853.7,"speaker":"Fr Stephen De Young","text":"Yeah, I wish you'd. You, you'd brought me in on that one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7854.18,"end":7855.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7856.58,"end":7867.9,"speaker":"Fr Stephen De Young","text":"Yeah. Because first of all, background music. I know we gotta keep it public domain. Right. But I mean, okay, beat. You can't dance to it, though. Needs a little more bass. Too much treble."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7867.9,"end":7868.86,"speaker":"Fr Andrew Stephen Damick","text":"This would be exciting."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7868.86,"end":7883.02,"speaker":"Fr Stephen De Young","text":"Yeah, well, we could, you know, and second, second most importantly, if I had been there, so there were two of us. Right. You could have tweaked the ending a little and done the thank you for your support a la Bartles and James."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7883.26,"end":7884.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7884.86,"end":7888.78,"speaker":"Fr Stephen De Young","text":"Which would have really sold it right there. It's true."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7889.42,"end":7890.62,"speaker":"Fr Andrew Stephen Damick","text":"Man. That brings me back."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7891.74,"end":7892.78,"speaker":"Fr Stephen De Young","text":"Yeah. Wow."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7893.1,"end":7894.3,"speaker":"Fr Andrew Stephen Damick","text":"Thank you for your support."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7895.02,"end":7910.07,"speaker":"Fr Stephen De Young","text":"Yeah. And I admit, although Die Hard is a great Christmas movie, I admit that I preferred those Bartles and James commercials to Bruce Willis singing about Seagram's golden wine cooler."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7914.15,"end":7919.99,"speaker":"Fr Andrew Stephen Damick","text":"I have to say, up until this moment, I had never considered comparing those two things."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7922.15,"end":7925.03,"speaker":"Fr Stephen De Young","text":"And I don't know to this day which one was Bartles and which one was James."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7926.44,"end":7928.04,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. I don't know that either."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7928.04,"end":7930.92,"speaker":"Fr Stephen De Young","text":"And if they were the actual people or actors playing Bartles in."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7930.92,"end":7936.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know. Look up, write in. I'll read all your emails."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7936.28,"end":7946.36,"speaker":"Fr Stephen De Young","text":"Yes, yes, Someone listening right now who's not driving. Go ye to Wikipedia and find these answers. Yes, you've been called to a very pointless purpose."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7947.56,"end":7949.16,"speaker":"Fr Andrew Stephen Damick","text":"Is there even a Bartles and James?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7950.04,"end":7952.44,"speaker":"Fr Stephen De Young","text":"Well, there must have been a Bartles and James at some point."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7952.52,"end":7955.08,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. It could just be names that they pulled out to."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7955.69,"end":7960.29,"speaker":"Fr Stephen De Young","text":"Could be. Or there could be some kind of 18th century, you know, raconteurs or something."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7960.29,"end":7967.45,"speaker":"Fr Andrew Stephen Damick","text":"You start this company and then. Okay. All right, let's talk about the tabernacle. What do you think? Okay."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7968.97,"end":7981.3,"speaker":"Fr Stephen De Young","text":"So, yeah, so this third half, we're going to be moving to the other element, which, thanks to our caller in the second half, which was William, I believe, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7982.34,"end":7983.86,"speaker":"Fr Andrew Stephen Damick","text":"Yes, William of Tennessee."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7984.1,"end":7995.94,"speaker":"Fr Stephen De Young","text":"Yes, William of Tennessee. Not to be confused with his official title, Tennessee Williams. Are you preparing him for sainthood? St. William."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7995.94,"end":7998.42,"speaker":"Fr Andrew Stephen Damick","text":"If we did really have Tennessee Williams, though, that would be amazing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":7998.58,"end":7999.7,"speaker":"Fr Stephen De Young","text":"That would be amazing."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8001.3,"end":8002.98,"speaker":"Fr Andrew Stephen Damick","text":"Have to make him just sing into the phone."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8003.14,"end":8008.3,"speaker":"Fr Stephen De Young","text":"Or Jack Daniels from Tennessee. Talk about liquor. This half, I guess."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8009.58,"end":8009.98,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8013.66,"end":8053.47,"speaker":"Fr Stephen De Young","text":"We already got into this a little, talking about the anointing of the elements of the tabernacle. But within the dedication of the tabernacle and the dedication of the temple, we see some of the same things in terms of anointing. And we're going to see in terms of filling with the Holy Spirit, the presence of God, the spirit of God that we saw with people in the first two halves. And so here's cycle three. Hopefully we'll connect this third. Third spiral to the other two. So the first one."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8053.63,"end":8069.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was just gonna. I just had to say. I couldn't help myself. I looked it up. Bottles and James are just fictional characters. What? They're not even real. Yeah, they're based on. They're based on Ernest and Julio Gallo, but they're fictional characters."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8070.42,"end":8072.5,"speaker":"Fr Stephen De Young","text":"99% of my life I was lied to."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8072.74,"end":8075.3,"speaker":"Fr Andrew Stephen Damick","text":"I'm so sorry. I'm so sorry."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8075.94,"end":8077.94,"speaker":"Fr Stephen De Young","text":"So I'll recover."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8079.94,"end":8082.42,"speaker":"Fr Andrew Stephen Damick","text":"Didn't mean to demoralize you here at the end of the show."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8083.62,"end":8118.88,"speaker":"Fr Stephen De Young","text":"I'll soldier on through this final half. So the first one of these buildings, obviously, as we already talked about a little, is the tabernacle, which gets dedicated in Leviticus, chapters 8 and 9, after the construction is finished, from which we have a couple of excerpts. We're not going to read you the whole of both chapters. Yeah, they're very involved if you want to go read them. Great stuff about waving parts of animals in the air and all kinds of cool stuff. But, yeah, we'll keep it short and to the point now."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8119.36,"end":8175.37,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. So Leviticus, chapter 8, verses 10 and 11. Then Moses took the anointing oil and anointed the tabernacle and all that was in it and consecrated them. And he sprinkled some of it on the altar seven times and anointed the altar and all its utensils and the basin and its stand to consecrate them. Okay, now skipping ahead to chapter nine, verses 22 through 24. Then Aaron lifted up his hands toward the people and blessed them. And he came down from the offering, from offering, the sin offering and the burnt offering and the peace offerings. And Moses and Aaron went into the tent of meeting, and when they came out, they blessed the people. And the glory of the Lord appeared to all the people. And fire came out from before the Lord and consumed the burnt offering and the pieces of fat on the altar. And when all the people saw it, they shouted and fell on their faces. That's what I'd do if I saw that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8176.33,"end":8427.04,"speaker":"Fr Stephen De Young","text":"Well, in the next chapter, fire again comes out from before the Lord and Nadab and Abu Darren's two sons from here. Right. But so you see this same kind of pattern. There is this dedication which includes anointing. Right. Includes other things too, but so does our baptismal service. And then that is followed by being filled with, right, with the presence of God, with the Holy Spirit manifesting himself in this visible and glorious way, the Theophanic glory cloud. And so the Holy Spirit is present in the tabernacle. We see this at several points through the rest of the Torah, the cloud, how Moses would go into the tent of meeting to meet with the Lord and the cloud would descend and no one could enter. And so when the time comes to dedicate the temple, right there. There are a number of differences between the building of the Tabernacle and the building of the temple. The biggest and most obvious one is that as we already mentioned in Exodus, you get laid out twice in quick succession all the detailed measurements of everything. What the tent curtains are supposed to be made out of, what's supposed to be on them, the recipe for the incense. Right. Like everything in all of this detail. Right. And in the temple you get kind of nothing. Right. There's no detailed instructions or non detailed instructions or any of that. Yes, it's sort of. David gets all the stuff and has a plan, isn't allowed to execute the plan. Solomon, we think, executed the plan according to what David did. It's kind of iffy, you know, when you compare Chronicles and First Kings or third kingdoms. But all that aside and. Well, and I'll add, when Solomon goes and prays his prayer of dedication, there is a certain discontinuity between his prayer and Yahweh, the God of Israel's response. Solomon's prayer is stuff like grant all the requests of those who pray toward this building, which reflects one view of what a temple is. We talked about this when we talked about the view of the ancient world, that the temple itself was a body of a God. And then when God responds, he basically says, well, look, I don't live in a building made by human hands. I'm not contained by this and you can't use this to control me. Makes that all very explicit, and then says, but. And then God sort of condescends, right. To come and be present in the temple. Right. And once he's made those important clarifications, we see going forward, especially the book of Jeremiah, that Those clarifications did not necessarily sink in to all the people and descendants, but. But nonetheless, God does consent to come and be present in the Temple for worship in Jerusalem. And you can read the dedication in First Kings or Third Kingdoms. 8 In 2 Chronicles 7, it talks about this same kind of glorious Theophanic chlori cloud manifestation as the Holy Spirit, the presence of God comes and fills the temple. Right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8427.2,"end":8427.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8428.56,"end":8501.47,"speaker":"Fr Stephen De Young","text":"And so this is this very powerful. We know. Look, it happened. And Ezekiel, of course, from exile in Babylon, he was deported early. There were several deportations to Babylon from Judah. And he, in his vision, sees Yahweh, the God of Israel, leaving the temple before it gets destroyed. Right. Departing. But so then an interesting thing happens, because 70 years after the first temple is destroyed, the people of Judah are allowed to go back, and they end up founding what becomes the Persian province, and then the Greek province, and then the Roman province of Judea, briefly the independent kingdom of Judea. And of course, they rebuild the temple and rededicate it. But when they do that in Ezra, there's something that's notably absent from the description when you compare these descriptions to each other."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8502.59,"end":8558.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So In Ezra, chapter 3, verses 10 through 13, we read this. And when the builders laid the foundation of the temple of the Lord, the priests in their vestments came forward with trumpets, and the Levites, the sons of Asaph, with cymbals to praise the Lord according to the directions of David, king of Israel. And they sang responsively, praising and giving thanks to the Lord, for he is good for his steadfast love endures forever toward Israel. And all the people shouted with a great shout when they praised the Lord, because the foundation of the house of the Lord Lord was laid. But many of the priests and Levites and heads of fathers, houses, old men who had seen the first house wept with a loud voice when they saw the foundation of this house being laid. Though many shouted aloud for joy so that the people could not distinguish the sound of the joyful shout from the sound of the people's weeping. For the people shouted with a great shout, and the sound was heard far away."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8560.27,"end":8575.54,"speaker":"Fr Stephen De Young","text":"So there's joy, there's sorrow over the loss of the first Temple. Right. There's worship, but at least no visible sign of anything happening."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8576.02,"end":8577.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Unlike last time."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8578.02,"end":8676.49,"speaker":"Fr Stephen De Young","text":"Right. Nobody falling on their face, nobody unable to enter because of the cloud of glory, Nothing. Right. And of course, then, as we go forward in history, you can also look at Nehemiah 2, 11, 20, as we go forward in history, that temple, the second temple in its first form gets desecrated by Antiochus IV Epiphanes after he lost a war with the Ptolemaic ruler of Egypt. He blamed his loss on the fact that the Judeans refused to worship the Greek gods. And so that's why the gods hadn't favored him with victory. And so he went and sacrificed pigs on the altar, the temple in Jerusalem, to Zeus. And so this obviously desecrated the temple. And it wasn't restored until during the Maccabean revolt when Judah the Hammer and his brothers came and were able to liberate at least a good chunk of Judea from the Greek overlords and rededicate the temple. And that's described in first Maccabees."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8676.89,"end":8741.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is in chapter four. This is verses 52, 59. Early in the morning on the 25th day of the ninth month, which is the month of Chislev, in the 148th year, they rose and offered sacrifices. The law directs on the new altar of burnt offering, which they had built at the very season, and on the very day that the Gentiles had profaned it. It was dedicated with songs and harps and lutes and cymbals. All the people fell on their faces and worshiped and blessed heaven who had prospered them. So they celebrated the dedication of the altar for eight days and offered burnt offerings with gladness. They offered a sacrifice of deliverance and praise. They decorated the front of the temple with golden crowns and small shields. They restored the gates and the chambers for the priests and furnished them with doors. There was very great gladness among the people and the reproach of the Gentiles was removed. Then Judas and his brothers and all the assembly of Israel determined that every year at that season, the days of the dedication of the altar should be observed with gladness and joy for eight days, beginning with the 25th day of the month of Chislev."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8743.85,"end":8746,"speaker":"Fr Stephen De Young","text":"And so that's the origin of Hanukkah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8746.79,"end":8747.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8747.31,"end":8751.07,"speaker":"Fr Stephen De Young","text":"Which has it started yet? I know it's soon."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8751.07,"end":8752.87,"speaker":"Fr Andrew Stephen Damick","text":"If it hasn't started yet, I am not sure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8755.75,"end":8777.84,"speaker":"Fr Stephen De Young","text":"But. Right, so this is where the feast of Hanukkah comes from. And you notice everyone's happy. It's good. They offer the sacrifices. Temples up and running again. Says they did things according to the Torah. People fell on their faces in worship. But there's no record of nothing about the presence of God."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8778.48,"end":8780.08,"speaker":"Fr Andrew Stephen Damick","text":"No Theophanic glory cloud."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8780.4,"end":8855.2,"speaker":"Fr Stephen De Young","text":"Right. No expression of God's glory. Right. And so that temple goes on to get built out and added onto, in particular, by Herod. Herod the Great starts the process, spends time, decades. Right. Building up around it, building the whole sort of platform with the embankments. Right. To support it, so he could keep expanding it as one of many building projects in Roman Judea. But there's never any record of any kind of manifestation of God's presence. And in fact, you start getting evidence to the direct contrary. A big piece of that evidence, for example, would be when the Roman General Pompey comes to annex Judea, because those same Maccabees we were just reading about, the Asmodeans, made a treaty with the Romans to help keep the Greeks away, and that didn't work out so swell."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8856,"end":8859.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They sold Judea to the Romans, essentially."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8859.44,"end":8899.62,"speaker":"Fr Stephen De Young","text":"Yeah, essentially is what happened. Yeah. And so the Romans came and annexed it, but they sent the General Pompey to do that. And when he arrived, he insisted on going into the holy of Holies because no one was allowed to go back there. And the Romans considered it a great mystery. Right. What was back there. And so he using, you know, the Roman legions, plowed past the priests, went into the temple, went into the holy of Holies. Not only saw nothing there when he went in, but nothing happened to him."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8900.26,"end":8903.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which I'm sure."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8903.7,"end":8904.18,"speaker":"Fr Stephen De Young","text":"Dead."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8904.66,"end":8905.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8908.36,"end":8909.56,"speaker":"Fr Stephen De Young","text":"Wasn't slain in the spirit."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8912.12,"end":8912.76,"speaker":"Fr Andrew Stephen Damick","text":"Literally."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":8913.48,"end":9073.68,"speaker":"Fr Stephen De Young","text":"None of. No death by holiness. None of these things happened. Right. He just walked back out. Right. And told all the Romans, wow, that's weird. Nothing's there in the temple. I don't know why they didn't want anybody to see that there was nothing there. So all of this, you know, in. In the popular mind of Judean people, that they're aware that there's something wrong. And this created for a wide swath of different Jewish groups in the Second Temple period, different levels of ambivalence and sometimes outright rejection of that temple. So, like the folks at Qumran who wrote the Dead Sea Scrolls, rejected it completely, said it was not a legitimate temple at all. The Sadducees, of course, embraced it because they controlled it. The high priesthood was their source of wealth. So they were great with it. Right. But so there were these different theories as to what the problem was. So there are folks like, as we saw in the Testament of Levi. Right. Reflected there, who thought the problem is the priesthood, that these were to be the Zadokite priests, the descendants of Zadok, were to be the high priests of the new temple. And these are not them, even though they call themselves Sadducees. Right. The Zadokites, they're not really. And they're corrupt, incredibly corrupt. And so that's the problem. And so they saw, this is part of what they understood, as we mentioned in the second half, that this Levitical Messiah, this priestly Messiah would not. Would fix the priesthood and by restoring the priesthood and purifying the priesthood, would thereby restore and purify the Temple. Right. And that one of the signs that that had happened would be the presence of God, the glory of the Lord returning to the Temple. Right. The Pharisees, like I said, this ambivalent relationship, they thought, well, this is really the Temple, right. They didn't reject it completely. But the problem was that sort of the land, the area around the Temple, Jerusalem, they weren't fond of the Sadducees either, were defiled because of the sins of, of the people, the uncleanness of the people."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9074.08,"end":9080.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is why they're obsessed with trying to get everybody to keep the law perfectly and then God can come back."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9080.96,"end":9249.23,"speaker":"Fr Stephen De Young","text":"The strictness of the Torah was, hey, and it. There's a certain logic to it, right. Like we got sent into exile in the first place because of our sins, our unrepentant sin, right. So if we want God to come back and dwell among us, we need to all get our acts together and repent and keep the commandments, right. So, but that, that, and that is part, that ambivalent relationship is part of why the party of the Pharisees was able to survive the destruction of the Temple and become Rabbinic Judaism is that they were already kind of detached from that temple, right. And so it was not as great as loss. Right. The Sadducees ceased to exist because once the temple's gone, because that's all they had. But the Pharisees are able to keep moving. But in general, we could say that in some way when the Messiah comes, he'll fix this, right. Whether it's priestly version, whether it's right, that that would be the fix, right. That would be the thing that would restore God's presence dwelling among the people. So the perspective that the earliest Christians, meaning the apostles, take in the New Testament, is that that is in Jerusalem, certainly a temple, but that the new temple, the promised new Temple, the new temple of the new covenant, is actually Jesus. It's actually Christ himself is the temple. And they're drawing on what was already a pretty strong current in second Temple Jewish thought. And that is that the temple described by Ezekiel, back to Ezekiel in exile, the last, probably about a third of the Book of Ezekiel is his description of this temple, this new temple. And part of that description is about the glory of the Lord entering into that temple, by the way. So, I mean, that was an explicit part of. And so that's also a piece, right? Well, this certainly isn't Ezekiel's temple, because the glory hasn't entered, but there already was. Within Second Temple Judaism, there was never an attempt at any of these stages, Right? And. And maybe with Ezra and Nehemiah, they couldn't do it. They didn't have the resources, but the Maccabees probably did. And Herod definitely had the resources to build whatever he wanted to, but none of them tried to actually follow the measurements and build Ezekiel's temple."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9250.76,"end":9253.2,"speaker":"Fr Andrew Stephen Damick","text":"So there's a sense that you're not supposed to do that, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9253.2,"end":9410.38,"speaker":"Fr Stephen De Young","text":"There was no attempt because there was already this idea in Second Temple Judaism that Ezekiel's temple, this final temple, the sort of eschatological temple, is a temple not made with human hands, not that humanity somehow sullies it, right? And as we saw, the tabernacle was. Was sort of made by God with human cooperation, right? Because the Holy Spirit was involved, but human hands not involved, right? That's what this new temple will be. And so that means it's not any physical temple that anyone's going to build in the city of Jerusalem. That idea was already there. And so St. John does this in particular, but it's really a theme through most of the New Testament that Christ is. Right? His body in particular. This is the place where the Holy Spirit. This is the place where God comes to dwell among his people eternally, is in the person of Jesus Christ. And St. John is the one who, you know, in all the Gospels, you get the saying of Jesus, you know, destroy this temple and I will rebuild it in three days. Right? You get it in various forms. But St. John is the one who adds sort of the parenthetical note. He was speaking about the temple that is his body, right? Just in case you were like, it didn't click for you, right? Let's hammer this home. He's talking about his body. And so. And this is also why, sticking with St. John at the end of the Book of Revelation, he makes the point that in the new heavens and the new earth, there is no temple because God and the Lamb dwell among them, right? So Christ is the temple. So there's not a literal Ezekiel's physical temple that shows up at the end. Christ is that temple. And so Christ is both the messianic person, right? The person who is the anointed one, Right? He is also the temple which was also anointed, right?"}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9410.38,"end":9410.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9412.23,"end":9472.21,"speaker":"Fr Stephen De Young","text":"So he restores the temple himself. Right. And so again, for those still awake, hopefully all of you driving at this point in the episode, right. We end up in a very similar place to where we ended up at the last two halves. Because of course, Christ is the fulfillment of this. Right. But Christians, every Christian is also described as the temple of the Holy Spirit as very directly by St. Paul in First Corinthians 6:19, right? Your body is a temple of the Holy Spirit. And so Christians bodies are anointed to become the temple of the Holy Spirit, to be filled with the Holy Spirit and the temple, the tabernacle and then the temple, they're the place where the presence of God is in the world in a unique way. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9472.21,"end":9477.21,"speaker":"Fr Andrew Stephen Damick","text":"Because God is present everywhere, but not in the same way. Everywhere."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9477.53,"end":9670.99,"speaker":"Fr Stephen De Young","text":"Right, Right. So it's not. He's not in the temple as opposed to everywhere else. Right. But he's there in a unique way. And so the presence of God is in the world in a unique way in his people, in Christians. Right. So we've talked about, we're looping around back to Genesis. We're heading where we began. We've talked about before how the calling, the thing for which Adam and Eve were chosen was to go out of paradise into the world and take paradise, the temple which was paradise with them, to go and continue putting the world in order and filling it with life, to turn the whole of creation into a garden, to a well tended garden that is abundant in life. And so the way that this happens now is that anointed Christians as the temple, as paradise in whom God dwells, are sent out into the world to bring God and to bring paradise, the place where God dwells with them. And we made this big deal in this half about this contrast between the dedication of the tabernacle in the first temple and then the dedications and rededications of the second temple. Right. And to quote at least the King James translation of the long ending of Mark, the signs attending. Right. When that happened. Right. So earlier we took a little bit away from our charismatic friends. Now we're going to give a little back. This is part of the function of what's going on with all of the signs and miracles that we see in the Gospels and Acts. Right. Why all this? Right. These are the indicators that just as the lack of any kind of signs pointed to the lack of God's presence in the rebuilt temple, the presence of These signs surrounding Christ, who is the new temple with the presence of God and Christians, who are the temple of the Holy Spirit, is an identification and an indicator. Right. That these people are the place. Right. That Christ is the temple, the fulfillment of the temple, and then that Christians, these people are the place where God is dwelling, are the place where interaction with God happens Right. Through these people. And so these signs are not limited to exorcisms, healings, raising the dead, etc. Etc. They do, however, include those."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9671.55,"end":9672.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9672.43,"end":9683.58,"speaker":"Fr Stephen De Young","text":"Right. So charismatic friends compared to us orthodox. You're cessationists. We still have saints raising the dead and stuff."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9684.78,"end":9693.02,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know what? There is. What was the guy's name? Wigglesworth, Claimed he could raise the dead. I don't know if he did or not, but."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9695.82,"end":9698.86,"speaker":"Fr Stephen De Young","text":"So all that is still part of it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9698.86,"end":9699.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9699.22,"end":9741.06,"speaker":"Fr Stephen De Young","text":"To this day. And it especially happens when you look at church history. Right. The frequency those things become the most frequent during times when the gospel and through the gospel of Christ is coming to a new part of the world. That's when those kind of identifying signs are the most frequent. You could go and just do a quick. It'd be interesting to do this in detail for somebody, actually go and study how many enlighteners of different places were also wonder workers."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9741.62,"end":9742.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9746.66,"end":9771,"speaker":"Fr Stephen De Young","text":"But. So it includes that, but it's not limited to that. And sometimes we limit miracles to that. Right. But repentance is a miracle. Salvation is a miracle. Right. Someone who is deeply lost in sin, repenting and coming to Christ and having their life transformed is actually a much, much greater miracle than someone being healed."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9773.4,"end":9773.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9774.36,"end":9779.56,"speaker":"Fr Stephen De Young","text":"Physically of a physical disease. Right. Or even somebody being physically raised from the dead."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9780.68,"end":9782.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we have saints that say that."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9783.31,"end":9811.92,"speaker":"Fr Stephen De Young","text":"Yeah. So those are also miracles that accompany this. And the fruit of the Spirit in their full embodiment, as we've talked about to wrap this all up together are miraculous. The kind of love, the kind of joy, the kind of peace that is had in Christ that is not of human origin. Right. Is likewise miraculous."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9812.32,"end":9812.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9813.36,"end":9825.6,"speaker":"Fr Stephen De Young","text":"So hopefully through these three cycles, I don't know if we'll ever structure an episode this way again, but through these three cycles, we've connected some of these things for folks."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9826,"end":9826.52,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9826.52,"end":9828.32,"speaker":"Fr Stephen De Young","text":"Or just made them dizzy. One of the two."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9828.48,"end":9830.8,"speaker":"Fr Andrew Stephen Damick","text":"Hey, hopefully no one ran off the."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9830.8,"end":9833.6,"speaker":"Fr Stephen De Young","text":"Side of the road, spun them right round. Like a record."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":9834.89,"end":10075.8,"speaker":"Fr Andrew Stephen Damick","text":"Like a record. Well, I don't have a lot of voice left, but a couple things I wanted to kind of point to at the end, you know, especially when we're talking about sacraments, there can be, because of our cultural theological inheritance, a desire to, you know, ask the what question a lot. I mean, and I get it. I mean, we want to know what. What is this? Right? And someone who's been Chrismated, what is he? And asking what exactly Chrismation is and all that sort of thing. But I think if we leave our questions there, and that's the most important thing to us. I'm not saying it's not important. It's important, sure. But if that's the most important thing, then we have a problem, because there's a purpose to these sacraments. They're for something, you know, we see occasionally we get questions that are like this about a lot of things, like the perennial question of what exactly is a giant? Right. The most important thing that you should know about a giant is not what he is, but rather what he does and how he functions in the world. Just like saints, what's really important about them is not what they are, how exactly they got to be a saint, or the canonization process or that kind of stuff. As important as those things are, the most important thing about a saint is the way that he shows forth the presence of God in the world. And Chrismation is exactly this. We're Chrismated for something. When you're Chrismated in the Orthodox Church, it's not to make you a member of an institution. It's to make you a member of Christ, which is not a membership in the sense of having a card. You know, it's like being the members of a body. We've talked about bodies a lot on this podcast. You know that a body is this collection of powers and potentialities through which a person operates. And the body of Christ is that which. Through which Christ operates in this world. We are his body. We are his members. And the purpose of charismation is to do the things that we've just been describing for the past few hours. You know, we're charismated for something. We're Chrismated in order to receive a commission. You know, it's. It's not a possession or a status. It's. It's a task. It's an empowerment for something. And Christian life is much more about that for what it's for than it is about the precise means or definitions of how you get to that. 4. It doesn't mean those things don't matter. But when we become extremists in one direction or another by saying, oh, it all just doesn't matter at all, I feel the spirit, so it doesn't matter. Or we become an extremist in the other direction and say, well, only through the following very precise set of formulae does this work. In both cases, we're kind of becoming magical thinkers. And that's idolatrous. As we've said many times, it's idolatrous. That's the problem. So we're saved for something. You know, we're not saved so that we can be saved. We're saved so that we can be holy in this world, so that we can show forth the works, the presence, the love of God in this world, so that the world can be healed and so that through him the world might be saved. Father. So."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10078.12,"end":10091.68,"speaker":"Fr Stephen De Young","text":"A catechumen in my parish who is an adult, who is a couple decades younger than me, making me feel very old, so I secretly despise him for that, but otherwise he's a good."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10091.68,"end":10092.04,"speaker":"Fr Andrew Stephen Damick","text":"Kid."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10095.56,"end":10592.04,"speaker":"Fr Stephen De Young","text":"Asked me for some clarification about something we talk about a lot on the show, which is, for example, on the episode about spirits. We talked about how there are spirits active in groups and communities and places and workplaces and institutions, right? And we talked about sort of there being an exorcism or replacing one that is dedicated to human destruction, evil with one that is good and leading to salvation. You sort of ask me what that concretely looks like for a person who's like going to work at a job or going to school at a school, or who's part of some other kind of community, right? Like, what does that mean? And I think one of the major foci of what we've been talking about tonight is that every one of us, as a Christian, as an anointed one, as someone who has the Holy Spirit working within us and through us, carries the Holy Spirit, the spirit of God with us wherever we go. And a lot of times this gets expressed negatively, right? When it's talked about in popular circles, this is, you know, the Holy Spirit dwells in you. Are you going to go into a movie theater at an R rated movie, right? Or are you going to hang out with these ne' er do wells? Are you going to smoke and chew and dance with girls who do? And there is precedent for that. I say that obviously with some levity, but St. Paul comes out and asks, will you join the members of Christ to a prostitute? So there is biblical warrant for that kind of negative approach to that, but I think very neglected and more important is the positive element of that, that bringing the spirit of God with us out into the World right out of paradise and out into the world. The world where there is chaos, the world where there is death. The world where there is darkness is like carrying a candle with us out into the darkness, like carrying a torch with us out into the darkness. This is what I think St. John is getting at in first John 4:4, when he says, Greater is he who is in me than he who is in the world. There's a lot of spirits out there in the world, but the one who is within us is greater and more powerful infinitely than any of them. And so, on a very practical level, when we come into a place, into a community, into our families, into our workplaces, into our school communities, whatever it is, when we come there and we bring the Holy Spirit with us, not just sort of de facto because we identify as Christians, but in the sense that we're working in repentance and faith to bring out and bring to maturity the fruit of the Spirit in our life. That that presence and activity of the Holy Spirit begins to transform the communities and the world around us in precisely this way, by driving out those other spirits, by driving out those other agencies, those other principalities and powers, those other things that are acting upon us and the people we love and the people we work with and the people we spend time with, it pushes them out, right? And replaces them with the presence of God himself. When we bring love into a situation where there is hatred and bitterness and anger and it's real love, it's not us saying platitudes, it's not us saying, hey, can't we all just love each other? Don't worry, be happy. But manifesting the love of God toward people, the real deep love and compassion and kindness and care of God toward people, when we bring a real sense of peace and we make peace between people, then the Spirit that's then been there putting people at odds with each other, spirits of dissension and bitterness, they're driven out. Then behold how good and how pleasant it is for brethren to dwell together in unity. And this is the concrete way. It is concrete, right? We can't change the world in the sense that I can point my finger by magic at a chair and turn it into a table. But as we've talked about, the world we all live in is made up more of our perceptions and intuitions and experiences than it is those hard and fast things that we can't change. And so through just one person who's honestly striving every day to follow Christ, both in keeping commandments and in repenting when not. One of the most powerful ways to completely transform a social dynamic is to apologize, to actually accept the blame for our failures, to actually be honest about them and apologize. So repentance is a big part of this too. But one person doing that can transform a whole system, can transform a whole workplace, can transform a whole dynamic. And it's when we do that that people see Christ in us. It's when we do that not win arguments, that people are drawn to find Christ in his church. And as they do that, they start to become Christians as well, and they start to make an honest effort to follow Christ. And some of us who have been Christians our whole lives but maybe aren't making an honest effort right now are inspired by seeing those who do to start making further efforts ourselves. And slowly, slowly, piece by piece, big systems can be transformed. And if you don't believe that's true, I will once again point you to history, where a bunch of peasants and fishermen in a backwater of the Roman empire took them 300 years, but completely transformed society, culture, politics, everything, just by each one of them being willing to follow Christ, whether that meant life or death, whether that meant glory or dishonor. But they made that honest effort every day. And through them the Spirit, the Holy Spirit, the Spirit of God came to fill a whole empire and change it. And it can do that again. But we don't start by trying to stage some kind of Christian revolution. We've seen how that goes. We do that by each of us in our place, in the place where God has put us in the family he's put us in in the occupation he's put us in in the church community he's put us in making these everyday day to day efforts to love, to be at peace, experience real joy, to be kind, to be good, to be gentle, to be faithful, to exercise self control. Those are my final thoughts."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10592.44,"end":10610.6,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you for listening everyone. If you didn't get through to us live this time, we'd still like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits and."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10610.6,"end":10619.17,"speaker":"Fr Stephen De Young","text":"Join join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Next time, Holy Orders."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10619.65,"end":10631.57,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, you can like our page. Join our discussion group. It might be the only redeemable thing on Facebook, leave reviews and ratings everywhere, but most importantly, share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10632.37,"end":10644.14,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. Historic vampire debate kickstarter.com thank you, good."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10644.14,"end":10646.46,"speaker":"Fr Andrew Stephen Damick","text":"Night and may God bless you always."}
{"episode_id":"LOS - #057 - 2022-12-08 - Baptism by Fire","start":10662.95,"end":10700,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Fr. Andrew Stephen Damick and Fr. Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
