{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":0.24,"end":64.83,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":67.07,"end":85.23,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, scorpion stalkers. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Steven Damick in Emmaus, Pennsylvania. Tonight, we're not taking any calls because this is a prerecorded episode."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":85.95,"end":88.47,"speaker":"Fr Stephen De Young","text":"Unless you happen to call in while we're recording."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":88.47,"end":144.21,"speaker":"Fr Andrew Stephen Damick","text":"I. Yeah, which hey, call us. See, it's not working. When this does air live though, Father Stephen will be in Canada or something like that, which honestly sounds to me like the best place to be in July. Definitely not Phoenix. I've done a lot of driving though on the roads of America so far, visiting 44 out of our 50 states. Probably my favorite highway road signs I've seen out there are the ones that read prepare to meet thy doom. And it's not just because of the lovely early modern English pronoun. I promise you. This is the next installment in our eschatology series and it's doom we're talking about the final judgment, doomsday itself. What exactly is this? Is the end of days about everyone going to heaven or hell? Or is it just a Schwarzenegger action horror flick? What do you think, Father?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":144.45,"end":153.81,"speaker":"Fr Stephen De Young","text":"Well, it's not just a Schwarzenegger action horror flick. I mean, it is that with Gabriel Byrne as the devil."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":155.09,"end":158.49,"speaker":"Fr Andrew Stephen Damick","text":"Amazing. Again, I say amazing Gabriel Byrne."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":158.49,"end":162.53,"speaker":"Fr Stephen De Young","text":"It is great. It is great. Spiritual warfare with a grenade launcher."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":163.33,"end":164.61,"speaker":"Fr Andrew Stephen Damick","text":"That's how I always do it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":167.33,"end":198.1,"speaker":"Fr Stephen De Young","text":"So that's. Yeah, that's groovy. But I mean, when I first started trying to put together notes, you know, episode titled Doomsday. I'm typing out. You know, Doomsday is a Kryptonian bioweapon that was made to evolve upon its death and regenerate. That killed Superman. Then you corrected me. I was like, oh, bummer. There's also the Legion of doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":199.94,"end":202.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Dr. Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":203.06,"end":204.26,"speaker":"Fr Stephen De Young","text":"Yeah. Dr. Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":204.26,"end":204.7,"speaker":"Fr Andrew Stephen Damick","text":"Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":204.7,"end":205.7,"speaker":"Fr Stephen De Young","text":"Victor Von Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":205.7,"end":208.02,"speaker":"Fr Andrew Stephen Damick","text":"Doom. Simply Doom. We all remember that game."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":208.02,"end":216.34,"speaker":"Fr Stephen De Young","text":"Yes. Thulsa Doom, as played in Conan the Barbarian by my nemesis, James Earl Jones."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":218.42,"end":219.22,"speaker":"Fr Andrew Stephen Damick","text":"How's that going?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":221.07,"end":223.15,"speaker":"Fr Stephen De Young","text":"I'm telling. I'll dance on his grave. Don't worry."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":224.91,"end":232.35,"speaker":"Fr Andrew Stephen Damick","text":"I'll record it. There's a professional wrestling tag team named Doom featuring Ron Simmons and Butch Reed."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":234.03,"end":240.91,"speaker":"Fr Stephen De Young","text":"Well, yeah, that was a long time ago. Legion of Doom was the other name for the Road warriors also."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":240.91,"end":241.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":243.23,"end":255.88,"speaker":"Fr Stephen De Young","text":"Hawk and Animal. There was a revived legion of Doom 2000. Anyway, we digress. As much as people love our digression."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":255.88,"end":264.6,"speaker":"Fr Andrew Stephen Damick","text":"There is a Dr. Doom that either heads up or is associated with the 8th Day Institute out in Kansas."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":264.92,"end":267.56,"speaker":"Fr Stephen De Young","text":"Actually, that's just his real name. So Disney can't sue him."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":267.8,"end":275.55,"speaker":"Fr Andrew Stephen Damick","text":"That is his real name. He is actually named. His last name is Doom. And he has a doctorate of some kind. I don't know what it is, but."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":277.39,"end":282.43,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. He didn't go to seven years of medical school to be called Mr. Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":283.63,"end":284.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":286.43,"end":293.47,"speaker":"Fr Stephen De Young","text":"So. But yeah, no, we're talking about the end of days, the end of the."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":293.47,"end":293.71,"speaker":"Announcer","text":"World."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":296.11,"end":308.4,"speaker":"Fr Stephen De Young","text":"The day of judgment. And so you used the phrase end of days. Not primarily so that we could bring up the Arnold Schwarzenegger movie because I don't think you've actually seen it yet."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":308.48,"end":309.2,"speaker":"Fr Andrew Stephen Damick","text":"I have not."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":310.72,"end":312.4,"speaker":"Fr Stephen De Young","text":"Which is a huge hole."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":314.64,"end":315.24,"speaker":"Fr Andrew Stephen Damick","text":"A Doom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":315.24,"end":326.61,"speaker":"Fr Stephen De Young","text":"Sized hole, as it were, in your cultural knowledge. I saw it in the theater twice. Not once, but twice in the same week. I think it was different weeks."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":326.61,"end":328.29,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, all right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":330.53,"end":347.57,"speaker":"Fr Stephen De Young","text":"Yeah. But then again, on video, it was in that, that later stage of the Arnold Schwarzenegger action career. Right. It was around the time of like the Sixth day, which despite the title, does not really have a biblical theme."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":348.37,"end":349.09,"speaker":"Fr Andrew Stephen Damick","text":"Disappointing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":350.41,"end":352.57,"speaker":"Fr Stephen De Young","text":"No, he just gets cloned in it and has to fight himself."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":352.65,"end":356.73,"speaker":"Fr Andrew Stephen Damick","text":"This is before he started doing all those just silly comedy things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":356.81,"end":374.09,"speaker":"Fr Stephen De Young","text":"Right. Then he went into comedy. He's had a late career renaissance that a lot of people haven't been aware of because some of the movies. He made a movie called Aftermath that is sort of the. The antithesis of his movies. It's like repentance for his. His former life as a film star."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":374.41,"end":377.65,"speaker":"Fr Andrew Stephen Damick","text":"So his retractions, as it were like."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":378.13,"end":384.21,"speaker":"Fr Stephen De Young","text":"Augustine or Aquinas it's about the consequences of violence."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":386.61,"end":387.41,"speaker":"Fr Andrew Stephen Damick","text":"Good for him."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":387.81,"end":389.89,"speaker":"Fr Stephen De Young","text":"There's a little bit more of a realistic take."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":391.09,"end":394.77,"speaker":"Fr Andrew Stephen Damick","text":"I mean, if I were governor of California, I would have a lot of repentance to engage in myself."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":397.65,"end":416.04,"speaker":"Fr Stephen De Young","text":"You know, it was him or Gary Coleman. There's my wheezy laugh. So the end of Days. That phrase end of days, which Arnie picked up for that movie's title."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":418.36,"end":418.76,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":418.84,"end":519.25,"speaker":"Fr Stephen De Young","text":"A phrase that starts being used in Second Temple Jewish literature and is still used in a lot of Jewish circles to refer to the last day, the day of judgment, even though that phrase does not appear in and of itself. End of days, Right. That exact phrase does not occur anywhere in the Hebrew Bible or the Christian Bible. But it is biblically derived, Right. And the concept is even kind of referenced in the New Testament. So, I mean, the most obvious biblical derivation is that Genesis 1, in describing the creation of the world, we have the separation of light from darkness. And then day one, right? You have a progression of days. And after Noah's flood, when the promise is made and the rainbow is given as a sign of it, God sets down his bow like bow and arrow in the clouds and promises that the various cycles, right? Day and night, springtime and harvest, right? The flow of the days and seasons and times and years will continue until the end. So there you have. There's going to be days. There's going to be a regular succession of days until those days end, right? So you can see end of days kind of coming naturally from."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":519.57,"end":520.85,"speaker":"Fr Andrew Stephen Damick","text":"There's a beginning, there's going to be."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":520.85,"end":556.71,"speaker":"Fr Stephen De Young","text":"An end from that idea, Right? And of course, it's sort of implied by the language of the last days, right, in these last days, which gets picked up by several biblical authors. Just a couple of examples out of many possible ones. Hebrews 1, verse 2, James 5, 3. Yeah. The idea that these are the last days implies obviously that there's going to be an end of days, which is approaching, right? And that you are in the. The final days. You are in that last period, which."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":556.71,"end":577.21,"speaker":"Fr Andrew Stephen Damick","text":"Is kind of funny because, like, especially since, particularly I think since like the 1970s, where you get Hal Lindsey and some of these guys kind of saying these are the last days. But it's like. Well, we've. They were saying it was these last days back in the New Testament, you know, so."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":577.29,"end":583.53,"speaker":"Fr Stephen De Young","text":"Because as we talked about ages last episode, Right, we're in the last one, right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":583.61,"end":584.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":585.29,"end":611.71,"speaker":"Fr Stephen De Young","text":"Until before the end of the age, Right, Yeah, yeah. And we're in such a Christian context in our thought, that this doesn't strike us as weird, the idea that the world's going to have an end."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":613.23,"end":613.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":614.43,"end":630.95,"speaker":"Fr Stephen De Young","text":"Right. But if you go back to the rest of the ancient world, Right. Outside of Israel in general. Right. I mean, people have heard of Ragnarok, Right. The twilight of the gods and all this."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":630.95,"end":631.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":631.59,"end":634.71,"speaker":"Fr Stephen De Young","text":"But most nations didn't actually have that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":635.35,"end":642.55,"speaker":"Fr Andrew Stephen Damick","text":"No. Yeah. Most of them are not. Don't have a story about their gods all dying and the world ending."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":643.35,"end":674.11,"speaker":"Fr Stephen De Young","text":"Yeah. It was. In fact, they believed the world had kind of always been here and it kind of always would. That there were just these cycles that would repeat. And we've talked before in terms of the gods that they worshiped. We've talked before about the succession myth. And so those cycles included the succession of gods that. Yeah. Zeus may not be the highest God forever. Someone could displace him in the future. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":674.11,"end":675.27,"speaker":"Fr Andrew Stephen Damick","text":"As has happened in the past."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":675.75,"end":695.77,"speaker":"Fr Stephen De Young","text":"Yeah. As has happened in the past. We just move on. Right. You could have every generation, you get a new Flash, you get a new Green Lantern. So this can just keep happening in perpetuity forever. And all this has happened before and all this will happen again. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":697.93,"end":698.41,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":698.57,"end":709.81,"speaker":"Fr Stephen De Young","text":"But this gets transformed. And we can see that in the Hebrew scriptures that, no, there is going to be an end. There was a beginning and there will be an end."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":709.81,"end":716.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In a real sense, history is a biblical creation."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":717.69,"end":723.93,"speaker":"Fr Stephen De Young","text":"Right. The idea of history as having some kind of trajectory, having some kind of arc."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":723.93,"end":726.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":726.13,"end":790.28,"speaker":"Fr Stephen De Young","text":"Right. Being some kind of finite playing out of things. Yeah. I mean, there are certainly people who recorded events that happened without that concept, but they were just recording events that happened. You know, Herodotus doesn't say like. Herodotus certainly thought there were things you could learn from things that had happened. Right. There was sort of wisdom or lessons to be derived from it. But he didn't think that the Persian wars were part of this story. We're sort of an act of a play that had started somewhere and was leading somewhere in particular. In fact, the way he understood meaning in history was based on the idea that this is just cyclical and is all going to come around again. So next time it comes around. Right. Like, here are the things we can learn from what happened last time."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":790.28,"end":790.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":793.6,"end":1018.25,"speaker":"Fr Stephen De Young","text":"So, yeah. So this idea of a through line was a new thing and is different than what has typically been considered. And ultimately, even. Even modern science, of course, the Big Bang is an idea that a Catholic priest came up with literally because he was trying to prove that the universe had a beginning for exactly this reason. Even that the idea of the big bang and the big crunch or the idea doesn't get away from this, Right? It hasn't actually gone back to paganism. Right, right. And even your most die hard evolutionary theorist, if you watch any of these documentaries where they try to like recreate the prehistoric world or whatever, they're presenting it as a story. They're presenting it as sort of this narrative of life on earth that started somewhere, it is going to culminate in humanity, which in and of itself kind of makes no sense from their own perspective, from their own atheistic perspective, right? Like, why would humanity be any different? Why is that the culmination of the story? Why is it a story at all? Why isn't it just a series of random events? Why is there any kind of through line superimposed on it? But so the reason why that's important is that in order to understand judgment like the last one, the last judgment, we have to obviously talk about justice. And the concept of justice biblically is completely inseparable from the idea of order. I mean, that's simply what it is, that mishpat in Hebrew, justice is the state of everything being in its proper place and functioning the way it's meant to, right? Everything is correctly related to everything else. So that whether you're talking about society, like human society, whether you're talking about nature, whether you're talking about sort of the cosmos as a whole, whether you're talking about the angelic world, it doesn't matter, right? That everything is in its proper place and everything is functioning properly. And of course, in order for that to be true, right? In order for there to be an order, in order there to be any meaningful concept of justice in the world understood as a proper order, that implies that there has to be some kind of order to creation which could be reflected in that or not reflected in that, right? What do I mean by that? Well, if, if the world really had no beginning and no end. So let's take Aristotle's presuppositions, say, then any particular, say, ordering of society would be an ordering of society. But how could you say whether it was just or unjust."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1020.09,"end":1020.49,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1021.3,"end":1049.07,"speaker":"Fr Stephen De Young","text":"Like from what perspective? Right now you could. A variety of perspectives are possible. You could say, well, I think the best ordering of society is one in which the people who are lowest, you know, who are at the low end, right. Of the, of the society, are as high as possible."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1050.83,"end":1051.23,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1051.63,"end":1151.22,"speaker":"Fr Stephen De Young","text":"So you can't really fall that low. Another person could say, well, no, I think the right ordering society is the One that gives people the most opportunities, whether they successfully take advantage of them or not. Another person could say, I think the best ordering of society is one that produces the most human flourishing. Another person could say, I think the best ordering of society is the one that allows, you know, great men and women to be great. Right. And to dominate the society and doesn't let the weak take control of the mechanisms of power. And you could judge then any given ordering, social ordering from that perspective to say, well, this is good from that perspective and this is bad from that perspective. But there's no way to mediate between those perspectives. There's no way to say, no, this is the correct way to evaluate a social order because every one of them is accidental. And so it's just going to be the person's interest. So the idea that there is some kind of objective justice, that something can truly be just or unjust in an objective way that we could all come to agree upon, implies that there is some kind of order, some kind of existing order with which that societal ordering has to be consonant, has to correctly relate itself to that this way of people relating to each other is correct."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1151.46,"end":1160.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the basic idea behind, although not necessarily working out in the details of the concept of natural law, sort of."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1160.25,"end":1161.69,"speaker":"Fr Stephen De Young","text":"Yeah, that's one of the things derived from."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1161.69,"end":1163.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. That's the."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1163.09,"end":1165.97,"speaker":"Fr Stephen De Young","text":"The basis that could be grounded in different things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1166.29,"end":1166.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1167.09,"end":1189.95,"speaker":"Fr Stephen De Young","text":"It could be built into the nature of things in and of themselves. It can be built into the laws of logic. It can be God. Right, right, right. You could ground that different ways, but it has to be grounded somewhere, or you can't really have a meaningful concept of justice and injustice in any kind of objective sense."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1189.95,"end":1195.47,"speaker":"Fr Andrew Stephen Damick","text":"Something absolute that everyone has to be obedient to. Not that we just all agree on."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1196.51,"end":1198.35,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1200.75,"end":1201.15,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1203.55,"end":1217.64,"speaker":"Fr Stephen De Young","text":"What we see, as we've talked about many times on the show, in the account of God's creation of the world is we've talked about two steps. But the first step, and one of the key steps in creation is putting things in order."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1221.4,"end":1221.8,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1223.88,"end":1253.56,"speaker":"Fr Stephen De Young","text":"God's act of creation in ordering things and putting things in order entails automatically a concept of justice. Right. That his ordering of things. Right. Then constitutes, once he pronounces it, good and beautiful at the end of each day. Right. That his ordering of things is the ordering of things. Right. Is the just ordering of things. And any deviation from that then represents injustice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1253.56,"end":1254,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1256.96,"end":1304.88,"speaker":"Fr Stephen De Young","text":"And when we look at descriptions of the Last judgment, I know we've talked about just justice and judgment in General, before on the show, but particularly with what we're talking about tonight with the Last Judgment, the final judgment, we have to understand a particular aspect of this in order to understand some of the language that's used in talking about the Last Judgment. And that's related to, again, this understanding of creations, creation. So the two steps that we talked about before, God puts things in order as on the first three days of creation, then on the second set of three days, he fills. He fills things with life."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1304.96,"end":1311.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then he gives that command to Adam and Eve to basically go, go thou and do likewise, essentially."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1311.12,"end":1411.63,"speaker":"Fr Stephen De Young","text":"Right, right. To continue that. Right. And so there is this sort of perfect, perfect balance, right, that's reflected in the image of a garden. A garden is both orderly and an order that produces and fosters life. And so you can divert from that in one of two directions, right? You can divert from that away from life. Like Livy's famous quote about the Roman Empire, they created a wasteland and called it peace. You could expunge all the life. You could have a very orderly parking lot. Right. But there's no life there on the other side, right. You can abandon order. And while that could be seen as letting life take over, right. You abandon a building, you abandon a town, and it becomes overgrown, right? You can see that as, oh, well, life has come back in. Right. Life has come and thrived there, Right. But that kind of disordered abundance of life, of biological life, actually becomes very dangerous and very quickly can turn into death. So, you know, for example, if I decide to go swimming in my local bayou here in southern Louisiana, especially if I'm skinny dipping, things will not go well for me."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1411.87,"end":1414.55,"speaker":"Fr Andrew Stephen Damick","text":"But it's. It's nature. It's beautiful. It's."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1414.55,"end":1442.28,"speaker":"Fr Stephen De Young","text":"Yes. I mean, I may avoid the gators, I may avoid the snakes. I probably will not be able to avoid the mosquitoes for sure. And that will give me who knows what. And not to mention everything else that's in the water, the poisonous algae, Right. But cranberries, there's tons of life there."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1442.28,"end":1443.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1444.6,"end":1448.92,"speaker":"Fr Stephen De Young","text":"But there's no order. And so it becomes dangerous, Right. Because it becomes chaos."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1450.92,"end":1451.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1451.24,"end":1481.55,"speaker":"Fr Stephen De Young","text":"It lapses back into chaos. So this is why we get certain metaphors for the Last Judgment, some of them related to gardening directly. We're going to talk about a couple of those, but also why you get. And maybe especially in the Hebrew prophets, you get descriptions of Judgment Day that seem to involve a whole lot of people dying."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1481.87,"end":1482.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1482.23,"end":1510.29,"speaker":"Fr Stephen De Young","text":"It's sort of seem to evolve depopulation and that that language is being used there to counter this idea of sort of overgrowing life turning into chaos. Right. But for a couple of those metaphors. We have a couple of metaphors from the Gospels, from Christ himself."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1510.69,"end":1511.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1511.41,"end":1520.09,"speaker":"Fr Stephen De Young","text":"And the first one of these is sometimes called the parable of the weeds, but I'm sure it's called 20 different."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1520.09,"end":1524.77,"speaker":"Fr Andrew Stephen Damick","text":"Things, the wheat and the tares. For all you King James people out."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1524.77,"end":1527.41,"speaker":"Fr Stephen De Young","text":"There'S another one that's sometimes called the wheat and the tares, though, too."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1527.41,"end":1528.61,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1529.33,"end":1534.61,"speaker":"Fr Stephen De Young","text":"There's a lot of similar. That's why we're going to read it here, because there's a bunch of similar ones that we need to disambiguate."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1534.61,"end":1540.26,"speaker":"Fr Andrew Stephen Damick","text":"I wish we still use the word tare, but it's probably because it's a homophone that we. We kind of dropped it a long time ago."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1540.26,"end":1543.02,"speaker":"Fr Stephen De Young","text":"But, I mean, maybe wheat farmers still do."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1544.94,"end":1602.37,"speaker":"Fr Andrew Stephen Damick","text":"For any wheat farmers listening, send us an email. Let us know if you use the word tare. Use the word tares in this way. Yeah. Okay. So Matthew, chapter 13, starting with verse 24, he put another parable before them, saying, the kingdom of heaven may be compared to a man who sowed good seed in his field. But while his men were sleeping, his enemy came and sowed weeds among the wheat and went away. So when the plants came up and bore grain, then the weeds appeared also. And the servants of the master of the house came and said to him, master, did you not sow good seed in your field? How then does it have weeds? He said to them, an enemy has done this. So the servants said to him, then do you want us to go and gather them? But he said, no, lest in gathering the weeds, you root up the wheat along with them. Let both grow together until the harvest. And at harvest time, I will tell the reapers and gather the weeds first and bind them in bundles to be burned, but gather the wheat into my barn."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1605.73,"end":1613.33,"speaker":"Fr Stephen De Young","text":"So, I mean, this is pretty directly that imagery that this disorder."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1614.53,"end":1614.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1616.85,"end":1635.5,"speaker":"Fr Stephen De Young","text":"Comes into the otherwise orderly. Right. Fields of crops that are ordered in order to bring forth life. And weeds, by the way, don't just, like, live peacefully alongside other plants."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1636.78,"end":1638.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're sucking the life out of them."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1639.26,"end":1675.23,"speaker":"Fr Stephen De Young","text":"Yes. They're actually harming. Right. The other plants. But there is not this sort of immediate judgment. Right? There's not an immediate judgment. There's not. Okay. The second there's this injustice, immediately justice must be restored. Right. Rather, right. This time is given. But then there comes a day, eventually there comes a day when Everything is harvested."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1675.95,"end":1676.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1676.83,"end":1683.07,"speaker":"Fr Stephen De Young","text":"And the reason for the delay is for the purpose of the wheat."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1683.95,"end":1685.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's some weeds."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1685.23,"end":1686.43,"speaker":"Fr Stephen De Young","text":"The salvation of the wheat."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1686.43,"end":1689.95,"speaker":"Fr Andrew Stephen Damick","text":"There's some weeds. If you pull them up, you will kill everything around them."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1690.99,"end":1691.47,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1692.11,"end":1701.16,"speaker":"Fr Andrew Stephen Damick","text":"Other weeds, you can. You can pull them out. And that's what you need to do, you know, But. But in some cases, if you. If you pull up the weeds, then you're gonna ruin your actual good stuff."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1701.88,"end":1722.28,"speaker":"Fr Stephen De Young","text":"Right. And so this shows us what we might call sort of the macrocosmic concept of judgment. Right. Because what Christ is clearly talking about here is the day of Judgment, the judgment of the whole world. Right. The separation of one type of person from another type of person to have different fates."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1723.48,"end":1723.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1725.56,"end":1727.27,"speaker":"Fr Stephen De Young","text":"But there's another type of judgment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1728.46,"end":1728.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1728.74,"end":1734.02,"speaker":"Fr Stephen De Young","text":"That he uses a not totally dissimilar example to describe."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1734.02,"end":1766.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Another good agricultural metaphor. So, John, chapter 15, verses 1 and 2. I am the true vine, and my father is the vine dresser. Every branch in me that does not bear fruit, he takes away. And every branch that does bear fruit, he prunes that it may bear more fruit. So, you know, this is the image of cutting off bits in order to make things better rather than weeding, you know, this is pruning. Now, I've never."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1766.39,"end":1768.79,"speaker":"Fr Stephen De Young","text":"You do have the element of branches being taken away."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1768.79,"end":1771.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That's part of it, too. Yeah, exactly."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1771.35,"end":1774.87,"speaker":"Fr Stephen De Young","text":"You still have that. But there's also this other thing here."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1775.03,"end":1779.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. I mean, I actually. I very briefly had a grapevine."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1780.55,"end":1780.95,"speaker":"Fr Stephen De Young","text":"It."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1781.15,"end":1785.27,"speaker":"Fr Andrew Stephen Damick","text":"The grapes it made did not taste good, so we. We didn't keep it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1785.27,"end":1785.95,"speaker":"Fr Stephen De Young","text":"I heard it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1789.15,"end":1907.82,"speaker":"Fr Andrew Stephen Damick","text":"They were grapes purely of wrath. But I do have some experience. I'm not going to say I'm an expert or even a journeyman, but I do have experience pruning fruit trees. We. In my backyard. So I'm. Thank God. I actually have about a third of an acre that my house is on. And so the back end of it, we have six fruit trees. And so over the last 10 years, I've been planting trees back there and pruning them because you have to prune them if you want good fruit, if you want the tree to do well. Fruit trees take a lot of work to make sure that they thrive. And, you know, some of the basic principles are, like, if a branch is kind of heading towards the middle of the tree, you cut that one out. If it's pointing downwards, you cut that and you look and you see when it comes time for the fruit, you notice which branches have fruit and you privilege them. And the ones that don't do that, you take those off. And so the idea is ultimately to try to. By privileging certain branches, then they get bigger and bigger and bigger because fruit trees often like to just make a million little branches. But if you take off a lot of the little ones, then it puts their energy into making some bigger branches and then that can actually support the fruit when it comes, because otherwise they can pull down the branches and break them off. So the general idea is that by making some cutting, by removing some things, then it makes it stronger and healthier. There's a million sermons you could preach out of that. I've preached probably one or two in my time. But the idea, I mean, this is really pointing at repentance is what's going on. You know, God giving chastening, God giving lessons that may not be super comfortable. But with the pruning, then comes strength. They become better branches."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1908.78,"end":1915.74,"speaker":"Fr Stephen De Young","text":"And so this, this could be. We could describe this as sort of judgment at the microcosm level."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1916.23,"end":1916.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1916.39,"end":1927.35,"speaker":"Fr Stephen De Young","text":"Like within a person. Yeah, right. And this is what's being referred to with, you know, if we judge ourselves, we will not be judged. Right. The idea of putting the person in order."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1927.59,"end":1927.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1929.59,"end":1945.22,"speaker":"Fr Stephen De Young","text":"Which at least in my case, needs to happen repeatedly. So. And that's why this has this ongoing nature of pruning. Right. It's not just like, okay, one time you go through and straighten up the tree and okay, now it's good for."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1945.93,"end":1979.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. No, you have to, like, I have to prune my trees two or three times a year. You know, sometimes it doesn't work. And there was one tree actually that I had one apple that for years, it was like, it was just a mess. But I kept going at it, kept going at it. And finally now this year, actually, it's, it's, it's got some height to it. It's actually producing some apples. So I mean, that's, you know, again, that's like human beings sometimes it takes a long time before a lot of care and a lot of love before a person finally gets in order. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1979.94,"end":1990.58,"speaker":"Fr Stephen De Young","text":"And. Yeah. And so not every judgment is just a complete cutting off. Yeah, right. Judgment is not all negative."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1990.9,"end":1991.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":1991.7,"end":2034.16,"speaker":"Fr Stephen De Young","text":"And even when it is kind of negative, it's not all condemnation. Yeah, right. It's often aimed at correcting, disciplining. Right. Pruning here. Right. That's not at completely cutting off and throwing away. And so we see sort of examples of that if you look at incidents of judgment. Right. That we see, for example, in the old Testament. Right. So there's some obvious ones, right? Sodom and Gomorrah, right. Clearly they get cut off, right? Like that's. They get nuked from orbit."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2034.16,"end":2034.44,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2034.44,"end":2115.26,"speaker":"Fr Stephen De Young","text":"So they're. They're gone, Right? The giant clans, right? They reach a point, they're cut off entirely. Right. So those. We could call them nations because Sodom and Gomorrah were city states with kings. Right. Then the giant clans were clans. Those nations are sort of cut off. Well, what about, though, Judah? Judah gets taken into exile. The first temple gets destroyed utterly. The land gets taken over by the Babylonians. They're in exile for 70 years. They get to come back, but they're still a Persian province, Right. They aren't independent. That's a nation that undergoes the other type of judgment, the kind of corrective judgment. There are certain practices of Judah that God is correcting, not all that different than the practices for which he destroyed other nations, by the way. Right. But as St. Paul says, speaking in part historically, God disciplines every son whom he loves. Right? So Judah gets corrected."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2116.7,"end":2117.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2117.34,"end":2153.72,"speaker":"Fr Stephen De Young","text":"And so, you know, we say that now we have this long reach of history, right, where we say, okay, well, yeah, that's corrective. That's corrective judgment. That's not like those other ones. But if you were one of the people getting run through with a Babylonian sword in 587. Right. If you were one of the ones getting deported into slavery, if you were one of the ones watching everything burn, if your children were being taken as slaves, that didn't look all that different to you on the ground than the other ones."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2154.68,"end":2155.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2157.89,"end":2199.26,"speaker":"Fr Stephen De Young","text":"So sometimes we let the distance of history turn these things into statistics and numbers. Right. And so the judgment here, this is a real judgment. It's not a different type of thing. Right. What's different tends to be the result. The difference is the result. And the result is usually a result of the people. But we'll talk about that more as we go forward. But with that in mind, how about the northern kingdom of Israel?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2201.02,"end":2205.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Were they just thrown into the fire along with the Tares?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2205.74,"end":2284.31,"speaker":"Fr Stephen De Young","text":"Yeah. So on one level, you could say that. You could say, yeah, there's this contrast between what happens to Israel, the northern kingdom, and what happens to Judah, the southern kingdom. And there are various reasons for that, right? The promises made to David, Judah's where the temple was, et cetera, et cetera. Right? Now the kingdom of Israel, not so on those things. So you could say, well, okay, yeah, they get cut off and Judah gets disciplined. But that's not really how, for example, St. Paul sees it. And St. Paul didn't just come up with this. St. Paul is getting this from a lot of Second Temple Jewish literature, like the Testament of Naphtali and stuff that already understood this, this way that saw what happened to Israel when they get dispersed among the nations, the Northern Kingdom as being not them being cut off and thrown into the fire, but them being scattered like seeds. Right. Like the fruit that falls to the ground and dies. And that the eventual inclusion of the nations who come to worship Israel's God, which St. Paul of course believed was happening in his lifetime through his ministry. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2284.39,"end":2289.75,"speaker":"Fr Andrew Stephen Damick","text":"And that gets prophesied in the Old Testament. So you don't have to look at Second Temple Jewish literature for that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2289.99,"end":2373.09,"speaker":"Fr Stephen De Young","text":"Well, yeah, yeah, but that, that is the harvest of the produce of those seeds. And so when you look at it from this perspective of the result, then what happens to the Northern Kingdom starts looking less like a total cutting off than it might at first blush before giving it more thought. Well, those are all examples with nations. But you can find those same examples of those two types, right, with individual people in the Old Testament. Right. So just one example out of many, many, many, many possible examples. Saul, the first king of Israel gets cut off ultimately for his disobedience. And he doesn't get a lack of tries. Right. It's kind of hard to discern when you're reading the Sahl narrative when exactly he was cut off completely. Right. There's not killing the Amalekites, there's going to the Witch of Endorphins, there's a whole trying to murder David. There's a whole series of things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2373.41,"end":2379.09,"speaker":"Fr Andrew Stephen Damick","text":"I mean, at a certain point you do get that the Holy Spirit has left him and that there's an evil spirit that follows him around now."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2379.73,"end":2433.14,"speaker":"Fr Stephen De Young","text":"Right. But even then, Right. And part of the reason why it's hard to nail down is of course he could have repented at any point until he was dead. Right. So there wasn't actually a point of zero return. Right. But he ends up being cut off. Right. The way he dies is definitely a judgment. And his household is mostly wiped out. Whereas David, right, David faces judgment. Nathan the prophet shows up to render judgment against David, or actually in that case, to turn David's own judgment around on him. Because David as king orders the man who did the horrible thing to be put to death. Right? He issues a judgment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2433.46,"end":2434.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2434.74,"end":2436.98,"speaker":"Fr Stephen De Young","text":"David says, good, he's you. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2439.06,"end":2442.9,"speaker":"Fr Andrew Stephen Damick","text":"My, how the turntables have. Oh, wait, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2446.34,"end":2492.09,"speaker":"Fr Stephen De Young","text":"But David ends up repenting right. David repents. And so that judgment ends up becoming for him this kind of disciplinary, corrective judgment because of how he receives it and what he does in terms of repentance. So with those kind of ideas of judgment, right, these sort of two senses of two kinds of judgment, we can kind of go. And I know this is uncharacteristic for us in the first half to actually talk about the topic, but brace yourselves here. We're in it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2492.09,"end":2492.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2495.21,"end":2551.83,"speaker":"Fr Stephen De Young","text":"We can now move to talk about what's called. So end of days as a phrase doesn't occur. What is usually used in the Hebrew Bible to refer to that day is the day of Yahweh. And as we've said before, sometimes it's spelled out Day of Yahweh, translated, usually Day of the Lord in English Bibles with Lord in all caps, sometimes just referred to as the day, as we've said before, like in last episode. But usually it's the day of Yahweh that is coming and represents judgment. So one of the more full, complete sort of descriptions and depictions of the day of Yahweh comes in Isaiah. As you might expect, most of these are going to be from the prophets announcing the day of Yahweh."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2551.83,"end":2556.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is killer stuff. It's a little long."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2556.66,"end":2557.54,"speaker":"Fr Stephen De Young","text":"Put on a billboard."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2558.58,"end":2559.22,"speaker":"Fr Andrew Stephen Damick","text":"What's that?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2560.02,"end":2561.46,"speaker":"Fr Stephen De Young","text":"All killer? No filler."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2562.1,"end":2674.2,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Yeah. A little long to put on a billboard this particular passage, but yeah. Okay, so Isaiah, chapter 13, starting with verse 4. The sound of a tumult is on the mountains as of a great multitude. The sound of an uproar of kingdoms, of nations gathering together. The Lord of hosts is mustering a host for battle. They come from a distant land, from the end of the heavens. The Lord and the weapons of his indignation to destroy the whole land wail. For the day of the Lord is near as destruction from the Almighty it will come. Therefore all hands will be feeble, and every human heart will melt. They will be dismayed. Pangs and agony will seize them. They will be in anguish, like a woman in labor. They will look aghast at one another. Their faces will be aflame. Behold, the day of the Lord comes cruel with wrath and fierce anger to make the land a desolation and to destroy its sinners from it. For the stars of the heavens and their constellations will not give their light. The sun will be dark at its rising, and the moon will not shed its light. I will punish the world for its evil, and the wicked for their Iniquity. I will put an end to the pomp of the arrogant, the and lay low the pompous pride of the ruthless. I will make people more rare than fine gold and mankind than the gold of Ophir. Therefore I will make the heavens tremble and the earth will be shaken out of its place at the wrath of the Lord of hosts in the day of his fierce anger. And like a hunted gazelle, or like sheep with none to gather them, each will turn to his own people and each will flee to his own land. Whoever is found will be thrust through, and whoever is caught will fall by the sword. Their infants will be dashed in pieces before their eyes. Their houses will be plundered and their wives ravished. It's pretty rough."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2676.12,"end":2688.46,"speaker":"Fr Stephen De Young","text":"Yeah. Not something to look forward to. Yeah. And you notice that sort of depopulation language that we mentioned too, making humanity rare, but notice the rareness is then contrasted with gold."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2689.1,"end":2689.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2689.74,"end":2693.5,"speaker":"Fr Stephen De Young","text":"So there's a bit of a wordplay on the word that's translated rare there."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2694.06,"end":2694.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2695.1,"end":2722.07,"speaker":"Fr Stephen De Young","text":"In that it can mean both, like there's not a lot of humans left, and it can mean that humanity kind of gets rarefied, like, humanity kind of gets refined, like. But so, yeah, this is a description of the day of the Lord. This is apocalyptic in the contemporary usage."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2722.55,"end":2722.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2722.95,"end":2736.63,"speaker":"Fr Stephen De Young","text":"Right. Kind of stuff. Right. This is end timesy stuff. Here's the thing, though. We didn't read the first three verses of the chapter. Isaiah is saying this to Babylon."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2738.56,"end":2742.88,"speaker":"Fr Andrew Stephen Damick","text":"Which, you know, by our day is long, long, long, long, long, long gone."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2742.88,"end":2767.83,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so what he's describing as the day of the Lord, as the day of Yahweh, as the last day, is what he's detailed describing is the invasion of the Medes and the Persians to destroy the Neo Babylonian empire."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2768.07,"end":2783.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this kind of language, which seems very end of the world kind of stuff, is in terms of the here and now of Isaiah, is an actual set of historical events that we can point to that happened long in the past for us."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2784.07,"end":2891.39,"speaker":"Fr Stephen De Young","text":"Right. So when he says the day is near, he's not saying the end of the world is about to happen. Right. He's not making a Jack Van Impe style end times prediction. He's saying that that day, the day of the Lord, is drawing near to Babylon. So we've talked before when we talk about ritual participation, we've talked about it primarily. Not entirely, but primarily in terms of participation in past events. Right. So we've pointed out, right. The Passover, right. Is this is the night on which God delivered us from Egypt, even when it's celebrated in 2023. And it's a participation in that day. And we've talked about how that extends to the Eucharist, to Holy Week, to different things in the life of the church. But so this is also true vis a vis the future. But one of the differences here in the way that Scripture talks about judgment and talks about the day of the Lord is that this isn't sort of a deliberate participation. Right. This isn't like the Medes and the Persians went and did a religious ritual to participate in the day of judgment and render judgment against Babylon and take it over."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2891.79,"end":2892.19,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2893.8,"end":2911.96,"speaker":"Fr Stephen De Young","text":"Right. This is the day itself. Right. Judgment itself, the judgment of God, the wrath of God, the day of judgment itself being portrayed as having, like, agency that it's sort of sneaking up on Babylon."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2912.36,"end":2912.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2913.32,"end":2920.6,"speaker":"Fr Stephen De Young","text":"It's drawing close to them. Right. It's about to pounce. Judgment is coming."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2921.66,"end":2921.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2922.94,"end":2942.3,"speaker":"Fr Stephen De Young","text":"And that call. Right. What that call is aimed at doing is bringing about repentance. Repentance will not stop that judgment from happening necessarily, but it'll mean that judgment will be different. Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2942.54,"end":2968.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, you know, book of Jonah. Right. Is the counterexample. Well, it doesn't counter it, but as an example of how it could go, I mean, you notice Jonah's prophecy against Nineveh is just simply Nineveh is going to be overthrown. Bad things are happening. They're going to happen and the people will repent. And then God does not do those."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2968.76,"end":2971.52,"speaker":"Fr Stephen De Young","text":"Bad things, at least at that time."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2971.52,"end":2973.2,"speaker":"Fr Andrew Stephen Damick","text":"At that time. Right. I mean. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2973.2,"end":2974.64,"speaker":"Fr Stephen De Young","text":"Nineveh did get destroyed."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2974.72,"end":2977.64,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2977.64,"end":2994.4,"speaker":"Fr Stephen De Young","text":"Who's the one who Isaiah is warning. Yeah, that's right. So, yeah. So it's not necessary. You're not necessarily going to avoid the whole. Right. Judgment is not in and of itself an evil. Right. Because it can be corrective."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":2995.28,"end":3000.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As we've said, it only seems evil if you're out of order, if you're."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3000.88,"end":3001.76,"speaker":"Fr Stephen De Young","text":"On the wrong end of it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3001.84,"end":3002.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3005.52,"end":3011.6,"speaker":"Fr Stephen De Young","text":"So, yeah. And so this language."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3011.84,"end":3012.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3012.12,"end":3068.82,"speaker":"Fr Stephen De Young","text":"And that's, you know, that's what St. John the Forerunner is saying when he's saying the axis at the root of the tree. Right. Like it's this is it. Right. Judgment is coming for you. Judeans. Right. And it did, starting especially in 70 A.D. not beginning, ending everything in A.D. 70, but beginning there. That judgment from God came and they were warned by a prophet in advance. Why? So they could repent. That was his. That was his baptism. But so judgment sort of comes back instead of Us moving back through time to participate. Right. This is judgment comes back through time and lays hold of nations."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3068.9,"end":3090.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, the purpose is, especially if you get a prophet announcing it beforehand, is to encourage repentance. But also if they don't repent, it's to limit their evil because they become too harmful for everyone else. To use the biblical language, the cup of their iniquity is full."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3092.02,"end":3118.51,"speaker":"Fr Stephen De Young","text":"Yeah. That scale. I know I've talked about it before on the show. The scale between the outcry of the victims of violence and God's patience and mercy toward the perpetrators of sin eventually shifts the other way and judgment comes. Yeah. And so there's a bunch of other examples we'll read just a few here from the prophets of the same thing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3118.67,"end":3141.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You get the sense of the day of the Lord arriving, lots of bad things happening. So Jeremiah 46:10. That day is the day of the Lord God of hosts, a day of vengeance to avenge himself on his foes. The sword shall devour and be sated and drink its fill of their blood. For the Lord God of hosts holds a sacrifice in the north country by the river Euphrates."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3142.39,"end":3144.87,"speaker":"Fr Stephen De Young","text":"So that's very clearly talking about Babylon."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3145.19,"end":3145.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3145.47,"end":3147.19,"speaker":"Fr Stephen De Young","text":"There's a geographical locator."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3148.23,"end":3150.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Babylon doesn't come out well, if you read the whole Bible."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3150.95,"end":3151.35,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3152.87,"end":3156.55,"speaker":"Fr Andrew Stephen Damick","text":"Or any random part that mentions it, actually, just about."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3156.63,"end":3160.39,"speaker":"Fr Stephen De Young","text":"Yeah. I don't think there's anything really super good said about Babylon."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3160.39,"end":3181.25,"speaker":"Fr Andrew Stephen Damick","text":"No. So, okay, Ezekiel, chapter 30, verses 3 and 4. For the day is near. The day of the Lord is near. It will be a day of clouds, a time of doom for the nations. A sword shall come upon Egypt, and anguish shall be in cush when the slain fall in Egypt. And her wealth is carried away and her foundations are torn down."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3183.41,"end":3195.24,"speaker":"Fr Stephen De Young","text":"So again, the day of the Lord is near. Egypt. Yeah, it's near for Egypt. Right. That doesn't mean he's saying the end of days is next Tuesday. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3195.64,"end":3196.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3197,"end":3200.48,"speaker":"Fr Stephen De Young","text":"But it's coming for Egypt soon is what he's saying."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3200.48,"end":3212.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, Obadiah, chapter 1, verse 15. For the day of the Lord is near upon all the nations. As you have done, it shall be done to you. Your deeds shall return on your own head."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3214.49,"end":3215.37,"speaker":"Fr Stephen De Young","text":"So that's everybody."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3215.37,"end":3216.73,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All the nations."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3216.73,"end":3218.17,"speaker":"Fr Stephen De Young","text":"That's all of you nations."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3218.97,"end":3219.57,"speaker":"Fr Andrew Stephen Damick","text":"All y'."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3219.57,"end":3219.77,"speaker":"Fr Stephen De Young","text":"All."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3221.37,"end":3231.61,"speaker":"Fr Andrew Stephen Damick","text":"Joel 2, 31. The sun shall be turned to darkness and the moon to blood before the great and awesome day of the Lord comes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3233.85,"end":3316.28,"speaker":"Fr Stephen De Young","text":"Right. And that's. I think we talked about this last time, last episode. This prophecy From Joel, that gets quoted on Pentecost. Right. But you notice the language there that's attached to the death of Christ. Right. And St. Peter, when he preaches this, is interpreting this as Christ's death is followed by the pouring out of the Spirit, Right. On all flesh. But that's also a sign of Jesus judgment that's coming upon Judea by way of the Romans as instrument. And so again, there's this kind of agency where judgment, justice comes back sort of through time and finds some nation. Right. And its judgment happens that day. That day becomes the day of Yahweh, the day of the Lord for that nation Right. At that time. And we can say that about going forward too, if we have a Christian understanding of history. Right. So St. Augustine understood in City of God that that's what was happening to Rome, to old Rome in his day. Right. That judgment was coming."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3316.44,"end":3316.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3317.66,"end":3339.26,"speaker":"Fr Stephen De Young","text":"When you read what especially monastic fathers living at the time of the fall of Constantinople said, right. They mourned the fall of Constantinople, just like the book of Lamentations mourns the fall of Jerusalem to the Babylonians. But there was also an awareness among them that there were reasons why this happened and that this was judgment from God."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3340.54,"end":3341.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3341.26,"end":3342.54,"speaker":"Fr Stephen De Young","text":"That had come upon the city."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3343.93,"end":3344.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3344.41,"end":3381.96,"speaker":"Fr Stephen De Young","text":"But so as we were talking about before, those are all examples with nations. Right. Those are macrocosm examples. But the same dynamic is true in the microcosmic level, the level of a human person. And so the Scriptures will talk about judgment in terms of the death of an individual human person. And again, judgment is not always negative. It's not always being cut off. Right. So this doesn't mean when a person dies. Right. This is a judgment in the negative sense. Always."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3382.2,"end":3392.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, in some ways, it might be easier if we use the word like discernment, God's discernment. You're not so much into that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3392.92,"end":3393.72,"speaker":"Fr Stephen De Young","text":"I'm not a fan."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3393.8,"end":3394.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3394.44,"end":3395.28,"speaker":"Fr Stephen De Young","text":"Too wimpy."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3395.28,"end":3398.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, then there's the whole discernment blogging thing, which is just."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3398.93,"end":3399.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3399.97,"end":3417.05,"speaker":"Fr Andrew Stephen Damick","text":"I wish it was just blogs these days. But, you know, that's the idea of God turning his eye on the situation and sizing it up. This is how it is, you know, so, you know, you can pass a."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3417.05,"end":3422.69,"speaker":"Fr Stephen De Young","text":"Test, you don't always fail. There is also contained an idea of consequences."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3422.85,"end":3424.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3424.74,"end":3432.34,"speaker":"Fr Stephen De Young","text":"Not that God is actively punishing, but that he's now no longer mercifully restraining the consequences."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3432.34,"end":3434.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3437.78,"end":3448.02,"speaker":"Fr Stephen De Young","text":"So, yeah. And so this is why, like Hebrews 9:27 says that it's appointed for. Man wants to die. And then the judgment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3448.02,"end":3448.82,"speaker":"Fr Andrew Stephen Damick","text":"And the judgment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3448.82,"end":3491.32,"speaker":"Fr Stephen De Young","text":"I know the old King James Version. Yeah. And I think it's. And then the judgment, actually. But this. This relates to, of course, and we've talked about this before, but our understanding of prayers for the dead and how that relates to judgment. Right. So one of the things people who haven't come. People have come out of a tradition that rejects the idea of praying for the departed. I'll put it that way. Because let me just say there are plenty of Protestants who, even though on paper they don't believe in praying for departed people who do pray for their departed loved ones."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3491.48,"end":3506.6,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I literally was at a dinner last night where a Protestant pastor told the assembled who were there about how he led one of his parishioners in prayer for her departed mother. So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3506.6,"end":3532.24,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So there are certain folks who come from a tradition that rejects it. And so. Right. They have an issue with it. One of the. One of the, shall we say, objections that is raised is, well, if the person's dead, Right. They're dead, wants to die, then the judgment. Right. So they've already experienced the day of the Lord. They've already experienced the day of judgment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3532.97,"end":3533.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3533.37,"end":3650.81,"speaker":"Fr Stephen De Young","text":"And the problem with that, of course, as we talked about a bunch of times on the show, is the how we experience time is not absolute. Right. So, yes, insofar as we're able to understand what it would be like to be a disembodied person, which is not much, but, yeah, we understand that they are in some way, from their perspective, participating in that judgment, participating in the day of the Lord. Right. That they're not sitting around in a waiting room. Right. Because they don't have a body to sit. Right. Or to take up room from what we do know, what we're intimately familiar with is our own experience of time and our own world. And from my perspective, in my experience of time, the day of the Lord is in the future. For me, it is in the future. And so when I pray, I'm praying from my perspective as an individual human subject. I'm not making a universal cosmic prayer. I'm not. There may be someone who could do that, but it's not me. I'm trying to put some words together to talk to God. And so from my perspective, day of judgment is not yet here. It's in my future. And on that future day, I will be standing beside this person who I'm praying for. But that's in the future for me. And So I pray about it. And that has nothing to do with the idea that that person has some agency to repent, as we've talked about before."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3651.13,"end":3651.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3651.93,"end":3686.11,"speaker":"Fr Stephen De Young","text":"Right. It has to do with me offering my prayers to God. And God, who does not exist in time or experience a succession of moments, can choose to use my prayers as part of how he saves that person if he wants to, just like he could choose to use my prayers. If I pray for someone to be healed, he can choose to use my prayers. That's one of the things by which he heals that person if God so chooses, doesn't need them, but he can graciously choose to work through them if he if he wants to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3687.39,"end":3695.91,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that's the first half of this episode of the Lord of Spirits on Doomsday. We're going to take a short break and we'll be right back in a moment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3696.15,"end":3801.88,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. This is Father Stephen Freeman. I'm happy to announce Ancient Faith's publication of my latest book, face to Face Knowing God Beyond Our Shame. Some modern therapists have described shame as the master emotion, one that colors and shapes our world in ways that we hardly imagine. The Christian tradition is no stranger to this and has a rich understanding of the ways this part of our inner life shapes our experience of life world. This book offers something of a roadmap to that inner life. What is shame? Is it always bad? Does it have any useful purpose for us? Join me in an exploration of knowing God beyond our shame, finding the true God whom the scriptures tell us did not turn his face from the spitting and the shame. Face to Face is now available@store.ancient faith.com that's store.ancient faith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-23-7-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3809.16,"end":3847.71,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the second half of this episode of the Lord of Spirits. We're talking about the Judgment Day, doomsday, the end of the world. So, yeah, we talked about the day, the day of the Lord in the last half. And this one we're going to continue on our conversation and especially look at some stuff from the new Testament talking about that moment and what it means to be judged and all that kind of stuff. So it's my understanding the New Testament teaches that you're judged according to a little list of doctrines you agree with. Is that right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3848.67,"end":3849.79,"speaker":"Fr Stephen De Young","text":"Absolutely correct."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3850.67,"end":3851.71,"speaker":"Fr Andrew Stephen Damick","text":"Good night, everybody."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3852.11,"end":3862.21,"speaker":"Fr Stephen De Young","text":"Yes. There's a quiz. There's a theology quiz. It's true, false. So even if you don't know what you're doing, you got 50. 50 shot."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3862.45,"end":3863.17,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3864.77,"end":3923.54,"speaker":"Fr Stephen De Young","text":"Yeah. So no cheating. So in actuality, this may be shocking to some people. In fact, this whole half may be shocking to a whole ton of people. But every place in Scripture that talks about the day of judgment, the day of Yahweh, that talks about the basis for that judgment, what it is on, what is it that people are judged. Yeah, criteria when they're separated out. Right. So that macrocosmic judgment we were talking about. Right. Every single one, including every single one in the New Testament, says that we're judged according to our works."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3924.26,"end":3925.14,"speaker":"Fr Andrew Stephen Damick","text":"Things you do."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3926.5,"end":3930.66,"speaker":"Fr Stephen De Young","text":"Yes. And don't do, you do or left undone."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3931.1,"end":3931.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3933.34,"end":3934.38,"speaker":"Fr Stephen De Young","text":"That is the basis."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3935.66,"end":3938.46,"speaker":"Fr Andrew Stephen Damick","text":"That sounds like work. Righteousness, Uncle Steve."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3939.74,"end":3959.82,"speaker":"Fr Stephen De Young","text":"Yes. Well, get ready for it. So this is the only positive teaching on this found in the New Testament. We're talking mainly in this half, this second half about the New Testament."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3960.02,"end":3960.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":3960.98,"end":4039.75,"speaker":"Fr Stephen De Young","text":"Because I know we got some folks out there who'll be like, well, yeah, there's that works righteousness back there in the Old Testament. Right. Them Pharisees, but not in the New Testament. That's where it all changed, right? Unfortunately, no. In the New Testament, everywhere, it is positively taught that we are judged according to our works, according to what we have done in this life, or left undone. That is the teaching of the whole New Testament. Without exception. Without exception. Do you hear that buzzing? We may have to edit this. Seriously, do you hear it or no, no, no. Oh, I have a loud buzzing. There we go. It went away for me. Okay, snip. Okay, so this is. This is what's taught everybody. There's no exception. There's no. This is what happens if you're not in Christ. Yeah, Right. There's no. This is how it works for non Christians."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4039.75,"end":4040.85,"speaker":"Fr Andrew Stephen Damick","text":"There's no get out of deal."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4043.01,"end":4124.36,"speaker":"Fr Stephen De Young","text":"Yeah. This is how it works for every human. Right. And we're not just going to assert that. Let's give some examples. The first one is the one time that Christ addresses this where Christ explicitly says when the judgment. So he references that judgment. We've already quoted, for example, the parable of the weeds. Right. That's talking about the Judgment. Wheat goes in the barn, weeds go in the fire, but it doesn't say what the basis is for deciding who's wheat and whose weeds. Right. So the one place where he lays out. Okay, here's the difference between the two is in what's often referred to as the parable of the sheep and the goats, which is we read on the Sunday of the Last Judgment in the Orthodox Church, Matthew 24, getting ready for Lent. And so here he describes not just, hey, goats and sheep are going to get separated. Sheep go to heaven, goats go to hell. Right. But what makes someone a sheep and what makes someone a goat? And this is in. We're not going to read the whole thing because this is fairly familiar. It's Matthew 25, verses 31 through 46."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4124.52,"end":4124.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4124.92,"end":4125.56,"speaker":"Fr Stephen De Young","text":"So you can."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4126.41,"end":4146.17,"speaker":"Fr Andrew Stephen Damick","text":"This is a bit where Jesus says to those on his right hand, when I was hungry, you fed me. When I was thirsty, you gave me drink. When I was sick, and in prison, you visited me. When I was naked, you clothed me. And to those on his left, he says, I was those things and you did not help me."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4146.89,"end":4165.3,"speaker":"Fr Stephen De Young","text":"Right. And both groups say, when did we see you? And he said, when you did it to the least of these. So you did it to me. Yeah. Right. So this is very clearly. It's not even one group did good things and the other group did evil things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4166.74,"end":4167.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, it's."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4167.58,"end":4170.22,"speaker":"Fr Stephen De Young","text":"It's. One group did good things and the other group did no things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4170.22,"end":4172.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just didn't do those things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4172.82,"end":4173.3,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4173.38,"end":4196.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's interesting. Like, some people have this sense, like, I'll be okay in the judgment because I did not do this list of bad things. But as you said, when Jesus specifically addresses this, he didn't say, well, you goats, you're out of here because you murdered, you raped, you pillaged, you stole. It's. You didn't do the good that was presented to you. That's what he says."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4196.79,"end":4201.91,"speaker":"Fr Stephen De Young","text":"As St. James says in his Epistle, he who knows the good he ought to do and doesn't do it. Sins."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4204.16,"end":4205.36,"speaker":"Fr Andrew Stephen Damick","text":"That's pretty unambiguous."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4205.92,"end":4228.64,"speaker":"Fr Stephen De Young","text":"Yeah. Right. But. So this is it. There's no way to read this parable. Both groups refer to him as Lord. By the way, in the parable, the goats say, lord, when did we see you like this? Right. So it's not that one group acknowledges Jesus as Lord and the other one doesn't."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4229.77,"end":4230.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4232.09,"end":4243.61,"speaker":"Fr Stephen De Young","text":"Right. There's no way to read this parable and get anything else out of it other than this is a Judgment by works. Right. There just isn't. There's not even special pleading possible."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4244.97,"end":4245.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4247.77,"end":4419.58,"speaker":"Fr Stephen De Young","text":"The other big important piece here, of course, is how this works. Right. As a base. Because, of course, if Christ is going to tell us, hey, when that final judgment comes, when the day comes when you stand before my judgment seat, here's the standard by which you're going to be judged, why is he telling us that? So that we know how to order our lives. Right. In preparation for that. I mean, that's the obvious context. He's not just saying this for general interest. Oh, by the way, for those of you who are wondering how the Last Judgment works, here's how it works, right? No, this is pointed. Right. He's telling it as a parable to people so that they can live accordingly. So that they can do accordingly. Right. And so this means he's not just describing the basis of that judgment, but he's also describing the basis of the Christian life, of Christian ethics, of the way Christians are to live in the world, the basis of that for him here is the idea of the veneration of the image of God in other human persons. It's again, inescapable here. The whole idea is that if I give a cup of water to someone who is thirsty, I am giving that cup of water to Christ. That act that I perform, ultimately, that respect, that honor that I give to that person, that good thing that I do for that person is a good thing I'm doing for Christ. It's honor and respect I'm giving to Christ by giving it to that human person, even the least human person, and vice versa. The disrespect, the dishonor, Right. Also is dishonor or disrespect going to Christ. So this is the basis of our Christian ethic toward each other according to Christ. This is the basis of how we live. So if you're someone who is of an iconoclastic bent, right. Who rejects this principle, who rejects the idea that the honor bestowed on the image passes to the prototype, you've got a real problem, not just with this parable, but with Christian ethics. Because if the honor I give to another human person doesn't pass from them as the image of God to God himself, then that means if I do something good for another human, I'm doing it for them as opposed to doing it for Christ."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4419.66,"end":4423.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Instead of Christ, they get in the way."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4424.94,"end":4425.34,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4426.14,"end":4426.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4426.54,"end":4429.5,"speaker":"Fr Stephen De Young","text":"Right. If you deny that it passes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4429.5,"end":4429.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4429.82,"end":4465.66,"speaker":"Fr Stephen De Young","text":"So if you're going to say me honoring an icon, showing honor to an Icon or reverence to an icon of Christ is somehow idolatry. Or if you don't want to drop the idolatry word in some way, distancing me from Christ. Right. The same would be true when I do good for a person. The same would be true when a servant obeys their master. Contra what St. Paul says, that you should obey them as the Lord."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4468.54,"end":4470.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Why not just obey the Lord directly?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4471.18,"end":4530.79,"speaker":"Fr Stephen De Young","text":"That would be instead. Right. And so if you're going to go down that road, if you're going to be a consistent iconoclast, you have to go down like the Christian anarchist road, no king, but Christ, where you give no honor to the government, the civil authorities, Contra St. Paul. Because that would be instead of Christ. Right. You're gonna have to. How can you divide your time? You're gonna have to become some kind of proto monastic hermit. Right. Because time you spend with your wife and kids is time you're not spending with Christ. If you take that iconoclastic argument seriously Right. Now, of course people don't. People only apply that argument to orthodox icons and apologetics against Orthodox people. But as Christians, they have to acknowledge that principle everywhere else, ethically or Christian ethics falls apart."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4531.67,"end":4532.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4532.71,"end":4539.83,"speaker":"Fr Stephen De Young","text":"Because it's based in this principle. And by the way, I was gonna."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4539.83,"end":4542.79,"speaker":"Fr Andrew Stephen Damick","text":"Say it's not just a series of commands of things you're supposed to be doing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4543.83,"end":4544.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4544.31,"end":4546.07,"speaker":"Fr Andrew Stephen Damick","text":"Jesus gives a reason for it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4546.95,"end":4547.35,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4547.43,"end":4547.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4548.75,"end":4552.91,"speaker":"Fr Stephen De Young","text":"Right. Like I don't love my brother just because God told me to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4553.63,"end":4554.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4555.23,"end":4560.99,"speaker":"Fr Stephen De Young","text":"I love my brother because in loving my brother, I am actually loving God. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4561.47,"end":4562.43,"speaker":"Fr Andrew Stephen Damick","text":"That's what he says."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4565.71,"end":4629.7,"speaker":"Fr Stephen De Young","text":"But by the way, by the way, just to further complicate this, the doctrine of the Holy Trinity is based on this principle too. Most people don't actually understand the doctrine of the Holy Trinity well enough to understand why iconoclasm wrecks it. But if you read the place where that principle I've been referring to, that the honor, veneration, worship given to an object passes to the prototype, given to an image passes to the prototype. Right. The place where that principle first gets laid out in those terms is not any argument about iconography. It's St. Basil the Great talking about the Holy Trinity in terms of why we as Christians aren't tri theists, why we don't worship three gods, because the worship we give to Christ passes to God the Father."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4630.98,"end":4631.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4632.66,"end":4636.42,"speaker":"Fr Stephen De Young","text":"And that's why we're monotheists. And monolatrous."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4636.42,"end":4652.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was going to say, I mean, there's other places where it's not just that the worship of Christ is the worship of the Father, but also like Christ himself says things like, if you've seen me, you've seen the Father. You know, they hated both me and my Father. Like, there's always this sense that the way you treat Jesus, he does not."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4652.86,"end":4655.3,"speaker":"Fr Stephen De Young","text":"Speak on his own authority. He speaks the words of his Father."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4655.91,"end":4660.95,"speaker":"Fr Andrew Stephen Damick","text":"I must be about my Father's business. I mean, you know, however you treat Jesus is how you're treating the Father."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4662.23,"end":4671.67,"speaker":"Fr Stephen De Young","text":"Right, Right. And so it's not just all of Christian ethics that falls apart if you're an iconoclast. It's the doctrine of the Holy Trinity and Christology."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4673.27,"end":4673.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4675.91,"end":4809.95,"speaker":"Fr Stephen De Young","text":"So it's not just a question of. I get that some folks, especially in US kind of phobic culture of touching things and kissing things. Right. Other cultures, men walk up and kiss each other on either cheek all the time to say hi. Right. We don't do that in the US I know you think kissing pictures or kissing anything is kind of icky and weird, but the correct response to that, to being kind of icked out by that, is not to deny the fundamental principle of Christian theology. Let me just suggest that. Just throw that out there. Gavin Ortland. Anyway, sorry, I didn't mean anyone in particular. Yeah. So if anyone is actually consistent with that, they won't end up being a Christian. Fortunately, people are completely inconsistent about that. They just want to apply it to iconography. But this is why Orthodox Christians have been saying ever since iconoclasm first reared its ugly head. Iconoclasm was a fairly late development in church history when iconoclasm first reared itself, since it first reared its ugly head. This is why Orthodox Christians have defended the principles of iconography. So strictly is because we're defending this principle. Because if you let go of this principle, your Christology falls apart, your view of Christian life falls apart. The doctor of the Holy Trinity falls apart. And so this isn't just some ancillary thing that just has to do with your church decor. Right, Right. Or whether you should just look at the iconography or kiss it. Right. This is, this is of critical importance to Christianity. So, yeah, people who haven't understood how that works yet shouldn't. Shouldn't start pulling out Jenga blocks when they. When they don't know how the tower is built. So anyway, yes, all that said, that was not off topic. Right. That's."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4810.03,"end":4811.47,"speaker":"Fr Andrew Stephen Damick","text":"No. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4811.63,"end":4813.95,"speaker":"Fr Stephen De Young","text":"These are some of the critically important here to understand. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4813.95,"end":4820.03,"speaker":"Fr Andrew Stephen Damick","text":"What the works that we're going to be judged on. Yes, yeah. Deeds."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4822.49,"end":4844.49,"speaker":"Fr Stephen De Young","text":"So it's also important, right, that if someone were wanting to argue with us and say, wait, wait, wait, wait, wait, wait, wait. This judgment works stuff. Ah, bad works, righteous is bad. Right. Their go to is probably going to be St. Paul."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4844.81,"end":4846.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And probably Romans especially."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4847.54,"end":4865.46,"speaker":"Fr Stephen De Young","text":"Right. That's who they're going to go to. That's where the perspective from which they're going to try to come come back at us. But what does St. Paul say, starting in Romans, when St. Paul talks about the basis on which we are going to be judged."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4867.22,"end":4918.72,"speaker":"Fr Andrew Stephen Damick","text":"Here we go. So yeah, Romans, chapter two, starting with verse five and going through 11. But because of your hard and impenitent heart, you are storing up wrath for yourself. On the day of wrath, when God's righteous judgment will be revealed, he will render to each one according to his works. To those who by patience and well doing seek for glory and honor and immortality, he will give eternal life. But for those who are self seeking and do not obey the truth, but obey unrighteousness, there will be wrath and fury. There will be tribulation and distress for every human being who does evil. The Jew first and also the Greek. But glory and honor and peace for everyone who does good. The Jew first and also the Greek for God shows no partiality."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4921.2,"end":4921.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4922,"end":4922.4,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4924.88,"end":4949.93,"speaker":"Fr Stephen De Young","text":"There'S not really a way to get around this one either. Right. So someone might say, well, St. Paul isn't talking about like the final judgment, like who goes to heaven and who goes to hell. Right. Not that that's our eschatology as Christians anyway. Right. This isn't talking about eternal life and eternal condemnation. This is talking about like rewards or something. Yeah, there's a judgment of works, but that's like, you know, you get jewels in your crown or something."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4949.93,"end":4961.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, I've heard literally that, you know, essentially like, well, you know, whether you get in and out is one question, but kind of how big your mansion is or how nice your heavenly Rolls Royce is is what this is about."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4962.58,"end":4979.14,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Some people are going to end up in the heaven slum and some people, yeah, problem with that. Right. He says he'll render to each one according to his works. To those who by patience and well doing seek for glory and honor and immortality, he will give eternal life."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4980.99,"end":4985.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's about eternal life and immortality."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":4985.39,"end":5002.75,"speaker":"Fr Stephen De Young","text":"Righteousness, there will be wrath and fury. And it's patience in doing good is literally what he says. Those who seek for glory and honor and immortality by patience in doing good receive eternal life at the day of judgment. According to St. Paul."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5002.91,"end":5007.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And tribulation to distress for every human being who does evil."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5007.88,"end":5024.92,"speaker":"Fr Stephen De Young","text":"Right. And this isn't. He's not talking about. This isn't a place where St. Paul is like, doing this rhetorical thing. Right. He's not saying, oh, well, this is the way it worked in the Old Covenant, but now we're going to something new. Because notice he says for the Jew first and also for the Greek."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5025.88,"end":5027.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It applies to Gentiles."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5027.28,"end":5029.96,"speaker":"Fr Stephen De Young","text":"Greeks weren't included in the Old Covenant. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5030.12,"end":5040.44,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And not just Greeks. Greeks. The Greek is the nations. It's sort of everybody else. And it's the Judeans. And St. Paul."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5040.44,"end":5057.52,"speaker":"Fr Stephen De Young","text":"Right. He's talking about Gentiles. Right. Jews and Gentiles. So this is talking about Christ's judgment seat. Right. And there's not a place. And this isn't St. Paul sort of problematizing to then give you a way out."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5059.18,"end":5059.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5059.5,"end":5070.7,"speaker":"Fr Stephen De Young","text":"Right. Because you notice he doesn't say here, therefore everyone stands condemned. There's gonna be wrath and fury for everyone. He most definitely doesn't say that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5071.74,"end":5074.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no sense of. Well, if you."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5074.1,"end":5075.22,"speaker":"Fr Stephen De Young","text":"But now you're off the hook."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5075.22,"end":5080.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or. Or even if you. If you do good, you get glory and honor and immortality. But, you know, no one does good. So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5081.26,"end":5090.11,"speaker":"Fr Stephen De Young","text":"Yeah, but you can't. Yeah, Right. He doesn't. He doesn't. Right. And it's important."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5090.51,"end":5090.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5091.87,"end":5127.03,"speaker":"Fr Stephen De Young","text":"Verse 5. We didn't just include verse 5. Because he talks about the Day of Wrath, when God's righteous judgment is revealed. Just to locate this on the Day of Judgment. But why is it that the people he's speaking to, or how is it that they're storing up wrath for themselves on the Day of Judgment? Because they have a heart that is hard and unrepentant. The word that's translated unrepentant there is ameta noiton, which is may hear metania in there."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5127.03,"end":5127.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5127.35,"end":5131.91,"speaker":"Fr Stephen De Young","text":"Without repentance, it's got an alpha on the front. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5132.31,"end":5133.11,"speaker":"Fr Andrew Stephen Damick","text":"Alpha priest."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5133.11,"end":5135.51,"speaker":"Fr Stephen De Young","text":"A repentance. Your lack of repentance."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5136.32,"end":5136.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5136.96,"end":5137.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5137.36,"end":5143.92,"speaker":"Fr Andrew Stephen Damick","text":"And that's about what you do. It's not about what you think or what you feel. It's about what you do. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5144.48,"end":5239.51,"speaker":"Fr Stephen De Young","text":"So the answer to this, for what St. Paul says here, the answer to this is not for these people he's talking to to believe something, think something, change their mind in terms of their thoughts about something. It's to repent of the evil they've done and to begin to patiently seek to do good. That's what he presents the solution as which what St. Paul says here, not really any different than what St. John the forerunner is saying or what Christ was saying in the peril of the sheep of the goats. Right. There's a judgment by works, therefore repent and seek to do good. It's amazing. I do and I don't. I'm not using amazing rhetorically. It does amaze me sometimes when I sit back and think that one of the most controversial things you could say in American Christian circles is that Christians ought to try not to commit sins and to go and do good things that are pleasing to God. Like you would think, like. Yeah, right. But as someone who has said that publicly in mixed American Christian company, you get accused of teaching works."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5239.51,"end":5240.11,"speaker":"Fr Andrew Stephen Damick","text":"Righteousness."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5240.28,"end":5240.84,"speaker":"Fr Stephen De Young","text":"How dare you?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5242.52,"end":5247.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, people did. I mean, like righteousness."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5247.72,"end":5254.76,"speaker":"Fr Stephen De Young","text":"You can't swing a dead cat in the Bible. I don't know why you'd be swinging a dead cat in a Bible, but if you can't swing a dead cat in the Bible without hitting that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5255.08,"end":5281.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, righteousness is like, whenever a righteous person is described, he or she is described by the way that he lives. That's what it means to be righteous. You know, I mean, and some people might argue, they'll say, oh, well, we've got the righteousness of God and not our own. It's just as filthy rags, blah, blah, blah. But that's not about, you know, your good deeds are worth nothing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5282.56,"end":5283.92,"speaker":"Fr Stephen De Young","text":"That's a person repenting."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5284.08,"end":5305.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's, you know, did you. You know, it's not. You came up with your own impressive things that you think are going to get you saved, like your own feats of heroism. Right. That's what's being spoken against there. That's the garbage. You know, if you do the things that God has given you to do, that's not filthy rags."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5305.51,"end":5305.99,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5306.63,"end":5310.79,"speaker":"Fr Andrew Stephen Damick","text":"That's God's works. But yes, give too many spoilers."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5311.67,"end":5319.27,"speaker":"Fr Stephen De Young","text":"Loving your brother and killing your brother are not equally sinful. One of those is pleasing to God and the other one is not."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5319.27,"end":5321.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly, exactly."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5321.38,"end":5363.24,"speaker":"Fr Stephen De Young","text":"Right. Like, yeah, yeah. And yes, I know even when I love my brother, my motives are never pure. And da, da, da, da, da, da. Still more pleasing to God than me murdering him. So we've gotten to this weird place, and I don't think we're in that weird place in the real world. Right. Our Protestant friends, who would get the most mad at me for the way I'm talking right now. On the theoretical level, if you look at how they actually live their life, they try not to commit sins and they try to do good for people."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5363.56,"end":5364.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5365.88,"end":5371.08,"speaker":"Fr Stephen De Young","text":"They functionally do it, but if you say it, it sounds wrong to them."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5373.41,"end":5373.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5374.21,"end":5376.41,"speaker":"Fr Stephen De Young","text":"On this ideological level, you think you're."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5376.41,"end":5377.73,"speaker":"Fr Andrew Stephen Damick","text":"Adding something to your salvation."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5378.69,"end":5379.09,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5379.65,"end":5380.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5380.89,"end":5395.65,"speaker":"Fr Stephen De Young","text":"Of course not. And they don't think that when they're out doing good things for people, to help people. But again, so we need to get past this. Right. If the Scriptures feel totally fine about talking this way, we can talk this way, too."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5396.21,"end":5396.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5397.49,"end":5408.63,"speaker":"Fr Stephen De Young","text":"And if the Scriptures talk this way consistently all through the New Testament as we're showing here, then maybe. Any idea we've come up with theologically that conflicts with that? We should just dumpster it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5408.87,"end":5409.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5409.83,"end":5411.75,"speaker":"Fr Stephen De Young","text":"And go with the way the Bible talks about it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5411.91,"end":5416.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How about some more examples?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5416.71,"end":5419.63,"speaker":"Fr Stephen De Young","text":"Yes. Another example from St. Paul in Second Corinthians."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5419.63,"end":5455.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so two Corinthians, chapter five, verses six through ten. So we are always of good courage. We know that while we are at home in the body, we are away from. From the Lord. For we walk by faith, not by sight. Yes. We are of good courage, and we would rather be away from the body and at home with the Lord. So whether we are at home or away, we make it our aim to please him. For we must all appear before the judgment seat of Christ so that each one may receive what is due for what he has done in the body, whether good or evil. Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5456.01,"end":5459.61,"speaker":"Fr Stephen De Young","text":"So before the judge received Christ, we're judged for what we have done."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5460.33,"end":5474.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's notable here that he says we all must appear before the judgment seat of Christ. He doesn't say, but if you believe that Jesus is your savior and accept him as Lord of your life, then you don't have to appear before the judgment seat of Christ."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5474.81,"end":5476.21,"speaker":"Fr Stephen De Young","text":"Get out of judgment free card."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5476.21,"end":5485.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he says, we're all going to appear and we're all going to receive what we've done in the body. That's. That's pretty worksy. It's about your body, like what you."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5485.34,"end":5494.98,"speaker":"Fr Stephen De Young","text":"Do with your body. And the reason we read those first few verses is that 4, at the beginning of verse 10, 4, we must all appear before the judgment seat of Christ. That's because."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5496.02,"end":5499.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's why we walk by faith, not by sight."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5499.3,"end":5520.3,"speaker":"Fr Stephen De Young","text":"Right. The effect of that, our knowledge that we're going to have to appear before the judgment seat of Christ to receive what is due, whether good or evil, for what we've done in this life is what causes us in this life to try to live our lives faithfully in a way that is pleasing to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5520.3,"end":5524.22,"speaker":"Fr Andrew Stephen Damick","text":"Christ, because it's actually critical. What we do in this life is."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5524.22,"end":5526.94,"speaker":"Fr Stephen De Young","text":"Actually critical in a way that's pleasing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5526.94,"end":5529.14,"speaker":"Fr Andrew Stephen Damick","text":"To Christ, not just bonus, not just."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5529.14,"end":5536.46,"speaker":"Fr Stephen De Young","text":"Because you'll be kind of embarrassed, but get eternal life anyway. Is that what St. Paul says?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5536.86,"end":5537.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5538.22,"end":5538.62,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5540.46,"end":5541.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, next one."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5541.74,"end":5547.42,"speaker":"Fr Stephen De Young","text":"And other new Testament authors should be no surprise. Don't disagree with him."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5547.42,"end":5564.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. St. Peter, for instance, 1 Peter, 1:17, just one verse. And if you call on him as Father, who judges impartially according to each one's deeds, conduct yourselves with fear throughout the time of your exile."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5567.82,"end":5586.33,"speaker":"Fr Stephen De Young","text":"Right. So God is going to judge you according to your deeds, according to your works. Therefore, conduct yourself with the fear of God. Right. With awe and reverence toward that judgment throughout the time of your life in this world."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5589.69,"end":5611.62,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, back to St. Paul. Colossians, chapter three, verses 23 through 25. Whatever you do, work heartily as for the Lord and not for men, knowing that from the Lord you will receive the inheritance as your reward. You are serving the Lord Christ for the wrongdoer will be paid back for the wrong he has done. And there is no partiality."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5614.26,"end":5648.42,"speaker":"Fr Stephen De Young","text":"Right. So once again, this isn't St. Paul like, problematizing, like, this is what we face. But now just believe in Jesus. Right. And you avoid all this. He never says that. Right? He never says that. Now, there is one place where Christ talks about judgment that some people might see as being slightly different. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5649.06,"end":5701.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is Matthew, chapter 12, where the Lord says, either make the tree good and its fruit good, or make the tree bad and its fruit bad, for the tree is known by its fruit. You brood of vipers, how can you speak good when you are evil? For out of the abundance of the heart, the mouth speaks. The good person out of his good treasure brings forth good, and the evil person out of his evil treasure brings forth evil. I tell you, on the day of judgment, people will give account for every careless word they speak. For by your words you will be justified, and by your words you will be condemned. So you can see how some people might take that, especially those last bits, as saying, well, it's about the things that you say. You believe your words. You know it's going to justify you or condemn you. But he wasn't just talking about believing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5703.24,"end":5741.62,"speaker":"Fr Stephen De Young","text":"Right? Right. He's talking about a good person and a bad person. Right. And that the acts of speaking, the things that come out of their mouth, Right. Those are actions. Right. As Christ says, the person who says to his brother, you fool. Has already murdered him and is heart. That's what he's talking about here. Right. So this is not a different standard. This is Christ clarifying that standard. Right. That saying lewd things and engaging in sexual immorality are not two different things where one's okay and the other one isn't."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5741.78,"end":5742.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5744.42,"end":5780.49,"speaker":"Fr Stephen De Young","text":"Saying mean things to people but not actually putting your hands on them is not like, okay. Right. And this is not. You know, sometimes this stuff gets. Oh, Christ is making the law more intense. Right. It's like that was already in the Torah. He's just interpreting it for people who had been interpreting it incorrectly to justify their own behavior. He's interpreting them correctly because just use the Ten Commandments. Right. What is covetousness if not the thoughts that precede stealing?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5781.13,"end":5781.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5782.17,"end":5786.41,"speaker":"Fr Stephen De Young","text":"What is coveting a man's wife if not the thoughts that precede adultery?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5786.73,"end":5787.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5788.01,"end":5821.2,"speaker":"Fr Stephen De Young","text":"Right, right. Isn't changing the Torah. Right. It's just you had a bunch of people he was talking to who were saying, well, you know, I thought about it, but I didn't do it. So, you know, he's like, no, thinking about it is doing something. And that's already there. But in the Commandments. Right. So that's not really an outlier. It still works. Right. But that includes the words that come out of your mouth, not just the things you do with your hands and your. The rest of your body."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5821.44,"end":5821.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5824.16,"end":5833.77,"speaker":"Fr Stephen De Young","text":"And so then we started with Matthew. We said the whole New Testament more or less ending up near the end of the book of Revelation."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5835.29,"end":5838.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, we are talking about judgment, so we do need a little apocalypse."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5838.85,"end":5839.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5841.13,"end":5866.26,"speaker":"Fr Andrew Stephen Damick","text":"So revelation, chapter 20, verse 12. And I saw the dead, great and small, standing before the throne. And books were opened. Then another book was opened, which is the Book of Life. And the dead were judged by what was written in the books according to what they had done. That's what's in the Book of Life."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5866.98,"end":5873.3,"speaker":"Fr Stephen De Young","text":"Yeah. And that is Revelation, chapter 20, verse 12. Because the world is coming to an end in 2012."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5873.54,"end":5882.27,"speaker":"Fr Andrew Stephen Damick","text":"I knew it. So because chapters and verses were written there by the apostles, right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":5882.75,"end":6009.44,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, they were authorized. It's the authorized version, so. Right. So these books are opened. What books are those? We've talked about this a little bit on previous episodes of the show. These heavenly books, earlier than that, in the ancient near east, they're heavenly tablets, Right. Sometimes. So in some Second Temple Jewish sources, like the Book of Jubilees, you've got an angelic being who sort of records everything that's happening on Earth. Everything everybody does. Sometimes the books are just there. Right. We don't get like an explicit description of who's doing the writing or, you know, that kind of thing. But the books are there with everything everyone has done. Right. And we've also talked before about the Book of Life. The idea of a name being in the book of life being related to divine memory. Right. To be remembered by God means you can. Because God is eternal. Means eternal life. Right. This is eternal life to know you, the only true God. Right. And this is why, of course, as we've said before, this is why we sing memory eternal in the Orthodox Church at memorial services. May the person's memory be eternal if they're remembered by God. Their name is in the book of life. But of course, people can be blotted out of the Book of Life. We read about names being blotted out of the book of Life repeatedly in the Scriptures. And that means the name's erased. The name is gone. This person is forgotten and abandoned by God. This is an image of. Of condemnation. So, yes, once again, here's the standard. It works. It's what people have done. So are we on Lord of Spirits teaching works righteousness? Yes, yes, in one sense."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6009.52,"end":6021.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because again, to be a righteous person is someone who lives the right way and righteousness equals justice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6021.74,"end":6024.22,"speaker":"Fr Stephen De Young","text":"That's the same word in Greek."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6024.22,"end":6025.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6026.78,"end":6074.2,"speaker":"Fr Stephen De Young","text":"So, right. The idea is if a person is righteous, they are right. They are rightly ordered. Not just internally, but rightly ordered in terms of their relations with God and other people. Right. And that is not a different thing from how they live their life. It doesn't mean they're right with God and other people on the inside, but are degenerates in the way they live their life. That dog don't hunt. You can't be regenerate and a degenerate at the same time. Sorry, Martin Luther. So, yeah, when it says in Genesis 6 that Noah was righteous from his generation."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6074.87,"end":6075.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6076.31,"end":6088.23,"speaker":"Fr Stephen De Young","text":"That doesn't mean he lived his life exactly like everybody else, but he had had a foreign righteousness freely imputed to him. That's not what that means."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6090.15,"end":6091.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It means he did differently."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6091.55,"end":6105.2,"speaker":"Fr Stephen De Young","text":"And you're doing an unbelievable amount of eyes of Jesus to say that. That's what it means. Right. It means the way he lived was fundamentally different than the way the other people of the world were living. Whose thoughts were always evil all the time were told in Genesis."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6105.2,"end":6108.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6108.6,"end":6132.96,"speaker":"Fr Stephen De Young","text":"His weren't. Okay, that's not. But also, are we teaching on Lord of Spirits works righteousness also. No, no, because what people usually mean. Well, here's probably. I was going to say what people usually mean, but I don't think it's clear and I think that's part of the problem."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6134.24,"end":6182.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean I remember, I don't think when I was being brought up in, you know, low church evangelical circles, this was talked about all the time and it was constantly said there's nothing you can do to earn your way to heaven. It's a free gift from God. Your righteousness is as filthy rags before the Lord. And so there's this idea. Well, those Catholics, they probably hadn't heard of the orthodox. Those Catholics think they can earn their way to heaven with their good deeds. This is the whole matrix in which it was talked. Exactly like that. Exactly like that. I must have heard a thousand sermons that that was basically the message. So when people talk about works righteousness, that's what they generally mean is they think you think you can do enough good deeds and earn your way to heaven."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6183.98,"end":6200.46,"speaker":"Fr Stephen De Young","text":"Right, right. And, but that's not the problem is I think that's not sufficiently disambiguated in most people's minds from just, hey, as a Christian you ought to try to do good."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6200.78,"end":6201.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6201.82,"end":6249.15,"speaker":"Fr Stephen De Young","text":"In the world. Right, right. And I think at least some of the reformers would have wanted to disambiguate that. The reason I always say some of the reformers is this is another one of the places and this is a place where we've just got to go there. Protestant friends. This is one of the places where Protestantism in the 16th century and 17th century was understandably reactionary against Roman Catholicism. Right. Against Rome. But that reactionary stance has remained for another coming up on 400 years that it didn't need to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6250.59,"end":6255.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean they're reacting against this Roman Catholic idea."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6255.91,"end":6257.55,"speaker":"Fr Stephen De Young","text":"Medieval Roman Catholic system."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6257.63,"end":6273.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're reacting against this idea that there's. And I will, I think I'm going to mispronounce this, but I don't mean to super erogatory works or merit. Don't at me people."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6275.99,"end":6279.83,"speaker":"Fr Stephen De Young","text":"Now I'm going to make you explain the difference between Condine and congruent."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6279.83,"end":6317.05,"speaker":"Fr Andrew Stephen Damick","text":"Oh, don't do that. No, I mean this idea like there's this idea that the saints, they did everything that was required for them to get to heaven, but they did extra and that extra can be repurposed for ordinary people to help them. I mean that's basically kind of the idea of this sort of treasure house of merit. I know Roman Catholic friends that I'm probably oversimplifying, but I'm just trying to simplify."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6318.07,"end":6319.35,"speaker":"Fr Stephen De Young","text":"Let's just cut to the chase on that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6319.35,"end":6320.07,"speaker":"Fr Andrew Stephen Damick","text":"Okay? Okay."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6320.55,"end":6342.95,"speaker":"Fr Stephen De Young","text":"Roman Catholic friends. Okay. One of the memes out there is that Lord of Spirits is always misrepresenting Roman Catholicism. Okay. There's a basic problem right now within the Church of Rome, and that is that it is unclear what the teaching of the Church of Rome is on any topic."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6345.62,"end":6346.82,"speaker":"Fr Andrew Stephen Damick","text":"But, but, but."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6346.82,"end":6359.7,"speaker":"Fr Stephen De Young","text":"Because I come on this show, I have literally quoted documents that have official standing in the Roman Catholic Church and been accused of misrepresenting Roman Catholicism. Yeah, I have."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6361.06,"end":6361.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6361.54,"end":6367.54,"speaker":"Fr Stephen De Young","text":"Anyway, I have quoted cardinals who are heads of Vatican Congresses and been told I'm misrepresenting Roman Catholicism."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6368.02,"end":6370.77,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's because they're misrepresenting Roman Catholicism."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6370.77,"end":6377.37,"speaker":"Fr Stephen De Young","text":"Right, Exactly. I don't know. There's a lot of Roman Catholics who think Pope Francis misrepresents Roman Catholicism. He's the Pope."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6377.37,"end":6380.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, I know many that feel that way."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6381.17,"end":6407.04,"speaker":"Fr Stephen De Young","text":"So look, right. The best we could do on this show is try to quote members of the Magisterium and official documents. Okay. And if you think those are a misrepresentation, your issue is not with me or with Father Andrew. Your issue is with the people issuing those documents and the people who said those quotes. Okay. Because that's all we have to go on."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6407.28,"end":6409,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6409,"end":6410.48,"speaker":"Fr Stephen De Young","text":"That's all we have to go on."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6410.48,"end":6416.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But, yeah, I mean, so the Reformation is reacting against this idea that historically."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6417.04,"end":6480.5,"speaker":"Fr Stephen De Young","text":"Right. In the, you know, pre Counter Reformation, it's pretty darn clear, and I think hard to argue with that Roman Catholicism was teaching. And this is what the Reformers are reacting against. Right. That grace received in the lives of people through the sacraments. Right. Enabled them to, in various ways, accrue merit by different means. Right. So there's condign merit, congruent merit. I'm not going to go into all that now. I do actually know the difference, but I'm not gonna go into all that now to accrue merit. Which merit, when it reached a certain point. Right. Qualified one for eternal life. That is not. That is not even that. Right. That. That the Reformation objected to. Even. That is not Pelagianism. Okay. Pelagianism is the idea that you don't need grace for salvation."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6480.5,"end":6483.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That you can really, truly do it all on your own."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6483.8,"end":6527.45,"speaker":"Fr Stephen De Young","text":"So that merit is always produced, even in that medieval Roman Catholic system, that merit was always produced by the work of grace, although grace was seen as a quantifiable created substance. That's a whole other debate. Right. But was always produced by grace in the person's life. Right. So it's not Pelagianism and that saints accrued more merit than was required for eternal life. That merit goes into the treasury. That treasury is accessible by the keys of St. Peter and can be given out. That merit can be given out in the form of grace by in particular, the Bishop of Rome."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6527.53,"end":6527.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6527.81,"end":6531.61,"speaker":"Fr Stephen De Young","text":"The Pope of Rome. And that's the system they're reacting against."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6531.77,"end":6533.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6533.69,"end":6537.85,"speaker":"Fr Stephen De Young","text":"And so they saw that. The Reformers saw that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6539.06,"end":6539.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6540.26,"end":6564.02,"speaker":"Fr Stephen De Young","text":"And did not. This is why I say it's a reactionary position. They didn't throw the whole thing out and start over from the Bible. They didn't and they don't claim to. Many, many evangelical Protestants today talk like they did. But no, Luther and Calvin would smack you upside the head if you said. Told them they threw everything out and started over."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6564.02,"end":6570.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No one can actually do that, even if they're trying really hard."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6572.04,"end":6592.72,"speaker":"Fr Stephen De Young","text":"But what they said was they agreed, yes, there's a certain amount of merit you need for eternal life, but Christ earned it all. And the whole thing gets imputed into your account all at once when you're justified."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6592.8,"end":6593.28,"speaker":"Fr Andrew Stephen Damick","text":"Boom."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6594.16,"end":6595.84,"speaker":"Fr Stephen De Young","text":"Right? That's it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6596.16,"end":6596.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6596.56,"end":6613.76,"speaker":"Fr Stephen De Young","text":"And so it's not related to the things you do. It's not even related to the sacraments. The Reformers did say the sacraments are means of grace, but they meant that in another sense it's sanctifying grace. Again, I'm not going to go into all that now. Right. I'm mentioning it just because, again, we'd get added by a bunch of people. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6614.88,"end":6616.88,"speaker":"Fr Andrew Stephen Damick","text":"I'm sure we will. I'm sure this segment."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6616.88,"end":6617.28,"speaker":"Fr Stephen De Young","text":"And we will."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6617.28,"end":6619.84,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, for this segment, we'll draw a little bit of. Of that."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6620.56,"end":6633.44,"speaker":"Fr Stephen De Young","text":"Right, Right. But so the reason why we're not teaching any kinds of. Any kind of works, righteousness, even if you consider the medieval Roman system to be works righteousness."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6633.68,"end":6634.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6634.04,"end":6638.72,"speaker":"Fr Stephen De Young","text":"Is it that. That's not what we're saying. Because we don't. We don't think there's a. There's a threshold."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6639.6,"end":6641.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not a certain amount that you need."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6641.64,"end":6660.03,"speaker":"Fr Stephen De Young","text":"There's no merit coming into the equation here. We're not talking about that at all. So there is a sense in which we could say salvation is by works. Right. And that is in the sense of theurgy, which is today's secret word."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6660.67,"end":6665.39,"speaker":"Fr Andrew Stephen Damick","text":"Everybody scream real loud every time Father Stephen says theurgy."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6665.55,"end":6676.87,"speaker":"Fr Stephen De Young","text":"Yes. Or if someone says it without having heard this Episode, you can give them $100. I guess that's an even more obscure reference, but. Right. Theurgy, literally, the works of God."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6676.87,"end":6677.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6677.71,"end":6678.95,"speaker":"Fr Stephen De Young","text":"That probably tells you where we're going."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6678.95,"end":6680.91,"speaker":"Fr Andrew Stephen Damick","text":"In this case, the etymology works very well."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6681.87,"end":6684.95,"speaker":"Fr Stephen De Young","text":"Right? Well, because it's a coinage."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6684.95,"end":6688.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's because they're like, okay, let's make up a word."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6688.19,"end":6697.55,"speaker":"Fr Stephen De Young","text":"Let's make a word. Yeah. Right. So we are saved by works, but it's God's works. Right? Right. Not some independent works of ours."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6697.74,"end":6720.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the point then of saying that we believe in works, righteousness, that we teach that is that. And that we're going to be judged according to our works, because that's everywhere in the New Testament, is that our works, the good things that we do, actually come from God. And so when we do those things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6720.86,"end":6721.9,"speaker":"Fr Stephen De Young","text":"That God is doing them."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6721.9,"end":6742.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, God is doing them. When we do those things, then we are participating in the works of God. So If I give $100 to my church, it's not just that God gave me that hundred dollars, it's that God is giving $100 to the church, and I'm just participating in it. Ultimate."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6742.15,"end":6743.99,"speaker":"Fr Stephen De Young","text":"Ultimately, you're giving that $100 to God."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6744.07,"end":6761.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I'm giving it to God. Right. And so when I do that, it also transforms me. It changes me. I actually become righteous. I'm not just imputed as righteous. I'm not just said to be righteous. I actually am righteous when I do righteous things."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6762.28,"end":6764.76,"speaker":"Fr Stephen De Young","text":"Right. You actually become righteous."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6765.16,"end":6765.72,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6765.8,"end":6767.6,"speaker":"Fr Stephen De Young","text":"Not because you've earned that status."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6767.6,"end":6769.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I didn't earn it. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6771.24,"end":6783.23,"speaker":"Fr Stephen De Young","text":"But with your cooperation. Not against your will, with your cooperation. Right. God has made you more righteous. God has shared his righteousness with you."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6785.39,"end":6785.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6785.95,"end":6811.96,"speaker":"Fr Stephen De Young","text":"And righteousness and justice are the same word. He is putting you back in order and putting your relationships with him and with other people back in order. Right. But that's a process, pruning, remember, that takes place over time. Right. And so doing the works of God. Right. Participating in the works of God. God can look at those works when they're done and call them good. Because they're his."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6811.96,"end":6814.2,"speaker":"Fr Andrew Stephen Damick","text":"Because they're his. Yep."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6815.4,"end":6835.67,"speaker":"Fr Stephen De Young","text":"I can't muster up enough love in me to love all the people I'm supposed to love and to love them the way I should. Right. But God loves them that way already. And so when I show God's love to them, which is ultimately showing God's love to God, remember the whole iconography thing?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6836.63,"end":6836.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6836.99,"end":6874.72,"speaker":"Fr Stephen De Young","text":"Thine own of thine own and all that, then that is transformative for me and for the recipient of God's love. And that is how God is transfiguring us and the world. Part of the problem here, too, I think, is that I know I've mentioned this on the show before, is that we have the relationship between beliefs, thoughts, ideas, you know, the things we believe, the ideas we hold to be true and our life and the way we live."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6874.96,"end":6883.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We tend to think like, well, once I agree with this, once I understand this, then I'll do it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6886.97,"end":6898.49,"speaker":"Fr Stephen De Young","text":"Right. We say people's beliefs. If you believe the right things, Right. So you have the right theology in your head, then you'll live your life the correct way. Right. Because your beliefs affect the way you live."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6898.49,"end":6898.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6899.29,"end":6900.89,"speaker":"Fr Stephen De Young","text":"And that is false."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6900.97,"end":6902.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6902.21,"end":6905.05,"speaker":"Fr Stephen De Young","text":"If that were true, there would be no hypocrites."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6905.29,"end":6906.81,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6908.91,"end":6909.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6909.15,"end":6909.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6909.55,"end":6911.15,"speaker":"Fr Stephen De Young","text":"That is just patently not true."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6911.63,"end":6912.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6912.11,"end":6913.87,"speaker":"Fr Stephen De Young","text":"Read the end of Romans, chapter seven."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6914.51,"end":6916.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I've seen."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6916.11,"end":6918.91,"speaker":"Fr Stephen De Young","text":"Good. I want to do. I do not do. Yeah, exactly."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6920.11,"end":6923.19,"speaker":"Fr Andrew Stephen Damick","text":"St. Paul knew it very, very well. Believed it very, very well."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6923.19,"end":6923.55,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":6923.79,"end":7015.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And I've seen, you know, and I've seen this, honestly. I mean, you and I have both seen this pastorally. Right. Where someone maybe doesn't understand something or doesn't know how they feel about it or whatever. Right. You know, very kind of modern American ways of talking. And you encourage them. Well, look, do this. Pray this daily prayer rule. Do this when you come to church, make the sign of the cross. Do this. Even though you don't particularly feel like you love your wife, do a good thing for her at least once a day. And if people do those things, if I do those things, then over time, I discover they're not only easier to do, but the way that I think about them changes. So that conviction actually follows conditioning. The action precedes the belief. The belief is not. And I was actually, I just. I saw there's a quote, a great quote from Saint Athanasius. I think it's on the. From the. On the Incarnation, which I just saw today, where he says, and I'm probably slightly paraphrasing, but he says, unless you have a pure mind and try to imitate, you cannot possibly. This is how it is. You cannot possibly understand the teachings of the saints unless you have a pure mind and try to imitate their life. It's one of the best. I mean, and it's great because it's one of those quotes that even if you take it out of context, it still has the same meaning, you know, and he says that, like, if you're not living it, then you can't understand it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7016.67,"end":7026.19,"speaker":"Fr Stephen De Young","text":"Yeah. It's not possible. Right. And so, yes, ideas, these thoughts, these things are epiphenomenal."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7026.19,"end":7026.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7026.47,"end":7038.03,"speaker":"Fr Stephen De Young","text":"And this is all the time on this show. Kind of the whole purpose of this show is correcting a lot of bad ideas and ways of thinking we've gotten from our culture and our society."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7038.36,"end":7038.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7039.4,"end":7045.64,"speaker":"Fr Stephen De Young","text":"And most of these things aren't things that someone sat down and told us and we believed at some point we."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7045.64,"end":7047.16,"speaker":"Fr Andrew Stephen Damick","text":"Weren'T taught these as lessons."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7048.2,"end":7064.12,"speaker":"Fr Stephen De Young","text":"Right. And in fact, a lot of them, if we were asked straight out, like you, if you ask the average Christian straight out, do angels and demons exist? They'll say, yeah, yeah. Does that have any effect on anything? And they're like, no."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7064.2,"end":7067.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What are you actually doing about that? Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7067.28,"end":7243.37,"speaker":"Fr Stephen De Young","text":"You know, six days a week you live basically the same way an atheist does and then go to church. Right. Like an atheist who's a reasonably moral person. Right. No one was taught that. Right. And if asked directly, they would say they believe it. Right. But through years of living a certain way, being in a certain society, having media present you information in a certain way. Right. We've all of us hosts of the show included, been guided to certain ways of looking at things and viewing things slowly over time. And so we've got it. We've got to break those. But those ideas, those thoughts, those ways of thinking, those ways of viewing the world came through practice, came through a way of life, came through repeated experiences. And the. The opposite is true as well. Right. All the time I have folks who come from, for example, who come into the Orthodox Church from a Protestant background, and we're getting near the end of their catechesis, and they're kind of concerned because, oh, I'm. I'm supposed to get Chrismated, I'm supposed to get baptized, and I'm still not sure about this Mary stuff. Still makes me a little. I don't know, Right. Because of the way they were brought up. And my answer to them is like, well, then no gatekeeping. You cannot be Christmas baptized until you agree with this list of points of theology from the Orthodox Church. I tell you the exact opposite. I tell them, that's fine, right? We'll baptize you, we'll Chrismate you. You live as an Orthodox Christian. And invariably within a couple of years, those people say, oh, yeah, all of a sudden I get it. Right. I never got it. But I came to the Akatha hymns, and now this Theotokos stuff makes sense to me all of a sudden right now iconography makes sense to me all of a sudden. Right. That's the answer. The answer is life. The answer is not having an argument where I prevail and demonstrate that this point of theology is correct. I kind of wish it was that because I'm good at it, but that's not how it works. I'm much better at intellectual argument than I am at life. I've got a wall of graduate degrees to attest to this and non sainthood to test to the other. But that's the reality of how it is. And you know, St. Paul again, St. Paul in Romans sums it up right. It's not the hearers of the law, but the doers who are justified."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7245.45,"end":7246.17,"speaker":"Fr Andrew Stephen Damick","text":"Pretty straightforward."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7246.17,"end":7249.45,"speaker":"Fr Stephen De Young","text":"You can know Torah backwards and forwards. It doesn't help you if you don't do it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7250.63,"end":7258.39,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, that's the end of the second half, but there is a third half to come. So we're going to take our final break and we'll be right back with the Lord of Spirits."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7258.63,"end":7274.87,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7279.12,"end":7281.72,"speaker":"Fr Andrew Stephen Damick","text":"Introducing a new book from Ancient Faith."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7281.72,"end":7335.93,"speaker":"Announcer","text":"Publishing, Healing Work giving humanity a second chance. Written by Joshua McCool, Healing Work is essentially a how to guide to help readers locate the starting point in their own healing process and gain confidence in responding to the ebbs and flows, successful and setbacks of the healing journey. This book is about helping people learn how to make their healing journey shorter. It's tragic that so many get stuck in distressing emotional patterns for years or even decades, often because they simply don't know how to identify why they are suffering. We can work to reduce unnecessary emotional suffering by learning to identify what we need to focus on and by developing skills to navigate the emotional space between the extremes of anger and happiness. Healing Work giving humanity a second chance."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7336.89,"end":7342.09,"speaker":"Fr Stephen De Young","text":"Available now at store.ancient faith.com we're back."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7342.09,"end":7357.66,"speaker":"Announcer","text":"Now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7364.86,"end":7376.1,"speaker":"Fr Andrew Stephen Damick","text":"And we're back with the third half of the Lord of Spirits in this pre recorded episode. So again, we're not taking calls this time because Father Stephen is up in Canadia when this Airs live."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7376.1,"end":7377.26,"speaker":"Fr Stephen De Young","text":"Great White North. Eh?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7377.34,"end":7405.8,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. For everyone's story. Yeah. So we're talking about judgment. We're talking about Doomsday, and we just spent the first couple halves talking about, well, especially this last half. Works and judgment according to works, but also the day of the Lord in the first half in particular, and what exactly that means."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7407.04,"end":7407.76,"speaker":"Fr Stephen De Young","text":"Judgment Day."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7408.16,"end":7410.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Judgment Day. End of days, which."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7410.8,"end":7423.28,"speaker":"Fr Stephen De Young","text":"Which you won't know what I'm about to talk about, but is a weird faction, if you really think about it. Like, especially Dominic Mysterio. Like, I mean, I get what he's doing, but it's a weird faction. Anyway, go ahead."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7424.48,"end":7439.41,"speaker":"Fr Andrew Stephen Damick","text":"I'll look that up later, I guess. Yeah. I mean, there's a very select group of our audience, I was gonna say. Is that a Terminator thing? No. Okay. I know There's a Terminator 2, Judgment Day, and I have seen that film."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7439.41,"end":7441.21,"speaker":"Fr Stephen De Young","text":"That's a pro wrestling thing."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7441.21,"end":7472.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh. Oh, yeah, Yeah. A friend of mine actually worked back, so one of my friends who was a stagehand as well, he actually worked a couple of pro wrestling shows and had some really fun stories to tell about, you know, guys who. The wrestlers, like, out in the hallways, you know, they turn the camera on them and they're like, all. And, you know, thumping their chest, whatever, at some other guy. And then as soon as the cameras are off, they're, you know, they're buds, you know."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7472.72,"end":7473.24,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7474.44,"end":7480.2,"speaker":"Fr Andrew Stephen Damick","text":"So it might not be real, Father Stephen. I'm just saying it might not be real."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7481.32,"end":7495.57,"speaker":"Fr Stephen De Young","text":"There are kids who listen to this show, man. What's next, Santa Claus? Tooth Fairy? Who are you after next? John said Santa Claus is real. You are a thief of joy."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7495.57,"end":7496.21,"speaker":"Fr Andrew Stephen Damick","text":"I am."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7498.69,"end":7499.09,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7499.25,"end":7509.65,"speaker":"Fr Andrew Stephen Damick","text":"All right, but, yeah, what does all that have to do with the bodily resurrection, which probably to some people sound like a non sequitur."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7510.53,"end":7515.56,"speaker":"Fr Stephen De Young","text":"Yeah. It's not like we ramble or digress on this show. I mean, obviously, it must be pertinent."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7515.71,"end":7516.51,"speaker":"Fr Andrew Stephen Damick","text":"Not even a little bit."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7519.39,"end":7532.67,"speaker":"Fr Stephen De Young","text":"No. I mean, I think right off the bat, even though some people might say, okay, well, the bodily resurrection and the Last Judgment, those are different topics. Like, if they're thinking about systematic theology and theological topics and subheadings."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7532.67,"end":7532.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7535.23,"end":7579.17,"speaker":"Fr Stephen De Young","text":"I mean, obviously, from any Christian perspective, the resurrection of the body and the final judgment are linked, at least sort of temporally. Right. Like, these are things that go together, they happen together. Right. But what we're going to talk about here, we're not talking about the bodily resurrection per se. We talked about that in previous episode. But we're talking about why those two things are linked and how those two things, the bodily resurrection and the Last Judgment, the final judgment, the final setting. Right. Of the world by God. Right. Restoration of justice by God. How those two things go together."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7579.89,"end":7580.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7581.09,"end":7624.01,"speaker":"Fr Stephen De Young","text":"And ultimately spoilers for this third half. How they not only go together, but they're inseparable. So we have to start by talking about sort of the origins. Right. We talked about ideas arising. Whence does the concept of the bodily resurrection arise? So if folks know anything about the Pharisees and the Sadducees who show up in the New Testament, if you know one thing about Pharisees and Sadducees, it's that the Pharisees believed in the bodily resurrection and the Sadducees did not."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7624.41,"end":7627.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's kind of the thing people know."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7627.93,"end":7631.21,"speaker":"Fr Stephen De Young","text":"Yes. And then the corny joke is that's why they were sad. You see."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7631.45,"end":7637.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. I know, I know. I grew up with that joke. I did. I grew up with that joke."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7638.65,"end":7643.69,"speaker":"Fr Stephen De Young","text":"You should never joke about the Pharisees or the Sadducees. I got a very angry phone call about this once."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7645.98,"end":7647.58,"speaker":"Fr Andrew Stephen Damick","text":"From a Pharisee or Sadducee."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7647.9,"end":7654.46,"speaker":"Fr Stephen De Young","text":"Not joking. That is not a joke. I really did get a phone call excoriating me for joking about the Pharisees and the Sadducees."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7654.46,"end":7654.86,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7658.86,"end":7675.56,"speaker":"Fr Stephen De Young","text":"From a Southern gentleman who was very upset. And so this is true. This is not. The one thing you thought you knew about Pharisees and Sadducees is wrong. The one thing you know about Pharisees and Sadducees is Right. That is correct."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7675.56,"end":7676.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7676.72,"end":7750.68,"speaker":"Fr Stephen De Young","text":"Right. Now, it may not be for the reason you think. Right. Because if there's two things people know about the Pharisees and the Sadducees, then the second thing they know is that the Sadducees only considered the Torah, the Pentateuch, the five books of Moses only considered that to be canonical and nothing else. Whereas the Pharisees had like the larger Hebrew Bible. Right. That included the prophets and depending on when we're talking about in history, a bunch of the writings. Right. Those were formed over time. Right. And even in the first century, there were still debates about, like, Esther and Ecclesiastes and some of those. But. And so because that's the second thing people know, people tend to assume that the second thing they know and the first thing they know are directly related. And this happens through a kind of anachronistic belief that 1st century Jewish folks believed in sola scriptura."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7752.45,"end":7752.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7754.05,"end":7988.55,"speaker":"Fr Stephen De Young","text":"And therefore well, since the bodily resurrection isn't clearly described in the Torah itself, therefore the Sadducees didn't believe in it because it wasn't in their Bible, whereas the Pharisees had the bigger Bible. And so it was in there, so they believed in it. Right. And that's wildly anachronistic because first of all, didn't nobody have a Bible? What's a Bible in the sense that we use it? Right. Yeah. So these are separate scrolls and stuff. Right. This is a question of the relative authority of books. Right. But also, the Pharisees and the Sadducees actually agreed that the Torah was in a class by itself. The Pharisees did not. And their descendants in Rabbinical Judaism do not put the other texts in the Hebrew Scriptures. Right. The Navi' im and the Ketuvim, the prophets and the writings do not put them on the same level as the Torah. So that's not the real source of disagreement there about the text. Both of them agreed. Right. The issue was primarily a liturgical issue in that the way this functionally happened. We've talked before about how, even in Christian terms, what makes something canonical is that it's read publicly in the gathering, and this is derived from this with the Pharisees and the Sadducees. The Pharisees had a reading from these other texts in addition to the Torah reading in the structure of the synagogue service. Right. Which to the Sadducees looked like they were putting them on par with the Torah. Right. The Pharisees insisted otherwise. And they didn't just insist otherwise in arguments. This is played out in the synagogue service. Right. There's the procession with the Torah scroll. There's. Right. The Torah reading is treated differently than the other readings. Right. And by the way, the same is true for Christians in the New Testament. This is how anachronistic that kind of sola scriptura view is. And you can see this in an Orthodox Church today, right? We make a procession with the Gospel book. The Gospel reading is only done by clergy. The Epistle reading can be done by lay people. In some situations, the epistle reading can be done by people who aren't even Orthodox Christians, let alone clergy. Everyone stands for the Gospel reading. People can sit for the epistle reading. So even this is something we've actually kept from Judaism is the idea of preeminence within the canon. And this is not a rabbit trail I will go down here. But that also, that idea of preeminence within the canon, if you don't understand that it's going to make it really hard for you to understand what's going on in the Orthodox Church when we talk about the preeminence of Scripture within tradition and how that cashes out."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7988.71,"end":7989.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":7993.59,"end":8121.94,"speaker":"Fr Stephen De Young","text":"So. Right. But. So that's. This is a. This is a liturgical primarily dispute. Canon disputes were always liturgical disputes in the ancient church and in ancient Judaism. So that's not why didn't believe in it and the Pharisees did. It is true. It is true that the places where we explicitly see the bodily resurrection discussed in the Hebrew Bible are from later texts, texts later than the Torah. Right. Written after the Torah. So that much is true. That much is true. But for the Pharisees, the bodily resurrection is not so much derived from these places where it's mentioned in these other texts, as these other texts are reflecting the belief in the bodily resurrection that developed because the bodily resurrection. Right. This idea. This idea of the bodily resurrection emerged from and played a particular role within the understanding of God's justice, which is why we're talking about it now and why it's critically important to understanding the Last Judgment, the final establishment of justice. So we're going to read one of these texts. It's a little long. You'll live, but this is from Job, and this is one of the clearest texts. And then we'll have a couple of other shorter texts from the Old Testament, from the Hebrew Bible that talk very specifically, very clearly, unambiguously, about the bodily resurrection. These three texts we're going to read from the Hebrew Bible are actually probably clearer in terms of the physical bodily resurrection than a lot of the texts in the New Testament are."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8122.22,"end":8122.54,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8123.5,"end":8125.1,"speaker":"Fr Stephen De Young","text":"Right. Like, that's how clear it is."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8126.22,"end":8258.46,"speaker":"Fr Andrew Stephen Damick","text":"All right. Job, chapter 19, verses 1 through 27. Then Job answered and said, how long will you torment me and break me in pieces with words? These 10 times you have cast reproach upon me. Are you not ashamed to wrong me? And even if it be true that I have erred, my error remains with myself. If indeed you magnify yourselves against me and make my disgrace an argument against me, know then that God has put me in the wrong and closed his net about me. Behold, I cry out violence, but I am not answered. I call for help, but there is no justice. He has walled up my way so that I cannot pass. And he has set darkness upon my paths. He has stripped from me my glory and taken the crown from my head. He breaks me down on every side and I am gone. And my hope has he pulled up like a tree. He has kindled his wrath against me and counts me as his adversary. His troops come on. Together they have cast up their siege ramp against me and encamp around my tent. He has put my brothers far from me, and those who knew me are wholly estranged from me. My relatives have failed me. My close friends have forgotten me. The guests in my house and my maidservants count me as a stranger. I have become a foreigner in their eyes. I call to my servant, but he gives me no answer. I must plead with him with my mouth for mercy. My breath is strange to my wife, and I am a stench to the children of my own mother. Even young children despise me. When I rise, they talk against me. All my intimate friends abhor me, and those whom I loved have turned against me. My bones stick to my skin and to my flesh, and I have escaped by the skin of my teeth. Have mercy on me. Have mercy on me, O you my friends. For the hand of God has touched me. Why do you, like God, pursue me? Why are you not satisfied with my flesh? O, that my words were written. O that they were inscribed in a book. Oh, that with an iron pen and lead, they were engraved in the rock forever. For I know that my Redeemer lives, and at the last he will stand upon the earth. And after my skin has been thus destroyed, yet in my flesh I shall see God, whom I shall see for myself and my eyes shall behold and not another besides me. My heart faints within me."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8261.59,"end":8267.99,"speaker":"Fr Stephen De Young","text":"Right. So you may say, why did we read all that? Since the stuff about the bodily resurrection is right there at the end."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8268.71,"end":8269.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8269.75,"end":8279.11,"speaker":"Fr Stephen De Young","text":"Because it's important to see how it's framed. Right. So I don't know of a more clear statement than after my skin has been thus destroyed, yet in my flesh I shall see God."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8279.59,"end":8280.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, in my flesh."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8280.83,"end":8283.83,"speaker":"Fr Stephen De Young","text":"I mean, it's I and not another. Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8284.07,"end":8284.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8287.04,"end":8443.86,"speaker":"Fr Stephen De Young","text":"So this is right. I know there'll be some people who will point out, right. Well, like the Greek tradition identifies Job as being the grandson of Esau, which is true. And they'll say, well, this takes place the patriarchal period. This is true. It was not written before the Torah. Job didn't write it. Text doesn't say Job wrote it. And I don't care if a study Bible note says Job wrote it, he didn't write it. I don't know where the study Bible note is even getting that. So you can look at it in Hebrew. It was written after the Torah. And also, now that that has ticked a certain group of people Off. Let me tick off another group of people. That really clear statement of the bodily resurrection. We just read the Greek butchers it. The Greek absolutely butchers. It like, changes verb tenses and stuff. And there's no way to determine why we don't know who translated Greek Job. Because again, as I know we've mentioned on the show before the Septuagint, the work of the 70 rabbis was a translation of the Torah, of the Pentateuch. They didn't translate Job. The letter to Aristeas does not say they translated Job. None of the church fathers say they translated Job. So we don't know who translated it. Maybe it was a Sadducee and he was deliberately fiddling with it. Right. Who knows? But, yeah, it gets made hash in Greek. In the Hebrew, it's very clearly talking about the bodily resurrection. It's very clearly talking about the fact that God will stand upon the earth on the last day in verse 25 in the Hebrew, not so clear in the Greek. Right. That may be another reason why it got fiddled with. So, yeah, I hate to break it to people, but not all of the differences between the Greek and the Masoretic text make the Greek more Christian. There's a few that make it less Christian. So now that I've alienated a whole other group of people. Sorry, it's just true. The point of reading all that is right in the setting. Job is here responding to one of his quote unquote friends."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8445.09,"end":8447.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8447.05,"end":8454.77,"speaker":"Fr Stephen De Young","text":"Who have been hitting him with the. No, God wouldn't be doing this to you unless you were a sinner. Repent of your wickedness, you wicked man."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8454.77,"end":8466.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Which, you know, to use our language from the first half, they are mistaking pruning for, you know, the whole wheat and tares being cut off. Yeah, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8469.73,"end":8535.93,"speaker":"Fr Stephen De Young","text":"So, right. And so this is the. And so he's saying, look. No. And so his expression here of the bodily resurrection, Right. Is Job saying. What he's saying here is, even if I don't get justice in this life, even if my righteousness is not vindicated in this life, right. I know that the day will come when I will stand in my body. Me, not somebody else, not my descendant, whatever, but me, I will stand before God. Right? And on that day, I will have my justice. I will have my vindication. That's what he's saying here. Because I'm a righteous man and I have suffered horribly, but I know that ultimately God will bring forth justice, even if it's someday long after I'm dead. He will bring me back to life and I'll stand before him and he will give justice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8535.93,"end":8536.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8537.69,"end":8560.49,"speaker":"Fr Stephen De Young","text":"And so all that framing and all that reading was that we have to get this dynamic. This is what the bodily resurrection is about. The bodily resurrection is about justice. Because in this world, a whole lot of righteous people go to their death in suffering, in misery. Right. Exhibit A. Martyrs."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8561.26,"end":8561.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8562.38,"end":8609.65,"speaker":"Fr Stephen De Young","text":"Right. Die a horrible death. Sometimes they die young. Right. And on the other side, in this world, there are wicked people who seem to prosper their whole lives and go to their deaths and leave all their wealth to their children. And we can look at that not out of resentment or envy or jealousy. We can look at that based on what God has told us in the scriptures and say that is unjust. That is not the way God created things to be. Right. And so there are folks out there who look at that and say, that's not how the Bible says God created things to be. Therefore God must not exist."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8610.85,"end":8613.98,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8613.98,"end":8615.9,"speaker":"Fr Stephen De Young","text":"But that's not the route Job takes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8617.82,"end":8618.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8618.62,"end":8665.57,"speaker":"Fr Stephen De Young","text":"That's not the route the saints take. The route the saints take is, therefore God will bring justice to this in the future when that final justice happens. Right. When the last judgment happens and justice is finally established, then there will be justice for this. And that requires that all of us, the righteous, the wicked, everybody, that we're all alive again in our bodies. It's us, not somebody else standing on this earth in front of him to receive that justice one way or the other. So you see this again, another place where the bodily resurrection is very clearly discussed is in Isaiah, and it's framed in a similar context."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8666.22,"end":8725.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So Isaiah, chapter 26, verses 16 through 21. O Lord, in distress they sought you. They poured out a whispered prayer when your discipline was upon them. Like a pregnant woman who writhes and cries out in her pangs when she is near to giving birth. So were we because of you, O Lord. We were pregnant. We writhed, but we have given birth to wind. We have accomplished no deliverance in the earth. And the inhabitants of the world have not fallen. Your dead shall live. Their bodies shall rise. You who dwell in the dust, awake and sing for joy, for your dew is a dew of light. And the earth will give birth to the dead. Come, my people, enter your chambers and shut your doors behind you. Hide yourselves for a little while until the fury has passed by. For behold, the Lord is coming out from his place to punish the inhabitants of the earth for their iniquity. And the earth will disclose the blood shed on it. And Will no more cover its slain."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8729.24,"end":8733.4,"speaker":"Fr Stephen De Young","text":"So, yeah, you don't get much clearer than your dead shall live, their bodies shall rise."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8733.72,"end":8736.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Again, explicitly about the bodies."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8737.4,"end":8772.45,"speaker":"Fr Stephen De Young","text":"And the earth will give birth to the dead. Right. This is as clear as it gets. Right. At least as clear as any statement in the New Testament. But notice the framework. Right. Especially that last verse. The earth is going to disclose the blood shed on it and no longer cover the slain. Think of Cain and Abel, the blood of the martyrs that cries out from the ground to God for justice. So here, what is the purpose of the dead being returned to life? Justice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8773.29,"end":8773.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8773.45,"end":8779.05,"speaker":"Fr Stephen De Young","text":"This is a little more negative than Job's. Job's was in a positive sense. Right. That Job would be vindicated."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8780.09,"end":8780.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8781.05,"end":8820.79,"speaker":"Fr Stephen De Young","text":"This is kind of in a negative sense. These evildoers, these wicked who have shed this blood will face the consequences of their actions. But that also implies the vindication of Israel. That's who's being talked about here. Right. The other nations have done evil and have oppressed Israel. Right. And killed up to and including killing Israelites. Right. And the people of Judah. And there's going to be justice for that. Israel is going to be vindicated over against them. Same kind of context for the bodily resurrection. And another one, we'll do a third one, because as Aristotle said, everything that comes in threes is perfect."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8820.87,"end":8825.51,"speaker":"Fr Andrew Stephen Damick","text":"There we go. That's why there's three halves to this show."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8826.23,"end":8826.71,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8827.59,"end":8869.41,"speaker":"Fr Andrew Stephen Damick","text":"Finally. Finally, we revealed it after almost three years. So Daniel 12:1. 3. At that time shall arise Michael, the great prince, who has charge of your people. And there shall be a time of trouble, such as never has been since there was a nation till that time. But at that time your people shall be delivered. Everyone whose name shall be found written in the book. And many of those who sleep in the dust of the earth shall awake, some to everlasting life and some to shame and everlasting contempt. And those who are wise shall shine like the brightness of the sky above. And those who turn many to righteousness like the stars, forever and ever."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8872.13,"end":8878.93,"speaker":"Fr Stephen De Young","text":"Yes. So notice there we again have those who sleep in the dust of the earth shall awake."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8879.89,"end":8880.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8882.23,"end":8886.87,"speaker":"Fr Stephen De Young","text":"Some to life, some to. Some to everlasting life, some to everlasting contempt. Same adjective."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8886.95,"end":8891.59,"speaker":"Fr Andrew Stephen Damick","text":"I mean, which is almost exactly what Jesus says in."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8891.67,"end":8892.15,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8892.23,"end":8892.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8893.59,"end":8902.07,"speaker":"Fr Stephen De Young","text":"Right. But then notice also notice also that verse three, which is one of the classic descriptions of theosis."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8902.47,"end":8903.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8903.51,"end":8906.31,"speaker":"Fr Stephen De Young","text":"That the righteous will shine like the stars of heaven."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8908.18,"end":8908.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8909.06,"end":8918.58,"speaker":"Fr Stephen De Young","text":"This idea of Theosis, of stars placing the angels who fell. Right. That whole idea of Theosis is not in any way opposed to the bodily resurrection."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8919.06,"end":8920.34,"speaker":"Fr Andrew Stephen Damick","text":"No, yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8922.5,"end":8989.8,"speaker":"Fr Stephen De Young","text":"Right. Like these are right after each other. These go together. Right? They go together just fine. But again, here, the resurrection of the dead is related to the Last Judgment. It's part and parcel of it. So the idea of the bodily resurrection arises from people having come to know God, having come to know what justice is by being taught by God what justice is. And so this idea of the bodily resurrection naturally arises, and that's why we see it start showing up in these later texts. God, right, created us, right. And he created us. Not as floating spheres, sorry, origin, but he created us. He created us with material bodies. Right? He created and we are part of his creation in our material bodies."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8990.12,"end":8990.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":8990.52,"end":9096.59,"speaker":"Fr Stephen De Young","text":"And so restoring that creation, transfiguring and transforming that creation, requires us being put back into the proper set of ordered relationships within ourselves, with each other, with the rest of the creation. Hence bodily resurrection for justice to be restored. This also, though, is important because the bodily resurrection, another key element here and the text in Job, another reason why we read the whole thing, really gets at this when he says I and not another. Right. Because there's a lot of ways in which God's justice is spoken of by people who don't necessarily believe in the bodily resurrection. And I don't know how much people have heard these, because I know we all have siloed listening and viewing. So I don't know how many people have heard these kinds of things. But the idea that the arc of history bends toward justice, that's actually a quote from somebody you've heard of. But that's the arc of history bends toward justice. That's actually Martin Luther King Jr. That justice is sort of this overarching on the whole kind of thing. Right. So there may not be any justice for. Hey, let's just stay where we were. So the people who Dr. Martin Luther King Jr. Said that to. Right. They may not receive justice for their suffering, but ultimately in the future, their descendants will live in a more just world."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9096.67,"end":9115.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I just looked this up, by the way, and the more exact quote is, he says the arc of the moral universe is long, but it bends towards justice. So, yeah, it's just exactly what you're saying, that things are not great now, but ultimately it's headed in a better direction."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9116.04,"end":9261.91,"speaker":"Fr Stephen De Young","text":"Right, right. But those people are not going to. Those individual human persons who are standing there listening to him might go to their deaths in suffering and never experience any justice. Right. And so people will talk about justice being or Even from folks who at least tacitly believe in the bodily resurrection. Because it wouldn't be an episode of Lord of Spirits without at least one sorry Calvinist, you know, that in eternity. Right. In the age to come, we'll look back at history and we'll see how everything was perfectly. Just like retrospectively that we'll see that nothing needs to get fixed because everything that happened was perfectly, just not that things will be fixed in the future. You know, this kind of view that justice is a thing about the whole. Right. But what we see in Job is that that's not the kind of justice we're talking about when we're talking about the bodily resurrection. Right. Job is emphasizing no, him, Job, he needed to be vindicated, not his descendants. Right. Not like, you know, after Job was dead, his friends would be like, yeah, Job was right and we were wrong and finally admit it. Put a little plaque on his grave admitting they were wrong. Right. That's not what we're talking about. Right. It's not even that Job would be a saint in heaven. It's not even. Right. Someone would make icons or statues of Job or something. Right. And that's some kind of vindication. Right. Job is clear that just as he has personally in his body experience this suffering, he is also going to personally in his body, receive vindication and justice for what he's been through. So God's justice is for each person."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9262.39,"end":9262.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9263.03,"end":9311.66,"speaker":"Fr Stephen De Young","text":"Not just for the sweep of history. Right. So this idea of resurrection, bodily resurrection as justice. Right. As part and parcel of the final judgment, the final establishment of justice, forms the basis for how the apostles. It's not the entirety, but it forms the basis for how the apostles start to understand the resurrection of Christ. And that is really clear when we read the New Testament closely, that there's an idea here that Christ is being vindicated."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9312.14,"end":9320.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, some of those early apostolic sermons, you know, this Jesus whom you crucified, God has raised from the dead and made Lord in Christ."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9321.18,"end":9326.14,"speaker":"Fr Stephen De Young","text":"Right. The righteous one. The righteous one. St. Peter says at one point who you crucified."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9326.46,"end":9331.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That he was righteous and you gave him injustice. And God has given him justice."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9331.98,"end":9448.8,"speaker":"Fr Stephen De Young","text":"Right. God has vindicated him by raising him from the dead. Right. And so there is this language of justice and justification linked for this reason with resurrection, with bodily resurrection in the New Testament. And people have gotten confused by this, especially for the past few hundred years, into taking that language, which is Pharisaic language, this is the language of Pharisaic Judaism regarding the bodily Resurrection. Right. Taking that language related to justice and justification and resurrection and turning and morphing that into what ultimately become, treating it as judicial language and judicial language particularly related to retributive justice, criminal justice. And this culminates in the reformed idea of penal substitutionary atonement. But this is a fundamental misreading of the pharisaic language that St. Paul is using, for example, when he talks about Christ's death and resurrection. Because St. Paul is, remember, a Pharisee. He refers to himself as a Pharisee in the present tense in his letters. Right. So this undergirds his thinking. Right. And so to give an example of this, to give an example of what I'm talking about, we're going right for it. We're going to Second Corinthians 5, 21."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9449.6,"end":9450.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9450.96,"end":9463.46,"speaker":"Fr Stephen De Young","text":"Right. This is. If you ever have someone throw you a proof text about penal substitutionary atonement, there's about a 33 and a third percent chance it's this one."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9467.22,"end":9467.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9467.7,"end":9471.3,"speaker":"Fr Stephen De Young","text":"And I'm not doing Scott Steiner math. This is just regular math. Go ahead."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9471.86,"end":9482.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so 2 Corinthians 5, 21, which this is. I mean, even if you don't have like a big ideological horse in this race, this is a hard verse to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9482.06,"end":9482.34,"speaker":"Announcer","text":"Understand."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9484.18,"end":9499.62,"speaker":"Fr Andrew Stephen Damick","text":"Especially the way it gets translated in English. For our sake, he made him to be sin, who knew no sin, so that in him we might become the righteousness of God. So the hymn, of course, is Jesus."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9500.5,"end":9500.98,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9502.26,"end":9504.78,"speaker":"Fr Andrew Stephen Damick","text":"He made Jesus to be sin, so."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9504.78,"end":9597.52,"speaker":"Fr Stephen De Young","text":"He would be God the Father. Him would be Christ. Right, yeah. So, yeah. So this, of course, yeah. Gets puzzled over. Right. Typically in Protestant and especially Reformed contexts. Right. Which is why this sometimes gets used as a proof text for penal substitution. This idea that as it's translated usually in English, that God made Christ to be sin is understood to mean that refer to all of our sins being sort of put on Christ and then punished there. Right. Which I think even those folks have to admit is reading a bit in even to this English translation. Right. But here's the real problem. And hey guys, here comes our second patristic citation for the episode on the most non patristic orthodox show on the St. Cyril of Alexandria is helpful here if you didn't already know this. Right. Because to kind of figure out what's going on with this verse, you kind of need to know Hebrew. But if you don't know any Hebrew, Saint Cyril can help you out here."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9598.08,"end":9598.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9599.6,"end":9638.65,"speaker":"Fr Stephen De Young","text":"Because Saint Cyril of Alexandria points out that what this means, what it says, he made him to be sin is he says it means he made him to be a sin offering. So if you don't know any Hebrew, you might look at that and be like, where's St. Cyril getting that? But if you know at least a little Hebrew, then you know that in the Torah the word for sin offering is just the word for sin. It's the same word. So if you translated woodenly literally."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9640.66,"end":9640.82,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9640.82,"end":9654.82,"speaker":"Fr Stephen De Young","text":"Stuff about the sin offerings in Leviticus, it would say, you know, he will offer a ram as a sin to the Lord, right? Now that makes no sense in English would be like, he offers the ram as a sin."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9655.22,"end":9656.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9656.42,"end":9689.31,"speaker":"Fr Stephen De Young","text":"Wait, what? I thought he was supposed to do this. Right? And that's why we put in the word offering, because it doesn't make sense otherwise. That's the sense of it, right? Well, the same thing is true here, but New Testament scholars and Bible translators aren't Old Testament scholars and Bible translators, so they don't talk. So that's what St. Cyril's pointing out here is that St. Paul is just using the common convention of using that word to mean a sin offering."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9691.72,"end":9691.92,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9691.92,"end":9764.15,"speaker":"Fr Stephen De Young","text":"Because St. Paul was Jewish. So what this is saying is that God made Christ even though he knew no sin, even though he was sinless, he made him to be a sin offering. It's not even even though because he was sinless, God made him to be a sin offering so that in him we might become the righteousness of God. So what is this referring to when St. Paul refers to Christ's death every time, right? He's not just referring to his death in general, he's always referring to his crucifixion. Remember, I preached nothing but Christ and him crucified, right? Right. Crucifixion. Crucifixion, the cross, right? Crucifixion. We've been crucified with Christ, not just we died with Christ and we've been crucified with Christ. Tibal emphasizes this over and over again. Because the way Christ died is not irrelevant, right? Crucifixion is the death of a condemned criminal. It is a mode of death that is under a curse. According to the Torah, cursed is everything that hangs on a tree."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9766.47,"end":9766.87,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9768.47,"end":9784.06,"speaker":"Fr Stephen De Young","text":"And so Christ is dying the death of a criminal, Even though, as St. Paul is pointing out here, he knew no sin, he committed no sin. Think about in the Gospels, the thieves."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9786.14,"end":9786.54,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9787.26,"end":9796.39,"speaker":"Fr Stephen De Young","text":"What does the wise thief Saint Dismas say? We are suffering the same fate he is, and we justly. There's that justice word."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9798.23,"end":9798.63,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":9798.63,"end":10023.32,"speaker":"Fr Stephen De Young","text":"They were being executed for Their crimes, they were dying for their own sins, right? They were dying because as a result of their crimes, Christ was not. And therefore because Christ's death was unjust, because he was sinless, but was dying as a condemned person. St. Paul is saying God could receive it as a sin offering, could receive his life, could receive Christ's offering of his life as a sin offering. And this is grounded in the theology of martyrdom that had developed within Judaism up to this point, right? We see an example of this in Second Maccabees. Second Maccabees is the Maccabean martyrs are going to their death, right? I believe it is actually Eliezer who prays and explicitly asks God that he would receive their deaths, right? They're being murdered by the Seleucids, by the Greeks, the Greek pagan oppressors are murdering them for their refusal to violate the Torah, their refusal to violate God's law. They're being murdered. And I believe it's Eliezer who prays out of them that their deaths would be received by God as sin offerings for the people because they were being killed for righteousness sake, but the people had committed sins and needed a sin offering. This is not to say that Christ's death is the same thing, right? Obviously I'm a Christian, but Christ's death is that pattern, that already established pattern within the Scriptures. Christ is the sin qua non. Because Christ is not just a righteous Israelite. Jesus of Nazareth is not just a righteous Israelite. Jesus of Nazareth is the Messiah. Jesus of Nazareth is the Word of God, second Person of the Holy Trinity, right? Jesus is God, and therefore his self offering is the ultimate, the sin qua non, the fulfillment, the filling to overflowing of that pattern, right? But that pattern exists and that pattern is in the Scriptures before Christ's death for this reason, to enable the understanding of what Christ is doing. And St. Paul is interpreting this for us because he has this Pharisaic understanding of the bodily resurrection. So Christ is the sine qua non of this. He's received as a sin offering. And then his resurrection is the demonstration of his righteousness, is his vindication as the righteous one, as the just one. He rises from the dead because of that. And if you go back a few verses from 2 Corinthians 5, 21 and see the context in which St. Paul makes this point, verses 14 and 15, he says, for the love of Christ controls us, because we have concluded this that one has died for all, therefore all have died, and he died for all. That those who Live might no longer live for themselves, but for him who for their sake died and was raised."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10026.44,"end":10026.84,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10029.64,"end":10083.3,"speaker":"Fr Stephen De Young","text":"Those who follow Christ, and he's going to get more specific about this in some other places that we're about to talk about, but have died and risen with him, and that having died and risen with him, they now live not for themselves, but for Christ's sake, they now live faithfully. Faithfully to Christ. Right. This is what's meant by becoming the righteousness of God. Right. They might become righteous. Verse 17. Right. Again, in the same context, this is where St. Paul says, Therefore if anyone is in Christ, he is a new creation. The old has passed away, behold, the new has come."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10084.77,"end":10085.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10085.89,"end":10092.13,"speaker":"Fr Stephen De Young","text":"What is new creation put in order? Again, that's what creating is, remember?"}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10092.21,"end":10094.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10094.45,"end":10163.27,"speaker":"Fr Stephen De Young","text":"It's not that, right. The person we were like, we literally crumbled into dust and we're literally resurrected. That'll happen later. Right. But we haven't put it back in order. We are already a new creation, reordered, justified. Right. And it's for this reason, right, I'm sure most of you, when we're reading, that this idea of us dying with Christ and rising with Christ, becoming a new creation, this of course is associated by St. Paul with baptism. Right. Directly associated with baptism, that we die with Christ in baptism, we rise out of the water, right. Out of the waters of chaos. Right. A new creation, justified, sanctified, washed, as we say in the orthodox baptismal service. And as a new creation put back in order. And so this is why in Romans 4:25, St. Paul can say that Christ was delivered for our trespasses and raised for our justification. Notice raised for our justification."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10163.27,"end":10167.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The resurrection is towards our being made righteous."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10168.15,"end":10206.33,"speaker":"Fr Stephen De Young","text":"Yes, yes. Being put back in order, being justified. Yeah. As a new creation. And this isn't just. Right. So that's taking a key text from St. Paul and showing this. Right. But this is everywhere in sort of the Ur layer of the apostolic preaching. So the earliest we'll read one of these and then give you references for some more. Right. These early sermons by St. Peter in the book of Acts, in the Acts of the Apostles. But a good example of this is in Acts chapter two."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10206.97,"end":10240.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Where he says God raised him up, referring to Jesus loosing the pangs of death, because it was not possible for him to be held by it. For David says concerning him, I saw the Lord always before me, for he is at my right hand, that I may not be shaken, therefore my heart was glad and my tongue rejoiced. My flesh also will dwell in hope. For you will not abandon my soul to Hades or let your Holy One see corruption. You have made known to me the paths of life. You will make me full of gladness with your presence."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10244.37,"end":10496.23,"speaker":"Fr Stephen De Young","text":"So why was Christ raised according to this quotation that St. Peter uses? Because he was righteous. Because he was holy, therefore he could not remain in the grave. Hades had no claim on him, and so he's raised and vindicated. And you could check out Acts 3, 14, 15, Acts 4, Verses 10 and 11, Acts 5, 30 and 31 over and over again, right? Christ is righteous. You crucified him. You executed him as a criminal. God raised him up and vindicated him. So we can say that any Christian who's been baptized, right, as we say in the orthodox baptismal service, has been justified, right? We could say that they're already resurrected in one baptismal sense, right? In the baptismal sense, they're already. Because they've already died to sin. They've already been made alive in Christ. But in another sense, we as Christians are awaiting our final vindication, which will come at the bodily resurrection and will come at the last judgment. So if we live in this world, with all of its suffering, with all of its difficulty, a life here in this world that inevitably for every one of us, ends in physical death, right? If we live that faithfully, if we live that righteously, if we live that justly, which we can only do, as we said, through the works of God and through repentance, you don't become righteous by never sinning. You become righteous by repenting when you sin. If we live our life in that way, then when we stand before the dread judgment seat of Christ, right, that will be the moment of our vindication. And if we don't live in that way, there is the potential for that to end up being our condemnation. Because that sense in baptism in which we're resurrected, that sense in which we're justified in baptism is not inalienable. God can begin the work of this is inverting one of St. Paul's examples. But God can begin the work of putting us back in order, and we can abandon that work and go back to disorder and chaos and destroy what he's been trying to build. St. Paul uses the opposite example. He talks about if I rebuild what I once tore down, like tearing down the edifice of sin, and then he goes back and rebuilds it. But it's the same purpose. We can move away from that. So it's not you get baptized. Hey, you're justified. You're in. That's it. Resurrected. Just wait. You'll be vindicated. Right? And we've been told that we've seen over and over again pretty much every quote we've read from the New Testament tonight has said that, has said, because this is true, therefore, now you need to live a life pleasing to God. Because this is true. You need to live not for yourself, but for Christ. Because this is true, you need to walk before God and be righteous. But it is true. But because it is true, now there is something we need to do. Not just we need to believe really hard that it's true, but there's something we need to do."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":10503.27,"end":11116.96,"speaker":"Fr Andrew Stephen Damick","text":"Well, as we wrap up this episode of the Lord of Spirits podcast, I'm not going to play the jingle, but I wanted to do a little etymology. It would seem weird to play the jingle here at the end, but yeah, the word doom titled this episode Doomsday in English. You know, we tend to think of doom as. I mean, this is the way it's used in the modern sense now, typically is that doom means a bad outcome. You know, you're doomed, right? Which is. It's kind of funny, we can even put it that way. You're doomed, right? You know, something terrible is going to happen to you. But the older sense of doomsday was a synonym for Judgment Day. In fact, it's the older English word. And one of the first places that this word comes up, or probably one of the most well known early instances, is of a book that was called the Doomsday Book, although usually spelled D O M E S D A Y Dommesday, because that's the sort of the early Middle English spelling of it. And so the Domesday Book, or Doomsday Book, was a late 11th century book that was created at the behest of. Well, he's known to history usually as William the Conqueror, but various other epithets were attached to him. But he's the Norman that conquers England, and so he orders that this book be made. And the book actually is a kind of survey of property in England. And part of the point of it was to make sure that all the taxes that he felt that he was owed were paid to him. But the point of calling it that was, although it was not called that when it was made, that was later a name attached to it a little bit later, maybe a century or so later. And one of the reasons that it was called that was it was said that it was as unchangeable as Judgment Day. Right. So it was a kind of analogy, but it was really about taking a trip, a number of people taking a trip around England and judging what the lands were just assessing. It was sort of a big assessment, right? And this gives us that earlier sense of doom. We still have the related verb deem, which usually when we say deem, we don't mean something, some negative outcome. Right. I could just say I deem that to be true, which is I judge it to be true. I perceive it to be true. So doom was simply a judgment or a pronouncement, a fate, maybe, as it were. And of course, the word actually has a much older history. It comes from our Old English heritage and then proto Germanic and then all the way back to Indo European, proto Indo European. And in that Proto Indo European root, it means to place or to put something somewhere. And so it has this sense of order, of putting things in order. And then when it gets into the early Germanic usage, it starts at that point to be used as judgment, to perceive, to assess, to see things as they are, to make a decision based on that. And this doesn't disappear like you get. Eventually you get the word kingdom. And that dom on the end refers to the area or the sphere of influence of the king, the sphere in which he is the one who renders judgment, in which he is the one who's putting things in their proper order. Right? And so, like I said, we think of this word doom as meaning misfortune and doomsday, the end of the world, lots of bad things happening. But the history of the English word really keeps within it all of these biblical senses that we've been talking about. That judgment is God putting things in their proper order, perceiving that they're out of order and putting them in their proper order. And also judgment is that sphere of influence. You know, his kingdom is truly a kingdom. It has that sphere of influence, his rule, his ordering, right? And our task as living within the kingdom of God, it's not, you know, some other kind of community. It's God's kingdom is to participate in that doom, the doom of God to do it as well. To also be deeming, to also be placing things in their proper order, number one, ourselves. We do that through repentance. There's a famous saying, I think, from Mount Athos, you know, if you die before you die, then when you die, you don't have to die, which means put yourself in proper order in this life, so that when you depart this life, when you move in the life of the age to come, then God doesn't have to do it to you. It will have already been done with his help here in this life through repentance. And so you may notice, you know, even though we, we started out talking about the end of the world, where we ultimately ended up was the resurrection. And that's because when we think about doomsday, when we think about Judgment Day, as Christians, we shouldn't merely fear and tremble. Although, I mean, that's useful. Like our hymns for the Sunday of the Last Judgment are often focused on that and have always been right. This is something that humanity needs. It needs that kind of warning language. I know I do. But that's not the only thing that we should focus on. We should also focus on the sense that justice is coming, that God's justice, God's ordering, God's recreation is coming and is already breaking through. And we can participate in it even now, to put ourselves in order, to put the space around us, in order to have orderly relationships with the people around us. And when I say orderly, I don't just mean, I don't mean formal or regimented or anything like that. I mean that we are living according to God's order, which is an order of love and self sacrifice and humility. That's what it means to have a truly orderly relationship from God's point of view. And the more that we do that, the more that we will become fit for the kingdom of heaven, that we will be living appropriately according to that doom, and also that we will attract other people by God's grace to participate in it as well. Right? And so when we think about doom, when we think about the doom of God and doomsday, we don't have to be afraid of it. We don't have to have some sense of horror in response, but rather it should be about hope. It should be about hope because the summary of this is resurrection. Now there's a resurrection of life and a resurrection of damnation, of condemnation. That's what Jesus says. And of course he's almost quoting the Old Testament, as we heard earlier. And so the call is to live according to the works of God. To live in a way such that when we are judged according to our works, and we will be judged according to our works, not according to our opinions, not according to our beliefs, according to our works, that when we are judged that God will look at us and say, well done, good and faithful servant. Notice he doesn't say well thought or well believed or well agreed with well done. It's about doing. We live in an era in which it's really easy not to do anything. I only relatively recently learned the expression touch grass. Which means, from what I understand, you've been spending way too much time on the Internet. You need to go out and connect with the world, the 3D world. I think that that's something that we especially need to remember in this time and place, this point in history, this culture, that we will be judged according to what we have done. It's very, very easy to try to have all the right beliefs and to be really good at defining them or arguing for them or whatever. And it's good to have the right beliefs. But if we're not doing what will be deemed by God at the end to have been faithful to him, then it doesn't matter what you believe, doesn't matter, doesn't matter what you say. It's what we do that counts in the end. So let's be faithful, let's be doomable in the way that will show us to be among the righteous at the end. Father."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11121.04,"end":11707.6,"speaker":"Fr Stephen De Young","text":"So I know there are like five Whovians out there who are upset that I haven't mentioned the doomsday event going on amongst the licensees, but I'm not into it. I'm sorry. Time Lord Victorious was good, but this one looks kind of lame, but there I mentioned it. So there was a time when you would hear preachers preach about the Last Judgment and sort of the way of life that was seen as being opposed to the Christian way of life was a way of life that is sort of pleasure seeking, right? People just going out and wine, women in song and living this wild life, chasing after the pleasures of the flesh, all this. And that was, you know, you could do that or you know, you could be a good, a good upstanding Christian, right? And then when the Last Judgment comes, right, there's going to be justice for both. And now the way society has gone, I don't think most people could identify with that anymore, right? I don't think those are the two ways of life that people see set before them. In fact, I don't think most people in our current society really see two different ways of life set before them. I think at this point in our society, post Covid now, everything's demonetized, post alienation and isolation and the Internet and everything else. I think we're at the point now where almost everybody is primarily concerned about how they feel. And this isn't some kind of weird, selfish, self centered thing. It's more just everybody is sick and Tired of feeling sick and tired. Everybody's tired of feeling bad. Everybody's tired of feeling hopeless. Everybody's tired of feeling like their day to day life is meaningless. Like I'm gonna, I'm gonna get up every day and do what I do every day the same thing over and over again until one of these days I'll keel over dead and there. And people are just trying to find some way. Happiness may be too much to grasp, but just not feel bad, just feel okay. Just feel like there's some purpose to things or maybe something might get better at some time in the future. I think they people even approach religion that way now. I think a lot of people who are former atheists and stuff coming back to religion, a lot of it is sadly, I mean it's a good result, people coming back to especially Christianity. But a lot of it is desperation. A lot of it is just I need something. I need something that'll make some of this mean something or be worthwhile. And the problem with that, the problem with that and we've gotten there by just being broken down. But the problem is we're just seeking to alleviate suffering. We're just kind of seeking to anesthetize ourselves for a little while. We're just kind of seeking right and escape and not to bring everybody down further. I know I've already brought everybody down, but not to bring everybody down further. But there is no escape. There's suffering and there's trouble in this life. There always has been, there always will be. And it's not always just meaning. It doesn't always make sense. Job's suffering didn't make sense to him. It doesn't always make sense. And we're all going to die eventually, on a long enough timeline. We all end up dead. But so there is something we can do. There's something we could do. There's something we can do that will give meaning, that will give us hope. The hope for vindication, the hope of Christ's return, the hope of judgment. And it's not avoid suffering. It's not anesthetize ourselves from suffering. It's not carve out a few little moments of joy or beauty amidst all the suffering. It's not avoiding death for as long as possible in any way possible. We're going to suffer. Why not suffer for something? We're all going to die. Why not die for something? For someone, for something. For someone who's worth it, for someone or something who means something. We can't avoid the suffering. We can't avoid death. But we can make the suffering we face in this life and we can make our death meaningful. And we do that by how we choose to receive it, what we choose to take away from it, what we choose to learn from it. I mentioned earlier the Maccabean martyrs who are being tortured to death because they wouldn't eat pork. Tortured to death in very graphic ways. If you read Second Maccabees and who prayed to God and said, you know, my death, receive this as a sacrifice on behalf of the people because we've sinned. And so each of us has choices to make as we go through our life in terms of who we're living for and who we're going to die for and what that's going to mean. And we can make choices such as we'll sit at the end of our life, whether it's on our deathbed or whether it's before the judgment seat of Christ and look at our life and say, yeah, that was all just a meaningless, horrible mess. That's entirely possible if we choose to live that way. Or we can live in a way where we look back on it and say, that was hard, that was difficult, that was painful at times, but it was worth it, and here's why. Those things I sacrificed were for something, were for Christ and his kingdom. That suffering, those sacrifices helped get rid of the garbage in my life that was making me so miserable, that I went through, helped this other person help this other person make the next step in their own life. So this is. This is the choice that's before us, right? I can't choose tomorrow whether I'm going to get sick or not. I can't choose whether I'm going to get stuck somewhere. I can't choose whether, you know, I'm going to be in miserable conditions. I can't control whether I'm going to get an unexpected check in the mail or an unexpected bill in the mail. But I can choose what the purpose of all this is going to be. I can choose whether it's going to be meaningful or not. Hopefully, as we think about the Last Judgment, as we think about wanting to be on the side that's going to be vindicated, that takes us back, as we saw over and over again in the New Testament texts that we went over to how we live our life today, how we live our life for Christ and not for ourselves, how we try to live a life pleasing to God, how we try to do the works of God in the world so that ultimately all this stuff that we've gone through and are going through and will go through will all be worth it in the end and not just a horrible way."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11709.36,"end":11729.76,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you very much for listening to this episode. This is our show for today. If you didn't get through to us live during one of our other live shows, you can still. You can still contact us. You can email us at lordofspirits ancient faith.com you can message us at our Facebook page. You can also leave us a voicemail@speakpipe.com."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11730.1,"end":11745.22,"speaker":"Fr Stephen De Young","text":"LordOfSpirits and join us for our live broadcasts. Although this one and the next one will be live on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And I have to say I miss Dming Max because he was going to."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11745.22,"end":11755.14,"speaker":"Fr Andrew Stephen Damick","text":"Give it to us. If you're on Facebook, you can follow our page and join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11756.18,"end":11766.74,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to anxyfaith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. He wasn't going to wait for us to get it on our own, he was going to deliver it to us."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11767.86,"end":11770.81,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you."}
{"episode_id":"LOS - #071 - 2023-07-13 - Doomsday","start":11776.17,"end":11813.38,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders and the and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
