{"episode_id":"LOS - #061 - 2023-02-09 - Babylonian Job","start":0.24,"end":64.9,"speaker":"Unknown","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew, Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #061 - 2023-02-09 - Babylonian Job","start":65.86,"end":1311.97,"speaker":"Fr Stephen De Young","text":"So this week Ancient Faith is not having live shows and as we speak, Father Andrew I believe is somewhere having a burly Swede do that super fast karate chop thing on his back. So I thought rather than leaving our beloved Lord of Spirits audience to go lacking this week I would read another ancient text that folks may not be familiar with. This time I'm going to be reading what's called the Babylonian Theodicy. And what this actually is is an Akkadian text from the Neo Babylonian empire. So we're talking about the middle part of the first millennium B.C. and this is essentially a sort of Babylonian version of the Book of Job. And here's what I mean by that. It's a dialogue between a guy who is suffering misfortune and a friend of his where they go back and forth discussing the relationship between that suffering and the gods, the Babylonian gods. And it's interesting because it is sort of very similar in certain format ways to the Book of Job in the scriptures. And so by sort of comparing the two, you get a very different impression. The Babylonian gods and Yahweh, the God of Israel, if we pay close attention. So I'm going to read this. There are going to be some places where there are sort of lacunae in the text where there's chunks missing, lines missing, words missing. So there's going to be places where it gets a little choppy. I'll try to point those out. But there's a significant amount of text here and there's enough that you can make sense of sort of what's going on. So I'll Refer to. Because the translation I'm going to be reading refers to them this way as the sufferer and his friend. So the sufferer says, o sage, come, let me speak to you. Let me recount to you who have suffered greatly. Let me always praise you. Where is one whose reflective capacity is as great as yours? Who is he whose knowledge could rival yours? Where is the counselor to whom I can tell of woe? I am without recourse. Heartache has come upon me. I was the youngest child when fate claimed my father. My mother who bore me departed to the land of no return. My father and mother left me, and with no one my guardian. The friend replies, considerate friend, what you tell is a sorrowful tale. My dear friend, you have let your mind harbor ill. You make your estimable discretion feeble minded. You alter your bright expression to a scowl. Of course our fathers pay passage to go death's way. I too will cross the river of the dead, as is commanded from of old. When you survey teeming humankind altogether. The poor man's son advanced. Someone helped him get rich, who did favors for the sleek and wealthy. He who looks to his God has a protector. The humble man who reveres his goddess will garner wealth. So the friend's response is, well, if you're suffering this misfortune, he's not saying here that the gods caused it. He's saying, but this is your way out. You need to go and find one of the gods to sort of become your patron. And when you serve them and offer them sacrifice and worship, they'll help you out and they' make your life better. So then the sufferer responds, my friend, your mind is a wellspring of depth unplumbed, the upsurging swell of the ocean that brooks no inadequacy to you. Then let me pose a question. Learn what I would say. Hearken to me but for a moment. Hear my declaration. My body is shrouded. Craving wears me down. My assets have vanished, my resources dwindled, my energies have turned feeble. My prosperity is at a standstill. Moaning and woe have clouded my features. The grain of my meat is nowhere near satisfying me. Beer. The sustenance of humankind is far from being enough. Can a happy life be a certainty? I wish I knew how that might come about. So he says, well, it's even worse that I already said. I'm not only an orphan, I'm also poor. And I can't even sort of satisfy my own hunger right. He says, I need to know for certain that there's some way I can get to a happy life. So the friend replies, my well thought out speech is the ultimate in good advice. But you make your well ordered insight sound like Babel. You force your mind to be scatterbrained, irrational. You render your choicest offerings without conviction. As to your everlasting, unremitting desire, the foremost protection lies in prayer. The reconciled goddess returns to you. The reconciled gods will take pity on the fool, the wrongdoer. I don't think they're worshiping Mr. T. I think that's just a coincidence. See, constantly after the rites of justice, your mighty one will surely show kindness and will surely grant mercy. So again, the answer is, well, you just need to go and appease the gods, right? You need to go and satisfy the gods with your worship and then they'll do good things for you. The sufferer responds, I bow down before you, my comrade. I apprehend your wisdom. What you say? Come, let me tell you. The onager, the wild ass that had its fill of wild grass, did it carefully carry out a God's intentions? The savage lion that devoured the choicest meat, did it bring its offerings to appease a goddess? Anger the parvenu who multiplies his wealth, did he weigh out precious gold to the mother goddess for a family? Have I withheld my offerings? I prayed to my God. I said the blessing over the regular sacrifice to my goddess in my speech. So he points to two things. First, it's kind of an inverse of what we find often in the Bible. He says, well, you look at wild donkeys, you look at lions, you look at the animals, they all seem to be provided for. They're not making any offerings to any gods. And then he says, add in fact that he had been making all the offerings to the gods and he still ended up in this mess he's in. The friend replies, O date palm wealth giving tree, my precious brother, perfect in all wisdom, a gem of wisdom. You are a mere child. The purpose of the gods is remote as the netherworld. Consider that magnificent wild ass on the plain. The arrow will gash that headstrong trampler of the lees. Come look at that lion. You called to mind the enemy of livestock for the atrocity that lion committed. The pit yawns for him, the well healed parvenu who treasured up possessions. A king will put him to the flames before his time. Would you wish to go the way these have gone? Seek after the lasting reward of your God. So basically, the friends response to those objections Is, well, hey, you don't know how things are going to ultimately turn out for those wild animals or for the guy you're talking about who got wealthy. You know, they, they, because they're not appeasing the gods. The gods may strike them with misfortune at some point in the future. Whereas you, even though you're already in misfortune, if you go and make the offerings, then your fate can change too, can reverse just like theirs might. The sufferer replies, your reasoning is a cool breeze, a breath of fresh air for humankind most particular. Friend, your advice is excellent. Let me put but one matter before those who seek not after a God can go the road of favor. Those who pray to a goddess have grown poor and destitute. Indeed, in my youth I tried to find out the will of my God. With prayer and supplication I besought my goddess. I bore a yoke of profitless servitude. My God decreed for me poverty instead of wealth. A cripple rises above me, a fool is ahead of me. Rogues are in the ascendant and I am demoted. So again he's hammering on this. Listen man, I tried that, I tried going to the Babylonian gods and this is where I ended up. That doesn't work. This quid pro quo idea of offerings to the gods and then they do for you. It doesn't work, at least with the Babylonian gods. And so you see here that the Babylonian religious idea of sacrifices, temple offerings as instrumental to get the gods to do what you want. And he's saying the system is breaking down because I did that stuff and they're not doing what I want. And the friend is just saying, no, no, keep at it, just keep doing it and things will get better. It'll eventually work. The friend replies, oh, just knowledgeable one, your logic is perverse. You have cast off justice, you have scorned divine design. In your emotional state, you have an urge to disregard divine ordinances. The strategy of a God is as remote as the innermost heaven. The command of a goddess cannot be drawn out. Teeming humanity well understands trouble. So he's saying, look, you know we can't understand the ways of the gods, right? But you can't, you can't just reject our traditional religion. You can't just reject pagan religion. This is the way things have always been. You have to just keep piously doing these things and eventually things will, will, will turn around. Sufferer says, I will forsake home, I will crave no property, I will ignore my God's. Regulations. I will trample on his rights. I will slaughter a calf and I will eat it for food. I will go on the road, I will learn my way around distant places. I will open a well, I will let loose a flood. I will roam above the far outdoors like a bandit. I will stave off hunger by forcing entry into one house after another. I will prowl the streets, casting about ravenous, like a beggar. Good fortune lies afar off, right? So he's saying, look, I'm telling you, it doesn't work. I'm just going to say, forget about all this stuff. I'm just going to go get mine, right? I'm just going to go get what I need. I'm going to take it if I have to. And I'm not worrying about all of this stuff about the Babylonian gods anymore, because doesn't work. Doesn't work like it's supposed to. So then there's a section that's kind of broken up here, and so I'm going to skip. It's really choppy, so I'm going to skip. This is several fragmentary lines and pick up again where the sufferer says, the son of a king is clad in rags. The son of the destitute and naked is dressed in fine raiment. The maltster can pay in finest gold, while he who counted red gold shoulders a debt. He who may do with vegetables sates himself at a princely banquet, while the son of the eminent and wealthy has only carob to eat. The man of substance is fallen, his income is removed. You have let your subtle mind wander. You have overthrown wisdom. You have spurned propriety. You have besmirched every code. Far will be the workman's labor from him who does not work. He is well served, he gets what he wants. Who follows in the way of a God and observes his rights. Be ready for good fortune. Right? So this is the Babylonian prosperity gospel, right? Just give the gifts to the gods that they want and hey, get ready for your whole life to get better. Then there's another gap in the text and we come back with more from the friend. As for the rascal whose goodwill you wanted, the print of his feet will soon disappear. The godless swindler who acquires wealth, a deadly weapon is in pursuit of him. Unless you serve the will of a God, what will be your profit? He who bears a God's yoke will never want for food, though it may be meager. Seek after the favorable breeze of the gods what you lost for a year, you Will recoup in a moment, right? So just stick to it. And notice also, he who bears a God's yoke will never want for food, though it may be meager. So you'll have food. I mean, maybe not much food. He's not promising huge results. The sufferer replies, I have looked around. In society, indications are the contrary. God does not block the progress of a demon. A father hauls a boat up a channel while his firstborn sprawls in bed. The eldest son makes his way like a lion. The second son is content to drive a donkey. The air struts the street like a peddler. The younger son makes provisions for the destitute. What has it profited me that I knelt before my God? It is I who must now bow before my inferior. The riff raff despise me as much as the rich and the proud. So suffer keeps coming back to look, man, look around. Look at society. That's not how it works. It's not the people who are really pious toward the Babylonian gods who are the wealthy and the successful and the powerful. Quite the opposite in many cases, right? He says this and you notice he's connected here. Not only worship of gods, but even hard work, right? Hard work doesn't even seem to pay off. Right? The lazy are doing as well or better than the hard working. The friend responds, adept, scholar, master of erudition, you blaspheme in the anguish of your thoughts. Divine purpose is as remote as innermost heaven. It is too difficult to understand. People cannot understand it. Among all creatures, the birth God is formed. Why should offspring be completely unmatched? The cow's first calf is inferior. Her subsequent offspring is twice as big. The first child is born a weakling. The second is called a capable warrior. Even if one tries to apprehend divine intention, people cannot understand it. So the friend's response to look around you, man, look at how things actually go in society is, well, who can understand the. The gods? I mean, the Babylon gods. Who could understand. Who could understand their ways, right? But at the same time that he's saying that he's saying, but here's how it works, right? And you need to just continue with, with this quid pro quo, even though you're not getting your quo. Sufferer says, pay attention, my friend. Learn my next parry. Consider the well chosen diction of my speech. They extol the words of an important man who is accomplished in murder. They denigrate the powerless who has committed no crime. They esteem truthful the wicked, to whom Truth is abhorrent. They reject the truthful man who heeds the will of God. They fill the oppressor's strong room with refined gold. They empty the beggar's larder of his provisions. They shore up the tyrant who all, whose all is crime. They ruin the weak, they oppress the powerless. And as for me, without means, a parvenu hates me. So he's saying, listen, like you're not getting this right? Look at how our society treats the good versus the wicked, right? Not only so this is about honor and shame. This is about who the culture honors. He's like the culture. The other people in our city don't even honor the good and the pious, but instead the wicked, right? The friend responds. Enlil, king of the gods who created teeming human humankind, Majestic Ea, who pinched off their clay, the queen who fashioned them, Mistress Mommy gave twisted words to the human race. They endowed them in perpetuity with lies and falsehood. Solemnly they speak well of a rich man. He's the king, they say he has much wealth. They malign a poor man as a thief. They lavish mischief upon him, they conspire to kill him. They make him suffer every evil because he has no wherewithal. They bring him to a horrible end. They snuff him out like an ember. So the friend's response is, well, the reason that the people, the common people, don't esteem good and reject evil is that the gods messed up when they made them the Babylonian gods who they believed created them. He's saying, well, they messed up and humanity is basically broken. And so the great mass of humanity out there doesn't really understand what is good and what is evil. So of course, of course they're going to praise the wicked and revile the good, right? So this friend has a very interesting theology that seems to constantly undercut itself, that seems to be based wholly in tradition, right? In the traditions of the Babylonian people and the one definition of insanity, which is doing the same thing over and over again and hoping for different results. So the sufferer has the concluding word. You are sympathetic, my friend. Be considerate of my misfortune. Help me see my distress. Your. You should be cognizant of it. Though I am humble, learned supplicant, I have not seen help or succor for an instant. I would pass unobtrusively through the streets of my city. My voice was not raised, I kept my speaking low. I did not hold my head high. I would look at the ground. I was not given to servile praise among my associates. May the God who has cast me off grant help. May the goddess who has forsaken me take pity. The shepherd Shamish will pasture people as a God should. So it concludes with words of resignation from the person who's suffering, who just says, look, I'm not being humbled for some wickedness. I've tried to do exactly what you're telling me to do. This has still befallen me. I don't know what else to do. Hopefully the Babylonian gods will take pity on me. As I said, I think if you compare that, if you compare this kind of confused and despairing view of the Babylonian gods from both participants in this discussion to what happens in the Book of Job and how the Book of Job culminates, I think there's some richness there in terms of really showing the difference between Yahweh, the God of Israel, as he revealed himself to the people of Israel and the gods of the nations and how they were viewed and interacted and applied their yoke, as the text here says, to the people of those nations. Sam Sa."}
