{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":0.24,"end":4.88,"speaker":"Fr Stephen De Young","text":"He will be a staff for the righteous with which for them to stand and not to fall."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5.04,"end":8.04,"speaker":"Fr Andrew Stephen Damick","text":"And he will be the light of the nations and the hope of those."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8.04,"end":12.76,"speaker":"Fr Stephen De Young","text":"Whose hearts are troubled. All who dwell on the earth will fall down and worship him."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":12.76,"end":15.04,"speaker":"Fr Andrew Stephen Damick","text":"And they will praise and bless and."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":15.04,"end":64.84,"speaker":"Fr Stephen De Young","text":"Celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":65,"end":120.55,"speaker":"Fr Andrew Stephen Damick","text":"Good evening all you gigantomoks out there. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. This is not a live episode despite the entreaties from the voice of Steve that you will hear to call in now. This episode is pre recorded for two reasons. The first is that we're both going to be in church services tonight for the great feast of the Annunciation. And the second is that our mothership studio in Chesterton, Indiana recently was flooded because of a water main break. So Matuska, Trudy and the rest of the local crew are in the process of getting the studio put back together after a thorough cleaning and, and getting some new upgraded equipment installed as well. And that means that ancient faith radio live shows can't take live calls right now. And it's also why there was not an episode of Lord of Spirits two weeks ago."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":121.03,"end":123.99,"speaker":"Fr Stephen De Young","text":"You really got carried away with that house blessing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":124.31,"end":136.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, too much. Too much water mains. That's the wave of the future for house blessings. Just gotta turn those things on. So anyway, I was not anywhere near that. No."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":137.27,"end":139.11,"speaker":"Fr Stephen De Young","text":"But this episode, that's what you'd like us to think."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":139.11,"end":166.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right. That's my official story. But this episode is going to be a Q and A even though we can't take live calls actually, because this time we're using pre recorded calls from you, our listeners. Tonight we've got questions from all over the world with topics ranging from catechism to giants to the Z's. The Z's so are you ready, Father Stephen?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":167.97,"end":173.01,"speaker":"Fr Stephen De Young","text":"I am. Although I want to suggest that next time we have to do this, we actually post record it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":173.57,"end":174.97,"speaker":"Fr Andrew Stephen Damick","text":"I don't know what that means, but."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":174.97,"end":187.89,"speaker":"Fr Stephen De Young","text":"Okay, that would be like, the show airs on Thursday night, and we record it on, like, Saturday morning just to prove once and for all the whole time and space don't exist. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":187.97,"end":189.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay, sounds good."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":190.61,"end":191.73,"speaker":"Fr Stephen De Young","text":"You at least give it a shot."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":191.73,"end":210.2,"speaker":"Fr Andrew Stephen Damick","text":"I think we will see what we can do. There's new equipment coming to the mothership, so maybe it's got that capability. All right, so here is our first question. We're just going to dive right on. This one is from Christopher. Glory be to Jesus Christ."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":210.2,"end":218.2,"speaker":"Fr Stephen De Young","text":"Fathers, my name is Christopher Mahaly from Danbury, Connecticut. And I know you've on multiple occasions."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":218.28,"end":221.76,"speaker":"Fr Andrew Stephen Damick","text":"Said that liturgy does not mean the."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":221.76,"end":234.28,"speaker":"Fr Stephen De Young","text":"Work of the people. Would a better way of understanding it be work for the people, as in God is doing the work for us?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":235.24,"end":283.28,"speaker":"Fr Andrew Stephen Damick","text":"Thanks again. Have a good night. Okay, so that's question number one, and that is something we've talked about before. So number one, shout out to Father Lucas Christensen, who mentions this all the time, and Richard Barrett. Hello, guys. I don't know if you're listening, but yeah, the reason that people think that liturgy from Greek literia means work of the people is because they see the words for people and work in there. Right. And so that's then used to make this, you know, okay, point about you should be participating in the Divine Liturgy and not seeing yourself merely as some kind of spectator. Right. So there is an actual basis for this comment, but it doesn't work in terms of actual historical usage. Is that right, Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":284.8,"end":294.72,"speaker":"Fr Stephen De Young","text":"Right. Yeah. That's sort of like, you know, butterfly. Right. You don't take the two words and read them separately and then come to a conclusion or you'll be wrong."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":294.96,"end":301.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So how is the word used, you know, in the context in which it actually arises?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":302.92,"end":332.68,"speaker":"Fr Stephen De Young","text":"Right. So originally, and by originally, I mean pre Christian, pre Greek translation of the Old Testament Greek. It basically means public works. And it means public works in the sense of in the police. Right. You have the city, everyone."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":332.68,"end":337.16,"speaker":"Fr Andrew Stephen Damick","text":"He doesn't mean the police, although they are related."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":337.96,"end":345.72,"speaker":"Fr Stephen De Young","text":"Like Minneapolis up in Minnesota or Indiana police. Exactly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":346.92,"end":349.6,"speaker":"Fr Andrew Stephen Damick","text":"You have to work on your modern Greek accent a little bit there, Father."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":349.6,"end":441.76,"speaker":"Fr Stephen De Young","text":"I know it's not good. I just offended a lot of people. At least I didn't do the old Saturday Night Live. Do you like it? The juice. The juice. She eats it Good. So within the city, there would be, at certain times, public festivals, choruses for theatrical performances, other kinds of public works that were of interest to city life and the people, the citizens, the people who in Athens had the vote, but people who were at the citizen level, which wasn't everybody, but they were expected to pay for those things. And that was part of your responsibility to the community. And the community, remember in the ancient world, including in ancient Greece, included the gods. So the first person to use a phrase, something like the Divine Liturgy, is actually Aristotle. And when he uses that phrase, he's talking about the fact that a certain amount of land should be given over by landowners to build temples. And so you could see how that's both a religious activity, but also just sort of a public works project."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":442,"end":442.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":444.24,"end":458.96,"speaker":"Fr Stephen De Young","text":"And so this then gets used to translate certain Hebrew verbs related specifically to the service of the Levites."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":459.28,"end":459.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":461.52,"end":482.89,"speaker":"Fr Stephen De Young","text":"And the reason it seems to get chosen because there are other words just for service or religious devotion to this kind of thing. Right. The reason this particular word gets used in first when the Torah is translated into Greek, is that it's within the context of the covenant."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":484.09,"end":484.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":484.57,"end":514.9,"speaker":"Fr Stephen De Young","text":"Right. So the covenant, remember, is, you know, Yahweh, the God of Israel, is the king. He cuts the covenant with the people, identifies himself, lays out their responsibilities. Right. Describes the consequences. And so liturgia is a good word to use if that's your understanding of the services outlined in the Torah. Right. The sacrificial system and this kind of thing, that this is your responsibility within the covenant toward God."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":515.54,"end":516.14,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":516.14,"end":583.62,"speaker":"Fr Stephen De Young","text":"Right. Sort of this public work of the community aimed toward God. And so then it gets picked up that way in early Christianity, because early Christianity saw themselves as a people, not as a religion, remember, as something separate. Right. This was their identity as a people. And so their public work was Christian worship, public referring to a people, not to just people in general, but a united, Right. Community. And then this transitions then very easily once you get to say Constantine, because they already had this idea of public works related to the pagan gods. The Christian liturgy then replaces that, beginning with the military under St. Constantine himself. And this gets translated in a couple of different ways into Latin. One of them is ministerium, which is where we get the word ministry."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":583.78,"end":584.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":584.34,"end":599.38,"speaker":"Fr Stephen De Young","text":"And this is why, for example, in Great Britain, the departments of government are called ministries, Right. It's not because there's anything particularly religious about them. It's this older concept of public service, public works."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":599.38,"end":601.38,"speaker":"Fr Andrew Stephen Damick","text":"The United Kingdom is not a theocracy."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":602.51,"end":603.71,"speaker":"Fr Stephen De Young","text":"Not for a long time."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":604.27,"end":608.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":609.71,"end":623.35,"speaker":"Fr Stephen De Young","text":"And then the other one of those is officium, right. Which is why you'll see in a lot of English sources, you'll see various services referred to as an office or."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":623.35,"end":624.91,"speaker":"Fr Andrew Stephen Damick","text":"As offices, the divine office."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":625.55,"end":673.39,"speaker":"Fr Stephen De Young","text":"Right. And that's the word, the word officium essentially means something sort of similar to our concept of duty, although our modern concept of duty has a whole bunch of layers that can't really be easily seen through by us. So it's duty in the sense of responsibility. And so that's why office also gets used to, for example, what we would call holy orders or the clergy. They have an office that's a set of duties, responsibilities. Right, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":673.39,"end":674.51,"speaker":"Fr Andrew Stephen Damick","text":"Things you're supposed to do."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":675.07,"end":683.15,"speaker":"Fr Stephen De Young","text":"Yeah, but that's where Lydrie. Literally, that's where it comes from. That's what it means. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":683.23,"end":689.31,"speaker":"Fr Andrew Stephen Damick","text":"So here's my follow up question, because at the beginning of the Divine Liturgy, if there is a deacon serving, which."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":689.31,"end":691.39,"speaker":"Fr Stephen De Young","text":"Ideally there should are, we could argue about this now."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":691.39,"end":726,"speaker":"Fr Andrew Stephen Damick","text":"No, no, I'm just asking about it. Yeah, yeah, I know. Because there's that line. There's that line which is translated variously as. Because this is sometimes brought up when people say liturgy means, you know, a work for the people or public work, a work by God. Right. There's that line that the deacon says the priest, which is translated either as, it is time to begin the service to the Lord, or sometimes it is time for the Lord to act. And that's a translation from something in the Greek, Old Testament, isn't it? I'm trying to. I can't."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":726.24,"end":731.2,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So now is the time for the Lord to act sounds much cooler."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":731.52,"end":731.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":732.32,"end":733.2,"speaker":"Fr Stephen De Young","text":"But is wrong."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":733.28,"end":739.92,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. So the time to begin the service of the Lord is better."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":740.91,"end":757.39,"speaker":"Fr Stephen De Young","text":"That's, that's accurate. And I mean, technically the Greek could go either way. To translate the Greek as now is the time for the Lord to act, you have to do a little bit of special pleading in terms of really uncommon Greek usages."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":757.55,"end":758.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":758.83,"end":771.83,"speaker":"Fr Stephen De Young","text":"But if you look at the way that's translated into all of the other languages in which Orthodox liturgy is done, it's always something like, it is time to begin the service of the Lord."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":771.91,"end":815.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, because this raises the question of, you know, who, who is doing the Divine Liturgy. Right. And, and I, I think one of the problems is that there's, there's. On the one hand, you can shove it all to the way to the one side and say, this is simply God doing it and we're here to show up and, and receive it, and then shove it all the way to the other side like this. Is something we're doing for. For or toward God. And my understanding, based on the. The prayers that are actually within it, is that it is clearly both. Right. That. That we are serving the Lord, but he is also doing something to and for us in the. In the midst of it. That it's really, really is both. Do you think that that's a good way to read it?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":816.68,"end":822.8,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, we can get. We can get super technical with Greek and Latin here, which no one wants, but."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":824.32,"end":826.88,"speaker":"Fr Andrew Stephen Damick","text":"Come on, someone wants it. But let's not."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":827.28,"end":892.58,"speaker":"Fr Stephen De Young","text":"If you really dig into the usage of those both Greek and Latin words, essentially the way a word like office or ministry works is it's essentially used instrumentally. Right. I'm not going to go into all the Cicero and stuff we'd have to go into to demonstrate all this, but basically an analogy I'm pulling from ancient usage is that the person who conducts an office, who conducts this duty or this responsibility or this role, is sort of like an axe. Right. So you could say this axe chopped down the tree. Okay, that's technically correct. Right. But the ax was instrumental. It was not the actual agent of chopping down the tree. It is that through which the tree was chopped down, technically. But it had to fulfill its role in order for the chopping down of the tree to happen."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":892.82,"end":893.46,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":894.1,"end":909.28,"speaker":"Fr Stephen De Young","text":"So the idea then, if we apply those words sort of in their original literal usage to the Divine Liturgy, is that God is doing something and he's doing it instrumentally through the clergy and the people."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":909.28,"end":924.04,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. Well, that makes sense. All right, so this is the first now of several questions we have from people named Ben or Benjamin. I don't know why there's. There's like five or six of them in this collection for this episode, but here you are. So this is. This is Ben number one."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":924.04,"end":925.76,"speaker":"Fr Stephen De Young","text":"Are any of them a rodent?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":926.16,"end":933.89,"speaker":"Fr Andrew Stephen Damick","text":"I. I am not certain. None of them identified whether they were rodent or hominid or. So I don't know. That's up in the air. So here's Ben."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":934.93,"end":1011.62,"speaker":"Fr Stephen De Young","text":"Hi, fathers. This is Ben calling from Grand Rapids, Michigan. So I am currently an Orthodox Christian enrolled in a master's program within the mental health field. And I had a professor in a recent lecture make what I kind of thought was a bold statement. He said that, really, until about 200 years ago, there weren't any cultures that viewed issues of mental health, like depression, schizophrenia, those types of disorders, as anything separate from maybe demonic possession or some sort of supernatural influence. I mean, I really agree with a lot of the things that you've talked about on the podcast in terms of there really being no separation between these material phenomena and a spiritual reality. But I guess my question would be, has there been any time during the history of Christian thought or any examples where a distinction is drawn between those two? In essence, we see diseases, mental disorders that can be cured with medication. Is there a way to draw a line there between what might be more material, what might be more spiritual? Or am I maybe just looking at this totally wrong?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1013.06,"end":1035.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what do you think? I mean, there's a couple of claims there, right? There's the idea that no one in the pre modern world thought that mental illness was anything but what we would now think of as purely spiritual. And then also the question of, do we. Can we make that distinction or in what way should we make that distinction? So what do you think, Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1036.19,"end":1115.78,"speaker":"Fr Stephen De Young","text":"Yeah, well, I mean, a lot of that depends on there being an either or, right? So, you know, and this is, you know, programmatic for a lot of modern people, right? Either this is just the product of a material system of causes, or it's a miracle. Yeah, right. It's only a miracle if there's no, you know, material causes, and it's only totally material if there's nothing miraculous about it. And so part of the reason why you're not going to see that distinction among. Among premodern people is that they're actually always trying to do the opposite. They're always trying to show the connections between these things, right? Like we're constantly seeing in the Gospels, right? When Christ heals someone, there's this connection between the healing of soul and body, right? There's casting out demons, there's healing physical ailments, and there's the forgiveness of sins. All sort of mixed together all the time, right. That these things are always sort of intimately connected, right? But they're not connected in sort of a crass way like Job's Friends, right? Where it's like, you sinned, therefore bad thing happened to you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1115.78,"end":1184.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. And it occurs to me, like, I'm reminded suddenly of something that St. Nikolai Vilimarovich said in one of, I think, one of his homilies where he talks about miracles. And he says that a miracle is simply one of God's gifts at which men marvel. You know, that. That it's all God's gifts, right? That, you know, the good things that we receive are all God's gifts. But there are some of those gifts that we marvel at because that's just kind of the way that we are. Right. It's like, I mean, even. Even within stuff that you might think of as purely quote, unquote, spiritual, right. Orthodox Christians who go to church every Sunday don't tend to go, whoa, wow, what's happening? When they know that the Eucharist has. Has become, you know, that it's become the body and blood of Christ. But if they see a mer. Streaming icon, they're much more likely to go, whoa. You know, they're even. Even within those things that we think of as spiritual, there's kind of levels of marveling. Right. You know, like the Eucharist people tend to marvel if they contemplate it. It's not something that sort of smacks them in the face the way that a visual, a strongly visual miracle, quote, unquote, might. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1184.55,"end":1189.35,"speaker":"Fr Stephen De Young","text":"But even then, I mean, there are commonplace things like a sunrise or a sunset."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1189.43,"end":1191.07,"speaker":"Fr Andrew Stephen Damick","text":"Right. The people marvel that we would hold."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1191.07,"end":1195.51,"speaker":"Fr Stephen De Young","text":"Our totally material causes, but the people will still pog out about and like."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1196.07,"end":1196.87,"speaker":"Fr Andrew Stephen Damick","text":"Pog out."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1198.71,"end":1203.43,"speaker":"Fr Stephen De Young","text":"Like we'll. We'll, you know, have that experience of."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1203.59,"end":1203.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1204.23,"end":1226.02,"speaker":"Fr Stephen De Young","text":"Of awe and wonder, right? Yeah. And so part of this is also related to this idea we have as modern people that we're sort, you know, at best, right. If we're Christians that, you know, we're. We're a ghost in a machine, you know, that there's, you know, we are a soul, which is a thing, and it's like living inside our body."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1226.34,"end":1226.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1228.26,"end":1246.27,"speaker":"Fr Stephen De Young","text":"And again, that's not how it's seen in Scripture. Right. That a human person is a human person. Right. It's not just in terms of criticizing Apollinarianism, sorry, William Lane Craig, that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1249.07,"end":1249.39,"speaker":"Fr Andrew Stephen Damick","text":"We."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1249.39,"end":1283.4,"speaker":"Fr Stephen De Young","text":"Argue that Christ is one person and that human nature is one and is whole. That's true for all humans. Human nature is one and is whole. And so you can't separate out these capacities. And we know this in experience. Right. There's not somebody who has spent years dealing with a debilitating physical ailment, who hasn't struggled with mental health and depression along the way, and who hasn't been subject to spiritual attack along the way. Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1283.72,"end":1284.2,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1284.2,"end":1300.34,"speaker":"Fr Stephen De Young","text":"Right. Like in our actual human experience, those things are never separate. Right. They're always mixed together and. And intermingled. Right. And so I think the instructor who Ben's hearing. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1300.5,"end":1300.9,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1303.38,"end":1362.09,"speaker":"Fr Stephen De Young","text":"Sort of trying to demingle these things. Right. He's trying to say that. Oh, no, no, no. They were saying it was only like this person was fine, and then some demon came at them. That's what they thought back then, now we know it's this other thing. But the reality is, this is the modern. Everybody in the past was a primitive screw head. The fact is they had a much more nuanced view. They didn't deny the material elements and the mental elements. You'll find people talking about distraction and these different problems. Right. And despondency and these things. Right. But they always saw those as having physical and spiritual causes and effects. Right. They weren't. It wasn't purely one thing the way we modern folks want it to be."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1362.25,"end":1367.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. Okay, so now we've got a question from Cynthia."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1369.21,"end":1418.7,"speaker":"Fr Stephen De Young","text":"Hi, Father Stephen. We have a question for you. Kind of two parts. We are wondering if you can help us understand who it is that Cain had children with. And we're wondering if that might be related to your discussion about giants. And in Genesis chapter six, there is. It says now there were giants on the earth in those days. And also afterward, when the sons of God came into the daughters of men and they bore children to them. Those are the mighty men of old, men of renown."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1419.74,"end":1423.14,"speaker":"Fr Andrew Stephen Damick","text":"And there's also reference that giants are."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1423.14,"end":1443.99,"speaker":"Fr Stephen De Young","text":"Also known as Nephilim and hybrid sons of fallen angels. So if you could please clarify for us, that would be very helpful and thank you for clarifying so much for us as we are listening to your podcasts and starting to read your book. Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1445.19,"end":1456.32,"speaker":"Fr Andrew Stephen Damick","text":"All right, so there's several things there. Number one, who is Cain's wife? Does this have something to do with the giants? And how does that relate to the Nephilim? What do you think, Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1457.04,"end":1460.56,"speaker":"Fr Stephen De Young","text":"Yeah, and apparently they only want to know what I have to say about it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1460.56,"end":1462.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. It was directed to you, so it doesn't matter."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1463.2,"end":1465.04,"speaker":"Fr Stephen De Young","text":"You get a buy, I guess. Completely."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1465.04,"end":1470.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, go for it. Number one, listen to a three and a half hour episode about giants."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1470.52,"end":1488.48,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. Yeah. In terms of the giants and Genesis 6 and everything, we gotta go back to the giants episode because all the other people with questions would get mad if we rehearsed three and a half hours. But in terms of Cain's wife, we don't know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1489.68,"end":1494,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, she's not mentioned. Right. It just says that he knew his wife. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1494,"end":1494.72,"speaker":"Fr Stephen De Young","text":"Well, not named."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1494.72,"end":1496.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, she's not named. She's not named. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1497.84,"end":1563.69,"speaker":"Fr Stephen De Young","text":"And so folks who want to take a very literal read of Genesis chapters four and five say, well, it must have been his sister, which is certainly possible. There are other people who have various theories that come under the heading of what's called co Atomism. Co Atomism. Is basically just any theory in which there are other people besides Adam and Eve who are around. Those theories run into a bunch of problems now and we have to distinguish among those theories. So co atomism in the 19th and early 20th century was mostly racist. I mean, very literally. It's pretty horrific. Some of the stuff you will find if you go and do a Google search for co atomism, now that I've told everybody that term, because it was an attempt to try to say that there are multiple races of humanity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1565.1,"end":1567.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the ones you don't like are descended from Cain."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1568.46,"end":1571.1,"speaker":"Fr Stephen De Young","text":"Yeah. So the one you do like is descended from Adam."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1571.1,"end":1572.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1573.74,"end":1577.26,"speaker":"Fr Stephen De Young","text":"Oh, no, this is co atomism. They're not even descended from Cain."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1577.26,"end":1579.62,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh, wow."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1579.62,"end":1619.35,"speaker":"Fr Stephen De Young","text":"Okay. Yeah, yeah. You also get this sometimes in terms of different people trying to incorporate the story in Genesis into various evolutionary theories. Right. So there's like a whole bunch of humans who evolved, but then God creates Adam separately. Right. The places where all those theories run into kind of a problem is that you have to have death come to humanity through something other than Adam's expulsion from paradise, which we've talked about a lot in different episodes. And if you break that connection to death."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1619.78,"end":1619.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1619.94,"end":1648.35,"speaker":"Fr Stephen De Young","text":"If you've got most humans just living and dying and death is natural to them, that creates real problems on the other end when it comes to Christ defeating death. And the fact that everyone now today. So there's a revised, revised, revised recent version of this theory that's become very popular among certain Internet Protestant apologists."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1650.75,"end":1651.15,"speaker":"Fr Andrew Stephen Damick","text":"Where."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1651.79,"end":1667.31,"speaker":"Fr Stephen De Young","text":"They point out that, well, even if there were these other people who evolved and, you know, Cain marries into them and stuff, by today, you know, all this thousands of years later, we're all descended from Adam anyway, so it's okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1669.23,"end":1669.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1669.59,"end":1671.87,"speaker":"Fr Stephen De Young","text":"The problem is you have a whole bunch of generations that aren't."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1672.63,"end":1672.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1675.27,"end":1717.1,"speaker":"Fr Stephen De Young","text":"To whom death was natural. Right, right. So there's a lot. Yeah, there's a lot of problems that come. So some kind of co atomism in that sense and having some more people around. I understand why people would find that attractive because it would let you solve certain problems like who's Kane's wife? And some other things and how does he build a city? How did there get to be that many people? But you end up with theological problems that are way worse than just having to say, like, I don't know who Cain's wife was. The Bible doesn't tell us. And we have to remember that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1719.02,"end":1719.34,"speaker":"Fr Andrew Stephen Damick","text":"Not."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1719.34,"end":1725.34,"speaker":"Fr Stephen De Young","text":"Just Genesis 1:11, but the whole Bible was not written to answer our questions. And our curiosity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1725.58,"end":1728.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1728.2,"end":1749.04,"speaker":"Fr Stephen De Young","text":"God has specific things he wanted to communicate to us. And so especially if our answers to our curiosity start to conflict with or make us, you know, fiddle with those things, God is trying to communicate, we've gone aground. Right. Shipwreck time. Yep."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1749.28,"end":1754.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we've got another question. This one is from Emiliano. Hello, Fathers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1754.31,"end":1805.01,"speaker":"Fr Stephen De Young","text":"I am Emilian from Romania, and I have a question about the soul. In the last episode, Father Stephen said that we shouldn't think of the soul as being a thing, an eternal, immortal element of our being. Rather, we should think of it as the life of the body. Could you elaborate more on this idea? How should we understand the afterlife, given that the soul is really not the spirit you get to wander around with when you die in World of Warcraft? And what about the process of demonization? Because the Nephilim's soul seemed to me to get that Warcraft treatment when they possess human beings. And also, what about the Old Testament idea that the soul descends into the underworld after death, but that it also returns to God? Thank you for this and for your very helpful and useful work."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1805.65,"end":1815.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so the question seems to be if the soul is not a thing a la Descartes. Right. You know, if it's the life of."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1815.75,"end":1816.91,"speaker":"Fr Stephen De Young","text":"The body or Plato."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1816.91,"end":1833.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. Right. Sorry. Yeah, yeah. Well, you know, all philosophy is just footnotes to Plato, as they say. Right, yeah. You know, the thing about human beings being spheres, you know, was that. Isn't that originism? Isn't he the one who's really about the spheres?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1834.4,"end":1848.4,"speaker":"Fr Stephen De Young","text":"Well, he's getting that from Plato. Read the Timaeus. Humans started out as just like a spherical head, but then they'd roll around and fall into a ditch or something, and they couldn't get out. And so that's why bodies, right, which, you know, carry the head around."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1848.88,"end":1858.8,"speaker":"Fr Andrew Stephen Damick","text":"In Charlie and the Chocolate Factory, where you also have the film versions, Willy Wonka and the Chocolate Factory, you do have Viola, who becomes essentially a sphere."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1859.28,"end":1859.54,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1859.69,"end":1880.97,"speaker":"Fr Andrew Stephen Damick","text":"So it is an originistic film, a Platonic film, really. So just throwing that out there. Okay, but. So the question is that if souls are not things, if they are the life of the body, then how does that explain the sense of them journeying or being parted from the body? Like, what exactly is going on there? And then, of course, he mentions demonization, Demonized souls."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":1881.53,"end":2039.64,"speaker":"Fr Stephen De Young","text":"Right, And World of Warcraft. So next time you're doing a corpse run, tell the spirit healer hi for me. But so, yeah, so, yeah, so the idea of the immortal soul, right, is from Plato, right? And when Plato says the soul is immortal, he means it, right? So Plato has the transmigration of souls, AKA reincarnation, right? Because if something's immortal, it's immortal, right? In and of itself, right? So, and then the body is the prison of the soul, etc, etc. So even though Calvin quoted that, it's not Christian. So if you go back to the Hebrew Bible, right? Soul just means life. Nephesh just means life. So when God creates the fish of the sea and the birds of the air, it's the souls that swim in the sea and the souls that fly in the air. And everyone from Aristotle to St. Gregory Palmas that covers some ground says that animals and even plants have souls. They just have souls of a different type of. Right, right. Than human souls. And the reason you can say that is because they're alive, right? The Latin word for soul is anima. So we call something that is not alive an inanimate object, right? A soulless object, as opposed to one that has a soul. So when we talk, when we talk about the soul leaving the body in that original Hebraic context, we're literally talking about the life leaving the body, right? The body is still there. It is no longer alive. It is now inanimate, right? And so the question then becomes, what happens to that life? And so, yes, we get spatial language, right? Going down into the underworld or up into the heavens, right? But we have to take that, you know, as by way of analogy, because even somebody like Plato doesn't think that a soul fills physical space, right? Or weighs anything. They did those experiments, Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2039.88,"end":2041.16,"speaker":"Fr Andrew Stephen Damick","text":"I was about to say that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2041.64,"end":2072.05,"speaker":"Fr Stephen De Young","text":"Yeah, but you know, has mass and takes up space, right? So this is part of that, you know, you don't know what it's like to be a bat. And as we've talked about, what is what we call the intermediate state, the period between our physical death and the resurrection of the dead. What's that like? Well, we just get analogies in Scripture because we don't know what that's like. Right, right. We know that our life is hidden in Christ."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2073.62,"end":2073.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2073.78,"end":2101.33,"speaker":"Fr Stephen De Young","text":"But what exactly does that mean? Yeah, right. So we believe that our life continues even as it leaves the body, right? That that life doesn't evaporate right, into the ether, so that that life continues, but it continues contingently, right? Because it's still created, it's not uncreated."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2101.97,"end":2102.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2102.45,"end":2136.61,"speaker":"Fr Stephen De Young","text":"The soul. And so it is contingent all the way through. Right? It is God who is preserving it. And then we believe that Life will return to the body in the resurrection for every. For every human. And. Yeah. Do I want to get it? So. Yeah. Yeah, I'll leave it there. Okay. I was gonna say I was gonna get into the relationship between the soul and consciousness, but we have other questions to answer."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2136.61,"end":2137.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we do. We do."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2137.73,"end":2139.41,"speaker":"Fr Stephen De Young","text":"We can talk about that at some other point."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2139.49,"end":2174.7,"speaker":"Fr Andrew Stephen Damick","text":"I'll say. The thing that I would add with regards to his references to demonization. Oh, yeah, yeah. Would be simply that, you know, that life becomes demonized. It becomes a demonized life. Right, right. And so that's. The nature of that way of being, is that it's evil. It functions in a demonic way, you know, And I mean, just as. Just as a human person who. Who is not dead yet, they can function in a demonic way. I mean, that's. That's exactly like that. The Fathers say that. Right. So."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2175.02,"end":2189.47,"speaker":"Fr Stephen De Young","text":"Right. And parallel to the way in which the souls of the saints, most of whom are not yet bodily resurrected. A few are, but most are not yet bodily resurrected. Their soul is functioning in an angelic capacity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2189.55,"end":2195.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. Exactly. Okay, so here's one from Evan. Hello, Fathers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2196.67,"end":2235.55,"speaker":"Fr Stephen De Young","text":"I've read about and heard about how in ancient times, catechumens and penitents were not present in the nave of the church during liturgy, but rather stood out in the narthex or otherwise outside the nave and kind of with our understanding of holiness by death. I was wondering if there was a connection there, since penitents were not present where we understand Christ to be present in the assembly of the people in the nave. If you could talk about that a bit or answer if there is that connection or what that connection is, I would appreciate."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2236.51,"end":2243.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So, I mean, he said holiness by death, but I'm sure he meant death by holiness, because holiness by death, that would be martyrdom."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2243.75,"end":2249.03,"speaker":"Fr Stephen De Young","text":"Right. That would be one of the martyrs who wasn't a Christian before his martyrdom."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2249.03,"end":2273.4,"speaker":"Fr Andrew Stephen Damick","text":"For example, which is a thing. It's definitely a thing. Yeah. So, I mean, I haven't studied this question, but my hot take on this would be that it does have. It is a symbolic way of expressing this question of. Of death by holiness. In other words, that the catechumens and the unbaptized don't get so close, because to do that, they're not ready for that yet, basically. What do you think?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2274.12,"end":2284.52,"speaker":"Fr Stephen De Young","text":"Right. They haven't yet experienced purification. Right. Remember we were talking about the tabernacle? The laver is there so that when the priests come in, they can wash. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2285.72,"end":2293.4,"speaker":"Fr Andrew Stephen Damick","text":"So, yes, Evan, you've got that right. Okay, so now we've got one from. That was a quick one. Yeah. Well, we're going to need some quick ones."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2293.8,"end":2295.24,"speaker":"Fr Stephen De Young","text":"I don't have to ramble about everything."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2295.32,"end":2303,"speaker":"Fr Andrew Stephen Damick","text":"You don't. I mean, you could. No, please don't. Yeah. So this one is from. From Jesse, who has a very non controversial thing to ask about."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2304.36,"end":2341.71,"speaker":"Fr Stephen De Young","text":"Hi, fathers. This is Jesse Crosby. I have a question about Genesis 3. In Genesis 3, when God is condemning the serpent, he says that there will be enmity between the serpent's seed or offspring between the serpent and the woman. And that reference to the serpent's seed is. I'm wondering if that is referring to nephilim or to the behemoth or to just other fallen angels who exactly would be considered the offspring of the serpent. Thank you so much."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2343.15,"end":2401.06,"speaker":"Fr Andrew Stephen Damick","text":"Okay, I'm. I'm reminded now. So a few years ago, I did a speaking engagement in Louisville, Kentucky, and I asked the. The pastor, Father Alexis Khoury, actually at the time, to take me across the river to. There's a cemetery there, and there's a guy buried there named William Branham who was a big faith healer in the charismatic world in the middle of the 20th century. And there's a whole bunch of his disciples buried in that cemetery. And one of them, whose tombstone is not far away from his, is this massive thing that has this sort of long poem on it summarizing all of his wackiest teachings. And one of them is this question of the serpent's seed. Like he has this idea, and this is out there, right, that this serpent seed that exists within mankind that functions as a kind of Illuminati cabal or whatever, who are poisoning the world and trying to turn everyone to destruction. So is that what's being taught in Genesis, chapter three?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2402.42,"end":2410.02,"speaker":"Fr Stephen De Young","text":"No, that's what I thought. No, more common than that. I mean, not common, but more common than that is this idea that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2411.94,"end":2412.22,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2412.22,"end":2415.78,"speaker":"Fr Stephen De Young","text":"Serpent and Eve, right, Had Cain."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2417.38,"end":2421.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, that. Yeah, that. Yeah. Well. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2421.86,"end":2423.9,"speaker":"Fr Stephen De Young","text":"I mean, that's literally Cain's father."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2423.9,"end":2436.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think. In fact, I think that that's one what. I think that that's what Branham's teaching was, is that. Okay, yeah, so that there's this cane line out there and then there's also the Seth line, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2436.69,"end":2464.7,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. And then you get, you know, bad 90s gothy vampire fiction out of that. But as one does. But yeah. So really, I mean, the New Testament lays this out pretty clearly, right? Christ says to the people who are out to kill him you are sons of your father, the devil."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2464.94,"end":2467.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2467.26,"end":2551.71,"speaker":"Fr Stephen De Young","text":"And in First John, St. John is not identifying Cain as literally the son of the devil, but he's using him as an archetype. Right. So as we've talked about before, sonship is primarily about image bearing. The son is the image of the Father. And so the one who bears the image of the serpent, the one who becomes like the devil, is his son. Right. And those who bear the image of God are sons of God. Right. And Christ is the Son of God, capital S, because he is the perfect express image of the Father. Right. So, yeah, that's. That's what this seed or offspring or. Or son language is about. And this is. This is not something that's new in the New Testament. Right. A lot of people, like, they'll. They'll attribute this, like, to St. Paul. Like, St. Paul does this huge break with the past where he says, oh, no, you're. You're sons of Abraham if you share his faithfulness. Right. If. If you're like Abraham and not otherwise, like, this is this big. Everybody before that just thought it was ethnic."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2551.79,"end":2552.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2552.75,"end":2570.55,"speaker":"Fr Stephen De Young","text":"It was like. You're right. Which, of course, even though there was no concept of ethnicity, etc. And yeah, that is. That is not the case. You. You find that. Well, well, before that, in Second Temple Judaism, this idea. Because that this is what it means to be a son."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2570.63,"end":2574.79,"speaker":"Fr Andrew Stephen Damick","text":"And so, yeah, I mean, an Adam is called a son of God."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2575.51,"end":2575.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2575.91,"end":2590.53,"speaker":"Fr Andrew Stephen Damick","text":"And. And there are, you know, angels who are called sons of God. So, you know, it clearly is not about biological descent in any exclusive kind of way. Okay, so this next question is from Josh."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2592.45,"end":2609.09,"speaker":"Fr Stephen De Young","text":"Father's Blessed. My name is Josh and I'm from Oklahoma. I've only known about orthodoxy for about a year now. Would you be willing to explain or define what's meant by the kingdom of God? We see it a lot in the Gospels and it seems to play a pretty prominent role. I was wondering if you could shed."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2609.09,"end":2609.85,"speaker":"Fr Andrew Stephen Damick","text":"Some light on that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2609.85,"end":2610.69,"speaker":"Fr Stephen De Young","text":"Thank you very much."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2611.64,"end":2671.96,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so the kingdom of God, I mean, so I'll just say this. We tend to think of kingdom in the modern world as being about nation states. Right. But really my sense of way it is in the Scripture and of course, certainly the way that it is in liturgical writings and the writings of the fathers. Is that the kingdom of God? Is that a kingdom is the, the. The extension of the influence or rule of the king. Like, it's all those who are under his sway and are obedient to him, which is why you can be outside the kingdom of God by being disobedient. Right. It's. It's so. It's not. Again, it's not like a state with borders or even a sort of spiritualized version of that, but it's rather those who are under God's influence and who are being obedient to him and doing what it means to be a citizen of his kingdom. Is there anything needs to be added to that or adjusted or corrected?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2672.12,"end":2688.68,"speaker":"Fr Stephen De Young","text":"Well, sort of the other side of that. I mean, you're right that the word kingdom is another place where Latin and then English haven't been kind to us in reifying things. Right. It's much more, like you said, a verbal idea in."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2689.78,"end":2690.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2690.1,"end":2693.46,"speaker":"Fr Stephen De Young","text":"Although in Greek, a reign or dominion."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2694.18,"end":2724.6,"speaker":"Fr Andrew Stephen Damick","text":"In early English, it is the king. You know, I think I've mentioned this on this show before. The king is the kining. He's the. The kin person. So it literally is. It's. It's about the guy who's at the center of the family and kind of tying everything together, you know, and so then those who are part of his kinning Dom, those who are within his judgment is literally what that means, are the ones that are tied to him. So, I mean, early English has it, but. Yeah, as you said, later English. And it's. It's, as you said, more reified."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2725.48,"end":2740.84,"speaker":"Fr Stephen De Young","text":"Yeah. And so from the other side, sort of, as you said, you know, people who are obedient. Right. That's one side of the covenant. The other side is that, you know, as we've talked about before, what the king does is establish order."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2741.51,"end":2742.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2742.71,"end":2795.98,"speaker":"Fr Stephen De Young","text":"And so it is the. The. What's a good. See, all the. All the good words are all sort of reified and spatial in English, like the arena or the realm or the. In which Christ is placing things in order already. Right. And so the idea is that the. The Last Judgment, the culmination of this, is when this becomes true of all of creation. Right. So Christ is enthroned and already reigns. Right. That's an eternal reality. And as we talked about before, though, that then plays out in real time. Right. In the lives of actual people. Right. Who are finite, therefore experience things at time and space."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2796.3,"end":2806.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Okay. Well, we've got one from. It's spelled C A V A N. I'm going to guess that's pronounced Cavan, but I'm not entirely sure."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2808.78,"end":2824.73,"speaker":"Fr Stephen De Young","text":"Hello, Fathers. I was hoping to gain some understanding on the Feast of Tabernacles, which is currently being celebrated by our Jewish friends. So I know that it is commemorating the time between Jewish Passover and Jewish Pentecost with the Israelites wandering in a desert."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2825.61,"end":2840.33,"speaker":"Fr Andrew Stephen Damick","text":"It's acting as a link between Passover and Pentecost. And there seems. So there seems to be a connection with the 40 years in the wilderness, with the 40 days of Christ being with the disciples after the Resurrection, since that would be the time between the."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2840.33,"end":2845.61,"speaker":"Fr Stephen De Young","text":"Christian Pascha and Pentecost. So the Church has taken up celebrating."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2846.34,"end":2849.86,"speaker":"Fr Andrew Stephen Damick","text":"Pascha and Pentecost, but not explicitly the Feast of Tabernacles."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2850.26,"end":2860.34,"speaker":"Fr Stephen De Young","text":"Are we somehow indirectly celebrating it, or we don't celebrate it because it's already been fulfilled? Any insight here would be appreciated. Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2861.62,"end":2864.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, what do you think? Are we celebrating the Feast of Tabernacles?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2866.66,"end":2991.96,"speaker":"Fr Stephen De Young","text":"Not right this second, no. So, yeah. The Feast of Tabernacles originally served a couple of purposes. The main one was that one thread running all the way through the Old Testament. And then that shows up again in the New Testament, especially in St. Peter's epistles, is the idea that Israel was not to sort of settle in the land, right. And put down roots. Because, of course, as God warned them over and over again in the Torah, especially in Deuteronomy, you know, now out here in the desert, you're dependent on me, right? So you're sort of aware of the fact that I'm caring for you. But once you get into the land and you plant your fields and your vineyards and everything, you're gonna forget about God and just attribute all this stuff to yourself, your own hard work and your own ingenuity. And so we see all. I mean, this plays out all through. You have, you know, when Abraham and Lot decide to divide the land, you know, Lot wants to go live in the city, go settle there, and Abraham lives out in the plain, Right? Intense. When you get to Jeremiah, there's apparently one clan in Judah that never settled. They lived in tents the whole time for centuries, right? And they're, like, lauded as, like, the most righteous family in all of Israel for having done that. And this is where then St. Peter gets to live as strangers and foreigners in the world, which is something we need to hear because we've settled pretty well. But the Feast of Tabernacles, in that celebration and going to live in booths, as the King James would have it, you're. You're unsettling yourself, right? And you're unsettling yourself at the time of the harvest, right? You're unsettling yourself at one of the times when you would have been most Settled."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2992.04,"end":2992.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":2992.52,"end":3036.38,"speaker":"Fr Stephen De Young","text":"Like. Like this is the agricultural period, which was the mark. Right. Being able to plant crops was the. The. Of the settlement. Right. Of when they were going to forget God and they're forced to sort of uproot themselves at that moment. There's also the interesting thing that I know we've talked about with the 70 bulls being offered for the 70 nations, where in unsettling. Right. Israel is sort of offering these sacrifices for the nations and therefore serving as a priestly nation among the other nations."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3036.46,"end":3040.3,"speaker":"Fr Andrew Stephen Damick","text":"So like the Levites then were. Who had no land."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3041.26,"end":3061.75,"speaker":"Fr Stephen De Young","text":"Right. Parallel to the way the Levites functioned within Israel itself. Right. That's why those two things are connected in the feast. So for us, most of that stuff, a little bit of that stuff has shown up around Pentecost actually, but most of it shows up around the feasts of the transfiguration."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3061.91,"end":3070.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which happens during the tabernacle celebration within the biblical narrative. Right, right, yeah, exactly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3070.95,"end":3071.55,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3071.55,"end":3075.03,"speaker":"Fr Andrew Stephen Damick","text":"Okay, we've got one now from Marcus."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3075.27,"end":3130.78,"speaker":"Fr Stephen De Young","text":"Hi, this is Marcus from Cornwall. I have a question about the use of the term pharmacia in Galatians 5:20. So it's translated as sorcery or witchcraft. When I've asked people in the past, they'll say pharmacia equals drugs or pharmacia equals demons. So I want to know, does the term pharmacia, as it's used there, refer to or include a reference to the use of psychoactive drugs? Relatedly, were psychoactive drugs used in a ritual or religious context with which Paul would have been familiar? I've heard him mentioned by other people 1T McKenna, that opium and cannabis, henbane and belladonna were used in the ancient world. But I can't find much information about their use in a religious context. Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3131.66,"end":3154.62,"speaker":"Fr Andrew Stephen Damick","text":"All right. A completely non controversial question. I think he's our first caller from. From Cornwall, I think. I mean, we've had other British callers, but this is our first Cornish one. Pretty cool. You know, the one thing that I'm. I'm reminded about is the. The Oracle of Delphi. Apparently they were inhaling something. Right. Do we know what that was?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3157.58,"end":3161.34,"speaker":"Fr Stephen De Young","text":"Well, yes, that's kind of a theory. People are still arguing about that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3161.34,"end":3163.18,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay. Well, it's something I've heard about."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3163.82,"end":3185.56,"speaker":"Fr Stephen De Young","text":"Yes. But one, one popular theory is, is that there were sort of gases coming up in that area because like most of Greece, it's very tectonically active and that. So the theory is that some of those visions were triggered by inhaling the Gases."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3186.04,"end":3187.64,"speaker":"Fr Andrew Stephen Damick","text":"I bet that's really healthy."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3188.52,"end":3191.64,"speaker":"Fr Stephen De Young","text":"Yeah. Which may be true."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3191.8,"end":3192.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3192.28,"end":3200.99,"speaker":"Fr Stephen De Young","text":"Or maybe that's one of those things it's hard to prove too. So, I mean, Zack Snyder had it that way, so, I mean, maybe."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3205.07,"end":3212.27,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah. Drugs, sorcery, I mean, are these, Are these all one thing or separate thing or one thing in the ancient world?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3213.39,"end":3217.71,"speaker":"Fr Stephen De Young","text":"They aren't all one thing, but the Venn diagram has significant overlap."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3217.71,"end":3218.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3219.4,"end":3269.74,"speaker":"Fr Stephen De Young","text":"Which is how Pharmakea gets its usages. Right. So it was very common within magical practice to use psychoactive substances. So part of, part of the issue here with him trying to find more information is that when you get into academic stuff, there's a pretty big divide because, you know, everything has to be divvied up and is subject to taxonomy and academia. People who are talking about magical practice and people who are talking about religious practice may be the same people, but it's rarely in the same place. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3270.06,"end":3270.78,"speaker":"Fr Andrew Stephen Damick","text":"That's irritating."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3272.06,"end":3282.06,"speaker":"Fr Stephen De Young","text":"Those are sort of discussed separately. Well, there's, there's reasons why, because they're not in the ancient world. They weren't always the same practitioners."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3282.14,"end":3282.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3282.5,"end":3294.62,"speaker":"Fr Stephen De Young","text":"And then the further you go forward in history. Right. Like if we're going to talk about German or English folk magic versus. Right. The Christian church in Germany or England. Right. Those are going to be radically."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3294.7,"end":3301.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because especially because they, you know, they do exist simultaneously, as by, as you said, a certain point in history."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3302.37,"end":3303.29,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3303.29,"end":3303.65,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3303.65,"end":3309.41,"speaker":"Fr Stephen De Young","text":"And the further you go back in history, it is true, the more they kind of mingle together."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3309.57,"end":3310.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3310.77,"end":3348.22,"speaker":"Fr Stephen De Young","text":"Right. So, I mean, when you go back to a lot of very early ancient Near Eastern stuff, magic is invoking gods that are the same gods who are being worshiped in temples and stuff. Right. That then gets sort of shifted around as you go. But so within magical. Magical practice for the most part was always sort of a folk practice. Right. You wouldn't go to one of the scribal priests in Egypt at the temple to get him to do a love spell."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3348.67,"end":3348.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3348.87,"end":3355.19,"speaker":"Fr Stephen De Young","text":"There was. There was somebody in your village who could do that. Right. Or who knew how to do that, had the, the technique of how to do that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3355.19,"end":3356.91,"speaker":"Fr Andrew Stephen Damick","text":"Your local pharmacist, as it were."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3357.23,"end":3360.35,"speaker":"Fr Stephen De Young","text":"Yeah. That's. No offense."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3360.35,"end":3361.15,"speaker":"Fr Andrew Stephen Damick","text":"Pharmacists."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3362.35,"end":3362.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3363.07,"end":3366.91,"speaker":"Fr Andrew Stephen Damick","text":"I know of at least one who listens to this show, actually. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3367.63,"end":3380.36,"speaker":"Fr Stephen De Young","text":"So there were. And then there were different methods for doing different things, and in some cases those involve psychoactive substances or just alcohol, you know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3380.44,"end":3381.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3382.28,"end":3405.39,"speaker":"Fr Stephen De Young","text":"That's. And other, you know, physical techniques to induce an altered state of consciousness. Right. Lots of those kinds of things all mingle together. Right. So not all Pharmakea in the sense that St. Paul's using it in Galatians is about psychoactive drugs, but some of it is."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3405.63,"end":3406.67,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3406.67,"end":3421.63,"speaker":"Fr Stephen De Young","text":"Right. And there weren't a lot of people using psychoactive drugs. Psychoactive drugs in other contexts at that point in history. There weren't sort of like recreational drugs. Let's all go to a party and drop acid. Right. That wasn't. What happened to the exam."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3421.63,"end":3430.49,"speaker":"Fr Andrew Stephen Damick","text":"Not a thing. Yeah. Okay. All right. Well, we have one more question we're going to take before a break. And this is another Ben Father's bless."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3430.81,"end":3502.89,"speaker":"Fr Stephen De Young","text":"In Daniel 4, in the 18th year of Nebuchadnezzar, the Babylonian king receives a warning in a dream that judgment is coming. He destroys the temple in Jerusalem in his 19th year, and then, surprise, surprise, judgment falls. That same year, the judgment is said to have been handed down by the watchers and was announced by a watcher and a holy one or a mighty angel sent from heaven. In the old days, Greek. Are you aware of the theory that Nebuchadnezzar's transformation was intended to depict the reversal of Enkidu's humanizing? Enkidu was set in the mountains, was shaggy, had long nails like talons. He progressively moved toward quote, unquote, civilization and away from the gods until he becomes ally to Gilgamesh. The king Nebuchadnezzar was driven away from civilization into the mountains. His hair became long and shaggy and his nails grew like talon. In the old Greek version, the angels are said to even feed Nebuchadnezzar like a beast. If Nebuchadnezzar's punishment is meant to depict a reversal of Enkidu's humanizing, would this be a picture of Nebuchadnezzar becoming totally demonized for a time? Why does this make me think of the Gadarene demoniac? Thank you, fathers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3503.53,"end":3507.93,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's pretty cool. I was fascinated by this question."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3507.93,"end":3508.08,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3508.23,"end":3523.91,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, is there a link between the transformation of Nebuchadnezzar into a beast like form and the humanization of Enkidu from that, you know, the Epic of Gilgamesh and that related literature? What's going on there?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3524.55,"end":3526.71,"speaker":"Fr Stephen De Young","text":"So we're going to partially punt here."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3526.71,"end":3527.51,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3528.31,"end":3535.16,"speaker":"Fr Stephen De Young","text":"Because as you know, and our listeners probably don't, we had a whole section for the Halloween episode this past year."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3536.04,"end":3540.24,"speaker":"Fr Andrew Stephen Damick","text":"About Mad Men that we skipped because of time, frankly, that we had to."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3540.24,"end":3546.68,"speaker":"Fr Stephen De Young","text":"Cut out because of time. And so I think there's going to be a Divine madness episode in the future."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3546.84,"end":3547.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3547.88,"end":3614,"speaker":"Fr Stephen De Young","text":"Add that to the spreadsheet where we're going to do kind of a deep dive into this. But I don't want to leave it totally unanswered. So there is a connection here. And I wouldn't say it's a reverse, I would say it's an inversion. And we'll get into that more in that episode. But the reason I prefer the term inversion is that Enkidu's humanization was seen as a negative thing. Right. It sort of culminates in him sleeping with the cultic prostitute and that ends up getting him killed. Whereas this reversal is seen as a negative thing, that he becomes like a beast. And so there's something going on there in terms of inverting that pattern. And we will go into a deep dive on that deeper dive than we could go into right now even if I wanted to in that forthcoming episode."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3614,"end":3621.72,"speaker":"Fr Andrew Stephen Damick","text":"All right. So that is. Okay, Spreadsheet keeper, you can add that to your spreadsheet. But meanwhile, we're going to go ahead and take a quick break."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3621.96,"end":3642.29,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855- a-new from ancient faith Publishing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3642.85,"end":3681.16,"speaker":"Fr Andrew Stephen Damick","text":"Orthodoxy and Heterodoxy Finding the Way to Christ in a Complicated Religious Landscape, written by Andrew Stephen Damick. The purpose of this book is not to prove that orthodox Christianity is the one true faith. I do not believe that it is possible to prove that, at least not by what can be written in a book. What we are seeking to do, however, proceeding from the position of the orthodox Christian faith, is to show that the differences between orthodoxy and other faiths are real and that they are important. Orthodoxy and Heterodoxy Finding the Way to Christ in a Complicated Religious Landscape, now."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3681.16,"end":3700.4,"speaker":"Fr Stephen De Young","text":"Available as an audiobook@audible.com we're back now with the Lord of Spirits, the Father Andrew Stephen Daemic, the father and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3702.32,"end":3726.32,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second half of the show. We're not taking calls despite what you just heard from the voice of Steve, but we are playing your pre recorded messages. This is a Speak Pipe Palooza episode where we're just answering questions. We got through 10 in the first half and now we're going to roll along with some more. So our first one is from Nathaniel."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3726.48,"end":3804.46,"speaker":"Fr Stephen De Young","text":"Dear Fathers, my question is about the nature of priestly agency during sacramental rites. There was a story recently of a Roman Catholic priest who had been using the phrase we baptize you instead of I baptize you. And in his tradition, evidently this rendered the baptisms invalid. So what is the essence of priestly agency? How does he represent us, the faithful, to God? The issue in this story seems to be about singular versus plural pronoun usage. The we usage might imply that the priest is a figurehead for the congregation, and the I usage might imply that the priest is the singular performer and the congregation are either witnesses or co participants in a secondary or subsidiary role. But both readings can be construed as compatible with the idea that the priest is representing man to God and God to man. Lots of our petitions and prayers have the priests using we language in explicitly priestly functions like litanies, kneeling, prayers, etc. And very few of the sacraments have the priest using I language. In considering this question, I'm struck by how many relevant examples have the priests using the passive voice, baptism, Chrismation, Eucharist, even ordination. So is our conception of the priesthood that much different than the Catholic conception in our tradition? It seems that he's not the focus the way the story implies that he is in the Catholic tradition. Relatedly, what kinds of mistakes can make the sacraments invalid?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3804.62,"end":3882.78,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. All right. I mean, we all, well, probably not all of us, but there was that new story. In fact, this has now popped up two or three times, I think, within the past year or two that I can recall either priests or deacons within the Roman Catholic tradition. And again, it's the same thing using this we language and it being declared by Rome to be invalid, which I, I have to admit, I can't quite understand that because at the same time, Rome has its Eastern rights. Now, they don't tend to use we baptized language. Right? But, but like, like Nathaniel was saying it. And they're using the same language we are. Right, because they're generally are using the same rights we are, which, you know, for instance, the servant of God, John, is baptized in the name of the Father, etc. And you know, the other thing that occurs to me is that baptism by non priests or even deacons is a thing. Like it's considered traditionally to be truly a baptism if it's, if it was necessary, if it, you know, setting all the caveats aside about what constitutes a Valid baptism, you know, it does include the possibility of a layman actually baptizing. So what do you think, Father? The we. The I, who is the priest in the midst of. Of all of this."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3883.42,"end":3887.98,"speaker":"Fr Stephen De Young","text":"Yeah. And. And without resorting to Roman Catholic bashing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3888.46,"end":3893.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, that's not what we're trying to do. But. But yeah, it's an interesting question. Yeah, yeah. They're."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3893.62,"end":3893.9,"speaker":"Fr Stephen De Young","text":"They're."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3893.9,"end":3897.26,"speaker":"Fr Andrew Stephen Damick","text":"They're suffering themselves enough over this that we don't need to add to their suffering."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3897.34,"end":3923.99,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah. I mean, and. And I mean, we have to be honest, there. There is a little absurdity to it. Right. That one word in the English language. Right. Being said differently. You know, in one case, this was a priest who. They watched the videotape of his baptism as a baby, and because that one wrong word was used, he was not a valid priest. And so every sacrament he had ever performed was not valid."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3923.99,"end":3925.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3927.11,"end":3928.39,"speaker":"Fr Stephen De Young","text":"Like retroactively."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3928.55,"end":3940.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it definitely seems to have this very strong focus on the priest himself being a sort of absolute nexus of validity, if that makes any sense."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3940.91,"end":3985.43,"speaker":"Fr Stephen De Young","text":"Right, right. And this. This gets back to actually what we were talking about in the first half a little bit in. In terms of the way in which officium was used in Latin in the West. But so one of the. One of the big changes that comes when you go from Greek to Latin, and that ends up. I don't want to overstate it, but I don't know that you can overstate this. This ends up becoming the. So this one translation thing ends up becoming the source of much of the difference between Western and Eastern Christian theology."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3985.83,"end":3986.23,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":3987.35,"end":4035.43,"speaker":"Fr Stephen De Young","text":"And that is that the. The word in Greek, energia, like the energies. Right. Was. So, for example, in Aristotle, if you read metaphysics, theta, it's in an ontological category. He says energies are right. He has dynamis and eneryea. These are two modes of being or two aspects of being. Right. And energia, by and large, it takes a little while for a Latin translation to be settled on, but ends up being effectuous. The effect produced by something."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4035.59,"end":4041.11,"speaker":"Fr Andrew Stephen Damick","text":"Huh. Because I know there was also. What? Operatio. Isn't that also used?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4042.39,"end":4052.15,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Well, yeah, we can get into operatum. Yeah, yeah, yeah, yeah, man. It's turning into Latin and Greek philology. Day."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4054.15,"end":4054.87,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4055.27,"end":4068.55,"speaker":"Fr Stephen De Young","text":"Operatum ends up getting used in related but other contexts. But operatum, the working is again, is activity. This is a case where it went the other way."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4068.63,"end":4069.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4069.9,"end":4074.14,"speaker":"Fr Stephen De Young","text":"Where what was sort of a reified category."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4074.22,"end":4074.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4074.5,"end":4087.34,"speaker":"Fr Stephen De Young","text":"An ontological category, a category of being energies are. Right. Became a more verbal idea, right? Of working, of producing an effect."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4087.9,"end":4088.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4088.94,"end":4273.45,"speaker":"Fr Stephen De Young","text":"And so you get what you get. And we'll talk about both of these in. In the development of later Western theology related to the sacraments and the priest. The sacraments become effects, right? But the sacraments themselves become what is doing the work, right? Ex opera operatum, right? The. The. The sacrament itself does the work and produces the effect, right? And then as we talked about officium, the priest is that necessary instrument, right. Through which the sacramental effect is worked. And so in the west, they never deny that God is ultimately God is the ultimate minister of the sacrament. Right? Right. Because they're not donatists. Right? So the priest could be a heretic, the priest could be a complete evildoer, he could be an atheist, right? In the Western system, that in and of itself does not affect the validity because he's the instrument, right? He's the through witch. But the sacrament itself does the work. And so the sac. Since the sacrament itself does the work work, if the sacrament becomes incorrect, then it doesn't do the work, right? And so if we ship shift now to the east, right, where we stick with ener. Yea, right. Where we stick with this ontological category which is directly connected to God, right? We're talking about the divine energies, right? In the sacraments. When we talk at the Orthodox Church about every time, place, space, every bit of matter in the universe being potentially sacrament or potentially mystery, right? Potentially the vehicle for the divine energies. That's not just hippie stuff, right? Amen. The whole world's a sacrament. That's not what that's getting at. It's that the divine energies, which are God himself, because it's still an ontological category, is working in and through the mystery, right? So in baptism you have material water, right? And, and God himself is working in and through the water, Right? God is not at the beginning of a chain that passes through the instrumentality of the priest, and then the water itself becomes capable of purifying sin."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4274.97,"end":4282,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it's God doing that work. Which then explains why it is that a layman can theoretically baptize, right? Like."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4282,"end":4287.12,"speaker":"Fr Stephen De Young","text":"Like God himself is in the water purifying from sin, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4288,"end":4294.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not a. The water is not changed to become magical water, right? Yeah, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4294.84,"end":4304.56,"speaker":"Fr Stephen De Young","text":"Well, and again, I don't want. I mean, the term hocus pocus does come from the Latin Eucharist, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4304.56,"end":4313.51,"speaker":"Fr Andrew Stephen Damick","text":"It's. I mean, that's a distortion of understanding. Of that hocus corpus meum. But that is the world in which that distortion arises."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4314.15,"end":4360.55,"speaker":"Fr Stephen De Young","text":"Right, yeah. But again, with the Eucharist, the priest, as that instrument, has the charism, has the power to make it the body and blood of Christ. And then once it is the body and blood of Christ, it performs its function ex opera operatum. Right. It, you know, anyone who receives it will receive the body of Christ. And it's even interesting that in most modern Roman Catholic, it's hard to generalize anymore about Roman Catholicism. It's about as hard as generalizing about Protestantism nowadays. But it's interesting that the whole idea of the Eucharist being dangerous when received unworthily kind of drops out at some point."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4363.38,"end":4363.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4364.74,"end":4378.66,"speaker":"Fr Stephen De Young","text":"But then, because it simply now is the body of Grant, now you get eucharistic adoration. Now you get. Right. But it is now the host itself. Right. Who is. Yeah, so it's objectification."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4379.3,"end":4379.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4379.86,"end":4422.11,"speaker":"Fr Stephen De Young","text":"Right, right. And so that flows out as well as a whole bunch of other things flows out of this move from the understanding of energy. Energy, its relation to dynamics. Right. That comes out of Aristotle and then gets used. Gets picked up by the Greek fathers helpfully to explain not just the knowledge of God, which is where we usually think about it with St. Gregory Palmas, but also the work of God in the world, the holy mysteries, why we don't have a set number necessarily. All of that is part and parcel of that. And. And the role of the Holy Spirit in the Eucharist, all of these things sort of play out from that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4422.43,"end":4427.47,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Okay, so here's our next question. This is from Nicholas."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4429.63,"end":4478.02,"speaker":"Fr Stephen De Young","text":"Hello, Fathers, this is Nicholas Matier, first time caller, longtime listener from San Antonio, Texas. I've got two quick questions. One, during the flood, did the sea creatures also get destroyed? And two, in the Life of St. Columba, a latent teak hagiography from Scotland, they. There's a mention of the Loch Ness Monster. Have you read this? And if. Or. And how does that fit in with monsters and how Columba deals with this monster? Thank you, Fathers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4479.38,"end":4517.94,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty, so. Well, that's fun. I have read the Life of St. Columba, and I, although it's been a long time, and my recollection is that it just mentions him seeing it, but there might be more to it than I'm just simply not remembering, because I think it's been close to 20 years, so I don't know. What do you think, Father? Are sea creatures killed in the flood? If so, then, I mean, if they Were then where do they come from? Right. Because it's not like we don't see Noah with any aquariums on board. On board the ark. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4518.02,"end":4524.41,"speaker":"Fr Stephen De Young","text":"So part of. Part of this is. Is, you know, the king's wife thing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4524.49,"end":4524.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4524.85,"end":4525.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4525.01,"end":4526.37,"speaker":"Fr Andrew Stephen Damick","text":"We're just sort of curious about stuff."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4526.37,"end":4527.77,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4528.17,"end":4530.17,"speaker":"Fr Andrew Stephen Damick","text":"So curiosity, which is understandable."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4530.57,"end":4538.01,"speaker":"Fr Stephen De Young","text":"Yeah. If you want to work on a real material level. Well, I mean, you know, with a flood like that, you're going to get salt and fresh water mixing together."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4538.57,"end":4538.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4539.53,"end":4544.01,"speaker":"Fr Stephen De Young","text":"That would probably wipe out a lot of sea life. There's going to be other environmental factors."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4545.62,"end":4545.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4546.82,"end":4584.19,"speaker":"Fr Stephen De Young","text":"The destruction of habitats for different creatures and stuff. So, I mean. Okay, that's. Yeah. The key, though. The key, though, is that the idea of what's going on in the flood and this becomes really clear if we back up and read Genesis 5, which we don't, because it's a genealogy, and we find those boring, is it becomes clear the prophecy that's given regarding Noah's birth. Right. It's through Noah that God is going to save his creation. And what's he saving his creation from? Humans."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4584.19,"end":4584.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4585.95,"end":4587.15,"speaker":"Fr Stephen De Young","text":"Right. Human evil."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4587.15,"end":4587.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4587.79,"end":4602.39,"speaker":"Fr Stephen De Young","text":"Right. So the goal of the flood was not to wipe out all the creatures, it was to wipe out all the humans. And Noah takes the animals to save the other creatures."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4603.43,"end":4603.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4603.99,"end":4614.79,"speaker":"Fr Stephen De Young","text":"Who weren't responsible. Right. So even if all the sea creatures survived, that's fine. The sea creatures weren't the ones painting the world with their evil and wickedness."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4615.11,"end":4615.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4616.39,"end":4619.51,"speaker":"Fr Stephen De Young","text":"A few of them, you know, Leviathan and stuff. But I mean, other than that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4620.63,"end":4623.49,"speaker":"Fr Andrew Stephen Damick","text":"So what about the Loch Ness Monster, then? And Saint Columbus?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4623.57,"end":4626.13,"speaker":"Fr Stephen De Young","text":"No matter how much he asks, don't give him the 350."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4629.01,"end":4675.13,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. Yeah. I mean, there is stuff, you know, if you read like Saint Columba and Saint. A lot of the Celtic saints, there's a whole lot of stuff about facing off against demons and this kind of stuff. I've actually been to the place to where Saint Columba supposedly saw the Loch Ness Monster, which is, you know, Loch Ness, which is in northern Scotland. There's a castle right there, actually, Urquhart Castle, where he. Although the castle, I think is much later than he was, but the location is where he cured. I think it was King Brood was the name of the. The pagan king that he cured of a disease and then converted him to Christianity. So I don't know. It's my. My memory of his. The Loch Ness Monster stuff."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4675.13,"end":4675.17,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4675.24,"end":4678.76,"speaker":"Fr Andrew Stephen Damick","text":"And Saint Columba is kind of murky, so I. I just don't know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4678.76,"end":4679.52,"speaker":"Fr Stephen De Young","text":"Not intended."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4679.52,"end":4684.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Pun fully now intended, now that you mentioned. Yeah, but."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4684.12,"end":4690.44,"speaker":"Fr Stephen De Young","text":"Oh, yeah. So, I mean, in general. In a general sense, it's important that we don't take sort of a naturalistic read of these things."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4690.44,"end":4691.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4691.56,"end":4700.12,"speaker":"Fr Stephen De Young","text":"Sorry, Ken Ham. So, like, when. When the Loch Ness monster or another sea creature monster shows up at a certain. It's not a plesiosaur that survived."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4700.36,"end":4704.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I don't know, but locks are really deep. Father. Come on."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4704.7,"end":4715.82,"speaker":"Fr Stephen De Young","text":"It's not what it's aimed at. Right. So usually. And again, I'm not super familiar with the details because other than Dr. Who, I'm not that much of an Anglophile. Sorry, guys."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4717.42,"end":4719.66,"speaker":"Fr Andrew Stephen Damick","text":"It's Scotland, not England, Father."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4720.46,"end":4723.22,"speaker":"Fr Stephen De Young","text":"Oh, sorry. See, that shows you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4723.22,"end":4723.94,"speaker":"Fr Andrew Stephen Damick","text":"That just shows you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4723.94,"end":4724.7,"speaker":"Fr Stephen De Young","text":"Yeah, I should."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4724.7,"end":4726.83,"speaker":"Fr Andrew Stephen Damick","text":"I should have known that Saint Columba himself was our."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4727.94,"end":4735.7,"speaker":"Fr Stephen De Young","text":"Yeah, well, the Scots and the Dutch have a bitter rivalry. Who's stingier and more Calvinist?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4738.02,"end":4742.34,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Tough but fair."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4747.06,"end":4762.02,"speaker":"Fr Stephen De Young","text":"The idea is generally that the saints are confronting sort of the demonic powers and the powers of chaos and so stuff that are resident in these lands that they're coming to with the Gospel. Yeah, in a general sense."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4762.02,"end":4767.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, well, speaking of Noah and his flood, here's a question from someone named Noah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4767.38,"end":4790.03,"speaker":"Fr Stephen De Young","text":"I have a question about the Divine Liturgy. I know it's been mentioned before that it is a kind of liturgical apocalypse, and that at least the first half has its origins in the liturgical worship of the Temple and the synagogue. But given that the synagogue doesn't really show up until after the Babylonian captivity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4790.35,"end":4792.35,"speaker":"Fr Andrew Stephen Damick","text":"And isn't really mentioned much in the."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4792.35,"end":4800.99,"speaker":"Fr Stephen De Young","text":"Old Testament, what are kind of the origins of the synagogue and how or why it was sanctioned by God when."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4800.99,"end":4803.71,"speaker":"Fr Andrew Stephen Damick","text":"He had previously said that worship was."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4803.71,"end":4805.71,"speaker":"Fr Stephen De Young","text":"To be conducted at the Temple only?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4806.35,"end":4810.87,"speaker":"Fr Andrew Stephen Damick","text":"All right, so what's the origin of the synagogue, and how does that relate to the Temple and Orthodox worship?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4811.75,"end":4817.59,"speaker":"Fr Stephen De Young","text":"Yeah, well, so remember, in terms of worship only happening at the Temple, we're talking about sacrifice."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4818.71,"end":4820.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. No sacrifices at synagogues."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4821.27,"end":4825.27,"speaker":"Fr Stephen De Young","text":"Right, no sacrifices at synagogues. Now the Temple and Elephantine Island."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4827.03,"end":4827.43,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4830.63,"end":4894.07,"speaker":"Fr Stephen De Young","text":"But there weren't sacrifices at the synagogue. Right. That's why when we're talking about the synagogue service, we're talking about, like, the first part of the Divine Liturgy with the scripture readings, singing of psalms. Right. And I mean, the. The. The origin of that is the Jewish Diaspora. Right. So you have the end of the Babylonian exile, but you only have a small segment of the Jewish community that actually comes back to Judea. Right. There's a Massive Jewish population still in Mesopotamia. There's a massive Jewish population in Egypt, where they fled before the exile. And then you get. As time goes on, you get Jewish families resettling and communities rising up sort of all around the Mediterranean and then points further east. And so during the exile, of course, they didn't have a temple, and so there had to be sort of certain accommodations."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4894.92,"end":4895.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4895.16,"end":4953.49,"speaker":"Fr Stephen De Young","text":"And those were not easy accommodations. Right. How can we sing the songs of Zion here in a foreign land? Right, right. But those accommodations get made. Right. Because, again, not everybody goes back. And so synagogue is literally a gathering place. It's the place where the Judean community in any given place begins to gather. Right. And they can read their. Their sacred texts. They can. They can talk about and apply them in their lives. They can sing psalms. Right. They can encourage each other and function as a community within whatever place they're in. Right, right. They are sort of a nation within a nation. And that then creates this idea that there is that Judeans that we translate as Jews includes people who may have never set foot in Judea in their life."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4953.57,"end":4955.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4955.17,"end":4959.65,"speaker":"Fr Stephen De Young","text":"Because they're part of that nation. Right. Because that synagogue is sort of an outpost of that nation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4959.97,"end":4969.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, as I say, does a synagogue then function in some ways as a kind of community, elevated form of the private prayer that people would be doing at their homes anyway?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4970.69,"end":4971.17,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4971.41,"end":4971.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4971.89,"end":4995.38,"speaker":"Fr Stephen De Young","text":"Yes. But doing it. Doing it together. Yes. And so that model gets brought directly over into the church. That's how the early Christians understand themselves. They understand themselves as a nation and a people that's not based on or tied to one particular piece of land in which they all live. They're all over the place. But they are the race of Christians."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4995.54,"end":4995.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":4995.9,"end":5019.95,"speaker":"Fr Stephen De Young","text":"They are a people. And so wherever they're living, they, as a people, gather together right around a place of worship. And so all of those are sort of embassies of a nation that doesn't have land in this world, per se. Sorry. Vatican City."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5022.75,"end":5026.5,"speaker":"Fr Andrew Stephen Damick","text":"All right, so that said, here is a question from Patrick."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5028.33,"end":5048.41,"speaker":"Fr Stephen De Young","text":"Greetings, Fathers. This is Patrick from Cheyenne, Wyoming. I have a question regarding Asherah. As Yahweh's wife or consort. This was something that was brought to my attention by a deconstructing Christian as a proof against most biblical claims. I'd like to hear your opinion. Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5049.05,"end":5058.94,"speaker":"Fr Andrew Stephen Damick","text":"All right. This is one we've heard before. So is Asherah Mrs. Yahweh? Where does that come from? Is there any validity to it? No, no. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5060.38,"end":5087.74,"speaker":"Fr Stephen De Young","text":"But yeah, just to just lay this out briefly, there's an inscription that was found that is generally translated into English, especially translated this way when it's going to be weaponized by your village atheist type as referring to Yahweh and his Asherah. Right. And they say, oh, well, Asherah, right. This is Baal's wife."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5087.74,"end":5087.98,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5087.98,"end":5102.82,"speaker":"Fr Stephen De Young","text":"Oh, see, polytheism, they. They thought Yahweh was married. Right. So first of all, even if that were true, as we've said a thousand times, if you actually read the Old Testament."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5103.7,"end":5104.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5105.47,"end":5108.35,"speaker":"Fr Stephen De Young","text":"Most of the Judeans and Israelites were a bunch of pagans."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5108.51,"end":5130.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I was just reading the end of Joshua recently, and it's notable in there. It says basically in Joshua dies, or maybe it's the beginning of Judges. And it says, and essentially the people of Israel did not know the Lord their God, and they fell into idolatry. And they kept falling into idolatry. It's very. Yeah. Very, very explicit in that regard."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5130.6,"end":5137.44,"speaker":"Fr Stephen De Young","text":"Right. So even if that is what the inscription said, wow, you found an Israelite who was a syncretist."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5137.44,"end":5137.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5137.96,"end":5139,"speaker":"Fr Stephen De Young","text":"Shock horror."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5139.08,"end":5140.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5142.2,"end":5192.38,"speaker":"Fr Stephen De Young","text":"Why that inscription would be taken to be an official statement of the religion of the entire people. I don't know how you get there. Right. That's number one. But number two, that's not even what it says. So. And this is. I don't want to get too technical, but asherot, the way it's actually written, that particular way of spelling it, essentially of writing the word is never used for the goddess. Right. So it takes a whole bunch of special pleading that doesn't really work to try to get that to be about the goddess. Because that same word is used to refer. Conjugated exactly that way, including in the Old Testament, to refer to ritual poles."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5192.54,"end":5193.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5193.42,"end":5204.06,"speaker":"Fr Stephen De Young","text":"These ritual poles, usually wood or stone, sometimes deliberately phallic, that were used for ritual purposes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5204.94,"end":5205.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5205.58,"end":5219.48,"speaker":"Fr Stephen De Young","text":"So what the inscription actually refers to is Yahweh and his ritual pole, or tree. And again, wow, you discovered an Israelite who was worshiping Yahweh incorrectly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5220.04,"end":5220.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5220.68,"end":5223.56,"speaker":"Fr Stephen De Young","text":"Just like the Old Testament tells us they almost all did."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5224.68,"end":5231.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. So there you go. That's quick and easy. Okay, this next one comes from our friend Pedro."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5233.08,"end":5234.12,"speaker":"Fr Stephen De Young","text":"Fathers, bless."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5234.32,"end":5237.6,"speaker":"Fr Andrew Stephen Damick","text":"This is Pedro Sarsama phoning it in from Icewind Dale."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5238.88,"end":5245.04,"speaker":"Fr Stephen De Young","text":"I have a question about baptism and possibly an interaction with sacred geography, although."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5245.04,"end":5246.4,"speaker":"Fr Andrew Stephen Damick","text":"That'S my own speculation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5248.88,"end":5269.03,"speaker":"Fr Stephen De Young","text":"In the Didachi and in early Christian texts, apart from that, and in our own canonical tradition, the preference is given to immersion with an allowance for pouring of water, where immersion is not Feasible. Moreover, early texts specify immersion in living water in running water and then give."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5269.27,"end":5271.27,"speaker":"Fr Andrew Stephen Damick","text":"Collected water as kind of an allowance."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5271.91,"end":5293.04,"speaker":"Fr Stephen De Young","text":"This is also found in early Jewish texts when discussing ritual washing. One thing that I'm curious about is the temperature of the water in the didachi. It says to use cold water rather than warm water. And so I'm wondering if you could speak to why that might be. I don't know if any other texts."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5293.04,"end":5300.72,"speaker":"Fr Andrew Stephen Damick","text":"Address the temperature of the baptismal font. I haven't finished reading the 2000 page."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5300.72,"end":5303.28,"speaker":"Fr Stephen De Young","text":"Ablution, initiation and Baptism in Late Antiquity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5303.28,"end":5305.2,"speaker":"Fr Andrew Stephen Damick","text":"Early Judaism and Early Christianity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5306.08,"end":5320.65,"speaker":"Fr Stephen De Young","text":"So maybe the answer is there. But I'm curious about this specifically from an Orthodox Christian perspective and one that is informed from a sacramental, non materialist worldview."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5320.81,"end":5342.2,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right. So why is baptismal water traditionally cold? I mean, I remember that from the Didaki. Although, I mean, frankly, most Orthodox churches you go to these days, if you were to stick your hand in the font, usually they've made it warm. Don't want to shock the baby, I think is sort of the idea. Although it's kind of a shocking thing to do to a baby anyway."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5342.2,"end":5344.44,"speaker":"Fr Stephen De Young","text":"But, yeah, I don't even try. It's just cold."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5344.44,"end":5348,"speaker":"Fr Andrew Stephen Damick","text":"It's just cold. Yeah. Why is it so it specifies cold, though. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5348.88,"end":5363.94,"speaker":"Fr Stephen De Young","text":"Let me also say I hope Pedro was not cosplaying as Drizzit when he made that call, because otherwise we're going to get canceled, like Community. And we don't need that we get canceled. I want it to be for something I said live, not for that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5365.05,"end":5374.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, if they've read Icewind Dale, if they read that stuff, then they probably are okay with. If you haven't, don't bother everybody. But yeah. So why is it cold? What's the deal?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5375.61,"end":5379.21,"speaker":"Fr Stephen De Young","text":"So this is conjecture on my part."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5379.29,"end":5379.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5380.33,"end":5392.51,"speaker":"Fr Stephen De Young","text":"Right. And I'm going to say that because I don't think anybody actually knows, but my bias is I always assume a pragmatic explanation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5393.47,"end":5394.03,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5394.35,"end":5404.03,"speaker":"Fr Stephen De Young","text":"Because what I found tends to happen in churches is that something is done for a pragmatic reason and then over time, sort of spiritualized reasons develop as urban legends."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5404.27,"end":5405.39,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5405.95,"end":5430.68,"speaker":"Fr Stephen De Young","text":"Like fanning the gifts was mainly to keep insects away, Right. Originally. Right. So my surmise would be that this is related to the running water thing. Right. Because spring water that's just coming up out of the ground is usually cold unless you're at a specific hot spring. Right. And when you're at a hot spring, those are usually stagnant pools."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5431.08,"end":5431.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5432.36,"end":5442.12,"speaker":"Fr Stephen De Young","text":"And warm stagnant pools breed bacteria, whereas cold running spring water does not so much."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5444.69,"end":5482.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and. And, you know, the. The capability that we now have of simply turning on the faucet and getting water from a water heater was not. So, I mean, they couldn't. Certainly could heat water. Right. It's not like they couldn't do that. But I know, for instance, that a lot of early baptismal fonts were cut into the ground and connected to aqueducts. Right. So if you took the lid off, there's always, you know, this water is flowing through it, you know, all the time. So you step down into it and you're basically in a kind of redirected river, you know, much like the Jordan. Not redirected, but it is a river."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5482.52,"end":5488.4,"speaker":"Fr Stephen De Young","text":"Yeah, but the context in which that rule comes is talking about which water source you should choose."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5488.64,"end":5490.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5490.04,"end":5493.84,"speaker":"Fr Stephen De Young","text":"And so that's how I'm interpreting it, but it's conjecture on my part."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5494.49,"end":5501.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so it's a guess. All right, well, this next one is from another friend of this show, and that's Michael Landsman."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5501.93,"end":5506.41,"speaker":"Fr Stephen De Young","text":"Hey, Father Stephen, Father Andrew, Reverend Mike Landsman here."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5506.49,"end":5507.93,"speaker":"Fr Andrew Stephen Damick","text":"I have a question for you about."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5507.93,"end":5516.73,"speaker":"Fr Stephen De Young","text":"The temptation of Jesus in the Gospel of Luke. I was reading the ancient Christian commentary on Scripture, and the selection from Origen."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5516.73,"end":5519.81,"speaker":"Fr Andrew Stephen Damick","text":"Talks about the devil trying to tempt."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5519.81,"end":5522.65,"speaker":"Fr Stephen De Young","text":"Jesus because he doesn't know that Jesus."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5522.65,"end":5526.43,"speaker":"Fr Andrew Stephen Damick","text":"Is the Son of God. Origen takes this to mean that Jesus."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5526.43,"end":5528.35,"speaker":"Fr Stephen De Young","text":"Is a son of God."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5528.35,"end":5529.35,"speaker":"Fr Andrew Stephen Damick","text":"So I was wondering if there's a."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5529.35,"end":5534.19,"speaker":"Fr Stephen De Young","text":"Textual issue there with the Gospel of Luke. And they also wanted to know if there's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5534.19,"end":5555.15,"speaker":"Fr Andrew Stephen Damick","text":"If Origen was onto something or if this is just some speculation. In other words, Jesus was just a man who had power from God. And so the devil is using the temptation to sort of get him to tip his hand or to get him to identify himself. Wanted to know what you thought about that. Thanks so much for taking my question."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5555.79,"end":5557.79,"speaker":"Fr Stephen De Young","text":"And I look forward to hearing the answer."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5558.27,"end":5589.99,"speaker":"Fr Andrew Stephen Damick","text":"All right. So, yeah, I guess the question partly is what does the devil think? Who does the devil think that Jesus really is? Does he realize he's truly the Son of God or that he's just some kind of elevated whatever? I mean, I always had the impression that the devil knew who he truly was because whenever Christ encounters demonic beings, they call him the Son of the Most High. So often. Not every time, but they often do. So, I mean, what's going on here, Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5590.23,"end":5593.99,"speaker":"Fr Stephen De Young","text":"Yeah. So in response to noted originist Michael Landsman."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5595.59,"end":5596.47,"speaker":"Fr Andrew Stephen Damick","text":"No, he's not."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5597.99,"end":5636.1,"speaker":"Fr Stephen De Young","text":"He's calling to talk about Origin. Wow. The. Yeah, so I. I think origin is just wrong on this one. And I think the best piece of evidence of that is there's this kind of funny bit that people don't notice that where he mentions that, you know, you shall not allow your foot to be dashed against the stone. Right. He quotes a couple verses from a psalm and he skips one."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5637.06,"end":5637.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5638.5,"end":5643.14,"speaker":"Fr Stephen De Young","text":"The one he skips is about stomping on serpents and scorpions."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5646.42,"end":5647.06,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5648.26,"end":5658.03,"speaker":"Fr Stephen De Young","text":"And so he literally skips the part about, like, Christ stomping on him in his quotation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5658.43,"end":5661.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5662.19,"end":5665.31,"speaker":"Fr Stephen De Young","text":"So that implies to me that he kind of knows who he's talking to."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5665.63,"end":5666.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5669.71,"end":5696.72,"speaker":"Fr Stephen De Young","text":"Yeah, a lot of times I think the don't put the Lord your God to the test there gets misinterpreted, too. That's less like, yeah, I could jump off this building and God would save me, but, you know, I'm not going to, what, check? Right. Like, Jesus is God. Right. Like what? Yeah, that's more like, don't test me."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5698.16,"end":5701.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5702.24,"end":5711.71,"speaker":"Fr Stephen De Young","text":"Yeah. So I think that exchange shows that both Christ and the devil know who they respectively are."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5712.03,"end":5720.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. Okay. All right, well, this next one is from Stephen. Hello, Fathers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5720.23,"end":5721.79,"speaker":"Fr Stephen De Young","text":"My name is Stephen, and I'm calling."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5721.79,"end":5723.07,"speaker":"Fr Andrew Stephen Damick","text":"From Edinburgh in Scotland."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5723.39,"end":5724.35,"speaker":"Fr Stephen De Young","text":"This is my question."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5724.35,"end":5732.47,"speaker":"Fr Andrew Stephen Damick","text":"In the Torah, the death penalties imposed on those who commit certain grave sins, or more broadly, to purify the community and the land from the contamination of."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5732.47,"end":5734.19,"speaker":"Fr Stephen De Young","text":"Sin, as in the case of the."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5734.19,"end":5736.83,"speaker":"Fr Andrew Stephen Damick","text":"3,000 men killed by the Levites in Exodus 32."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5737.64,"end":5741.48,"speaker":"Fr Stephen De Young","text":"In contrast to this, the death penalty is not imposed in the New Testament Church."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5742.04,"end":5756.32,"speaker":"Fr Andrew Stephen Damick","text":"True, there are instances where God causes the death of certain people. As Ananias and Sapphira. There is acknowledgement that the state might exercise power over life and death, and the Church exercises the power of excommunication, which, following a certain kind of death."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5756.32,"end":5758.44,"speaker":"Fr Stephen De Young","text":"Is one intended to lead to the sinner's repentance."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5759.16,"end":5766.57,"speaker":"Fr Andrew Stephen Damick","text":"Please correct me if I'm mistaken in any of this. My question is, then what has changed? Which means that now the Church no."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5766.57,"end":5769.01,"speaker":"Fr Stephen De Young","text":"Longer imposes the death penalty, does it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5769.01,"end":5781.01,"speaker":"Fr Andrew Stephen Damick","text":"Have anything to do with the Christ making true repentance and transformation of the human person possible? Thank you, and I look forward to hearing your answer. All right, so the question is, why does the Church not impose the death penalty?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5782.13,"end":5784.93,"speaker":"Fr Stephen De Young","text":"So, first of all, Stephen, I'm sorry about that Loch Ness thing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5786.69,"end":5791.27,"speaker":"Fr Andrew Stephen Damick","text":"He's not in that part of Scotland. He's in Edinburgh. So those are upcountry people."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5791.27,"end":5792.27,"speaker":"Fr Stephen De Young","text":"Did I just do it again?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5792.35,"end":5803.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, they're in Scotland, but it's another part of Scotland. Yeah, you have to go up to Inverness in that area if you want to go see Loch Ness."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5803.47,"end":5805.07,"speaker":"Fr Stephen De Young","text":"Okay. But it's not that big, man."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5805.07,"end":5805.59,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5805.59,"end":5807.27,"speaker":"Fr Stephen De Young","text":"But I've lived in California and Texas."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5807.27,"end":5809.39,"speaker":"Fr Andrew Stephen Damick","text":"It's a train ride. Okay, well, it is a train ride."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5809.39,"end":5819.55,"speaker":"Fr Stephen De Young","text":"But it's not in the neighborhood. So the. The death penalty is actually imposed by the church."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5819.79,"end":5821.23,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5824.59,"end":5838.11,"speaker":"Fr Stephen De Young","text":"But part of it has to be how we understand what's going on with death penalties in the Old Testament. Right. So the first thing is that the language that's most often used is that that person is to be cut off from among the people."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5838.35,"end":5839.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5839.15,"end":5902.63,"speaker":"Fr Stephen De Young","text":"Right. And it's sort of ambiguous whether that means death or exile. Right. And the reason why that's ambiguous is that those are seen as sort of the same thing. And the reason they're seen as sort of the same thing goes back to Genesis 3. Right. Because what is death? Death is being cut off from the tree of life. Right, Right. So I know I've cited this before on the show, but St. John of Damascus, Physical death is the separation of the soul from the body. Spiritual death is the separation of the soul from God. Right. And so we tend to get that backwards. We act like physical death, that's real death, and then spiritual death is like metaphorical death. Right. And in actuality, real death is being separated from God. Right. Physical death is metaphorical death."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5903.11,"end":5904.71,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5906.87,"end":5914.79,"speaker":"Fr Stephen De Young","text":"Because what does Christ say? Life is to know the only true God and Jesus Christ whom he has sent."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5914.79,"end":5915.59,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5915.59,"end":5946.51,"speaker":"Fr Stephen De Young","text":"So to not know them is. Is death. That's real death. So every time someone is excommunicated, every time someone is put outside the church, that's the death penalty. And St. Paul uses that language about it. You're turning them over to Satan for the destruction of their body and the salvation of their soul. Destruction of the body and salvation of the soul, that's death. Separation of the soul from the body."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5948.19,"end":5948.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5949.95,"end":5971.72,"speaker":"Fr Stephen De Young","text":"So the real death penalty is applied, but it is applied, as was just suggested by that quote from St. Paul, remedially. The idea is not the total destruction of the person. The idea is that is the ultimate act. To drive someone to repentance."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5971.72,"end":5973.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To bring them to life."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5974.28,"end":5976.2,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5976.93,"end":5982.45,"speaker":"Fr Andrew Stephen Damick","text":"All right. Okay, so this next one is from yet another of our several bends."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":5983.01,"end":6004.87,"speaker":"Fr Stephen De Young","text":"Father's Bless. Somewhere in the ancient Fates cinematic universe, I encountered the recommendation to read Laurie Branch's Rituals of Spontaneity. And I'm working my way through it, but I don't think I'll be done before the episode. So I wanted to ask, what is the role or place of spontaneity in the orthodox Christian life? I'm."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6004.95,"end":6005.43,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6005.43,"end":6036.69,"speaker":"Fr Stephen De Young","text":"It seems that the. Maybe modern spirituality is almost deliberately schizophrenic as I'm reading this book and not entirely certain how to maybe reframe spontaneity, as it doesn't seem to be like, the chief hallmark of a life led by the Holy Spirit, which is kind of the basic understanding that came with me as a Protestant who's seeking to become Orthodox. So, I don't know, it seems that there's like a primarily economic lens of spirituality that needs abandoned. And I was curious if you could comment on that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6037.01,"end":6059.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so the book that he's mentioning is Laurie Branch's Rituals of Spontaneity. And Laurie is actually an orthodox Christian. She's a professor out in Iowa. And the book is essentially. Essentially shows the rise within Protestantism of the idea that spontaneity equals authenticity."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6060.13,"end":6060.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6060.33,"end":6097.53,"speaker":"Fr Andrew Stephen Damick","text":"And so then the truest prayers to God are the ones that come from the heart. And from the heart is understood as being about unrehearsed spontaneity. Right. Just sort of comes out of nowhere, apparently. And so Ben is asking, is that a thing within orthodox Christianity? Is there any role for spontaneity in the orthodox Christian life? And it's an interesting book, everybody, by the way. I mean, it's. It's her doctoral dissertation, you know, put published as a book. So, you know, don't expect it to be a super, super light read. That's not what it is. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6097.85,"end":6099.29,"speaker":"Fr Stephen De Young","text":"Buzz through it in an afternoon."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6099.69,"end":6110.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly. Maybe you. But, you know, it's. It's fascinating because this, like, this idea, this assumption is so built into our modern Western consciousness."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6112.02,"end":6112.18,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6112.18,"end":6132.42,"speaker":"Fr Andrew Stephen Damick","text":"That spontaneity equals authenticity. But she shows how that idea has a beginning and then, you know, kind of makes its way into Christian worship within Protestantism. So what do you think, Father? I mean, orthodox Christian worship is certainly anything but spontaneous. I mean, we open books and do what it says in the book. Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6133.94,"end":6149.26,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I'm reminded of the words of a former professor of mine who I won't identify, but who once said to confuse spontaneity with the Holy Spirit is strictly speaking, a heresy."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6152.86,"end":6156.14,"speaker":"Fr Andrew Stephen Damick","text":"But. Well, all right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6157.9,"end":6176.28,"speaker":"Fr Stephen De Young","text":"Just strictly speaking. But that's related to what St. Paul says, right. The Holy Spirit is not a spirit of sort of chaos and disorder, but of order. Right, right. And Putting things in good order. That is what creation is, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6176.52,"end":6177.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6178.12,"end":6190.77,"speaker":"Fr Stephen De Young","text":"That's important because our culture and society has very much the opposite view. We view creativity as being this sort of chaotic activity, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6190.77,"end":6191.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6191.49,"end":6245.25,"speaker":"Fr Stephen De Young","text":"That's even a rebellious activity, right. You've got to break away, right? That, that's when you're being really creative, right? Is when you're sort of like outside all the fences and all the boundaries, right. It's when you're innovating, Right. And that, strictly speaking, again, is not creativity, right? You're not creating when you do that, right? Strictly speaking, you're destroying. Destroying something that previously existed. You're deconstructing it, right. You're breaking it down, you're. You're twisting it around. And that, strictly speaking, is what evil is. But the idea is if creating something is putting it in order, and that putting it in order creates things like beauty."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6247.47,"end":6247.71,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6247.95,"end":6280.46,"speaker":"Fr Stephen De Young","text":"And, and goodness and wholeness, then if those are the things we're pursuing as orthodox Christians, right? Being put in right order, being justified, right? Being put in right order, putting the. The world around us in order, we're pursuing beauty, we're pursuing what is good, we're pursuing wholeness. Then the way we would pursue that is not through a kind of chaotic breaking of boundaries, but through. Through good order."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6280.78,"end":6348.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but I mean, isn't there a difference between. I mean, so there is a spontaneity that is, like you said, a chaotic breaking of boundaries. But isn't there also a spontaneity, for instance, if someone is just suddenly filled with joy, right? And they. I mean, don't we see this in Scripture, where, where you know, now clearly, when Saint Elizabeth meets the Theotokos, she's quoting, quoting from the Old Testament, who am I that the mother of my Lord should come to me? Well, paraphrasing, I should say, right. But still, I mean, you get the impression of. That there is something spontaneous about it, right? That there's this sudden response of joy, which is not the same thing as, now, let's gather on Sunday morning and do worship, right? Or you're just sort of within that sponge. It's so funny to me actually, though, that. That even within the kind of realms of Protestantism that really value spontaneity and worship, they still gather at specific times and there still tends to be some kind of schedule and an order of worship. Now we're going to do this. And now we're going to do this. So I don't know. I mean, I think that there's different modes, maybe of spontaneity. Does that make sense?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6349,"end":6349.88,"speaker":"Fr Stephen De Young","text":"Well, but that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6350.28,"end":6350.68,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6352.68,"end":6359.76,"speaker":"Fr Stephen De Young","text":"Categorizing, for example, that as spontaneous implies that St. Elizabeth is the actor."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6360.24,"end":6362.72,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. So God is working through her. Well."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6363.12,"end":6364.72,"speaker":"Fr Stephen De Young","text":"Or she is having an experience."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6365.28,"end":6367.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but is that what would be."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6367.48,"end":6374.16,"speaker":"Fr Stephen De Young","text":"Spontaneous from her perspective? Because it was not expected, unexpected. Right. Like the Holy Spirit rushing upon a person."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6374.56,"end":6376.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because it says she was filled with the Holy Spirit."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6376.64,"end":6399.13,"speaker":"Fr Stephen De Young","text":"Right. Or Isaiah suddenly having a vision. Right. Or any prophet. Right. Having a vision all of a sudden. Right. And then they're reacting and responding to it in the moment. Right. But I don't know that that's the same thing as in prayer or in song, riffing off the top of your head."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6399.21,"end":6414.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because I think that's the thing is. Is that those who do that would probably say in good faith, you know, like, really believing that that's what's happening is the Holy Spirit is. Is prompting them. But."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6414.32,"end":6418.76,"speaker":"Fr Stephen De Young","text":"And that's where that heresy thing comes in, right? Yeah, no, but that's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6418.76,"end":6419.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6419.12,"end":6433.35,"speaker":"Fr Stephen De Young","text":"The reason. The reason a strong word like heresy would be used is you're attributing then whatever you're saying or doing to the Holy Spirit, to God himself, self."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6433.67,"end":6434.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6434.71,"end":6451.91,"speaker":"Fr Stephen De Young","text":"And how many times I know you've had this happen. How many times have you heard someone get up to speak in one of those contexts and say, hey, I was going to talk about something totally different, but the Holy Spirit just laid it on my heart to say this instead? And then they say a bunch of erroneous stuff."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6452.63,"end":6453.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6453.75,"end":6457.07,"speaker":"Fr Stephen De Young","text":"Stuff that is just objectively not true about the Bible or whatever."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6457.07,"end":6457.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6457.83,"end":6468.92,"speaker":"Fr Stephen De Young","text":"And they've now taken their own personal opinions, their own personal failings of study and research and attributed them to God himself."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6469.32,"end":6469.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6470.12,"end":6479.16,"speaker":"Fr Stephen De Young","text":"Right. That is, if we stop to think about it, blasphemous and worthy of that kind of strong language."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6479.24,"end":6479.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6479.64,"end":6494.45,"speaker":"Fr Stephen De Young","text":"So I would not be so quick to attribute my present emotional state or whatever thoughts are coming into my head at this moment. I would be very circumspect about attributing those to God himself in any situation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6494.77,"end":6496.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6496.37,"end":6499.33,"speaker":"Fr Stephen De Young","text":"So complete lack of discernment there, right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6499.97,"end":6505.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Okay. Well, so here's one from. Actually, it's two from Svetlana."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6505.89,"end":6512.53,"speaker":"Fr Stephen De Young","text":"Man, the Pentecostals aren't gonna like me. Hi, Fathers. Thank you for this podcast and for the opportunity to ask questions."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6512.9,"end":6513.98,"speaker":"Fr Andrew Stephen Damick","text":"I'm not sure if I can ask."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6513.98,"end":6591.54,"speaker":"Fr Stephen De Young","text":"Two questions, but one question is my own, and another one came from my adult son, who unfortunately can't ask it himself due to the time difference. So he delegated me to do it. He moved to Russia and is currently living then he's a student at the St. Petersburg Orthodox Theologian Academy. So here's my son's father. De Young has said that the ancient peoples to whom the Bible was written would not have understood it as either a literal history or a pure allegory. But if that is the case, how can we as modern people correctly apprehend the Bible? How can we conceptualize that liminal space between history and allegory? And is it accessible to modern people who are not biblical scholars? And my second question, as I said, is my question. In the Queen Stood By Thy Right Hand podcast, it was stated that although the mother of God is, is at the same time his daughter, because he has been the God since the beginning and before that. But following this line of reasoning, it seems to appear that Jesus could be his own son also because he had always existed. Right. Does it make any sense or do you have any comments? Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6592.26,"end":6598.52,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, I'm going to tackle that second one myself, and you can actually me if need be."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6599.32,"end":6600.4,"speaker":"Fr Stephen De Young","text":"I've got one ready to go."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6600.4,"end":6664.54,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right. So I would say this. So I mean, we do certainly speak of the Theotokos as being the daughter of God. We also speak of her as being the bride of God and the mother of God. Right? But the sense in which she is each of those things is not the same sense. Right? So Jesus is her son, and there's a sense in which God is also her father. But the way in which Jesus is her son and the way in which God is her father are not the same way. So for someone to be like, I mean, she didn't put it this way, but like, is Jesus his own grandfather? That would imply that the relationships all along the line are exactly the same kind of relationship. Right. And that's not what is being said by this at all. And indeed, when we, for instance, refer to the Theotokos as the bride of God, we don't mean the same way in which, you know, my wife is my bride. Right. There's. There's something analogous there, but it's not the same thing. Exactly. So I don't know any. Actually, you need to apply to that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6665.1,"end":6674.46,"speaker":"Fr Stephen De Young","text":"Well, there was a. Back in the early days of the Internet, days of yore, there was a filk. People don't even know what that is anymore."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6674.46,"end":6679.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, yes, I know what a filk is. F I I L K. Look it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6679.13,"end":6684.25,"speaker":"Fr Stephen De Young","text":"Up, everybody about, about time travel called I'm my own Grandfather."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6684.33,"end":6699.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Well, there's an old. Yeah, there is an old. There was a song from I think the 70s called I'm My Own Grandpa, which is like some kind of comedy country song or something like that. Yeah, but that's about, I think that's another thing. Yeah, right, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6701.05,"end":6711.4,"speaker":"Fr Stephen De Young","text":"But. Right. So, yeah, it is, as you said, a different thing. Senses. And this daughter of God language is related to the sun language we were talking about earlier. It's your imaging language."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6711.4,"end":6712.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6714.4,"end":6717.36,"speaker":"Fr Stephen De Young","text":"Yeah. And in terms of in what frame should we take the Bible?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6717.52,"end":6719.16,"speaker":"Fr Andrew Stephen Damick","text":"Yes. That's kind of the bigger question here."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6719.16,"end":6722.48,"speaker":"Fr Stephen De Young","text":"I think I haven't told you this yet, but I'm telling everyone."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6722.64,"end":6724.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow. This is the world premiere of this thought."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6725.44,"end":6731.21,"speaker":"Fr Stephen De Young","text":"Yes. Next episode, how to and how not to Read the Bible. Bible."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6731.21,"end":6733.69,"speaker":"Fr Andrew Stephen Damick","text":"There you go, everybody. It's going to be exciting."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6733.69,"end":6739.85,"speaker":"Fr Stephen De Young","text":"So we're going to. We're going to. Yeah. And I am impressed by the use of the term liminal space."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6740.73,"end":6743.37,"speaker":"Fr Andrew Stephen Damick","text":"Well, he is a theological student, so. Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6743.69,"end":6748.17,"speaker":"Fr Stephen De Young","text":"But yeah, we're going to get in there to that liminal space. Next time on Lord of Spirits."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6748.17,"end":6765.86,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. So. All right. Well, that's a little bit of a punt, but it'll be next time. So it's just a couple of weeks. Yeah, it's very short, but just a couple of weeks away there, Svetlana's son. So just hold on. Okay, so before we go to break, we have one more question, and this is from Tyler."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6768.1,"end":6769.06,"speaker":"Fr Stephen De Young","text":"Father's Bless."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6770.02,"end":6773.18,"speaker":"Fr Andrew Stephen Damick","text":"My name is Tyler and I'm an Orthodox Christian from Louisville, Kentucky."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6773.18,"end":6775.86,"speaker":"Fr Stephen De Young","text":"And I was wondering, what is the evil eye?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6776.42,"end":6780.34,"speaker":"Fr Andrew Stephen Damick","text":"It seems ubiquitous around the world, but I'm not clear whether it's what you've."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6780.34,"end":6787.92,"speaker":"Fr Stephen De Young","text":"Called the taint of sin, envy in this case, or if it's demonically animated or if it's literally just superstition that doesn't actually exist."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6788.56,"end":6790.6,"speaker":"Fr Andrew Stephen Damick","text":"Using hamsas or beads or charms for."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6790.6,"end":6800.72,"speaker":"Fr Stephen De Young","text":"Protection against it seems like idolatry. And I'm assuming the sign of the cross, repair, holy water, etc. Would be the true way to defend against the evil eye, if it's even something real that can hurt us."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6801.28,"end":6802.88,"speaker":"Fr Andrew Stephen Damick","text":"So a broader question I guess could."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6802.88,"end":6807.66,"speaker":"Fr Stephen De Young","text":"Be, are curses and spells real? Are they something like the energies of demons?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6808.21,"end":6814.33,"speaker":"Fr Andrew Stephen Damick","text":"Can a person fall victim to them without direct demonic participation, as in the case of evil eye victims being on."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6814.33,"end":6817.81,"speaker":"Fr Stephen De Young","text":"The receiving end of envy? Thank you for your time to answer."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6818.45,"end":6833.98,"speaker":"Fr Andrew Stephen Damick","text":"All right, the evil eye, that pulsating, glowing blue eye that we see, I mean, it's all around the Mediterranean, right? Like both Christians and Muslims and whoever else. They've all got the evil eye stuff there."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6836.22,"end":6836.78,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6837.18,"end":6842.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what's going on with that? What is up with the evil eye?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6843.1,"end":6845.58,"speaker":"Fr Stephen De Young","text":"Yeah. The evil eye goes way, way back."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6845.82,"end":6859.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's a prayer. I should mention there is a prayer in the Ethologian, which is sort of the priest's book of prayers for lots of occasions. Right. There's a prayer against the evil eye in some of those ethologia. I think I've got it in a couple of the ones that I have."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6860.71,"end":6868.07,"speaker":"Fr Stephen De Young","text":"Yeah. So I have not surveyed all of ancient Near Eastern literature on this."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6868.39,"end":6868.79,"speaker":"Fr Andrew Stephen Damick","text":"What."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6868.87,"end":6881.31,"speaker":"Fr Stephen De Young","text":"So what? I know I'm a little. Not my thing. Some future. You know, when I get another PhD, I'll do my dissertation on the evil eye. Maybe. Probably not."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6881.31,"end":6881.67,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6883.99,"end":6884.39,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6885,"end":6888.6,"speaker":"Fr Andrew Stephen Damick","text":"That will be the only thing you'll be ever asked to speak on from here on out, if you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6889.4,"end":6890.64,"speaker":"Fr Stephen De Young","text":"Definitely not. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6890.64,"end":6891.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6892.52,"end":6907.64,"speaker":"Fr Stephen De Young","text":"But the earliest reference I've. I've stumbled upon is from what's basically a death curse in ugaritic. So we're talking about second millennium bc."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6908.36,"end":6908.84,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6909.08,"end":6914.55,"speaker":"Fr Stephen De Young","text":"And there's some debate about part of the inscription."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6914.87,"end":6915.43,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6916.15,"end":6958.17,"speaker":"Fr Stephen De Young","text":"So I'm just saying that to cover my bases, because I take one side of that debate. There's one particular word that's argued about, all right. Who or what it's identifying. So. But essentially the way I take it is that there is this curse that's pronounced against someone you don't like is directing the eye, particularly of Anat, who's that real friendly goddess we've talked about in the past."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6958.17,"end":6962.37,"speaker":"Fr Andrew Stephen Damick","text":"Isn't she the incestuous wife of baal, his sister?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6963.17,"end":6966.11,"speaker":"Fr Stephen De Young","text":"I'm gonna crack my father's skull open if he doesn't."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6966.11,"end":6966.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6966.99,"end":6967.39,"speaker":"Fr Stephen De Young","text":"Her."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6967.47,"end":6968.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6970.19,"end":6979.23,"speaker":"Fr Stephen De Young","text":"Not directing her. Her eye upon the person. So you're essentially sicking her on them."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6979.95,"end":6980.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6980.39,"end":6996.6,"speaker":"Fr Stephen De Young","text":"Right. And what's really fascinating about it is that that's the main body of the curse. But then at the end, there's part where you ward her eye off of yourself. Apparently it's expected that that person might send them back at you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6996.6,"end":6999.16,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. There's kind of collateral damage potentially."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":6999.4,"end":7003.24,"speaker":"Fr Stephen De Young","text":"Right. So you have to kind of put up a shield in case it bounces back at you. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7003.32,"end":7003.72,"speaker":"Fr Andrew Stephen Damick","text":"Man."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7004.76,"end":7031.23,"speaker":"Fr Stephen De Young","text":"Because you're getting her attention by trying to sic her on somebody. And so the reason I bring that up is not just to say how old this idea is, but that I think all the way through. This is the core of what the idea is. The idea is that you, out of envy or bitterness or whatever, are sort of trying to sic an evil power on somebody."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7031.55,"end":7033.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7034.35,"end":7068.91,"speaker":"Fr Stephen De Young","text":"And certainly people who are outside of Christ are capable of being victimized by demonic powers. They're subject to the demonic powers. Powers. Right. That's one of the things Christ does, is set us free from that. So, yes, such a. Such a kind of thing can happen. Happened all the time in the ancient world. But also, yes, trying to ward that off with amulets and stuff is exactly the kind of practice that's forbidden all through the Old Testament."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7069.39,"end":7119.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. And I mean, I've seen, you know, there's variants on this. You know, often you see it, the little amulets looking like an eye, but there's also a version that's just a little blue stone that doesn't particularly look like an eye. And you can find, unfortunately, you can find Orthodox Christians who wear these little things. And even I've seen them brought to baptisms. And I'll say, nope, that's. You got to leave that. You cannot bring that into a baptism. Bring the cross. Yes, we need that. And then I know there's some people, especially Middle Eastern people, that like to add icons of Christ and his mother to the chain on which they wear the baptismal crosses. But yeah, no blue beads, no amulets. That's. No."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7119.55,"end":7121.31,"speaker":"Fr Stephen De Young","text":"If you're really worried about that."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7122.75,"end":7123.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7124.11,"end":7141.79,"speaker":"Fr Stephen De Young","text":"Go and pray. Psalm 91 or 90 in the Greek numbering, second time we've referred to it today. But that psalm is an ancient exorcism prayer and is literally all about God protecting you from various pagan gods slash demons."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7141.95,"end":7145.47,"speaker":"Fr Andrew Stephen Damick","text":"There you go. All right. Well, we're going to be back after a short break."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7145.79,"end":7162.12,"speaker":"Fr Stephen De Young","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7168.6,"end":7178.07,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust? Trust strangers in Internet forums to answer."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7178.23,"end":7184.23,"speaker":"Fr Stephen De Young","text":"Are you an Orthodox Christian looking for a reliable first place to send your interested friends?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7184.39,"end":7193.43,"speaker":"Fr Andrew Stephen Damick","text":"Do you need help finding an Orthodox church near you? My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7193.67,"end":7195.51,"speaker":"Fr Stephen De Young","text":"My name is Father Joseph Lucas."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7195.51,"end":7198.07,"speaker":"Fr Andrew Stephen Damick","text":"I serve in the Orthodox Church in America."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7198.31,"end":7204.01,"speaker":"Fr Stephen De Young","text":"My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7204.17,"end":7213.45,"speaker":"Fr Andrew Stephen Damick","text":"And I'm Fr. Andrew Stephen Damick, Chief content Officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox intro team."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7213.77,"end":7215.49,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7215.49,"end":7217.49,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7217.49,"end":7219.77,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7220.01,"end":7225.77,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7225.77,"end":7228.1,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7228.1,"end":7250.18,"speaker":"Fr Andrew Stephen Damick","text":"Of the Internet, a place to get help finding an Orthodox parish and get plugged into an actual Orthodox community, then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of ancient faith ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7252.43,"end":7274.19,"speaker":"Fr Stephen De Young","text":"Foreign we're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7279.8,"end":7299.64,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everyone. It's the third half of the Lord of Spirits and once again, this is not an actual call in show. So don't call that number. You will not reach us. We don't know what you'll reach. It's a subject of much conjecture, but you will not reach us, that's for sure. We're both going to be in church when this airs. So we've covered 20 questions so far."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7299.8,"end":7304.67,"speaker":"Fr Stephen De Young","text":"In actually, by the time we get to this third half, we'll probably be out of church technically."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7305.14,"end":7307.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's probably true. That's probably true."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7307.94,"end":7308.94,"speaker":"Fr Stephen De Young","text":"But let's be honest."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7308.94,"end":7322.18,"speaker":"Fr Andrew Stephen Damick","text":"That's true. Yeah. So. All right. Well, we are in the third half. We've done 20 questions and let's go ahead and roll on to the next one. So this one is from Will."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7323.46,"end":7326.74,"speaker":"Fr Stephen De Young","text":"Hey, Fathers, I had a question about."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7328.1,"end":7330.54,"speaker":"Fr Andrew Stephen Damick","text":"Just this whole idea of re enchantment."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7330.54,"end":7357.56,"speaker":"Fr Stephen De Young","text":"And the sacramental life. And I was wondering, is it possible to enchant or kind of sacramentalize techne specifically like pure mathematics or the physical sciences. And if you were to do that, what would that look like? Thank you very much."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7359.65,"end":7367.57,"speaker":"Fr Andrew Stephen Damick","text":"So re enchanting pure technique like math or science. Yeah. Is that a thing? What do you think? Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7368.37,"end":7368.85,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7369.33,"end":7403.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay. No, Come on, let's move. Let's move. Lightning round. I mean you can enchant. I mean if we understand enchantment, right in the way that we have generally talked about it on the this show, which there's a bunch of different ways to use the word, but the way we've generally talked about it is in terms of, you know, like in our, our blurb at the beginning of Every show. The union of the scene and the unseen, bringing the presence of Christ into everything. Yeah, of course. Right, of course."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7404.35,"end":7407.63,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, the way I talk about it is making your weapons more powerful."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7407.79,"end":7408.43,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7408.99,"end":7410.19,"speaker":"Fr Stephen De Young","text":"Stones and gems in them."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7410.19,"end":7412.43,"speaker":"Fr Andrew Stephen Damick","text":"Plus. Plus five lab beakers. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7413.17,"end":7459.33,"speaker":"Fr Stephen De Young","text":"But, yeah, I've been. For reasons. I've been reading Simone Vale and she actually talks about this in an interesting way because she kind of contrasts the way. And this is written in 1943, the way that science had become an idol because it had become an end in itself. Right. Rather than something that points to something of greater and ultimate value. And she contrasts the way science was already being done at that time. Of course, this is also during World War II."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7459.49,"end":7460.37,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7460.53,"end":7518.31,"speaker":"Fr Stephen De Young","text":"There was Nazi quote, unquote, science. Right, right. And contrast that with the way science and math were done by, like, the Pythagoreans, by Archimedes and the ancients in general. Right. Whether we're talking about ancient Babylonian mathematics or ancient Greek mathematics. And they saw what they were doing in both math and science as discovering something in the universe far greater than humans that they were uncovering and discovering that were things of sort of divine beauty that showed sort of, you know, the handiwork that lay in the background."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7518.87,"end":7519.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7519.27,"end":7526.45,"speaker":"Fr Stephen De Young","text":"Of. Of the universe and created things, which."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7526.45,"end":7531.69,"speaker":"Fr Andrew Stephen Damick","text":"Is probably a little bit easier to do with some sciences, like, say, astronomy. Right. That's the kind of. The obvious one."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7532.65,"end":7560.56,"speaker":"Fr Stephen De Young","text":"Right. But even with mathematics. Right. I mean, she talks about, I mean, these discoveries, like figuring out you could put a right triangle within a. Within a circle and the ratios of the angles. Right. These sort of beautiful symmetries in. In mathematics and that kind of thing. I mean, even, even. And. And this goes even up into the medieval period. Right. The idea that there was sort of a spiritual reality behind musical intervals."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7561.12,"end":7561.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7561.56,"end":7564.4,"speaker":"Fr Stephen De Young","text":"And music is just sort of implied math, you know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7564.8,"end":7565.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7565.16,"end":7648.77,"speaker":"Fr Stephen De Young","text":"Like that in. In musical intervals, which are basically mathematical intervals, there, there was either goodness and beauty or the opposite with certain ones that were forbidden, sort of conjured or evoked a kind of negative spirit. And so that's a very different way of pursuing mathematics or science than trying to create cheap consumer products or using. Using mathematics and science instrumentally toward an end. Right. Like using technology to sort of shape culture, using technology to enrich yourself, using technology for power and control. Right. Whether we're talking about social media now or what the Nazis were doing, you know, to make weapons of destruction, you know, the, you know, just looking contemporary example to her, you know, Robert Oppenheimer. Right. There's a certain beauty in uncovering the secret of the atom and being able to split it, being able to generate an infinite amount of power. Then you could also use that as a weapon."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7649.33,"end":7649.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7649.97,"end":7652.88,"speaker":"Fr Stephen De Young","text":"You know, and drop it on thousands of unsuspecting civilians."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7653.59,"end":7711.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know, as I say, it wouldn't be a. It wouldn't be a Lord of Spirits episode if I didn't get to drop at least one Tolkien reference. But I was just reading like. So I was just reading chapter four of the Hobbit because I just recorded an episode of my other podcast, which is a different podcast, Aman Sewell, about that chapter. And it's actually interesting in there is the first time in the legendarium where you meet goblin or Orcs. And Tolkien actually has this little discursus in there about how much goblins love. They love clever things, but not really beautiful things. And he mentions even that weapons of mass destruction are probably invented by goblins, you know, even the ones that exist in his time. Right. You know, that he attribute. So he. He gives a very deliberate attribution of the use of technology. Technology in that way to his race of almost pure evil. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7712.07,"end":7728.95,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. And so, I mean, mathematics and science, just as much as language and poetry can be a way of discovering and conveying a reality that isn't purely material."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7729.03,"end":7729.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7730.71,"end":7747.39,"speaker":"Fr Stephen De Young","text":"Right. And were that way for most of human history until the modern period when they, like everything else, got stripped of. Right. Got stripped of the spiritual element."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7747.55,"end":7751.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so our next question is from Alex."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7752.83,"end":7756.75,"speaker":"Fr Stephen De Young","text":"Hey, Fathers, this is Alex from Tampa. I so appreciate your show."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7756.75,"end":7758.51,"speaker":"Fr Andrew Stephen Damick","text":"And I guess I still have some."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7758.51,"end":7765.02,"speaker":"Fr Stephen De Young","text":"Questions after the Revelation episode you both did. I guess the Second Judgment is a."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7765.02,"end":7767.98,"speaker":"Fr Andrew Stephen Damick","text":"Question I have and many of those I meet have."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7768.78,"end":7784.62,"speaker":"Fr Stephen De Young","text":"For those in paradise, does the second Judgment do anything to those already in paradise? To those in perdition, is the second Judgment meant to be for that period where the Church Militant and the Church Triumphant are praying for those in perdition."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7784.62,"end":7789.62,"speaker":"Fr Andrew Stephen Damick","text":"That they may be redeemed? I guess the, you know, we understand."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7789.62,"end":7792.98,"speaker":"Fr Stephen De Young","text":"That there's a first Judgment for us when we."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7793.38,"end":7797.86,"speaker":"Fr Andrew Stephen Damick","text":"When we die, when we repose, but I guess I'd like to hear some."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7797.94,"end":7804.02,"speaker":"Fr Stephen De Young","text":"Some more expounding on the Second Judgment. Thank you both for everything you do in this podcast. It's fantastic. God bless."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7804.58,"end":7832.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so this is, you know, touching on what we've referred to as a two stage eschatology. Right. There's. There's what happens to you immediately when you die, and then there's eventually the final judgment, that general resurrection, all Those kind of big solidifying events at the end. So he seems to be asking, like, what does that second one actually do to people? Right. What's the difference from there on out? I mean, we see this in Matthew, chapter 25. Right. That's the last judgment."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7832.84,"end":7849.5,"speaker":"Fr Stephen De Young","text":"Right, right. That's. And that's sort of a reverse. The question is sort of reversing the reality. Right. In the sense that what's being called here, the second judgment, is the. The actual judgment. Because judgment, again, is not rendering a verdict on people."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7849.82,"end":7852.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's putting things in their proper order."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7852.86,"end":7877.75,"speaker":"Fr Stephen De Young","text":"Putting things. Right. And that judgment at Christ's glorious appearing is when everything is finally, permanently, eternally set. Right. And put back in order. Right. And so that's the actual judgment. Right. To even call the other one a judgment, you have to shift the definition of judgment."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7877.83,"end":7882.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's often called the particular judgment. Right. I've heard that. That phrase."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7882.59,"end":7889.99,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah. But even that is coming out of a Western view of what judgment is."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7890.15,"end":7891.51,"speaker":"Fr Andrew Stephen Damick","text":"Oh. A more juridical."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7891.67,"end":7895.07,"speaker":"Fr Stephen De Young","text":"Right. Where both of them are. This juridical thing about the fate of humans."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7895.7,"end":7897.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7897.54,"end":7911.7,"speaker":"Fr Stephen De Young","text":"You go to heaven, you go to hell. Right. And again, that's not really what judgment is. So what happens at that point is really a continuation of this life."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7912.42,"end":7920.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Let him that is unjust be unjust still. Let him that is righteous be righteous still. Which I can always hear Johnny Cash singing that in my head."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7920.78,"end":7921.9,"speaker":"Fr Stephen De Young","text":"Head. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7923.1,"end":7929.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is that the song when the Man Comes Around? I think that's what. Yeah, That's a great song. Great song."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7931.18,"end":7958.51,"speaker":"Fr Stephen De Young","text":"Yeah. And so that's. That's what that is. Right. And it's precisely because the judgment hasn't happened yet that we continue to pray for those who, in their lives, may or may not. I'm phrasing it that way deliberately. Right. Because we pray for people who, from our perspective, were good Christian folks. Right, Right. But we don't know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7958.51,"end":7961.55,"speaker":"Fr Andrew Stephen Damick","text":"No, we don't. We just. We just see what we see."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7962.11,"end":7977.93,"speaker":"Fr Stephen De Young","text":"Yeah. And we pray for people who, from our perspective, were maybe rotten folks, because we don't know. Right, Right. But we continue to pray for them in part specifically because that judgment has not taken place yet."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7977.93,"end":7979.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7979.61,"end":7988.65,"speaker":"Fr Stephen De Young","text":"Right. And so. Yeah. So that. That's. I mean, he didn't make up this terminology."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7989.29,"end":7990.17,"speaker":"Fr Andrew Stephen Damick","text":"No, no."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7990.89,"end":7992.65,"speaker":"Fr Stephen De Young","text":"He's inherited it. Right, But."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7992.65,"end":7993.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":7993.21,"end":8011.54,"speaker":"Fr Stephen De Young","text":"But part of the answer to the question is breaking down that. That terminology. So what. What that. What, what, what? Is being called to the question, the second judgment does Is it sets all of creation. Right, right. So that the righteous could dwell with Christ forever."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8013.62,"end":8019.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, all right, well, our next question, very brief, comes from Adam."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8021.86,"end":8032.75,"speaker":"Fr Stephen De Young","text":"Hello, Lord of Spirits. My question is, did the devil fall after creation? Do we know when the devil fell? Thanks."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8034.35,"end":8042.91,"speaker":"Fr Andrew Stephen Damick","text":"You know, the way he started that off, he said, hello, Lord of Spirit. I mean, he's literally addressing Christ. So do we have to answer this question or no?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8043.47,"end":8043.83,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8043.83,"end":8053.16,"speaker":"Fr Andrew Stephen Damick","text":"Did the devil fall after. I mean, yeah, right, yeah. Because he's part of creation. He doesn't exist before creation. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8053.16,"end":8055.68,"speaker":"Fr Stephen De Young","text":"I think he was referring to the creation of the world."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8056.08,"end":8056.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8057.28,"end":8058.96,"speaker":"Fr Stephen De Young","text":"The answer to which is also yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8059.2,"end":8063.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we see him fall in Genesis 3."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8063.36,"end":8134.07,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah. And, you know, just because, you know, people have been listening for a while now, I'll just. I'll proof text this. Right. And that's if you read, for example, St. Andrew of Caesarea, his commentary on Revelation, when he talks About Revelation, chapter 12, describes the dragon and the third of the stars, and all of that he says, and exit. Faith's own. Dr. Jeanne Constantino did a good translation of it. Now, I have to say there's another English translation, not as good of a translation, but a much nicer looking book. Not Dr. Jeannie's fault. Her translation is in a series. And so it has the trade dress of the series. There's a hardcover that's fancy looking and looks nicer, but not as good of a translation anyway. And in that section of the commentary, Saint Andrews says, we must accept, as the fathers have taught, that, that after the creation of the world, the devil fell through envy."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8134.07,"end":8135.35,"speaker":"Fr Andrew Stephen Damick","text":"Well, there you go. That's pretty."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8135.35,"end":8143.99,"speaker":"Fr Stephen De Young","text":"And so that's in the sixth century. He's looking back at the preceding Church Fathers, of which he had more of their writings than we do. And that's how he summarizes it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8144.31,"end":8150.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there you go. Okay, so this one is from our panoply of Bens."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8152.79,"end":8237.42,"speaker":"Fr Stephen De Young","text":"Father's Bless. My wife and I are going to our last catechism class on March 6, and Father Stephen had recently commented in one of the podcasts that. That catechism is not supposed to be about swapping out our old set of propositional realities in order to take on the orthodox set. But it seemed to imply that it's ideally something more. And I was hoping that you both might be able be willing to comment or expand on that vision of what catechism ideally is. Not so that I can criticize my own or anything like that, but having come from a low church background, where it go to, like listening to the sermons is the discipleship. I found that, you know, it doesn't seem to radically change our lives. And trying to work it out, I encountered Rich Mullins, who, who pointed out that the information age seems to lead to this belief that if we just have the right information, we'll believe the right thing, you know, and that doesn't work, but it's that about. About being connected to a great God who really is life. And so that's kind of some of the thrusts even of coming into orthodoxy. But I, I work at a homeless shelter and the program we do, I guess you could call a catechism for the homeless. And we're trying to empower them to address the chaos and brokenness in their lives, which is atrophied, their capacity for self responsibility and their web of relationships. So I was just hoping you might be willing to comment ideally on what catechism is so that for those of us who maybe have opportunities to extend that in other areas of our lives. Thanks."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8238.3,"end":8388.38,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, this is a great question. I mean, he mentions that he's helping to form homeless people at the end. I mean, to me he's got a bead on what I think catechism needs to be. And I mean, I saw this. I did parish ministry for 13 years, and for a lot of those years I did catechism in kind of the conventional way, which is, here's some information that you need to know about Orthodox Christianity, right? Here's what we teach, here's what we believe, you know, here's what the services are and all that. And that information is super important for sure. But the question that I ended up asking and trying to redirect catechism towards, especially towards the end of my time in pastoral ministry was, okay, so what to me as a pastor is an ideal parishioner, an ideal orthodox Christian. And how would I teach someone to be that? And that's different from being able to pass essentially a freshman level course in Orthodox Christianity, right? Like it includes teaching people how to pray, how to fast, how to give alms, how to keep silence, how to be, how to meditate, you know, how to see what the church's prayer is really for and what it does. And I, sadly, I think that that's fairly rare or is kind of a secondary effect of a lot of catechism that's going on these days, that a huge amount really is still just giving information. And I don't fault the people doing that because largely they're just Doing the thing that they were taught to do. But I also think the fact, I mean, let's just face it, right? We've got a big loss of orthodox Christians here in America generationally. And I don't know if that's in other places in the world as well, maybe. And so clearly what was being done with those people did not result in their long term participation in church life. So, yeah, I mean, I do think that catechism is much should be about forming people into holy people, like teaching them this, here's your tools, here's how you do this thing, showing them how to do it and then, you know, staying with them. I don't know. Father, is there anything you wanted to add to that or adjust or correct or whatever?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8389.1,"end":8418.35,"speaker":"Fr Stephen De Young","text":"Well, yeah, I mean, it, it's related to a bad idea of what education is. Yeah, right, right, right. Because catechism is a subset of. Of education, really. Right. And this is not actually how education is done and how it actually works. But a lot of folks think about education is like, well, we have this information, we have this knowledge, we're going to impart it to you. And now you're educated because you now possess it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8418.43,"end":8419.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8419.63,"end":8462.61,"speaker":"Fr Stephen De Young","text":"And so if I, I give you the lecture, I lay out all the information, I give you a test, you regurgitate the information, okay? Now, you know the information, you have accomplished the task of education. Right. And even like, you know, citizenship in the United States works this way. Right. If you. There are always these things where they point out that if, if you come from another country to the United States and you want to become a U.S. citizen, you have to take this test, right. With all these questions about American history and civics and all this. And you know, the thing is, always 99% of Americans who are born here can't pass it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8462.69,"end":8463.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8464.13,"end":8492,"speaker":"Fr Stephen De Young","text":"In a million years. And the same is, frankly, would, would be true if we did the same thing in most of our parishes, Right. If we gave a quiz to them based on the stuff that we teach in a catechism class in the U.S. you know, can most of your parishioners who haven't been through a catechism class, or even those who have, if it's been a while, give you the dates of the ecumenical councils. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8492.64,"end":8495.28,"speaker":"Fr Andrew Stephen Damick","text":"Or how many there are even in some cases. Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8498.48,"end":8539.06,"speaker":"Fr Stephen De Young","text":"And that kind of thing. Right. That's not what makes you part of the community. That's not what makes you an American. That's not what makes anyone part of a culture and community. But you look at how education actually happens. Right. A little subrosa beyond what we talk about. So Post World War II in the United States, how is education structured? It's not a coincidence. Kids have to show up at a certain place at a certain time. They have to sit behind a desk for a certain period of time until they get a break. Then they leave their desk, they go take their break, and they have to be back on time. Then they get a lunch break. It was setting them up to be office workers."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8539.54,"end":8540.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8540.94,"end":8544.98,"speaker":"Fr Stephen De Young","text":"That's what was happening in education. It didn't matter what you taught. The information was not what was important."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8545.78,"end":8547.94,"speaker":"Fr Andrew Stephen Damick","text":"And how much retention of that is there, really."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8548.66,"end":8585.04,"speaker":"Fr Stephen De Young","text":"Right. You are enculturating them to go and have an office job. And the reason you didn't need education to work that way before the war is that's not how people were working. People were going and getting apprenticed. Right. In trades and that kind of thing. That's how education took place, because that was preparing them then to be an adult and have a job and be. So catechism in the same way needs to be about. And this is what it was about in the early church. Right. The length was based on the repentance needed. Right. The change of life that was needed."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8585.04,"end":8585.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8585.36,"end":8613.08,"speaker":"Fr Stephen De Young","text":"Not about how many. How much of the Internet and how many books they had read. It was about how much change was needed in their life. And so it was about enculturating them to make them ready to become adult Orthodox Christians. Right. Who are going to live an orthodox Christian life and function within the community of the church. Right. And how long it was. And what needed to be talked about was all based on that. What each person needed to get to that point."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8613.24,"end":8614.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How to be faithful."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8615.72,"end":8624.84,"speaker":"Fr Stephen De Young","text":"Yeah. And the whole sponsorship, godparent thing, too, was originally like a legit mentorship."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8625.56,"end":8625.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8626.6,"end":8629.64,"speaker":"Fr Stephen De Young","text":"So it would be apprenticed. Right. In a. In a career."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8630.36,"end":8635.34,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. Okay, so this next question question comes from Steve."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8637.18,"end":8705.41,"speaker":"Fr Stephen De Young","text":"Greetings, fathers. This is Steve from Grand Rapids, Michigan. First, I just wanted to say thank you for the show. I've been curious about and have felt drawn to orthodoxy for many years, but this podcast has finally lit the fire in me to actually go and participate. So thank you for that. My question is about yam, the Hebrew word for sea. I took some biblical Hebrew way back in the day at a very liberal, liberal arts college. The professor loved to try and scandalize the students by pointing out all the places modern translations demythologized to text. I never quite had enough of a grid for how to deal with his critiques. But thanks to this podcast and also shout out to Jonathan Peugeot as well, I now feel like I do. One of my professor's favorite examples was what he called Yam, the sea God. It seemed that anytime the text would say the word yam, he'd wink an eye and kind of chuckle to himself. So I'm curious about the connection between yam, the word for sea, and more explicit references to Leviathan and behemoth. Is every reference to the sea a reference on some level to these lesser gods? Thanks. Love the show."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8706.29,"end":8725.83,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Yam, whom we've mentioned previously on the Lord of Spirits, is every reference to the sea actually a reference to Yam the sea God? Or how much can we. This is my addition. How much can we distinguish the two in, you know, in the biblical text?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8728.55,"end":8767.24,"speaker":"Fr Stephen De Young","text":"Right. I mean, this. This even goes back to. All the way back to. I think it was our very first question today. And that, see, we've got this. Either or how do we tell if this is referring to the water? Right. The H2O with a certain saline content in that large collection in the Mediterranean. And how do we know when it's referring to Yah the God? And it's always referring to both. Because for ancient people, those weren't separate realities."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8767.88,"end":8776.68,"speaker":"Fr Andrew Stephen Damick","text":"So calming the sea, then, is literally putting Yam to rest, so to speak. Right, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8776.92,"end":8787.96,"speaker":"Fr Stephen De Young","text":"Right. And so you can't talk about a thing without talking about the spirit of the thing, and you can't talk about the spirit of the thing without also talking about the thing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8790.28,"end":8790.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8791.72,"end":8811.24,"speaker":"Fr Stephen De Young","text":"So. And remember, as we talked about way, way back in one of the early episodes, using Philo as an example, ancient Judaism, ancient Israelites and early Christians did not disagree with the pagans that there were spirits related to everything."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8811.72,"end":8812.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8812.84,"end":8815.28,"speaker":"Fr Stephen De Young","text":"They disagreed about the status of those."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8815.28,"end":8818.12,"speaker":"Fr Andrew Stephen Damick","text":"Spirits and how should you relate to them?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8819.24,"end":8866.24,"speaker":"Fr Stephen De Young","text":"Right, yeah. Where, you know, like we pointed to Philo saying that those gods even calls them gods for us, small G gods. He says those are not gods to be worshiped in their own. Right. They're part of the gods administration. Right. At various ranks. Right. But yeah, there is that dimension to all realities, and I'll just touch it here. I avoided veering off completely into this earlier, but just to touch on it here. And since Pageau was mentioned one of the times I talked to him, this bit got clipped out about cities having souls and people lost their minds."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8869.28,"end":8869.64,"speaker":"Fr Andrew Stephen Damick","text":"Which."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8869.64,"end":8884.15,"speaker":"Fr Stephen De Young","text":"You know, hey, it makes it all worthwhile. But the idea there is that, first of all, cities have a Collective life. But also the fact that something has a soul, as we were talking about with animals and plants, doesn't mean they have a human soul. It's not the same thing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8884.23,"end":8885.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8886.15,"end":8912.07,"speaker":"Fr Stephen De Young","text":"But there are spirits, there are powers and principalities of families, clans, cities, nations. Right. Assigned to them. This is, this is one of the basic things, sort of all through scripture and those spiritual realities, those souls or those spirits can be holy or they can become demoniac."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8912.39,"end":8912.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8914.23,"end":8919.91,"speaker":"Fr Stephen De Young","text":"Nazi Germany would be an example of a corporate becoming demoniac."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8919.99,"end":8920.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8920.43,"end":8956.75,"speaker":"Fr Stephen De Young","text":"Right. The giant clans. Right, right. The Assyrians for most of their history. Right. That this can happen. Right. And so we sort of cut off that idea to our peril. And it's really inadequate when, when the chips are down, even the most hardened materialist knows that there's something inadequate about it that just. Oh, a whole bunch of individual people made bad decisions."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8957.47,"end":8957.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8958.11,"end":8961.71,"speaker":"Fr Stephen De Young","text":"Doesn't cut it to describe real evil when it manifests in the world."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8961.71,"end":8973.39,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. Yep. Okay, so this next question is our final question from one of our many."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":8973.39,"end":9059.53,"speaker":"Fr Stephen De Young","text":"Bens, the ultimate Father's Bless. My name is Ben and I'm a most of the time listener and one time telegram pre order sender and don't banish me for that. And have a question about the orthodox understanding of small R revelation. And I have a somewhat charismatic evangelical, whatever that is, background and was encouraged at least then to daily be asking God for. For revelation and learn to discern whatever forms the revelation takes, whether it's dreams, prophecy, visions, words of knowledge, etc. With the idea being learning to grow and discerning what God is saying to you and what am I going to do about it? I do want to add at least that in my experience, the belief was not that these small R revelations had the authority at all of scripture, but were more like touch points for obedience or like a daily outworking of a. Now here air quotes. Life led by Holy Spirit. Close air quote. I've been going to Divine Liturgy for a few months now and haven't heard a single sermon exhorting me to do that or sorry, homily and was. But. And I'm hoping to start catechumen classes soon, but I was hoping you might be willing to expand a bit on the orthodox understanding of revelation today and how or if I should seek it or. And quote again, I guess move in those gifts, so to speak, and we'll close the quote. So. Yes. Thank you. Hope to hear from you. Peace."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9060.49,"end":9161.18,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we've heard some of that kind of stuff before. I'M suddenly reminded there was one time when I was talking with my wife about that whole sort of charismatic, ish world and its functioning along those lines. And she, you know, she was not raised with that. I was raised evangelical, so we weren't charismatic, but certainly charismatic adjacent in some ways. So people talking in that way was totally normal in my upbringing. But I remember I was trying to explain it to her and so she said to me, she said, do people think that like, God tells them to tie their shoes in the morning? Like that was her way of. Her way of putting it. And while I think most people would not have a revelation related to shoe tying, there does seem to be for sure this idea that I feel strongly about something, or here's a good thought that I have. And so this is God specifically telling me to do this or, or, you know, encouraging me to do that. And I even still, I mean, you know, you and I have both gotten emails where people said, well, God told, you know, God told me to write to you, or the Holy Spirit told me to write to you or something like that. And I don't know if for me, I have. It's not a reaction against that, but I tend to kind of go, well, and it's not because I'm skeptical that God speaks to people, but that. I guess the way that I think of it is that people expect God to be a micromanager, you know, in their lives. I don't know. Am I making any sense?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9162.46,"end":9165.26,"speaker":"Fr Stephen De Young","text":"Yeah, man. The Pentecostals are all going to hate me."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9166.62,"end":9167.9,"speaker":"Fr Andrew Stephen Damick","text":"You said that earlier, I think."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9167.9,"end":9169.06,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9169.06,"end":9202.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, I mean, doubling down. I mean, really, like, it's funny when we, when we did. When several episodes ago, I can't remember when it was when someone called in with a question about speaking in tongues, and we didn't really have anything positive to say about that. We got several emails from people kind of shocked that we turned out not to be Pentecostals. And it's like we never pretended to be, you know, on board with that way of believing and thinking and practicing. So. But, you know, everybody is welcome to listen. We're very happy you're here, whatever your background is, whether you agree with us or not."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9204.56,"end":9210,"speaker":"Fr Stephen De Young","text":"Yeah, I frequently pray for those who hate me. So if you're hating on me, it might work out okay for you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9210,"end":9212.24,"speaker":"Fr Andrew Stephen Damick","text":"That's right. It's a special category of prayer just for you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9213.02,"end":9237.42,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, that's a big category for me. But anyway, part of the key here is that revelation in general, right? Like, let's Talk about biblical revelation. For us as orthodox Christians, biblical revelation is not a series of logical propositions."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9238.07,"end":9238.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9239.27,"end":9250.15,"speaker":"Fr Stephen De Young","text":"It's not sort of. And this is a place where we differ from some Western confessions. I'm not thinking of the Pentecostals now. Now the Calvinists are going to be mad at me."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9251.19,"end":9251.91,"speaker":"Fr Andrew Stephen Damick","text":"But that's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9253.83,"end":9258.59,"speaker":"Fr Stephen De Young","text":"Sort of logical propositions and sort of truths about God or Christ or salvation."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9258.59,"end":9258.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9259.27,"end":9266.67,"speaker":"Fr Stephen De Young","text":"Doctrine. Right. So it's the revelation of Christ who is God himself."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9267.62,"end":9267.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9268.42,"end":9338.34,"speaker":"Fr Stephen De Young","text":"Right. And so when, I mean, obviously in the most direct example of saints who have had personal revelation in the orthodox church are those saints who have had the vision of Christ in his uncreated glory. But note, that's a vision of Christ in his uncreated glory. Glory. That's not Christ appearing to them and telling them this is the person you should marry. Right, right. Or any other discursive content. Right. And so when we're talking about revelation, we're talking about Christ self revelation because it's all oriented toward the personal person of Christ. Right. So that means we shouldn't be looking. If we don't have that kind of discursive revelation in the Bible, we shouldn't be looking for that kind of discursive revelation in our life. Right. That God is going to individually come to me and tell me some logical proposition."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9339.14,"end":9376.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I guess probably the point where a lot of Pentecostals and charismatics and evangelicals and stuff would like where they're going, I think with this is they see, for instance, particularly in the Old Testament, God appears to someone and says, now I want you to do the following. Right. That's a thing in the Old Testament for sure. And Jesus certainly gives commands in the New Testament. So that's what they're expecting on some level. But of course, barring the Lord appearing to them visually and saying now go do the following, it tends to be filtered then through I have a strong feeling or this makes sense to me."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9378.32,"end":9404.97,"speaker":"Fr Stephen De Young","text":"Right, right. Those are two different things. But even then the primary revelation, like Isaiah doesn't receive some kind of new knowledge. Right. God reveals Christ, reveals himself to Isaiah and then Isaiah is sent to do something. Right. Christ reveals himself to St. Paul and then St. Paul is sent to go preach the gospel."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9405.05,"end":9406.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9409.53,"end":9431.65,"speaker":"Fr Stephen De Young","text":"But so there's also, and I know they're not going to want to hear this, our Pentecostal friends. There's also a heavy dose of Calvinism here. There's a view of divine providence in the background of the this, which is that God has a specific Will for like every decision you make."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9431.65,"end":9433.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9433.57,"end":9436.85,"speaker":"Fr Stephen De Young","text":"And if you make the wrong one, that's a sin."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9437.97,"end":9438.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9438.93,"end":9460.32,"speaker":"Fr Stephen De Young","text":"God has a person he wants you to marry or not. And if you marry someone else or don't marry that person or marry somebody and you weren't supposed to get married, you're like sinning. And so you have to find a way to sort of divine whether you're supposed to be married and who that person is. And this puts people through agony."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9460.32,"end":9482.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. There's the whole. It's funny, like, what is God's will for my life? I'm like, well, actually, it's pretty straightforward. God's will is that you repent of your sins, that you love your neighbor, that you love him above all else, that you worship him and remain faithful until you die. That's God's will for your life. And anything that's actually lining up with that, congratulations, you're doing God's will."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9483.13,"end":9490.33,"speaker":"Fr Stephen De Young","text":"Right. And Calvinism at least sort of puts the imprimatur on whatever happens."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9491.05,"end":9492.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That was God's will."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9492.13,"end":9499.29,"speaker":"Fr Stephen De Young","text":"Right. Whatever happens, that was God's will. But this is projecting it out into the future and you have to try to discern it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9499.37,"end":9499.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9499.93,"end":9500.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9500.29,"end":9500.89,"speaker":"Fr Andrew Stephen Damick","text":"Or else."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9500.97,"end":9535.02,"speaker":"Fr Stephen De Young","text":"And you know, the truth is. And people don't want to hear this. Right. The truth is there is not one perfect person for you out there to marry. And that's good news because if. If there were, they'd probably be in China. That's the odds, based on the world population. And you'd probably never meet them. Right, right. The reality is there's. There are a bunch of people out there who, if you dedicated yourself to it, you could have a successful marriage with. And there's a much bigger group of people who you couldn't."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9536.06,"end":9540.38,"speaker":"Fr Andrew Stephen Damick","text":"But I mean, didn't the proclaimers say that they would go the whole wide world just to find her?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9540.54,"end":9558.73,"speaker":"Fr Stephen De Young","text":"Just to find her an exception to this? My wife and I are America's sweethearts, perfectly made for each other. But for most folks. Right, right. There are actually several possibilities. Right. And that's very unromantic notion, but the same is true of every other decision you make in your life."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9558.73,"end":9559.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9559.45,"end":9565.37,"speaker":"Fr Stephen De Young","text":"Right. There are multiple things that you could eat for breakfast or lunch or dinner that would be fine."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9565.53,"end":9566.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9566.17,"end":9572.33,"speaker":"Fr Stephen De Young","text":"It would be nourishing. They would follow the fasting rules, even, and it would be good. There are other things you could eat that would not be good."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9572.33,"end":9611.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think that there's often there's this sense that there's one right thing and everything else is wrong. And yet the truth is. Yeah. The truth is for most situations in life, there's one or two wrong things, and then everything else is right. That holiness actually is infinitely interesting and creative. And it's evil that is banal and limited and restrictive. I think this idea that God is micromanaging every single decision flips it. And it's, like you said, it causes a lot of agony for people. Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9611.94,"end":9614.94,"speaker":"Fr Stephen De Young","text":"Yeah. It's Plato brain."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9615.1,"end":9615.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9616.14,"end":9639.87,"speaker":"Fr Stephen De Young","text":"And so the discernment is not okay. I have to make the decision. I have to figure out what it is that God wants me to do, what choice he wants me to make. The discernment is coming to know Christ and then based on that, discerning what you should do."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9641.15,"end":9642.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9642.83,"end":9654.43,"speaker":"Fr Stephen De Young","text":"Like what. What is the right thing to do in this situation? Like, if you understand the principles of bodily health, you can make a good choice as to what to eat. Right. And what you shouldn't eat."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9654.91,"end":9661.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. The question is, is this good? Is this action good? Not is this the one good action that I could possibly take?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9662.33,"end":9677.45,"speaker":"Fr Stephen De Young","text":"Right, Right. And so you can. That's where the discernment. The discernment is making good choices. The discernment is not trying to discern and figure out which available choice has the divine imprimatur on it."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9677.45,"end":9677.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9678.17,"end":9679.09,"speaker":"Fr Stephen De Young","text":"Without knowing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9679.09,"end":9683.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so this one is from Mary."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9684.97,"end":9769.26,"speaker":"Fr Stephen De Young","text":"So my question is about death. And my dad recently passed away. He was not a Christian. He had made many mistakes. He was suffering from cancer, but he died suddenly from a heart attack. And I had been kind of really struggling with that since then, especially since I didn't really put a lot of emphasis on his caring for his salvation and caring about, you know, his afterlife. I definitely thought I had more time. And I was waiting for him to move, to be near us. So it's been a very devastating loss for me. My priest told me to pray for him using the Jesus prayer. And I do that whenever I think about it. And often on my prayer rope, I will use that to pray for him. Last week, on the morning of my son's birthday, I had a dream. And in the dream, it was kind of like my dad reanimated. His head was of, like, on this stick sort of. And then all of a sudden, he was kind of warming up his face moving it around and kind of reanimating, and his whole body appeared. And I gave him a hug. And it was a very long hug. And it felt very real, everything about it. And he seemed okay and well, And I wasn't sure what we really believe as Orthodox Christians about the afterlife. When we pray for somebody who did not know God. God, how that person fares after they pass."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9770.78,"end":9775.58,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, what do you have to say to that, Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9777.34,"end":9822.74,"speaker":"Fr Stephen De Young","text":"Well, I mean, in terms of the dream, we've talked before about how you sort of discern those kind of things by their fruits. Right, Right. So if that dream brings you a sense of peace and comfort, hurt. Right. Then. Then that's a good thing. Now, that doesn't mean you just, oh, he's fine, I can stop praying for him now. Right, right. Like you would never do that for a living, living in this world person. Right, right. So, you know, you continue to pray for him and if you have something like that that brings you peace and comfort, then that's a, that's a good thing. Thing. But, I mean, we can't. We're not going to get like an objective."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9824.34,"end":9824.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9824.74,"end":9842.6,"speaker":"Fr Stephen De Young","text":"I know we all want that. Like, I, I want to have a sense of assurance in my heart that this other person is in heaven or is going to be on the right side of things at the judgment. Right. However we want to phrase that. Right. I want to be sure of that for this other person."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9843.48,"end":9843.88,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9845.8,"end":9847.8,"speaker":"Fr Stephen De Young","text":"That doesn't really come most of the time."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9847.8,"end":9851,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We just don't, don't know the very rare cases."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9851.32,"end":9891.81,"speaker":"Fr Stephen De Young","text":"That isn't something that we should be worried and upset about. Right. Because as much as we love another human God who created them, loves them more. And so we continue to pray for people, but that has to be combined with a trust in God that the judge of all the earth will do. Right. And that we can trust God with that person. That's the only place the assurance comes from. You're not going to get something more than that. The assurance has to come from trusting God."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9891.81,"end":9930.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because I think that, you know, for, for most of us probably if, if an angel, and we were convinced it was truly an angel, showed up and said, you know, your father is fine and he's going to be fine. For a lot of us, I think that would, we would stop praying for them. Right. Like, well, I mean, I had a revelation and he's fine. Right. So I think that that's. If someone had to ask why we don't get that kind of assurance, I think it's because it helps us to be faithful, that we don't have that sort of absolute epistemic. I know for a certain, this is the way it is kind of knowledge. Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9931.79,"end":9932.23,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9932.23,"end":9932.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9932.55,"end":9937.27,"speaker":"Fr Stephen De Young","text":"And even then we could Fall into doubt. Was that really an angel? Was that a demon trying to trick."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9937.27,"end":9948.92,"speaker":"Fr Andrew Stephen Damick","text":"Me for him anymore? Yeah. Am I remembering correctly? You know? Yeah, yeah, yeah. Right, right. Okay. I hope that's helpful to you, Mary. So here's the next one. And this is from Caitlin."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9949.8,"end":9978.37,"speaker":"Fr Stephen De Young","text":"Hi, Fathers, this is Caitlin calling from New Orleans, Louisiana. I have a question about the Theotokos. First, how should we understand the Theotokos title of Panagia or All Holy, Specifically in light of biblical passages such as Romans 3, which states that all men have sinned and fallen short of the glory of God? Second, what does the tradition of the Church teach about her title of Panagia? And how can this deepen my understanding of the Gospel? Thank you for taking my question."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":9979.25,"end":10023.21,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so, yeah, two parts, right. How can we call her Panaya, All Holy when the Scripture says that all have sinned? And, you know, what is the Church's teaching about this, about this title? I mean, with regards to the second, I don't know that there is a. A dogmatic teaching about it. Right. I'm sure some saints have reflected on this, but I. I don't know that I could point to something and say, this is the teaching about this title in the way that say Theotokos. Right. There's a very clear dogmatic teaching about that title. But Panaya is something that we call her. We call her All Holy. And I don't think that that's contradictory with. With the. The Scripture that says that all have sinned. What do you think, Father? Father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10024.49,"end":10038.29,"speaker":"Fr Stephen De Young","text":"Yeah. So I think we need to separate the idea of holiness from the idea of sinlessness. Now, there's also teachings in the Church regarding the Theotokos Sinlessness."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10038.29,"end":10039.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, sure."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10040.41,"end":10054.08,"speaker":"Fr Stephen De Young","text":"But that's a little separate from this title. Right. The All Holy One. Right. So we call the Ecumenical Patriarch is All Holiness."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10054.4,"end":10056.56,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Panayotatos."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10057.2,"end":10061.68,"speaker":"Fr Stephen De Young","text":"I'm not gonna name any names, but some of them have been sinners."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10062.56,"end":10065.68,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right, yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10066.24,"end":10111.46,"speaker":"Fr Stephen De Young","text":"Along the way. Right. Nestorius, for one. Right. And so Holiness, remember, at its sort of core usage, is talking about being set apart, being set apart for a special purpose. Right. And so what we're saying about the Ecumenical Patriarch is that he is a human who has been set apart for this most special purpose, this most special service in the Church. Right. And we're saying a similar thing about Paia, that she was, from her. Well, really from her conception, but from her birth to her death, she was set apart."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10112.1,"end":10112.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10113.06,"end":10147.26,"speaker":"Fr Stephen De Young","text":"She was holy, she was devoted, and she devoted herself entirely to God. Right. Her son. And so the importance of that title is then that it also represents a call to us. Right. To likewise devote ourselves. Devote ourselves to the service of Christ rather than all the other things that we can devote our time and attention and focus to."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10149.26,"end":10155.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, so this one is from Kathy."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10156.78,"end":10205.11,"speaker":"Fr Stephen De Young","text":"Hi, Fathers. This is Catherine from Canada and the Great White Saffon. I was wondering if you could tell me what the heck is going on with Samson. The guy's an absolute savage. And I just see a connection with him, the pillars falling in that. He. He does that. And it's rocks, obviously. And then if it's a connection symbolically to Cain with how in the book of Jubilees that his house falls in on him, which I'm assuming is stone, and then if there's a connection there with. With the Watchers and being buried underneath all of these rocks and under the mountains and things. And if there is something that is being transmitted that way, if that's. If you could explain that, that'd be amazing. Thank you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10206.96,"end":10217.2,"speaker":"Fr Andrew Stephen Damick","text":"I have to say, number one, I love the fact that she says she's from the Great White Zephone. And the fact that she describes Samson as an absolute savage, that's just great."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10217.28,"end":10219.04,"speaker":"Fr Stephen De Young","text":"I didn't know Bale lived up there."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10219.04,"end":10221.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Apparently Bale lives in Canada."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10222,"end":10224.4,"speaker":"Fr Stephen De Young","text":"We already mentioned him. Peugeot, can you confirm?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10225.04,"end":10244.16,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, this is what Catherine is saying. So. Yeah, I mean, well, for those who may not know, I mean, obviously we've talked about BAAL in the past and how BAAL lives on Mount Zaphon, but I think just within the Hebrew Bible generally. Right. Isn't Zaphon just kind of the term for the north?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10244.72,"end":10245.84,"speaker":"Fr Stephen De Young","text":"Yeah, it's the word for north."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10245.84,"end":10249.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right, right. So she's making a very funny pun."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10251.2,"end":10252.56,"speaker":"Fr Stephen De Young","text":"Now that you've explained the joke."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10252.96,"end":10283.9,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, I'm an explainer of jokes. Can I say I live with four small people. They need to have jokes explained to them. So sometimes it's just a habit. Yeah, that's true. It's true. Is there something that, that she's got going on here? You know, she talks about Samson being buried under rubble and in. I think it was, she said in Jubilees, Cain's house falls in on him. And then there's this reference to the Watchers being buried underground. Is. Is this a deliberate symbolic parallel going on here?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10284.78,"end":10296.31,"speaker":"Fr Stephen De Young","text":"Yeah, so there is this pattern. It goes back pre linguistic. So, hey, we get to go back to the Neolithic era."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10296.39,"end":10296.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10299.27,"end":10310.63,"speaker":"Fr Stephen De Young","text":"Well, first time this episode. But as is our want in general, so we have these burials where rocks are placed on the bodies."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10311.11,"end":10311.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10313.52,"end":10323.28,"speaker":"Fr Stephen De Young","text":"And there's a lot of debate as to exactly why. Because it's pre linguistic, so we don't have like written sources explaining what's going on."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10323.44,"end":10323.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10325.52,"end":10369.89,"speaker":"Fr Stephen De Young","text":"So in general, people have the general agreement that it's to somehow keep the person or the body down. So there's one interpretation that is that they thought this person might come back like Ricolaka style. Right. To haunt the community. And so they're weighing it down with rocks. There's also the thought that they're trying to like push them down into the underworld or keep them down in the underworld, which is related to the other one. But either way that would indicate that this person is under a curse. Right. It's not a blessing to have them put the rocks on you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10369.89,"end":10370.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10372.41,"end":10378.97,"speaker":"Fr Stephen De Young","text":"And we do. There are other examples too. You look at the testament of Abraham and Azazel gets buried under rocks."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10379.93,"end":10381.77,"speaker":"Fr Andrew Stephen Damick","text":"Doesn't Absalom get buried under rocks?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10383.13,"end":10411.21,"speaker":"Fr Stephen De Young","text":"Yes. Job's family has the house fall on them. And so that is a general indicator that this is a death under some kind of curse. Curse. That's part of what's going on in Job. It's not just that his family all dies, it's that they die in this sort of horrible way. Right. It's kind of unblessed way. And part of that with, with building collapses and that kind of thing, part of it is that you're not actually buried also."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10412.01,"end":10413.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10413.13,"end":10448.92,"speaker":"Fr Stephen De Young","text":"Like you're in this rubble, you're under these rocks and so you can't get to the body and bury it. Right. So there's sort of an abandonment thing connected to it. A lot of times when we're talking about the Watchers and Azazel and stuff, it's out in the wilderness too. But so yeah, these are all bad things. This is a bad end. Right. That Samson means. I know people love when I talk about. But yes, this is to indicate that he met kind of a. He got his revenge, but he met kind of a bad end in the process."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10449.32,"end":10456.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, cool question, Catherine. All right, our final question now is from Clay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10457.88,"end":10466.04,"speaker":"Fr Stephen De Young","text":"Hey fathers, this is Clay from Columbus, Georgia. I was calling in to ask a question about the creature called A Z's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10466.04,"end":10466.92,"speaker":"Fr Andrew Stephen Damick","text":"Z I Z."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10469.08,"end":10470.64,"speaker":"Fr Stephen De Young","text":"Which seems to be."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10470.64,"end":10476.74,"speaker":"Fr Andrew Stephen Damick","text":"A primordial creature similar to Leviathan and behemoth Jewish mythology and mentioned a couple."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10476.74,"end":10479.62,"speaker":"Fr Stephen De Young","text":"Times in the Psalms, but it doesn't."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10479.62,"end":10482.1,"speaker":"Fr Andrew Stephen Damick","text":"Seem to have that same chaos implication."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10482.5,"end":10487.98,"speaker":"Fr Stephen De Young","text":"I was wondering if there was any similarity here to cherubs or if there's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10487.98,"end":10493.3,"speaker":"Fr Andrew Stephen Damick","text":"A reason why you think that that one may not be portrayed as bad."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10493.46,"end":10498.66,"speaker":"Fr Stephen De Young","text":"In mythology, whereas the other two are. Any thoughts or comments would be great. Thanks."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10499.48,"end":10513.64,"speaker":"Fr Andrew Stephen Damick","text":"Okay, what I had to save this one for last. What is the. The Z's? Z? I. Z. I had to look this up and I still only have the slightest touch of knowledge about this. Now, what is a Z's father?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10514.28,"end":10519.72,"speaker":"Fr Stephen De Young","text":"Yeah. So I've been told that night Ol will help you get the Z. Oh, wow, that's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10519.72,"end":10521.04,"speaker":"Fr Andrew Stephen Damick","text":"That's an old ad man."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10521.04,"end":10522.36,"speaker":"Fr Stephen De Young","text":"I haven't thought they get in the crates."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10522.52,"end":10523,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10525.49,"end":10535.09,"speaker":"Fr Stephen De Young","text":"But this is also not ZZ Top, Though the Z's did have legs and presumably didn't know how to use them, though. Primarily flew."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10535.25,"end":10551.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And there is a Wikipedia article about Z's which defines it as a giant griffin like bird in Jewish mythology said to be large enough to be able to block out the sun with its wingspan. Yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10551.02,"end":10552.06,"speaker":"Fr Stephen De Young","text":"Which is a big bird."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10552.3,"end":10552.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10553.42,"end":10555.34,"speaker":"Fr Stephen De Young","text":"Now we're going to ruin Sesame street for people."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10555.82,"end":10559.18,"speaker":"Fr Andrew Stephen Damick","text":"Is Big Bird. Aziz write in. Let us know."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10560.06,"end":10581.77,"speaker":"Fr Stephen De Young","text":"So the places in the Hebrew Bible where he shows up are Psalms 50 and 80 or 49 and 79. He's mentioned and gets lost in a lot of English translations. And both of those are not really negative references."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10585.13,"end":10585.69,"speaker":"Fr Andrew Stephen Damick","text":"There's."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10587.53,"end":10591.13,"speaker":"Fr Stephen De Young","text":"One of the funniest things I've ever read in a Jewish Haggadah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10592.81,"end":10598.25,"speaker":"Fr Andrew Stephen Damick","text":"I just like that clause. One of the funniest things I've ever read in a Jewish Haggadah. Sorry."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10598.33,"end":10601.37,"speaker":"Fr Stephen De Young","text":"Is actually about the Z's, because."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10603.65,"end":10603.77,"speaker":"Fr Andrew Stephen Damick","text":"One."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10603.77,"end":10651.34,"speaker":"Fr Stephen De Young","text":"Of the Hagadot talking about the Z's talks about how one time the Z's accidentally laid an egg while in flight. Okay. And the egg fell and, like, wiped out a bunch of cities from the. The embryonic fluid in the egg. Like the. The egg white, I guess, like, flooded it wiped out a bunch of cities and, like, leveled a cedar forest in Lebanon. Right. With the explosion when it landed. But this is the great part, is that after telling that story, the Haggadah says, fortunately, such things do not often happen. And that is just amazing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10651.5,"end":10651.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10653.1,"end":10660.52,"speaker":"Fr Stephen De Young","text":"I think we could all be glad that that only happens once in a while. Wow. It is not an everyday occurrence."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10662.68,"end":10666.12,"speaker":"Fr Andrew Stephen Damick","text":"So I've seen the idea that it's sort of like the Jewish version of a phoenix."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10667.08,"end":10671.64,"speaker":"Fr Stephen De Young","text":"Well, it actually seems to be the Hebrew version of Anzu."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10672.04,"end":10674.36,"speaker":"Fr Andrew Stephen Damick","text":"Anzu? I don't know what that is."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10675.32,"end":10678.04,"speaker":"Fr Stephen De Young","text":"We have mentioned Anzu once before on the podcast."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10678.04,"end":10681.08,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I didn't remember living in a tree."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10681.24,"end":10690.37,"speaker":"Fr Stephen De Young","text":"Anyway, but Anzu is usually just depicted As a giant bird."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10690.69,"end":10691.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10691.49,"end":10723.65,"speaker":"Fr Stephen De Young","text":"It's sort of this magnificent creature, like of the gods. Right. It's this primordial creature. It's descended from like the sky and the earth. Right. So it's this creature and it's portrayed as sort of noble but also kind of mischievous because like his first, his most famous exploit is stealing the tablet that gave Enlil, like rule of the universe."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10724.21,"end":10724.69,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10725.09,"end":10728.41,"speaker":"Fr Stephen De Young","text":"When Enlil was the most high God, he had this tablet that was like."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10728.41,"end":10730.13,"speaker":"Fr Andrew Stephen Damick","text":"The deed, the one ring."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10731.81,"end":10733.57,"speaker":"Fr Stephen De Young","text":"Well, it was literally like the property deed."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10733.57,"end":10741.19,"speaker":"Fr Andrew Stephen Damick","text":"The property cosmos. Yeah. I mean, you know, but if it gives you rule of the universe. No. Yeah. So it gave him the right, the right to the rule of the universe, basically."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10741.67,"end":10745.07,"speaker":"Fr Stephen De Young","text":"See the scroll with the seven seals in Revelation, by the way, on that?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10745.07,"end":10749.11,"speaker":"Fr Andrew Stephen Damick","text":"But that should be a future episode. The."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10749.59,"end":10778.62,"speaker":"Fr Stephen De Young","text":"So that he has this tablet that says he's the boss of everybody. And Anzu, like flies by and grabs it and takes it to his nest like up on a mountain. And so then Enlil says, hey, somebody help me out with this, this. And so in the earliest form of this, Ninurda, who as I think we've mentioned before on the podcast, is linguistically identical to the Nimrod of the Bible, who remember, is described as a mighty hunter before the Lord."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10778.62,"end":10779.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10780.14,"end":10790.54,"speaker":"Fr Stephen De Young","text":"Ninurda or Nimrod, goes and manages to, in a feat of archery, kill Anzu and get the tablet back."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10792.22,"end":10792.54,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10795.42,"end":10810.22,"speaker":"Fr Stephen De Young","text":"So he's sort of. Ninurta sort of has this hunter thing going on too. That's how Ninurta kind of gets promoted up the ranks. But. So the Anzu was used by the Assyrians and the Babylonians as sort of a symbol of power."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10812.62,"end":10817.16,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I was going to say, I see that some depictions of it are of a lion headed eagle."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10817.47,"end":10869.29,"speaker":"Fr Stephen De Young","text":"So. Right. So sometimes, usually it's just a big bird, but you do get some. Where it's got a lion head. That's where you get the griffin thing. Yeah, the griffin connections. And so when, for example, I think it's in Psalm 50:49 that God says in the Hebrew, disease is mine. Right. He. It's, it's Yahweh sort of reclaiming this symbol of power from these foreign gods. Like, no, these magnificent creatures belong to me. They aren't symbols of your power, they're my power. Right. Sort of in that reclaiming kind of context. So that's why we did talk about the Z's on the monster episode. Because he's not really a monster."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10869.45,"end":10871.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10871.53,"end":10873.61,"speaker":"Fr Stephen De Young","text":"He's sort of in a different category."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10873.77,"end":10875.29,"speaker":"Fr Andrew Stephen Damick","text":"A mythic being of sorts."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10875.93,"end":10882.49,"speaker":"Fr Stephen De Young","text":"Yeah. And through Anzu, people have tried to tie it to the Greek phoenix, but I think it's closer to the Greek."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10882.73,"end":10885.45,"speaker":"Fr Andrew Stephen Damick","text":"Griffin, Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10888.41,"end":10892.89,"speaker":"Fr Stephen De Young","text":"Than to than to the phoenix, even though the phoenix is also obviously a bird."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10893.13,"end":10893.53,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10894.26,"end":10894.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10895.3,"end":10919.4,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Well, that is our Speak Pipe Palooza episode from A to Z's. Thank you very much everyone for listening. If you can't get through to us live, we'd still love to hear from you. You can email us@lordofspiritsancientfaith.com message us at our Facebook page. Or like this episode, leave us a voicemail@speakpipe.com."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10922.43,"end":10936.51,"speaker":"Fr Stephen De Young","text":"And we will speak back down the same or another closely related pipe and join us for a live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Zooming soon."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10936.67,"end":10951.64,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook like our page, join our discussion group. Leave reviews and ratings everywhere. But most importantly, please share this show with a friend whom you knew is going to love it or that you know is going to hate it. Because like we said, we have special prayers for those who hate us or."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10951.96,"end":10961.64,"speaker":"Fr Stephen De Young","text":"Just ambivalent toward it. And finally, be sure to go to asiafaith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10961.72,"end":10964.2,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10968.12,"end":10997.98,"speaker":"Fr Stephen De Young","text":"You've been listening to the Lord of Spirit Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and rich riches, and wisdom and."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":10997.98,"end":11001.98,"speaker":"Fr Andrew Stephen Damick","text":"Strength and honor and glory and Blessing."}
{"episode_id":"LOS - #039 - 2022-03-24 - Pantheon and Pandemonium III - Asynchronous Q&A March 2022","start":11002.38,"end":11005.34,"speaker":"Fr Stephen De Young","text":"Revelation chapter 5, verses 11 through 12."}
