{"episode_id":"LOS - #121 - 2025-07-24 - Storytime with Fr. Stephen","start":0.16,"end":2857.75,"speaker":"Fr Stephen De Young","text":"Sam Sa Hello, Lord of Spirits listeners, this is Father Stephen Dion. Father Andrew unfortunately has decided to give you up, let you down, run around and desert you in order to go to the Archdiocese convention. And so I thought to myself, self, I thought, what could I possibly do to slake the insatiable thirst of our listeners for content? And so once again, as has happened a few times in the past when Father Andrew has deserted his post, I will be reading you some texts from the ancient world. Two different ones, two very different genres, two different civilizations they come from. The first of these texts is what is referred to by scholars as the memphite theology from Egypt. So this is a text from the Old Kingdom. Now it's kind of interesting because the copy, as it were, of the text that we have is not really like a copy of the text. In around 710 BC, an order was given by the then Pharaoh of Egypt to carve the text into stone, into a stone monument. And so the text as we have it, and as I'm going to be reading it to you, comes from this stone. But based on the language, we know that it's very much older than that. We know that it goes back to the Old Kingdom, Egypt. So we're talking a thousand plus years before that. And that's acknowledged by the inscription itself because we're told the reason we know it's around 710 B.C. is that we're told that the reason the pharaoh gave this order for the text to be copied and carved into stone is that the existing copies of the text in his day in 710 BC were badly worm eaten and ragged. So these are ancient preserved, decomposing texts being preserved by the priests. And when it is learned by the pharaoh that all the copies they have are kind of moldering, he says, well, we need to preserve this permanently. Which is interesting in and of itself because it means that not just that the pharaoh would be concerned about these texts and preserving them, but this text in particular. He didn't do this with all the texts, of course. This text in particular, and the reason I'm going to be reading it and commenting on it a little bit, is a text that is written during a very formative, early formative period of Egyptian religion as such. Meaning we've talked before, I know on the show about how Egypt, like most pagan nations, starts out as separate cities with separate gods and separate religious traditions. As larger political units come into being that encompass multiple cities, then theology in the ancient world and what this text is an example of was the way in which the priesthoods and the people and those traditions would then be integrated together into one whole for the new socio political unit. And this particular text that's referred to as the Memphite theology, it's called that because part of what occasions it is that Memphis has become the capital of Egypt is written at the point where Upper and Lower Egypt are first unified. So this is where we first have sort of a full Egypt as we think of Egypt. So Egypt is made up of two parts, Upper and Lower Egypt. It's kind of counterintuitive for us as modern Americans, because as modern Americans and probably most modern people, we see north as up on the map and south as down. So people will assume that Upper Egypt means Northern Egypt and Lower Egypt means Southern Egypt. And it's the exact opposite. Upper Egypt is in the south, Lower Egypt is in the north. And it's because that's the direction in which the Nile river flows. So it's upstream in the Nile is south, downstream is north. And so that's the basis for calling Upper Egypt Upper Egypt and Lower Egypt Lower Egypt. Upper Egypt was seen by the Egyptians themselves as being the older part of the civilization and Lower Egypt is the newer portion of the civilization. But so now we've reached a point when this text is being written where they've been united under one king, under one pharaoh whose capital is in Memphis. So this text is aimed at doing the work of integrating all of the diverse religious traditions and deities who are being worshiped and spirits that are being worshiped and religious practices of all of those areas into some kind of cohesive whole. And that's done not just by handling the practicalities, although we'll see it gets down to fair practicalities by the end of the text. It's done not just by dealing with those practicalities, but by positing a story. Things happening among the gods, things happening in the heavens that are then paralleled by this socio political transformation that is happening on earth within Egyptian society. So with all that sort of set as preamble, we will get into the text of the memphite theology as we now know it. The living Horus, who prospers the two Lands. The two ladies who prospers the two Lands. The golden Horus who prospers the two Lands. The king of Upper and Lower Egypt, Neferkhare, the son of Re Shabala, beloved of Ptah, south of his wall, who lives like Re forever. So that's the introduction. This is talking about the pharaoh who has occasioned this text Sponsors this text. This first pharaoh. The two lands are Upper and Lower Egypt. Those are also referred to as the two Ladies. These references to the living Horus and the golden Horus in this period. This is another thing that tracks this back to the Old Kingdom. In the Old Kingdom, the pharaoh was seen to be. Every pharaoh was seen to be sort of incarnation, right? An embodiment of the God Horus, who was the firstborn son of Re, the sun God. But notice here in this, already related to the two lands, Upper Lower Egypt coming together, we have this paralleling of Ptah, south of his wall, right? Ptah from Upper Egypt. The God Ptah, which is spelled with a P, P, T, A H, usually in English, being paralleled with Re, the sun God. This writing was copied out anew by His Majesty in the house of his father Ptah, south of his wall. For His Majesty found it to be a work of the ancestors which was worm eaten, so that it could not be understood from beginning to end. His Majesty copied it anew so that it might become better than it had been before, in order that his name might endure in his monument last in the house of his father Ptah, south of the wall, throughout eternity as a work done by the son of Re for his father Ta Tanan, so that he might live forever. And then there's a little section where there are some pieces missing. There are four lines where there are some names missing. It's the conclusion of this introduction. So it's a lot about, you know, the joining together of Upper Lord Egypt, etc, etc. But now when we get to the seventh line of text and it picks up again, we don't have the lacunae, we don't have the missing pieces again. And we have this scene. Geb, lord of the gods, commanded that the nine gods gather to him. He judged between Horus and Seth. He ended their quarrel. He made Seth king of Upper Egypt in the land of Upper Egypt up to the place in which he was born, which is Sue. And Geb made Horus king of Lower Egypt in the land of Lower Egypt up to the place in which his father was drowned, which is division of the two lands. Thus Horus stood over one region and Seth stood over one region. They made peace over the two lands at Aen, that was the division of the two lands. So what's being depicted here is this idea that Horus, who was seen as the primary God of Lower Egypt, is the. Is the primary God there. Seth is the primary God in Upper Egypt in the south. And the fact that the Two were disunified. The fact that there were frequent wars that happened between these two regions was seen as reflecting a feud between Horus and Set between the two gods. Once the two are joined together into this new political reality. Well, clearly Horus and Set must have made up, right? So they've now made peace and. Well, how could they have made peace? Well, Geb, who's sort of the original guy, must have called all the gods together and sort of sorted this out, held a peace summit. Geb, by the way, you probably haven't heard a lot about Geb, even if you're fairly familiar. Like you may be wondering why that's Geb instead of Re, the sun God Horus. Father, Geb is the actual sort of original Most High God for Egypt. And as we've talked about on the show, like all original most high gods, he very early already by the Old Kingdom period in texts we have has sort of drifted off. There aren't sort of temples to him. The worship of him is not like a live thing. He's sort of this posited most High God part of the missing text. It seems like they referred to Geb as self begotten, meaning like the other ones come from him, but we don't know much about him. So this is sort of a brief appearance here where he's sort of brokering this sort of peace deal. Now we'll get a little more. Oh, also notice, by the way, that there's a place where Seth was born. So there's still a live connection right within paganism. We've talked about this with Zeus and the Greeks, where there are actually several traditional birthplaces. They had the idea that these gods who they were worshiping came into being might at some point die, right, like and came into being at a time and even a place associated with it, unlike the Most High God. Geb's words to Seth, go to the place in which you were born. Seth, Upper Egypt. Geb's words to Horus, go to the place in which your father was drowned. Horus, Lower Egypt. Geb's words to Horus and Seth, I have separated you Lower in Upper Egypt then it seemed wrong to Geb that the portion of Horus was like the portion of Seth. So Geb gave to Horus his inheritance for he is the son of his firstborn son. So this is pointing to Re, Right, the sun God. Let's think about Re, the sun God having drowned. This is about the sun setting over the sea. There's a sort of constant cycle. But Re, the Reason Rey sort of became so prominent is that he's the firstborn son of Geb. This most high God, Horus is the firstborn son of Geb's firstborn son. And that's why. So it's saying. It's answering the question. Well, wait a minute. That's how they got separated in the first place. Why was Lower Egypt, why was Horus portion bigger, geographically, stronger, more predominant? Oh, well, that's because firstborn son of the firstborn son, like Taurus, a little better. Geb's words to the nine. I have appointed Horus the firstborn. Geb's words to the nine gods, him alone, Horus, the inheritance. Geb's words to the nine gods. To this heir, Horus, my inheritance. Geb's words to the nine gods. To the son of my son, Horus, the jackal of Upper Egypt. Geb's words to the nine gods, the firstborn, Horus, the opener of the ways. Geb's words to the nine gods, the son who was born Horus on the birthday of the opener of the ways. Then Horus stood over the land. He is the uniter of this land, proclaimed in the great name Tatenan, south of his wall, Lord of eternity, the great name. Whenever you see in an Egyptian text the great name, it's referring to the name of the pharaoh, which was the Horus name, especially in the Old Kingdom. So that's why Horus is connected with this idea of the great name. Then sprouted the two great magicians upon his head. He is Horus, who arose as king of Upper and Lower Egypt. He united the two lands in the nome of the wall, the place in which the two lands were united. The nome there is n o m e. Nomes were geographic divisions of ancient Egypt, kind of like maybe counties in modern regions. Reid and Papyrus were placed on the double door of the house of Ptah. That means Horus and Seth, pacified and united. They fraternized so as to cease quarreling in whatever place they might be being united. In the house of Ptah, the balance of the two lands in which Upper and Lower Egypt had been weighed. Okay, so I know this sounds a little weird. So what's happening here? Why is Ptah, this God, being introduced? Well, Ptah is a God involved with sorcery and magic. We heard about the magicians, right? And ancient knowledge, who was primarily a God, worshiped in the south. There was a lot of enmity between Horus worshipers and Seth worshipers. And so when we have this combined unit which is being ruled over by someone from Lower Egypt, so someone who is seen as the incarnate Horus. They thought trying to sell this kind of Horus and Seth marriage might be hard to the Southern religious hardliners. And so what they're doing right here, beginning in this paragraph, I just read, they're starting to marginalize Seth, even though historically he had been the most prominent deity in the south, in Upper Egypt. And instead, they're choosing another very prominent God in that region and sort of elevating him and arguing that Ptah. And here what they really mean is the worship of Ptah, the rituals related to Ptah sort of unites elements of the worship of Horus. Right? Because Horus had had this connection to magic. This had come from his head. And also, right. The Southern traditions related with Set. And so Ptah is here being put forward as this sort of unity God. Right. We got to replace this rivalry. So first we say, well, they've given up their rivalry, but now Ptah is being put forward. And particularly the cult of Ptah. We got to think about the religious observances here. The worship of Ptah, this is being put forward as sort of. Well, we'll unify things into and around the religious observances of Ptah. This is the land. The burial of Osiris in the house of Sokar, Isis and Nephthys without delay, for Osiris had drowned in his water. Isis and Nephthys looked out, beheld him, and attended to him. Horus speaks to Isis and Nephthys. Hurry. Grasp him. Isis and Nephthys speak to Osiris. We come. We take you. They heeded in time and brought him to land. He entered the hidden portals in the glory of the lords of eternity. Thus, Osiris came into the earth at the royal fortress to the north of the land to which he had come. And his son Horus arose as king of Upper Egypt, arose as king of Lower Egypt in the embrace of his father, Osiris, and of the gods in front of him and behind him. So I'll pause here that this is going to continue. And so now we're taking a cut. Now Osiris shows up. So we're taking the circuitous route, and we're getting sort of a very, very quick, you know, story so far. There's an assumption here that the original readers were familiar with the story of Osiris, of his death and resurrection. And so this is going to be another piece of this puzzle. So Osiris was from the south, he was from Upper Egypt. But as that story unfolds, that story involves Horus, who is related to him. And re got to remember the Egyptian practice of royal close marriage. So Osiris story sort of begins. Short version begins in the south, ends in the north, comes to involve Horus. And so Osiris here is now being used and his story is being used to help further this unification narrative. But it's going to continue. There was built the royal fortress at the Command of GEB. GEB speaks to Thoth. GEB speaks to Thoth dot GEB speaks to ISIS. Isis causes Horus and Seth to come. Isis speaks to Horus and Seth. Isis speaks to Horus and Seth. Make peace. Isis speaks to Horus and Seth. Life will be pleasant for you. Isis speaks to Horus and Seth. It is he who dries your tears. So we've worked in a whole bunch of other figures. And so we're getting this brief very abbreviated. And it's punchy this way on purpose because again, the assumption is you're familiar with the story. But the idea is, see, look, Osiris's story, which is this very important story religiously and is involved with the worship of Ptah, this Osiris story that, you know, notice how it involves all of these deities, right? Even Geb, who, you know, built the. The royal palace for Osiris. But it involves all of these deities, right? So this story, this central story unites everything. So really, were we really all that disunited ever? Right. And particularly here, you notice at the end of their accounting, this story unites Horus and Seth back together. But so now we're going to set aside that story. And now we're going in hard on Ptah. So we've posited now Ptah is going to be sort of our unity God, unifying all the stuff we liked about Horus and all the stuff we liked about Seth, but bringing them together and at peace. So now, well, hey, tell us more about this Ptah guy who you're saying is so great. The gods who came into being in Ptah. Ptah on the great throne. Ta nun the father who made Aten. Ta now net the mother who bore Atum. Tah the Great is heart and tongue of the nine gods. Tah, who bore the gods. Tah, who bore the gods. Tah. Ta Nefertim at the nose of Re every day. So Tah, he's up there. He's up there with Re, right? He's up there, the sun God. He's on this other Tier. He's in a tier above, because Horus's father, right, he's a tier above Horus and Seth, he's on this other tier. Notice Tah. In these two different hypostases, these two different versions of Ptah, what is Atum's father and what is Atum's mother, right? So you can see there's a certain slipperiness to Tah's even gender. Ptah is here being set up as this summation not just of Horus and Seth now, but sort of all the gods, the worship of all the gods of all these diverse places that are now part of Egypt really. This is all taken up in the worship of Ptah. And so this cult can sort of unify us all. If you're an Egyptian of the old kingdom. There took shape in the heart, there took shape on the tongue, the form of Atum, for the very great one is Ptah, who gave life to all the gods. And they are Ka through this heart and through this tongue in which Horus had taken shape as Ptah, in which Thoth had taken shape as Ptah. So one of the things Ptah was associated with as just a God in the south was craftsmanship, the making of things, the creation of things, the invention of things. And so the idea here is that he's not just a shaper of things, but even the gods really, we're all sort of shaped by him. So whatever God you're going to talk about that you might want to worship somewhere else. Okay, sure. But the only reason that God, even someone like Horus or Thoth, who are higher ranking at the time, they really have the form they have, you think about them the way you do, they've been shaped by Ptah, which means Ptah is de facto greater, is the idea. Thus, heart and tongue rule over all the limbs in accordance with the teaching that it the heart or he is in every body, and it the tongue or he, Ptah, is in every mouth of all gods, all men, all cattle, all creeping things, whatever lives, thinking whatever it wishes and commanding whatever it wishes. So Ptah was referred to by his worshipers as the heart and the tongue of the gods. And so this is making the argument, well, look, the heart and the tongue rule over the body of any thing. A human is ruled by their heart, by their tongue. And so, you know, even cattle, right, animals are ruled by their heart and by their tongue. Everything that's alive is ruled by their heart and by their tongue. Therefore, if he is the heart and the tongue of the Gods. He must rule the gods. This is again, this is why it's called the Memphi theology. This is. This is the ancient form of theological argument. His Ennead is before him as teeth and lips. They are the semen and the hands of Atum. For the Ennead of Atum came into being through his semen and his fingers. But the Ennead is the teeth and lips in this mouth which pronounce the name of everything from which Shu and Tefout came forth and which gave birth to the Ennead. Okay, so this is talking about the other gods, right? Coming into being. And the Old Kingdom creation myth with Atum, where he spoke the universe into being. This is taking that story. There's also, as you just heard, semen involved. I won't go into much more detail on that. Some other time we'll talk about that creation myth. But this is making the argument that, well, look, if he's the tongue of the gods, then when this creation myth happens, and sure, it's this other God who's creating the world, but how is he creating it? He's creating it by speaking. Speaking. You got teeth, you got lips, you got a tongue, Right? Which means Ptah is really the one who's behind this whole creating the world thing, too, and creating the other gods. Sight, hearing, breathing, they report to the heart, and it makes every understanding come forth. As to the tongue, it repeats what the heart has devised. Thus all the gods were born and his Ennead was completed. For every word of the God came about through what the heart devised and the tongue commanded. So this is continuing that argument. Heart functioned for ancient Egyptians and in most of the ancient world, sort of the way brain does for us. Right? So we would say, like sight, hearing, breathing, like smelling, that our senses sort of report to our brain, whereas they would understand it's reporting to the heart. The heart would then consider. And so it's saying, look, whatever you want to call these other gods, you could call them the eyes of the gods or the ears of the gods or whatever. All those report to the heart. So if Ptah is the heart of the gods, well, then, see, he's once again really in charge, isn't he? Thus all the faculties were made and all the qualities determined. They that make all foods and all provisions through this word. Thus justice is done to him who does what is loved and punishment to him who does what is hated. Thus life is given to the peaceful, death is given to the criminal. Thus all labor, all crafts are made. The action of the hands, the motion of the legs, the movements of all the limbs, according to this command, which is devised by the heart and comes forth on the tongue and creates the performance of everything. Again, this is saying, it's your heart. We would say mind, but rhythm, heart that considers what justice is, that controls all the limbs of the body, that controls all the. And all these things that are listed here are things that were associated with other Egyptian gods, like justice or hands, right? Doing certain things, right? The right hand being associated with war and these kind of things, and saying all those things are governed by the heart. And what it considers. If Ta is the heart, then he's. He's on top. Thus it is said of Ta, he who made all and created the gods, and he is Tatanan, who gave birth to the gods and from whom everything came forth. Foods, provisions, divine offerings, all good things. Thus it is recognized and understood that he is the mightiest of the gods. Thus, Ptah was satisfied after he had made all things in all divine words, he gave birth to the gods. He made the towns, he established the gnomes, he placed the gods in their 60 shrines, he settled their offerings, he established their shrines, he made their bodies according to their wishes. Thus the gods entered into their bodies of every wood, every stone, every clay, everything that grows upon him in which they came to be. Thus were gathered to him all the gods and their cause content, united with the lord of the two lands, right? So, see, he's the top God. In fact, he even made their idols. Now, of course, we know that's not true, right? And so they have to kind of back that up a little bit, because he says, well, he made their bodies. The bodies is referred to the idols. That's why it says of wood, of stone, of clay. It talks about them entering into those bodies, right? As we've talked about how idolatry worked in the ancient world. But they say, well, all those things, the wood, the stone, the clay, they were all grown on him, like he's kind of the earth itself, right? So he kind of made those things. And so indirectly, yes, someone made that idol out of wood, but he. He made the wood. So there you go, right? This is all by way of argument. Now, this is being put forward as an argument because at the time this text is coming out, Memphis is the new capital, meaning Memphis is now the supreme city. And the cult of Ptah in Memphis is now going to be the supreme sort of pharaonic cult. And this is an argument being put forward for why that is correct and right to these Other cities that worship upwards of 60 other gods and had long histories and stuff of doing so, and where other gods cults had been more predominant over Ptah until very recently. But all of this is an argument. It's an argument being made. It's not presenting things that were already believed. It's being imposed. And the sociopolitical reality of Egypt now having come together as one whole and being ruled from Memphis is a big part of the evidence that this is true. It's sort of a circular thing. Well, how do we know that it is right that Memphis now rules over all of Egypt and Ta is being worshiped as the most powerful God? Well, we know that that is right because it happened. And Tah is the most powerful God. Right. And here's the argument. This is not a way of arguing that would work in the modern world, but with your village atheist. But we have to get her back into the ancient pagan world. And so then the text concludes. The great throne that gives joy to the heart of the gods in the house of Ptah is the granary of Ta Tenen, the mistress of all life through which the sustenance of the two lands is provided. Owing to the fact that Osiris was drowned in his water. Isis and Nephthys looked out, beheld him, and attended to him. Horus quickly commanded Isis and Nephthys to grasp Osiris and prevent him drowning. They heeded in time and brought him to land. He entered the hidden portals in the glory of the lords of eternity and the steps of him who rises in the horizon on the ways of Re. At the great throne, he entered the palace and joined the gods of Tatenan. Ptah, Lord of Years. Okay, so we get another recap of the Osiris story. The Osiris story of him drowning and returning alive is really about the cycle of the seasons, the flooding of the Nile. That's why it's a drowning death. The flooding of the Nile that then deposits silt which allows for the growing of fertile crops comes in its time. Tatenan here is a goddess who is associated with the harvest, who are now told is, oh, by the way, also Ptah. They're the same person. Essentially. This is a hypostasis of Ptah. But also, see, Ptah is really in the background of this Osiris story. This is all being pulled together again. Thus, Osiris came into the earth at the royal fortress to the north of the land to which he had come. His son Horus arose as king of Upper Egypt. Arose as king of Lower Egypt in the embrace of his father Osiris and of the gods in front of him and behind him. So this sums it up. And so this is why we are now being all governed from Memphis by the incarnate Horus, the current pharaoh. And the way we are going to express that is through participating in the cult of Ptah. That's the sort of end result of that text. So I wanted to read that text because it was sort of interesting in terms of giving an idea of what theology looked like in the ancient world. Part of the reason why that's important on this show is we've tried to talk a lot about how theology works in the Old Testament. And there are a lot of places in the Old Testament that we've talked about where theology is done in this sort of ancient way, where a familiar story, like the story of the Flood is taken and retold, but retold with differences and with a purpose. And so that was a way of doing theology. That was a way of saying, who is truly God? They didn't do theology the way Thomas Aquinas did theology in the Torah then. I'm not picking on Thomas Aquinas. They didn't do it the way St. Gregory Palamas or St. Basil the Great did it either. Right. We're at a fundamentally different time and place. They did theology by taking these familiar stories, these mythopoeic stories, and reframing them and reframing them with a specific intent to teach certain things, a polemic intent, often to say, well, no, these other folks have it wrong, and to recast and reshape theological thinking in a different kind of way. And so that was an Egyptian example of that, of taking the Osiris myth, taking relationships between the gods and things and recasting them and retelling the story in this new way with this sort of socio political end, which wasn't separate at the time from a religious end. And so as I said, that's something we see reflected in certain places when BAAL language is used in the Old Testament or where ancient Near Eastern flood stories are referenced but changed, and it's often inverted in certain ways. So all that said, that's why I wanted to read that one. We're sort of going to now have something completely different and we're going to read a very different kind of text from a long time later. This was somewhere in the middle of the first millennium bc. This is a Babylonian text. And I say it's completely different because this is not theological in the least. It does not have any direct tie to anything we really talk about on the show. It is literally just funny. And I don't mean it's funny like we look back and point at it and laugh. I mean it's funny. Like the genre of this Babylonian text is dark comedy, very dark comedy. So you've been warned about the very dark already. What you find in Mesopotamian. Mesopotamian culture is particularly pessimistic about everything. When you start reading a lot of, like, Akkadian texts and stuff, Sumerian stuff is even worse. Very pessimist. You even think about, like, the Epic of Gilgamesh does not have a happy ending even remotely for anybody involved. They don't do happy endings. There's the things that ended death. Death comes when you don't want it. The gods that they worship don't particularly like them. Not like they don't like the gods. Like, the gods don't like humans. Like, like, not only do they not care, there's like, some antipathy there. A lot of the Mesopotamian worship is aimed at sort of warning them off and keeping them away. So it's a very pessimistic culture. So when they decide to do comedy, when they decide to be funny, it ends up being sort of super dark. So this is. You've been warned. This is a text, a comedy text. They set up as a dialogue between a servant and his master. So the servant and the master are just talking back and forth. So it's almost like a comedy skit. This is essentially an ancient Babylonian comedy skit. Servant, listen to me. Yes, master. Yes. Quickly get me the chariot and hitch it up for me so I could drive to the palace. Drive, master, drive. It will bring you where you want to go. The others will be outclassed. The prince will pay attention to you. No, servant, I will certainly not drive to the palace. Do not drive, master. Do not drive. The prince will send you off on a mission. He will send you on a journey that you do not know. He will expose you to discomfort day and night. Servant, listen to me. Yes, master. Yes. Quickly bring me water to wash my hands. Give it to me so I can dine. Dine, master, dine. Regular dining expands the inner self. He who eats well is his own God. Shamash goes with him whose hands are washed. No, servant, I will certainly not dine. Do not dine, master. Do not dine. Hunger then eating, thirst then drinking. This is what agrees with a man. Servant, listen to me. Yes, master. Yes. Quickly get me that chariot and hitch it up so I can drive in the open country. Drive, master, drive. The roaming man has a full stomach. So the roving dog cracks open the bone. The roaming bird will find a nesting place. The wandering wild ram has all the grass he wants. No, servant, I will certainly not drive to the open country. Do not drive, master, do not drive. The roaming man loses his reason. The roving dog breaks his teeth. The roaming bird puts his home in the niche of a wall. And the wandering wild ass has to live in the open. Servant, listen to me. Yes, master, yes. I'm going to make a household and have a son. Do it, master, do it. The man who makes a household. No, I will certainly not make a household. Do not make a household. The one who follows such a course has broken up his father's household. He has gone in a door called the master. The man with a wife and child is credulous. Two thirds a fool. Servant, listen to me. Yes, master. Yes. I will do something dishonest. So do it, master, do it. Unless you do something dishonest, what will you have to wear? Who will give you anything so you can fill your stomach? No, servant, I will certainly not do something dishonest. Do not do it, master. Do not do it. The man who does something dishonest is executed or skinned alive, or blinded or apprehended or jailed. Servant, listen to me. Yes, master. Yes. I will fall in love with a woman. Go, fall in love, master, fall in love. The man who falls in love with a woman forgets sorrow and care. No, servant, I will certainly not fall in love with a woman. Do not fall in love, master. Do not fall in love. A woman is a pitfall. A pitfall, a hole, a ditch. A woman is a sharp iron dagger that slashes a man's heart. Servant, listen to me. Yes, master, yes. Quickly, bring me water to wash my hands. Give it to me so I can sacrifice to my God. Sacrifice, master, sacrifice. The man who sacrifices to his God makes a satisfying transaction. He makes loan upon loan. No, servant, I will certainly not sacrifice to my God. Do not sacrifice, master. Do not sacrifice. You will train your God to follow you around like a dog. He will require of you rights or a magic figurine or what? Have you listened to me? Yes, master, Yes. I will make loans. So make them, master, make them. The man who makes loans, his grain is filled. His grain while his interest is profit. No, servant, I will certainly not make loans. Do not make them, master, do not make them. Loan. Loaning is well. Maybe you will need to have this. Do not make the master. Do not make Them loaning is sweet as falling in love, getting back as painful as giving birth. They will consume your grain, be always abusing you, and finally they will swindle you out of the interest on your grain. Servant, listen to me. Yes, Master. Yes. I will do a good deed for my country. So do it, Master. Do it. The man who does a good deed for his country, his good deed rests in Marduk's basket. No, Servant, I will certainly not do a good deed for my country. Do not do it, Master. Do not do it. Go up on the ancient ruin heaps and walk around. Look at the skulls of the lowly and great. Which was the doer of evil and which was the doer of good deeds? Servant, listen to me. Yes, Master. Yes. What then is good? To break my neck and your neck and throw us in the river is good. Who is so tall as to reach to heaven? Who is so broad as to encompass the netherworld? No, Servant, I will kill you first and let you go first. Then my master will certainly not outlive me even three days. Brum bump ching. So, yeah, what was all that about? You probably picked up during most of it that the joke was sort of this. This Servant was just a complete yes man. Like whatever the Master said he was gonna do, he'd just be, oh, yeah, that's what you should do. And then he'd turn around and say the exact opposite. Oh, yeah, you should definitely do that. Right? And at the end, I know the ending was a little weird there, you may not have gotten the punchline, but the idea was, you know, having sort of gone around in circles like this his whole life, the. The Master finally sits down and says, you know, what's the point of all this? You know, like one thing's as good as another. He's basically depressed and he decides, hey, you know, what I should really do, Servant, is I should just end myself and you, while I'm at it and, you know, toss our bodies in the river. And then finally the servant is like, eh, maybe, maybe, maybe not. That's sort of the bit. I warned you it was pessimistic. I warned you it was dark comedy. But yeah, someone took the time to write that story at great expense and requiring great knowledge in a clay tablet so we could have it to this day. And while I said, you know, it's mainly just comedy purposes, what makes it interesting is that there are some real things reflected there, right? Like, I think there are people who reach a certain point in their life where they're surrounded by yes, men. And some of us seek this right. Anybody who's critical of us, we cut out of our life because they're a hater. We just want people who are going to support us and tell us how great we are and encourage us all the time. And you get. You get someone like this servant, but that kind of also, at the same time disassociates you from reality. Because some of the conclusions, like we see the master in this story coming to this conclusion, like, well, getting married and starting a family, not getting married and starting a family, then what difference does it make being honest or dishonest, doing good or doing evil? None of these things seem to make a difference. Why? Well, because the people around are just supporting whatever he does on either side. And he eventually enters this nihilistic phase of just nothing. Nothing makes any difference. But in order to have things make a difference, there has to be good and bad, right and wrong, better and worse. And that means someone might have to point out that what you think is right might be wrong in some situations. And so that sort of path of constant affirmation does lead to a kind of nihilism. And I think beyond the dark comedy, I think that text sort of exposes that reality. So maybe we learned something today after all. So that's the end of ancient story time with Father Stephen. I hope this will tide all of you over until our next regularly scheduled episode of Lord of Spirits and give you another wild and wacky window into the ancient human world."}
