{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":0.88,"end":65.51,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":67.67,"end":147.35,"speaker":"Fr Andrew Stephen Damick","text":"Christ is risen. He truly is risen. Good evening giant killers and dragon slayers. You are listening to the Lord of Spirits podcast. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. And my co host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And if you are listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346 and Matus Khachrudi is taking your calls tonight and we're going to get to those in the second part of our show. So what happens when we die? It's one of the most frequently asked questions, not just by Christians, but by pretty much everyone. The idea that the human person simply sort of winks out of existence at the moment of death is kind of unthinkable. The answer to this question is actually pretty clear within the orthodox Christian tradition as expressed in the Holy scriptures and elsewhere. Yet nonetheless, confusion remains and you can hear people say all kinds of stuff about it. Probably the most common thing that people say about the soul after death is the idea that we either go to heaven or hell. And that's kind of it. So, Father Stephen, is there any merit to that model? No, none at all. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":147.99,"end":163.99,"speaker":"Fr Stephen De Young","text":"Yep. So, yeah, tonight we're going to answer the musical question, where do bad folks go when they die? They don't go to heaven where the angels fly. They go to a lake of fire and fry and you see them again on the fourth of July."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":164.71,"end":165.19,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":167.56,"end":170.32,"speaker":"Fr Stephen De Young","text":"But that's not the whole answer, so stay tuned for the rest of the show."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":170.32,"end":171.8,"speaker":"Fr Andrew Stephen Damick","text":"I didn't get to solve the whole problem."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":171.96,"end":192.04,"speaker":"Fr Stephen De Young","text":"Right. So, yeah, we're going to. As has been our want lately because we tend to sort of touch on things on the show. We take one trajectory through a topic, and then later on we come through from another trajectory."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":192.12,"end":193.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Another angle."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":194.11,"end":214.19,"speaker":"Fr Stephen De Young","text":"Yeah. And so we've already talked about some of the things we're going to talk about tonight from another angle when we talked about the underworld, gave sort of the gizzetteer to the underworld many moons ago. Seems like a long time ago."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":214.19,"end":216.95,"speaker":"Fr Andrew Stephen Damick","text":"About a year, actually. Yeah. Right. Was it about a year?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":216.95,"end":238.96,"speaker":"Fr Stephen De Young","text":"Yeah. I don't know. We're on Covid time, so it's like dog years. But so we have to start sort of by talking about the state of affairs before Christ if we're going to talk about what happens when people die."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":239.28,"end":239.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":239.76,"end":245.6,"speaker":"Fr Stephen De Young","text":"So this is, I guess our first half is what used to happen to people when they died."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":246.16,"end":246.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":247.85,"end":287.89,"speaker":"Fr Stephen De Young","text":"Both. What did they think was gonna happen and then what did happen and how that was understood. And so we have to go back and do a little bit of review. We're not gonna do too much for us, that could still be an hour's worth, but we're not gonna do an hour's worth. A little review of the whole concept of Sheol or Hades or the grave or the underworld as it was understood by ancient Near Eastern civilizations, sort of including Israel and the Greeks."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":290.13,"end":293.33,"speaker":"Fr Andrew Stephen Damick","text":"Although I am going to throw in a little bit of Norse because I can't help myself."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":293.89,"end":338.25,"speaker":"Fr Stephen De Young","text":"As is your want. So. Yeah. And so if folks remember when we talked about Sheol and the way the grave, the realm of mother, God of death, the way that was talked about the ancient Near East, Sheol was pretty much a horror show, right. It's pretty much a slasher movie. Everybody down there is bad. There's lots of demons down there. It's not that the demons are like, in charge of you and they're your work supervisors and they're poking you with pitchforks. It's more like you get tossed in with the wild animals and, you know, wild animals do what they do. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":338.57,"end":350.41,"speaker":"Fr Andrew Stephen Damick","text":"It's. It's funny to me that that im. That image of the underworld is. Is kind of like, you know, industrial revolution underworld, where the demons are, you know, in charge of stuff."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":351.45,"end":352.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":352.45,"end":353.13,"speaker":"Fr Andrew Stephen Damick","text":"Middle management."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":353.45,"end":357.53,"speaker":"Fr Stephen De Young","text":"Yeah, Right. But yeah, it's manual labor. And then you."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":358.42,"end":360.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. You're often expected to work."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":360.74,"end":392.97,"speaker":"Fr Stephen De Young","text":"Yeah. You segue that to CS Lewis and the cubicle farm of hell. Right. But yeah, so the Rephaim who we've talked about who are giants, their spirits are in the underworld. They get talked about as being in the underworld by Isaiah in some of the Psalms, including a psalm we're going to talk more about later. And we have a whole ritual in Ugaritic that was performed at Ugarit when the king died."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":393.21,"end":393.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":393.89,"end":428.43,"speaker":"Fr Stephen De Young","text":"And the whole goal of the sacrifices that were offered and everything was to try to get him safely past the Reppae, safely past his ancestors who were going to shred him as he was trying to get to the underworld. So yeah, it's bad stuff. Insert Hellraiser 1 or 2. 3 was silly. The ones after that, even the one with Lance Hendrickson, not worth watching. But one or two."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":428.83,"end":439.91,"speaker":"Fr Andrew Stephen Damick","text":"So this is the sort of the Semitic version. Right. So, yeah, you know, not only Israel, but. But also other Semitic cultures nearby."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":441.91,"end":479.64,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And as we've said before, Greece is really. Even though people tend to look at Greece as the first sort of Western civilization, in reality they're sort of the last ancient Near Eastern civilization. Sort of all the ways that count. Right. All the traditions you find sort of grow out of ancient Near Eastern traditions that they inherit from Babylon and Egypt and their neighbors. And so you get Hades. But Hades is a little different, as we've talked about before and that. It's a little more emo."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":480.28,"end":489.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. I mean, you've got like, you've got the. I mean the best you've got is the Elysian Fields. Right. Which is still pretty lame."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":490.63,"end":492.55,"speaker":"Fr Stephen De Young","text":"Yeah, it's just less lame."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":493.11,"end":542.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But most everybody down there is just sort of, you know, gloomy and going to be forgotten. Yeah, like that's, that's. They. Once they're forgotten, they're gone. You do get some. I mean there's. This is where you get some pretty clear sort of regions of Hades. Right. You've got Tartarus where the, the, the Titans are imprisoned. You've got people like Sisyphus pushing his rock up the. Up the hill over and over again. But it's not great. I mean, the nicest that you get out of it is really Hades himself down there, you know, when he's got his, his captured bride, to put it mildly, that's about as nice as it gets, which is not great."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":542.72,"end":543.6,"speaker":"Fr Stephen De Young","text":"Pretty mopey."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":544.25,"end":546.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":547.05,"end":552.01,"speaker":"Fr Stephen De Young","text":"He's pretty mid-80s Robert Smith down there too. Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":552.57,"end":554.17,"speaker":"Fr Andrew Stephen Damick","text":"He did not get the nice realm."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":555.21,"end":570.48,"speaker":"Fr Stephen De Young","text":"Yeah. So the whole place is kind of like if anybody ever went to the castle in Tampa, Florida in the late 90s, like Joy Division level Terrace apart again in heavy rotation. It's just kind of sad and depressing."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":571.52,"end":573.52,"speaker":"Fr Andrew Stephen Damick","text":"They play the cure a lot over the loudspeakers."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":574.48,"end":598.56,"speaker":"Fr Stephen De Young","text":"And when, even when you read, someone goes and encounters and wants to talk to one of the shades in Hades, like when Ulysses summons up Achilles shade, it's just like, here's some depressing poetry I wrote right down here by myself. Right. So. But sort of the key thing here is that that's where everybody goes."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":599.44,"end":600.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no way around."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":601.56,"end":639.07,"speaker":"Fr Stephen De Young","text":"Might be a slightly nicer or slightly more horrible part of it, but that's where everybody goes when they die. There's. There's no, like, there's no idea that human life ends at death. And this goes well back into prehistory. The burials we find at, like, Gobekli Tepe and places that we've talked about in the Neolithic era, we find burials. The burials have grave clothes and grape goods and stuff. So, yeah, it's very clear that they didn't think, you know, the existence of this person was over."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":639.47,"end":646.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Actually, I actually just. Just last night I watched the Netflix film the Dig. Have you seen that?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":647.95,"end":648.95,"speaker":"Fr Stephen De Young","text":"No, I don't."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":648.95,"end":671.07,"speaker":"Fr Andrew Stephen Damick","text":"Oh. So it's about. It's about the Sutton hoo excavation in 1939, which is, you know, an Anglo Saxon ship burial. And, you know, there's like, really nice treasure in there. Which again, you know, to underline the point, why would you put really nice treasure down with dead bodies if you didn't think that did anything, you know."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":671.07,"end":672.03,"speaker":"Fr Stephen De Young","text":"Like, use it for something."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":672.11,"end":703.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, like, what a stupid thing to do. Like, let's bury some of our best stuff down here. You know, unless you believed that there was an afterlife that this person was connecting to and you were kind of for whatever your beliefs about that was where you're sending that along, you know, either as a bribe for the ferryman or like, you can use this stuff in the. In the afterlife. But in any event. Yeah. Oh, it's, it's, it's. It's a. It's a good film, actually. I recommend it, everybody. Ralph Fiennes plays the lead character in."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":703.17,"end":706.33,"speaker":"Fr Stephen De Young","text":"That, so I think it's pronounced Rafe."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":706.81,"end":713.53,"speaker":"Fr Andrew Stephen Damick","text":"It probably is. But I, you know, I don't gotta be appropriately British. I don't speak Ipswich, which is where he's from."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":715.2,"end":746.55,"speaker":"Fr Stephen De Young","text":"The. Yeah. So just despite certain recent comments from his most recent book made by friend of the show Bart Ehrman, everybody in the ancient world believed in an afterlife of some sort of varying sorts. Usually not great. Right, right. The outside, like, if you were the king or the emperor or something. So you were basically considered to be a God already. You might get to go and hang out with the other gods."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":747.59,"end":751.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but that's not where most. I mean, that's one in a million chance."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":752.31,"end":759.35,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. That's not most people. Right. It's good to be the king, but, you know, everybody else, not so much."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":759.59,"end":760.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":760.71,"end":762.31,"speaker":"Fr Stephen De Young","text":"And even that's not 100%."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":763.43,"end":763.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":763.83,"end":771.36,"speaker":"Fr Stephen De Young","text":"I mean, the reason for the elaborate burials and rituals in Egypt was because it wasn't like a guaranteed thing. Thing that the pharaoh would even make it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":771.76,"end":772.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":772.4,"end":774.48,"speaker":"Fr Stephen De Young","text":"Right. Even though he was seen to be divine."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":774.96,"end":992.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I was going to say, since I got to bring up, you know, Sutton, who. Which is a, you know, Anglo Saxon burial, I'd like to give a little note on the word hell for everybody. This doesn't count as etymology. This is more of straight philology, actually. Exactly. Yeah. So I don't have a jingle. I don't have a philology jingle. So, Chris Hoyle, if you're listening, I'm just throwing that out there. Yeah. So the word hell, I sometimes. This is my little soapbox about this. You sometimes will get people that will say, you have to say Hades. You can't say hell. These are not the same concept. And the problem with that is that Christian tradition does not make a distinction between those two things. Right. That there's something called hell and there's something called Hades. Now, if you want to identify hell as being Tartarus, then yes, I suppose you can say that hell is a region of Hades, but within. So hell is a Germanic word and hell gets used in the earliest translations of the Bible and other Christian literature into English. To simply translate the word Hades, it just refers to the underworld. And it has a pre Christian usage, as far as we know. I mean, all the literature that we have about Germanic pagan religion is filtered through Christians, but it just means the underworld. And just like Hades and Sheol, it refers to not just the underworld, but also the God that controls it. Of course, the fun thing in Norse religion is that the God who controls the underworld is actually a goddess. So I like to sometimes say that the devil is female in Norse religion. And so at least in terms of that basic sort of historical use of these terms, Hel, Hades, Sheol are essentially synonyms. Right. But as you said, like, there's different sort of concepts within these cultures of what the underworld is like. So now within modern English, now a lot of people have this idea of hell where you've got demons poking people in the Butt and making them do hard labor, like you said. And so as a result, then a lot of people do prefer the word Hades because it's sort of an underworld word that a lot of people don't know what meaning to fill that word up with. So. So I. I get that. Right. I. I totally get that. But at least in terms of saying, well, hell and Hades are two different things in Christian theology, that's just simply not true. You might say that we've attached the word hell to a mistaken understanding of it. But even then, as you know, as we go tonight, you're going to hear a lot more about the underworld and before and after Christ and all that kind of stuff. But anyways, I just did want to mention that. So Hel does show up in Norse mythology. It's mentioned, for instance, the Grimnessmall, which is part of the Poetic Edda. And in that Hel actually exists beneath one of the three roots of Yggdrasil, the World Tree. So it's. It's down there underneath the roots of a tree. You know, people do go there and come back. There's this notion that Balder will come back after having gone there after Ragnarok, and it's not a great place to be. This is the thing that they all have in common, is that you don't want to go there. It's just not. Not great. Even the good parts are not that great. So there's our little note on the word Hell."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":993.83,"end":1002.95,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. And. And I. I tend to emphasize the part you said there at the end, that when people hear the word hell now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1003.51,"end":1004.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1004.23,"end":1008.39,"speaker":"Fr Stephen De Young","text":"What they think of is not what an Anglo Saxon thought of."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1008.55,"end":1011.87,"speaker":"Fr Andrew Stephen Damick","text":"No, indeed. No. Right. Exactly. Exactly."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1011.87,"end":1026.57,"speaker":"Fr Stephen De Young","text":"Because it's got. It's taken on all of this. And that's why I, for example, people may have noticed, prefer to use Hades or Sheol just to break that free. Because they call her Hell. But that's not her name. It's not her name."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1026.65,"end":1047.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm cool with all the terms, but I'm a constant, endless teacher, so I'm just like, well, this is what it means in this context. But yes, it's true. I mean, that's actually my preference these days, often is I refer to simply the Underworld, which, you know, you have kind of like a seedy Chicago gangster sort of thing going on."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1047.84,"end":1054.68,"speaker":"Fr Stephen De Young","text":"Yeah. I was gonna say it's crime. The shadow knows what. Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1057,"end":1057.96,"speaker":"Fr Andrew Stephen Damick","text":"That being said."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1058.76,"end":1106.74,"speaker":"Fr Stephen De Young","text":"Yeah. So within all of this, you know, horror show slash moody, atmospheric theatricality, depending on your. Your bet for the underworld, we mentioned that this is pretty much what you get in the Old Testament too, in terms of descriptions of Sheol, the grave. Right. The underworld. Right. It's both that it's not great, that it's full of demons, that you don't want to go there, but that everybody does. But it's also important that within the Hebrew Bible there is a hope attached to that somewhat uniquely."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1107.3,"end":1107.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1108.5,"end":1130.21,"speaker":"Fr Stephen De Young","text":"There is the idea that. That that may not be just the end of the story. That may not just be the way of all flesh. Right. In a lot of ways. Like the Epic of Gilgamesh is this sort of epic struggle with death of Gilgamesh trying to find some way for Enkidu and then himself not to die."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1131.17,"end":1131.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1131.89,"end":1136.45,"speaker":"Fr Stephen De Young","text":"Right. And the answer at the end is there isn't one. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1136.53,"end":1137.65,"speaker":"Fr Andrew Stephen Damick","text":"Even for inevitable."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1137.65,"end":1162.84,"speaker":"Fr Stephen De Young","text":"For our giant Nephilim friend Gilgamesh, it's inevitable. Right. But it's not. That's not necessarily the case in significant portions of. Of the Old Testament. And so there are lots of places we could go and I'm sure we will get comments on the episode like, why didn't you talk about this passage?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1164.84,"end":1171.24,"speaker":"Fr Andrew Stephen Damick","text":"It's a new genre of comment that we get. You talked for three hours and didn't mention this one thing that's related. It's true. We did."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1172.84,"end":1184.36,"speaker":"Fr Stephen De Young","text":"Yes. We have sympathy for our dutiful engineer at ancient faith in the studio. Don't want to keep her until midnight while we go through every single possible."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1187,"end":1187.4,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1188.52,"end":1277.79,"speaker":"Fr Stephen De Young","text":"But it's a book we're going to. Yeah. What we're going to focus on is a particular set of Psalms. And I say set of Psalms not because it's one of the Psalm collections. So the Book of Psalms itself, whether we're talking about the Greek Book of Psalms or the Hebrew Book of Psalms, is a collection of Psalms, obviously. Right. They're written by different people at different times. Right, Right. Within the Book of Psalms, there are five books that are collected there and they're. They're labeled in a lot of English Bibles. People don't pay much attention to it because basically it's completely mysterious. Right. We have, we have no idea when those five separate books were each collected, when they were all collected together as the Book of Psalms as we have it now. We have no idea really what connects the various Psalms in the different collections. There's lots of dissertations and journal articles written about it. So it's kind of a constant mill for generating that kind of stuff for people who are interested in Hebrew poetry. But the fact that it Keeps generating all that stuff is due to the fact that, number one, it's mysterious and number two, nobody really knows. Right. Because if anybody ever figured it out, you know, you'd reach homeostasis in the."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1277.79,"end":1281.07,"speaker":"Fr Andrew Stephen Damick","text":"Journal world, which we can't have."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1281.07,"end":1291.75,"speaker":"Fr Stephen De Young","text":"That upsetting. Yeah, yeah. Someone would come along and try to upset the apple car. But I just mixed metaphors in a crazy way. Anyway."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1291.75,"end":1292.39,"speaker":"Fr Andrew Stephen Damick","text":"It's okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1292.39,"end":1301.99,"speaker":"Fr Stephen De Young","text":"It's all right. So these psalms are a group of psalms because they're all attributed to the same group of people."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1302.63,"end":1303.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1304.31,"end":1315.71,"speaker":"Fr Stephen De Young","text":"And that group of people is identified as the sons of Korah. And this is sons as in descendants, not sons as in first generation literal sons."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1316.11,"end":1316.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1318.35,"end":1331.31,"speaker":"Fr Stephen De Young","text":"And so this was one of the clans within the Levites that had a kind of dark history that we've talked about before on the show. So this is another thing we're going to try and review at a somewhat shorter length."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1331.55,"end":1340.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you want the whole story, go to numbers, chapter 16, and you can read the whole Korra episode or whichever."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1340.77,"end":1342.57,"speaker":"Fr Stephen De Young","text":"Episode it was where we talked about it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1343.53,"end":1343.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1343.97,"end":1345.29,"speaker":"Fr Stephen De Young","text":"Because I don't remember these things."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1347.69,"end":1348.09,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1349.37,"end":1364.73,"speaker":"Fr Stephen De Young","text":"So what happened was Korah and his clan attempted to seize the high priesthood for himself, although he did it by making a very egalitarian sounding argument."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1365.32,"end":1365.56,"speaker":"Michael","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1365.56,"end":1371.96,"speaker":"Fr Stephen De Young","text":"You know, Moses, why have you. And Aaron, why are you lording it over us? You know, aren't we all priests? You know."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1373.8,"end":1375.16,"speaker":"Fr Andrew Stephen Damick","text":"Priesthood of all Levites."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1375.64,"end":1477.1,"speaker":"Fr Stephen De Young","text":"Yeah. So. And that went. That went badly for him and most of his immediate clan members. The ground opened and swallowed them up. And so Korah went down alive into Hades. The now third hand joke that we told the last time was that Korah pulled a reverse Elijah. Instead of going alive into heaven, he went alive into Sheol. But there were certain members of his family and his clan who hadn't joined in the rebellion, who are identified there in number 16 who survived. And it is the descendants of those members of Korah's family in that clan who wrote these psalms. And so these are psalms written by Levites. So these are psalms that were intended for some kind of worship context that we don't know for sure. But there is within them, if you read them, a recurring theme of being rescued from death, being rescued from Sheol, being rescued from Hades. If you're in the Greek. And so these psalms, the Hebrew numbers that you'll find in most English Bibles are 42, 44 through 49, 84, 85, 87, 80 and 88. And if you want the Greek numbers, subtract one from each of those, which."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1477.1,"end":1481.62,"speaker":"Fr Andrew Stephen Damick","text":"Is the general rule, but not perfect. When you're comparing the Greek numbers for."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1481.62,"end":1484.58,"speaker":"Fr Stephen De Young","text":"The middle part of the psalm. All these come from the middle part of the psalm."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1484.58,"end":1504.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. I mean, you could think, you know, like having seen the head of their clan and a bunch of their relatives get sucked down into the underworld, that that would be kind of on their mind. It would be, you know, a tradition within the family. Right. So that's. That's, like you said, that's where you see this theme."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1505.6,"end":1510.72,"speaker":"Fr Stephen De Young","text":"We talked about that idea of sort of personal history, like experiential history. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1510.72,"end":1511.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1512,"end":1516.8,"speaker":"Fr Stephen De Young","text":"So they're still the sons of Korah. Their clan still bears the name of this person."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1518.32,"end":1519.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1519.28,"end":1527.3,"speaker":"Fr Stephen De Young","text":"And. And so that's a reality for them. This event is part of their personal history in the way that it wasn't from for, you know, a Benjamite."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1527.94,"end":1528.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1530.42,"end":1553.62,"speaker":"Fr Stephen De Young","text":"Even though the Benjamite obviously would have. Would have heard that story in the Torah, it was not in that personal sense. Right. They weren't carrying that name around. So we chose. I don't remember how we did this. Do we cast lots? Something like that. I don't know. To take a closer look at Psalm 88 or 87 in Greek."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1554.18,"end":1554.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1554.98,"end":1558.34,"speaker":"Fr Stephen De Young","text":"As an example of this, rather than trying to work through all of them."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1558.82,"end":1680.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So I'm going to read it. And this. I'll just tell everybody. This is the translation from Holy Transfiguration Monastery here in the US In Massachusetts, which is very, very commonly used in a lot of Orthodox churches using English. And this translation is from the Greek version, and I'm going to read it once through, and then we're going to comment on some specific items as we go. So it's Psalm 88 or 87 in the Greek numbering. O Lord, God of my salvation, by day have I cried, and by night before thee let my prayer come before thee. Bow down thine ear unto my supplication. For filled with evils is my soul, and my life unto Hades hath drawn nigh. I am counted with them that go down into the pit. I am become as a man without help, free among the dead, like the bodies of the slain sleep in the grave, whom thou rememberest no more. And they are cut off from thy hand. They laid me in the lowest pit, in darkness and in the shadow of death. Against me is thine anger made strong. And all thy billows hast thou brought upon me. Thou hast removed my friends afar from me. They have made me an abomination unto themselves. I have been delivered up and have not come forth. Mine eyes are grown weak from poverty. I have cried unto thee, O Lord, the whole day long I have stretched out my hands unto thee. Nay, for the dead. Wilt thou work wonders, or shall physicians raise them up that they may give thanks unto thee? Nay, shall any in the grave tell of thy mercy and of thy truth and that destruction? Nay, shall thy wonders be known in that darkness and thy righteousness in that land that is forgotten. But as for me, unto thee, O Lord, have I cried. And in the morning shall my prayer come before thee. Wherefore, O Lord, dost thou cast off my soul and turnest thy face away from me? A poor man? Am I in troubles from my youth. Yea, having been exalted, I was humbled and brought to distress. Thy furies have passed upon me, and thy terrors have sorely troubled me. They came round about me like water all the day long they compassed me about together. Thou' st removed afar from me, friend and neighbor and mine acquaintances because of my misery. It's kind of a bummer of a psalm. Like, there's no point at which it gets better."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1682.76,"end":1684.2,"speaker":"Fr Stephen De Young","text":"Yeah. There's no happy ending."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1684.28,"end":1684.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1686.2,"end":1726.67,"speaker":"Fr Stephen De Young","text":"Of course, it's the new Battlestar Galactica. So. Yeah. As. As people probably noticed on the way through. Right. The. The. The psalmist, whichever son of Korah it was, who. Who wrote this is reflecting the situation of someone who is dead. Right. Someone who is in the pit. Someone who is in Hades. Right. Like in the pit, in the grave. Right. The bodies of the slain sleep in the grave."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1726.99,"end":1736.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this isn't. This isn't just someone saying, I'm really bummed. And it's like being. It's like I'm in the grave. I mean, this is. This is from the point of view of someone, as you said, who is there."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1737.15,"end":1751.35,"speaker":"Fr Stephen De Young","text":"Yeah. Sort of like Jonah's prayer, as we've talked about before. But this is somebody who God has forgotten, who's cut off from the hand of God and from the life that comes from his hand. Right. In the lowest pits. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1754.07,"end":1754.47,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1756.23,"end":1773.61,"speaker":"Fr Stephen De Young","text":"Isolated, separated from everyone. And so there are a few places when we get to about the middle of the psalm where there are some things that are kind of hidden in the English translation. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1773.61,"end":1773.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1775.17,"end":1822.04,"speaker":"Fr Stephen De Young","text":"One of those is we get a couple of sort of rhetorical questions. Right. The first one being in this English translation. Nay, for the dead. Wilt thou work wonders? Right. Or will thou work wonders for the dead? Right. English phrasing. Right. And the dead. There Right. Is sort of the typical word for the dead. It's from the root mot. Right. It's. It's just dead people. Right. In the Hebrew, but then in the English, because it's going through the. The Greek, there's this phrase, or shall physicians raise them up that they may give thanks unto thee?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1822.36,"end":1837.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And so, yeah, we looked this up. We checked. We did a little word study, because what is it in Hebrew? Right. It doesn't say physicians. It says the rephaim."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1838.55,"end":1840.71,"speaker":"Fr Stephen De Young","text":"Will the rephaim arise and praise thee?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1841.11,"end":1852.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not will something raise someone else up in the Hebrew. It's will the rephaim rise up and praise the. In other words, the dead giants. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1853.82,"end":1855.58,"speaker":"Fr Stephen De Young","text":"So, yeah, obviously the answer being no."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1855.9,"end":1893.67,"speaker":"Fr Andrew Stephen Damick","text":"No. Right. Yeah. So we looked at. We looked this up. We actually looked at the Greek version of this psalm, and the word that's used there that they translate is yatri, which means doctors, Physicians. Right. So physicians is a good translation from the Greek. Right. But we puzzled for a moment or two, and then you found the answer as to why whoever translated this, this Greek text of the psalm, why they would use the Greek word for doctor to translate rephaim. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1893.67,"end":1902.51,"speaker":"Fr Stephen De Young","text":"And you. Yeah, they mistook rephaim for rofaim is basically the short version."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1902.83,"end":1903.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1904.83,"end":1926.61,"speaker":"Fr Stephen De Young","text":"Rofaim would mean healers, basically, as opposed to rephaim. But first of all, to make that misread, you have to add a letter that isn't there. But then also, in order to translate it from the Greek into English and have it make sense, they had to add a bunch of words."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1928.53,"end":1929.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1929.33,"end":1937.59,"speaker":"Fr Stephen De Young","text":"Because the Greek is more literally something like, will physicians rise and give thanks to me?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1938.31,"end":1956.31,"speaker":"Fr Andrew Stephen Damick","text":"Which, if you. If you got this picture of the underworld, you know. Right. Like, oh, and. And here's doc, here's doctors, which is. Doesn't. Doesn't. And so. Right. So. So it. In. Even in the Greek translation, it doesn't totally make sense."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1956.95,"end":1961.27,"speaker":"Fr Stephen De Young","text":"So it took rise and changed it to raise. Raise up."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1962.15,"end":1962.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1962.39,"end":1968.07,"speaker":"Fr Stephen De Young","text":"Right. They made it a transitive verb and added a pronoun. Right. In order to make it make sense."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1968.23,"end":1978.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So, I mean, and, you know, this will probably make some people mad, but it's well known there are a handful of mistakes in the Greek Old Testament."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1979.19,"end":1982.31,"speaker":"Fr Stephen De Young","text":"Well, you even have to talk about which Greek."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1982.79,"end":1984.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. There's several."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1985.03,"end":1989.47,"speaker":"Fr Stephen De Young","text":"Yeah. There's a lot. Yes. A lot of textual differences. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":1989.63,"end":2009.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And some of them seem to be based on some. That they're looking at a Hebrew that's different than the other Hebrew versions we have and others that they're. You can see that they made a mistake, they misunderstood a word or just didn't know what the word meant, and so they kind of guessed right. You know, because that's the way translation works."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2010.27,"end":2031.38,"speaker":"Fr Stephen De Young","text":"Yes. And so let me be completely on the nose about it. All of the Greek translations into English that you're reading are not translations of the Greek, as if there's a V Greek stored somewhere. They're translations of Codex Sinaiticus."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2031.86,"end":2032.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2034.82,"end":2072.49,"speaker":"Fr Stephen De Young","text":"They'Re translations of a Greek manuscript of the Old testament from the 4th century AD. Right. So there's a lot of other Greek that's out there and Greek versions. So what we're really saying is that somewhere, either when Codex Sinaiticus was being done or before that, somebody made a boo goo. And since Codex Sinaiticus has at least three hands of corrections in the book."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2074.17,"end":2074.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2074.73,"end":2081.61,"speaker":"Fr Stephen De Young","text":"Like even the monks at Mount Sinai clearly thought there were mistakes in it because they kept correcting them."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2081.93,"end":2082.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2083.61,"end":2093.93,"speaker":"Fr Stephen De Young","text":"So no one has ever said that it's a perfect manuscript. But anyway, now we've made all those disclaimers that won't stop anyone from getting mad at us anyway about the dead."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2093.93,"end":2097.77,"speaker":"Fr Andrew Stephen Damick","text":"Doctors rising up in the underworld. Hey, whatever."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2097.77,"end":2151.67,"speaker":"Fr Stephen De Young","text":"But it refers to the refi. Right, but the idea here is obvious behind that question, right? It's. It's that, you know, your praise and worship of God is not possible in Sheol, right? And so this verse is calling out to God, you know, that, that he wants to give praise and worship to God. Right. But needs to be set free in order to do that. Right. And that's why immediately after those questions, and here's the English translation we're working with. Nay shall any in the grave tell of thy mercy and of thy truth in that destruction. And the Hebrew of destruction, there is Abaddon, which fans of the book of Revelation might be familiar with. Remember Abaddon or Apollyon in Greek."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2151.91,"end":2152.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2155.32,"end":2233.2,"speaker":"Fr Stephen De Young","text":"Destruction. And then toward the end, the way it's translated in English, thy furies have passed upon me, and thy terrors have sorely troubled me. And they came or browned about me like water. These are those demon non friends, right? In the underworld coming around like water is not like, oh, good, I have something to drink. Or finally a bath, right? This is like flood waters. This is water, is the force of chaos, right? These demonic beings, right, that are being called furies and terrors right here. So all of this, even though this doesn't have, as some of the other psalms of Korra, have a sort of denouement where that rescue or salvation from. From death and Hades is made explicit, right? It's definitely pointing to it. It's crying out for it. It's calling out for it, right? To Yahweh, the God of Israel. And the way that this text, this particular text, Psalm 88 or 87, ends up getting interpreted is in terms of Christ."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2234.74,"end":2235.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2235.06,"end":2280.92,"speaker":"Fr Stephen De Young","text":"So you'll. You will see references to Christ being the one who is free among the dead, right? Which is a line from this psalm and one important part of the very early proclamation of Christ's resurrection that we see in the early sermons in the book of Acts, right? So we get this quotation that's made of Psalm 16, verse 10, which is not a psalm of the sons of Korah, but it's a psalm of David. But what is, you'll not abandon my soul to Sheol or let your Holy One see corruption, right? And then it's pointed out, I tell you, to this day, David remains in his tomb. Right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2282.12,"end":2286.12,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, this isn't a reference to David himself."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2286.12,"end":2387.13,"speaker":"Fr Stephen De Young","text":"This is. Right. This is a reference to Christ. But. But it was not seen as being limited to Christ, right? It was not seen as being limited to Christ. So Christ's resurrection was seen as being linked to the resurrection, minimally, of all human beings, right? He's the first fruits, right? From the dead that language is used. And I want to pause on this for a moment because one of the sort of bugaboos out there, of course, is that, you know, as soon as Christ's resurrection happens, we load up all the Judaism, throw it in the dumpster and start over and make a new religion, right? And then things just sort of evolve. And then at a certain point, all this Greek philosophy shows up and gets shoved into Christianity somewhere and everything ends up weird. Okay? But if right here, based on Psalms, based on Hebrew poetry, we have the idea, the apostles received the idea as they express it, right, in these early, These early sermons, that Christ's salvation from Hades affects all of humanity, right? Liberates all of humanity in some sense from death and from Hades. Right. That means that they have some sense of the solidarity of Christ and the rest of humanity."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2389.05,"end":2390.73,"speaker":"Fr Andrew Stephen Damick","text":"Homo usios, as it were."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2391.37,"end":2422.78,"speaker":"Fr Stephen De Young","text":"Yes. What Christ does and what Christ is and what happens to Christ, right, Is. Is effectual for all of humanity. So you get an idea in Greek used to express that solidarity, like homo usius, or saying that Christ took upon himself our human nature, which he shares with us. Right? Those are Greek terms. They're Not Hebrew terms. They're not especially biblical terms."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2422.94,"end":2423.26,"speaker":"Michael","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2423.26,"end":2472.65,"speaker":"Fr Stephen De Young","text":"But they're used to explain things. Right. In Greek, because people spoke Greek at the time to explain in Greek concepts that are already there again, going all the way back into this Hebrew poetry from centuries before Christ. Right. And on top of that, now that we've got Christ being homoosios with us because he shares our human nature, they also take these traditions and weld them into traditions that we talked about in a past episode about Yahweh, the God of Israel invading Hades. Remember, Lift up your heads, o ye gates. Right, Right. To rescue people. And they meld them together. Which means what? Which means Christ is Yahweh, the God of Israel, and Christ shares our human nature."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2473.86,"end":2488.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. So the incarnation is literally built into the Old Testament and, you know, very clear Christology. It's not just some later reflection like, oh, he must have been God, you know?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2488.14,"end":2488.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2489.38,"end":2489.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2490.02,"end":2494.66,"speaker":"Fr Stephen De Young","text":"But the question comes, how do we explain this and make it clear in Greek?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2495.38,"end":2497.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because that's the language that everybody."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2498.18,"end":2502.18,"speaker":"Fr Stephen De Young","text":"Greek vocabulary to draw on. Just like we do this show in English."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2503.3,"end":2503.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2504.34,"end":2511.38,"speaker":"Fr Stephen De Young","text":"Technically, no English word that we've spoken during this podcast ever appears in the Bible because the Bible was not written in English."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2511.46,"end":2512.18,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2514.5,"end":2516.02,"speaker":"Fr Stephen De Young","text":"Sorry. King James only, folks."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2516.02,"end":2516.66,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2519.38,"end":2521.7,"speaker":"Fr Stephen De Young","text":"Right. So there are no biblical English words."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2522.02,"end":2524.82,"speaker":"Fr Andrew Stephen Damick","text":"Look, it got into English as quick as it could. Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2527.46,"end":2541.38,"speaker":"Fr Stephen De Young","text":"We have to do our best, Right. To. To reflect those things, but we're trying to use words in another language to reflect realities. Right. That are being. Being conveyed through the source language."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2541.62,"end":2542.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2544.82,"end":2602.78,"speaker":"Fr Stephen De Young","text":"So we jumped ahead a little. Right. Talked about Christ and fulfillment, but we're going to slide back a little again now. Right. So we see this idea, and people can go on their own and read the other psalms of the sons of Korah and see, they'll see similar themes and ideas playing out. Right. So we have this tradition, but this tradition, as we see it reflected in the Psalms, for example, in the Hebrew Bible, is not sort of completely articulated and developed. Yeah, yeah, right. It doesn't say, you know, in Psalm 88, 87 here. It doesn't say, and I know that the time will come when your Messiah will arrive. Right. Like, that's not all there. Right, Right. There's a sort of hope. Right. And this prayer that's extended. Right. But that's not to say that it just sort of stayed vague and nebulous until the time of the apostles and the writing of the New Testament."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2602.94,"end":2628.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's. There's, you know, commentary on this. There's Reflection on it. There's other takes within various kinds of literature. You know, as we do. Right? As we do. We don't just say, oh, we've got this text. I mean, even the most sola scriptura Protestant says things about the Bible and, you know, comes up with ways of understanding it. So of course that's going to happen in the ancient world as well."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2628.64,"end":2697.9,"speaker":"Fr Stephen De Young","text":"Right. Compares what one part says to what another part says. Right, right. Nice to see how they work together. Right, right. We all do that. They did that in the ancient world too. And so one example of sort of a greater articulation of this from before the time of Christ. We're gonna go back to the Book of Enoch's four caves and revisit this kind of quickly. We already talked about this in our sort of Geography of the underworld episode a little bit too. But this gives a good idea from the third century B.C. so at least a couple hundred, probably more like 250 years before the birth of Christ, how they saw it. So when Enoch is going on sort of his grand tour de cosmos, right, and seeing everything he sees in Hades, these four caves with four groups of people living in that. And so the first group is the righteous. Second group is the wicked. You probably predicted those two, right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2699.74,"end":2701.34,"speaker":"Fr Andrew Stephen Damick","text":"The good, the bad, the ugly."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2701.34,"end":2706.06,"speaker":"Fr Stephen De Young","text":"Wait, no, well, no, we can't really make that work."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2706.22,"end":2707.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay, sorry."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2707.34,"end":2710.14,"speaker":"Fr Stephen De Young","text":"So you've got the righteous of the wicked, then the martyrs."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2710.62,"end":2711.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2711.34,"end":2752.35,"speaker":"Fr Stephen De Young","text":"And the martyrs are sort of led by Abel. Enoch sees Abel, like, kind of outside the cave, crying out to God for justice. And that passage is very parallel. We don't have it in Greek, so we can't tell exactly how parallel, but very well parallel to the souls of the martyrs crying out for justice in St. John's Revelation. But so Abel is there, sort of represent. He's the first one. Right. And then the fourth group is the ignorant. Right. So this is like mostly Gentiles, Right. Who didn't know any better."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2752.59,"end":2754.43,"speaker":"Fr Andrew Stephen Damick","text":"Never heard. Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2756.27,"end":2768.59,"speaker":"Fr Stephen De Young","text":"And so each of these groups has their own cave. They're all in Hades, though. But the righteous and the martyrs have access to this spring of water."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2770.28,"end":2859.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And as a sort of echo of that, or I should say reference, really, almost, this shows up in the Gospels, right, Where you've got the parable of the rich man and Lazarus, where the rich man is burning and he says to Abraham, you know, send Lazarus over, because you've got water access over there. Can you please send me some. Send me some water. And I know when I called it the parable of the rich man of Lazarus. There's probably a couple people that are like, oh, wait, that's not a parable. And just for fun, I decided to look to at least look up one patristic reference to this. And so I pulled the trusty old Saint Theophylact of Okrid off my shelf, who has these wonderful commentaries on the Gospels and some other texts from the New Testament. And he is rightly called sort of the Cliff notes version of St. John Chrysostom. He almost always just follows whatever Chrysostom says and just restates it in brief. And he very explicitly calls it a parable in his commentary on that and calls it a story and so forth. So it's okay, people, it is a parable. The fact that it doesn't say at the beginning the Lord spoke this parable doesn't mean it's not. And we shouldn't take it when we look at it. We shouldn't say, this is what the underworld is like. Exactly. You know, this is an image that Christ is using to tell us something."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2860.55,"end":2883.66,"speaker":"Fr Stephen De Young","text":"And if you read it in Greek, it actually begins the exact same way as the parable of the Good Samaritan. Parable of the Good Samaritan starts out a certain man, some guy was going down to Jericho. And the parable of rich man Lazarus starts out a certain rich man beasted sumptuously every day."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2884.22,"end":2886.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2886.02,"end":2889.5,"speaker":"Fr Stephen De Young","text":"So it's just, it's the typical beginning of a parable."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2889.9,"end":2890.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2890.78,"end":2892.66,"speaker":"Fr Stephen De Young","text":"That should be controversial, but people, once."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2892.66,"end":2894.7,"speaker":"Fr Andrew Stephen Damick","text":"Upon a time, it's like that whole."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2894.7,"end":2919.61,"speaker":"Fr Stephen De Young","text":"Different verbs for love thing. Yes, I brought it up again. So. So these, these four groups, Enoch is told, have four different destinies. They're still at this point when Enoch sees them, they're still all in Hades. But Hades isn't the end of the line for many of them."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2920.33,"end":2920.73,"speaker":"Michael","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2922.09,"end":2986.7,"speaker":"Fr Stephen De Young","text":"And so what he's told is that the righteous are going to go to paradise. And Enoch later sees paradise and it's empty at that point. So the righteous are going to go to paradise. The wicked are going to be thrown into the abyss. Right. Or Tartarus with the angels who sin, the watchers. Right. At some point in the future. So they're not going to get to stay in Hades. They're going to go somewhere worse. Righteous are going to go somewhere better. The martyrs are going to be taken into the heavens with God. They're going to basically join the divine council as sort of the reward for their martyrdom. And the ignorant are just going to stay In Hebrews. So the Book of Enoch, unless you're Ethiopian, is not in the Bible. And this is not like the teaching of the Orthodox Church that there are these four caves and that there are these four different destinies."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2986.7,"end":2994.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. We're just saying this is the understanding that's represented in this text right before."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":2994.91,"end":3115.65,"speaker":"Fr Stephen De Young","text":"The New Testament comes. Right, Right. And the reality comes in Christ. Right. This is sort of how people were thinking about it. This is how the Jewish people in Christ's day were thinking about it. Right. And so you can even see where some bits of this end up in certain. Like for example, in Western Christian traditions, there are these limbo traditions that are sort of never fully official, but are always kind of around. Right. And you could see how, like jumping ahead to Dante, why he would think that Virgil, who was one of the ignorant pagans but virtuous, might be in kind of a limbo rather than. Right. Like a Tartarus abyss situation. Right. It's sort of a continuation of this kind of idea. So these threads do kind of play out in later Christian texts, but this isn't authoritative. This is how it was right before. But. But at the same time, we do see that there is this idea that. And it's pretty explicit in Enoch that when the Messiah comes, he's going to begin this shift. Right. So the righteous being brought out of Hades and into paradise is something the Messiah is going to do. Right. And the martyrs have their justice, something the Messiah is going to do. These are things that the Messiah is going to do, huh? When he comes. And so this is, you could see right away where the sort of harrowing of Hades tradition then comes from, in terms of understanding, Christ is fulfilling this in terms of the righteous being brought to paradise from Hades."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3116.13,"end":3117.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3117.57,"end":3181.48,"speaker":"Fr Stephen De Young","text":"That fulfillment, that second Exodus, that second Pascha. Remember Pascha means Passover, right. This Exodus. And so this gets one mistake, shall we say, that people make is that they look at. They say, for example. So, okay, so Enoch is expecting the Messiah to do this. So he's thinking the Messiah is just going to come once. Right. Messiah is going to do all. He's going to show up, he's going to judge everybody, he's going to do all this, and then that's end of days, that's game over. But not only is that not reflected in second Enoch, something very different is reflected. The reason it's not reflected in the Book of Enoch is that it's not really reflected in the prophetic corpus that's in the Hebrew Bible. That's in the Christian Old Testament. Right. Because all of those have what you could call a two stage eschatology."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3182.32,"end":3182.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3182.56,"end":3186.08,"speaker":"Fr Stephen De Young","text":"Both of them have. Yeah. In some sense the Messiah coming twice."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3186.72,"end":3218.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there's, and I think this is a really important concept that, that biblically, and correct me if I'm getting this wrong, Biblically, you have essentially three ages. You've got the, the first age, which is the covenant, you know, the initial covenant. Right. With, with Abraham. I mean, I guess you could call. I guess, yeah. Okay. I mean, I guess you could call what happens before that another age or whatever. But within the kind of messianic matrix, so to speak."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3218.95,"end":3219.31,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3219.87,"end":3265.52,"speaker":"Fr Andrew Stephen Damick","text":"There's kind of three. There's this initial covenant that's prior to the coming of the Messiah with this hope. Then you've got the messianic age when he comes and releases people from Hades and so forth. And then there's an age in the future from our point of view, an age in the future that is the life of the world to come. Right. The final age. So there's three stages and so two stage eschatology, meaning there's an initial big change that happens and we now live after that or in it. And then there's another big change that's going to happen which is going to wrap everything up. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3266.96,"end":3271.56,"speaker":"Fr Stephen De Young","text":"Basically, yeah, yeah. You have a couple too few ages in the past, but yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3271.56,"end":3272.48,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3273.36,"end":3278.16,"speaker":"Fr Stephen De Young","text":"So yeah, the breakdown would be that there's. Before the expulsion from paradise."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3279.12,"end":3280.88,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right, right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3281.44,"end":3309.2,"speaker":"Fr Stephen De Young","text":"So when we're talking about an age like this, we're talking about it's not just like an arbitrary time period. It's sort of a status quo for the cosmos. Right. It's sort of a shape of reality of the cosmos and how it relates to God and God relates to him."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3309.68,"end":3311.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3311.36,"end":3315,"speaker":"Fr Stephen De Young","text":"So there's, there's the, the, the age."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3315,"end":3315.36,"speaker":"Fr Andrew Stephen Damick","text":"Before."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3317.12,"end":3378.79,"speaker":"Fr Stephen De Young","text":"The expulsion from paradise, that sort of protological age. Then there's from the expulsion from paradise to the flood, and then minimally there's from the flood to the coming of the Messiah. And then the coming of the Messiah starts the messianic age. There's the messianic age, and then there is a final shift, the end of days, and then there's an age without end. So there's some debate depending on what sect and school of Judaism we're talking about the Second Temple period, whether the covenant at Sinai inaugurated a new age or not. And this is a rabbit trail we could spend the rest of the night on."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3378.79,"end":3382.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. But that's not what we're here for tonight."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3382.51,"end":3445.49,"speaker":"Fr Stephen De Young","text":"But as interesting as it is, I will just drop this and refuse to elaborate. Moses was not all that important to a lot of Jews in the Second Temple period. And we'll move on. So. All right. If you weren't a Pharisee. So. But yes. So there's this idea that from the. The future, from the time that the Book of Enoch is written or that the Old Testament is written. Right. The next age. Right. Even if you think Moses inaugurated a new age. Right. The earliest parts of the Old Testament date back to the time of Moses. Right. So all of that's written. The next stage is going to begin when the Messiah comes. But when the Messiah comes, he's going to inaugurate the Messianic age. And that age. The Messianic age is not an age without end."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3446.69,"end":3448.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3448.17,"end":3493.25,"speaker":"Fr Stephen De Young","text":"It is the final age before the end. And then when the end comes, then there's that age without end. So there's always this two stage. Right. And judgment is always associated with that last stage. Right. That last. That final judgment is the end of days before the age without end. Right. That's where justice is finally established in the world. There's a new heavens and a new earth. Right. That everything changes. But this Messianic age, and we've talked about this in different Psalms, right? This is the age when the Messiah rules in the midst of his enemies. Lord, sit at my right hand till I make your enemies your footstool, as I say."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3494.05,"end":3513.49,"speaker":"Fr Andrew Stephen Damick","text":"And we shouldn't confuse the end of days with these latter times, Right. Because we often make reference to these latter days or these latter times. That's the age we're in now. That's the Messianic age. Age. Whereas the end of days is the end point of this, and then what comes after that?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3514.29,"end":3528.45,"speaker":"Fr Stephen De Young","text":"Right? So the reason they call, they say these are the. The apostles say these are the last days. Right. Is because we're now in the final age before the end. Right, Right. There's."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3528.45,"end":3528.81,"speaker":"Michael","text":"There's."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3528.81,"end":3544.58,"speaker":"Fr Stephen De Young","text":"There's nothing else that needs to happen. Right. This age idea is also important, though, for another question. We get a question a lot where people ask, like, some variation of, well, how are things different now that we have the Holy Spirit?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3545.46,"end":3545.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3546.1,"end":3596.08,"speaker":"Fr Stephen De Young","text":"Or how are things different now that the demons have been unseated? Or how are things different now? And that's kind of hard to explain, right? Because if you look at each age as having sort of separate laws of spiritual physics, right? So we can't understand what Adam and Eve's Life and existence was like in paradise. Right, right. And they couldn't understand what ours is like. And so we can't fully understand what things were like before Christ accomplished what he accomplished any more than they could fully understand what they were going to be like after he accomplished what he accomplished."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3596.08,"end":3616.64,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the big difference of course is that we do have, like, we do have historical record. Right. And what we do know from the historical, which is not the same thing as being there. Right. But what we do have from the historical record shows a world very, very different from ours. Very, very different from ours."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3617.53,"end":3621.53,"speaker":"Fr Stephen De Young","text":"Right. And the people who are there on the overlap are like the apostles."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3622.25,"end":3622.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3623.05,"end":3636.49,"speaker":"Fr Stephen De Young","text":"And yeah, you can read in the pages of the New Testament how they felt everything had changed. Like the universe had changed when Christ rose from the dead, according to St. Peter and St. Paul."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3638.49,"end":3642.49,"speaker":"Fr Andrew Stephen Damick","text":"A literal game changer. Like it changed the rules of how everything works."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3642.89,"end":3646.27,"speaker":"Fr Stephen De Young","text":"Yes. The cosmos is now different because. Because this happened."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3646.43,"end":3647.07,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3649.39,"end":3697.96,"speaker":"Fr Stephen De Young","text":"So, yeah, so there is this massive shift. And so when we see in the ancient church movements of kilasm, the modern church, different pre millennialist groups, what they've done is they've taken that two stage eschatology from the Old Testament and pushed it forward to today. Right. So they still have this idea that Christ is still going to come two more times, once to rule in the midst of his enemies for a thousand years and then the end of days after that. Right. Meaning. And this is why the Fathers condemned chiliasm so harshly."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3698.41,"end":3698.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3698.65,"end":3708.09,"speaker":"Fr Stephen De Young","text":"Because they said if you do that, you're saying that Christ didn't accomplish through his death and resurrection what Christianity says he accomplished."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3708.33,"end":3708.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3708.69,"end":3793.09,"speaker":"Fr Stephen De Young","text":"Because you're saying the messianic age hasn't started yet. So Christ then didn't accomplish anything. The Holy Spirit hasn't been given. Right. That's how they took it in the ancient church with kiliasm. And Kiliasm and premillennialism are not identical. I'm not saying they're identical. There's all kinds of different. There's 83 varieties of premillennialism, dispensational and otherwise. Right. But there's a common mistake there of holding to essentially an Old Testament eschatology in the New Testament, of not seeing that Christ already came once. And so now the second and last is the one that's ahead of us. So as we said, we're now living in the messianic age and awaiting this end of days, the final judgment. And as we've talked about, justice is everything being in the right place everything functioning properly. And so it's the final judgment. Not because this is when the verdict is read and there's no getting out of it. It's the final judgment because this is when once and for all the whole cosmos is going to be put in order."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3793.49,"end":3793.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3794.69,"end":3835.63,"speaker":"Fr Stephen De Young","text":"Is going to be just. And so at that time there are going to be the devil and demons. At that time there are going to be humans who are unrepentantly wicked. If the whole creation is re established in justice when everything is turned right, then what does that mean for them? Do they exist? What is outside of everything? Right. That's what we're going to be talking about for the rest of the night."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3836.27,"end":3836.91,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3837.31,"end":3862.8,"speaker":"Fr Stephen De Young","text":"But as one last note, again, not that I'm trying to take shots at friend of the show Bart Ehrman, but you will read a lot of New Testament scholarship saying that the apostles all thought Jesus was going to come back right away and then he didn't. And so then they had to come up with like theology and they had church institutions and stuff."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3862.96,"end":3865.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is a really common kind of thing to say."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3865.9,"end":3899.79,"speaker":"Fr Stephen De Young","text":"Yes. And the problem with that is this idea of a messianic age is so clear in the Old Testament. Right. It's so clear that at the beginning of the second century you already have Kiliasts, you already have people projecting out a messianic age into the free, into the future. Right. 25 years is not an age. Ages last thousands of years. Right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3899.79,"end":3900.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3900.31,"end":3936.61,"speaker":"Fr Stephen De Young","text":"Like the flood to the time of Christ. So the fact that they saw it as an age means that. No, they didn't necessarily think it was going to happen in 20 or 25 years. They thought and they taught that it could at any time because there's nothing else that had to happen before Christ returned. Right. It could happen at any time. That doesn't mean they thought it would happen within 20, 25, 30, 40, 50, 100 years."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3937.17,"end":3937.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3937.65,"end":3938.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3938.01,"end":3938.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3938.77,"end":3949.96,"speaker":"Fr Stephen De Young","text":"And every allusion to it in the Old and New Testaments and in the earliest church fathers of the second century that we have all talk about it being a long time that begin age."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3951.16,"end":3957.64,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right. Well, we're going to take a quick break and we'll be back with some of your calls. We'll be right back."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3957.96,"end":3974.29,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":3979.41,"end":4048.2,"speaker":"Fr Stephen De Young","text":"New from Ancient Faith Publishing Secret Turning, a collection of short stories by Stephen Signari. Many people, Muslims, Orthodox Christians, Westerners, Armenians, gathered for the execution of Alexander. Alexander stood in the center. The executioner flashed his sword in front of Alexander's eyes to frighten him. But the martyr remained unaffected. I will not exchange the light for darkness, he said. I worship Father, Son and Holy Spirit. The Trinity, consubstantial and undivided. And he made the sign of the cross. Alexander prayed, but he did not change his mind. So Alexander, the whirling dervish from Thessaloniki, sacrificed his life for the love of Jesus Christ in the city of Smyrna, asia Minor, on May 26, 1794. Holy martyr Alexander, pray for us."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4048.92,"end":4055.15,"speaker":"Fr Andrew Stephen Damick","text":"Now available in paperback, ebook and audiobook@store.ancientfaith.com."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4056.19,"end":4072.35,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits, with Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4073.71,"end":4086.76,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back. We're still down in the underworld, and we've got a couple of callers. I bet you didn't know they had phone service in the underworld, but they do. And you remember that show that we did?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4086.76,"end":4090.28,"speaker":"Fr Stephen De Young","text":"Of course they do. This is where all the companies have their customer service."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4091,"end":4103.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you remember that show we did where everybody was named Ben? Well, we've got two callers, both named Michael. So we're gonna take Michael number one. Michael number one. And you're there. Yes."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4103.73,"end":4104.45,"speaker":"Michael","text":"Can you hear me?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4104.69,"end":4108.85,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we hear you. Welcome, Michael, to the Lord of Spirits. Christ is risen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4109.57,"end":4166.17,"speaker":"Michael","text":"Truly, he is risen. It's good to talk to you again, fathers. And I had a question that I wanted to set up by referring to the episode you did, the Bodies and the Bodiless. And you said a prayer, a prayer for one who has suffered long and who is at the point of death. And right in the middle of that prayer, there was something that, ever since I heard, it was kind of a puzzler for me. And it's. It's that part that says that the body therefore dissolved from the elements of which it was fashioned, but that the soul be translated to that place where it will remain until the general resurrection. And so when I hear this general resurrection, and I just heard the first half of your show, I'm wondering, is the general resurrection that final judgment? And does one experience the passage of time when they pass away like we do in this world, like we do with Kronos time or when we die? Is it like Kairos time, the eternal time of God, where the past, present and future are all the same."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4167.61,"end":4174.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, some of the answer to that is basically keep listening to this half of the show."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4175.37,"end":4176.17,"speaker":"Fr Stephen De Young","text":"You say that."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4176.57,"end":4269.81,"speaker":"Fr Andrew Stephen Damick","text":"I mean, well, you know, we love it when we have a good layup, right? But, but I mean, just to give you a little bit of a. Give you something to go home with. One thing that I think is important to understand is that. And we didn't make this explicit, I don't know. Correct me, Father, if I'm getting this wrong. The scripture actually references two resurrections, right? There's what's called the first resurrection, which is one that involves the saints. And of course, this begins with the harrowing of Hades, where the souls of the righteous are resurrected. And then there's the second resurrection, which is the general resurrection of all of the dead, where material bodies are going to be raised. Right. And so part of what you heard in that prayer is a reference to that second resurrection that everyone's going to participate in both the righteous and the wicked, right. All will be raised no matter what. And the reason why that's going to happen is because Christ has redeemed human nature. And since all we all share in human nature, death is being defeated for all of us, no matter what, which is not the same thing as being saved. Right. But we will all rise from the dead. So that's part of what's going on there. We're going to talk a little bit about. We're going to talk more about the soul and what, what happens with the soul at death. So I'm just going to ask you to hang on and keep listening for that. I don't know, Father. Dad, leave something out or something to be corrected, whatever."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4270.61,"end":4288.05,"speaker":"Fr Stephen De Young","text":"Well, just in terms of the idea of the first resurrection and the second resurrection, we've talked before. I know about how. And every time I say this, I'm cribbing this from St. John of Damascus. There's a footnote for everybody."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4288.77,"end":4293.73,"speaker":"Fr Andrew Stephen Damick","text":"Nothing wrong with that. St. John of Damascus is pretty much the schoolmaster."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4295.39,"end":4474.85,"speaker":"Fr Stephen De Young","text":"There's two kinds of death, right? There's spiritual death and there's physical death. Physical death is the separation of the soul from the body. Spiritual death is the separation of the soul from God, who is the source of life. So when we talk about souls being brought from Hades into the presence of God to Christ or from this world to Christ, for people who die now bodily, right, that's called the first resurrection because the soul coming to Christ, coming to God, is made alive, right? Is the resurrection of the soul, is the resurrection of. Is the spiritual resurrection of the person. And we've talked before also, I know, about how we tend to get those two kinds of death backwards. We tend to think that the separation of the soul from the body, that physical death is actual real death because it's material, right? And real stuff is material stuff. And then spiritual death is some kind of metaphor, right? Some kind of wishy washy metaphor thing, because everything spiritual is wishy washy. And uwu, Right. But from, from the perspective of scripture, the Fathers and teaching, the Orthodox Church, it's exactly the opposite of that. Spiritual death is real death, right? Because as Christ says, this is life. To know you, the only true God and Jesus Christ whom you have set. That's what it means to be alive. So that's real death. And physical death is sort of an analogy or an image, right, of what that real death is. So the reason why, for example, Revelation 20, where that first resurrection language is used for the souls of the departed, St. John says, Blessed are those who have a part in the first resurrection, right. To be envied. These are. Right, is because they're experiencing the real resurrection already. Right? And the. The physical resurrection is just sort of that playing out, right? In the same way that when Adam and Eve partook of the fruit of the tree of knowledge of good and evil, they spiritually died immediately. They separated themselves from God and then that played out over time until they died physically in the same way. Now it's reversed that that spiritual death, that spiritual resurrection happens first and then the bodily resurrection plays out on the last day."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4476.86,"end":4478.46,"speaker":"Fr Andrew Stephen Damick","text":"So there you go, Michael. Does that make sense?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4479.5,"end":4483.82,"speaker":"Michael","text":"It does. Thank you, Fathers, both very much. I'm looking forward to hearing the rest of the show. Great show."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4484.14,"end":4490.06,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Thank you very much for calling. Okay, we've got another Michael on the line. So, Michael, are you there? Christ is risen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4490.78,"end":4491.98,"speaker":"Michael","text":"Truly is risen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4493.34,"end":4494.94,"speaker":"Fr Andrew Stephen Damick","text":"Welcome. What's on your mind, Michael?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4496.46,"end":4516.15,"speaker":"Michael","text":"Yeah, so I had a question. Well, before I ask my question, I just wanted to extend a thanks to you and Father Stephen podcast. Like this one whole council of God. They've been very helpful for myself, my family, my friends in coming into the church. So just wanted to say thank you for that before I ask my question."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4516.39,"end":4517.67,"speaker":"Fr Andrew Stephen Damick","text":"Thank God. Thank God."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4519.35,"end":4528.63,"speaker":"Michael","text":"So my question is, it's regarding a point that was made in your April 15 episode, how to and how to not read the Bible."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4529.18,"end":4529.58,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4530.94,"end":4592.6,"speaker":"Michael","text":"Yeah, there was a point, I think it was towards the end of the first half where it was mentioned that the Bible doesn't make scientific or historical claims. And my question regarding this is the accounts of the Resurrection, like the bodily resurrection in the Gospels and the Epistles. I've always understood this to mean that the resurrection physically happened. It wasn't just a metaphorical idea or a theory or an idea or an abstract concept. Like it was a, it was a thing that happened physically and in every part of reality. Like Christ fills up all realities. And so I was just wondering, is the Gospels and the Epistles, are they not making a historical claim with regards to the Resurrection and any other claim that they make for events that actually happened in history? I was just hoping you could expand on this."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4593.32,"end":4608.15,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so, okay, well, Father CEO, I'm just going to push that over to you because this is a point that you were especially trying to make in a very fine, precise way about the Bible and historical claims, right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4608.15,"end":4806.88,"speaker":"Fr Stephen De Young","text":"Yeah. And the issue is with that language of making claims, right? So the question is, right, when, when someone makes a statement, any statement, they're making that statement within a certain set of beliefs and values and understandings of the world, right? That conditions and sort of explains that statement. And so if you have someone then say centuries and centuries later, in a different context, in a different culture, in a different language, right? And they try to evaluate that statement. They just take that exact statement from the, the ancient times and they want to evaluate it. You can't evaluate it within your now modern presuppositions and understandings and this sort of thing, right? So for example, if in the context that I'm using the term like scientific claim, if you're going to say that the accounts of Christ's resurrection were making a scientific claim, you would mean that in terms of modern science, right? That you were making a claim as to how the resuscitation of Jesus physical body took place, right. That you're, you're making a claim to. Well, right. And you say, well, that would be ridiculous, right. And that's not what people mean, right. But I would point you to our friend Ken Ham, right. Who, who does make those kinds of strange scientific arguments, right? So like, well, before the flood there was a firmament and so that raised the barometric pressure and that would make snakes not venomous, right? That's an argument he makes, right? Because he's saying, well, okay, look, the Bible is making these claims, scientific claims, and so he tries to use modern science to make them justifiable claims because he's treating them as modern scientific claims, but they're not modern scientific Claims. Because the people who wrote them weren't sort of breathing the atmosphere of modern science. Right. It wasn't how they thought about things. That wasn't what they were trying. They were trying to convey. And so I meant the same thing in terms of historical climates. Right. So, yes, absolutely. They're saying these are things that happened. Right. They're not saying these aren't things that happened or these things might not have happened. These are things that happen. But they're not doing what a modern historian does or claims to be doing or tries to do when he writes history. And that they're not claiming to give an objective account."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4809.12,"end":4809.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4809.52,"end":4843.29,"speaker":"Fr Stephen De Young","text":"Some kind of objective account that's accessible to anyone. Right. And so the equivalent. The equivalent of the Ken Ham on this side, I'll go ahead and mention a couple names. When I was a kid, it was Josh McDowell with evidence that demands a verdict. Mike Lacona does this. Now, where they're trying to do modern history and act like they can construct a modern historical argument that will prove that Jesus rose from the dead."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4846.17,"end":4888.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think that's a dead end. Yeah. I think the. The problem for us as modern people is we're so used to thinking in those terms that. That proving those claims equals this is true. Right. That that's what truth is. But that's not the way that the Bible presents those things. It's not in those terms. That's not these sort of forensic kinds of terms. You know, so there's multiple ways of saying that something is true. And making a historical or scientific claim is not the only way to say that if that makes sense. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4888.62,"end":4908.17,"speaker":"Fr Stephen De Young","text":"For us today. Right. For us today as modern people who have embraced modernism and had it drilled into us, if we haven't embraced it. Right. We think for something to be true, it has to be, know, scientifically provable or there has to be this overwhelming historical evidence or what have you."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4908.25,"end":4909.45,"speaker":"Fr Andrew Stephen Damick","text":"Studies have shown."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4910.01,"end":4935.06,"speaker":"Fr Stephen De Young","text":"Yeah. And. And so, you know, the. And your village atheist, because he's peak modernist, will come and, and throw that stuff at you. Right. And with history, it's especially silly, right. Because they'll come and say, what evidence do you have that Jesus even existed? And you go, what evidence do you have that Alexander the Great even existed?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4937.78,"end":4938.82,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4939.22,"end":4966,"speaker":"Fr Stephen De Young","text":"Right. What evidence do you have that, you know, Julius Caesar ever existed? What? Because history doesn't work that way. Starting in the 18th, 19th centuries, Northern Europeans decided they wanted history to work that way and they invented the social sciences to try to make them work that way. Right. Like sociology and anthropology. And stuff to make them sciences, but they don't work that way."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4966.48,"end":4966.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":4966.88,"end":5029.73,"speaker":"Fr Stephen De Young","text":"So when I said that the Bible isn't making historical claims, I didn't mean that the Bible isn't saying that those things really happened. The Bible is saying that those things really happen. But they're not writing modern history. They're not trying to present you evidence. Right. Of. To prove to you that this is a thing that really happened. And approaching them that way, trying to go to an atheist and trying to use the gospel accounts like some of our evangelical friends do, with the best intentions, they've become modernists themselves in trying to prove to other modernists that Christianity is true. And it just. It doesn't work because the way you frame your inquiry will frame the results you get. And so if you approach things from the perspective of scientific materialism, you're not going to find anything spiritual by using that method. You're just. You're going to get scientific materialist conclusions."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5030.93,"end":5045.19,"speaker":"Michael","text":"Yeah. So it sounds like what you're saying, if I'm hearing you correctly, is that their presuppositions are going to determine. That's going to be a lens through which they view everything. So I actually have a copy of evidence that demands a verdict sitting like."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5045.19,"end":5067.64,"speaker":"Fr Stephen De Young","text":"Three feet from me. I was. I was. This is a true story. This is a true story. See, I grew up in Southern California. I grew up right next to the headquarters of Campus Crusade. So I was at the epicenter of this stuff. And I once argued with Josh McDowell in person and got him to admit that the stuff in that book is not evidence and it does not demand a verdict."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5068.76,"end":5069.24,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5070.36,"end":5074.52,"speaker":"Fr Stephen De Young","text":"So I was pugnacious as a child."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5077.08,"end":5078.68,"speaker":"Fr Andrew Stephen Damick","text":"Is that helpful to you, Michael?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5081.48,"end":5120.8,"speaker":"Michael","text":"Yeah, I just have one small. Yeah, just one small thing. There's a chart in that book, which I'm sure you know about. It measures the. The number of manuscripts. And he says there's. He compares the amount of manuscripts for the New Testament with manuscripts for other historical documents, like Caesar's Gallic wars and all that. And he says there's 24,633 manuscripts for this, which means it's the most credible document of antiquity. But it sounds like what you're saying is even if you use that argument on some kind of human or something, they're going to be like, well, I just don't believe in miracles and resurrection, so I don't care about how many manuscripts you have. Is that kind of what you're saying?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5121.04,"end":5125.84,"speaker":"Fr Stephen De Young","text":"Yeah, that's going to be Hume's response, but also Right. That just proves it's the most popular."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5126.72,"end":5132.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it doesn't mean that what's in it is true. It just means that lots of people copied it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5132.68,"end":5139.28,"speaker":"Fr Stephen De Young","text":"But yeah, the Jerry Springer show got the highest ratings on daytime television for a long time. That doesn't mean it contained any great truth."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5139.5,"end":5157.58,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the usefulness of that data is, is the ridiculous thing that some people say, well, you know, it's been translated and copied so many times, we have no idea, you know, what any of it really, really was. Well, that's just not, that's just someone who's never even looked at the data."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5157.98,"end":5228.13,"speaker":"Fr Stephen De Young","text":"Right. You know, saying that that's, that, that is, that is a good point. So that data is useful. And in fact, I may have a book coming out soon that uses some data like that. But, but it's to make that point. It's to make the point that actually we have a much better idea of what the original text said than we do with any of those other books. Right, but that's different than saying that affects the truth claim. Right. Yeah, you could, because you could say, no, this is exactly what St. Mark wrote. I just still don't believe it. Right. That's. I think he was wrong. But yeah, yeah. And, and so friend of the show, Bart Ehrman, he's coming up a lot tonight. But yeah, he will say that you will act like we have no idea what the Gospels originally said or who wrote them or, you know, because it was like what, 30 years before they were written down. I mean, nobody remembers what happened 30 years ago. So, yeah, that's, that's good encountering that argument. Right, but you're not really making a modernist counter argument. You're just addressing him and saying like what? You know."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5229.97,"end":5248.14,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling, Michael, and we're happy to hear that the show has been helpful for you. Okay, we have one more caller that we're going to take and then we're going to move on. So Samuel from Virginia, who I think is a multi time caller. Samuel, welcome to the Lord of Spirits. Christ has risen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5248.7,"end":5251.42,"speaker":"Michael","text":"Indeed he is risen. Fathers and I have a question about that."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5252.22,"end":5253.82,"speaker":"Fr Andrew Stephen Damick","text":"All right, good. Welcome back."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5254.62,"end":5257.5,"speaker":"Fr Stephen De Young","text":"Yeah, so in some of the earlier."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5257.5,"end":5276.86,"speaker":"Michael","text":"Episodes it was mentioned that ancient Near Eastern cultures thought of the realm of death as the bottom of the sea. So would there be any connection between walking on water and trampling death underfoot?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5278.3,"end":5279.34,"speaker":"Fr Andrew Stephen Damick","text":"What do you think, Father?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5285.82,"end":5361.69,"speaker":"Fr Stephen De Young","text":"Sort of. There are, you've got to read the particular accounts. So St. Mark's account is actually there are deliberate verbal parallels to the Greek translation of Job. So he's actually paralleling Christ walking on the water with a particular passage in Job in order to identify Christ as the God of Israel. But in St. Matthew's Gospel and St. Luke's Gospel, there's more clear allusion to sort of Baal language, Baal being a storm God. And there's even some Baal Zeus stuff going on in the story of St. Paul's shipwreck in Acts, but that's a little further afield. But yeah, so insofar as there is sort of a chthonic veil, you can kind of get there, but the. The focus is less on the trampling and more on Christ's power superseding that of. Of the storm and of the sea. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5361.69,"end":5362.89,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, Samuel?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5362.89,"end":5366.41,"speaker":"Fr Stephen De Young","text":"Kind of, but not quite. Oh, yeah, that. That makes sense."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5366.41,"end":5366.89,"speaker":"Michael","text":"Thank you."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5367.77,"end":5386.49,"speaker":"Fr Andrew Stephen Damick","text":"Alrighty. All right, well, thank you very much for calling. And we're gonna roll on now with our conversation about what happens when people die. So this next part, the second half, we've titled Paradise, Hades and you."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5387.45,"end":5394.09,"speaker":"Fr Stephen De Young","text":"Yeah. And hopefully the middle term will drop out of that for all of us. But."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5394.49,"end":5395.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5397.13,"end":5506.41,"speaker":"Fr Stephen De Young","text":"So where we ended up in the first half was that we're now in this Messianic age. Right. And so usually when we talk about the messianic age, we talk about the present age. We're talking about our life in this world. Right. In the church. Right. Christ ruling in the midst of his enemies. The flip side of that in the spiritual realm is what is called the intermediate state, usually by theological types. And it's called the intermediate state because it's not the final or ultimate state. Right. This isn't even anybody's final form, but it's. It's this in between period. Right. As Michael number one said, his comment on that prayer, that souls translate to that place where it awaits. Right. That awaiting is what we're talking about. Right. And so we're talking about the souls, what happens to the souls of those who die. Right. In this life during the Messianic age. So before we were talking about what happened before Christ. Right. Now we're talking about during our current age. And so we have these two terms that are used. One is paradise. And that, of course, paradise is the loan word in the Greek of Genesis from Persian. Persian, that. I know, I know. Just the Persians weren't around when Moses was. People are going to get mad again."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5506.65,"end":5507.29,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5510.33,"end":5513.37,"speaker":"Fr Stephen De Young","text":"Anyway, the."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5513.37,"end":5513.77,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5513.77,"end":5514.17,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5514.73,"end":5518.98,"speaker":"Fr Andrew Stephen Damick","text":"Isn't there a Guns and Roses reference we could be making Here or. No, sorry."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5520.9,"end":5526.1,"speaker":"Fr Stephen De Young","text":"I. Oh, the grass is probably green. I don't know if the girls are pretty because there's not supposed to be any of that in paradise."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5526.5,"end":5527.14,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5529.3,"end":5586.84,"speaker":"Fr Stephen De Young","text":"So, but. So it's important that the word that's used for this place or state of being, we're going to get into more about how we should understand that the fact that it's paradise, the fact that it's this name for Eden, for the garden, is important. Right. Because as we've talked about in past episodes, that entails a lot. Right. This is this walled garden atop the mountain of God. This is the place where God dwells. This is where his tabernacle, his tent is. And we talked about the rooms in the tent. Paradise is where the tree of life is. Right, that first resurrection language that we were just talking about. And so all of that is brought along to communicate to us the status of the righteous or the faithful who are departed this life, who have left this life in this world."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5587.64,"end":5605.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's this. Not exactly identification, but association with Eden for those. For the. The righteous who've left this world. I mean, it's not. The word is used paradise, but it's not understood to be exactly Eden."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5606.11,"end":5609.07,"speaker":"Fr Stephen De Young","text":"Well, as we've talked about, paradise is wherever God is."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5609.23,"end":5610.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5610.75,"end":5618.35,"speaker":"Fr Stephen De Young","text":"Where God is, that becomes the mountain of God, that becomes paradise. Whether that's the womb of the Theotokos, whether that's Mount Sinai."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5618.75,"end":5621.31,"speaker":"Fr Andrew Stephen Damick","text":"So it is. Is being eaten then."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5621.81,"end":5629.81,"speaker":"Fr Stephen De Young","text":"Right, right, it is being eaten. And as we've talked about before, when we're celebrating the Divine Liturgy, the church is eaten."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5630.37,"end":5690.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, you know, this actually reminds me, a few years ago, I had the opportunity to go on a pilgrimage to Mount Athos. And then when we left Mount Athos, we went to a women's monastery at a place called Ormelia. And there was an elderly higher monk there named Father Serapion, who. Who was from Simonopetro Monastery. And he said something, and I love this. He said something I will always remember. He since has died of cancer, actually, if I remember correctly. But he said, if you live in repentance, then the kingdom of heaven has already come. And I love that as a summary of this, that the kingdom of heaven is present where people are living in repentance, you know, so even. Even then. Yeah, it's just. I don't know, I'm not gonna say I think that should be a T shirt, but at least should be a cross stitch or something. I don't know. It's really? It's an amazing saying."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5690.8,"end":5692.4,"speaker":"Fr Stephen De Young","text":"Something tasteful. Something tasteful?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5692.4,"end":5693.88,"speaker":"Fr Andrew Stephen Damick","text":"Yes, something very, very tasteful. Please."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5693.88,"end":5696.44,"speaker":"Fr Stephen De Young","text":"A lanyard given to mom for Mother's Day."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5698.92,"end":5706.46,"speaker":"Fr Andrew Stephen Damick","text":"I can hear Father Esteban in my head complaining about what he calls patrista memes, but there you are."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5708.7,"end":5763.16,"speaker":"Fr Stephen De Young","text":"But this is also St. John Chrysostom talks about this. Right. He says when worship is happening, that's where Christ is. And where Christ is, there are all the angels, there are all the saints, all the departed. So every time we gather, we're gathering not just with the people. That's why I sense the whole church during matins, even though there's only like two people there and they're sitting at the opposite corners of the back. Right. Because I'm not just sensing the people. You can see. Right, right. The. The. The church is always full. Right. But also, even though I guess it's a tradition that's gone a long time, I really want to attack the tradition in certain parts of the Orthodox Church where when a loved one dies, people stay home from church for a while to mourn. That makes like zero sense to me. Right. The person you're mourning is there in the church."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5764.28,"end":5764.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5765.96,"end":5768.36,"speaker":"Fr Stephen De Young","text":"Why would you not want to be present with them and with Christ?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5768.6,"end":5775.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's weird because usually they go everywhere else, but not the church anyway."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5775.52,"end":5776.44,"speaker":"Fr Stephen De Young","text":"Yeah. So that's."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5776.44,"end":5777.08,"speaker":"Fr Andrew Stephen Damick","text":"Point taken."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5779,"end":5830.15,"speaker":"Fr Stephen De Young","text":"Not a fan of that tradition. Right. But then, so the flip side, unfortunately, is that there is this sort of remaining Hades. Right. But Hades is not to be confused. And there's some great coder language in our notes here. But not to be confused with that final condemnation after the end of days. Right. It's not Tartarus. It's not the abyss. Right. This is. This is not the place where the. The demons are imprisoned. Right, Right. This is Hades. This is, by the four cave analogy, this is where the ignorant and the wicked would go. Right. But they're not considered in the same way. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5832.07,"end":5879.41,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. This is. This is where, like, this is where some of these ideas start to merge in people's heads, where we've got that, you know, the model that. That we said at the beginning was basically garbage. You know, if you go to heaven or hell when you die, you know, like, I know, you know, you can sometimes hear fundamentalist preachers say things like, and he's burning in hell right now. And by that, what. That. What's happened is they've conflated what you just said. Hades, this place of the wicked and the ignorant for the time being with that final condemnation with images of the lake of fire with, you know, all this kind of stuff, but it's not. It's not the same. Whatever word you use, it's not the same. The same thing. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5879.41,"end":5882.85,"speaker":"Fr Stephen De Young","text":"You know, and he's also kind of a judgmental jerk."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5883.09,"end":5883.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5884.53,"end":5886.53,"speaker":"Fr Stephen De Young","text":"But, you know. Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5887.01,"end":5887.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5888.37,"end":5891.49,"speaker":"Fr Stephen De Young","text":"Also confusing these two. Yeah, yeah, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5891.65,"end":5892.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5893.57,"end":5928.85,"speaker":"Fr Stephen De Young","text":"And so, you know, even when we say there's some kind of distinction in Hades as experience, I guess, or paradise as experience between each other, and even within Hades, maybe that there's. There's some kind of distinctions in that experience, people kind of want to get that nailed down. Well, wait. Well, what do you mean? Right. Well, how is it not as bad or how is it worse or what. What do you mean? Experience or what's it like? Even. Even our friend Michael number one."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5931.49,"end":5931.73,"speaker":"Fr Andrew Stephen Damick","text":"He."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5931.73,"end":5974.56,"speaker":"Fr Stephen De Young","text":"Didn'T give his last name, so I don't want to say it out loud, but Michael number one, ask about how time. Right. How do you experience time in that state? Right. And the ultimate answer is that we don't know. And it's not just that we don't know, it's that we can't know. Right, Right. It's. It's not possible for us to understand. That's why we get these images and ideas and impressions from the scripture, because that's the most we can understand about it. Right. Because you don't know what it's like to be a bat. Definitely don't know what it's like to be a dead bat. Right. And you don't know what it's like to be a dead human. We don't know what it's like to not have a material body."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5975.28,"end":5975.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":5975.84,"end":6005.51,"speaker":"Fr Stephen De Young","text":"Because we've always had one. And so all of these metaphors we have of both. Right. Are material metaphors because those are things we understand. Right. Like a tent. Right. Or a garden or a mountain or fire or darkness or whatever metaphor you want to use. Right. These are all physical metaphors because that's how we."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6006.15,"end":6006.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6006.63,"end":6042.9,"speaker":"Fr Stephen De Young","text":"Our senses. Right. So we got our news. That's how we approach reality. Right. So we can't know exactly what it's going to be like. And even if somebody, you know, a saint who has experienced physical death comes back, he or she can't explain it to us because again, we. Until we also experience it. Right. It would be like, you know, a saint trying to explain to me what it's like to be a departed saint would be like me trying to explain to my dog Shelby what it's like to be a human."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6043.86,"end":6064.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, on some level, it's the Plato's cave problem. Right. Where you've got the person who goes out of the sunlight and then tries to come back and tell the people who've never seen sun what that's about. But much more so because it's not just a matter of what someone has experienced. It's a matter of being a different kind of someone."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6065.29,"end":6067.77,"speaker":"Fr Stephen De Young","text":"Right. And having a whole different kind of experience."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6068.17,"end":6076.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah, yeah. Senses that you don't have now. I mean, it's just we don't even, you know, like this is the mantis shrimp thing again."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6077.41,"end":6087.77,"speaker":"Fr Stephen De Young","text":"Right, Right. So we have to be humble enough to accept our limitations as finite beings of a certain type. Right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6087.77,"end":6088.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6089.09,"end":6165.14,"speaker":"Fr Stephen De Young","text":"But that doesn't mean there's nothing here now to be said. Right. And we want to briefly kind of talk about. There is a strong and good tradition in the Orthodox Church that connects a period of 40 days after a person experiences physical death before their soul departs in another sense. Right. To this state of paradise or Hades. And even as I say that, it raises a thousand questions of what do you mean departs in a different sense? And what do you. Why 40 days? Etc. Etc. Right, right. So we have to kind of address sort of what we mean when we even say, for example, what do we mean when we say that person is still present in some sense with their loved ones for 40 days? What does present mean? Because the way we normally use the word present. Right. Is means that something occupies some quantity of physical space in proximity to the physical space that I am occupying."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6165.22,"end":6171.26,"speaker":"Fr Andrew Stephen Damick","text":"Right. That body is near my body such that I can sense it with my physical sense."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6171.26,"end":6179.14,"speaker":"Fr Stephen De Young","text":"Yeah. So that person is present. My mug of coffee is present in front of me on the desk. The desk is present in front of me in the room."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6179.8,"end":6180.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6180.28,"end":6181.96,"speaker":"Fr Stephen De Young","text":"I am present in this room."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6182.68,"end":6202.44,"speaker":"Fr Andrew Stephen Damick","text":"Which if that's the only way that that can mean anything. When Jesus says, I'm with you always, even to the end of the age, people have to kind of go, really? Because there's not a. I don't see him standing here in the. In the room with me. You know, there's not that kind of presence. So it's. It's a narrative."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6202.84,"end":6204.44,"speaker":"Fr Stephen De Young","text":"Is he standing in the room?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6204.84,"end":6208.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, Right, Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6208.22,"end":6221.38,"speaker":"Fr Stephen De Young","text":"Which doesn't make sense. But. So there's another way we talk about presence, though. But the way to get to it is we have to actually kind of come at it backwards because the opposite of presence is absence."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6222.82,"end":6223.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6224.34,"end":6300.32,"speaker":"Fr Stephen De Young","text":"And it's Pretty clear that absence only exists phenomenologically, meaning absence only exists as an experience. Right? Like I can make a mathematical argument that two objects are near each other, right. I could give you a mathematical measurement of the space and everything, right. But there is no way mathematically or scientifically to quantify all of the many millions of things that are not in this room with. Right, right, right. And I don't have any experience of most of them. Like, I don't walk into the room and be like, aha, there is no hippopotamus here. Right. Like I don't experience the absence of hippopotami in my day to day life. Right. There is an absence of hippopotami in my day to day life, but I don't experience. Right. When we experience absence, when we experience that something is gone or something or someone is absent, what we're experiencing is the fact that we believe there is a place where that person or thing is supposed to be and that person or thing is not there."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6301.04,"end":6305.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's, it's. You notice them missing you, you miss them, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6306.32,"end":6395.54,"speaker":"Fr Stephen De Young","text":"I reach for my pocket, the keys aren't there. I panic briefly, I realize they're in my other hand. Right. But that, that's the absence. They're supposed to be there. That's the place they're supposed to be and they're not there. Right? So when we talk about a person who has departed this life, the experience of absence is they're supposed to be here with me and they're not. Right. I'm supposed to be able to pick up the phone and call them and I can't. Right. I want to talk to them and I can't. And that's not. Right. Right. So that's absent. So that presence, to get to what presence means in this sense, we have to then flip to the opposite of that, right? That we're talking about an experience that we have. Right. An experience we have that mitigates against that absence, that we don't ex. That there's this 40 day period during which we don't experience the absence in the same acute way. Right. And so this is. Notice that we're talking here. I'm not contradicting what I just said about us not being able to understand. We're talking when we talk about this tradition from the, our perspective as the people who are still living in this world, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6395.54,"end":6408.22,"speaker":"Fr Andrew Stephen Damick","text":"It's, it's, you know, as you say, phenomenological, which is that is, this is our experience of this, which is subjective. It doesn't mean it's not real, but it is. It's subjective. It's our experience."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6409.26,"end":6418.54,"speaker":"Fr Stephen De Young","text":"So our experience of the departed person, we're not making a claim about what the departed person is experiencing because. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6418.54,"end":6420.7,"speaker":"Fr Andrew Stephen Damick","text":"We don't have that perspective because we."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6420.7,"end":6426.78,"speaker":"Fr Stephen De Young","text":"Don'T know or where the departed person is, for example, in terms of occupying physical space."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6427.5,"end":6443.02,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, and you know, as modern people, we tend to default to trying to think in those terms, but we don't actually have access to that. We don't have a detached access to what's going on out there. We only have what we have."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6444.06,"end":6461.76,"speaker":"Fr Stephen De Young","text":"Yeah. So the 40 days and the memorials and the traditions that are prescribed during that 40 days for that 40 day period are primarily for us. That is not to say that the memorials don't do any good for the departed person. They do."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6462.32,"end":6462.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6463.2,"end":6470.72,"speaker":"Fr Stephen De Young","text":"But specifically the 40 day period, particularly, you know, we do memorials on this day and then that day. Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6470.96,"end":6471.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6471.68,"end":6472.72,"speaker":"Fr Stephen De Young","text":"Those are for us."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6473.12,"end":6498.76,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not that some spiritual scientist has tracked the movements of the soul of a soul for 40 days and figured out that they were wandering for 40 days and then they were gone. And that's why we do memorials. That's not what's going on at all. So when people say, you know, that the memorials are for us, like that's true. They are also for the departed person, but not in the same way that they are for us."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6499.64,"end":6537.07,"speaker":"Fr Stephen De Young","text":"Right. Because we would say that our prayers for the departed benefit the departed regardless of on what day and at what time. Right. Context we say them. Right, Right. But so the way of structuring our morning and our memorials and our prayers for them, the structuring is for us. Right. For the way that we experience time and the way we experience absence and loss. So the structure is for us. The content is for us and for them, but the structure is for us."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6537.71,"end":6538.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6540.67,"end":6545.71,"speaker":"Fr Stephen De Young","text":"So that covered. Now let's talk about what a soul is. Let's move to easier topics."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6547.23,"end":6567.36,"speaker":"Fr Andrew Stephen Damick","text":"I actually saw recently someone did a review of my latest book in which they accused me of. And this is not in there, but they accused me of. Of treating the soul like it's a physical object. I was like, that's the opposite of what I believe. How I know, Right. Am I some kind of originist? But you are."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6567.36,"end":6568.76,"speaker":"Fr Stephen De Young","text":"I'm sure you thought it was spherical."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6572.12,"end":6579.57,"speaker":"Fr Andrew Stephen Damick","text":"I saw that in Charlie, in. In Willy Wonka and the Chocolate Factory. A spherical soul. Anyway, so."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6580.69,"end":6630.76,"speaker":"Fr Stephen De Young","text":"So, yes, in much the same way that. Right. We've seen this sort of conceptual drift Surrounding the word hell that we talked about at the beginning of the first half. Right. There's also been this kind of conceptual drift about a soul. So, for example, people will act like it's crazy talk if you say that anything but a human has a soul. They will talk about humans having an immortal soul and not realize that that's not Christian at all. They will. When we. When we picture a soul, people tend to picture, like. If you picture someone's soul, they kind of picture like a force ghost from the end of Return of the Jedi before the Blu Ray, Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6630.76,"end":6631.32,"speaker":"Fr Andrew Stephen Damick","text":"Before they."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6631.32,"end":6636.64,"speaker":"Fr Stephen De Young","text":"Original Anakin or get out. Anyway. Wow."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6637.12,"end":6642,"speaker":"Fr Andrew Stephen Damick","text":"No love for Hayden Christensen. I don't. Yeah, no, I don't blame you at all. Not even a little."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6645.52,"end":6722.73,"speaker":"Fr Stephen De Young","text":"So, yeah, they'll picture, like, a force, kind of translucent image of the person's body. You know, that's their soul. And that's pretty far afield from the way the word was used by pretty much everybody in the ancient world. So, for example, right off the jump in Genesis 1, on the fourth day of creation or on the fifth day of creation, when God creates the fish of the sea and the birds of the air, it literally says he creates all the souls that swim in the sea and all the souls that fly in the air. And these weren't spears whipping around through the water and the sky. These aren't humans even. These are animals. Right. And so it's very clear all through the ancient world whether we're talking about the way soul is used in Semitic languages, the ancient theories, whether we're talking about even Greek philosophy. Possible exception, Plato, because he gets a little weird with the reincarnation and stuff, but not even so much with him. Basically, a soul is what makes a living thing alive."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6724.25,"end":6724.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6724.69,"end":6727.61,"speaker":"Fr Stephen De Young","text":"Right. So the word nephesh in Hebrew literally means life."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6728.73,"end":6736.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, think about. Even. Think about the English word animal. I mean, it just comes from anima, which means soul in Latin."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6736.33,"end":6744.04,"speaker":"Fr Stephen De Young","text":"Right. And we say that an object is inanimate if it's not alive. Inanimate literally means unsold."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6744.44,"end":6749.64,"speaker":"Fr Andrew Stephen Damick","text":"No soul. Yeah. I mean, I should play the etymology jingle. Oh, well, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6749.64,"end":6754.44,"speaker":"Fr Stephen De Young","text":"And technically, animation means you're ensouling drawings."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6754.68,"end":6755.36,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6755.36,"end":6762.56,"speaker":"Fr Stephen De Young","text":"It's probably a kind of idolatry if."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6762.56,"end":6765.4,"speaker":"Fr Andrew Stephen Damick","text":"You'Re looking for another reason to condemn. Disney, everybody. There you go."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6765.4,"end":6765.96,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6768.84,"end":6769.08,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6770.84,"end":6843.12,"speaker":"Fr Stephen De Young","text":"And this perspective carries on to the church fathers, right? You can look up St. Gregory Palomas talking about how animals have souls. Right? Now, there are different types of souls, right. They're not saying everything has A human soul. Right, right. They're saying. They're saying that they have souls, but they're souls of a different type of. Right. Than a human soul. So you have sort of. With plants, which are alive and animals, you have what you might call micro souls. Right. Or the way Aristotle works it out is you have sort of the most basic level of a soul, the vegetative part, which is what plants have, where they take in nutrients and they grow and they reproduce. Right. And that's sort of basic. Right. All living things have that basic level. Plants only have that basic level. Right. Then animals have the addition of desires, which we usually translate as passions. But animals have desires, right. They get hungry, they get thirsty, they need to sleep, they move about."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6843.68,"end":6844.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6844.48,"end":6884.08,"speaker":"Fr Stephen De Young","text":"They. And they seek to fulfill those desires. Right. And so that's. Again, animals and humans both have that right. But animals sort of only have that Right. And then humans have a noetic soul. Humans have a noose, right. That gets translated through Latin into English as man being the rational animal. But that kind of misses the point. It's. Man is a noetic. Right? Man has a noose. Right. And that makes a human soul different than a plant soul or an animal soul."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6884.32,"end":6884.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6885.68,"end":6908.19,"speaker":"Fr Stephen De Young","text":"So humans, if we take human souls as a baseline, other living things have sort of micro souls. But then there's also. And this is a concept that we've mostly lost in the modern world, although some folks are coming back to it, even atheists, is the idea of what we might call macro souls."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6908.67,"end":6965.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which is this idea that larger systems, like whole communities of people, for instance, have a soul together, like the soul. Yeah, right. There's this common life that is greater than the sum of the parts. And I think the reason why that this is a hard concept to grasp is because we tend to want to think of the soul as being an object. Right. Rather than the life that exists within a person or a system or whatever, you know, But. But it's true. I mean, you think about, like, if, you know, if you've ever moved from one place to another, the new place has a different way of being, and you can just feel it and experience it, and you participate in it. You participate in the way of being of that place. And it's something that's larger than just simply lining everybody up and just walking, watching what they do."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6967.63,"end":6973.63,"speaker":"Fr Stephen De Young","text":"Right. And it could be functional or dysfunctional, it could be sinful or it could be holy."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6974.11,"end":6978.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why, like, whole nations get condemned in Scripture, for instance. Instance."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6978.74,"end":6979.06,"speaker":"Michael","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6979.06,"end":6982.02,"speaker":"Fr Stephen De Young","text":"You know, even down to, you Know your parish community."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6983.22,"end":6983.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6983.62,"end":6997.46,"speaker":"Fr Stephen De Young","text":"At your church. Right. The way sin in the community is talked about in the New Testament. Right. Doesn't make sense if you're just thinking about it as a group of individuals who gather together with a common purpose."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":6999.46,"end":6999.86,"speaker":"Michael","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7000.34,"end":7032.84,"speaker":"Fr Stephen De Young","text":"In which the individual sin of another person has nothing to do with. Right, Right. So, yeah. So a good way to think about it is to think about the fact that in a human. Right. In our human body, not only do we have completely unrelated organisms living like our gut biome, but we don't even have to go there. Every cell in our body is a living thing. It's a living organism. Right. The cell is alive. Right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7033.16,"end":7033.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7033.44,"end":7089.33,"speaker":"Fr Stephen De Young","text":"While it's connected to our body, at least it will die and get shed off. But it's, it's alive, but yet it makes up a greater whole. Right. And so this also happens, and this, this is when St. Paul talks about the church community being the body of Christ and us being the members, the parts of the body, and each of us playing this role. So the whole body can thrive and function and Christ is the head and the body is animated by the Holy Spirit, which is the spirit of Christ. Right. Made alive by it. Right. This isn't just sort of pure woo woo metaphor again. Right. He's, he's pointing to something real. Right. And, and St. John can, can write his letters to the seven churches and talk about the church like it's an entity."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7090.53,"end":7091.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7091.05,"end":7110.75,"speaker":"Fr Stephen De Young","text":"It has this one guardian angel. Right. And it can say, he can say, you have forgotten your first love. Right. And yeah. Modern Western individualism makes this brain breakingly hard for us to understand."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7111.31,"end":7184.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We, we try to come up with other words like vibe. Right. I mean, that's Right. Isn't that an attempt? Like you're like that, that group has a particular vibe which is simply. I mean, it's, it's not the word that I would prefer, it's not a theological word, but it's pointing at this reality. We have a sense like, you know, often this is apparent, I think, when people go into a, like a large crowd experience or sometimes a very intimate experience with a particular group of people. And you know, they'll say there was a spirit there or a, the room had a certain feeling, you know, like that's, that's what's being pointed to. Right. And this is an experience we've all had over and over again. But if you try to talk about it in some specific objective way, there's kind of, there's not much to point to. There I mean, someone might talk about, I don't know, maybe pheromones or something. But I mean, there's, but there's not a lot to kind of point at in any sort of empirical way. But nonetheless, it's an experience that we've all had and it simply is part of what it means to be human, right?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7184.12,"end":7436.18,"speaker":"Fr Stephen De Young","text":"And this is, you know, way back when we were talking about, about sacrifice in the ancient world, right? The reason there are spirits, this is, this is how powers and principalities work. These are macro souls. These are steps above us, right? The same way the animals and plants are steps below us. That, that these complex systems in nature, in the heavens, etc. That, that these are being superintended by these spirits, by these noetic beings, right? By angels, right? And some of them, some of them turn to evil, right? This is, this is sort of how that works, right? But we're so individualized and alienated now that everything below us, animals, plants, whatever, right? The earth itself, right? Nobody believe in a world soul anymore, right? The, the earth itself is just, it's below us. So it's not life in the sense that means anything, right? Only our human rational life means anything. Everything below us is just resources to be exploited, right? And dealt with as need be. And we believe that nothing above us exists, frankly. Right? So all you have left are individuals. And that's why nothing above us can exist because we can't think of ourselves as I'm a cell in a bigger organism. I'm the part, I'm a part playing a part in a larger body. I'm the big toe, right, of this larger body, right? I am, I am part of a larger whole and I am a subset of something. We can't even think about ourselves, that I am the unit, I am the individual, I am the one. Anything below me is less than one and so unimportant. And there's nothing more than one. When we gather together, it's one plus one plus one plus one plus one plus one plus one, right? We don't gather together and become one. And so, yeah, it's made it even hard for us to think about. But if we're going to talk about souls and like I said, we're talking about life, right? And so human life is one type of life, but there are levels of life below that and there are levels of life above that within the creation, before we even get near to God, right? Just within the creation, there's a button above and below. And so to come back around to where we Started this half, the second half. What we're talking about, when we're talking about the intermediate state is that the life we live in the body, the life we live in this world. Right. Continues after it is separated from our physical body. Right. When you see someone who is alive and then they. You see them die afterwards, what has changed? The body is still there, but the life has left. That life does not cease to exist, but that life becomes hidden from us. This is the language that the New Testament uses, that our life is hidden in Christ. And so when we talk about this period and, and then the Last Judgment, this isn't we're in a holding cell and then we're going to stand in front of the judge and get condemned or get found innocent. Yeah, Right. But it's actually that we are. Our life is hidden but continues until that day when Christ comes to set everything in the creation. Right. But what that means is that this intermediate state for us, whether we want to label it as paradise or Hades and whatever gradations we want to talk about, it's a continuation of the life we live in the body."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7437.38,"end":7543.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We shouldn't think of it as, you know, like we. I don't think we mentioned this, but like there's these experiments or did maybe you did, you know, that were done where the people try to figure out the weight of a soul by measuring someone's weight at the moment that they die. Right. That's not what's going on here. The soul is not a thing that leaves the body and goes somewhere up in the air or down below or whatever. It's that the life of the body separates from it. But again, like we talked about presence, what exactly does that mean? You know, the, the notion of it going down makes sense because when you put a human body into the ground, there's this idea that the life of the body sort of dissolves into the ground. But that we're not saying that that means that human souls are underneath the earth's crust somewhere. Right. It's that this is the image that we've got. You know, likewise, the notion of the soul going up is not that we're saying that they float up into the atmosphere. It's that because we have this image of Christ as being ascended and the life is hidden in Christ, that idea of up makes some sense. But we're not talking, we're not saying that it's a location because like when Christ ascended, he didn't fly up into the atmosphere and land somewhere in space. Like that's not that's not what's going on. So. So again, you know, when we talk about up and down and all that, that kind of stuff, it's sort of spiritual geography in a sense. Right. It's not a. A spot."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7543.81,"end":7546.09,"speaker":"Fr Stephen De Young","text":"Right, right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7546.09,"end":7546.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7546.53,"end":7592.47,"speaker":"Fr Stephen De Young","text":"Right. And so the. The key is that there's. That. There's that continuity. Right. So if we've lived our life in the body, following Christ, drawing close to Christ, coming to know God in Christ, then that continues. That life continues after it is separated from our body. The flip side is if we've lived our life in rebellion against God and hatred against God. Right. In rejecting him, then that life also continues. Right. When we leave the body. But ultimately, we're waiting for that day to come, that last day when Christ will restore perfect justice. Which we'll talk about more in the third."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7592.47,"end":7611.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly. In the meantime, we pray. Because that day has not come yet. Because that day has not come yet. But we pray for our departed. We pray for each other in preparation for that day. Okay, we're gonna go ahead and take our second and final break, and we will be right back."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7612.29,"end":7628.53,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7637.82,"end":7640.46,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7640.62,"end":7653.34,"speaker":"Fr Stephen De Young","text":"Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer? Are you an Orthodox Christian looking for a reliable first place to send your interested friends?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7653.5,"end":7656.45,"speaker":"Fr Andrew Stephen Damick","text":"Do you need help finding an Orthodox church church near you?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7656.85,"end":7658.57,"speaker":"Fr Stephen De Young","text":"My name is Father Paul Hodge."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7658.57,"end":7660.81,"speaker":"Fr Andrew Stephen Damick","text":"I serve in the Antiochian Orthodox Christian."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7660.81,"end":7669.57,"speaker":"Fr Stephen De Young","text":"Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7669.65,"end":7673.17,"speaker":"Michael","text":"I serve in the Greek Orthodox Archdiocese of America."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7673.25,"end":7682.53,"speaker":"Fr Andrew Stephen Damick","text":"And I'm Fr. Andrew Stephen Damick, Chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox Intro team."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7683.11,"end":7692.47,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop online to get an introduction to the Orthodox faith, a place to get answers to questions from qualified Orthodox Christian clergy."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7692.55,"end":7694.87,"speaker":"Michael","text":"A place to send your friends and."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7694.87,"end":7699.07,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos of the Internet, a place to get."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7699.07,"end":7719.28,"speaker":"Fr Andrew Stephen Damick","text":"Help finding an Orthodox parish and get plugged into an actual Orthodox community, then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient Faith Ministries and made possible by our donors. It's An Orthodox on ramp to the Christian life again. That's orthodoxintro.org."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7727.84,"end":7743.92,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7745.92,"end":7755.84,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half. It's a show and a half. We're talking about what happens when people die in the first part. Oh, go ahead, go ahead."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7756.48,"end":7759.92,"speaker":"Fr Stephen De Young","text":"If I could give you one note on the Orthodox intro."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7760.52,"end":7763.16,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure, yeah. I'm not going to edit it now, but. Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7764.04,"end":7782.2,"speaker":"Fr Stephen De Young","text":"Well, what would have raised it to the level of perfection, Right. Would be if during, during your bit, after you introduce yourself, you did the. And we are. Dramatic pause and then everyone says in unison, the Orthodox intro team."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7784.68,"end":7788.03,"speaker":"Fr Andrew Stephen Damick","text":"That would be pretty. Yeah, yeah. No, I mean, I. I hear you."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7788.03,"end":7789.35,"speaker":"Fr Stephen De Young","text":"Next level. Next level."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7789.99,"end":7796.79,"speaker":"Fr Andrew Stephen Damick","text":"But it's a level of like. I wasn't going for cheesy. Cheesy was not where I was aiming with that ad."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7796.95,"end":7800.47,"speaker":"Fr Stephen De Young","text":"You say cheesy. I say engaging with your audience."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7805.03,"end":7826.75,"speaker":"Fr Andrew Stephen Damick","text":"Go Planet. Anyway, that's actually almost a little too young for me, Captain Planet was. Was not from my youth. That was from a little bit young for. Well, you and I are about the same age. I think it was a little bit younger. I think we might have been teenagers or when that came out, I have to go."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7826.75,"end":7829.39,"speaker":"Fr Stephen De Young","text":"Despite the peak 80s mullet. That is true."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7829.79,"end":7858.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly. So. All right. Well, it is the third half and now we're. I mean, we're actually following a fairly clear structure. So the first one we were talking about, you know, the underworld prior to the coming of Christ in the second part. Now, death, what happens at death during this messianic age. And now we're talking about the life of the world to come. So this is what's in the future from our point of view. So."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7858.52,"end":7860.84,"speaker":"Fr Stephen De Young","text":"Yeah, sometimes what I do makes sense."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7861,"end":7865.4,"speaker":"Fr Andrew Stephen Damick","text":"Stop talking about that. So."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7867.49,"end":7899.57,"speaker":"Fr Stephen De Young","text":"Yeah. So coming back to where we began, right. This. This idea that probably most, at least American Christians have in their head that, well, you know, you live in this world and you die and if you're a good Christian, you go to heaven and if not, you go to hell. Yeah. And both of those last forever. That is a sub Christian eschatology. That's not Christian."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7900.05,"end":7900.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7900.45,"end":7909.57,"speaker":"Fr Stephen De Young","text":"Actually, that's Gnostic. Yeah. So just about everybody's a Gnostic."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7909.81,"end":7911.33,"speaker":"Fr Andrew Stephen Damick","text":"Don't be Gnostic, everybody."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7915.81,"end":7927.39,"speaker":"Fr Stephen De Young","text":"So, yeah. And that's bad. Yeah. So there was a. There was A book that Harold Bloom wrote a long time ago now, because."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7927.39,"end":7930.07,"speaker":"Fr Andrew Stephen Damick","text":"I'm old a long time ago now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7931.99,"end":7942.31,"speaker":"Fr Stephen De Young","text":"Called the American Religion, that was sort of a religious history of the United States. Harold Bloom was an avowed gnostic. I think he's dead now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7944.24,"end":7944.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":7946.48,"end":8009.9,"speaker":"Fr Stephen De Young","text":"But he was a Yale Shakespeare professor and a devout gnostic himself. But he did sort of a religious history of the United States and argued that American Christianity, with a couple of set of exceptions that he outlined, was pretty much all narcissism. And this was one piece of that. That there wasn't really a firm belief in a bodily resurrection and that the, the there was going to be a new heavens and a new earth, that we're going to live on the earth and resurrected bodies. Right. That was not a firm reality in most people's heads. And then also the way just in general American Christianity of all stripes. So this comes out of sort of the Puritan base was very world denying and very sort of anti material enjoyment and pleasure. And just the idea of worldliness meant sin. Right. So it was like even things that you can't make a good biblical case. Our sins, like playing cards, you know, were seen as just kind of tainted because they were things of the world."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8010.38,"end":8011.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8012.86,"end":8021.02,"speaker":"Fr Stephen De Young","text":"And that sort of disdain for the material world is kind of innately gnostic."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8022.06,"end":8026.06,"speaker":"Fr Andrew Stephen Damick","text":"I just looked it up and that book came out in 1992. It has been a long time."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8026.71,"end":8032.67,"speaker":"Fr Stephen De Young","text":"Yeah, man. Yeah. I was young once. My heart was an open book."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8032.67,"end":8037.91,"speaker":"Fr Andrew Stephen Damick","text":"I used to say I was young and foolish then. I feel old and foolish now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8041.75,"end":8051.51,"speaker":"Fr Stephen De Young","text":"So one of the sneaky ways that Gnosticism falls into our Christianity, like chocolate adore peanut butter."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8053.51,"end":8053.75,"speaker":"Fr Andrew Stephen Damick","text":"Is."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8056.31,"end":8059.19,"speaker":"Fr Stephen De Young","text":"Except that makes it better and narcissism makes Christianity."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8059.19,"end":8060.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say, I'm on."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8060.95,"end":8062.35,"speaker":"Fr Stephen De Young","text":"Board with chocolate, Peter."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8062.35,"end":8063.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8063.75,"end":8065.27,"speaker":"Fr Stephen De Young","text":"Inverse recent situation."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8067.03,"end":8067.43,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8070.39,"end":8071.91,"speaker":"Fr Stephen De Young","text":"Is through Platonism."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8073.11,"end":8073.67,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8074.87,"end":8139.55,"speaker":"Fr Stephen De Young","text":"We. We often forget if we ever knew that Plato's Timaeus was part of the Nag Hammadi Library. The find in 1948 of all the Gnostic texts included Plato's Timaeus, Plato's account of the creation of the world. And while there have been, especially in the West, a lot of attempts to fuse Platonism and Christianity, bad news for you. They don't really dovetail because there. There are basic ontological meaning related to being what is and what isn't presuppositions that Plato has that don't really work with Christianity. And so you end up getting something closer to agnosticism. One of the places where this surfaces Germane to our topic tonight is the whole idea of the beatific vision in the West."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8140.19,"end":8142.11,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, big throwdown now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8142.99,"end":8176.38,"speaker":"Fr Stephen De Young","text":"Yeah, deal with it. The whole idea of the beatific vision, the idea that the soul, once it is freed from the body, can behold the essence of God, could behold the divine essence, and that that is its state for eternity. Right. Even as I said that, you probably noticed a bunch of problems. So first of all, the soul being freed from the body, whereas what the Scriptures teach or what Christianity teaches is that the soul separating from the body is unnatural."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8177.58,"end":8177.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8177.94,"end":8187.34,"speaker":"Fr Stephen De Young","text":"Death is bad, and that our destiny is to be rejoined to our body. Right. Being separated from the body is not good or better."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8187.66,"end":8188.06,"speaker":"Michael","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8189.11,"end":8195.51,"speaker":"Fr Stephen De Young","text":"Number two, the idea that the soul can then behold the divine essence, can come to know the essence of God."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8195.59,"end":8196.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8198.39,"end":8212.23,"speaker":"Fr Stephen De Young","text":"And be conformed to it by that seeing. And then third, if that's the eternal state of the soul, what happens to the body? Bodily resurrection."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8213.27,"end":8213.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8214.67,"end":8285.85,"speaker":"Fr Stephen De Young","text":"And so Western theology in particular passes through this Platonist period, from Augustine through, you know, Bist, into the, into the beginning, late through late antiquity and into the early medieval period. And folks who come along try to reckon with this problem. Right. So Thomas Aquinas tries to kind of deal with this issue, right. In, in the third part of his summa. Now, Thomas didn't finish the summa. He had a mystical experience that caused him to think it was garbage. Right. And so he didn't want to finish it. So the third part was compiled from his notes. So it may be that, that Thomas had some kind of solution to this problem now, but if he did, we'll never know what it was. So what we do find in his notes is that he affirms this whole beatific vision idea. The soul, free from the body, can behold the divine essence, but then also affirms the bodily resurrection."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8287.37,"end":8287.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8287.93,"end":8343.22,"speaker":"Fr Stephen De Young","text":"Because, I mean, he is a Christian, Right. So he's, he's got to affirm that. So, but there's, there's no, there's no conceivable way that those two dovetail based on what's on paper now. So like I said, he might have had something in mind that we'll never know to try and reconcile those two. But it's not there. Yeah, it's not there. And so one of the pieces that's problematic about this, they said, you know, thinking you can behold the divine essence is enough, but the idea that you're then conformed to it. Right. Is picking up on this basic idea in Plato that multiplicity is bad, that the good and the true and the beautiful and the perfect have to all be one and simple."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8344.66,"end":8367.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like, we have this. And I think that this is written deep into our culture. Like, if we see things that are multiple or complicated or there's lots of different ways, we tend to say, well, why can't this just be one? We just need one way. You know, one. I mean, at its worst, right. This becomes totalitarianism, the way that it gets played out."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8367.41,"end":8376.46,"speaker":"Fr Stephen De Young","text":"Right, Right. And people say it all the time. They say, hey, we may all be wrong, but we can't all be right. Only one of us could be right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8378.62,"end":8413.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's the. Yeah, exactly. And I mean, and this is the basis, for instance, I got asked the other day when I pointed out, you know, within the Orthodox Church, for instance, there are multiple canons of scripture. I mean, they're mostly the same, but there's. And when you get to the Early Testament. Yeah, exactly. Yeah. And like, well, why. Why hasn't that been worked out by now? I'm like, because we've never seen it as a problem that has to be worked out. You know, that there's. It's. It's okay. Multiplicity is okay. Not all diversity equals contradiction."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8413.94,"end":8596.45,"speaker":"Fr Stephen De Young","text":"There's. There's all kinds of practical places where this plays itself out in the red in the west, like the West's seeming inability to regard marriage and monasticism or marriage and virginity as equal, as two equal paths to holiness and to God. Right, Right. You have an emergent tradition in Rome of virginity being the higher way of life. Right? And then. But some people can't do it because they don't have the special graces to do it. And so they're allowed to get married as a sort of concession. And then married people are allowed to be together as long as they're trying to produce a child, et cetera, et cetera. Right. They can't be co. Equal. And then you get the Protestant Reformation, which reacts in the exact opposite direction. Right. Where anybody who would pursue celibacy is some kind of weirdo. And marriage is it. Everybody should be married. Right. Because you can't have, as we have in the east, these are two paths for different kinds of people. Right. There has to be a higher and a lower. There has to be a better and a worse. And whatever is lower or worse has to, in some sense, be kind of simple. Right. And kind of bad by virtue of not being the good. And the good can always just be this one. There's this one right answer. Right. And what's the right way to do it. What's the right answer? There can't be multiple ways. There can't be multiple ways to see this, there can't be multiple ways to approach this. Right? But everything from our Christian tradition tells us the opposite, right? We have, we have thousands of saints, all conformed to the likeness of Christ, but who are all very different people with different personalities, different genders. Some of them are married, some of them are monastics, some of them are clergy, some of them are laity, some of them are martyrs, some of them died of old age. Right. Living in all different times, in all different places, in all different cultures. Some of them wrote, some of them were illiterate, some of them were theologians, some of them were very simple people, some of them were hypnographers, some of them couldn't carry a tune in a bucket. Right. And we see that and we don't like taxonomize them, Right. Well, we've got the theotokos up at the top and then the next tier, and then the next tier and then each of these is a little worse, Right. So that's how the Christian tradition works. Multiplicity is fine. And the whole idea that simplicity is better than multiplicity, that, that the number one is somehow superior and more noble and beautiful than the number two or three. Three is just a weird Pythagorean religious presupposition that Plato had. There is no basis in reality for it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8597.65,"end":8598.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8602.53,"end":8608.61,"speaker":"Fr Stephen De Young","text":"So we could, we could just kind of jettison it, right? Like we don't owe Plato anything."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8610.13,"end":8668.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you look, and if you look at the scriptures, this isn't there, you know, And I mean, this is also the base. I mean, there's a number of ways this gets practically worked out. I mean, you mentioned marriage and monasticism, for instance. But even for instance, when people say, well, the gospel should be simple, when you, whenever you start talking any kind of level of theology or whatever, there are some people, not everybody, not most people maybe, that will say things like, well, the gospel should be simple because they're used to a very simplified version. And so therefore anything beyond that is a complication that violates this principle of simplicity. Even though when the apostles preach the gospel, it's not some two sentence elevator speech, it never is. And even the short versions are predicated upon a whole tradition, usually that they share with the person they're talking to, which often we don't share."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8669.74,"end":8700.09,"speaker":"Fr Stephen De Young","text":"Let me be even more controversial, okay? The solas of the Reformation, this alone, that alone. This alone, that alone, yeah. Why? Why, why alone? Why can't there be richness? Yeah, yeah, right. Like why, why, why does everything have to be one and simple and no justness? Right. And this is how it is. Right. It's all these, these Platonic. And let's not forget Plato. Not actually a Christian."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8702.57,"end":8702.97,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8703.05,"end":8777.31,"speaker":"Fr Stephen De Young","text":"Right. And so the other, the other big piece of this is, is the whole issue of matter, the body, right. That, that somehow being in the body makes the soul unable to see God and no God to behold it, but somehow being freed from it, you know, the body being the prison house of the soul, according to Plato and John Calvin, that, that somehow that then frees, you know, the soul to do this so that that matter, the material body, the material world, by virtue of being material, is somehow negative. Right. And this is, this is sort of the Gnostic starting point. And it comes from these Platonic presuppositions that as soon as a God emanates or creates something other than himself by virtue of it not being him, since he is the good and it is not him, it is therefore in some sense bad or evil. Right. Because the good can only be. Can only be one. And that again is completely counter to Christianity, which teaches from literally the first page of the Bible that God called everything he created good."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8778.35,"end":8778.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8779.87,"end":8815.24,"speaker":"Fr Stephen De Young","text":"Right. And, and so for us as Christians, matter is the vehicle for God's grace, for the divine energies, for God working in us. Right. So our body is the vehicle through which our salvation is worked out. It's not a detraction from coming to know God. It's the way in which we as created human, finite beings come to know God is through our bodies, including our material, physical bodies. Because we've talked about body and the different senses."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8815.32,"end":8815.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8817.48,"end":8835.76,"speaker":"Fr Stephen De Young","text":"And this, of course, we're coming back to the Incarnation again, Right. This is where we see that most fully. Right. When God works our salvation in Christ. Right. He does it by taking him upon himself, our human nature, including our human body."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8836.56,"end":8837,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8837,"end":8838.88,"speaker":"Fr Stephen De Young","text":"And he doesn't get rid of it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8839.68,"end":8843.48,"speaker":"Fr Andrew Stephen Damick","text":"No. At the resurrection or at the ascension."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8843.48,"end":8844.72,"speaker":"Fr Stephen De Young","text":"Because now he's free."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8846.32,"end":8846.72,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8846.8,"end":8847.2,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8847.69,"end":8851.05,"speaker":"Fr Andrew Stephen Damick","text":"He's got a human body forever. This is a permanent union."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8851.61,"end":8887.55,"speaker":"Fr Stephen De Young","text":"Yes. Yes. Right. So all that said, all of this to say that's problematic. What we are looking forward to is the transfiguration, the transformation, the salvation of the world, the cosmos. It's a Greek word, cosmos, that's translated as world. Right. So it doesn't just mean earth, that means the universe. Right. The whole creation. Right. That's what we're waiting for. We're waiting for the resurrection of the whole creation. Right. Which according to St. Paul in Romans, groans awaiting it."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8887.87,"end":8888.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8890.11,"end":8941,"speaker":"Fr Stephen De Young","text":"And so when we talk about Christ and his glorious appearing, judging the world, we mean, as we said before tonight, him putting it all back in order, the whole universe gets put back in order, gets put back to what it was created to be, all functioning as a whole. Right. And that includes all the creatures. Creature means something created. That includes humans. That includes things lower. That includes things higher, the angelic beings. And so then creatures who refuse to be put back in order, who refuse to be justified. Right. They're excluded from that order, which means they're excluded from creation. They're excluded from the cosmos."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8941.32,"end":8942.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8942.28,"end":8956.76,"speaker":"Fr Stephen De Young","text":"And once the world has been put back in order, we've talked about these two functions. This is the new creation. Right. So we talked about the two functions. There's putting things in order and then the world is going to be transfigured, meaning it's going to be filled with the life of God."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8957.65,"end":8970.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is just, just essentially a repeat. But. But a. Not just a repeat, but a fulfillment of what was the pattern that was begun in Genesis, you know, with this order created, and then it's filled."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":8971.97,"end":9000.57,"speaker":"Fr Stephen De Young","text":"Right. And so the whole cosmos is transfigured and filled with the life of God and the divine energies. That includes all creatures, creatures below us. The creatures above us. Right. And any creatures who refuse the life of God, participate in the life of God, are excluded from the life of God. They're excluded from it. But this is why I forget where I said. I think I said it in a blog post once. This is why you can say that the Holy Spirit is the atmosphere of the world to come."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9002.89,"end":9003.61,"speaker":"Fr Andrew Stephen Damick","text":"That's cool."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9003.61,"end":9052.61,"speaker":"Fr Stephen De Young","text":"Because. Cool way of putting divine energies permeate everything. So what does that mean? What does it mean for a creature, whether it be a demonic power or a human, to be excluded from the cosmos, to be excluded from creation, or to be excluded permanently from the life of God. Right. Well, again, we're talking about a different age. We're talking about the life of the age to come. We don't know. Hopefully none of us, none of us listening to this ever will know what that means. Exactly. But again, we're given sort of metaphors and images, Right. And impressions by the scripture to help us try to understand what that would mean."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9053.57,"end":9054.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9056.45,"end":9061.25,"speaker":"Fr Stephen De Young","text":"And so we get the image of the Lake of Fire, that first hat that."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9061.68,"end":9068.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say that's probably the one that most people think of immediately burning, you know."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9068.2,"end":9078.04,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that's that first appears in texts that we still have in the book of Enoch, but then gets picked up in Matthew and Revelation. Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9078.04,"end":9081.84,"speaker":"Fr Andrew Stephen Damick","text":"And explicitly said that this is made for the devil and his angels."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9083.2,"end":9116.76,"speaker":"Fr Stephen De Young","text":"Right, right. That's what's created for. It's not created for people. Right. But the people who choose to become like the devil and his angels end up there with them, at least potentially. We get the image of outer darkness, or just darkness in general. Right. We get these images of being shut outside, whether it's being shut outside the wedding banquet or shut outside the kingdom. Right. That there are gates or doors and they are outside. What does it mean to be outside the gates of created reality? Again, we don't know exactly."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9117.08,"end":9118.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9119.56,"end":9145.4,"speaker":"Fr Stephen De Young","text":"We get this image of madness, which is what weeping and gnashing of teeth is about. That's not an image of pain. That's that you. You look at places where those Greek words are used. Like in classical literature, it's always describing someone who's gone mad. Right. And sort of all of those can be sort of summed up as a kind of dehumanization. It's a diminution of human nature becoming less human."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9146.52,"end":9147.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. So."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9147.08,"end":9151.8,"speaker":"Fr Stephen De Young","text":"So less like Christ, because Christ has. Is the perfection of our human nature."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9151.8,"end":9152.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9152.68,"end":9153.72,"speaker":"Fr Stephen De Young","text":"More like the demons."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9154.36,"end":9179.91,"speaker":"Fr Andrew Stephen Damick","text":"So the image that some people have where this experience, God forbid that any of us have it, is us as we are now being inflicted with horrible pain and torture forever and ever, is predicated upon a whole set of assumptions that simply are not there, you know? Right. The biggest one being that we will be essentially be as we are now."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9181.11,"end":9181.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9181.43,"end":9198.93,"speaker":"Fr Andrew Stephen Damick","text":"But it's. But it's not. Again, you said there's this dehumanization, this subhumanization, because that's what sin does to you. If Christ is the perfect man, then, as you said, you know, it's. It's heading in the opposite direction."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9200.21,"end":9211.41,"speaker":"Fr Stephen De Young","text":"Right, right. And so since we can't really understand what that is, that we just get these images, why are we given these images and these metaphors? Like, what function does that serve?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9211.97,"end":9212.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9212.37,"end":9245.77,"speaker":"Fr Stephen De Young","text":"Right. Because we. We had the call about the claim language. Right. Like, since we're just giving impressions and analogies, the scriptures, again, can't be like making a claim here. Is it? Precisely what is going to happen to people who. It can't be saying that because we're not given that kind of detail. Right. So why are we giving these impressions? And so to understand that, we have to look at how it functions in the life of the Christian, because these images are given to Christians."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9247.21,"end":9249.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. They're not aimed at the world."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9250.74,"end":9284.75,"speaker":"Fr Stephen De Young","text":"Right. We don't see the apostles going into a pagan Greek city and saying, all y' all are gonna burn for eternity if you don't get. Right. Right. And you know that's not the gospel as they proclaimed it. Right. It's the exact opposite. Right. They come and tell them about Christ. Right. And what Christ has already done for them and now what he requires of them. And they say, what must I do to be safe? Right. And it's not used in scripture or in the fathers to threaten people outside the church."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9286.03,"end":9289.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is a huge point in our."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9290.99,"end":9309.67,"speaker":"Fr Stephen De Young","text":"Publicly many times for anyone to find me an example of a church father talking about Christians, like the ones he's talking to when he preaches, y' all are going to heaven. But then bad people out there, they're all going to hell."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9311.51,"end":9311.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9311.95,"end":9338.16,"speaker":"Fr Stephen De Young","text":"And I know it's semi maybe classist. I don't know that I do the Southern drawl whenever I talk to. But so. But they're. They're about there. They're all. They're all going to hell. Because that's not what you ever see. Right. What you see is hell is for Christians. You see church fathers threatening the good church people who are showing up to hear them preach, with hell."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9339.04,"end":9346.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. And hell here being not a word for the underworld. Hell. Now we're referring to the state of eternal condemnation."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9346.48,"end":9365.21,"speaker":"Fr Stephen De Young","text":"Eternal condemnation. Yeah, with eternal condemnation. With being shut out of the kingdom without her darkness, with the weeping and gnashing of teeth. If you look at where those images appear in Christ's parable, he's addressing them to the people he's talking to. This is your potential fate."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9365.77,"end":9400.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is an important point. I mean, we've said several times. One of my favorite sayings, you know, there's no tale without a teller, but there's also no tale without a hearer. And the hearer is really important. Who is Christ talking to? I mean, you've made this point a number of times and in your whole Counsel of God podcast. For instance, when St. Paul is talking to pagans, he speaks in a certain way. When he's talking to Jews, he speaks in another way. And that's very deliberate. Right. That you can't isolate these things from that context and try to come up with some kind of independent system."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9402.5,"end":9409.06,"speaker":"Fr Stephen De Young","text":"Treat them as some kind of objective truth claim or a logical proposition you can take out of context and assess."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9409.37,"end":9497.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right. There's a point. There's a point to this being addressed To Christians. Right. And, and, and we gotta. Actually, we have a couple of quotes from some modern saints that address this. You know, as you said, this serves a function within the human, the Christian life. So what is the function? Well, the function is for me to struggle to repent. Right. So what does that look like? So this is that classic saying from St. Silouan, the Athonite, who had this. I mean, this is the most famous thing he ever said, keep thy mind in hell and do not despair. So when he says keep your mind in hell, he's not saying, astrally project your noose into the underworld. You know, like, that's not what he's saying. He's talking about. Remember that this possibility exists and yet do not despair. In other words, move forward and hope. Move forward in repentance and struggle. That the purpose of this image is to bring us to repentance. It's not to lay out prophecies about the future or who's going to heaven and hell. That's not the point at all. There's that. And then the other one from a modern saint is from Saint Paisius the Athenite."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9497.61,"end":9499.65,"speaker":"Fr Stephen De Young","text":"Well, let me say first, before you say that."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9499.65,"end":9500.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, go ahead."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9501.01,"end":9563.47,"speaker":"Fr Stephen De Young","text":"That. To reiterate what you're saying. Right. So this serves a function. This is a possibility for me. Right. That I could suffer this. I could suffer eternal condemnation. And it's a possibility for the people who are within my sphere of responsibility, the people who I have spiritual care for. The reason it's a possibility for them is because I have spiritual responsibility for them. Right. And so I need to be aware that it's a possibility for me. It's a possibility for the people in my parish who I pastor. And therefore I have to keep that in mind as I pastor them and try to lead them away from it as a possibility. It's a possibility for family members who are under my authority. Right. But it is not a possibility that I extend to, definitely not a certainty to people I don't like, people outside of that sphere of responsibility. Right. So it is always tied to. This is the possibility if I fail."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9565.15,"end":9565.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9565.99,"end":9584.55,"speaker":"Fr Stephen De Young","text":"This is the possibility if I don't live up to my responsibilities, if I don't repent, if I don't seek after Christ, if I don't pursue Christ. Right. And so it is not making any kind of objective claim to who, if anyone, will end up suffering this fate."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9585.51,"end":9586.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9586.27,"end":9591.35,"speaker":"Fr Stephen De Young","text":"I mean, it could be billions of people or it could be zero. That's irrelevant."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9591.35,"end":9602.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't know. Yeah, we don't know. And it's funny, like. Well, let me back up a number of church fathers. I recall saying things like, always apply everything to yourself."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9605.36,"end":9606.16,"speaker":"Fr Stephen De Young","text":"And not to others."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9606.4,"end":9658.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Unless, you know, and I only apply it to others if I am responsible for them because God gave me them. Like, so a parent and their children and a pastor and his flock. But in that case, it's not applied to others. Like, as others here, I'm hurling this at you. You have to listen, you know, like, that's not the point. That's not the way authority works in Christ. Right. But, but it's, it's, you know, you always. I'm the chief of sinners. Like, do I actually believe that? Or can I at least function like that? I mean, that's, that's simply another way of saying what saints of the one said, keep your mind in hell and do not despair. I am the chief of sinners. That's the. It's the same. It's, it is functionally exactly the same thing. And you know, and so this is."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9658.87,"end":9721.97,"speaker":"Fr Stephen De Young","text":"Before you give that quote, I want to quote. So the problem when people start debating universalism, right? And there, there are some folks who are, some still identify as orthodox Christians, a couple now don't anymore, but who profess to be universalist. The problem with all of those discussions is that if we really have the discussion, we're going to end up talking past each other because universalism is arguing about how many people are going to end up in eternal condemnation, which is again, making a type of claim that's kind of irrelevant to the Christian life. And the people who tend to respond to universalists to say, no, lots and lots of people are going to experience eternal condemnation are again, it's sort of like with the, with Young Earth creationism, right. They're adopting the same presuppositions in order to respond."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9723.09,"end":9723.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9723.73,"end":9747.26,"speaker":"Fr Stephen De Young","text":"So how many people that ends up being, whether it's zero or billions or somewhere in between is irrelevant to the role which the possibility of eternal condemnation plays in our life. So even if universalism ends up being true, and wouldn't it be great if it did, even if it ends up being true, you can't be a universalist."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9748.14,"end":9749.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9749.58,"end":9750.62,"speaker":"Fr Stephen De Young","text":"And be a Christian."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9751.74,"end":9797.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, okay, I've had faked it twice now. This great quote from St. Paisius the Athenite, he's saying essentially this, he says, struggle with all your power to gain paradise and do not listen to those who say that everyone will be saved. This is A trap of Satan so that we won't struggle. In other words, he says that to say categorically all will be saved is a trap of Satan so that we won't struggle. In other words, he identifies very clearly what the position of that universalist claim is in Christian life. It's so that you won't struggle, you know?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9798.57,"end":9802.81,"speaker":"Fr Stephen De Young","text":"Right. And you notice he doesn't say there. No, this isn't true."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9803.93,"end":9805.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's not claiming to know that."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9806.59,"end":9808.43,"speaker":"Fr Stephen De Young","text":"He doesn't say that all won't be saved."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9809.23,"end":9809.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9809.55,"end":9814.51,"speaker":"Fr Stephen De Young","text":"He says you can't listen to that because then you won't struggle in repentance."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":9814.91,"end":10135.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because, you know, Saint Paisius, he had a lot of spiritual gifts, and one of his spiritual gifts was spiritual direction, you know, to give help to souls. Right. In a very, very powerful, powerful way. And this is one of the things that he said to somebody. So, yeah, I mean, the only thing that, like, we can really, truly say that we know about eternal condemnation is that the demons are going to experience it. But as far as human beings are concerned, for me, it exists as a possibility because it spurs me to repentance. I'm not saying it's the only thing that should spur me to repentance. Right. There's so many good reasons to repent that are not just about, I'm afraid of this, but it is there, and it's there for a purpose. It's not there. And the purpose that it's there for is repentance. It's not there for us to lay down condemnation on others or to set up some kind of system of people who are going to heaven and hell, that kind of thing. So. All right, well, to wrap up, I had a couple thoughts, and then, of course, Father Stephen will say his thoughts and then we'll be done. So, I mean, the first thing, I just wanted to just wrap up this question of universalism. Like, saying that we can't preach it is. It's not some kind of noble lie, because that would be like saying that we know it's true, but we're going to pretend it's not so that people repent. We don't know that it's. We don't know. We simply do not know. It is not written in Scripture that all will be saved no matter what. So we cannot preach that. Right, but. So why. Why do we have these things? Why do we have not just this question about universalism, but all the rest of the stuff we've talked about in this episode, to me, it always comes back to what St. John writes in his gospel in chapter 20, he says, Now, Jesus did many other signs in the presence of the disciples which are not written in this book, but these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing, you may have life in his name. This is what, when I was in seminary, we use the fancy theological term, the soteriological motive. This is the soteriological motive. In other words, the point of all of this is so that we can be saved, not so that we have knowledge about things. It's so that we can be saved. So then the question is, how does what we've talked about in this episode aim us towards that? Right? So understanding what used to happen when people died before the harrowing of Hades, what now happens when they die during the Messianic age, and what will happen after the resurrection when no one will die and anymore, how does this inform. For me, one of the big questions always is how does this inform our evangelism? Because evangelism is precisely the work of bringing the salvation to other people, which is what we're supposed to be doing. So, number one, we talked about in the Old Covenant, this is relevant because we understand the feet that Christ has saved us from, from. Like, we talked about this, what the underworld is like, and various different takes on that. Christ has saved us from that. And we enter into that through our baptism and of course, especially the ritual participation in Pascha. Right? So that's an element of the way that we preach the gospel. And then second, you know, if we understand what happens now we're in the Messianic age. One of the things we see then is what the saints are doing and why they're not come. Like some sort of bonus add on to Christianity, it's rather a testament to the belief in the resurrection of the dead. They are a testament to that. This is the resurrection that Abraham, Isaac and Jacob and all the saints are participating in. This is why we call the Lord the God of the living. And also we understand, if we understand this Messianic age, we understand why things are not perfect yet. Yet. And here's the repentance part. What we're supposed to be doing in the meantime, right? And then finally thinking about that age to come, we understand that the possibility exists. Again, we don't know to what extent it'll be realized, but the possibility exists for being outside the kingdom. So we, because we have seen this and heard this, we strive through repentance to be more and more conformed to it in this life as a preparation for the life that is to come. So so much of this is bound up in our hope of. Of what it means to be in Christ. And so I think if we have a clearer understanding of the. The soul after death, what that means before Christ, now during the Messianic age and then. And then after the resurrection, this is very, very relevant to our evangelism. It's very, very relevant to our daily Christian life. So this is really core catechetical stuff. Everybody. Father Stephen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10138.55,"end":10489.15,"speaker":"Fr Stephen De Young","text":"So I want to also talk about, and hopefully clarify a little the relationship of this possibility of eternal condemnation and repentance, because as Father Andrew just said, this isn't like a noble lie. We're not saying, oh, yeah, really, everybody's saved, but we got to tell people this so they repent, right? And part of the reason that breaks apart is we're not really talking about fear, we're not talking about eternal condemnation is here this horrible punishment, right? God is threatening us with this horrible punishment. And so you better say you're sorry and you better get in his good graces, or he's going to lower the boom on you when. When the Last judgment comes. Because if you're paying attention during the show, we've talked about that's. That's not how any of this works, right? But we tend to think about repentance most of the time at a very shallow level. That level of kind of, oh, yeah, I was a jerk, I'm sorry, let's just forget about it now. Maybe we go a little deeper. Hopefully we go deeper than that and we start to get to, I need to do better. I need to be better. I need to work to do better. And to be better, I need to work to follow Christ, to change, to be more like him. I need to be better at the roles that I play, the purpose I play in the bodies, in these larger, these macro souls we talked about, right? The part I play in my family as a. As a spouse, as potentially a parent, my role in the church, my role for places. I need to do better at it. But there's an even deeper level than that. I don't claim to have plumbed the depths of repentance myself or even gotten near the deepest levels, but there is a deeper level at which repentance really takes the form of self knowledge, of knowing ourselves, specifically in terms of knowing the depths of what we're capable of, the depths of the evil that we've let come to live within us. And one of those is really understanding the reality that we could, at any moment we chose, destroy everything. Every one of us has the power to wreak havoc and destroy our families, to do damage and destroy our parishes, to ruin our lives, to burn it all down. It wouldn't even be difficult if we decided to do it. That's always there. Sometimes in our dark moments, we even feel tempted to maybe do it. It's never really far from us. We like to pretend it is. Because, of course, we all think that, you know, faking and pretending that we're good people is the first step toward becoming good people. And it's not. It's the opposite. And so part of keeping our mind in hell, part of remembering that eternal condemnation is a possibility, is remembering how that eternal condemnation would come about. Eternal condemnation is not a possibility for me because I might make some mistakes or mess up. Oops. Eternal condemnation is a possibility for me because it's within my power to be truly vile, to be truly evil, to hurt people, to mistreat people, to do damage to people in the world, to be cruel, to be heartless. That's why eternal condemnation is a possibility to me. And if we're not aware that we have that capability and that capacity, then we can't every day consciously reject it. We can't every day look at those actions that would bring us to that condemnation, those, dare I say, demonic tendencies that we've allowed ourselves to become infected with through the passions. We can't look at them and ward them off and set them aside and say no to them, because we're not willing to acknowledge that they're there. So I think having this idea of hell in English, gehenna, whatever, we want to call it, eternal condemnation, the lake of fire. It's not important in terms of making us afraid or afraid of God or watch our steps, but it's important that we remember the way that we would get there and how close at hand that is, so that we can consciously say no, consciously reject it, and choose Christ instead. Consciously reject the hate that we have within us and choose love instead. Consciously reject the anger within us and choose peace instead. Constant. Consciously reject the greed, the lust within us, and choose faithfulness instead. That, I think, is a deeper level of repentance that we need to work to achieve. And the reality of the possibility of eternal condemnation is one of the best roads that can help get us there. So those are my thoughts."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10489.79,"end":10508.75,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you very much, everyone, for listening. If you didn't get through to us, live we would still love to hear from you. You can email us@lordofspiritscientientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10510.75,"end":10520.28,"speaker":"Fr Stephen De Young","text":"For our live broadcasts on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific and use the code Lord of Spirits at Raid Shadow Legends. It might get you something. No problem."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10521.56,"end":10532.84,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly share this show with a friend whom you know is going to love it. Word of mouth everybody."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10533.96,"end":10542.93,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. Try the code on hellofresh too. What have you got to lose?"}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10543.49,"end":10548.21,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, Good night. God bless you. Christ is risen. He truly is risen."}
{"episode_id":"LOS - #043 - 2022-05-12 - The Resurrection and the Life","start":10561.41,"end":10598.71,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and written riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
