{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2.08,"end":66.72,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":69.92,"end":103.68,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. You're not listening to us live normally. This is a part where I say, if you're listening to us live, call. But you're not listening to us live because this is a pre recorded episode. So that means that even if you call that number, that you're going to hear the voice of Steve saying you're not going to be able to get through because Father Stephen is at a retreat. And so we're not able to do this one live, but we are recording."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":104.56,"end":106.64,"speaker":"Fr Stephen De Young","text":"I prefer to call it a strategic withdrawal."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":107.12,"end":126.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yes, that's true. More of an advance. Yeah, yeah, yeah. He's gathering his troops together. Um, so anyway, we're still, we, we still wanted to make an episode for you, so, so here it is. And, but again, don't, don't call because no one's gonna, no one's gonna answer the phone."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":127.19,"end":134.79,"speaker":"Fr Stephen De Young","text":"I mean, hey, if you want to. I mean that's, if that's how you get your kicks on a Thursday night. It's calling a number, right, that you know that no one answers."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":135.19,"end":137.59,"speaker":"Fr Andrew Stephen Damick","text":"It's true. That sounds very sad and lonely, but."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":137.75,"end":142.48,"speaker":"Fr Stephen De Young","text":"But okay, there are doomers out there who are lined up for that, I think."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":144.4,"end":185.77,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, people often say the church isn't a building or we could worship anywhere. But is that actually true? Why do ancient Israel and the church worship in buildings? Is it merely practical to have a roof over our heads or Is there a purpose given by God? Well, in this episode, we're going to start with the Taj Mahal and end with parading around corpses. So if you can connect the dots between those, you can skip this one, wait for the next episode. If not, though, welcome. So, Father Stephen, what does the Taj Mahal have to do with the worship spaces of the people of God?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":187.13,"end":189.61,"speaker":"Fr Stephen De Young","text":"Well, nothing, if you're talking about the casino resort."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":190.25,"end":192.57,"speaker":"Fr Andrew Stephen Damick","text":"I am never talking about the casino resort."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":192.97,"end":203.53,"speaker":"Fr Stephen De Young","text":"Okay. Yeah. So as is our want when talking about just about anything, we're going to begin at the beginning of everything."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":204.09,"end":206.09,"speaker":"Fr Andrew Stephen Damick","text":"It's a very good place to start."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":206.57,"end":301.22,"speaker":"Fr Stephen De Young","text":"Yes. Stealing my Rodgers and Hammerstein joke. So. And that is paradise. Not by the dashboard light. Starting off at the beginning, the late great meatloaf. But yeah, so some of this here at the beginning are things we've already talked about in other episodes, but we're taking kind of a different trajectory through them this time, as is our want. And so as we've talked about before. Right. Paradise. The word paradise is actually a Persian loanword that gets taken over into Greek that refers to a particular type of walled garden. Right. And it is sort of an apt word and an apt design to take over for that because some of the features, including the four waterways, reflect the description of Eden, of the garden of God in Genesis, chapter two. So the Taj Mahal is probably the most well known current example of such a walled garden structure that still exists in the world that you can see aerial photos of."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":301.22,"end":364.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you go to Google Maps and just type in Taj Mahal. Again, not going to the casino, but look at the Taj Mahal in India and then turn on the satellite photo, then you can zoom in and you will see at the western end, you will see the building that everyone refers to as the Taj Mahal, which is. And then directly to the east of it, you will see this walled garden with four quarters in it. And these, you know, there's a fountain in the middle. Right. And these are they actually waterways now or. I can't really tell from the photo, but in any event, I think they traditionally are, that there's water flowing in four directions out of that fountain that's in the middle. And so it's, you know, this is, this is an ancient, as you said, pattern. And I actually wanted to, you know, since I want to look like a scholar too, just a little bit. I want a chance."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":365.68,"end":366.32,"speaker":"Fr Stephen De Young","text":"It's time."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":366.32,"end":366.8,"speaker":"Fr Andrew Stephen Damick","text":"It's time."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":366.8,"end":373.12,"speaker":"Fr Stephen De Young","text":"It's time for Father Andrew's etymology corner. Insert public domain string music here."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":373.12,"end":487.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I actually had someone send me a couple of suggested theme themes for Father Andrew's etymology corner that he created himself. So maybe we'll. Maybe we'll see about incorporating them anyway. So, yeah, the English word paradise, as you said, I mean, it's a loan word from Persian into Greek, and then from. From Greek it gets into Latin and then. And then from Latin into French, and then from there actually into very late Old English where we've got the word paradis, which becomes, you know, the origin of our modern English word paradise. So here's something that's kind of fun, though. Before we had paradise in. In Old English, earlier Old English had this amazing word which is neorx nawang, which includes the element wang, which means a field, W a n g. And it seems, you know, linguists are not entirely sure about this, but it seems that this word nergsnawang, which actually you can see in earlier Old English translations of the Bible. Right, so this is a word that does have a Christian history in English, although completely gone now. Right. There's nothing, as far as I know, descended from the worst of this word in modern English. But Nerik's nawang seems to come from Germanic paganism originally and may have referred to a heavenly field or meadow. So again, you've got this idea of a divine garden. Right. So English has had this concept in it, but then we, We. We just, we dragged in paradise much later on. I mean, nothing wrong with that word. It's lovely. But we did have this awesome word nerx nawang. N E O R X N a W a N G. So there you go. Father Andrew's etymology corner."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":487.78,"end":490.9,"speaker":"Fr Stephen De Young","text":"This has been Father Andrew's etymology corner."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":493.54,"end":516.5,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, Father. So, so, okay, so why. I mean, we've talked about this a little bit, but just kind of review for those who have not listened all 84, whatever it is, hours, the podcast up to this point and counting and counting. What's the point? Why is a garden significant as paradise? Like, why that image? Why not like a big, glorious golden mansion or something like that?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":517.3,"end":539.22,"speaker":"Fr Stephen De Young","text":"Right. And it's not just in Genesis 2 that God lives in a garden. Right. This is common in the ancient near east, that a particular God or the gods, when we're dealing with Israel's neighbors, live in these sort of garden settings. The hanging gardens of Babylon and clearly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":539.22,"end":542.44,"speaker":"Fr Andrew Stephen Damick","text":"Ancient Germanic paganism too. Thus."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":542.44,"end":542.8,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":542.8,"end":545.84,"speaker":"Fr Andrew Stephen Damick","text":"Nyric stomach. I just have to say that only this word as many times as I can."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":545.84,"end":549.68,"speaker":"Fr Stephen De Young","text":"Yes. Was there a bright golden haze on that meadow? Anyway."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":552.08,"end":557.36,"speaker":"Fr Andrew Stephen Damick","text":"Nice. So I didn't think you would make show tunes references. This is really wonderful, actually."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":558.48,"end":563.12,"speaker":"Fr Stephen De Young","text":"Yeah. There is no end to my pop culture sub reference ability."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":563.84,"end":564.32,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":564.32,"end":567.92,"speaker":"Fr Stephen De Young","text":"There are no boundaries, so."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":569.85,"end":570.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":570.09,"end":592.97,"speaker":"Fr Stephen De Young","text":"So there's. On a very surface level. Not that this is untrue, but this is very surface level. When you consider the ancient near east, you consider the terrain, Right. You consider what most of the land was like outside of the river valleys. Right. There's a reason why civilization showed up in Mesopotamia and along the Nile. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":593.93,"end":594.73,"speaker":"Fr Andrew Stephen Damick","text":"Because there's water."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":595.57,"end":668.69,"speaker":"Fr Stephen De Young","text":"Yeah. You're dealing with mostly desert and wilderness. Right. And so there's. If you're living in sort of a desert wilderness setting, if you're sort of clinging to a river and hoping for healthy flooding in order to grow crops and that kind of thing, then sort of a green lush garden is sort of the dream spot. Right. It's sort of the heavenly spot. Right. So on a surface level, you just have that. That contrast. But if you. If you push that contrast a little deeper. Right. In terms of what it really represents, then, you know, as we've talked about before, what's going on in Genesis 1 and creation, things being put in order and things being filled with life, a garden is sort of the perfect combination of that because by virtue of being a garden, it is ordered, Right. It is tended and put in order, but it is also obviously filled with and producing life. Right, right, right. And that is over against the wilderness, which is obviously, by virtue of being. Wilderness is not put in order, is not tended, and comes to represent sort of death because things go out there and die."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":668.93,"end":705.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's. It's fun. Like even this word wilderness that we use now, it's often used in a kind of a romantic way, like, oh, the pristine wilderness. But I mean, in that word is wilderness is the word wild. Right. The concept of wilderness, the wild place, you know, when the word is conceived in English anyway, it's this sense of a chaotic space where. Which is dangerous and, you know, full of death. Right. Because the pristine wilderness that you would go in and experience as a kind of tourist is just not a thing for most ancient people."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":706,"end":757.65,"speaker":"Fr Stephen De Young","text":"Yes. There are predatory animals out there and thieves and robbers, dehydration and. Yeah. All around. Yeah. Most of the ancient near east is not a good place to try to forage. Right. Like, we're not talking about the forests of Europe or something where you can find nuts and berries. So. Yeah. So that is really sort of the deeper and key element. And as we've talked about before, paradise is wherever God is wherever God is, that place becomes paradise. And so we see this reflected all through our hymnography. We call the Theotokos at one point a paradise endowed with speech or a."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":757.65,"end":759.85,"speaker":"Fr Andrew Stephen Damick","text":"Mystical paradise in the canon for the cross."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":760.17,"end":781.73,"speaker":"Fr Stephen De Young","text":"Right. Because God comes to dwell within her, within her womb. And this also is then used in the New Testament sometimes in some of the weirder passages, like in, I believe it's John 10, where Christ promises that people will have rivers of water flowing out of their belly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":783.57,"end":783.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":783.97,"end":784.37,"speaker":"Fr Stephen De Young","text":"Which."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":784.45,"end":789.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we let that run by and we're like. But if you think about that, that's like, okay, that's kind of a weird image."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":790.29,"end":801.17,"speaker":"Fr Stephen De Young","text":"Yeah. That's the last time I had rivers running out of my belly. It was because I went to Taco Bell very late at night and it was a mistake. But this is the opposite of that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":801.17,"end":803.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Paradise."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":804.05,"end":809.01,"speaker":"Fr Stephen De Young","text":"Yes. This is talking about the Holy Spirit, who is God coming to dwell within a person."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":809.17,"end":809.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":809.57,"end":832.22,"speaker":"Fr Stephen De Young","text":"And so they become paradise. And paradise, of course, had four rivers running out of it to water the world. And that's the idea, Right. Is that not only will the person who has the Holy Spirit dwelling within them be filled with life themselves, but that life will sort of overflow out of them into the world around them."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":833.5,"end":859.03,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And also that sense that paradise is also God's presence with mankind, you know, so not just wherever God is, but this sense of a place of communion with God and being with God, you know that. Yeah. Like you said, that wherever God is becomes paradise. But of course, it's the experience of human beings of that. That is the."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":859.03,"end":859.95,"speaker":"Fr Stephen De Young","text":"Is the paradise."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":860.03,"end":860.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":860.79,"end":887.07,"speaker":"Fr Stephen De Young","text":"Right, right, right, right. And this is also why paradise could be used in terms of where the righteous go at the time of their death. Right, right. It's not saying they go to, like, Eden as a plot of land somewhere. Right. Or they go to some physical garden space somewhere, they come into the presence of God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":887.07,"end":901.83,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so when Christ says to the thief on the cross today, you will be with me in paradise. That's almost redundant, actually, for him to be with Christ is. I mean, in a sense, at that moment, even both of them hanging on the cross, he was in paradise."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":902.79,"end":903.59,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":903.59,"end":906.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":908.23,"end":952.7,"speaker":"Fr Stephen De Young","text":"So as we've mentioned before, not only are we talking about a garden, right. As. As the place where God dwells, but that garden tends to be situated atop a mountain. Right, right. The mountain of God. And so we're really starting here. We maybe didn't lay this out at the beginning. Right. But if we're going to talk about the place where God is among his people. We have to start with the place where God is and then move from there. That's why we're starting where we're starting. But so that is on top of a mountain, and that mountain is the mountain of God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":953.34,"end":953.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":954.46,"end":998.05,"speaker":"Fr Stephen De Young","text":"And this again, much like the gardens. Right. You see this throughout the ancient near east, throughout Israel's neighbors, they have an idea that a God or their gods live on a mountain someplace. Right. Whether it's Mount Zephone, Mount Olympus. Right. Take your pick. There's some kind of mountain or hill or high place where. Where God lives. So some people who maybe haven't heard us talk about this before, maybe saying, well, I don't see anything about a mountain in Genesis 2."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":998.21,"end":1013.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. It's not explicitly said. And on top of a mountain was Eden. But what you do get is that there are four rivers flowing out in four directions, which. The only way that that's possible is if you're in an elevated space."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1014.1,"end":1018.1,"speaker":"Fr Stephen De Young","text":"Right. Rivers flow downhill. And ancient people knew that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1018.42,"end":1018.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1018.9,"end":1020.18,"speaker":"Fr Stephen De Young","text":"They had figured that out."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1020.26,"end":1104.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think one of the difficulties is we often read the Bible as discrete pieces rather than, as I think you said in another interview, as. As intertextual elements, you know, that are. That are related to all the other parts of the Bible all at once. Right. So, like, for instance, you know, a classic example is in Exodus where Moses receives the law. It does not say in that passage that there are angels present and involved with receiving the law, but it says that in the New Testament. And so you have to imagine that. And I love. This is one of the things I love to point out. You have to imagine that when the Charlton Heston Ten Commandments film was made, they were not actually looking at those New Testament passages that made reference to the law being received via angels. They were just looking at the Exodus passage. And so then that's what you actually get on the screen is Moses kind of by himself with God, and he gets the law from God that way. But there's no actual angels present on the screen. Right. So this is another one of those examples where in Genesis it does not say explicitly that it's a mountain. Of course, it's implied, as you. As you said, by the rivers. Right. But you do get other passages that do say that Eden is on a mountain. Right. It's just not there in Genesis."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1105.27,"end":1106.43,"speaker":"Fr Stephen De Young","text":"Right. Not explicitly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1106.43,"end":1165.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not explicit. Yeah. So one of those is in Ezekiel, chapter 28, verses 23. Excuse me, verses 13 and 14. And this is actually referencing the Devil. And so it's talking to the devil and says this, you were in Eden, the garden of God. Every precious stone was your covering. Sardius, topaz and diamond, beryl, onyx and Jasper, sapphire, emerald and carbuncle. And crafted in gold were your settings and your engravings. On the day that you were created, they were prepared. You were an anointed guardian cherub. I placed you. You were on the holy mountain of God. In the midst of the stones of fire, you walked. And then of course, it goes on to say about how God cast him out because he was evil. But there you get it. Eden is on this mountain of God. It's a garden of God. It's all right there in those couple of verses in Ezekiel."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1166.95,"end":1170.39,"speaker":"Fr Stephen De Young","text":"Yeah. The next verse is basically, you are holy and perfect until you weren't."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1170.47,"end":1171.51,"speaker":"Fr Andrew Stephen Damick","text":"Right, Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1174.07,"end":1181.91,"speaker":"Fr Stephen De Young","text":"But yeah, so that right there is. You're in Eden, you are on the holy mountain of God. Right. So this is about as clear as you can get."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1181.91,"end":1182.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1183.59,"end":1219.31,"speaker":"Fr Stephen De Young","text":"Just like with the garden, there's sort of a surface level reason and then we can push a little bit deeper. So surface level reason that you usually get is that, well, they thought the gods were up on the mountains because they kind of thought the gods were in the sky and mountains are up close to the sky and they're kind of inaccessible. Right, right. And you know, there's something there. Right. High place, proximity to the heavens. Right. There's something there. But I mean, these mountains we're talking about early, relatively inaccessible. Right. Like Mount Olympus is not Mount Everest. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1219.31,"end":1220.11,"speaker":"Fr Andrew Stephen Damick","text":"You're not going to die."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1220.11,"end":1259.74,"speaker":"Fr Stephen De Young","text":"You can climb up there. Yeah, yeah. And see what's going on. Right. So we have to, we have to push a little deeper. Right. To sort of. To sort of fully get at that. And one of the interesting ways to push deeper is to see what all of these, all of these cultures and all these people groups see as the opposite of the mountain of God or the gods. Right. And that is usually some form of the abyss or Tartarus in Greek or. Right. That we've talked about before. And you find this language used for the abyss, where it's described as an inverted mountain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1260.06,"end":1260.62,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1261.34,"end":1262.94,"speaker":"Fr Stephen De Young","text":"As an upside down mountain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1263.58,"end":1276.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's weird. I mean, is the idea that it's like a big hollow mountain? Because, I mean, when I think of the abyss, I think of like a crack in the earth that you just fall and fall and fall. But I don't know, how do they conceive of that?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1276.55,"end":1278.95,"speaker":"Fr Stephen De Young","text":"They're thinking of it as sort of A conical whole."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1279.11,"end":1280.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1280.07,"end":1284.63,"speaker":"Fr Stephen De Young","text":"That you go down in the same way that you have a peak of a mountain. You have sort of the depths."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1284.95,"end":1285.59,"speaker":"Fr Andrew Stephen Damick","text":"I see."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1285.59,"end":1313.36,"speaker":"Fr Stephen De Young","text":"Of the abyss. Okay, right. And so it is really about this concept of the depths of the underworld. Right. The depths of. Deep within the earth, below the pillars of the earth, you know, contrasted with the heights right near to the heavens. And that mountain language actually shows up in an interesting place in the book of Revelation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1314,"end":1340.45,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right. Another one of these passages that. It's, like, so full of this crazy kind of imagery. You could just walk by it and not really realize what's going on. So Revelation 8. 8. The second angel blew his trumpet and something like a great mountain burning with fire was thrown into the sea and a third of the sea became blood, which is very disturbing kind of weird imagery again, you know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1341.09,"end":1349.01,"speaker":"Fr Stephen De Young","text":"But the abyss in the book of Enoch is not only makes use of that inverted mountain language, but has it on fire."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1349.98,"end":1352.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. A flaming mountain thrown into the sea."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1353.58,"end":1371.18,"speaker":"Fr Stephen De Young","text":"Right. And so what Revelation is talking about there is, you know, the abyss is used for the depths of the sea, Right. In sort of a sacred geography sense. Right. This is talking about the sea actually becoming the abyss."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1371.82,"end":1372.62,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1373.58,"end":1398.94,"speaker":"Fr Stephen De Young","text":"Right. In Revelation. Right. Because the sea, if you're someone who lives around the Mediterranean Basin, Right. Is. Yes. There's. Storms blow off of it. It's scary. There's the chaos stuff, but also you get fish out of it. You use it for trade. Right. You use it for life. Right. So if it goes. If the sea goes full abyss on you, right. You're. You're in a lot of trouble."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1399.34,"end":1407.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I note the image of a third of the sea becoming blood, you know, a sort of death image for sure."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1408.24,"end":1418.08,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And remember, I mean, that's. That's obviously borrowing from Exodus. In Exodus, when the Nile turns to blood, all the fish, all the life in it dies."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1418.24,"end":1419.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's about."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1419.84,"end":1420.88,"speaker":"Fr Stephen De Young","text":"It starts to stink."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1420.88,"end":1429.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. The. The life characteristic of the water becomes negated by virtue of association with death in the underworld."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1431.21,"end":1441.69,"speaker":"Fr Stephen De Young","text":"Right. And so it just becomes fully that. Right. Fully chaos, fully destruction, fully death. Yeah. Fun with Revelation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1441.69,"end":1445.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. I thought we were not supposed to read that book. No."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1451.45,"end":1475.02,"speaker":"Fr Stephen De Young","text":"So then the flip side of the abyss, right, getting back to the mountain of God, right? We see, as we talked about in our Sacred Geography episode, there are a whole series of holy mountains through. Going through the Old Testament. And those holy mountains all at various points are being the mountain of the mountain of God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1475.26,"end":1591.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we mentioned this. I mean, if you go back and listen to our Sacred Geography episodes, there's one called the Mountain of God, the Boat of Thief Theseus, that kind of lays out these ideas. But I think one example I think suffices to understand this, and that is, for instance, when, if you read closely, if you read Exodus, when Moses sees the burning bush and speaks to God, right, in the burning bush, it says in Exodus that this is Mount Horeb. Right? But if you're to ask most people, hey, where did Moses, you know, talk to God in the burning bush? Almost everyone, every Christian and probably certainly every orthodox Christian would say, oh, that was on Sinai. But if you read Exodus, it says it's Horeb. And it gets even further confused. If you're to go to Mount Sinai now and to go to the Monastery of St. Catherine, which actually is traditionally the monastery of the Transfiguration, they could point to you, here is the burning bush. Here it is here inside the monastery grounds on Sinai. And so then the question is, well, where did that actually happen? And I know that, like, sometimes people, when trying to work out the geography of the scriptures, you know, they'll try to solve this in a material way by saying, well, Moses was on this one mountain, but here it's called Horeb. In another place, it's called Sinai. But if you understand sacred geography, then what you actually see happening is that Horeb is being the mountain of God when Moses is speaking to him with the burning bush. And then Sinai is being the mountain of God and even is being the place of the burning bush later on, by virtue of, again, Moses speaking there with God, by virtue of, frankly, the monastery treating that bush as being the burning bush. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1591.51,"end":1593.07,"speaker":"Fr Stephen De Young","text":"So it is."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1593.07,"end":1634.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it is the burning bush. Whether you could establish some kind of genetic connection or prove. Like, how could you prove. I mean, how many thousands of years ago was that? You know, it's not like Moses took a DNA sample of the burning bush so that we could analyze it later. You have to think differently about these things, people. You can't just say, oh, oh, you know, we can prove through, you know, technology that this is this. That's not the point at all. Right, so the mountain of God is one. But human beings can experience the mountain of God on different material mountains, even to the point that the burning bush itself is on at least two different material mountains."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1636.1,"end":1636.58,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1636.58,"end":1637.22,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1638.1,"end":1643.86,"speaker":"Fr Stephen De Young","text":"Yeah. And so, yeah. And this is. And we don't need to go back to everything in that episode."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1644.26,"end":1644.66,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1644.97,"end":1654.17,"speaker":"Fr Stephen De Young","text":"I mean, this is just. Yeah, we have this and it's not even like a fully contemporary materialist view."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1654.49,"end":1654.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1655.37,"end":1671.53,"speaker":"Fr Stephen De Young","text":"Because if, again, if you understand that a living human body changes out all its matter over the course of several years, realize that there are particles of matter that were part of Christ's human body that are now part of other people's bodies."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1671.61,"end":1676.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. But we don't say that those people's bodies are Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1677.02,"end":1683.82,"speaker":"Fr Stephen De Young","text":"Right. Because those individual particles. Right. Are not being Christ's body now."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1684.3,"end":1707.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. And it's funny, like, you know, when people try to read the Bible and figure out this stuff, like there's kind of two takes on it that are both sort of modernist, materialist versions. Right. There's the. The take you might describe as a liberal take, which essentially say, ah, see, look at these contradictions. There's no way that this is true or this is made up or, you know, whatever."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1707.69,"end":1709.49,"speaker":"Fr Stephen De Young","text":"There's no historical reality whatsoever."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1709.49,"end":1736.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's no historical reality whatsoever. And then you've got the other end, which is, you know, and I'm using this word in the early 20th century sense, the fundamentalist take on this, which is to say, no, no, we can make this all work out and kind of empirically scientifically prove that this is this, you know, but both takes are essentially assuming modernist, materialist. A materialist framework."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1736.31,"end":1736.91,"speaker":"Fr Stephen De Young","text":"Categories."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1736.91,"end":1743.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, categories, exactly. Yeah, yeah, yeah. Which mountain is it exactly? Like. Well, it can be. We're saying it can be several, you know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1743.99,"end":1744.35,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1744.35,"end":1746.75,"speaker":"Fr Andrew Stephen Damick","text":"One at a time usually. But it can."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1746.99,"end":1748.83,"speaker":"Fr Stephen De Young","text":"But only usually."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1749.15,"end":1761.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Because, I mean, you know, not to get too far ahead of ourselves, but Mount Athos can be the mountain of God at the same time that I'm experiencing the mountain of God here in."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1761.37,"end":1766.45,"speaker":"Fr Stephen De Young","text":"Emmaus, Pennsylvania, and that St. Catherine's is at the Mountain of God. Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1766.45,"end":1766.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1771.97,"end":1803.75,"speaker":"Fr Stephen De Young","text":"So we're now at Garden on a mountain. And so this we've talked about a few times, I think. So people are probably used to that. But we've got one more step to go here. Right. And that's that God or the gods, depending on, you know, again, who we're talking about here. Was it just viewed to sort of hang out and lounge and luxuriate in. In said garden on top of the mountain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1803.75,"end":1806.76,"speaker":"Fr Andrew Stephen Damick","text":"Not like in Clash of the Titans where there's just sort of hanging out."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1806.76,"end":1810.24,"speaker":"Fr Stephen De Young","text":"Around some, eating ambrosia, leaning on a couch."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1810.4,"end":1810.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1813.04,"end":1821.84,"speaker":"Fr Stephen De Young","text":"So because, of course, they conducted business and this sort of thing. Right. And the way they did that was really intense."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1822.64,"end":1823.84,"speaker":"Fr Andrew Stephen Damick","text":"Dun, dun, dun."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1825.12,"end":1825.52,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1825.68,"end":1826.08,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1828.08,"end":1840.78,"speaker":"Fr Stephen De Young","text":"The idea was that they had actual tents and this is not just tents that we think of tents. Like they were all camping up there, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1840.78,"end":1847.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is not the winter of our discount tents. Wow. See? Wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1847.42,"end":1866.83,"speaker":"Fr Stephen De Young","text":"That was uncalled for. So we have to bleep that out. Anyway, this is not like you may be picturing from some Roman military movie, you know, the military camp with all the tents. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1866.91,"end":1867.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1868.03,"end":1880.67,"speaker":"Fr Stephen De Young","text":"Not that sort of thing. So we're talking about the kind of tents that nomadic peoples of the ancient near east lived in. So, yeah, these were big tents."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1880.67,"end":1881.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1883.55,"end":1973.93,"speaker":"Fr Stephen De Young","text":"And the way this typically functioned was that sort of the head of the. Remember, we're not talking about nuclear families, we're talking about big extended families, big households that included, you know, there was some patriarch figure at the head of it. Right. And then you also had all the sons and daughters, their kids. So all the cousins, all the aunts and uncles are all together, part of. Plus all the hired servants, plus all the indentured servants, plus all the slaves, plus the animals, the families of all of those servants and slaves, they had this huge organization, this huge clan structure. And so the people who were members of the family, who were at the head of the clan, typically were in one large sort of pavilion tent. And the way that worked was when someone came of age and got married. So when one of the sons or grandsons of the patriarch or the potter familias. Right. Came of age and got married, which would typically be around 13. So it was when they became basically physically mature, they'd be married off. Right. And their marriages were all arranged. Right. Probably to a cousin. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1974.89,"end":1976.73,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And then."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1976.89,"end":1993.21,"speaker":"Fr Stephen De Young","text":"But then. So they were now going to form. They're going to begin having their own children. A portion of that large tent would be sort of sectioned off. They would hang up like partition curtains. Yeah, Right. So there would be this new area of the tent that would."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1993.21,"end":1993.53,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":1993.53,"end":2036.05,"speaker":"Fr Stephen De Young","text":"That couple would have. Right. And these things would kind of get reshuffled when there was a new head of the whole family. Right. But other than that, it was fairly constant. Right, right. So this is. This kind of arrangement is how typically. And we're going to go now to the bail cycle. Right. As one example of this, how the northern Canaanites and later Phoenicians saw this, this is how they saw their gods living. Because, remember, as we talked about a little bit last time, they saw their gods as being related genealogically."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2036.21,"end":2039.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, so this is kind of big tent paganism, then."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2039.97,"end":2040.45,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2041.49,"end":2044.61,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, I have to get my jokes in here where I've got them. So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2044.85,"end":2138.73,"speaker":"Fr Stephen De Young","text":"Okay, so so, for example, using the BAAL cycle and those gods as example, El, right, who's sort of the most high God and the father of the gods, those two being sort of equivalent titles, has this big tent in which the gods and goddesses who are considered to be his children have their own spaces. Right? And so in the BAAL cycle, those spaces for the other gods are referred to as the seven rooms, which are those sort of sectioned off places. So they had their own place. Right? And so then a big part of the overarching arc of the BAAL cycle is that BAAL sort of doesn't have his own place within El's tent. And his sister, wife, Anat, right, who is a very violent war goddess, gives out this rant, right, to El, her dad, about how BAAL should have his own place. And if El doesn't give it to him, she's going to crush his skull until his beard is soaked with gore."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2140.01,"end":2145.13,"speaker":"Fr Andrew Stephen Damick","text":"And you can read the BAAL cycle online in English translation, everybody, if you want to see what it actually looks like."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2145.29,"end":2148.65,"speaker":"Fr Stephen De Young","text":"It's, it's, it's a. It's a beautiful religion. It's."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2152.09,"end":2157.53,"speaker":"Fr Andrew Stephen Damick","text":"I was told that paganism is peaceful and nice and egalitarian and stuff, but."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2157.77,"end":2163.61,"speaker":"Fr Stephen De Young","text":"Yeah, well, it is a woman threatening, not a man. So there you go, women's voices being heard."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2164.41,"end":2164.97,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2167.77,"end":2187.67,"speaker":"Fr Stephen De Young","text":"So, yeah, but you can see here, too, as we've talked about before, right, like, we saw how in Daniel 7, some of the L imagery is used for. For God the Father. Right, Right. So you see the relationship between the gods of the nations and the most high God sort of reflected here."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2187.99,"end":2190.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Obviously this is super dysfunctional family."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2191.11,"end":2192.87,"speaker":"Fr Stephen De Young","text":"Right. And it's not friendly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2193.03,"end":2193.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2193.91,"end":2216.25,"speaker":"Fr Stephen De Young","text":"They're making demands, they're issuing threats. Right. And so then, you know, the big part of the ark, as we've described it before the BAAL cycle, is it sort of ends up with BAAL building his own palace, right, in the underworld after he totally wins, like, totally defeats everyone."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2216.49,"end":2218.05,"speaker":"Fr Andrew Stephen Damick","text":"I'm surprised. This is not a T shirt."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2218.05,"end":2265.95,"speaker":"Fr Stephen De Young","text":"It was a single battle, what you're seeing right now. So, yeah, so that's sort of that. Now, obviously, there's a lot of discontinuity between that, Right, And. And the view that the Israelites are going to hold. But they do have this view that there is sort of this when this is talked about. They don't primarily see Yahweh, the God of Israel, as living in a big castle or palace. They have this tent idea. And one of the very. There's A very familiar place in the New Testament where this comes out. But it kind of gets buried by the English translations."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2266.27,"end":2302.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. There's that point where Jesus is talking to his disciples about, you know, when he's about to ascend into heaven and he said he's. He's going to prepare a place for them. And he has this line, and here's the version that most people probably know. In my father's house are many mansions. Which of course then is the inspiration for that classic old. I don't know if it's a Baptist song, but a lot of Baptists sing it. You know, I've got a mansion just over the hilltop, right. Where you got this image of a kind of strange sort of suburban heaven. But. Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2302.53,"end":2303.73,"speaker":"Fr Stephen De Young","text":"With big mansions."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2303.89,"end":2305.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly, exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2305.81,"end":2309.25,"speaker":"Fr Stephen De Young","text":"The streets of gold. Yeah, with mansions. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2309.25,"end":2351.98,"speaker":"Fr Andrew Stephen Damick","text":"But. But no, it's not in my father's house or many mansions. It's really in my father's tent are many partitions is really the image that Christ is really saying, which means that we're going to, you know, that Christians are going to live with him as part of this extended family. Right. It's not that everybody has their own great little nuclear family mansion. You know, I mean, think about that for a second. Right. If every Christian has a mansion just over the hilltop, does anyone live with each other? You know, is there any actual communion or love going? You know, like it's. It's. Everybody's got their own private. Like this is hell. Hell is where everybody's, you know, it's."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2351.98,"end":2357.62,"speaker":"Fr Stephen De Young","text":"Really somehow everybody's mansion is inside one house, too."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2358.1,"end":2359.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, in my father's house."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2359.38,"end":2361.46,"speaker":"Fr Stephen De Young","text":"So it doesn't even make sense as a translation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2361.62,"end":2385.65,"speaker":"Fr Andrew Stephen Damick","text":"No. Yeah, yeah. But this is the image that's being used. And of course, it's not just. It's not just image of being part of God's family and dwelling with God. Right. But there's also contained in that, when Christ said that is this notion of theoses, because he's referencing an image that they would have known, which is the image of the gods all living together in a big tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2386.21,"end":2387.05,"speaker":"Fr Stephen De Young","text":"The sons of God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2387.05,"end":2388.17,"speaker":"Fr Andrew Stephen Damick","text":"The sons of God. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2388.17,"end":2394.37,"speaker":"Fr Stephen De Young","text":"The sons of God would be the ones who have their own partitions within the big. Yeah, right. Within the big tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2395.1,"end":2403.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's not the end of the episode, everybody. But it's a great little conclusion to some of the stuff we just been talking about. But we're not even done with the first half."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2404.38,"end":2431.07,"speaker":"Fr Stephen De Young","text":"And just as a tease, that understanding, remember, it's the sons who have the place in the tent, Right? Like the slaves and the servants don't. Right. And so think of all the language in St. Paul about distinguishing us as sons of God from slaves, Right. Or servant. Right? This. This plays. This understanding plays into all of that. But we can't go down that rabbit hole right now. In a future episode."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2431.07,"end":2432.11,"speaker":"Fr Andrew Stephen Damick","text":"In a future episode."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2433.87,"end":2491.94,"speaker":"Fr Stephen De Young","text":"Mark off your bingo card. So when you kind of put this all together, right, Our. Our big tent in our garden on a mountain. Right. You get to the idea we've talked about before of the mountain of assembly, or in Hebrew, harmoed. And we've talked about before how that is actually what gets transliterated into Armageddon in Revelation has nothing to do with Megiddo. I'm sorry, I know we want to find physical places for everything, but it has nothing to do with Megiddo. It has to do with the nations motivated by demonic powers laying siege to the mountain of God. Har Moed. And the reason you get a G in there is that moed has. For language nerds, moed has an ayin in it, which was originally pronounced as a kind of a G sound."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2492.18,"end":2494.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Sort of a glottal almost a glottal stop. Almost."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2495.38,"end":2525.27,"speaker":"Fr Stephen De Young","text":"Right. So the E in harbo aid is pronounced or is spelled, transliterated, I should say in English, har, that means mountain. And then assembly is moaid. That's usually transliterated M O, E, D. And the E there is the ayin. Yeah. So if you. If you imagine replacing that E with a G, so it's M O, G, D. Yeah. You can see how you get Armageddon out of it. Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2527.09,"end":2529.25,"speaker":"Fr Andrew Stephen Damick","text":"That's Father Steven's philology corner. There you go."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2529.25,"end":2572.57,"speaker":"Fr Stephen De Young","text":"There you go. Nothing like gutturals. Anyway, so this is the Mountain of Assembly, because this is the gathering place of the divine council. Right. This is the place where they gather in the tents. And so this is, as we mentioned, right? This is depending on your neighbor of Israel. Right. There are several mountains of God in Israel, but they, you know, Mount Zaphon, if you were talking about baal, Olympus, if we're talking about the Greeks. And you can throw in your."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2573.05,"end":2594.09,"speaker":"Fr Andrew Stephen Damick","text":"My bit of Norse mythology, Northern European one. Yeah. Not exactly a neighbor of Israel, but you've got, you know, you've got him in Bjork, which is. Which actually is, interestingly, is Heimdall's mountain. But it does actually mean the heavenly mountain or the heavenly fortress, because, you know, fortresses and mountains are pretty much the same thing in ancient Germanic."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2594.09,"end":2595.37,"speaker":"Fr Stephen De Young","text":"You build them on the high place."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2595.45,"end":2616.37,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. And weirdly enough, it's also a term that's used for where you bury people, because it's usually in hills and stuff. So there's that sense of the inverted. You've got the inverted mountain kind of built built into the word. But yeah, this sort of heavenly mountain where the gods are. With some variation between mythologies as to exactly what that means."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2617.17,"end":2652.36,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. But there's always some kind of council meeting happening. Right. Where they get. Right. And this shows us that St. Peter knew what was going on, actually, even though we tend to pick on him a lot. On the Mount of Transfiguration. Right. So on the Mount of Transfiguration, when he sees Christ conversing with Moses and Elijah, and he suggests that they build tents right on top of the mountain for them, or booths, as it gets."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2652.36,"end":2657,"speaker":"Fr Andrew Stephen Damick","text":"Translated in some translations. But, yeah, it's this idea mansions, you."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2657,"end":2657.28,"speaker":"Fr Stephen De Young","text":"Know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2659.16,"end":2662.92,"speaker":"Fr Andrew Stephen Damick","text":"I hope you're by your construction lumber there, James. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2664.76,"end":2709.03,"speaker":"Fr Stephen De Young","text":"So he understands. He's watching a divine council meeting. Yeah, right. That's what he understands is happening here, and that's why he thinks that would be the appropriate thing to do. Right, right, right. Because this is the image and the understanding he has in his mind. And so all this means now. Right. And this is where we're going to. I think we're going to actually get to our topic in the second half tonight, rather than waiting till the third half. So when Moses goes up on the mountain of God to receive the Torah and he goes up there when they send him up there, because everybody else is terrified, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2710.78,"end":2715.66,"speaker":"Fr Andrew Stephen Damick","text":"You go, yeah. They see all the thunder and the lightning and all that kind of stuff going."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2715.66,"end":2809.61,"speaker":"Fr Stephen De Young","text":"The darkness shrouding the peak. They're like, yeah, yeah, you go see what's going on up there, Moses, let us know. Report back to us. Yeah, Moses is. This is where Moses is going, Right. Moses is going up to the peak of the mountain. He's going up to the garden. He's going up to where the divine council is meeting. He's entering into this tent. Right. And this is why. This understanding is why you have, as you alluded to earlier, you have these texts in the New Testament that refer to the law being given by or through angels. Like St. Stephen refers to it in his sermon in Acts 7:53. Gets referred to in Hebrews 2. 2. St. Paul develops it a little more in Galatians 3, 19, 20. But that's because there St. Paul is wanting to point out that it was Christ himself serving as a Mediator, who gave the law through the angels, when you throw in verse 20. Because if you just read verse 19, again, if you chop things up and don't read context, it says it was given by angels through a mediator, right? You might think, oh, Moses, Moses, Right. But if you read verse 20, St. Paul immediately says, Now Mediator implies more than one, but we know that God is one, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2809.85,"end":2811.21,"speaker":"Fr Andrew Stephen Damick","text":"It's God one. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2811.29,"end":2812.77,"speaker":"Fr Stephen De Young","text":"So who's he talking about? Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2812.77,"end":2821.05,"speaker":"Fr Andrew Stephen Damick","text":"It's Christ. And yeah, he's not. You know, it's funny because he's not countering the idea of it being Moses. He's sort of countering the idea of there being a second God. God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2821.77,"end":2828.49,"speaker":"Fr Stephen De Young","text":"Right, right, right, right. And so if he was just talking about Moses, then saying that makes no sense."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2828.57,"end":2829.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2829.33,"end":2837.61,"speaker":"Fr Stephen De Young","text":"It's irrelevant to anything. Right? But he is picking up on a further elaboration of this tradition that you can see, for example, in the book of Jubilees."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2837.69,"end":2838.09,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2838.25,"end":2939.44,"speaker":"Fr Stephen De Young","text":"So the book of Jubilees, sort of the frame story is Moses on top of the mountain, right? So Moses sort of receives the contents of Genesis 1 through 11 as sort of an apocalyptic vision, for example, Right? And so Jubilees has all these elaborations. But so not only is in Jubilees is Moses there in the divine council, and there are angels through whom the Torah is received. In addition to the angels plural, there is one particular being, the angel of the presence, who is this angel of the Lord figure that we talked about in the episode so named, the angel of Yahweh. Right, this figure. And so that's what St. Paul is really referencing there in Galatians 3. He's referencing not only the angels plural being there, but also this figure. Right? And this figure who is and isn't Yahweh the God of Israel, right. Who St. Paul is not so subtly, when you know the context, identifying with Christ. Right? But so the. The important part of this is that when Moses goes up there and enters into this tent, right? And where the divine council is and bears witness to all this and receives the Torah when he comes back down. And we start talking about worship spaces for humans, beginning with the tabernacle, right? The tabernacle is made after the pattern of what he saw on the mountain, right? And Hebrews says so."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":2940.08,"end":3020.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. Okay, so this is Hebrews chapter 8, verses 1 through 6. And you'll hear this. You'll hear this in here. Now, the point in what we are seeing is this. We have such a high priest, one who is seated at the right hand of the throne of the majesty in heaven, a minister in the holy places, in the true tent that the Lord set up, not man. For every high priest is appointed to offer gifts and sacrifices. Thus it is necessary for this priest also to have something to offer. Now, if he were on earth, he would not be a priest at all. Since there are priests who offer gifts according to the law, they serve a copy and shadow of the heavenly things. For when Moses was about to erect the tent, he was instructed by God saying, see that you make everything according to the pattern that was shown you on the mountain. But as it is, Christ has obtained a ministry that is as much more excellent than the old as the covenant he mediates is better, since it is enacted on better promises. Yeah, it's interesting. That line from verse 5, See that you make everything according to the pattern that was shown you on the mountain. I imagine one reading of that might be to say, oh, God gave him a kind of set of blueprints for the tabernacle. But if we understand what he saw on the mountain, it's no, no, no."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3020.29,"end":3020.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3020.61,"end":3025.81,"speaker":"Fr Andrew Stephen Damick","text":"You were in the tent of God. And so go make that down there."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3026.69,"end":3032.29,"speaker":"Fr Stephen De Young","text":"Right. And that's the beginning of verse five. That they're a copy and shadow of the heavenly things."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3032.45,"end":3033.17,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3033.73,"end":3034.61,"speaker":"Fr Stephen De Young","text":"Right. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3035.17,"end":3042.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. All right. Well, that is our first half, and we're going to take a short break and we will be right. Right back."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3042.42,"end":3058.74,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3062.58,"end":3064.58,"speaker":"Fr Stephen De Young","text":"New from Ancient Faith Publishing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3065.14,"end":3106.16,"speaker":"Fr Andrew Stephen Damick","text":"Orthodoxy and Heterodoxy. Finding the Way to Christ in a Complicated Religious Landscape, written by Andrew Stephen Damick. The purpose of this book is not to prove that orthodox Christianity is the one true faith. I do not believe that it is possible to prove that, at least not by what can be written in a book. What we are seeking to do, however, proceeding from the position of the orthodox Christian faith, is to show that the differences between Orthodoxy and other faiths are real and that they are important. Orthodoxy and Heterodoxy. Finding the Way to Christ in a Complicated Religious Landscape, now available as an audiobook@audible.com."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3106.4,"end":3122.49,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3129.29,"end":3179.33,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second half of the show. Again though, we're not taking any calls, despite what you heard from the voice of Steve, because this is a pre recorded episode because Father Stephen is away at a retreat when we normally would be airing this live. So we'll be back in a future episode live, but it's going to be a little while, so. All right, well, we just finished up talking about that passage from Hebrews chapter 8, where it references that, that Moses is told by God to make the tabernacle after the pattern of what he saw when he was up on the mountain of God, that tent there that he saw there. So that's, that's where we left off and. All right, well, as you mentioned, we're actually get to our official stated topic, which is the tabernacle right here in the second half. So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3179.41,"end":3185.77,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. What we're talking about before was intense and now this is going to be even more intense."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3185.77,"end":3186.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3188.69,"end":3189.09,"speaker":"Fr Stephen De Young","text":"The."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3189.73,"end":3194.29,"speaker":"Fr Andrew Stephen Damick","text":"So the dad joke list in this episode is already very, very, very long."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3194.29,"end":3208.08,"speaker":"Fr Stephen De Young","text":"Yes, yes. And really, really a lot of these were going back to the same. Well, just over and over again, but milking it. I'm Dutch. We do dairy farming. It's a thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3208.08,"end":3208.64,"speaker":"Fr Andrew Stephen Damick","text":"There you are."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3209.6,"end":3239.46,"speaker":"Fr Stephen De Young","text":"So the tabernacle as such is a tent shrine. And it's not the only tent shrine in the ancient Near East. It is a little unusual in that it is presented as in the Torah and treated as if, at least in the early historical books, as permanent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3240.26,"end":3241.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3241.1,"end":3322.11,"speaker":"Fr Stephen De Young","text":"As this being, this Trent shrine is going to be the sort of permanent shrine temple for Yahweh, the God of Israel. Whereas typically the ancient Aries, those were. You'd have a. The temple, the permanent temple would be a permanent physical building made out of stone. Yeah, Right. And tent shrines then were usually used on sort of temporary and occasional basis or bases. So one example is we have an Ugaritic ritual where at a certain time of year they would sacrifice a donkey and they did it at a particular spot and so they put up a tent shrine at that spot at that time. And then they would go and get the idols, the bodies of the gods and sort of process and haul them out to the tent shrine, offer them the donkey sacrifice and then sort of take them all back home to their temples."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3322.59,"end":3338.69,"speaker":"Fr Andrew Stephen Damick","text":"Would this donkey sacrifice be something that, that the people would eat as well? Or is it like a whole burnt. Yes, so they would eat them. So. And since you, you know, you become what you're in communion with, then through this sacrifice they were literally making asses of them. Wow. Thank you very much."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3339.17,"end":3339.65,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3340.05,"end":3342.05,"speaker":"Fr Andrew Stephen Damick","text":"I didn't actually even write that joke down beforehand."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3342.05,"end":3345.97,"speaker":"Fr Stephen De Young","text":"It just came to me Next prerecord we're doing in the evening."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3349.73,"end":3351.81,"speaker":"Fr Andrew Stephen Damick","text":"Am I too punny in the morning? Is that the problem?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3351.81,"end":3353.97,"speaker":"Fr Stephen De Young","text":"A little bit, yeah. This amount of punishment."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3355.25,"end":3356.01,"speaker":"Fr Andrew Stephen Damick","text":"It's more coffee."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3356.01,"end":3357.69,"speaker":"Fr Stephen De Young","text":"I've got more than. We could take a lot of coffee."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3357.69,"end":3358.45,"speaker":"Fr Andrew Stephen Damick","text":"In me this morning."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3360.85,"end":3364.61,"speaker":"Fr Stephen De Young","text":"So we need to let your children sort of wear you down a little bit."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3366.72,"end":3369.08,"speaker":"Fr Andrew Stephen Damick","text":"Come back when you've been beat up by your kids a little bit. Father Andrew."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3369.08,"end":3398.96,"speaker":"Fr Stephen De Young","text":"Yeah, and so. Right. So it's that kind of temporary thing and not a permanent thing. And this is what sort of creates the tension when we get to David. Right. Because sort of culturally and everything David is thinking, hey, this is weird. Right. I've got a capital city now. I have a permanent home. Yeah, right. Shouldn't the God of Israel also."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3399.28,"end":3407.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's that line in the Psalms where he says, you know, I'm not going to sleep until I've, you know, made a place, a habitation for the God of Jacob."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3407.48,"end":3463.18,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so there's. There's this idea that. So he. He's aware that this is irregular because this is irregular for the ancient world. Right. But we have to remember that one of the constant themes all through the Old Testament was that Israel was never really supposed to fully settle in the land. Right, right. Because as it says in Deuteronomy, now, out here in the wilderness, you're dependent on me. And things already weren't going that great in the wilderness. But once you get into the land and you settle down and you plant crops and you harvest them year after year and you plant vineyards and everything, you're going to forget about God and you're going to sort of fall away from all this. And so there's constant things like the Feast of Tabernacles."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3463.42,"end":3465.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. To bring them back out. To go live and breathe."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3465.98,"end":3466.7,"speaker":"Fr Stephen De Young","text":"Bring them back out."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3467.34,"end":3497.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, okay, so a question just occurred to me. You know, obviously we're not saying, you know, David has this idea that he needs to build a temple, something actually more permanent. And, you know, I mentioned that line from the Psalms where he says he's not going to rest until he's, you know, made a habitation for the God of Jacob. And I. I haven't checked whether any of the fathers interpret this way or if there's any indication in the New Testament that this gets interpreted. But could we say that. That David fulfilled his own Prophecy. By being the ancestor of the Theotokos."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3499.18,"end":3500.94,"speaker":"Fr Stephen De Young","text":"Right, yeah. By being the ancestor of Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3501.02,"end":3501.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3501.82,"end":3506.38,"speaker":"Fr Stephen De Young","text":"That he, through the Theotokos, he became the grandparent of Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3507.58,"end":3515.34,"speaker":"Fr Andrew Stephen Damick","text":"He does form a habitation for the God of Jacob by, you know, through his distant granddaughter Theotolus. Right, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3515.34,"end":3520.58,"speaker":"Fr Stephen De Young","text":"And in terms of the physical building, God is always sort of resistant to David on it."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3520.58,"end":3523.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, no, no, that's not."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3523.26,"end":3523.74,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3523.74,"end":3524.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3524.86,"end":3560.68,"speaker":"Fr Stephen De Young","text":"And so again, part of this is, yeah, God's not settled. You shouldn't be either. Right. That you should continue to. And we're going to get more into that later in this half. We're going to talk more about when the temple actually gets built and why more of the reasons why God was resistant to it. So we're going to start with the tabernacle, because the tabernacle is, if you've read through the book of Exodus, you. You've read in excruciating detail everything about the tabernacle, its construction and the furnishings and all of that twice."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3560.76,"end":3564.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's basically blueprints and architectural plans in verbal form."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3565.24,"end":3614.8,"speaker":"Fr Stephen De Young","text":"Yes. And so first you have all the instructions and then you have the narrative of them fulfilling the exact same instructions. So you literally read it twice in the same level of detail. And so we're going to kind of start on the outside and work our way in to give an idea of what the tabernacle as pattern looked like. Right. So we're starting with the outer court. Right. When we think of the tabernacle, we tend to just think of the tent. Right. But the tent of the tabernacle is inside a sort of courtyard that's formed by hanging curtains. Right. So there's a demarcation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3614.88,"end":3627.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if you, if you go, you know, and just like do a Google image search. Really, if you just type in tabernacle and do a Google image search on it, you will come up with a lot of diagrams and images that are pretty good for this. Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3627.52,"end":3629.52,"speaker":"Fr Stephen De Young","text":"The first ones kids made in Sunday school."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3630.32,"end":3699.01,"speaker":"Fr Andrew Stephen Damick","text":"And I have to say, so my great, great grandfather, who is a Baptist preacher up in New England, he had a thing that he did. So I mean, he served at a bunch of churches up there, but he also had a, like a touring talk that he did about the tabernacle, and he had some kind of model that he would take around with him and give sort of tours of it to people, you know, and explain it and so forth. So. Yeah, and I've seen, actually I saw a flyer for this at one point. It's. It's maintained in my. Somewhere in my family's archives. So, yeah, I mean, this is totally a thing. And especially if you grew up, you know, kind of low church Protestant, you've probably seen these models, like you said, stuff that your kids built in Sunday school and all that kind of stuff. But, yeah, there's a lot of pretty decent diagrams and, you know, illustrations and stuff that you can find online. And you'll see, like you said, there's this tent in the middle and then there's a kind of fence all the way around it made with curtains, effectively. Although it's not like curtains like you have in your living room. No, this is structural curtains, you know, essentially."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3699.25,"end":3701.49,"speaker":"Fr Stephen De Young","text":"Yeah. Like you'd use for the side of a tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3701.49,"end":3709.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly. Yeah. There's a tent fence and then there's a, you know, and then a tent in the center and there's a big courtyard that's made by the fence."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3709.89,"end":3718.09,"speaker":"Fr Stephen De Young","text":"Right, right. And frankly, a lot of the stuff that we think about as happening in the tabernacle actually happened in the outer court."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3718.64,"end":3720.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3720.04,"end":3758.03,"speaker":"Fr Stephen De Young","text":"So it's this outer court area. So this is where you have. This is where sacrifices take place. This includes the area called the Pro Thesis, which is where the animal was sort of butchered and separated. Or if we're talking about wheat cakes, where the cakes were separated and sorted and whatever was being sacrificed. Right. Where it was sort of portioned out and everything, however it needed to be be right before the actual sacrifice. But then the two major pieces of furniture in this area to sort of facilitate that. Right. Were the copper laver."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3759.47,"end":3762.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is a big bowl on a stand."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3762.43,"end":3771.31,"speaker":"Fr Stephen De Young","text":"Right? Yeah, A big copper bowl at a stand. But the word laver shows up in a lot of Antiochian translations."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3771.87,"end":3773.87,"speaker":"Fr Andrew Stephen Damick","text":"I think it's from the King James is where."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3774.19,"end":3788.73,"speaker":"Fr Stephen De Young","text":"Yeah, it is. Yeah, yeah, yeah. So you get a lot of. If you read. If you read Kwaston's Petrology, he loves that word. So. But. So, yeah, big copper ball in a state. It's full of water."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3788.97,"end":3789.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3789.45,"end":3802.33,"speaker":"Fr Stephen De Young","text":"And that water is used for. Was used for ritual washings for the priests. Right. As they're coming in and going out, coming into the courtyard, going from the courtyard into the tent proper. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3802.57,"end":3811.2,"speaker":"Fr Andrew Stephen Damick","text":"And that's to sort of wash off whatever uncleanness they brought with them, primarily hands and feet. Right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3811.2,"end":3833.64,"speaker":"Fr Stephen De Young","text":"Washing their hands and washing their feet. And so that is there. And then the other major piece of furniture is that the one we probably think about most of the courtyard is the altar of burnt offering okay, Right. So both the place where the sacrifices are prepared and the place where the sacrifices are offered is in this outer court."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3833.88,"end":3839.88,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So there's kind of two tables out there. The one where they're actually burnt stuff is burnt up."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3840.84,"end":3843.4,"speaker":"Fr Stephen De Young","text":"Right. That's not really a table. That's more of like a big grill."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3843.64,"end":3844.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3844.52,"end":3846.2,"speaker":"Fr Stephen De Young","text":"Coals. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3846.2,"end":3847.88,"speaker":"Fr Andrew Stephen Damick","text":"But that's the altar of burnt offering."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3848.28,"end":3849.04,"speaker":"Fr Stephen De Young","text":"Right, okay."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3849.04,"end":3855.44,"speaker":"Fr Andrew Stephen Damick","text":"And so then there's probably a. More of a table, which is for, you know, the prothesis for butchering, separating and cutting, you know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3855.44,"end":3889.38,"speaker":"Fr Stephen De Young","text":"Right, right, right, right. And so, as we've mentioned before, right. People would come to the entrance and give whatever they were sacrificing. It would be taken into the courtyard by the priests. They would take it to the pro thesis. They get everything arranged how they wanted to. They'd go and offer the portions that are being offered to God on the altar of burnt offering and then come back and give the offer whatever parts are for them and keep the parts that are for the priests."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3889.38,"end":3891.34,"speaker":"Fr Andrew Stephen Damick","text":"Now they would stay outside the offerors."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3891.9,"end":3892.38,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3892.46,"end":3894.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They don't get to go into the fence."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3894.94,"end":3898.54,"speaker":"Fr Stephen De Young","text":"Right, right, right. They didn't get to just go in there and mill around."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3898.62,"end":3908.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's a lot of references, like I've noticed this in Exodus and Leviticus and numbers. There's a lot of references to people being brought to the gate of the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3909.18,"end":3909.58,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3910.22,"end":3912.7,"speaker":"Fr Andrew Stephen Damick","text":"And lots of things happening right there at that gate."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3913.69,"end":3959.54,"speaker":"Fr Stephen De Young","text":"Right, right. So these two things, right. You can see. And this is especially. I mean, it's kind of obvious that the laver. Right, this washing, that this is sort of preparatory purification. Right. Like for service. Right. In the tabernacle. But the same applies to the sacrifices. Right. Most of the sacrifices, most of the sacrificial system is aimed at establishing and continuing communion with God to allow for what's going to go on inside the actual tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3960.1,"end":3968.33,"speaker":"Fr Andrew Stephen Damick","text":"So what's happening out in the outer courts is prep for going into the holy place."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3968.81,"end":3996.74,"speaker":"Fr Stephen De Young","text":"Right, right. So it's purification. It's allowing God to continue to dwell there, allowing people to draw near without experiencing death by holiness. Right, yeah. And so then, as we move into the holy place, right. This is the more substantive part of what's going on."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":3998.02,"end":3999.94,"speaker":"Fr Andrew Stephen Damick","text":"This is hidden by this inner tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4000.82,"end":4054.26,"speaker":"Fr Stephen De Young","text":"Right. There are going to be certain priests who are allotted at certain times to have this inner ministry. Right. And the reason I say this is more central is that when we get glimpses, right. We already talked about how Moses is constructing this as an icon, as a representation of what he saw on the mountain. But when we see, for example, Isaiah or Ezekiel. Right. See heavenly worship, or St. John, for that matter. See heavenly worship. Right. The heavenly worship they see is not the stuff that's going on in the courtyard. They don't see people offering animal sacrifices and washing their hands. Right, right. What they see in the heavenly sanctuary is what goes on inside the tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4054.42,"end":4069.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. And again, we should just. To double down. The tent here is deliberately patterned after this tent that is the dwelling place of God with the sons of God that Moses sees on the mountain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4070.22,"end":4070.54,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4070.54,"end":4070.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4070.9,"end":4076.06,"speaker":"Fr Stephen De Young","text":"Right. And so now as we move into the tent. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4076.06,"end":4076.46,"speaker":"Fr Andrew Stephen Damick","text":"Proper."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4076.94,"end":4092.78,"speaker":"Fr Stephen De Young","text":"Right. Now there's going to be the back portion of the tent. The most holy place is sectioned off right, by this heavy curtain. Right. And as we've talked about before, only the high priest could go back there only one day a year on the day of atonement."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4093.5,"end":4101.37,"speaker":"Fr Andrew Stephen Damick","text":"So in the tent, then there's a kind of larger space, and then. Then there's the. The innermost place that's sectioned off within that tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4101.61,"end":4129.83,"speaker":"Fr Stephen De Young","text":"Right, okay. Where most of the time don't nobody go. Right, Right. So most of the. The worship is taking place obviously outside of that curtain, but within the tent proper. Right, right. Of the tabernacle. And so we've got some more pieces of furniture right in here. We've got that we talked about recently, the table of the showbread."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4131.19,"end":4134.15,"speaker":"Fr Andrew Stephen Damick","text":"The shoe bread. Yeah, The King James bread."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4134.47,"end":4152.15,"speaker":"Fr Stephen De Young","text":"Yes. And we talk about. That's the bread of the presence. Right. That this is the table where the bread is not to feed to God, but through which God feeds the priests who are in their. During their allotted service. Right. To strengthen them for service."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4152.31,"end":4152.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4152.87,"end":4176.35,"speaker":"Fr Stephen De Young","text":"So they could carry out their duties. And it's important that they're fed in there because again, there's this whole elaborate thing about them coming and going. Right. This allows them to remain there and be strengthened. And then central to the tabernacle is the altar of incense, which is a horned altar."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4177.54,"end":4193.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which kind of looks like. It's hard to describe exactly what it looks like, but it's sort of a plinth of sorts. Right. Like there are stone versions of this. I'm assuming the version that they carried around with them would not have been stone or would not. Right, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4194.34,"end":4197.06,"speaker":"Fr Stephen De Young","text":"You could read all the details in the book of Exodus."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4197.06,"end":4228.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, exactly. Yeah. So it's sort of a plinth flat place on top, and then there's four bits that stick up on the corners. And these are regarded as the horns of the altar, they're not actually made of animal horns, it's just they're horn shaped. And so the overall effect is it's almost like a brazier. But a brazier is usually kind of more basket shaped on top. But it's the same sort of idea, you know, that you've got this flat spot where the incense gets burned and then these four horns sticking up on the corners."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4229.64,"end":4259.77,"speaker":"Fr Stephen De Young","text":"Right. Coals are kindled on that and kept burning on that. It's sometimes slightly concave, not like a bowl, but a little concave. And you have the coals burning in there. And then incense is offered on the coals. And then when you're using a sensor from that, that was used to transport incense. So one of the coals and some incense was taken from. From the altar of incense put into the censer and that would then make it mobile. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4259.85,"end":4271.29,"speaker":"Fr Andrew Stephen Damick","text":"So yes, taking the, taking this sacrifice being offered on this altar, kind of on the road, so to speak. Or out, you know, out. Out from the altar itself in order."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4271.29,"end":4277.21,"speaker":"Fr Stephen De Young","text":"To bring the purifying effects of the offering to some particular place or thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4277.37,"end":4280.57,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4282.85,"end":4303.49,"speaker":"Fr Stephen De Young","text":"Again, the style of the incense altar is not, as you alluded to. There's. You find plenty of pictures of stone ones. It wasn't like a completely different style than other ones in the ancient Near East. Right. Slightly different composition of materials, but there may have been very similar ones for materials that we just don't have anymore because, you know, wood decays."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4304.45,"end":4324.06,"speaker":"Fr Andrew Stephen Damick","text":"And again, if you go to, if you go to Google image search and just type in incense altar in between stuff from video games, interestingly enough, you can see various drawings that seem to basically kind of fit. That would be this sort of thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4324.94,"end":4330.3,"speaker":"Fr Stephen De Young","text":"Yeah, it's like when you search for Lord of Spirits, you either get this podcast or a bunch of anime stuff."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4330.3,"end":4332.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. There is a whole anime thing. I've discovered this."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4333.78,"end":4368.73,"speaker":"Fr Stephen De Young","text":"So not related in any way. I am not a Weeb, ladies and gentlemen. Anyway, so. And then the other major piece of furniture in that space is the candle stand, which we now probably think of as a menorah. The seven branch lampstand. Okay, why are there seven? Yes, Some people ask why are there seven lights? Don't ask Picard. He gets all worked up about this. How many lights there are, but."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4370.97,"end":4372.97,"speaker":"Fr Andrew Stephen Damick","text":"Four. There are four lights."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4373.13,"end":4376.89,"speaker":"Fr Stephen De Young","text":"Yeah, there are seven lights because there are seven planets."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4379.85,"end":4381.37,"speaker":"Fr Andrew Stephen Damick","text":"So what are the seven planets?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4381.85,"end":4385.93,"speaker":"Fr Stephen De Young","text":"Those being the sun, the moon, Mercury, Venus, Mars, Jupiter and Saturn."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4385.93,"end":4397.76,"speaker":"Fr Andrew Stephen Damick","text":"Right. Obviously planets, you know, defined differently than we do. In the modern era, because this is with what they call a geocentric model of the universe."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4398.08,"end":4402.56,"speaker":"Fr Stephen De Young","text":"They're planets because they're wanderers and they don't follow the general track of the stars."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4402.56,"end":4403.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because that's what we're."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4403.44,"end":4404.88,"speaker":"Fr Stephen De Young","text":"Which follow predictable patterns."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4404.88,"end":4406.04,"speaker":"Fr Andrew Stephen Damick","text":"Planet means wanderer."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4406.04,"end":4413.38,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. Right. And so the fact that we don't hold to that cosmology anymore is not relevant to them."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4413.53,"end":4413.77,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4414.33,"end":4428.49,"speaker":"Fr Stephen De Young","text":"Because the point is, you have these seven lights within the tent, as there are seven lights in the sky under the heavens."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4429.45,"end":4440.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's this concept, then, that the tabernacle itself is a microcosm of the universe, and this is being represented by this seven branch candlestand."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4441.63,"end":4448.19,"speaker":"Fr Stephen De Young","text":"Right. Because ultimately, where does God live? He doesn't live at a place outside his creation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4448.75,"end":4450.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4450.35,"end":4462.71,"speaker":"Fr Stephen De Young","text":"He lives in his creation. Right, right. And of course, within this, though not contained by it. We should make that just like he wasn't contained by the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4462.71,"end":4463.23,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4463.23,"end":4466.19,"speaker":"Fr Stephen De Young","text":"Right, yes, but."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4467.13,"end":4467.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4467.29,"end":4481.05,"speaker":"Fr Stephen De Young","text":"And then, of course, as we've mentioned before, woven into the. The veils, right. The sides of the tabernacle and into the curtain before the holy of holies are images of cherubim. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4481.13,"end":4481.53,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4481.53,"end":4560.44,"speaker":"Fr Stephen De Young","text":"The heavenly throne guardians. So there is this iconographic recreation of the divine council as well. Right. And the primary worship, the first commandment on worship that's given in the Torah is that incense is to be offered at morning and evening with prayer. And so that's the kindling of the lamps and the trimming of the lamps at morning and evening, meaning sunrise and sunset, really. And so this incense is the sort of regular pattern. Right. And it's what we see, as we mentioned a little bit ago, when we see the worship of heaven. You know, when you go to Isaiah and he's standing there in the divine council and this. This worship is being offered. There's an incense altar there. Right. And you see angelic beings with sensors. Right. Revelation right across the board. This is the worship. So this is what's going on inside the tent by those designated priests at designated times. Unless you want to end up like Nadab and Abihu. Right. With even a particular recipe for the incense."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4561.72,"end":4562.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4565.16,"end":4580.35,"speaker":"Fr Stephen De Young","text":"That all allows them to draw this close. Right. Then you get to the most holy place or the holy of holies. Right, right. The sanctum sanctorum minus Dr. Strange. Is Dr."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4580.35,"end":4583.35,"speaker":"Fr Andrew Stephen Damick","text":"Strange meant to be a priest? Tune in next time."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4583.51,"end":4591.67,"speaker":"Fr Stephen De Young","text":"No, he's not. But he does call his. He calls his house in Greenwich Village his sanctum sanctorum."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4591.67,"end":4592.07,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4592.23,"end":4592.95,"speaker":"Fr Stephen De Young","text":"That's the Reference."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4592.95,"end":4594.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay, I know. No, I know, I know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4595.03,"end":4678.82,"speaker":"Fr Stephen De Young","text":"Okay. So within the most holy place, obviously the most prominent thing while it was still around before Ethiopians or whoever else took it is the Ark of the Covenant. Right, Right. And we talked last time about how about the differences between the Ark of the Covenant and idols. Right. And how that works. But again, you have this imagery of the cherubim at the footstool of the throne of God. Right. And that footstool language is important, Right. Because it's not that they thought God lived inside the box, but that this footsl. This is the point of contact. Right. If you're going to go and meet with the king and make a request, you go and you bow down by his feet, Right. Where he's enthroned, and you make your request. That's how you come before the king. So this is a point of contact. And then, of course, the other stuff that was back there, at least for a while, is within the Ark were the two tablets of the covenant."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4679.14,"end":4680.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4680.34,"end":4683.54,"speaker":"Fr Stephen De Young","text":"And just to reiterate, this is two copies."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4684.58,"end":4687.74,"speaker":"Fr Andrew Stephen Damick","text":"It's not commandments one through five and then six through 10."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4687.74,"end":4749.08,"speaker":"Fr Stephen De Young","text":"No, it's not that. They ran out of space. Right. The commandments are really short in Hebrew. They ran out of space. It wasn't making some kind of point about. Well, these are about God and these are about your neighbor. None of that is original. It's two copies of the same covenant. Right. And that's because, as I believe we mentioned before, it was common when a covenant was issued in the ancient near east, that there would be two copies, one the king would keep. Because he was going to. Right. Obviously he was party to it. He was the one issuing the covenant. He was going to then enforce it. The other one was taken and placed at the feet. Feet of the God, in the idol of the God, obviously in the temple. Right. The body of the God of the temple, they place it at his feet so that God was called upon to bear witness to the covenant and help with the enforcement. Right. So in Israel, their king and their God is Yahweh."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4749.24,"end":4749.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4750.12,"end":4754.24,"speaker":"Fr Stephen De Young","text":"So both copies are put in the Ark at his footstool."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4755.19,"end":4755.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4755.99,"end":4798.19,"speaker":"Fr Stephen De Young","text":"He's the one issuing the covenant and the one enforcing it and God and then not in the Ark. I know people think these were in the ark, but they were not in the Ark. They were next to the Ark. Next to the ark, in the holy of Holies were the jar of manna and Aaron's rod that budded that designated him as the high priest Right. Those two things were kept there also, and they disappear even before the ark does. And there's a comment in the Old Testament that they had disappeared at a certain point, but we're never told how wide."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4798.35,"end":4806.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I was going to say no sense that God took them or that someone stole them or they're just gone. No."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4806.96,"end":4820.28,"speaker":"Fr Stephen De Young","text":"And I mean, the ark disappears, and we're not even actually told that they realized it had disappeared at a particular point, but we are actually told at one point that they're like, well, the ark's there, the tablets are still in it, but this other stuff's gone."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4820.52,"end":4821.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4823.08,"end":4823.48,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4824.36,"end":4828.6,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So that. So that's the tabernacle with."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4828.84,"end":4829.72,"speaker":"Fr Stephen De Young","text":"Those are the contents."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4829.72,"end":4849.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The outer courts, the inner tent with. With its two partitions, the accoutrement. Exactly. With all of its furniture and so forth. And as you said, though, David thought that there needed to be a stone temple because he's got his Jerusalem now and David lives in a nice house. Shouldn't God live in a nice house?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4849.61,"end":4868.86,"speaker":"Fr Stephen De Young","text":"Right. There's a certain logic to it. Yeah, Right. There's a certain logic to it. But beyond even just what we talked about, right. About God wanting to try to help Israel not feel so settled, there are other issues."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4870.86,"end":4871.82,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4871.82,"end":4872.94,"speaker":"Fr Stephen De Young","text":"With having one. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4873.02,"end":4878.62,"speaker":"Fr Andrew Stephen Damick","text":"What else is going on there? And so, you know, and. And surprise, surprise, paganism is involved."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4879.42,"end":4898.15,"speaker":"Fr Stephen De Young","text":"Yeah. So. So I mean, it's very clear. Right. I mean, you. He's pretty clear with David. I don't really want this. And then when David really pushes through, he says, well, you're not doing it. He basically forbids David to do it."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4898.15,"end":4901.91,"speaker":"Fr Andrew Stephen Damick","text":"Right. Solomon ends up doing it and doesn't give any instructions on how to build it."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4902.31,"end":4953.12,"speaker":"Fr Stephen De Young","text":"Right. And he says, your son will build it. Right. But even that isn't, I want your son to build it, it's your son's going to do it. Right. And then even with Solomon, there's this ambivalence. Yeah. And God doesn't give. You see the excruciating detail given twice in Exodus for the tabernacle. Right. And there is New or the Old Testament, any kind of similar instructions for the temple. We get a description of the temple and what Solomon did. Right. But he's never sort of commanded. Now there is this verse, there's somebody out there already listening to this right now. They probably forgot we're not live. And they picked up the phone to try and call in actually us with this verse in 1st Chronicles 28."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4955.04,"end":4955.36,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4955.36,"end":4958.48,"speaker":"Fr Stephen De Young","text":"Talks about David giving Solomon plans."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4959.12,"end":4959.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4959.92,"end":4964.96,"speaker":"Fr Stephen De Young","text":"And David Says, hey, I planned everything out the way God put it in my heart."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4966.52,"end":4968.12,"speaker":"Fr Andrew Stephen Damick","text":"Right. But that's."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4968.12,"end":4971.32,"speaker":"Fr Stephen De Young","text":"And they're gonna say, no, God did give David plans. See."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4971.72,"end":4987.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, but the thing is that it's such a contrast to the way that God lays out the Tabernacle. So he's gonna tell Moses with all this sort of blueprint kind of language, and then he's just gonna sort of put it in David's heart, you know?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4987.24,"end":4987.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4987.6,"end":4995.4,"speaker":"Fr Andrew Stephen Damick","text":"And here's the thing. It's just David saying that there's no point where it says, and the word of the Lord came to David, King of Israel, and said unto him."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":4996.3,"end":5004.14,"speaker":"Fr Stephen De Young","text":"Yeah. And what David is literally saying in the original is, God put it on my heart to build him a temple. And here's the plans I came up with."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5004.94,"end":5006.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5006.26,"end":5007.58,"speaker":"Fr Stephen De Young","text":"Which is not the same thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5007.74,"end":5031.13,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. So I'm looking at the verse. It says, hear me, my brothers and my people. I had it in my heart to build a house of rest for the ark of the covenant of the Lord and for the footstool of our God. And I made preparations for building. And then verse three. But God said to me, you may not build a house for my name, for you are a man of war and have shed blood. So immediately it's followed by like, no, no."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5032.09,"end":5036.73,"speaker":"Fr Stephen De Young","text":"Yeah. But so here's the play in Solomon. Right? Here's what I was working on. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5037.61,"end":5038.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5038.81,"end":5073.3,"speaker":"Fr Stephen De Young","text":"So. Yeah. Right. And you really see this brought out when you read the long prayers about. There's this long prayer Solomon gives at the dedication of the temple. And then there's sort of God's response. Right. And there's a noted. There's a very noted contrast there because Solomon is very much like, you know, Lord Yahweh, God of Israel, answer all the prayers of those who pray toward this building."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5074.72,"end":5075.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5075.2,"end":5101.54,"speaker":"Fr Stephen De Young","text":"And everything they ask for, give it to them, and do whatever we want when we do the ritual in the building. Right. Like, it's very much in that direction. Right. Like pagan. I'm going to enchant the building. Right. So it'll be magic building. And God's response is. Is basically like, I don't live in buildings made by human hands. I don't want this. I don't need this."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5101.7,"end":5104.66,"speaker":"Fr Andrew Stephen Damick","text":"This is not how this works. This is not how it works."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5105.06,"end":5187.69,"speaker":"Fr Stephen De Young","text":"And then sort of ends up with, but I will condescend to dwell here. And, you know, I will answer your prayers when they're the right prayers, and I will. And so God very much not just continues to express ambivalence, but says this is a condescension and he's not going to be limited by it. Right. He says, I'm going to place my name here. I'm going to put my presence here. And at that dedication, it is filled with the Theophanic glory cloud. Right. So God does dwell there, but he keeps himself detached from the physical building. He says, I'm not only going to be here, and I'm not always going to be here. Right. But I will. I will condescend to be here. And the reason for that. The reason for that is part of the way temples functioned in the pagan world. We've talked a lot about, in idolatry, how the idol became a body of the God, a hypostasis of the. The God. But in many ways, they believe the temple building similarly was itself sort of a body of the God."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5187.85,"end":5202.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I was just going to say, for those who are kind of wanting to look up exactly the stuff that we just talked about that's in Second Chronicles, chapter six, you can see the prayer of dedication and God's response and all that kind of stuff is there."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5202.01,"end":5205.36,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. It's also in First Kings."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5205.44,"end":5205.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5207.2,"end":5233.98,"speaker":"Fr Stephen De Young","text":"But so the. Once you have that idea, Right. That the temple itself is sort of seen and utilized the way an idol is, then the way Solomon was talking kind of makes sense. Right. We talked about how the idol is sort of this point of leverage. Right. And so the temple building itself could be such a point of leverage, a."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5233.98,"end":5235.14,"speaker":"Fr Andrew Stephen Damick","text":"God trap, as it were."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5235.7,"end":5246.42,"speaker":"Fr Stephen De Young","text":"Right. And not just the bill. The building of it was seen as doing something for, you know, I've made a house for you. I've made a place for you to live. I'm your landlord. Wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5247.7,"end":5248.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5249.86,"end":5284.25,"speaker":"Fr Stephen De Young","text":"And it was seen to sort of impose like an obligation. Right. So, for example, when Arminius. Not that one, the German general, defeated the Roman legions in Germany, there was a period of time where the Romans would go and throw rocks at the temples and throw curses at them. Right. Because they were saying, we built you these beautiful temples and we offered you all these sacrifices, gods, and you blew it. Our army lost."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5284.57,"end":5289.17,"speaker":"Fr Andrew Stephen Damick","text":"They see it as hurting the gods by throwing rocks at their temples."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5289.73,"end":5294.69,"speaker":"Fr Stephen De Young","text":"Right, right. So sort of like bums, you know, like when the Yankees lose, you know, everybody."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5298.77,"end":5302.93,"speaker":"Fr Andrew Stephen Damick","text":"The worst, the worthless ones, to make a call back to one of our previous. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5305.01,"end":5357.36,"speaker":"Fr Stephen De Young","text":"So. And. And you see this reflected not only in Solomon's Prayer, but in the design, because he basically built a Phoenician temple. Right. One of the Features, for example, is the two pillars, the two prominent pillars at the front made of different materials. And those pillars are. I mean, everybody argues about this, right, because, you know, journal articles and dissertations have to be written. But one common way of viewing what's going on with the. The two pillars in Phoenician temples made of these two different materials is that they represent sort of the carotid and the jugular. So the idea being that the temple building is sort of the God's heart."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5357.52,"end":5365.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And for those of you, it's been a long time since you studied any anatomy or whatever. That's the to and from passages to the human heart."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5366.89,"end":5367.85,"speaker":"Fr Stephen De Young","text":"Well, from the heart to the brain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5367.85,"end":5368.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the heart to the brain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5368.57,"end":5373.29,"speaker":"Fr Stephen De Young","text":"Sorry, through your neck. Yeah, Right. Which if you cut, you're dead. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5374.17,"end":5375.77,"speaker":"Fr Andrew Stephen Damick","text":"So don't do that, everyone."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5375.93,"end":5376.89,"speaker":"Fr Stephen De Young","text":"Yes. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5377.29,"end":5379.37,"speaker":"Fr Andrew Stephen Damick","text":"That's the pastoral application of what we're just saying."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5379.37,"end":5470.47,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. So that's sort of the vital, Right? Like the vital power. This is the sort of divine life imbued into this building, right? And. And you see this. That this view was sort of. This isn't just sort of Solomon yielding to paganism, as he was wont, but this is carried on in Judah all the way to the end. Because this is one of the problems Jeremiah has, right? So there's a whole bunch of people, Jeremiah is coming and giving these prophecies of. Of doom and destruction. And everybody's calling him a false prophet and saying these other prophets who were the actual false prophets, who were saying, no, everything's good. The peace, peace. But there is no peace, folks, right? These are the real prophets. And part of their evidence was, well, look, Yahweh's temple's here. He can't let anything happen to his temple, right? So, like, the building itself is this sort of magical talisman, right, that God is somehow bound to. Right? And we all know, of course, that the God of Israel's response to that was, nope, but he was perfectly capable of leaving. But that. That was their idea. Now, this idea of the temple as body of God gets repurposed in Ezekiel."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5470.95,"end":5475.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he re. I don't know, he retcons it on some level."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5475.87,"end":5493.15,"speaker":"Fr Stephen De Young","text":"Right, Right. He takes it and inverts it a little bit, Right? Because here's one of the interesting things, right? And sorry, dispensationalists, but. Yeah, let's talk to the dispensationalists. Okay, okay. Because."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5493.47,"end":5495.27,"speaker":"Fr Andrew Stephen Damick","text":"Okay, dispensationalists. Sit down."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5495.27,"end":5497.39,"speaker":"Fr Stephen De Young","text":"Our dispensationalist friends, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5498.52,"end":5499.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, no, friends."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5501.8,"end":5538.62,"speaker":"Fr Stephen De Young","text":"Are What? To point out that the temple built in the days of Ezra and Nehemiah, the temple rededicated by the Maccabees, Herod's temple, none of those temples match the description of the temple at Ezekiel. They point that out, but then they conclude from that that. Well, that must mean that a temple exactly matching this is going to be built sometime in the future, right? Yeah. The end times within a generation of 1948. Oops, never mind that part."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5539.98,"end":5541.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep. So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5545.5,"end":5548.3,"speaker":"Fr Stephen De Young","text":"Here'S the problem with that, is that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5551.27,"end":5551.51,"speaker":"Fr Andrew Stephen Damick","text":"If."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5553.27,"end":5573.67,"speaker":"Fr Stephen De Young","text":"The original hearers of Ezekiel's prophecy. Right. Ezekiel's in the exile. Right. If the original hearers interpreted this literally in that sense. Right. This is going to be the measurements, etc, of the temple of the future. Why didn't they rebuild it that way?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5573.67,"end":5575.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they built something else."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5575.75,"end":5591.41,"speaker":"Fr Stephen De Young","text":"They built something else. Why didn't the Maccabees, they rededicated it, build it that way? Herod. Herod's construction was actually more elaborate in a lot of ways."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5591.65,"end":5592.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5592.93,"end":5595.73,"speaker":"Fr Stephen De Young","text":"And more difficult. Herod was aware of the Book of Ezekiel."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5596.21,"end":5596.61,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5597.81,"end":5604.05,"speaker":"Fr Stephen De Young","text":"Right. And the Sadducees who were running the temple were intimately aware of it. That's why they called themselves Zadokites."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5604.23,"end":5604.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5604.87,"end":5613.27,"speaker":"Fr Stephen De Young","text":"They're trying to cast themselves as those future priests. Why didn't they want the temple to match? Right. Because none of them read it that way."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5614.07,"end":5615.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5615.43,"end":5623.43,"speaker":"Fr Stephen De Young","text":"Right. This is why we have to say, sorry, dispensationalists. None of them read it that way and none of the early Christians read it that way. Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5623.51,"end":5630.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You don't find anywhere early Christians saying, okay, now we need to build a temple that matches this description in Ezekiel."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5631.82,"end":5638.62,"speaker":"Fr Stephen De Young","text":"No, you find quite the opposite. The only people you find talking about the Jewish temple getting rebuilt are people saying the Antichrist is going to do it."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5639.18,"end":5639.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5640.22,"end":5689.47,"speaker":"Fr Stephen De Young","text":"That's mostly after Julian the Apostate tried to do it. Because, you know, they said, Julian the apostate, he's kind of an Antichrist. But the point being, right. That the original Jewish here, so Second Temple Judaism, worshiping in a temple that didn't match this one, read this typologically. Right. They thought that this description of the temple was conveying certain truths. They didn't read it as, there's going to someday be a physical building that matches this. And so those typological readings sort of found their end and found their fulfillment among early Christians who read this as. Read this typologically, but referring to Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5689.71,"end":5691.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not to a building."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5692.35,"end":5695.79,"speaker":"Fr Stephen De Young","text":"So this temple is the body of God because it's Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5695.79,"end":5696.67,"speaker":"Fr Andrew Stephen Damick","text":"Because it's Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5696.99,"end":5703.79,"speaker":"Fr Stephen De Young","text":"Christ's body. Right. And so, and when I say early Christians, I mean like for example, St. John the Evangelist."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5704.03,"end":5721.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Because Christ himself says, you know, he refers to his. And John supplies his interpretation. But, you know, you're going to, you know, you know, you'll tear down this temple and then I will raise it again in three days. And then it says. And by this he meant his body."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5722.16,"end":5726.24,"speaker":"Fr Stephen De Young","text":"Yes. St. John is good about the parenthetical notes, just in case you're not tracking."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5726.48,"end":5741.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. Thank you. Thank you. So there's other problems with getting back to Solomon's temple. There's other problems with, with it. Like big, big problems. Right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5741.05,"end":5755.21,"speaker":"Fr Stephen De Young","text":"Well, yeah, yeah. So we talked about paganism, as was Solomon's want. I mean, we all know this is why he ended up losing his kingdom. Right, Right. It's because he didn't just build this temple, he built a lot more to other gods from his other wives."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5755.29,"end":5756.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5757.61,"end":5777.41,"speaker":"Fr Stephen De Young","text":"But even this temple he didn't do so well. It's not just that. Oh yeah, he had the temple of Yahweh, the God of Israel, and then he had a BAAL temple down the street and then he added Egyptian temple down the street from that. He even messed up with this one. So this is a tale of two chariots."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5777.57,"end":5778.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5779.65,"end":5811.18,"speaker":"Fr Stephen De Young","text":"So if you go back to 1 Chronicles 28 and you read verse 18, it talks about how part of David's idea was to have sort of a chariot throne surrounding the Ark of the Covenant within the Holy of Holies, within the permanent building. Okay, Right. And this was, this was there, this was built. And one was built in the second temple too. By the way, even though they didn't have the Ark of the Covenant, they still had the big cherubim throne back there."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5811.34,"end":5811.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5814.22,"end":5815.67,"speaker":"Fr Stephen De Young","text":"Where it would have been."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5816.07,"end":5816.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5818.07,"end":5850.5,"speaker":"Fr Stephen De Young","text":"And those cherubim, by the way, for interested people, when the Romans destroyed the temple in AD 70, which, sorry, preterists, was actually not that big of a deal. But anyway, when they destroyed the temple in A.D. 70, those cherubim were taken to Antioch, those huge sharing for the temple, because Antioch was the second largest Jewish population in the world at the time."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5850.5,"end":5853.94,"speaker":"Fr Andrew Stephen Damick","text":"So it was kind of rubbing it in their faces."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5853.94,"end":5887.38,"speaker":"Fr Stephen De Young","text":"Yes. And they were put on display there both to rub it in their face and they wanted to prevent that Jewish community from revolting the way Jerusalem had. Yeah, right. Romans were good at object lessons. So, but now. So this, this chariot throne, right. Representing the throne of Yahweh, the God of Israel, who Got to see that. Just the high priest once a year through a haze of incense smoke."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5887.38,"end":5888.42,"speaker":"Fr Andrew Stephen Damick","text":"On the day of atonement."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5888.42,"end":5903.6,"speaker":"Fr Stephen De Young","text":"Right, on the day of atonement, so he wouldn't die. Okay. But Solomon also built another chariot. And we find out that Solomon built this in 2 Kings 23, 11 Chariots of Fire."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5903.6,"end":5903.96,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":5905.48,"end":6016.69,"speaker":"Fr Stephen De Young","text":"Sort of, yeah. And this was. We mentioned this briefly back in the Melchizedek episode, right. That the pagan God who was worshiped at. At Jerusalem, Urushalom, before David took it was Tzedekah, who is a. Or Tzedek, who was seen as a hypostasis of Shemesh, the sun God. So Shemis Zedekah, the son of righteousness. This is why Christ is referred to in our liturgics as the true son of righteousness over against this fake one. But. So Shemesh Zedekah, the sun God, rode in a chariot and Solomon built one for him and put it at the entrance to the temple in Jerusalem. And it was there from his time, when the temple was first built, all the way through the history of Judah to King Josiah's reforms. King Josiah destroyed it. And that was about 25 years before the fall of Jerusalem to the Babylonians. So for pretty much the entirety of the history of Judah, people who actually came to the temple to worship, now given the whole northern kingdom, isn't going to the temple to worship. They're at best going to the golden calves at Bethel and Daniel. But those who are actually going to the temple to worship, what are they seeing and interacting with? Yeah, the chariot of Shemesh Zedekah, because they don't go in, they're there with the idol for the whole history of Judah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6017.73,"end":6018.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6018.37,"end":6019.01,"speaker":"Fr Stephen De Young","text":"Centuries."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6019.25,"end":6022.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. I think what, a couple hundred years or so, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6023.81,"end":6024.77,"speaker":"Fr Stephen De Young","text":"Yeah, more than that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6025.09,"end":6025.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6025.79,"end":6026.51,"speaker":"Fr Stephen De Young","text":"About 350."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6026.59,"end":6027.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really? Oh, wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6027.87,"end":6050.35,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, so this is, this is another piece of that. Once again, you know, you, you get all these shocking documentaries, right, where scholars, you know, nice, nice seeming Greek ladies with British accents come on and tell you, I'm not referring to anyone in particular."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6050.35,"end":6050.99,"speaker":"Fr Andrew Stephen Damick","text":"I promise."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6053.4,"end":6063.32,"speaker":"Fr Stephen De Young","text":"That the Bible tells you that ancient Israel was monotheistic, but it's lying. They were really polytheistic pagans."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6063.32,"end":6063.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6063.96,"end":6066.04,"speaker":"Fr Stephen De Young","text":"And you go, have you read the Bible?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6066.04,"end":6068.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, yeah, exactly. Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6069.4,"end":6081.85,"speaker":"Fr Stephen De Young","text":"Right. It's like, yes, they were. The question is not did the ancient Israelites worship more than one God? Right. The question is, were they supposed to?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6082.73,"end":6083.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6083.05,"end":6084.65,"speaker":"Fr Stephen De Young","text":"And that's the question."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6084.89,"end":6124.09,"speaker":"Fr Andrew Stephen Damick","text":"And notably, as you said, if you read the scriptures, you know, closely or not even that closely, frankly. If you just simply read the scriptures, you see, you know, they present God punishing them for doing this, God condemning them for doing this over and, you know, allowing invasions, all this kind of stuff over and over and over again. And so it's an interesting question then, if ancient Israel was actually totally cool with being polytheistic, if everyone's been lying to you. Right. It's like, well, why would they preserve the scriptures in this way if there's."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6124.09,"end":6125.33,"speaker":"Fr Stephen De Young","text":"Not to say the opposite."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6125.33,"end":6157.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's actually say the opposite that point out how bad they are. And to me, actually, this is another of these things, like for instance, the apostles recording their own stupid sayings and sin, sins and betrayals in the Gospels. That is an indication of the truth of a lot of this. It's that if it's all just propaganda, why would you depict your leaders and forebears and whatever in this bad light? But there it is. There it is. This is God's opinion about all these things is what the scriptures is."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6159.52,"end":6209.95,"speaker":"Fr Stephen De Young","text":"Right, Right. And so the thing here is God of course knew what would happen when they allowed their religion to put down roots form these permanent institutions. They would start to become deformed. Right. By keeping it the tabernacle, by keeping them unrooted by, as St. Peter would later say, us continuing to live as aliens and strangers in the world. Right. The way Abraham lived, as opposed to lot who went to go live in Sodom. Right. That that would help preserve the reality of who God is rather than having it be deformed as they formed culture and a culture like the cultures of the nations around them."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6210.03,"end":6210.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6210.99,"end":6221.12,"speaker":"Fr Stephen De Young","text":"Right. And so this sort of thing that happened is exactly why God did not want that permanent temple in the first place."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6221.12,"end":6227.04,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right, well, we're going to take another quick break and we'll be right back with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6227.28,"end":6243.53,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237. That's 855-AF-RADIO."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6251.69,"end":6296.58,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer? Are you an Orthodox Christian looking for a. A reliable first place to send your interested friends? Do you need help finding an Orthodox church near you? My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in The Orthodox Church in America. My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America. And I'm Father Andrew Stephen Damick, Chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox intro team."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6296.82,"end":6298.58,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6298.58,"end":6300.54,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6300.54,"end":6302.9,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6303.06,"end":6308.9,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6308.9,"end":6311.22,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6311.22,"end":6333.3,"speaker":"Fr Andrew Stephen Damick","text":"Of the Internet, a place to get help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient Faith Ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6341.06,"end":6357.21,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6365.45,"end":6376.21,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back. It's the third half of the Lord of Spirits podcast because this is a podcast and a half. And once again, you can't call in despite what the voice of Steve just said to you."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6376.37,"end":6377.33,"speaker":"Fr Stephen De Young","text":"Well, you can."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6377.41,"end":6378.49,"speaker":"Fr Andrew Stephen Damick","text":"You can. That's true."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6378.49,"end":6379.25,"speaker":"Fr Stephen De Young","text":"You will not get."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6379.25,"end":6396.38,"speaker":"Fr Andrew Stephen Damick","text":"You're not going to get us. Yeah, you're not going to get us. You won't get the very kind voice of Matushka Trudy on the other end listening to whatever it is you have to say to her and trying to pass that on to us. You're not going to get that this time around. So it's okay. It's all right. We're here for you. Just not."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6396.54,"end":6411.1,"speaker":"Fr Stephen De Young","text":"Just not live when we do this. When we do this and we're not live, what we need to do is we need to find recordings of one of those old 976 numbers. Like that would tell you scary stories at Halloween or something. Or the one that did Bible stories."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6411.42,"end":6413.34,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that does take me back."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6413.82,"end":6421.82,"speaker":"Fr Stephen De Young","text":"And just hook that up to the line so that if anybody calls in during a non live show, they get that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6422.16,"end":6424.4,"speaker":"Fr Andrew Stephen Damick","text":"That's a great idea. And I'm sure we can find a donor to cover that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6424.4,"end":6426.16,"speaker":"Fr Stephen De Young","text":"No? Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6427.84,"end":6444.88,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we just finished up the second half talking about the tabernacle and its actual contents and so forth, its structure and contents. And we talked about the temple of Solomon and how that really was not what God had in mind."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6445.6,"end":6446,"speaker":"Fr Stephen De Young","text":"Bad."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6446.16,"end":6446.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6446.84,"end":6447.44,"speaker":"Fr Stephen De Young","text":"Very bad."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6447.52,"end":6458.71,"speaker":"Fr Andrew Stephen Damick","text":"Just not. Not good. Not good. So here in the third half, now we're going to talk about how the tabernacle is understood in the New Testament."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6459.67,"end":6478.97,"speaker":"Fr Stephen De Young","text":"Oh, one more note, though, on Solomon, I once again tried to preclude a certain number of emails that I'll have to skim, and that is that somebody will say, actually, Solomon's a saint. Okay. So here's the thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6478.97,"end":6479.61,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6480.97,"end":6491.13,"speaker":"Fr Stephen De Young","text":"So Solomon, in terms of the story of Solomon in 1 Kings and in Chronicles, is presented as sort of the prototypical, like, reprobate. Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6491.61,"end":6492.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6492.17,"end":6525.85,"speaker":"Fr Stephen De Young","text":"But within the tradition of the church, Solomon, the figure of Solomon includes Qohelet, the teacher of Ecclesiastes. Right. And not going to sit here and argue because that's a show and a half all by itself. The authorship of Ecclesiastes, when it was written and all that. The point, though, being Ecclesiastes is taken to represent the fact that late in his life, Solomon found repentance."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6526.25,"end":6527.05,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6527.86,"end":6528.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6528.1,"end":6528.82,"speaker":"Fr Andrew Stephen Damick","text":"That works out."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6528.82,"end":6563.82,"speaker":"Fr Stephen De Young","text":"And so this is why Solomon is not considered a righteous king by the Old Testament and usually designed most icons of the Resurrection. For example, just have Kings David and Josiah as the righteous. But that repentance. Right. You could sin mightily and still be a saint if you repent mightily. Right. And that's what's going on there. Okay."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6563.82,"end":6565.1,"speaker":"Fr Andrew Stephen Damick","text":"So thank you for that."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6565.74,"end":6567.98,"speaker":"Fr Stephen De Young","text":"Yes. Now I won't have to skim those emails."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6569.74,"end":6573.62,"speaker":"Fr Andrew Stephen Damick","text":"I'm sure there's a bunch of people that drop out sometime in the middle of the second half, so maybe you will."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6573.62,"end":6590.58,"speaker":"Fr Stephen De Young","text":"Who will send those emails. Yeah, yeah. Or we're typing it, like during the half. Yeah. And already hit send. Now we'll get the emails about what are you saying about Ecclesiastes? But at any rate. Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6591.3,"end":6593.14,"speaker":"Fr Andrew Stephen Damick","text":"The tabernacle in the New Testament."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6593.38,"end":6607.37,"speaker":"Fr Stephen De Young","text":"Right. So this is important because that idea that the Temple wasn't all that hot. Right. In the Old Testament is further borne out in the New Testament."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6607.76,"end":6615.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. And also why, as you mentioned, the destruction of the Temple by the Romans is not really considered a significant Christian event."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6616.08,"end":6618.92,"speaker":"Fr Stephen De Young","text":"Right. It's not as big of a deal as the Presbyterians want it to be."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6618.92,"end":6621.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6622.64,"end":6678.94,"speaker":"Fr Stephen De Young","text":"So. Right. So part of how we see that is that in the New Testament, when we see reflections on both heavenly worship and Christian worship, we see people talking in terms of the Tabernacle and not the temple. And this begins to be telegraphed even in the attitude we see sort of toward Herod's Temple expressed in the Gospels, the kind of ambivalent Attitude in the Gospel in Acts, I say ambivalent. Right. Both sides. Right. So on one hand, it's not outright rejected by Christ or by the apostles, but it's not fully embraced either. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6679.02,"end":6683.82,"speaker":"Fr Andrew Stephen Damick","text":"No, there's no commandments by them to go to the temple and do X, Y and Z."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6684.3,"end":6726.29,"speaker":"Fr Stephen De Young","text":"We read them doing that, but again, it seems to be sort of a voluntary association kind of thing. Right. And this is not sort of some kind of radical. This ambivalence is not sort of a radical thing in the New Testament. This is pretty common in the Judaisms of the day. Right. So there are lots of forms of Judaism in the Second Temple period that have varying relationships with. With the temple in Jerusalem, Herod's Temple in particular at that time. So there are groups like the group at Qumran, wrote the Dead Sea Scrolls, who rejected Herod's temple completely."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6726.61,"end":6735.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they were doing some kind of rituals out there in the desert to replace it. Is that the idea? Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6735.49,"end":6777.56,"speaker":"Fr Stephen De Young","text":"They had taken certain elements of temple ritual minus the offering of sacrifices, for example, and we're recreating those at Qumran. Right. But they rejected Herod's temple outright. There were other groups similarly, what you see with the Pharisees is a similar kind of ambivalence. Right. So recognition that, yeah, this is the temple, but also the recognition that there's something very wrong. The key signifier of the something wrong being not just the association with Herod, who's, you know, not Jewish."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6779.64,"end":6781.96,"speaker":"Fr Andrew Stephen Damick","text":"Idumean, but."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6781.96,"end":6787.88,"speaker":"Fr Stephen De Young","text":"That the theophanic glory cloud, the presence of God never returns to the temple after it's rebuilt."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6788.52,"end":6788.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6789.32,"end":6797.95,"speaker":"Fr Stephen De Young","text":"That being the key major signifier that something's wrong with it. Right. So then you get this ambivalence."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6797.95,"end":6813.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So like, there's a sense of, okay, well, it. God did not come and, you know, visually descended the temple, we're gonna still use it to worship him because we got to worship him. So. Okay, well."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6813.63,"end":6814.71,"speaker":"Fr Stephen De Young","text":"Yeah, what else do you have?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6814.71,"end":6816.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6816.43,"end":6816.87,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6819.71,"end":6819.87,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6819.87,"end":6831.55,"speaker":"Fr Stephen De Young","text":"And then there's lots of debate as to. Right. So at Qumran, they think that's not correctable. Right. The Pharisees kind of thought that was potentially correctable."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6832.03,"end":6834.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. By everybody keeping the law perfectly. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6835.15,"end":6838.83,"speaker":"Fr Stephen De Young","text":"Keeping the Torah, returning to the Torah, getting rid of those no good Sadducees."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6839.87,"end":6840.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6840.23,"end":6932.12,"speaker":"Fr Stephen De Young","text":"Returning it to the rightful people. That, that when all that happened, then God's presence would return and then things would be right. And that was associated with the coming of the Messiah and all of those things. Right. But there's already also a running theme in the Old Testament that really comes to flower in the Gospels, that at a variety of times, at a variety of periods, God sort of disassociates himself at his presence and his name from the temple, sometimes at least once, even from the tabernacle. And that that presence is then located by means of his spirit indwelling some person or persons. So one of the first examples of this that we see is actually in First Samuel, and it's in the person of the prophet Samuel, who in the early chapters of Samuel, we see Eli and his sons. That the priesthood that's associated with the tabernacle is corrupted. Right, right. And we then read about. And people may not even pause to think about it. Samuel sets up his own altar. Not at the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6932.76,"end":6933.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6933.24,"end":6938.68,"speaker":"Fr Stephen De Young","text":"And offers sacrifices to God there at Naboth."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6939.32,"end":6941.24,"speaker":"Fr Andrew Stephen Damick","text":"That's a. That's a big statement."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6942.2,"end":6961.09,"speaker":"Fr Stephen De Young","text":"Yeah. Where he has a community of prophets living around him. This kind of proto monastic. Right. City of prophets. That's where Saul goes to and rips off all his clothes and flops around on the ground, as we've previously said, when the Spirit sees as him and he prophesies. But the point being."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6961.09,"end":6966.41,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say kind of Israel in exile is sort of the idea, you know, like a government in exile."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6966.57,"end":6977.2,"speaker":"Fr Stephen De Young","text":"Right, right, right. That God's presence has left sort of the official establishment and has gone there. Right. You're gonna see shades of this in Saint Simeon, the New Theologian, by the."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6977.2,"end":6977.44,"speaker":"Fr Andrew Stephen Damick","text":"Way."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":6980,"end":7008.8,"speaker":"Fr Stephen De Young","text":"A couple thousand years later. But so that's. That. That happens. And this happens more than once. Right. We have this thing that looks like a weird detour in the books of first and second Kings, which ostensibly are about the kings. Right. We're going down through the kingly lines describing what the kings did, mostly how wicked they were. And then all of a sudden, we follow the prophets Elijah and Elisha for a long time."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7008.88,"end":7010.8,"speaker":"Fr Andrew Stephen Damick","text":"Who are not down in Judah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7011.52,"end":7012.88,"speaker":"Fr Stephen De Young","text":"Yeah. And who are not kings."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7013.04,"end":7014.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7014.96,"end":7086.97,"speaker":"Fr Stephen De Young","text":"Right. All of a sudden, now we're following that. Why? Well, because especially when you're dealing with, you know, Ahab and Jezebel and they're priests and. Yeah. And the. The religion of the Northern kingdom and the golden calves at Bethel and Dan. Right. That's not the. The king and the priest is not the place where God's presence is. Right. His presence was never at the shrines at Bethel and Dan. Right. So, no, it's with these prophets who are indwelt by the Spirit of God. See, the same thing with Jeremiah as We alluded to earlier. Right. They're putting all their confidence in the fact that this building is here. Right. But God has sort of left the building and is now his spirit is dwelling in Jeremiah. Right. And Jeremiah is now the focus of God's activity. Right. Among his people. And then when we get into the New Testament, then we see this, particularly in St. Luke's Gospel with St. John the Forerunner, whose father is a priest. Right. In the temple in Jerusalem, and who."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7086.97,"end":7094.53,"speaker":"Fr Andrew Stephen Damick","text":"Then gets killed and who for a while, his voice falls silent, which is a kind of literal muting of the priesthood."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7095.25,"end":7104.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And then where does God's presence go? It goes out into the wilderness with St. John. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7104.69,"end":7107.71,"speaker":"Fr Andrew Stephen Damick","text":"The word of the Lord comes to St. John in the wilderness."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7107.71,"end":7127.35,"speaker":"Fr Stephen De Young","text":"Yeah. It's not at the temple. Right. It's now with St. John in the wilderness, where he's bringing together the faithful remnant. Right. And gathering these disciples who he then turns over to Christ, who, as we already talked about, St. John points out, is now the temple. Yep."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7127.35,"end":7132.25,"speaker":"Fr Andrew Stephen Damick","text":"Including my patron saint. He goes from St. John to the Lord."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7132.32,"end":7189.98,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so this idea, right from the beginning, really, from God's ambivalent statement at the time he comes to dwell in Solomon's Temple, there is this idea that God isn't sort of permanently attached to this building, and that this building is, like I said, a condescension, and that it's always problematic. Right. And so this detachment from the building, you know, Ezekiel sees him leave the building. Right. There's firm precedent and idea for it. And so when, by the time that temple is destroyed in AD 70. Right. The reason you don't see anything about it anywhere in the New Testament is, Is because it wasn't a big deal at that point for Christians."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7190.22,"end":7193.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it happens within the scope of the timeline of the New Testament."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7193.98,"end":7196.06,"speaker":"Fr Stephen De Young","text":"Right. They didn't need it anymore."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7196.06,"end":7198.38,"speaker":"Fr Andrew Stephen Damick","text":"Not even mentioned. Right. Not even mentioned."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7200.3,"end":7244.2,"speaker":"Fr Stephen De Young","text":"Right. And so, again, sorry, Presbyterians, but a much bigger deal historically, and this is. I'll just note this once again, for preterists, if you really want to be a preterist, why not A.D. 135, Jerusalem gets destroyed. There's a false Messiah who everybody follows. Like all the stuff is there. Anyway, moving on from picking on predators, and this really comes to fruition. Right. When you look at the end of the Book of Revelation, you look at the new heavens of the earth and it's explicit. There's no temple. Yeah, right. There's no temple. But."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7244.2,"end":7244.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, go ahead."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7244.84,"end":7245.56,"speaker":"Fr Stephen De Young","text":"Yeah, go ahead."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7245.56,"end":7259.64,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say, I Mean, Yeah. What you see in. Maybe I'm just going to state what you were about to say. What you see in Revelation 15, when John the Evangelist sees worship in heaven is not a temple, it's the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7261.08,"end":7261.88,"speaker":"Fr Stephen De Young","text":"Yeah. Literally."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7261.96,"end":7267.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It's always a tent. Worship in heaven always happens in a tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7268.45,"end":7277.89,"speaker":"Fr Stephen De Young","text":"Right, right. It's not just that we're saying, oh, look, it's the incense offering that happened in the tent. Right. If you read Revelation 15, 5, 8. Right. It says tent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7278.05,"end":7325.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly. So, okay, so we're going to read that to you so you can just hear it. This is Revelations, Revelation 5, starting with verse 5. 15. 15, 15, starting with verse 5, through verse 8. After this, I looked, and the sanctuary of the Tent of Witness in heaven was opened. And out of the sanctuary came the seven angels with the seven plagues clothed in pure, bright linen with golden sashes around their chests. And one of the four living creatures gave to the seven angels seven golden bowls full of the wrath of God who lives forever and ever. And the sanctuary was filled with smoke from the glory of God and from his power. And no one could enter the sanctuary until the seven plagues of the seven angels were finished."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7327.65,"end":7339.81,"speaker":"Fr Stephen De Young","text":"Right. So they come out of the tent. Right. That's the heavenly tent, the one that Moses went into, that the earthly one was patterned after. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7341.09,"end":7379.97,"speaker":"Fr Andrew Stephen Damick","text":"As I say, and it's notable what it says there at the end of verse eight, that no one could enter the sanctuary until the seven plagues of the seven angels were finished. I mean, what are the seven plagues? It's them bringing out this incense, this wrath incense that brings the plagues. But, but, you know, knowing what, you know, listener, if you're. If you remember what we said about these things coming out of the holy place in the tabernacle, the point is to enable entrance and says no one could enter the sanctuary until. So the plagues are this kind of incense of purification that's being enacted eschatologically so that people can enter into the holy of holies."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7381.25,"end":7399.3,"speaker":"Fr Stephen De Young","text":"Right, right. To purify the earth so that it can become the sanctuary. Yeah, yeah. And of course, as we already saw in Hebrews and read, Christ is the high priest. Where does he serve as high priest in the tent? Right. In the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7399.3,"end":7400.34,"speaker":"Fr Andrew Stephen Damick","text":"Not in a temple."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7400.74,"end":7420.02,"speaker":"Fr Stephen De Young","text":"Yeah. So with that in mind, as one might expect, when we see early orthodox Christian worship spaces and even contemporary ones, they're patterned after the tabernacle."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7420.42,"end":7435.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, we. We often call them temples because there is a permanence to them, and they're made of stone and so forth. But their pattern is not after, like Solomon's temple or Herod's temple. Right, right, yeah, yeah. It's after the."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7435.81,"end":7437.53,"speaker":"Fr Stephen De Young","text":"Yeah. We don't have any sun God chariots."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7437.53,"end":7442.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yes. No sun God chariots out front that you're offering sacrifices to."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7442.57,"end":7447.53,"speaker":"Fr Stephen De Young","text":"Occasionally a Christmas tree stir the pot. So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7451.17,"end":7454.61,"speaker":"Fr Andrew Stephen Damick","text":"So the emails are being written right now."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7454.77,"end":7466.29,"speaker":"Fr Stephen De Young","text":"Oh, yeah. Oh, yeah. So once again, in talking about. Right. Orthodox Christian worship space, we can sort of start at the outer court and work our way in, just like we."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7466.29,"end":7467.57,"speaker":"Fr Andrew Stephen Damick","text":"Do with the tabernacle. Yes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7467.57,"end":7481.84,"speaker":"Fr Stephen De Young","text":"Right. So if you read those great old King James influence translations of our baptismal liturgics or Quaston, talking about baptism in the church fathers, you find it referred to as the laver of regeneration."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7484.48,"end":7496,"speaker":"Fr Andrew Stephen Damick","text":"And where does baptism normally happen? In the narthex or sometimes a separate building that's kind of near the entrance. But in the narthex is where baptism traditionally happens."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7496.72,"end":7518.55,"speaker":"Fr Stephen De Young","text":"Right. And so this is for entrance and it's the labor of regeneration because again, this fulfillment idea. Right, filled up to overflowing. It's not just washing your hands and washing your feet and having to do that over and over and over and over again. Right. But this is something that happens once for the purification of soul and body."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7518.87,"end":7540.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And then. And then you also have sort of branching out washings that still do occur that are sort of related to this by being a renewal of baptism. So for instance, the clergy, right, when they're done vesting, they wash their hands, but only when they're done vesting to serve the divine Liturgy."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7540.51,"end":7540.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7540.83,"end":7545.99,"speaker":"Fr Andrew Stephen Damick","text":"It's for the. The Eucharist is when they do this hand washing. And then there's also the bishop."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7545.99,"end":7547.59,"speaker":"Fr Stephen De Young","text":"Oh, yeah, the bishop ceremony."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7547.59,"end":7590.31,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yeah, exactly. During the hierarchical liturgy, which. Where that happens right before the great entrance of the gifts. Right, yeah. Because he's about to receive the gifts is what's going on. That's why his hands are being washed, because they're about to be handed to him after the entrance is done. And then, you know, for. For every Christian, there's the tears of repentance that happen in confession, which are understood and very explicitly said in many cases as a renewal of baptism. And, and what is one of the reasons you're going to confession? It's precisely to purify you so that you can then protect, participate in the sacrifice of the Eucharist. So again, you see this washing theme, it's about being able to enter and participate."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7590.87,"end":7601.35,"speaker":"Fr Stephen De Young","text":"Right. Being able to enter in. Right. Because of course, as we've said before, the place where we are, the place where the people are during the service is the holy place."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7601.99,"end":7603.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7603.27,"end":7605.03,"speaker":"Fr Stephen De Young","text":"You're not now outside the building."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7605.51,"end":7611.4,"speaker":"Fr Andrew Stephen Damick","text":"We've entered into the tent. We've entered into the tent. That's what the nave of the church is."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7612.12,"end":7644.77,"speaker":"Fr Stephen De Young","text":"Right. So you're at the place where the priests were, as we talked about in our episode about priesthood. But so then what's the other element that was in the outer court that was related to entrance? That was the altar of burnt offering. Right. It's about purification of sin, restoration of communion, the building of communion with God. Right. Which is also. Right. You're baptized for the remission of sins. That's renewed in confession and absolution. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7645.17,"end":7665.7,"speaker":"Fr Andrew Stephen Damick","text":"And there is even. I say there is even a. Not everywhere does this, but when the tonsure of the hair of the head is done at baptism, in some cases it's placed onto the censor and burnt up as a kind of offering, you know, to. To God. I mean, there's various things that are done with the hair and different traditions, but that's one of them. That's one possibility."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7665.7,"end":7705.64,"speaker":"Fr Stephen De Young","text":"Yeah. So. Yeah. And so this also is. Is related to. To entrance and the. The cleansing and purification of sins. And this is why traditionally, if we go back to the early church, unbaptized people and people who were penitents, people who were repenting but had not yet done the things they needed to do to receive absolution. Right. Because sometimes it's easier to sin than it is to repair the damage we do when we sin."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7706.36,"end":7707.56,"speaker":"Fr Andrew Stephen Damick","text":"Pretty much almost always."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7708.2,"end":7732.93,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. You know that that's why people sin. You don't have to go way out of your way. Right. Those folks would be, for a time, would be penitents. Right. And wouldn't be. It isn't just that they couldn't receive the Eucharist, but they were traditionally, they were kept outside in the equivalent of the narthex."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7733.09,"end":7733.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7734.77,"end":7763.68,"speaker":"Fr Stephen De Young","text":"During that time, they couldn't enter in. Enter in yet. So that. That idea is still preserved there. But that's not the focus. Right? The focus. And this tends to be especially non orthodox people hearing us. Right. They tend to look at the Orthodox Church and focus on exclusion. Right. Like you're saying I can't come receive communion at your church. You're saying I shouldn't even walk in now. Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7763.68,"end":7787.92,"speaker":"Fr Andrew Stephen Damick","text":"No. The point is the way is open and here's how you walk the way. And if you don't want to do that. That's your choice. You've chosen not to do that. But the way is open. There's no one that's ever excluded for their whole lives. And no matter what from the church, there's always a way. There's always a way. They have to be willing to walk."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7787.92,"end":7804.25,"speaker":"Fr Stephen De Young","text":"The way, but there's always a way, Right? So if we think about it in the terms we're talking about it now, that especially doesn't make sense, right? So at the tabernacle, the laver and the altar of burnt offering were not there to exclude people, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7804.89,"end":7807.05,"speaker":"Fr Andrew Stephen Damick","text":"They were the exact opposite, preparing them to come in."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7807.85,"end":7814.65,"speaker":"Fr Stephen De Young","text":"Right. They're the means by which you could be included. They're the means of entry, decontamination chamber."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7814.65,"end":7816.98,"speaker":"Fr Andrew Stephen Damick","text":"To put it in Star Trek terms, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7818.26,"end":7861.07,"speaker":"Fr Stephen De Young","text":"So catechesis and baptism and repentance and all these things, these are the means of entering. These are not barriers of exclusion, right? So then we go to the tabernacle, right? Into the tent, right? The holy place. And the most holy place, right? And, you know, sort of the. The basic daily cycle, and we've said this before, I know of the Orthodox church is vespers and matins, right? The. The kindling of the lamps and the trimming of the lamps, right? That's where incense is offered with prayer, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7861.07,"end":7861.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7861.39,"end":7878.73,"speaker":"Fr Stephen De Young","text":"At sunrise and sunset, right? This is first commandment about worship in the Torah. Right? And to prove. To prove that I'm not totally unfriendly to the Presbyterians, hey, we should worship God the way he told us to by offering him incense at morning and evening."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7879.61,"end":7880.97,"speaker":"Fr Andrew Stephen Damick","text":"Light it up, Presbyterians."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7881.45,"end":7908.41,"speaker":"Fr Stephen De Young","text":"Yeah, so, right, so we see that. We see that pattern. We have the lampstand, right, on the altar, right, with the seven branches. And you see the importance of that in the letters to the seven churches of the Book of Revelation, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7908.41,"end":7920.49,"speaker":"Fr Andrew Stephen Damick","text":"Where you've got the lampstand is lit as an earmark of the local church existing as the church. And if that lampstand gets removed, then that means that's not written really the church anymore, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7920.49,"end":7975.9,"speaker":"Fr Stephen De Young","text":"The threads of the lampstand will be removed. And because it was written after the destruction of the temple where the Arch of Titus had that image of the lampstand being removed from the Jerusalem temple, no longer functioning as a temple, that connects both every individual church as church, as worship space, as microcosm, as place where God is present, but also the reality of it being taken away was something that had happened in Jerusalem. And so it functions in the same way. Remember the lampstand, the seven lights. This is the microcosm. Some churches even have sort of like light blue ceilings in the buildings. And you have the, the dome depicting Christ enthroned in the heavens."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7975.9,"end":7979.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's sometimes stars up there as well in."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":7979.3,"end":8019.5,"speaker":"Fr Stephen De Young","text":"Yeah. The chandeliers. Yeah, yeah. And so the idea is that as the, as the place of worship, liturgically, just like the tabernacle, it becomes a microcosm of, of the entire creation. And just as the bread of the Presence was there to feed the priests during their service. Right. We're now all in that priest position. And so we have, if you go to a Divine Liturgy, we have the antidaron. If you go to a vigil service. Right. Or just a vesper service where there's the Latia and Arto Klesia. Right. There is bread."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8019.58,"end":8029.1,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the point of that bread is, I mean is you're going to be in an all night vigil is the original liturgical purpose of it. So it's like here you're going to need something to eat."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8029.83,"end":8031.67,"speaker":"Fr Stephen De Young","text":"It's strengthening you for the time of your service."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8031.75,"end":8033.07,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. It's exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8033.07,"end":8144.47,"speaker":"Fr Stephen De Young","text":"It's the same purpose. Yes, right. It's God feeding his people. Right. And strengthening them. And we're all in there. So we all get. It's not just about whatever priest happens to be chosen by lot to serve on that day. And then of course, on our altar table, remember what we had in the, the Holy of Holies. Unless you're Ethiopian, you don't actually have an ark of the covenant there, but if you are Ethiopian, you kind of do. But we have. Right, so there's a middle step. Right. Remember we had the ark was taken in procession. We had the two tablets of the covenant. By the time you get to synagogue worship, you have the procession with the Torah scroll. And on our altar tables we have the Gospel book that is resident there at Christ's footstool as the New Covenant, we have the cross. And usually the cross is a, in Eastern churches, Eastern rite churches at least is usually a budding cross. It's called that again because Aaron's rod budded. Right. Life came out from it. Right. And our hypnography has explicit comparisons of the Cross to Aaron's rod that brought forth with new life. And we keep in what is called the tabernacle on the altar, the Eucharist. Right. Because as Christ said, he's the bread that came down from heaven."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8145.43,"end":8145.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8145.83,"end":8150.35,"speaker":"Fr Stephen De Young","text":"I mean, talking about manna, John outright says that. Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8150.35,"end":8152.95,"speaker":"Fr Andrew Stephen Damick","text":"I am. Yeah, right, right. Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8153.67,"end":8212.26,"speaker":"Fr Stephen De Young","text":"Right. And so we have these. This actual space. Right. That is sacred space, and which contains these objects, these items which are holy and sacred objects. And this concept, we've broached this a few times before in different ways. But this concept, I know, is difficult for sort of modern, materialist kind of folks. Right. And some of those folks. Right. Sometimes will try to enlist certain things said by St. Paul to argue against the idea of particular sacred objects in particular sacred spaces and to sort of argue that every day is exactly the same."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8212.42,"end":8272.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So the passages that they would use for that, there's Romans 14:5, in which St. Paul says, One person esteems one day as better than another, while another esteems all days alike. Each one should be fully convinced in his own mind. And so people look at that and say, well, St. Paul is basically saying that feast days are not a thing and should not be a thing. Right. That's the way that that gets read. And then similarly, Colossians 2, 16, 17, therefore, let no one pass judgment on you in questions of food and drink, or with regard to a festival or a new moon or a Sabbath. These are a shadow of the things to come, but the substance belongs to Christ. And so then the interpretation would be, all of those feast days and stuff we had in the Old Testament, those were just a shadow, and that's over now. So we don't do that anymore. There's no more feast days because now we're Christians and Christ has come. So that's kind of the reading of those. Those two verses in that context. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8272.28,"end":8285.96,"speaker":"Fr Stephen De Young","text":"Right. So there aren't sacred times, there aren't sacred places, there aren't sacred objects. Right. Everything's the same. It's just material. Right. And that resonates very well with our modern secular culture."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8288.52,"end":8288.92,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8292.28,"end":8294.76,"speaker":"Fr Stephen De Young","text":"Is not what St. Paul is saying. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8295,"end":8299.79,"speaker":"Fr Andrew Stephen Damick","text":"Because I was gonna say. And is not what you actually see early Christians doing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8300.43,"end":8301.47,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8301.47,"end":8301.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8302.35,"end":8315.55,"speaker":"Fr Stephen De Young","text":"So the idea of that reading would then be that when St. Paul says, you know, treat every day the same, or treat every object, treat every place the same, what he means is that you shouldn't honor the Sabbath."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8316.43,"end":8319.63,"speaker":"Fr Andrew Stephen Damick","text":"He's not saying that you shouldn't treat."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8320.03,"end":8325.71,"speaker":"Fr Stephen De Young","text":"A church building as a sacred place or the temple in Jerusalem, say that St. Paul used to visit."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8328.27,"end":8343.31,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say the problem. The problem is that, you know, often what people will say is, well, everything is holy. And. And. But the problem is then when people say that, what they mean by it in terms of actual practical application is that nothing is holy."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8344.03,"end":8346.67,"speaker":"Fr Stephen De Young","text":"Right. If everybody is Special. Nobody is special."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8347.07,"end":8347.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8348.35,"end":8358.14,"speaker":"Fr Stephen De Young","text":"Sorry, Millennials. That was a cheap shot. That was even. I think that was a cheap shot. I know you treasure your participation trophies. It's okay."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8358.7,"end":8363.02,"speaker":"Fr Andrew Stephen Damick","text":"But, you know this is like 50% of our audience, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8363.18,"end":8366.3,"speaker":"Fr Stephen De Young","text":"I know, I know. I'm out of control."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8367.58,"end":8368.5,"speaker":"Fr Andrew Stephen Damick","text":"He's a wild man."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8368.5,"end":8369.3,"speaker":"Fr Stephen De Young","text":"I can't stop him."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8369.3,"end":8369.74,"speaker":"Fr Andrew Stephen Damick","text":"Everybody."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8369.74,"end":8473.31,"speaker":"Fr Stephen De Young","text":"That's a stereotype. But. No, but. Yeah, so. So, yeah, if everything is special, nothing is special. Right. If everything is great, nothing is great. Right, right. And so St. Paul wasn't saying either of those things. He wasn't saying nothing is sacred, and he wasn't saying everything is sacred. He's saying everything is potentially sacred. Right. Every space is potentially sacred space. Every time is potentially sacred time. Every object is potentially a sacred object. Right. It has that. That potential. So the person who treats every day the same is the person who is able to treat every day like the Sabbath. The person who treats his home as just as holy as the church doesn't do that by degrading how he treats the church. He does that by elevating how he treats his home to being a small church. Right. So that's what St. Paul is getting at there. Right. And so we have particular sacred times and sacred places and sacred objects to teach us how to do that. So if we learn how to respect our church sanctuary, then that teaches us how to treat a place as holy, and we can then apply that to other places. Places. Right. And likewise with objects, with things. Right. Times. And so he's pointing to that potential, not a reality on either side."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8473.39,"end":8486.97,"speaker":"Fr Andrew Stephen Damick","text":"Well, and even again, you know, when we see worship conducted in heaven, there is still this kind of demarcation of spaces going on. You know, there is a holiest place that things are coming out from."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8487.93,"end":8488.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8488.49,"end":8507.49,"speaker":"Fr Andrew Stephen Damick","text":"So. So, I mean, it's not by any means saying that. That the. The age to come, that the kingdom of God is unholy in any way, but there is clearly still a hierarchy within it. You know, that still is happening. There's. There's still spaces that are kind of better than others in. In that. In that sense."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8507.49,"end":8508.57,"speaker":"Fr Stephen De Young","text":"Well, or. Or different."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8508.57,"end":8559.21,"speaker":"Fr Andrew Stephen Damick","text":"Or different. Yeah. Set aside for a particular purpose. Yeah. See, I think that's one of the things you can tell just by the way I said that. I think that's one of the things that a lot of modern people, when they hear the word holy, what they understand by it is to mean better than. But it's interesting if you read, for instance, we've made mention of a lot of the laws and stuff. In Exodus and Leviticus and Numbers, you'll hear this refrain over and over again about something being sanctified. Sanctified. Sanctified. Sanctified. And it's very clear in context that what that means is set apart for a particular purpose. Because there's some cases in which where sanctified is used that it would not make any sense to mean something is better than or is kind of shining with mystical light or whatever we mean by holy or sanctified, that it just means simply separated, separated out."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8559.93,"end":8584.09,"speaker":"Fr Stephen De Young","text":"We've got Plato brain. And so we bring, we bring like good and evil into our ontology in weird ways. Right. So like we're human. Okay. We all have to go to the bathroom somewhere. We don't do that in a holy place. Right, Right. We do that in a place set aside for that purpose."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8584.09,"end":8584.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8584.53,"end":8587.09,"speaker":"Fr Stephen De Young","text":"But the bathroom is not like evil."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8587.49,"end":8587.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8591.98,"end":8596.38,"speaker":"Fr Stephen De Young","text":"It's a necessary thing performing a necessary function. Hopefully you keep it clean and you."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8596.38,"end":8597.98,"speaker":"Fr Andrew Stephen Damick","text":"Don'T put your icon corner in there."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8598.38,"end":8598.78,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8599.42,"end":8600.62,"speaker":"Fr Andrew Stephen Damick","text":"That's just not what you would do."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8600.7,"end":8627.05,"speaker":"Fr Stephen De Young","text":"Right. But it's not because it's evil. It's because that's not its purpose. Right. So one of the things, though, with Christian worship spaces in particular is that they have since the very beginning been made holy not just by this is the place we're going to set aside."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8627.05,"end":8627.77,"speaker":"Fr Andrew Stephen Damick","text":"For worship."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8629.85,"end":8640.41,"speaker":"Fr Stephen De Young","text":"But because they are built surrounding a particular thing. And that is the relics of saints originally, specifically martyrs."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8641.52,"end":8642.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8643.6,"end":8654.32,"speaker":"Fr Stephen De Young","text":"And this is something that a lot of our friends and listeners probably are really uncomfortable with. Even some of the orthodox ones. Probably."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8654.4,"end":8684.2,"speaker":"Fr Andrew Stephen Damick","text":"It's true. I mean, I get a little. Right. A little, ooh, doubt. Yeah. And you know, like, how do we know that this was the case early, early on? Well, there are testimonies about worship happening in the catacombs in Rome. And what are catacombs? It's not just hidden away places. They specifically were performing the Divine Liturgy on top of the grave of a martyr who was buried down in there. Right. So that is going on."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8685.56,"end":8690.6,"speaker":"Fr Stephen De Young","text":"Yeah. St. Jerome just said as a summary statement, the graves of the martyrs are altars to Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8691.72,"end":8693.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. Not that they make handy spots."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8695.7,"end":8698.02,"speaker":"Fr Stephen De Young","text":"That's where you should build one. But they are."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8698.42,"end":8701.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. By virtue of being the grave of a martyr, it's an altar to Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8702.26,"end":8719.7,"speaker":"Fr Stephen De Young","text":"Right. And that understanding develops out of what we've been talking about in this third half. Right. That what's serving now as a temple. Right. When God separates himself from the building. Right. For the tabernacle from the temple."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8720.31,"end":8720.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8720.47,"end":8782.69,"speaker":"Fr Stephen De Young","text":"He comes to dwell within the saints. Right? The Holy Spirit. Holy Spirit dwelling within Elijah, Elisha, Samuel, St. John the Forerunner. Right? And so that is the place. That is the place of God's presence and the righteous. Right. Part of being a saint, part of being righteous, right. Is that as St. Paul says, you offer, your members become the members of Christ. As we just heard in the epistle yesterday as we're recording this, our members become the members of Christ. When the Holy Spirit dwells within us, our body becomes the body of Christ through which he acts. Meaning body of God. Right. That imaging function, but that's transformative of the human person. It doesn't just transform their soul and make their soul like an angel."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8784.53,"end":8784.93,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8785.09,"end":8820.71,"speaker":"Fr Stephen De Young","text":"Right. A soul is not a thing. It's not a sphere, like origin thought. It's not this eternal immortal thing. Right. A soul is your life, right. It's what makes your body alive. And so when it leaves, when your life leaves the body, the body dies, it decomposes. We believe our life is hidden with Christ and Christ returns our life to the body. Right? But the body is still the person, Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8820.71,"end":8830.21,"speaker":"Fr Andrew Stephen Damick","text":"It still belongs to that person. I mean, for a lot more on this, see our episodes about bodies and then also see our episode about relics. We did all that stuff."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8831.01,"end":8898.74,"speaker":"Fr Stephen De Young","text":"And so that is why that body of the saint is associated with a worship space, right? So, Elisha, his body doesn't stop being that. That's why when they throw a corpse into his tomb, it rises from the dead. Right? And so Christians understood this innately from the beginning and just started doing it. And this became, to pagans, outsiders, right? This is what Christians did. Right. This is what Christians do. Okay? Now, right now, if I went to the average person in the us, Christian or not, right? And I said, here's what Christians do. They parade around with and pray at and offer sacrifices at the bodies of a bunch of dead people. The average American Christian or not, would look at me like I was insane. Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8898.9,"end":8899.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8899.22,"end":8900.18,"speaker":"Fr Stephen De Young","text":"They'd be like, what?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8900.9,"end":8901.54,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8902.02,"end":8923.45,"speaker":"Fr Stephen De Young","text":"I think I saw them doing some Catholics doing some stuff like that in Mexico. But what are you talking about? Right? Like they would not, you know. Right. I didn't have that at all. But what do we find in the 4th century when we look at what pagans said Christianity was all about?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8923.69,"end":8924.33,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8924.33,"end":8924.65,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8924.73,"end":8937.92,"speaker":"Fr Andrew Stephen Damick","text":"So we've got, we've got a couple of quotes here, and these are amazing. So one is from Julian the Apostate. So he's not just some random pagan, he's an ex Christian."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8938.64,"end":8941.2,"speaker":"Fr Stephen De Young","text":"Yes. Nephew of Constantine."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8941.2,"end":8945.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Bringing back. And wasn't he like a classmate with."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8948.24,"end":8951.04,"speaker":"Fr Stephen De Young","text":"St. Gregory the Theologian, St. Basil?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":8951.36,"end":9002.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, so he becomes the emperor of Rome and he's trying to bring back paganism and he hates Christianity and so he's going to say the worst possible things about it, but he's not going to say stuff that people don't acknowledge as being true because they can see themselves what it is that Christians are doing. And this is what Julian the apostate said about what Christianity is about the carrying of the corpses of the dead through a great assembly of people in the midst of dense crowds, staining the eyesight of all with illustration ill omened sights of the dead. What day so touched with death could be lucky? How after being present at such ceremonies, could anyone approach the gods and their temples? So he's ridiculing Christians and saying, look at what they do. They carry the bones of people around."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9004.12,"end":9007.4,"speaker":"Fr Stephen De Young","text":"And like, oh yeah, it's a bad omen."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9007.48,"end":9008.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's so gross."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9009.32,"end":9010.28,"speaker":"Fr Stephen De Young","text":"It corrupts you."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9010.28,"end":9010.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9011.22,"end":9021.7,"speaker":"Fr Stephen De Young","text":"And notice Protestant friends, this is an actual pagan. He doesn't say, oh, all that saint stuff, praying to saints. That's just what we pagans do. That's the same thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9021.7,"end":9023.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's saying this is really bad."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9023.78,"end":9025.86,"speaker":"Fr Stephen De Young","text":"He doesn't seem to think it's the same thing at all."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9026.18,"end":9026.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9027.22,"end":9029.06,"speaker":"Fr Stephen De Young","text":"And he should know, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9029.06,"end":9036.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he would totally know because he's been Christian. He was raised Christian and then became pagan and favors paganism."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9037.72,"end":9038.12,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9039.08,"end":9079.63,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we've got another one from Evnapius of Sardis again from the 4th century. He's pagan, complaining about Christians for they collected the bones and skulls of criminals who had been put to death for numerous crimes, made them out to be gods and thought that they became better by defiling themselves at their graves. Martyrs, the dead men were called, and ministers of a sort and ambassadors with the gods to carry men's prayers. So once again. And of course, you know, you see other elements in here. Right. Like, you know, of course he's saying these are criminals. Why are they venerated criminals?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9079.63,"end":9082.59,"speaker":"Fr Stephen De Young","text":"You know, they were executed as criminals by the Roman government."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9082.83,"end":9139.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. Made them out to be gods. Right. So his understanding of Christianity is that it's about theoses thought that they became better by defiling themselves at their graves. He sees Christ Christians making pilgrimage to the graves of martyrs. He calls them martyrs. They're called martyrs. The dead men were called and ministers. He sees them as priests, that the Christians are talking about them as priests and ambassadors with the gods to carry men's prayers that people are addressing requests to these criminals and they're carrying them to God. And they're carrying them to God. This is a pagan making fun of Christianity in the fourth century. And he basically is talking about the veneration of the relics and the memories of martyrs and the understanding that martyrs will pass on the prayers of Christians to God. Which, I mean, we could just point out that we see that in the book of Revelation."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9139.98,"end":9226.09,"speaker":"Fr Stephen De Young","text":"Right, yeah. And it's practically happening in the early church in this way. Right. And is the common. Right. This is what Christianity is about for him. And Evnapoulos is not only a pagan, but he's a Neoplatonist. So he wrote the sort of biographies of famous philosophers, basically following Neoplatonism. And it's actually one of the best sources on the lives of these philosophers. So his text was actually preserved in the church. But he's constantly issuing anti Christian attacks like this. Right. He hated Christianity. And so Saint Photius the Great in the 9th century said that he also had possession in addition to the original of another version of his writings that had all the anti Christian stuff edited out. Because by that point everybody was a Christian and they weren't big fans. So notice folks who want to say that, oh, well, the fourth century church, all those saints, the council dynamics, they're just taking Neoplatonism and Greek philosophy and distorting Christianity with it. Okay. This is a 4th century Neoplatonist and pagan. He doesn't think that we're doing the same thing."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9226.41,"end":9226.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9227.21,"end":9228.33,"speaker":"Fr Stephen De Young","text":"And he should know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9228.49,"end":9230.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. If anyone would know."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9230.09,"end":9232.93,"speaker":"Fr Stephen De Young","text":"Right, yeah. He thinks it's radically different and it's interesting."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9232.93,"end":9249.62,"speaker":"Fr Andrew Stephen Damick","text":"You know, again, you know, part of what offends these pagans so much is this is kind of an inversion of pagan virtue. Right. Because it's humility and martyrdom that are elevated in Christianity, whereas for pagans that. No, no, no, you know, paganism does not work that way. That's."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9249.62,"end":9251.46,"speaker":"Fr Stephen De Young","text":"Why would you want to become like that person?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9251.86,"end":9255.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like he's executed like a criminal. Hello. Total low life."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9256.66,"end":9266.98,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yeah. So this is. This is. Yeah. And so they, they can't comprehend. And not to mention, you know, they're not big fans of the body in general."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9267.7,"end":9269.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9269.58,"end":9274.98,"speaker":"Fr Stephen De Young","text":"It's all about escaping the body. Right. Remember St. Paul in Athens getting laughed at when he talked about the resurrection."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9275.31,"end":9275.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9277.07,"end":9336.5,"speaker":"Fr Stephen De Young","text":"This is ridiculous to them. Right. So how much more triply ridiculous would it be to parade around and honor some bones? Right. Like this. This makes 00 sense to them. Right. And so part of. So that. Why. Right, why? If this was the impression on the ground at the time, why do people today draw what seems to them to be easy connections between the veneration of the saints and polytheism or between early Christian theology and Neoplatonism? Right. If it was completely not obvious at the time, Right. Why does it seem so? And part of it is because we've kind of got Protestant brain, even if we're not Protestants. And so we think of Christianity as a set of beliefs."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9338.02,"end":9338.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9338.98,"end":9390.52,"speaker":"Fr Stephen De Young","text":"We think of Christianity as a set of things that you hold to be true, sort of logical propositions that you hold to be true. And so these comparisons are made by, well, what is the veneration of saints? Well, it's a system of beliefs. Right, Right. And so we line up what those beliefs would be. We then line up, well, what do pagan polytheists believe? As if pagan religion had anything to do with quote unquote beliefs. Right. And believing in faith. Right. There were no sola fide pagans, Okay. I assure you of that. Right. And we try to line up those beliefs and compare and contrast, and they kind of look similar when we, when we draw them out. Same thing with Neoplatonism. Right. But that's not how Neoplatonism or paganism or Christianity worked in the ancient world. They were not systems of belief. They were ways of life that were made up of practices."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9391,"end":9447.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, you can even see this, like in the text of the ecumenical councils. Right. Certainly they have like statements of dogma. But you know, within all of that as well is a huge amount of text that are aimed at the ways things are done. Right. It's not just. They're not just sort of regulatory. I know sometimes we call them like disciplinary whatever, which is fine. I mean, I think that's an okay language. But we have to understand that this is so central, that the ways things are done are so central that the canonical penalties that attach to them are things like being deposed from the priesthood or excommunication. Right. You know, that's what's really attached. It's not just, here's some things that we say and everybody has to agree to this. And indeed, what is a heretic according to an ecumenical council? It's not just someone who thinks certain."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9447.39,"end":9450.59,"speaker":"Fr Stephen De Young","text":"Things has a bad idea is wrong."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9450.59,"end":9465.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. It's a teacher of those things. In other words, you're teaching people to do and to say this other way, way. Yeah, yeah. It's not thought crime there's no thought crime in an ecumenical council."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9465.79,"end":9471.47,"speaker":"Fr Stephen De Young","text":"The original meaning of the word heresy is a sect, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9472.03,"end":9472.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9472.83,"end":9545.36,"speaker":"Fr Stephen De Young","text":"It's an actual sectarian. Yes. You're a different group with a different way of life. Because this also isn't. It's not just that it's not beliefs, it's not individual belief, right? We post Protestant Reformation modern world think of ourselves primarily as individuals, right? We're not talking about individuals, we're talking about the way of life of a community. The Christians in a city live their life in a particular way as a community, right? That's what the pagans saw. That's what in those quotes they're critiquing. They're not critiquing what individuals believe. They're critiquing what the Christians as a community do, how they conduct their life, how they worship, what they practice together their way of life, right? And so a heretic is someone, you know, like your arch heretic, like Arius or someone is someone who draws a following off after themselves that establishes another way of life, right? Another community. That's the problem, right? Just being in the church and being wrong about things, guess what? That's everybody, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9545.52,"end":9547.92,"speaker":"Fr Andrew Stephen Damick","text":"We're all wrong in one way or another, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9548.56,"end":9634.44,"speaker":"Fr Stephen De Young","text":"None of us has perfect. The most of us haven't even worked out. Most of us don't even have an opinion on most areas of theology, right? I could find one obscure enough that you haven't even heard of, right? And you might be able to come up with a page. But that's got nothing to do with what Christianity is. Is. Right? That's sometimes how we teach it. That's sometimes how we do catechesis, even in the Orthodox Church, right? Is I'm going to teach you a bunch of things you should believe instead of the things you used to believe. But that's not what Christianity is, right? That's not what it. And it's definitely not what it was in the ancient world. And so that's why we get these kind of false results and see these false similarities, right? Because the veneration of the saints is not a set of like belief propositions, right? It's something that was practiced by the earliest Christians, right. It was observable, therefore, by these outsiders. And this really gets to. This in particular gets to the core of what it means to believe in the resurrection of the dead, right? Because we tend to treat that as well, we believe that someday Jesus will return and everybody will be alive again in their body, which is not wrong, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9634.44,"end":9635.16,"speaker":"Fr Andrew Stephen Damick","text":"But right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9635.16,"end":9695.66,"speaker":"Fr Stephen De Young","text":"That is a true statement. Yeah, but. And hopefully you hold to that because that's not even clear with a lot of people. Unfortunately now in modern Christianity, a lot of people just talk about going to heaven forever and stuff, which is not it. Right. But belief in the resurrection goes a lot farther than that because there's this element of resurrection that we see in Christ's resurrection. This gets brought out in Romans, it gets brought out in The Epistle of St. James of Vindication. It's brought out in a lot of our orthodox hypnography, right? Christ died condemned as a criminal. And when he rose from the dead, that was the vindication of him, of his claims to be the Messiah, of his claims about who he was. Vindication over against the slander that was leveled against him by others that ended in his death, Right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9695.81,"end":9696.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9697.57,"end":9706.05,"speaker":"Fr Stephen De Young","text":"And this is true, as you can see in those quotes, also of the martyrs, also of the righteous, right?"}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9706.05,"end":9707.25,"speaker":"Fr Andrew Stephen Damick","text":"They get treated just like Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9707.89,"end":9846.72,"speaker":"Fr Stephen De Young","text":"The righteous are persecuted, right? The righteous suffer in this world. The righteous are falsely accused. The righteous, in the case of the martyrs, were condemned to death as criminals, right? And their resurrection is the vindication that no, that's not who they are. Because when Christ appears, they appear with him and they are still alive and they are reigning in glory with him. Right? All of this is entailed and Christ says as much when he critiques the Sadducees, right? About the resurrection of the dead. He doesn't say, you're wrong. On the last day everyone is going to be raised from the dead bodily. He says, God says, I am the God of Abraham, Isaac and Jacob. He said that to Moses, right? He says, God is not the God of the dead, but of the living. So Christ's answer to what it means to believe in the resurrection of the dead means that you believe that those righteous are not dead, but are alive and what are they doing that they are with God, that they are the pillars. So this idea of theosis, of the saints co reigning of them serving as priests, ministers and ambassadors, as our pagan friend said, them serving as priests and co rulers of Christ, if you don't have that, you don't really have belief in the resurrection of the dead, right? Not in the sense that the scriptures mean it. I mean, Christ disambiguates that by Lazarus grave. He says to Martha, do you believe in the resurrection? She says, I believe that they'll be raised up on the last day, right? And Christ doesn't say, right, good. He says, I am the resurrection and the life and he who Believes in me will never die. Not. You'll die and eventually you'll come back to life. Yeah. Right."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9846.72,"end":9852.8,"speaker":"Fr Andrew Stephen Damick","text":"So Lazarus is not really, you know, Lazarus, in as much as he's in Christ, is not dead."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9853.7,"end":9856.1,"speaker":"Fr Stephen De Young","text":"Right? That's what he's telling her. Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9856.74,"end":9888.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so, I mean, then, like, one of the conclusions to that is that what sanctifies a church temple relics is. Is therefore a testimony to the resurrection of the dead. Because we're, you know, the. The church temple, you know, our own sort of local instantiation of the tabernacle, right. Becomes what it is because you have the presence of someone who. Whose body has become the body of God, the body of Christ."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9889.47,"end":9898.59,"speaker":"Fr Stephen De Young","text":"Right. The space they occupy is holy space because they occupy it in the same way that Moses had to take his shoes off next to the burning bush."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9898.59,"end":9899.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9899.55,"end":9900.03,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9901.47,"end":9918.32,"speaker":"Fr Andrew Stephen Damick","text":"So to wrap up this episode, you know, we've been talking about the tabernacle. Where does it come from? What is it patterned off of? It's patterned off of the tent of God on the holy mountain paradise where he."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9918.64,"end":9919.04,"speaker":"Fr Stephen De Young","text":"He."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":9919.12,"end":10406.95,"speaker":"Fr Andrew Stephen Damick","text":"He dwells with the sons of God. Right. Those who are with him. And, you know, we extended that out now in this. The third half, where we talked about how that applies now to the church within the New Testament, within the period that we're now in. And, you know, one of the things that Father Stephen mentioned here at the end was that Christianity is not defined in the ancient world in terms of being simply a list of beliefs. There are beliefs, for sure, right? There are beliefs. But I think that as modern people, we tend to think of belief. And here I am, I'm saying, think of belief, right? So I'm expressing the language with. With this modern way of thinking. We are modern people, we tend to think of belief as the thing that makes you really a Christian or that makes you really whatever it is you are, like if you believe it truly. And so, I mean, one of the experiences that I've had in ministry in the church is that a lot of times people have a crisis or struggle within themselves. Do I believe hard enough? Do I trust hard enough? Right. Can I really forgive that person? And by that they mean become convinced in my mind not to, that what they did doesn't matter or something like that. And so it becomes this kind of mental thing, right? Which, I mean, it's understandable because that's what defines so much of our modern world. I get it. I understand why people feel that way, why they think that way. Right. But in Christianity, traditionally and in orthodox Christianity, the Question is not do I believe hard enough, or do I think the right things, or do I have the right opinions? But am I faithful? Am I practicing this faith? Right? It's based on what you do. There is Christian doctrine, there is Christian worldview, but it's based on what you do. It's not the other way around. We tend in our time to think, I need to be convinced of something, and therefore I will be. I will act on the basis of that. But Christianity is actually. It goes the other way. It goes the other way that. That what we believe is based on what we do. Now, often in the modern world, we need to explain things to help people engage in faithfulness. The whole point of catechesis is to teach people how to be faithful, to show them how to be faithful, right? But it's not about trying to convince them that certain things are true so that then they can make the decision to be faithful. If you come to the church to be baptized, you are convinced already, right? So the question of catechesis is, how do you be faithful? And, you know, connected to this, then of course, is a very famous line, James 2:18, where St. James is talking about this relationship between faith and works. And if we understand faith really as faithfulness, then this makes more sense. He says this, but someone will say, you have faith and I have works. Show me your faith apart from your works, and I will show you my faith by my works. In other words, he's saying that faithfulness, real faith, is about what you do. It's about what you do. That there is no. They cannot be. You know, they don't exist apart. They're not separated. So how does this relate to what we've said about sacred space, the tabernacle, the church as related to the tabernacle? You know, an ancient Israelite knows what he's supposed to do in regards to the tabernacle. It's all very clearly laid out for him, right? In the Scriptures. It's been taught to him. He knows what he's supposed to do. God has said it to him. God told him that through Moses, right? We as Christians have received the teaching for what we are supposed to do. We know what we need to do to be faithful, right? We need to be engaged in the worship of God in our local instantiation of the tabernacle, that is to say, our parish church. But it's not just in that place. It's also, as it extends into our homes as well, right? With prayer at home, with all of these things going on, so that the Home itself becomes an extension of the church, that the church is expressed in the home. Sometimes people will say things like, well, I can worship God on my own, or that kind of thing. It's like, well, what you're saying is somewhat true, right? It's not that you. You cannot talk to God in any place. You can talk to God in any place. But we also know that he said, do this as my remembrance. And he showed us how to do the Eucharist. He did not say, here's one option for how you could maybe worship me, you know, if you're feeling traditional. He doesn't say that. He says, do this. There's a lot of very clear commandments, and it says in Scripture, if you love me, you will keep my commandments. Not if you love me, you can pick which commandments of mine you like, emphasize those and that'll be fine. He says, if you love me, keep my commandments. That's stated many times in Scripture in various ways. Many, many times. Right? And so, you know, in ancient Israel, they're traveling with a tabernacle. They're setting it up, they camp around it. It's the very center of their life. If some ancient Israelite said, you know what? I don't need to go to the tabernacle. I don't need to offer the sacrifices. I don't need to do these things, even if I've sinned, I don't have to do that stuff because, you know, I can worship God in my own way. No, you cannot. Does that mean he can't pray in his own tent? Of course he can pray in his own tent. Of course. But he's also been given very specific commandments from God as to the tabernacle and how to relate to it, just as we have been given specific commandments by God with regards to the church, how to relate to it, what we're supposed to do. This is what the tradition of the church is about, is about these acts of faithfulness. And so I think one of the great values in understanding what the tabernacle is about and how our church is now the tabernacle is that it gives us something very clear to look at and say, this is what I needed to do. This is what it means to be a faithful Christian. Not just my Christian identity, how I think of myself as a Christian, but a faithful Christian. Because an unfaithful Christian is not a Christian. Not really. Right. It's those who are faithful who are truly in Christ. And faithfulness is something that we can see clearly and latch onto and understand that we're doing it without a lot of psychological guessing games. We don't need to do that. We just, are you doing the things? Here's what the things are. And even if you don't, as Father Stevens said, even if you don't have the correct opinion about every piece of theology, because, I mean, we don't, we all don't, that's not what makes you faithful. Now, if you latch on to an incorrect opinion and really pursue it and step away from the church as a result of that, that is what heresy is, and that's why it's a problem. But the point is to be faithful. And this is why even small children can be faithful. This is why people without theological degrees can be faithful. You know, this, this is why faithfulness is possible for every single human person. And so I, I, this is a, to me, is a profound lens through which to understand the Christian life and, and something that, that even people without a lot of theological education, even people without interest in listening to weird Bible podcasts like this one, can still connect with and still do the things, even if they are theologically ignorant or whatever it might be. So, Father Stephen."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10410.63,"end":10907.43,"speaker":"Fr Stephen De Young","text":"So as we talked about with the whole issue between the tabernacle and the Temple, there's a strong theme throughout the scriptures, not just in the old Testament, because St. Peter continues it in the New Testament, that the people of God, those who are seeking to be faithful to God, to follow Christ, can't do that by settling in, in this world or any of its cultures or any of its places at any time. We've mostly lost sight of that in the modern world, other than our persecuted brothers and sisters in Christ who are living under situations of persecution. Those of us, probably most of the people listening to this, since we broadcast in English, are living in places that are not that. We're living in places where we've been been allowed to, and allowed ourselves to become very comfortable and very settled. And we make a lot of excuses for this. We'll say, well, I'm in a culture that's, you know, a Christian culture, or at least historically was deeply influenced by Christianity. Well, you know, ancient Israel was a Yahwist culture. Ancient Judah was a Yahwist culture. Judea, when Christ came and lived and was killed, and St. John the Forerunner came and lived and was killed, was a culture that was worshiping Yahweh, the God of Israel. That doesn't give you the license to settle down. That doesn't mean that the culture, the society the people and their will is on the right track just because they profess or identify themselves as being of the true religion in some sense. And we see this most of all in the fact that there's at least at present, and things can change very quickly, but at least at present, there's not a lot of risk of us becoming martyrs. Very low. And in fact, we spend a lot of our time and a lot of our effort in these societies trying to prevent ourselves from suffering any kind of even vague persecution as Christians for Christianity, for our Christian faith. Here's the problem. I've said this once before in sort of a final thought, but if, if Christianity isn't revolutionary, then it's nothing. Anything that we call Christianity that fits very neatly into this world at any point in time, in any place is not real Christianity. If there's a political party in your country that you fit into very neatly, there's a problem with your ideology. If there's a cultural movement that you fit into very neatly, there's a problem with your ideology. If you're able to go about your daily life, your work life, your school life, and you go about it in the same way that you're atheist or other religion co workers do, there's a problem with how you're living your work life or your school life. Now, this isn't to say that our goal as Christians should be to go around and offend people, right? That's easy. Talk is. Talk is cheap. So we could go around and say rude things and judgmental things and go around and condemn people and get them to hate us and then pat ourselves on the back and say, ah, see, I'm being persecuted for the sake of crazy Christ, right? I'm doing it, right? That's not what I'm getting at. Because that's not what the martyrs did. That's not what Christ did, that's not what the prophets did. What they did was they lived a way of life, that way of life that is now real Christianity. They lived a way of life that was so radically out of step with what the world values, what it sees as good, what it sees as productive, what those in power wanted them to live so radically out of step that those powers of the world wanted them dead, wanted them destroyed, wanted them stopped, right? This happened with the prophet Elijah, this happened with the prophet Elisha, this happened with the prophet Jeremiah. Pretty much everyone we talked about in this episode, this happened with. And so this isn't something that begins by us imagining a perfect Christian society, because just like the Temple. We aren't given a blueprint for that in the Scriptures. We really aren't. That's not what the Torah is, by the way. We're not given a blueprint for. This is what society is. And so I'm going to go out and try and force it to be that. What we're given a blueprint for is what each of our lives should look like. And so it starts with each of us. It starts with me, for me. It starts with me calling myself to repentance, me finding the places where I'm very comfortable, where I see things pretty much the same way non Christians do, looking at the same thing. The places where I've been formed by my time and place and culture, and not by Christ and finding those and repenting of them myself. And repenting not by changing my mind, changing my opinion, but by, as we've been saying, by changing how I live, changing how I talk, changing how I act toward others, changing how I present myself, changing all of those things about myself and bringing them into line with Christ and who he is and how he lives. And the promise that we have in Scripture is that if we get serious about that and we start doing that, that's when people will really start to hate us. And not just people out in the world, not just, oh, you know, the angry atheist on the Internet. No, that's when other people in the Christian church are going to start hating us. That's when everyone is going to start hating us. Because Christ has promised that. Because that's how the prophets were treated before us. That's how he was treated. And a servant is not greater than his master. And so this is the mark of real Christianity when we're actually living it. Real Christianity when we're actually living it, means living in a way that is not designed to give offense to anyone, but that anyone who is in and of the world is going to find deeply offensive. Living our life in a way where we don't judge anyone, but just the way we live. Those people who are not following Christ feel judged by it. That's the mark of a real Christian. That's what marked out when we read the lives of the saints and the martyrs, that's what we see. And so when we remember them, when we talk about them tonight, when we talk about what this kind of holiness means and what God wants us to learn from having his meeting place be in a tent and not a permanent building, it means that we need to live in a way that this world is not our home. We don't fit in. Not because we're trying not to fit in, but because we're following Christ so intently that we don't notice how far out of step we are with those who aren't."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10908.63,"end":10935.98,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for today. Thank you very much everyone for listening. If you didn't get a chance to call in during a previous live broadcast, this one was not live. We would still love to hear from you either via email@lordofspiritsancientfaith.com you can message us. Also at our Lord of Spirits podcast Facebook page, I read everything. Father Stephen skims some things, but we can't respond to everything. We do respond once in a while, but we do save a lot of it for possible use in future episodes."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10936.94,"end":10943.91,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of most months at 7pm Eastern, 4pm Pacific."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10944.15,"end":10983.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because in March we're not going to be doing our episodes live. And the reason is Memorex. Yeah, it's going to all be Memorex in March 2022 and that's because of liturgical reasons. The first time it'll be the first week of Lent we have to be in church, and the second time it's going to be the Eve of the Great Feast of the Annunciation on the calendar that both Father Stephen and I follow. So though we will still have episodes on those nights, but they are going to be pre recorded. So if you are on Facebook though, you can like our page, join our discussion group, leave reviews ratings everywhere. But most importantly please share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10984.4,"end":10993.49,"speaker":"Fr Stephen De Young","text":"But don't be on Facebook if you don't have to. And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasts stay on the air."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10993.49,"end":10997.85,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much, good night and God bless you and may you have a very good Lent."}
{"episode_id":"LOS - #038 - 2022-02-24 - The Pattern of the Tabernacle","start":10999.85,"end":11037.14,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne, and the beasts and the elders and the and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
