{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":0.8,"end":65.41,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":67.41,"end":92.75,"speaker":"Fr Andrew Stephen Damick","text":"Hey, good evening, everybody. You're listening to the Lord of Spirits podcast. We are back. It is our first live show since the great flood in the Chesterton Studio that happened right before Great Lent. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, the Commonwealth of Pennsylvania. And if you're listening to this live, and I hope you are, you can call."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":92.75,"end":94.63,"speaker":"Fr Stephen De Young","text":"You're doing it live. That's right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":95.35,"end":102.07,"speaker":"Fr Andrew Stephen Damick","text":"It's happening. Thank you for reminding me that this is live radio."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":102.07,"end":106.71,"speaker":"Fr Stephen De Young","text":"Yes. So we should, like interrupt each other or throw each other off."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":106.79,"end":178.99,"speaker":"Fr Andrew Stephen Damick","text":"Don't do that. Yeah, it's fine. It's okay. You can call us though, at 855-AF-RADIO, which is 855-237-2346. And Matish Khatrudi will be taking your calls and we're going to get to those in the second part of our show. So one of our perennial topics on this show is how one reads the Bible. This is a critical question for all Christians. Related to this is how one understands history, both as part of our biblical reading methodology and also as people looking at the historical narratives that are within the Bible. Now, while we've made many comments over our few dozen episodes about this topic, we've never done an episode focusing on it specifically. So what you're going to hear in this episode is a methodology for reading the Bible that we believe not only actually works, but also is what one sees revealed in how the Orthodox Church fathers read the Bible and even more importantly, how we see the Orthodox Church reading the Bible within its divine services. And we're also going to let you know why we so often start our episodes with Genesis way back at the dawn of history. So let's start with this question of history. So, Father Stephen, what exactly is history?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":179.71,"end":181.39,"speaker":"Fr Stephen De Young","text":"Well, before we go there."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":181.79,"end":182.27,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":182.59,"end":185.95,"speaker":"Fr Stephen De Young","text":"I feel like we need to address an elephant in the room."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":186.83,"end":187.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":187.63,"end":189.71,"speaker":"Fr Stephen De Young","text":"Not the flood, right? People know about the flood."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":189.95,"end":194.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's true. It was not the flood that we usually talk about, though. It was another flood. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":195.39,"end":206.51,"speaker":"Fr Stephen De Young","text":"It's this other. Did you get this message from Bobby Maddox? No, I get this message. He's apparently hiding out in Honduras. Did you know about this?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":206.75,"end":209.03,"speaker":"Fr Andrew Stephen Damick","text":"Oh, Oh, I think he needs financial assistance."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":209.03,"end":209.47,"speaker":"Announcer","text":"Is that right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":209.71,"end":215.07,"speaker":"Fr Stephen De Young","text":"He wants us to send him lawyers, guns and money, in that order."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":216.19,"end":216.67,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":216.91,"end":223.43,"speaker":"Fr Stephen De Young","text":"So I don't know what's going on, but if you see Bobby Maddox, help the man."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":223.67,"end":229.19,"speaker":"Fr Andrew Stephen Damick","text":"You know, it's weird how many friends I have that have this problem. I get emails from them all the time."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":229.51,"end":230.27,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":230.27,"end":232.23,"speaker":"Fr Andrew Stephen Damick","text":"But I haven't gotten this one. Yeah, it's true."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":232.79,"end":249.97,"speaker":"Fr Stephen De Young","text":"Maybe they could all pitch in together and help each other. Also, also for listeners, pay close attention because at one point during this episode, we are going to say something nice about George William Frederick Hegel."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":250.61,"end":253.41,"speaker":"Fr Andrew Stephen Damick","text":"I feel like we should have had theme music for when you said that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":254.85,"end":260.53,"speaker":"Fr Stephen De Young","text":"George William Friedrich Hegel. Theme music. We don't mention him that often."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":260.53,"end":266.97,"speaker":"Fr Andrew Stephen Damick","text":"No, I know, but. No, I mean, I'm saying, you know, when we're gonna, you know, like, it was just such a dramatic moment. Right. I feel there should have been music."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":266.97,"end":267.69,"speaker":"Fr Stephen De Young","text":"To go along with it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":267.69,"end":269.17,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, I'm just throwing that out there."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":269.17,"end":283.06,"speaker":"Fr Stephen De Young","text":"Play some Beethoven or something. Yeah, I mean, he is one of our 19th century German friends. So I guess he does appear within that August assemblage, but not normally independently, as he will this evening."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":283.3,"end":283.86,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":285.54,"end":389.81,"speaker":"Fr Stephen De Young","text":"So, yeah. And since we're going to be talking about history here, that might clue you in as to why he might come up. So, yeah, part of where we have to start in terms of how to read the Bible, not because it's necessary germane to the Bible, but because of the modern history, especially the last couple of centuries of biblical interpretation and biblical studies. Right. And the way the understanding of history has gotten all wrapped up with that and sort of poisoned the well in terms of how the Scriptures are reading by just about everybody. And so as you asked the question, what is history? The answer that you would commonly get to that question changed at the end of the 18th and beginning of the 19th centuries. There was a transition that happened in terms of what people's understanding was of what history is. So before that, if we go back before that, we go back into any pre modern period. And this is true from ancient times really up through the Middle Ages, the medieval period, the idea of history was very different than the modern one. You had basically in Europe and in other Christian cultures up to that point, you had three main sources for history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":390.53,"end":390.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":391.09,"end":440.18,"speaker":"Fr Stephen De Young","text":"And when you studied history, it would sort of be these three things woven together. Right. So one of those was the Bible, the Scriptures, particularly in the Old Testament, insofar as they described certain ancient events. Then added into that would be various extra biblical literature. So for example, the Book of Enoch that we've talked about before on the show, many, many times in various contexts, long after it was settled that for everybody but the Ethiopians, that that's not part of the biblical canon. Long after that, it was still being used in historical chronicles in the east and the West."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":440.58,"end":448.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. I recall you mentioning a Byzantine chronicler, you know, George. Yeah. When was he?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":449.22,"end":452.58,"speaker":"Fr Stephen De Young","text":"He was in the end of the eighth century, beginning of the ninth century."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":452.58,"end":458.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so he's treating Enoch as basically one of those historical sources that everybody needs to read if you can understand history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":458.58,"end":499.53,"speaker":"Fr Stephen De Young","text":"Right. Filling it, filling in a bunch of things in and around, especially the Book of Genesis, obviously, with first Enoch. But there were other sort of these, both second Temple Jewish literature that had been saved and preserved mostly in Christian monastic settlements, and then also some of the Christian extra biblical literature, stuff like the Gospel of Nicodemus and those kind of things and martyrologies and those kind of things that would get incorporated. And then sort of on the other end from the Bible, you would study, if you studied history at that time, you would study classics, the Greek and Roman classics."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":500.49,"end":500.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":500.89,"end":527.7,"speaker":"Fr Stephen De Young","text":"That was the sort of civilizational level as opposed to the spiritual level, is the way we would divide it. But they did not so divide it. They sort of blended it all together in sometimes very interesting ways, but we won't digress on that too much. But even into the. Into the 9th, 10th, 11th, 12th centuries in the Byzantine Empire, they were writing commentaries on the Iliad and the Odyssey, for example."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":528.26,"end":529.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":530.18,"end":582.46,"speaker":"Fr Stephen De Young","text":"And those were still being used for education. And so from these narrative sources, there would be sort of a master narrative woven together that would be the history, the story of a particular people. Right. Whether it's Bede helping do this kind of thing for the English people, whether it's Eusebius of Caesarea wanting to do this for sort of the Christians, of the Byzantine Empire, of the Roman Empire. Dozens of other examples. Right. But you're weaving this together, and you come to a story that begins with somewhere around the creation of the world and ends with the present day of that people in the place where they dwell."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":583.02,"end":583.9,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":585.02,"end":602.27,"speaker":"Fr Stephen De Young","text":"And that story then tells the story of where that people came from, how they got where they are now, how they became a people, what sort of values or virtues characterize that people, and then who they're going to be going forward."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":603.47,"end":668.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the intention is not to sort of claim always. I mean, I think in some cases there was this claim that the particular people who are writing this story are, you know, the pinnacle of history or the center of the world. Right. Or something like that. But rather it's just like, well, this history is written for these people, by these people. And so it makes sense that, you know, all the world's history up to this point for us leads to here and now where we are. Right. It's a kind of. It's a kind of. It's like if you're studying genealogy, you know, everyone's really ultimately interested in genealogy as it leads down to one point at the very bottom, and that's you. You know, everything in front of that is really interesting. But you're not going to follow all the branches out to everybody else. You might be interested in ones that are closely related to you. But, you know, the fact that, for instance, that pretty much every single person with any European descent is probably descendants from Charlemagne doesn't mean you're gonna be following all of those stories. You're mostly just kind of interested in you and your second and third and maybe like fourth cousins, potentially."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":669.64,"end":672.44,"speaker":"Fr Stephen De Young","text":"Yeah. Unless you're a Mormon and then it fans out and all."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":672.52,"end":674.84,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, there's no. There's no limit there."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":675.16,"end":741.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And so that's it. It's the story of those people who are standing there, and it's being told and retold to those people who are standing there. Right. So, yes, the English people did not particularly care about the history of the Germanic tribes except as it related to the English people. Right. So. But also, that means that there's no idea, like, what we take for granted now, this division between subjectivity and objectivity activity. Right, right. They were not trying to give an objective look at the history of their people and describe all of the events, warts and all. Now, the story was being told with a particular purpose. Right. And the people who were mentioned in the story were mentioned for particular reasons. Because they were good examples or bad examples or something they did became important or could be important in the future or was to be emulated or was not to be emulated. Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":741.75,"end":746.13,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you can see this, you can see this for inst. Just the way that we, we tell American history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":746.77,"end":747.17,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":747.65,"end":767.45,"speaker":"Fr Andrew Stephen Damick","text":"You know, we've had, what, 46 presidents now, I think. And yet, you know, even people who are moderately familiar with American history or even very familiar could not tell you much about most of them. There's just sort of certain key ones along the way, and that's just. Even within our country's history. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":767.45,"end":771.41,"speaker":"Fr Stephen De Young","text":"I mean, you don't have a bust of James K. Polk, the Napoleon of the West."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":771.65,"end":783.23,"speaker":"Fr Andrew Stephen Damick","text":"So weird. Right. Or Millard Fillmore. You know, it's true, it's true. I mean, I know the ones generally that were, you know, shot, those are the ones I remember the most. I don't know why."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":785.39,"end":786.07,"speaker":"Fr Stephen De Young","text":"But it's true."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":786.07,"end":802.51,"speaker":"Fr Andrew Stephen Damick","text":"That, like, the way that people feel good or bad about Abraham Lincoln is just going to be simply different than the way that they feel about William Howard Taft. And Lincoln is considered to be much more significant for the American story than Taft ever will probably be."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":802.78,"end":817.98,"speaker":"Fr Stephen De Young","text":"Probably be, actually, historically, if you had a time machine and you went back to just the right time and assassinated William Howard Taft, you could prevent the Russian revolution and at least one of the world wars."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":818.14,"end":818.62,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":818.62,"end":820.22,"speaker":"Fr Stephen De Young","text":"But that's a subject for another episode."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":820.62,"end":826.14,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's a different podcast. That's for a late night podcast. We do at 2 in the morning, everybody."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":826.14,"end":840.23,"speaker":"Fr Stephen De Young","text":"Yeah. So, but Taft aside. Yes. Right. And I mean, just taking a biblical example, that's what St. John says at the end of his Gospel. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":840.47,"end":840.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":840.87,"end":852.71,"speaker":"Fr Stephen De Young","text":"There's not enough books in the whole world for me to write down everything that Christ said and did. Right. But these things are written down so that you may believe and believing you may have life in his name."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":852.87,"end":856.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The Gospels are not biography in the way that we do it now."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":857.14,"end":879.3,"speaker":"Fr Stephen De Young","text":"Right. So he's saying this is. I'm not being objective. Like, I'm very much not being objective. Right. This is with a particular purpose. And that's how all history was done. Right. That's why all history was done. And that's why even if you're living, if you're going to the University of Paris in the 13th century and you study history, you're going to be studying the Roman Empire."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":880.74,"end":882.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. Even though they're not Romans, which is."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":882.78,"end":884.02,"speaker":"Fr Stephen De Young","text":"A long way in the past."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":884.53,"end":884.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":886.53,"end":924.86,"speaker":"Fr Stephen De Young","text":"But it was because there were key Elements, Right. That we're seeing there. It's selective. And so these stories were crafted deliberately. One of the best examples of that is when Octavian became Caesar Augustus. He commissions Virgil to write the Aeneid, right. To write a new. This is the history of Rome culminating in Augustus. Right. And he connected it to the Greek founding myths. Right, because. Connects it to the Iliad."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":926.7,"end":927.1,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":929.1,"end":940.73,"speaker":"Fr Stephen De Young","text":"So you see something that happens here with empires, right? Empires, when they write their history, they incorporate the histories of the people who they conquered."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":940.97,"end":981.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what's interesting is, like, that same act gets done, like, if you read. If you read the poetic. I'm sorry, the Prose Edda by Snorri Sturlson, who is, you know, that's one of the classic sources of Norse myth story, of course, is a Christian. But he starts out the Prose Edda by saying that the Norse gods are actually heroes from Troy who traveled north and became worshiped as gods by the people there. So it's interesting that even. Even this Christian's take on the origin of Norse paganism connects it back to the fall of Troy. Right. He's connecting it back again to the Iliad."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":981.3,"end":982.22,"speaker":"Fr Stephen De Young","text":"History proper."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":982.3,"end":982.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":982.9,"end":984.38,"speaker":"Fr Stephen De Young","text":"History proper, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":984.38,"end":1002.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting to see how these different, you know, the same historical sources get used by very different cultures for different purposes, but it's always about connecting it back. You know, where we are now is connected back to the. This source."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1002.72,"end":1017.04,"speaker":"Fr Stephen De Young","text":"Right. And once Rome conquered Greece, Right. Greece is now part of the Roman Empire. So those Greek stories, that story of the history of the Hellenic peoples becomes part of the story of the history of Rome."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1017.44,"end":1094.11,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Which is one of the reasons I got this is one of the things I've been studying a little bit is over the last year or two is, you know, Christian objects, you know, objects created by Christians and in many cases by, like, monks within fully Christianized places that include pagan imagery. Right. So, I mean, one of the classic examples is there's a. The 13th century, I think it's called the Helistad Stave Church in Norway that includes images from the legend of Sigurd on the doorpost on the outside of the church. But it's, you know, there aren't any pagans around, probably, or not too many at that time. But the point is, is that this story, this history that is the. The Norwegians, the Norse people, has now been incorporated into the Christian story of Norway. That it's. It's just simply part of that story now, too. They're not saying, you know, you should go Ahead and worship those gods that our people used to worship, but rather that these. These stories that make up the culture of this people are now part of our. Continue to be part of our story. But now they're in many cases reinterpreted, transformed in some ways, extra commentary, added all that kind of stuff to incorporate it into that people's consciousness at that particular point in history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1094.99,"end":1120.75,"speaker":"Fr Stephen De Young","text":"Right. And to help redirect those people's consciousness of themselves. Right. So you're no longer, you know, a Greek who's at the end of this Greek story. Right. You're now a Greek who's part of this Roman story that's now continuing. Right. And one of the places where we see this kind of thing still happening today is the whole idea of Western civilization."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1121.47,"end":1121.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1121.95,"end":1135.25,"speaker":"Fr Stephen De Young","text":"And Western Civ classes. Right. Because it is not an objective reading of history. To start history with ancient Sumer and end it with the United States winning World War II."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1137.25,"end":1139.65,"speaker":"Fr Andrew Stephen Damick","text":"There's not just a clear line that goes between those two."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1139.97,"end":1147.17,"speaker":"Fr Stephen De Young","text":"That's not completely objective. Right. That's a process of assimilation of a whole bunch of stories."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1147.33,"end":1148.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it's selective."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1148.85,"end":1150.97,"speaker":"Fr Stephen De Young","text":"Different peoples. Radically different peoples."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1150.97,"end":1235.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right, right. I mean, and I think, like, especially American culture in particular, which is the result. American culture as it now stands, is. Is the result of numerous streams of immigration. And this makes it easier for people to do that. Right. Like that, you know, that the story of the country my ancestors came from is now part of. Is. Is part of my story. It's part of the American story and so forth. But. But again, it gets reinterpreted. Like. So, for instance, you know, you could study wherever, like, you know, you being of Dutch ancestry, me being of Lithuanian, we can study those places. We can understand those places. We can even understand our particular forebears who were immigrants. But the story of those places went on without our families. And so even though there may be a genetic link between us and that country, and even though there may be some connections, you know, maybe cuisine is passed down or maybe language, although if you get enough generations to. The language usually stops at some point. Our story is not their story. Their story has moved on without us. Our story has moved on without them. We no longer have the experience that those peoples have had. Even though there is this common heritage, it's no longer the same thing because we're not participating in their story anymore."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1236.15,"end":1256.32,"speaker":"Fr Stephen De Young","text":"Right. And that's why you get all of these hyphenate Americans. Right, right. So, you know, I'm a Dutch American. So the Story starts in the Netherlands, but then it merges into this America story. Right. And likewise with all the other various."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1257.52,"end":1257.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1258.08,"end":1316.65,"speaker":"Fr Stephen De Young","text":"Hyphenates. And so. But even more than just that sort of master narrative. Right. That still occasionally gets taught as history. In fact, most popular level history and the history you're gonna get at most, you know, junior highs, high schools, elementary schools in the United States at least, is this kind of history. It's not really pretending to be objective. Right, right. And. But beyond even that sort of official narrative, there's also the fact that every group and even every person has their own kind of functional phenomenological history. Right. They have their own story about who they are and the history of their people, their family. Right. And. And who they are. And that varies a lot. It has. It has nothing to do with what did or didn't actually happen. Right. So. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1316.65,"end":1323.68,"speaker":"Fr Andrew Stephen Damick","text":"I mean, there's a gazillion things that have happened to me in my life that I simply do not remember because they weren't important to me to remember. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1323.84,"end":1350.62,"speaker":"Fr Stephen De Young","text":"And I grew up, for example, in a Dutch community in Southern California. Right. So the American Civil War is, like, not part of my personal history. Like, I don't really have any firm real connection to it. Right. I just. I don't. I now live in Louisiana. Here, a lot of people. That is part of their personal history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1351.42,"end":1351.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1351.82,"end":1355.1,"speaker":"Fr Stephen De Young","text":"Because I don't deny that the American Civil War happened."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1355.66,"end":1356.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1357.18,"end":1365.9,"speaker":"Fr Stephen De Young","text":"It happened. But that fact is not super relevant to who I am, where I came from, where I'm going in the future."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1366.54,"end":1394.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. But interestingly, you know, like, let's say your whole clan moves to Louisiana, and eventually they have descendants. And they have descendants, then what can happen is that in. Because they are participating in Louisiana culture, Louisiana's history becomes much more important to them as a result. Like, I'm interested in Emmaus, Pennsylvania history, but there is zero record that I'm aware of. Of anyone I was ever related to ever living here before me."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1396.48,"end":1401,"speaker":"Fr Stephen De Young","text":"But if your kids and grandkids stay there, right? Yeah, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1401,"end":1401.6,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1403.07,"end":1492.69,"speaker":"Fr Stephen De Young","text":"And so in a lot of cases, what makes that. What helps craft, shall we say, that functional history is actually ritual activity. Right. So participation, the church example of this, right. Is that when we say, blessed art thou, God of our fathers, we're talking about Abraham, Isaac and Jacob, and we're calling them our fathers. Right. Doesn't matter if you're not Jewish. Doesn't matter if you're not even from a Semitic people group. Right. They have become your fathers because that has become your history. That's why St. Paul can writing to the church at Corinth in a chapter where he's pointed out that they all used to worship idols. So he's talking to Gentiles. He could say, remember, our fathers were all baptized into Moses. Right? So this is not just a theological point. Right. This is not some kind of replacement theology. This is not some kind of weird anti Semitism. This is how functional history works. And it worked that way in the Old Testament. Abraham, Isaac and Jacob were Ruth's fathers even though she was a Moabite. Right. And Caleb's even though he was a Kenizite."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1492.93,"end":1507.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, you know, as Ruth said, your people will be my people, your God will be my God. That's, that's, she's, you know, that's exactly what she's saying, is that it becomes, it becomes hers as a result of her participation in that people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1508.65,"end":1536.33,"speaker":"Fr Stephen De Young","text":"Right. And this still kind of takes place on a secular level as well, Although it's also through ritual activity. Right. In naturalization, when you're naturalized into, into a new country, you move to another country and you become a citizen there. There's a process you go through and there's usually some kind of oath taking involved, there's some kind of ritual ceremony involved where you become a part of that people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1536.81,"end":1537.05,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1537.13,"end":1547.13,"speaker":"Fr Stephen De Young","text":"And it doesn't matter where you were born and where you grew up, now you are part of that people. And the history of that people now becomes your history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1547.77,"end":1549.21,"speaker":"Fr Andrew Stephen Damick","text":"Yep, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1549.29,"end":1550.49,"speaker":"Fr Stephen De Young","text":"You are a part of that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1551.53,"end":1552.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1552.73,"end":1553.53,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1553.61,"end":1556.25,"speaker":"Fr Andrew Stephen Damick","text":"That's ancient history. That's the way history used to be. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1556.49,"end":1557.57,"speaker":"Fr Stephen De Young","text":"Yes. That's ancient."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1557.57,"end":1560.89,"speaker":"Fr Andrew Stephen Damick","text":"Ancient history or pre modern history in many ways. Just simply pre modern."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1560.89,"end":1571.92,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, Pre modern history. Right. And so then our German friends come along and decide that history should be a Wissenschaft."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1572.08,"end":1578.48,"speaker":"Fr Andrew Stephen Damick","text":"Wissenschaft. So I bet you're all asking yourself, what exactly does this word Wissenschaft mean?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1579.6,"end":1584.88,"speaker":"Fr Stephen De Young","text":"Father Andrews, Etymology Corner."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1586.4,"end":1605.82,"speaker":"Fr Andrew Stephen Damick","text":"That's right, it's time for Father Andrews Etymology Corner. And I have to to credit listener slash catechumen Chris Hoyle, who sent that, that little jingle in for us, and that is his two year old daughter Eleanor at the end. That is not a simulated baby sound. That's real. So, yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1605.82,"end":1607.74,"speaker":"Fr Stephen De Young","text":"No babies were harmed in the making of."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1607.74,"end":1718.39,"speaker":"Fr Andrew Stephen Damick","text":"No, no, that was sheer unmitigated joy. So just. Which is. That is the way I feel about etymology. So Wissenschaft, right. It's a German word, literally, if you want to pull it out from its roots, it means knowledge Making. So that Wissen part comes from the Germanic root witan, W I t a n, which means to know. And that actually comes from a proto Indo European root. I'm not sure if I'm pronouncing this correctly. Wede W e y D, which means to see and actually is the origin of our word video and stuff like this. Right, but so in Old English, witan generally meant to know, but it actually more specifically means to be aware of. To be aware of. That's how it's related to the Indo European word to see. Right. And then this is where we get the modern English word wise and also wit and wizard. A wizard is an old. Is a guy who knows things. It's not a guy who does magical tricks. So these are all words that are connected in English. Wissenschaft is a technical term in German academia, right? And usually the word gets translated into English as science, simply as science. Wissenschaft means science. But when it is used in English, often it gets used in an untranslated way. We just simply say Wissenschaft, as you did. So and when it gets used in English that way, we're talking about 19th century German academia, right? So that's, that's exactly what it all is. All it is. So that, ladies and gentlemen, is the etymology of Wissenschaft as it gets used in English with."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1718.39,"end":1719.23,"speaker":"Fr Stephen De Young","text":"Father Andrew."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1720.03,"end":1725.31,"speaker":"Fr Andrew Stephen Damick","text":"There you are. See, I love those little jingles for this segment. So thank you, Chris Hoyle."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1725.87,"end":1735.9,"speaker":"Fr Stephen De Young","text":"Very, very 80s synth pop, isn't it? Yeah. Mark Mothersbaugh may sue, but we'll go on anyway."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1739.9,"end":1741.74,"speaker":"Fr Andrew Stephen Damick","text":"Now everybody knows what Wissenschaft means."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1741.74,"end":1832.71,"speaker":"Fr Stephen De Young","text":"Yes. So this is the idea that history is a sort of science, right? So historical inquiry, historical methodology shifts to this kind of scientific or quasi scientific approach, right? Meaning obviously, you can't conduct experiments, but you gather evidence, you gather historical evidence. From that historical evidence, you form a hypothesis that explains as best you can the evidence you have. And then you're kind of at an impasse is the problem, because there's not really a good way to test that hypothesis because someone else could come along and construct a totally different hypothesis based on the same evidence. So if you get lucky and you're doing archeology and you find some more evidence that might help prove or help disprove your hypothesis. But barring that, this is why you get a lot of debates talking about, for example, explanatory power, like which one of these hypotheses best explains the evidence or explains more of the evidence, and it becomes sort of a fine debate. Right. And the further you go back in history, the more difficult it is because the less evidence you have."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1832.71,"end":1838.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then you can, you know, dig up one thing from some forgotten city, and then that changes everything."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1839.19,"end":1839.99,"speaker":"Fr Stephen De Young","text":"Hypothetically."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1840.31,"end":1841.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes, hypothetically."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1841.91,"end":1858.23,"speaker":"Fr Stephen De Young","text":"Because you also get things like, okay, we all agree that King David didn't exist. Right. That he's just like King Arthur. It was like, yeah, yeah, we all agree the scholarly guild, oh, hey, we found the subscription that mentions his name. Oh. So then you get the guy, you."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1858.23,"end":1859.68,"speaker":"Fr Andrew Stephen Damick","text":"Know, King Arthur was real, by the way."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1860.07,"end":1886.23,"speaker":"Fr Stephen De Young","text":"Yeah. The guys who have made their career arguing he didn't exist right now come out with articles like, well, that doesn't say Beit Dawid, that says Beit dod. It says, it's not house of David, it's house of the water bucket. And then this sounds like it's a real example. It is a real example. I knew it. And then construct an elaborate argument for why Israel would be called the house of the water bucket."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1886.78,"end":1887.1,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1887.74,"end":1894.22,"speaker":"Fr Stephen De Young","text":"Right. But again, it's a hypothesis. Right? Like, sure, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1894.94,"end":1896.06,"speaker":"Fr Andrew Stephen Damick","text":"Explanatory power."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1897.18,"end":1908.86,"speaker":"Fr Stephen De Young","text":"So. And everybody would have known better if they just paid attention to Aristotle, which is a quote you can drop in a lot of places."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1909.18,"end":1909.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1911.9,"end":1926.29,"speaker":"Fr Stephen De Young","text":"So Aristotle, all the way back in the 4th century BC pointed out that history is always a matter of doxa, which means opinion."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1926.53,"end":1948.62,"speaker":"Fr Andrew Stephen Damick","text":"Opinion. Yeah. I wasn't going to throw out the etymology thing for that for everybody. But, yeah, it does mean opinion, or I mean, sometimes can mean teaching. But its real basis is opinion. It's related to, like, reputation. And this is also why it means glory, because the glory is what surrounds and is said about a person or a thing or whatever. The voksa."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1949.58,"end":1960.86,"speaker":"Fr Stephen De Young","text":"Yeah. So not only does later ea not mean work of the people, but orthodoxy does not mean right glory or right worship. It means right opinion. Anyway."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1963.9,"end":1964.46,"speaker":"Fr Andrew Stephen Damick","text":"And that comes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1964.46,"end":1966.36,"speaker":"Fr Stephen De Young","text":"And that kiver beads itself seems."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1966.44,"end":1976.92,"speaker":"Fr Andrew Stephen Damick","text":"It seems. And it's the basis of our word dogma too, actually, that again, from that, it seems, because it seemed good to the Holy Spirit unto us. That's where that usage comes for dogma."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1977,"end":1983.08,"speaker":"Fr Stephen De Young","text":"And docetism is the heresy that Christ just seemed to be a man. He just appeared as a man, but."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1983.08,"end":1988.84,"speaker":"Fr Andrew Stephen Damick","text":"Was not actually seeming. Doesn't necessarily mean deception."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1989.16,"end":1991,"speaker":"Fr Stephen De Young","text":"No, you can have a right opinion."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":1991.41,"end":2003.73,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah, you can. And you can say, it seems to me, whenever someone says it seems to me they're not saying, well, I imagine that, you know, like, they're not saying, I think that I'm believing an illusion. They're saying, this is how I understand it. This is how it seems to me."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2004.21,"end":2040.62,"speaker":"Fr Stephen De Young","text":"Right. And so the point Aristotle's making when he says that, that it's the matter of opinion is that's as opposed to the type of knowledge that he describes as episteme, which is usually translated also science, but is a kind of knowledge that could be demonstrated. Right. So if I say to you two plus two equals four and you're dubious. Right. I could get two apples and then another two apples and show you. Right, right. And you will see. Oh, yes, your statement was correct. Two plus two equals four."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2040.94,"end":2041.42,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2041.42,"end":2061.99,"speaker":"Fr Stephen De Young","text":"Right. But if I say to you, if you had a time machine and you went back in time and killed William Howard Taft, you would prevent the Russian revolution and at least one of the world wars, right. There's no way for me to demonstrate that to you. I can't prove that to you."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2062.79,"end":2066.15,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because you can't do controlled experiments on history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2066.63,"end":2070.31,"speaker":"Fr Stephen De Young","text":"Right. I can't lay out math to prove that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2070.58,"end":2070.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2070.7,"end":2082.26,"speaker":"Fr Stephen De Young","text":"I could make an argument, but that argument is just gonna be an argument for my opinion. Right, right. So, so that's, that's the difference there. Aside."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2082.82,"end":2084.74,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. Go ahead, go ahead, go ahead."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2084.74,"end":2178.83,"speaker":"Fr Stephen De Young","text":"Okay. Aside for our atheist friends, right? You know who you are. This is one of the biggest misunderstandings in popular Christian and anti Christian apologetic stuff, right. People talk about Thomas Aquinas and his proofs for the existence of God, and they talk about them as if Thomas Aquinas ever met an atheist in his life, first of all, and that when he met that atheist, these were his five surefire ways to prove beyond a shadow of a doubt that God exists, which is also not what they're about. Right? So what Aquinas was doing, what Thomas was doing, he had read Aristotle, right. And so he was trying to prove that theology as a discipline is not a matter of opinion, that it's a matter of episteme, it's a matter of sciencia. It's a matter of science. Right? And so these are his demonstrations, these are his logical demonstrations of the existence of God to show that theology is certain knowledge and not purely the subject of opinion. That's what he's doing. You could disagree with him on all of them if you want to, but he never claimed. Here's the surefire way to prove to an atheist that God exists."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2179.08,"end":2179.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2179.24,"end":2183.64,"speaker":"Fr Stephen De Young","text":"That's not at all what it was about. It's about what type of knowledge theology is."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2183.96,"end":2275.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And the thing that occurs to me is that even attempts to, like our modern sense of history, like we can't just jump out of the way that most people do history now and say, I'm not going to do that anymore. Right. But. But it's. It's even that. Right. Like, I'm looking at my bookshelf right now and I have a bunch of history books on there, and most of them are doing this. This later variety of history. Right. But even that, you know, so when Stephen Runciman writes his. His histories about the Crusades or, you know, the fall of Constantinople, this kind of thing, he's making selections based on things that he's found or things he's usually read and creating a narrative based on that. It's not. He's not. It's his. It's not a videotape of everything that happened. It's still making a selection. It's still creating a narrative. Right. There's still no way around the. It seems to me there's just no way around. You cannot escape that. And I think part of our modern tension is that in many cases, we're not aware that we're doing that. Although, I mean, we're going to get to that about how that awareness has come. Right? Yeah, but. But that we don't realize that it's actually the way we think. What we think we're doing is, in fact, in tension with what we really are doing. That's the problem is that there's this tension. We think we're doing science, but we're actually not. We're doing story. That's what we're. What's what we're doing. Which. That's not bad."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2276.42,"end":2279.38,"speaker":"Fr Stephen De Young","text":"Modernism makes this pretense to objectivity."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2279.7,"end":2280.1,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2280.82,"end":2291.05,"speaker":"Fr Stephen De Young","text":"Right. We're not saying they succeeded at being objective, that modernists succeed at being objective, but they make a pretense to it. Before they did not make a pretense to it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2291.6,"end":2294.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. There was no idea that that's. That was even."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2294.08,"end":2299.04,"speaker":"Fr Stephen De Young","text":"There was no idea that anyone was subjective. Objective was not anything anybody was thinking about. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2301.28,"end":2301.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2301.6,"end":2328.47,"speaker":"Fr Stephen De Young","text":"So there's this pretense to objectivity and that we're gonna find. We're gonna find what really happened. Right. We're gonna uncover it. And so that means a text, no matter what kind of text we're talking about, but this includes the Bible relevant to what we're talking about tonight. The Bible now is not a history to be incorporated into your history. The Bible is now a piece of evidence. It's now an artifact."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2329.03,"end":2329.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2329.75,"end":2371.97,"speaker":"Fr Stephen De Young","text":"To be weighed against other pieces of evidence. Right. And the what really happened lays somewhere back behind It. Right. And this is just one sort of perspective on it. And so the kind of, again, it's the pretense to objectivity. What really happened back behind there isn't related to any particular group of people. Right. It claims to be the view from nowhere. Right. Like there is no perspective, they claim. Right. This is purely objective. There is no viewpoint, no standpoint, no observer. This is just how it is."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2372.05,"end":2376.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The tale without the teller, as if that's actually possible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2377.33,"end":2444.41,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So now we're going to get back specifically to biblical interpretation, because after this starts in Europe and there's this transition. So in the 17th and 18th century, the early modern period, what you get is you get people still treating the Bible as a true account. Right. As a true historical account, as these things are starting to shift. But they want to try to demythologize it, kind of naturalize it. Right. So they're going to say the story of Christ walking on the water to the disciples. Well, that's a true account, but what really happened was that Jesus was walking on this sandbar that they couldn't see. Right, right. He just, he could see the sandbar. Right. So we've got to preserve the account, but we also don't want to accept anything supernatural. Once you get to the late 18th and into the 19th century, it's just like. Yeah, that never happened."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2444.81,"end":2447.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. The story itself is just a fabrication."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2447.61,"end":2468.3,"speaker":"Fr Stephen De Young","text":"Right, right. It's just a story. Right. And you treat it as a, you treat it as a piece of evidence, and in this case, it's not a very good piece of evidence because it's got this stuff, supernatural stuff in it. Right? Yeah, yeah. And so it gets treated like the Epic of Gilgamesh or the Enuma leash or, or Greek myths or whatever. Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2468.3,"end":2485.22,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, then it only, it only makes sense then that a number of committed Christians are going to say, wait a minute. Nah, this happened. The Bible is true. Right. And that plays out in a particular set of debates."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2485.78,"end":2537.87,"speaker":"Fr Stephen De Young","text":"Right, right. And it starts because this kind of history and then resulting in this approach to the Bible comes to completely dominate European universities. And this is a period of time, as we get toward the end of the 19th, moving toward the 20th century. This is a time when what we now call the Ivy League schools, Right. Like the, the major universities, a lot of their, their professors and instructors are being educated at these European universities. Right, right. We sometimes, you know, I know we have a lot of listeners who aren't in the United States, but we in the United States are very Full of ourselves. And we like to forget that before World War II, we were still kind of a backwater. It's only post World War II that, like, Britain receded and the US became the major player on the world stage."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2538.19,"end":2541.39,"speaker":"Fr Andrew Stephen Damick","text":"Well, don't worry. I'm sure we're headed for backwater status again sometime, so."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2542.35,"end":2603.65,"speaker":"Fr Stephen De Young","text":"Oh, no doubt. But. But. So these things that we think of as these major Ivy League school. Right. Were not considered the great institutions of higher learning for the world. Right. American students who had real promise, they went to Europe, Right. To study. And so some of these folks, we'll throw a shout out to Jay Gresham Machen, were educated over there, were educated in this kind of modernist approach to the Bible. But because they were actual Christians, albeit Protestant. Right. They were horrified. Right. They saw where this was leading. Right, right, right. Saw where this was going. Right. Because it starts out well enough like. Well, hey, some of the supernatural stuff in the Bible is kind of goofy. I can't believe it. But then it moves to, like, I don't know about this virgin birthing. I don't know about this Jesus being God thing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2603.89,"end":2605.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2605.49,"end":2612.11,"speaker":"Fr Stephen De Young","text":"And it sort of progresses until there's less and less left, not just of the Bible, but of Christianity as."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2612.19,"end":2642.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. Isn't there a very famous cartoon I recall, which is depicted as a stairway where, you know, gradually, you know, I think it was called the descent into modernism or something like that, where, you know, they start taking off core beliefs of Christianity and then that eventually leads you down into the bottom, which, you know, I think is like unbelief or something. I'm not looking at it right now, but. But, yeah, I mean, there is a. There's an illustration of this. Of this reaction that these people have."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2642.94,"end":2646.7,"speaker":"Fr Stephen De Young","text":"I'm trying to remember there's a 20th century saint who actually talked about this."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2647.26,"end":2647.66,"speaker":"Fr Andrew Stephen Damick","text":"Oh, really?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2647.66,"end":2657.02,"speaker":"Fr Stephen De Young","text":"Orthodox Church. And what I remember about is he talked about how ironic it was because most of these institutions, especially once in Germany, were Protestant institutions."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2658.22,"end":2683.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, I was gonna say, I found the. I found the cartoon. Yeah, go ahead, go ahead. Yeah. It's called the Descent of the Modernists. Yeah. And it starts out like, in the top step, you've got Christianity. And the next step down is the Bible is not infallible. And then man not made in God's image, then no miracles, then no virgin birth, then no deity, no atonement, no resurrection, agnosticism. And at the bottom is atheism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2685.44,"end":2762.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So the 20th century Orthodox saint said how ironic it was at these Protestant institutions. In northern Europe that, you know, the Protestant movement had laid down the scriptures as the foundation for everything they were going to do and then turn around and undermine their own foundation so that the whole thing started to collapse. But so folks in America kind of saw this coming and saw this happening. It did not want American institutions like old Princeton to go the way of European institutions, even though they eventually did and rather quickly. And so they set out to put a stop to this. And the movement that ensued to debate against the modernists was led by a group who wrote these tracts on what they considered to be the most important aspects of the Christian faith. So their tracts on things like the virgin birth, the deity of Christ, the Holy Trinity. Right. These tracts, these are fundamentals from a Protestant perspective. And those were eventually collected as the fundamentals."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2763.09,"end":2766.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, this is the origin of the word fundamentalism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2766.69,"end":2767.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2767.09,"end":2775.65,"speaker":"Fr Andrew Stephen Damick","text":"It was the fundamentalists. Yeah, exactly. It did not mean everybody. Someone who is more serious about religion than I am and probably has a gun."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2776.13,"end":2778.45,"speaker":"Fr Stephen De Young","text":"Yeah. That's not what it do with violence."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2779.03,"end":2779.27,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2779.43,"end":2784.55,"speaker":"Fr Stephen De Young","text":"Or extremism. No, originally, originally it would, it was, it was a."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2784.55,"end":2793.83,"speaker":"Fr Andrew Stephen Damick","text":"It was simply a small O orthodoxy does, you know, designed to say these are the non negotiables that you have to believe in order to be our kind of Christian."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2794.63,"end":2806.48,"speaker":"Fr Stephen De Young","text":"And for most of the first half of the 20th century, there were a lot of people who would proudly call themselves in major Protestant denominations of the US Proudly call themselves evangelical fundamentalists. Oh, sure."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2806.48,"end":2817.36,"speaker":"Fr Andrew Stephen Damick","text":"I mean, there was no pejorative attached to that word. Yeah, no, I recall in the 70s and 80s that was still being used and no one. And, and it was not that I'm aware of, it was not being used as a pejorative."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2817.44,"end":2819.4,"speaker":"Fr Stephen De Young","text":"Well, you were hanging out with a bunch of crazies, though."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2819.4,"end":2827.2,"speaker":"Fr Andrew Stephen Damick","text":"I. Well, no, I mean, it was, it was simply. It was a. It was a label that a lot people used and it just meant we're."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2827.2,"end":2828.36,"speaker":"Fr Stephen De Young","text":"Really put on themselves."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2828.36,"end":2830.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, they would put on themselves."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2830.6,"end":2866.19,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so this is, this period, the late 19th, early 20th century, is referred to as the modernist fundamentalist controversy, or the modernist fundamentalist debate. The Scopes Monkey trial and all that stuff comes out of this. And coming to it from an orthodox perspective, there's a basic problem with both sides, Right. And that's that both sides share a fundamental presupposition. Both of them are accepting this modernist view of history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2867.31,"end":2867.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2867.63,"end":2877.47,"speaker":"Fr Stephen De Young","text":"Because the fundamentalists did not reject that modernist view of history. Right. They accepted it. They just insisted that that's what the Bible was."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2878.19,"end":2886.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so it could line up, you could, you could demonstrate the truth of the Bible using empirical, scientific means."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2886.95,"end":2887.47,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2887.47,"end":2891.11,"speaker":"Fr Andrew Stephen Damick","text":"I mean, and this is the birth of kind of modern Christian archeology."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2891.51,"end":2911.83,"speaker":"Fr Stephen De Young","text":"Biblical archeology, yes. That's where this starts. And it's a cliche in the literature now to talk about these people who during this period went out with a Bible in one hand and a spade in the other to dig and try and prove. Right, right. That prove that everything is objectively true, that the Old Testament is written from no perspective."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2912.15,"end":2912.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2912.35,"end":2914.95,"speaker":"Fr Stephen De Young","text":"Which is clearly a fool's errand."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2914.95,"end":2916.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2916.71,"end":2949.32,"speaker":"Fr Stephen De Young","text":"But to any reader. Right, it's definitely from a perspective. Right. But so this has a number of bad effects, Right. Even on the conservative side. I mean, the negative effects on the modernist side we've already kind of mentioned. Right, we already mentioned that's problematic. But even on the fundamentalist or the conservative side, since nobody likes that term anymore, this led to the marginalization of a lot of non history parts of the Bible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2950.28,"end":2953.48,"speaker":"Fr Andrew Stephen Damick","text":"Right. No one says, are the Psalms objectively true."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2954.12,"end":2966.44,"speaker":"Fr Stephen De Young","text":"Right. Proverbs, Song of Songs, Ecclesiastes, even the prophets. Right. With a few exceptions of particular hot button passages in some of the prophets."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2968.44,"end":2997.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, and I was gonna say that the fun flip side is then how this approach gets used on the book of Revelation, because there, it's not about trying to dig stuff up to prove that it's true now. It's about trying to find pieces of evidence in the moment that we're in that prove that the things said in the book of Revelation are about to happen in the way that I think that they are. So I mean, it works in both ends, coming and going."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":2997.62,"end":2999.94,"speaker":"Fr Stephen De Young","text":"It's being interpreted as future positivist history."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3000.74,"end":3001.14,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3001.62,"end":3028.77,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah, yeah. And then you also get. So once you say, no, this is objective, this is what really happened. Perspective from nowhere. Right. You create all these problems for yourself. Right. So if you say that about the Gospels. Oh, no, right. Like what do we do now? The Gospels have some of these events at different orders."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3030.45,"end":3030.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3031.09,"end":3088.85,"speaker":"Fr Stephen De Young","text":"And oh no, here there's one blind man and here there's two blind men. Oh, here there's two angels inside the tomb and one here there's one outside the tomb and here's his. Right. And you know, is it the late date of the Exodus? Is it the early date of the Exodus? Is it the even earlier date of the Exodus? Right. What date did the Exodus happen? And you know, how old is the earth? How long is a day? In Genesis 1 and how old is the earth and et cetera, et cetera, et cetera, all these things that I say put me to sleep. Right. Because they're not interesting to me, because I don't share that presupposition. Right. I don't share the presupposition that the Bible is modernist history. Right. I don't share this presupposition that the book of Exodus was written with any intent to help me figure out what year it happened."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3089.57,"end":3143.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. And I mean, I think the sort of caveat that I would add to all of the foregoing is to say, at least from on my part, I don't know how you feel about this, because we didn't talk about this, is to say that the methodology of gathering together evidence and trying to create narratives out of that, whether it's a scientific narrative about chemical processes or it's about, like, I'm. By no means are we saying that you shouldn't do archeology. Right. Or. Or that you shouldn't do experiments. It's just that to, to take that methodological frame and put it onto the Bible is, is super problematic. If you're trying to understand the purpose of the Bible and especially as a Christian, what is the purpose of the Bible in my life? Right. I don't know how you would. Whether you would agree with that or not."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3144.17,"end":3167.31,"speaker":"Fr Stephen De Young","text":"Right. Well, let's say. Let's say tomorrow some industrious person is digging out the Sinai Desert and uncover something that proves beyond a shadow of a doubt that the Exodus happens. Right. And he goes, on all the social media, it says, checkmate atheists. How many atheists do you think are going to be convinced to become Christians based on that?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3167.95,"end":3168.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3168.99,"end":3170.19,"speaker":"Fr Stephen De Young","text":"My estimate would be zero."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3172.75,"end":3174.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3175.39,"end":3182.43,"speaker":"Fr Stephen De Young","text":"Like, that's not a thing. That's not how this works. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3183.39,"end":3183.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3184.35,"end":3212.38,"speaker":"Fr Stephen De Young","text":"So, I mean, yes, conservative evangelicals also have to publish journal articles and write dissertations. This is a good way to find a topic, find an apparent contradiction and have at it. Right. But how productive it is for the purposes of the spiritual life, the church people finding their salvation is an open question. I'll say politely."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3212.54,"end":3212.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3215.71,"end":3220.43,"speaker":"Fr Stephen De Young","text":"So, yeah, so in both, in."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3222.27,"end":3222.67,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3222.75,"end":3244.77,"speaker":"Fr Stephen De Young","text":"Modernist, or what comes to be called liberalism. Right. The liberal theological approach, you have this positive history that stands behind the Bible in fundamentalism or as it comes to conservatism. Right. Conservative theology, you have the Bible is itself positivist history, but both of those are modernisms."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3245.17,"end":3245.57,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3246.05,"end":3254.45,"speaker":"Fr Stephen De Young","text":"Right. And I don't know if I've enunciated this this clearly on the show. So I will now send your angry cards and letters to Father Andrew."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3254.61,"end":3255.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3255.01,"end":3259.89,"speaker":"Fr Stephen De Young","text":"Because I won't read them. Young earth creationism is modernism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3262.13,"end":3262.77,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3262.85,"end":3263.65,"speaker":"Fr Stephen De Young","text":"There you go."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3264.05,"end":3268.05,"speaker":"Fr Andrew Stephen Damick","text":"So. But we are still going to the ark experience, though, right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3269.61,"end":3277.69,"speaker":"Fr Stephen De Young","text":"No. Oh, man, we are not. You're welcome to. But you'll have to find. Sharing that experience with me."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3277.85,"end":3289.89,"speaker":"Fr Andrew Stephen Damick","text":"I do have to find someone to go see that with, because I love. I don't know, there's something about the kitsch of that part of the religious world that I just am super into. So."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3289.89,"end":3296.57,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. He's building a Tower of Babel now, too, which I know was such a great idea the first time."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3297.57,"end":3298.17,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3298.17,"end":3305.57,"speaker":"Fr Stephen De Young","text":"It's like when they said they were making a replica of the Titanic to sail across the Atlantic for the anniversary, like the 100th anniversary. I was like."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3308.05,"end":3311.89,"speaker":"Fr Andrew Stephen Damick","text":"Really? It's gonna be different this time."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3312.05,"end":3313.17,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3314.05,"end":3322.05,"speaker":"Fr Andrew Stephen Damick","text":"Okay. So we've set ourselves up. So, I mean, that kind of takes us into much of the 20th century, and this is still the frame that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3322.05,"end":3322.9,"speaker":"Fr Stephen De Young","text":"A lot of the world still thinks."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3323.05,"end":3323.69,"speaker":"Fr Andrew Stephen Damick","text":"Thinks in."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3324.01,"end":3325.69,"speaker":"Fr Stephen De Young","text":"There's still plenty of modernists around."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3325.69,"end":3340.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah, yeah. I mean, they're still the ones largely publishing textbooks and stuff and, you know, that kind of thing. But there's another shift that occurred within the 20th century which has made this all even more problematic. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3341.69,"end":3342.81,"speaker":"Fr Stephen De Young","text":"Or at least confusing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3342.97,"end":3344.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3344.09,"end":3346.57,"speaker":"Fr Stephen De Young","text":"And that's postmodernism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3346.97,"end":3347.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3347.61,"end":3350.09,"speaker":"Fr Stephen De Young","text":"Or to be more specific, post structuralism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3350.5,"end":3358.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I know, I say, I know this is gonna be a very long first half, everybody, but we really. We need to set all this up to be able to give you this stuff in the second."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3358.82,"end":3367.06,"speaker":"Fr Stephen De Young","text":"If you complain about how long this show is, you're not gonna have a good time with this show. And you must be new here. You need. Yeah. You need to just settle in."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3367.54,"end":3368.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3368.66,"end":3373.3,"speaker":"Fr Stephen De Young","text":"So, I mean, Orthodox church services, same thing. Holy Week's coming up, man. Just buckle up."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3373.38,"end":3373.98,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3373.98,"end":3375.06,"speaker":"Fr Stephen De Young","text":"You're in for the duration."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3375.54,"end":3382.01,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, post structuralism. I remember first hearing about this when I was an undergrad doing English literature study."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3382.97,"end":3395.37,"speaker":"Fr Stephen De Young","text":"Yeah. Well, the word postmodern gets thrown around so much now that it gets applied to everything that. Right. Or post modern, various forms of modernism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3395.61,"end":3396.97,"speaker":"Fr Andrew Stephen Damick","text":"Pre. Anti. Post modern."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3396.97,"end":3399.21,"speaker":"Fr Stephen De Young","text":"Post postmodern modernisms now."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3399.61,"end":3404.86,"speaker":"Fr Andrew Stephen Damick","text":"The ultimate pre. Anti. Penultimate modern. No, I don't know."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3405.09,"end":3437.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And we're not going to talk about it tonight, but believe it or not, there is such a thing as meta modernism. But anyway, so. But they haven't gotten too much of A hold of the Bible yet. So postmodernism is basically a continuation of the modernist move that starts with. As the. The Bible was demoted."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3437.59,"end":3438.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3438.39,"end":3461.59,"speaker":"Fr Stephen De Young","text":"To a piece of evidence. Right. Or a source. Right. By. By the modernists. It then comes to be approached with a hermeneutic of suspicion. Right. So it's not just that. Well, this is one version of the story or one perspective on events, but this is an official narrative designed to cover up what was actually going on."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3463.01,"end":3463.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3463.29,"end":3501.67,"speaker":"Fr Stephen De Young","text":"Right. So if you read in Exodus about the dedication of the firstborn at the tabernacle, clearly this is covering up the fact that the ancient Israelites sacrificed their children to Yahweh, the God of Israel. I mean, clearly. Yeah, obviously. Right. Based on, you know, not much. But other than this, again, this hermetic of suspicion. Right. That if this is the official story. Right. Then the truth must be something different. And we try to read motives into whoever we think wrote the official story, like the priestly cast or what have."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3501.67,"end":3501.95,"speaker":"Fr Andrew Stephen Damick","text":"You."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3503.95,"end":3516.2,"speaker":"Fr Stephen De Young","text":"In order to describe this. And so then it moves on from there until essentially you end up in a situation where you just have perspectives now."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3516.68,"end":3517.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3517.04,"end":3531.56,"speaker":"Fr Stephen De Young","text":"It's just all takes. It's all bias and whatever. Whatever quote unquote really happened becomes sort of inaccessible. Right. So there are actually ways in which post structuralism is helpful."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3532.52,"end":3532.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3532.84,"end":3534.04,"speaker":"Fr Stephen De Young","text":"And other ways that it's not."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3534.76,"end":3535.16,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3535.24,"end":3536.68,"speaker":"Fr Stephen De Young","text":"Definitely ways it's not."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3537,"end":3537.72,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3538.68,"end":3568.35,"speaker":"Fr Stephen De Young","text":"So one way it's helpful is it does take seriously, as we've quoted Nagel, not just the bat thing, but there's no view from nowhere. Right. That. That every author, every source, every. Maybe not a piece of physical, archeological evidence, but the person who finds it and the person who interprets it, they all have a perspective, they all have biases, they all come from a culture. Right. And so there's no objective anything."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3569.83,"end":3570.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3570.39,"end":3583.51,"speaker":"Fr Stephen De Young","text":"Accessible to us. Right. And that gets taken seriously. So that modernist pretense, that was always a fake pretense to objectivity kind of gets killed. And I'm saying that's a good. That's a good thing. Killing that pretense."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3583.51,"end":3587.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Every. Every tale has a teller. There is no escape from that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3587.67,"end":3600.65,"speaker":"Fr Stephen De Young","text":"Right. And another good part is the idea that, relatedly, the person who's reading the Bible, the person who's actually reading is part of the reading of the Bible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3602.17,"end":3658.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. They're not receiving an objective Bible. Like, when they come to it, you're coming to it with your knowledge of language. You're coming to it with your personal opinions about things that might remind you of something that happened to you in your life, you're coming to it with the fact that you're receiving this probably in translation. But even if you're reading it in, you know, one of the original languages, you learned Greek or Hebrew from somebody who taught it to you in a particular way, you have a lexicon written by somebody who has their own take. Like, there's just. You've probably heard sermons in your life, and that's going to bring context to your reading. Like, it just goes on and on. There's no way around the human participation in the reading of the Bible and that when you receive it, then you're. That comes along with it. There's just no way out of that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3658.85,"end":3688.12,"speaker":"Fr Stephen De Young","text":"Right, Right. And since we're ticking people off tonight. Hey, and I say this honestly, I say this with love to our Protestant friends. I think it. I think one of the reasons Sola scriptura is problematic is that we don't have access to the Bible outside of our experience of reading the Bible. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3690.6,"end":3696.36,"speaker":"Fr Andrew Stephen Damick","text":"An infallible text requires an infallible interpreter is kind of another way of looking at that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3696.68,"end":3704.36,"speaker":"Fr Stephen De Young","text":"Right. And so when I read it, I am bringing my subjectivity into the mix."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3705.71,"end":3706.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3706.19,"end":3734.27,"speaker":"Fr Stephen De Young","text":"And so unless there's some way to access the infallible text without bringing my subjectivity into the mix, it becomes difficult to see how that text can serve as an objective standard of truth. Right. But I will leave it at that. Now, you probably have guessed at, and we've implied any number of bad things about this, right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3734.35,"end":3735.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Structuralism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3736.18,"end":3746.98,"speaker":"Fr Stephen De Young","text":"But ultimately, to sum it up, you end up with a situation where texts can mean anything and therefore end up meaning nothing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3747.78,"end":3748.18,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3748.82,"end":3760.74,"speaker":"Fr Stephen De Young","text":"Right. There's no meaning you can isolate. Right. There's just, there's just a thousand perspectives that there's no way to mediate between them because there's no way access to the reality behind it. And so."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3764.59,"end":3771.87,"speaker":"Fr Andrew Stephen Damick","text":"Nothing is nothing. Yeah, yeah. There is no communication happening ever. Is sort of the. Yeah. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3771.87,"end":3808.85,"speaker":"Fr Stephen De Young","text":"Yeah. And that results in. You end up with practices like, you'll find this in biblical studies and journal articles if you read jbl, where you find readings of texts against the grain. Right. So classic real example of this, reading the book of Ezekiel from the perspective of the witches he condemns. Right. So you're, you're deliberately, you. You are reading it from the opposite perspective of what you intend, of what the text intended."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3809.65,"end":3810.05,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3810.21,"end":3827.36,"speaker":"Fr Stephen De Young","text":"Right. So, and this, this is why, this is why you end up in this it can mean anything or nothing place. Right. Because if you could Read a text as meaning the exact opposite of what it says, then you could read it any which way."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3827.84,"end":3829.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3829.08,"end":3868.31,"speaker":"Fr Stephen De Young","text":"And it's just whatever meaning you give it. Right. And the meaning is just. Now, to be fair. Right. This isn't just unnuanced. Right. So proponents of this would say meaning arises within the interaction between your subjectivity and the text, which is also subjective. Right, right. But it's all subjectivity. Right. And therefore the meaning that arises from that encounter between you and the text is just a meaning for you. Right, right. And. And that's not entirely invalid in the sense that this happens."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3868.87,"end":3870.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3870.38,"end":3887.26,"speaker":"Fr Stephen De Young","text":"Like, yeah, yeah. I've published a couple of books. Occasionally I get an email from somebody who says, oh, this thing you said here was so important to me. It's wonderful. Really changed how I think about this and what they tell me. I have no idea how they got that out of my book."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3888.3,"end":3896.06,"speaker":"Fr Andrew Stephen Damick","text":"Right. You know, usually we get the emails saying, you know, I can't believe you said X, Y and Z. And again, we're saying, I have no idea how they got that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3896.14,"end":3930.13,"speaker":"Fr Stephen De Young","text":"Well, right. But in that positive case, right now, I don't write back to that person and say, no, you're wrong. That's not what I think. That's great. But that is a case where this has happened. Right. They, in their subjectivity, they had things going on in their life. They come from a background, they're in a situation that I didn't foresee. And so something in my book that came from my subjectivity spoke to something in their subjectivity and produced a good result. The results. Good. Great. Right. So they're not totally all wet with this."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3930.21,"end":3949.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I mean, I would say the point where it becomes kind of a freaky feedback loop, though, is when someone derives something within their subjectivity and then tells everybody else that that's how it. That's what it is. That's how it, you know, that's what it really means. That's, you know, like, you have to accept my subjective reading of this now, you know."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3949.57,"end":3955.99,"speaker":"Fr Stephen De Young","text":"Right. Or even if they don't do that. Right. Is that what that does, is it takes meaning and atomizes it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3956.47,"end":3957.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3957.43,"end":3978.55,"speaker":"Fr Stephen De Young","text":"Right. So we're no longer a community that has this story as part of our shared history. We're a group of individuals, each of whom, in our own subjectivity has a particular connection to this story that's completely independent and might be the opposite of the person to my left."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3979.1,"end":3979.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3980.14,"end":3987.5,"speaker":"Fr Stephen De Young","text":"Right. And so you can't build community based on that. And you know, Christ actually exists."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3990.78,"end":3991.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":3991.58,"end":4020.41,"speaker":"Fr Stephen De Young","text":"And we believe you could have, as orthodox Christians, you could have personal encounter with him, not just read about him. Right. And so there's sort of no room for that in this just subjectivity of texts. Right. So as a way of talking about people reading Moby Dick, like, hey, I read Moby Dick. And you know, because I read Moby Dick, I now understand I can't destroy the enterprise just to stop the Borg. Right. Well, I mean, that's a very particular meaning."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4020.57,"end":4020.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4021.21,"end":4023.05,"speaker":"Fr Stephen De Young","text":"For one person's subjectivity."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4023.05,"end":4024.81,"speaker":"Fr Andrew Stephen Damick","text":"That's an important lesson, though."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4024.97,"end":4027.53,"speaker":"Fr Stephen De Young","text":"But Herman Melville did not have that in mind."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4027.69,"end":4028.09,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4028.25,"end":4042.18,"speaker":"Fr Stephen De Young","text":"Right. At all. When he wrote Moby Dick. So. Right. For. So for that kind of situation. Yes, it is descriptive. But the Bible, as we're going to continue to talk about tonight, has a particular relationship to a particular community."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4042.58,"end":4044.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4044.34,"end":4048.82,"speaker":"Fr Stephen De Young","text":"That, that and so functions differently than just a book."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4049.06,"end":4049.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4049.54,"end":4102.86,"speaker":"Fr Stephen De Young","text":"Even. Or a history book. Right, right. You also then get what could be described as standpoint epistemology, which is the idea that because everybody's reading just from their own perspective. Right. It's their own subjectivity, then, you know, if we're all aware of that and we all agree to that, then I have to introduce my meaning from the text by stating my standpoint or bias. So, you know, as a Gen X Dutch American from Southern California, this text speaks to me this way. Right. And we've all heard as a blank. Right, right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4102.94,"end":4113.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's this appeal to authority, but it's this inaccessible, inaccessible authority. Right. Well, you're not me. And so therefore you just can't get this."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4114.14,"end":4124.78,"speaker":"Fr Stephen De Young","text":"Right. You don't have this knowledge because you, you don't share my experiences as a fill in the blank. Therefore this is inaccessible to you. And you just have to trust me."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4125.74,"end":4126.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4126.22,"end":4128.06,"speaker":"Fr Stephen De Young","text":"I mean, because I have the authority of experience."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4128.54,"end":4141.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, up to the point where someone says, you just have to trust me. I'm like, well, okay, it's true, I don't have your experiences and I'm not you, but if this is something that we're going to be sharing, then that's just not acceptable."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4142.39,"end":4142.63,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4143.03,"end":4143.55,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4143.55,"end":4143.91,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4144.47,"end":4152.87,"speaker":"Fr Andrew Stephen Damick","text":"Especially if you're trying to put it on me in some way. I can't just say, yes, yes, it's true, I'm not whatever it is you are, and therefore you're the expert. Period."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4153.75,"end":4168.63,"speaker":"Fr Stephen De Young","text":"Right. And I know a lot of people out there because I have some idea of the makeup of our audience. A lot of people out there now are thinking of like, identity Politics, Right, yeah, sure. And that is an example of standpoint epistemology."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4168.85,"end":4170.29,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. But this."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4170.37,"end":4210.18,"speaker":"Fr Stephen De Young","text":"This same way of thinking manifests itself on the more quote unquote conservative side, too, with appeals to the Holy Spirit, holiness, virtue, possession of the phronima of the Fathers. Right. Whatever someone wants to claim. Right. A claim to spiritual experience or the Holy Spirit acting in their life. Right. That allows them again, to understand the text in a way that you cannot. It's an appeal to authority that you can't interact with. Right. Their personal spiritual experience rather than. Than some kind of secular identity."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4210.34,"end":4210.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4210.7,"end":4211.5,"speaker":"Fr Stephen De Young","text":"Who was it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4211.5,"end":4227.39,"speaker":"Fr Andrew Stephen Damick","text":"Who was it that had a footnote that said, you know, this was revealed to me in a dream. I'm trying to remember who that was. Yeah, yeah, yeah, yeah. But I mean, that's real. That's a real thing. People like, you know, I have this. Like, you're just gonna have to go with me on this."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4227.71,"end":4228.11,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4228.11,"end":4232.35,"speaker":"Fr Andrew Stephen Damick","text":"You know, I have this personal experience or personal identity or whatever, and therefore."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4232.75,"end":4255.12,"speaker":"Fr Stephen De Young","text":"I spent a lot of time in prayer. The Holy Spirit is telling me this. Yeah, right. And there's no way to counter argue that with the person. Right, right. They're claiming experience that you don't share. And so there's no. Right. And so that ends up creating sort of in groups and out groups."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4255.6,"end":4256.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4256.8,"end":4340.96,"speaker":"Fr Stephen De Young","text":"In this. In this. Either in the sort of secular identity politics sense, or in a kind of gnostic sense among more conservative religious communities where there are these enlightened people who are in the know spiritually, and then these other, you know, spiritual proles who. Who don't know anything and are just supposed to trust. Right. The illuminated ones. Right. And so now that we've talked about how bad everything is. Right. This is really all this bleakness. This is the world of biblical studies. I know there's a few of you out there who are like, wow, I like listening to Lord of Spirits. I want to go get a PhD in biblical studies like Father Stephen did. Well, maybe I've talked some of you out of it, but not every school is pushing this. But this is the landscape. Right. This is the landscape out there. And we can kind of boil it down and summarize it to all of the. Whether it's liberal, conservative, modernist, postmodernist, whichever part of whatever spectrum you want to talk about. We kind of boil this down to the idea that all of this modernism, postmodernism views. The Bible is making claims. Yeah, right. The Bible makes truth claims. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4340.96,"end":4343.32,"speaker":"Fr Andrew Stephen Damick","text":"So we have to check them and see if they're true or false."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4343.32,"end":4369.67,"speaker":"Fr Stephen De Young","text":"Right. And those truth claims are either. It's. They're making a truth claim and we need to verify scientifically that this truth claim is scientifically accurate. Or in the more postmodern thing, it's. This is making truth claims. But that's just from this one perspective. So we need to isolate that perspective and give equal voice to all the other perspectives. But either way, it's making claims, it's asserting something. It's. There's force or power. Right being exercised."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4370.71,"end":4371.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4371.11,"end":4402.47,"speaker":"Fr Stephen De Young","text":"Right. And so. And this is. This is what leads to these things. Right. So if you read the measurements of Noah's ark, speaking of the ark encounter. Right. Those measures, you say the Bible is making a claim that Noah's ark had these exact dimensions. Right. Then you get Ken Ham telling you, well, if that's not true, then you just throw the Bible and Christianity in the garbage can."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4403.59,"end":4405.55,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. That becomes the basis."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4405.55,"end":4498.04,"speaker":"Fr Stephen De Young","text":"Exactly. Those dimensions. Right, Right. Because it's making a claim. Right. And so that's sort of the un. Nuanced version of this. Most folks are more nuanced than our friend Ken Ham. People like friend of the show Bart Ehrman. And so he's more on the, what we might call the liberal side, I guess, of that. But also you find more nuanced people on the conservative side who will separate out different types of culture claims. They don't question whether the Bible's making claims. They're still using this modern or postmodern approach that the Bible makes claims, but they'll separate out. Right. Historical claims from, like, scientific claims. And so they'll say, for example, when the Bible speaks as if the sun goes around the earth, it's not making that as a claim. That doesn't count as a claim. So it's okay that that's not accurate scientifically. Right. But those same folks will then say that any historical data in the Bible is a claim. Right. And so friend of the show Bart Ehrman, if I prove these historical claims untrue, then throw Christianity in the dumpster. And the response to him is no, I'm going to prove all of those historical claims true."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4498.91,"end":4499.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4500.51,"end":4511.23,"speaker":"Fr Stephen De Young","text":"So the nuanced folks will say, the Bible is not a science textbook. And I agree with them. Right. But the Bible is also not a history textbook."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4512.67,"end":4521.95,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not trying to say things about history that it's not trying to say about science. Like it's not. Yeah, exactly. It's not trying to do either thing. That's not its purpose."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4522.35,"end":4522.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4522.75,"end":4523.95,"speaker":"Fr Andrew Stephen Damick","text":"It's not its purpose."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4524.03,"end":4527.31,"speaker":"Fr Stephen De Young","text":"Right. And the Bible is not a modern book making claims."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4528.5,"end":4528.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4529.54,"end":4530.98,"speaker":"Fr Stephen De Young","text":"It's telling a story."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4531.86,"end":4532.38,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4532.38,"end":4533.54,"speaker":"Fr Stephen De Young","text":"The story of a people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4534.26,"end":4534.78,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4534.78,"end":4536.5,"speaker":"Fr Stephen De Young","text":"To which you are invited to belong."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4537.7,"end":4541.78,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Okay, Good night. No, there is more to say."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4541.86,"end":4543.14,"speaker":"Fr Stephen De Young","text":"There's two more halves."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4543.22,"end":4547.22,"speaker":"Fr Andrew Stephen Damick","text":"That's right. But before we say it, we're gonna go ahead and take a short break."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4548.18,"end":4564.49,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4573.69,"end":4583.13,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4583.29,"end":4585.77,"speaker":"Radu","text":"Are you an Orthodox Christian looking for."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4585.77,"end":4592.41,"speaker":"Fr Andrew Stephen Damick","text":"A reliable first place to send your interested friends? Do you need help finding an Orthodox church near you?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4592.81,"end":4594.53,"speaker":"Fr Stephen De Young","text":"My name is Father Paul Hodge."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4594.53,"end":4618.59,"speaker":"Fr Andrew Stephen Damick","text":"I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America. And I'm Fr. Andrew Stephen Damick, chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox intro team."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4618.91,"end":4620.55,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4620.55,"end":4622.55,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4622.55,"end":4624.91,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4625.07,"end":4630.83,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4630.83,"end":4635,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos of the Internet, A place to get."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4635,"end":4655.28,"speaker":"Fr Andrew Stephen Damick","text":"Help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient Faith Ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4658.65,"end":4679.53,"speaker":"Announcer","text":"Foreign. We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4680.89,"end":4690.73,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. We're talking about biblical interpretation. Interpretation. It's a big old methodology episode. Not a lot to dig up out of the desert for this one."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4692.09,"end":4697.53,"speaker":"Fr Stephen De Young","text":"So like, so the show is you, the commercial is you."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4698.01,"end":4698.65,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4698.73,"end":4701.09,"speaker":"Fr Stephen De Young","text":"Are you just like a full on one man band now?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4701.09,"end":4707.93,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I mean, it wasn't just me in the commercial though I should say it was a community, an interpretive community."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4708.17,"end":4711.53,"speaker":"Fr Stephen De Young","text":"Like if I switch over to the music channel right now. Will you be chanting?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4712,"end":4716.88,"speaker":"Fr Andrew Stephen Damick","text":"No, no, there are no recordings of me singing that I'm aware of."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4717.6,"end":4720.24,"speaker":"Fr Stephen De Young","text":"Okay. I was going to say somebody has something."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4720.88,"end":4783.67,"speaker":"Fr Andrew Stephen Damick","text":"I think that someone did hold up their phone during a service at one point, but. Right. So, yes, we just painted a very bleak landscape of how we got to where we are in terms of biblical interpretation. So. But there's a lot. There's more to say on this. Right, so like the, the implications of where we are now. Right. You know, this all, this all implies a certain methodology. All right, so. So we're going to talk in this half about the methodology that's implied by everything we just talked about and then, you know, make a turn to talk about the kind of methodology that. That we're employing on this show. Right. And that we believe is very much the methodology of the way that the Bible is read in the Orthodox Church and by the Orthodox Church for the Orthodox Church. All right, so having said all that, the Bible is, in a modern book, making claims. So where are we now?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4784.23,"end":4787.03,"speaker":"Fr Stephen De Young","text":"There will eventually be light at the end of this tunnel."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4787.11,"end":4790.47,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, we like episodes to end on a relatively high note."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4790.74,"end":4861.02,"speaker":"Fr Stephen De Young","text":"But. But we've. We've still got a little more tunnel, alas. Regrettably. Yeah, so. Yes, so, so much for history. Right. And. And we needed to spend that much time on it because this is frankly, the biggest problem right now to even coming to biblical interpretation is that again, this. This modern view of history has become the predominant lens through which the Scriptures are read. And it's causing us to miss sort of everything important. Right. So if the Bible isn't making claims, scientific or historical. Right. And we're talking about the problem with those kind of approaches and getting locked in those debates is that you miss, like, actual meaning. Right. And we talked about how meaning isn't just this individualized, completely subjective thing. Right now we have to kind of turn to how do you figure out what that is?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4861.9,"end":4864.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. Actual hermeneutics per se."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4865.26,"end":4875.06,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, hermeneutics. Not to be confused with Herman's Head, the fine Fox television show of the early to mid-90s."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4875.54,"end":4881.94,"speaker":"Fr Andrew Stephen Damick","text":"Nor with Herman Utix, the cousin, I believe, of Father Stephen Udix. Oh, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4882.18,"end":4883.22,"speaker":"Fr Stephen De Young","text":"Is that a real person?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4883.7,"end":4898.02,"speaker":"Fr Andrew Stephen Damick","text":"I think it might be. I remember. No, I remember that being mentioned. No, I remember it being mentioned by our common scripture professor at St. Teacot's, Dr. Mary Ford. I think she made a reference to Herman Utix, but I think that's a real question."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4898.02,"end":4899.17,"speaker":"Fr Stephen De Young","text":"He might have been telling a dad."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4899.32,"end":4900.84,"speaker":"Fr Andrew Stephen Damick","text":"Joke she might have, but I think."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4900.92,"end":4913.96,"speaker":"Fr Stephen De Young","text":"She is a mom, not a dad. That's true. Right, yeah. So we have to sort of come at this from the perspective of presuppositions too."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4914.28,"end":4914.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4914.68,"end":4934.06,"speaker":"Fr Stephen De Young","text":"Because again, coming out of this modern and postmodern milieu, people often have an idea that any given verse or passage or whatever unit of scripture we want to talk about has a meaning."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4935.02,"end":4935.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4936.06,"end":4937.42,"speaker":"Fr Stephen De Young","text":"A single meaning."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4937.66,"end":4954.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we get this question every so often. This shows up in our group too, you know, what's the orthodox interpretation of this verse? Yeah, right. Which, I mean, I get that, you know, but we need to. We need to kind of let go of that addiction."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4954.95,"end":4959.83,"speaker":"Fr Stephen De Young","text":"Right. And so that. That could be meant in either a modernist or a postmodernist sense, right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4959.83,"end":4960.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4960.43,"end":4967.79,"speaker":"Fr Stephen De Young","text":"In a postmodernist sense, it could be. Well, what's the orthodox perspective on this to compare to the Roman Catholic and Protestant."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4967.79,"end":4968.31,"speaker":"Fr Andrew Stephen Damick","text":"Right. What's."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4968.31,"end":4986.77,"speaker":"Fr Stephen De Young","text":"You guys take perspective on this? Or it could be from the modernist perspective of what has the orthodox church historically said? This verse means, like, objectively, the meaning that lies behind the text. Right. In the same way that history sort of lays behind the text."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4986.85,"end":4987.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":4987.17,"end":5029.96,"speaker":"Fr Stephen De Young","text":"In that modernist sense. But so just to sort of problematize the modern version of that. Right. We've already kind of problematized the postmodern version of that, but the modern version of that, the idea that you come to the text, you engage in some sort of process, and you come to that meaning that lies behind it. Right. Like nugget. Right. The. The analogy old biblical interpreters used to use was kernel and husk. There's this kernel of meaning, and you have to sort of extract it from the husk by getting into grammar and all these sort of things."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5030.2,"end":5030.6,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5031,"end":5057.99,"speaker":"Fr Stephen De Young","text":"But so if we take that approach where the meaning lies somewhere behind the text, then we have to ask the question where that meaning resides. Right. Where is it? Where would you find it? So some folks, this is one of the typical go to's of people responding to postmodernism is to retreat to modernism and say, well, it's in the mind of the authority."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5058.62,"end":5058.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5059.18,"end":5065.42,"speaker":"Fr Stephen De Young","text":"It's the author's intent. Right. It's what the author intended to say. That's the real meaning."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5065.74,"end":5068.54,"speaker":"Fr Andrew Stephen Damick","text":"Which. Okay, how do you get that?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5068.86,"end":5069.26,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5069.26,"end":5073.58,"speaker":"Fr Andrew Stephen Damick","text":"Like, not only do you have to do mind reading, you have to do time travel mind reading."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5073.58,"end":5077.74,"speaker":"Fr Stephen De Young","text":"Right, Right. We have to try to get into St. Paul's head. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5077.74,"end":5078.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5078.54,"end":5093.47,"speaker":"Fr Stephen De Young","text":"Very difficult to do. Right. And not easier than what's interpreting what's on the page. Right. This doesn't ease it. Right. In some cases, we don't even know who the right. Who wrote first and second Kings or third and fourth Kingdoms?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5096.11,"end":5099.15,"speaker":"Fr Andrew Stephen Damick","text":"You know, I never considered that question at all, actually. We don't know, do we?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5099.39,"end":5102.35,"speaker":"Fr Stephen De Young","text":"No, we don't. So whose brain are we even trying to get into?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5103.39,"end":5104.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5104.27,"end":5108.27,"speaker":"Fr Stephen De Young","text":"How would you determine the intent of an uncompletely unknown author?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5108.67,"end":5120.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or even, I mean, like to narrow it down a little bit, you know, how do we get into the mind of whoever wrote the end of Deuteronomy describing Moses, death and funeral?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5120.77,"end":5121.77,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5121.77,"end":5122.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5123.25,"end":5143.82,"speaker":"Fr Stephen De Young","text":"And so some folks will try to escalate it a step because they'll say, well, look, scripture sort of, in a sense has two authors. There's a human author. But what's really important in scripture is what God intends it to mean. Right. That's not easier."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5145.1,"end":5153.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. We have slightly better idea of what it's like to be St. Paul than we do what it's like to be God. Yeah, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5153.22,"end":5157.58,"speaker":"Fr Stephen De Young","text":"Right. So that's going to be tough, right? Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5157.98,"end":5158.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5159.26,"end":5176.71,"speaker":"Fr Stephen De Young","text":"So another answer, right. That you'll get is that, well, you look elsewhere in Scripture, right. Scripture interprets scripture. Scripture interprets itself. Right. You read the clear passages and you use those to interpret the unclear passages."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5177.19,"end":5177.59,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5177.83,"end":5210.99,"speaker":"Fr Stephen De Young","text":"Right. But this pretty well begs the question. Yeah. First of all, it's completely subjective. Which texts are clear and which ones are unclear. Right. Ones that I think are clear might be very unclear to you. And what's interesting is what passages people think are clear tend to correspond to the tradition they're coming from tend to correspond to their own subjectivity. Right. So my Calvinist friends find Romans 3, Romans 5 and Romans 9 through 11 incredibly clear."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5211.15,"end":5212.11,"speaker":"Fr Andrew Stephen Damick","text":"Crystal clear."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5212.35,"end":5277.78,"speaker":"Fr Stephen De Young","text":"Right. It's totally obvious what they're saying. Right. People from other traditions, not so much. Right. And this is true. Hey, to be fair. Right. Partakers of the divine nature in Second Peter, Right. Ask any orthodox person, that's what they thought of his crystal clear. That's talking about theosis. Right? Now, they can't go through the verses before and after to explain how theosis fits in there, but they will tell you that that verse is about theosis. Right. Totally clear. And so what this shows us is that perceived clarity and lack of clarity is really based in our own subjectivity. Right. And so that makes that problematic. But beyond even that, right? Beyond even that, even a clear passage, I still have to read and interpret. I just think it's easy, but I still have to read it and interpret it. I have to discern the meaning of that clear passage in order to use it to interpret another passage."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5278.5,"end":5291.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because at the very least, books with words on the page don't talk to you and correct you and make you do stuff. There's still application that has to happen. And that means interpretation. There's no way around it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5292.26,"end":5296.18,"speaker":"Fr Stephen De Young","text":"Right. You haven't told me where the meaning of the clear passage lies."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5297.41,"end":5297.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5297.61,"end":5304.69,"speaker":"Fr Stephen De Young","text":"You're just claiming to be that. It's obvious, which is a dubious claim, as we were just saying. Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5304.69,"end":5311.73,"speaker":"Fr Andrew Stephen Damick","text":"And implies. And implies. If you don't agree, you're either a liar, you know, you. Like you're suspect, or you."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5311.73,"end":5313.41,"speaker":"Fr Stephen De Young","text":"Yeah, you're doing something fishy."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5313.65,"end":5316.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Or you're just too dumb, trying to."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5316.25,"end":5317.81,"speaker":"Fr Stephen De Young","text":"Buddy the waters to get it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5317.89,"end":5328.83,"speaker":"Fr Andrew Stephen Damick","text":"Or uninformed. You know, it's that. It's that trifecta of, you know, the person who disagrees with you is either evil, unintelligent or uninformed."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5329.23,"end":5335.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So that's usually an answer. You get more from our Protestant friends."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5336.83,"end":5337.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5337.19,"end":5360.39,"speaker":"Fr Stephen De Young","text":"When you get more from orthodox folks is some idea. They usually won't use this Latin term because Latin's bad if you're orthodox. But some idea of the consensus patrum. Right. That. That the consensus of the fathers. Right, the fathers. That's where you get the meaning. The fathers have the correct meaning of each biblical passage. That's where you go. That's how orthodox people read the Bible. Right. They'll tell you that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5360.95,"end":5361.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5362.47,"end":5376.55,"speaker":"Fr Stephen De Young","text":"So here's the problems with that. Number one, the way most people do that is they go and grab their ancient Christian commentary on Scripture, which, by the way, was translated by somebody and."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5376.55,"end":5380.55,"speaker":"Fr Andrew Stephen Damick","text":"Compiled by somebody and published by InterVarsity Press. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5380.55,"end":5390.19,"speaker":"Fr Stephen De Young","text":"Yeah. And neither of none of those people are orthodox for our friends, unless you're reading the Arabic language version. Exception."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5390.19,"end":5392.55,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, is there an Arabic version of that?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5392.71,"end":5399.63,"speaker":"Fr Stephen De Young","text":"There is. And the general editor in charge of the translations is a priest in our own archdiocese."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5399.63,"end":5400.07,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5401.91,"end":5403.31,"speaker":"Fr Stephen De Young","text":"Not me. Right. Obviously."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5403.31,"end":5403.51,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5403.51,"end":5404.63,"speaker":"Fr Stephen De Young","text":"No Arabic. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5404.63,"end":5408.78,"speaker":"Fr Andrew Stephen Damick","text":"But you don't know. You don't do Arabic. How about that?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5409.58,"end":5411.98,"speaker":"Fr Stephen De Young","text":"Not so much. A little bit."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5412.3,"end":5412.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5412.66,"end":5441.94,"speaker":"Fr Stephen De Young","text":"You know, Ayden Widen, you know, but. So, but you. So people will go and they'll look there. They look up the verse. Okay, well, here's. Here's eight comments from early Christian writers. And you weed out the two or three who are heretics. And then you say, well, either they're all kind of saying the same thing. So I guess that's what the verse absolutely means. And Then you stop there."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5442.34,"end":5442.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5443.46,"end":5486.01,"speaker":"Fr Stephen De Young","text":"Or they're saying different things and now you got a problem. Right? So you could either say, well, like, apparently there is no clear. The fathers all disagree, so you don't have to worry about them. Or you get this weird thing, this weird postmodern thing that is unfortunately incredibly common in orthodox circles, where they will say, well, okay, so I see that the fathers have one of these two opinions on what the one meaning is of this passage. And therefore, these are the options I have."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5486.25,"end":5487.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I can pick one."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5487.53,"end":5489.09,"speaker":"Fr Stephen De Young","text":"I get to pick one of those two."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5489.09,"end":5491.93,"speaker":"Fr Andrew Stephen Damick","text":"It's quote in the tradition or something. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5491.93,"end":5512.93,"speaker":"Fr Stephen De Young","text":"I'm allowed to believe either A or B. Right. Here's why. This is completely postmodern in its approach. Right. Because here are the things it assumes. It assumes that either there is no actual meaning of that text, number one, or two, it's completely inaccessible. Right. This is exactly what we were just saying about postmodernism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5513.33,"end":5513.65,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5513.65,"end":5524.45,"speaker":"Fr Stephen De Young","text":"The meaning. The meaning is there behind the text. But in this case, because the fathers disagree, we can't know what it is. We just have these two perspectives."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5524.69,"end":5526.81,"speaker":"Fr Andrew Stephen Damick","text":"Just pick a father that you like better. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5526.81,"end":5537.17,"speaker":"Fr Stephen De Young","text":"We have these two perspectives, and then we have this idea of being allowed to be that allowed there means what? It means that the Church has exercised some kind of force or power."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5538.68,"end":5538.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5539.08,"end":5555.88,"speaker":"Fr Stephen De Young","text":"The ghost of Michel Foucault has entered the room. Right. And isn't his power, and so has compelled us to choose one of these two options. But I am allowed to choose either of the two. And if someone comes along and tells me that one of those two is wrong, I say, how dare you?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5556.44,"end":5556.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5557.96,"end":5569.89,"speaker":"Fr Stephen De Young","text":"You are saying that this Church Father was a heretic or was wrong or whatever, Right. This is pure. Pure postmodernism. Yeah. And then people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5569.89,"end":5576.45,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say on. On top of that, then also is. And. And by the way, I'm interpreting that Church Father correctly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5576.69,"end":5577.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5577.17,"end":5579.25,"speaker":"Fr Andrew Stephen Damick","text":"But we'll get to that a little bit more as we go. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5579.33,"end":5579.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5579.65,"end":5581.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Yeah. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5583.17,"end":5610.14,"speaker":"Fr Stephen De Young","text":"So, yeah, so we have this problematic now, Right. If you're going to take that modernist approach, that there is a meaning back there, it's very difficult to discern even where that meaning would lie. Right. And it's very easy to just lapse from modernism into postmodernism when you get frustrated trying to figure out what that meaning is. Right. Just decide, this is impossible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5610.14,"end":5611.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Throw your hands up."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5612.06,"end":5629.91,"speaker":"Fr Stephen De Young","text":"Yeah. So another version of this, a more nuanced version of this, shall we say. Right. And this is very common, is that People will suggest that we should basically read the Fathers and the Scriptures backwards."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5631.03,"end":5633.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Later stuff interprets the earlier stuff."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5633.91,"end":5649.07,"speaker":"Fr Stephen De Young","text":"Right. So you read the Fathers, use the Fathers to interpret the New Testament, use the New Testament to interpret the Old Testament. Right. And so that sounds reasonable at first."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5649.95,"end":5650.31,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5650.31,"end":5671.41,"speaker":"Fr Stephen De Young","text":"Right. Sounds a lot of people hear that, just accept it. Right. Many of our listeners probably just have accepted that in the past. Right. But now let me problematize that a little bit. Right. Because what does this presuppose? Well, this presupposes if we go, and we're going to go, Fathers, New Testament, Old Testament, Testament."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5672.13,"end":5672.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5672.85,"end":5698.01,"speaker":"Fr Stephen De Young","text":"That each one of those is clearer than the next. Right. So the Fathers, I could read the Fathers. And what the Fathers are saying about Scripture, how they're interpreting scripture is totally clear so that I can use that to understand the more difficult passages in the New Testament so that I can use those to understand the even more difficult passages in the Old Testament."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5699.52,"end":5700.56,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5701.12,"end":5718.72,"speaker":"Fr Stephen De Young","text":"And while I would submit, first of all, this is on the face, not true. Right. You are not going to convince me that it is easier to understand any of Saint Maximus the Confessor's ambigua than it is to understand the parable of the Prodigal Son."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5719.76,"end":5721.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5722.8,"end":5788.8,"speaker":"Fr Stephen De Young","text":"It's right. I mean, just on its face. Right. I'm not saying understand every nuance of the parable of the Prodigal Son. Right. Saint Maximus can help us with that. But the gist, right. Christ's parables he told to peasant farmers, illiterate peasant farmers, and he communicated to them. Right. The means of salvation. So this is not right. And, and there are plenty of passages of the Old Testament, you know, the Ten Commandments are pretty clear. Right. We don't need a ton of Right. Like nuance to crack that code. Right. So that's a problem. There's also the problem that everything requires interpretation. You have to interpret the Fathers too. Right, Right, right. The Fathers, I don't know of any fathers, put it this way, who write in very simple, straightforward, easy to understand Greek. That doesn't require you to have any knowledge of the Bible or philosophy going into it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5789.44,"end":5797.52,"speaker":"Fr Andrew Stephen Damick","text":"Right. Even like Chrysostom, who is one of the most. I don't know at least. And I mean, I'm reading him in English translation."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5799.92,"end":5800.28,"speaker":"Fr Stephen De Young","text":"Often."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5800.28,"end":5822.88,"speaker":"Fr Andrew Stephen Damick","text":"A lot of what you read in translation is some of the most accessible stuff. But he's making all kinds of references, especially to the Bible and to other. Like he's not giving you, you know, you don't come to Chrysostom tabula rasa. You come. You know, he's making reference to things that you should know. He assumes, you know, he assumes his listeners know some of what he's talking about."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5823.28,"end":5842.61,"speaker":"Fr Stephen De Young","text":"Right. You know, so if you're. If you're coming to the New Testament only through the Fathers and to the Old Testament only through the New Testament and the Fathers, Right. You're not going to have a good time. Right. Because you're going to have a lot of trouble understanding the Fathers if you don't know anything about the Old New Testaments."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5843.41,"end":5844.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5845.09,"end":5877.63,"speaker":"Fr Stephen De Young","text":"Yeah. And likewise, you have to interpret the New Testament. Right. And the New Testament kind of assumes you've read the Old Testament. Right. Like that's constantly quoting it. Right. And applying it. Right. So it assumes you've read it. So we're starting to get to the end of the tunnel here. The light is starting to get bigger. Now, I know sometimes the shifting light at the end of your tunnel is just a freight train coming your way, but not in this case."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5878.35,"end":5878.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5879.15,"end":5880.59,"speaker":"Fr Stephen De Young","text":"In this case, it is hope."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5882.03,"end":5882.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5884.46,"end":5918.62,"speaker":"Fr Stephen De Young","text":"So what we're suggesting and what we've been doing in this show ever since it started is the opposite of this. It's reading forward, it's reading the Old Testament, coming to understand the Old Testament and what's going on there. Right. Bringing that into the New Testament to see how the New Testament reshapes, fulfills, transforms, transfigures the Old Testament, and then moving into the Fathers. Right. To see how they understand and apply both."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5919.9,"end":5933.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. I mean, and if you look like, you know, if you look, for instance, at the liturgical texts, which I would. I consider to be, in some set, a. Some sense, a subset of the Fathers, like liturgical texts, are patristic writings. Yes, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5933.58,"end":5936.02,"speaker":"Fr Stephen De Young","text":"Some of them, quite literally, like St. John of Damascus."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5936.02,"end":5937.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5937.02,"end":5937.58,"speaker":"Fr Stephen De Young","text":"We know."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5938.03,"end":5988.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Particular Fathers who wrote them. If you don't have a pretty thorough knowledge of the Bible, you're not going to get a lot of what's in there. I mean, really, it's so elusive, you know, and so, like the idea. And I mean, you sometimes get this, like there's this little subset, well, treating the. Treating the divine services as being sort of infallible guides that always interpret the Scripture correctly. And I mean, there's something to that, of course, as we've said. But. But again, it. They assume that, you know, that you're already familiar with the Scriptures. Right. So it becomes a kind of a feedback loop, you know, that it's. It doesn't quite work. As being a key to the Bible in. In many ways, as you said, it kind of goes the other direction. To understand the liturgy, you really need to know the Bible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5990.38,"end":5991.36,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5991.36,"end":5991.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":5992.08,"end":6001.44,"speaker":"Fr Stephen De Young","text":"And so now the time has come that I'm going to say something nice about George William Frederick Hagel."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6001.52,"end":6002.4,"speaker":"Fr Andrew Stephen Damick","text":"Here it goes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6002.72,"end":6003.2,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6005.6,"end":6006.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6006.8,"end":6030.76,"speaker":"Fr Stephen De Young","text":"This is not the only night. It's one of relatively few things. Nice things I have to say about him. Another one that springs to mind, just because it's funny, before we get into the actual one, is that at one point, Hegel did this extended debunk of phrenology, which was considered a science in the early 19th century when he lived."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6030.92,"end":6035,"speaker":"Fr Andrew Stephen Damick","text":"Look that up, everybody. What phrenology is. P, H, R, E, N. Well, no, you need."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6035,"end":6038.2,"speaker":"Fr Stephen De Young","text":"You need to know to get. To get his joke. Right. So."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6038.2,"end":6038.84,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6038.84,"end":6048.4,"speaker":"Fr Stephen De Young","text":"Phrenology was measuring people's heads, shapes of people's heads, to determine their character. And it was used for a lot of horrible racist pseudoscience."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6048.8,"end":6049.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6050.24,"end":6069.12,"speaker":"Fr Stephen De Young","text":"In the 19th century. So Hegel has this extended debunk, and toward the end of it, he says that if someone comes to you and starts talking about phrenology, the correct response is to crack their skull. So I do like that about."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6070.51,"end":6070.75,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6070.75,"end":6080.19,"speaker":"Fr Stephen De Young","text":"He was. He was an early. I mean, he would totally, if he was alive today, have a YouTube video, video like phrenology destroyed. You know, like."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6081.79,"end":6082.11,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6082.11,"end":6083.07,"speaker":"Fr Stephen De Young","text":"So that's not the."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6083.07,"end":6083.59,"speaker":"Fr Andrew Stephen Damick","text":"Destroyed."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6083.59,"end":6085.71,"speaker":"Fr Stephen De Young","text":"Yeah, that's not the nice thing I was gonna say about it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6085.71,"end":6088.63,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, there's two. Two nice things then. Yes. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6088.63,"end":6095.83,"speaker":"Fr Stephen De Young","text":"Yes. I didn't want people to think what I'm about to say. The more important thing is the only thing. So I was gonna say we should."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6095.83,"end":6102.07,"speaker":"Fr Andrew Stephen Damick","text":"Also mention everybody, that. That it's not the same thing as nephrology, which is, you know, your local kidney doctors and nephrologists."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6102.07,"end":6102.63,"speaker":"Fr Stephen De Young","text":"Yes. No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6102.63,"end":6105.23,"speaker":"Fr Andrew Stephen Damick","text":"Or phlebotomy, which is the guy who."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6105.23,"end":6108.35,"speaker":"Fr Stephen De Young","text":"Takes blood out of you. So just put it. That's a phlebotomist. Yes, yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6108.35,"end":6108.71,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6108.71,"end":6142.97,"speaker":"Fr Stephen De Young","text":"But so here is the nice thing about Hegel relevant to this. So Hegel is usually credited with being the one who introduced the concept of history to philosophy. Right. In that. In that. Right. So people talked about ideas or concepts before Hegel. In philosophy, they. They thought of philosophers as sort of like talking heads. Like floating. Talking heads. Right. So like Plato says this. Aristotle says this. Yeah, Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6143.45,"end":6144.97,"speaker":"Fr Andrew Stephen Damick","text":"Pure. Pure concepts."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6146.09,"end":6158.77,"speaker":"Fr Stephen De Young","text":"Right. And interacting with them. And some of them saw development. Right. Obviously, this later guy builds on this earlier guy. Right. You know, Plato's a student of Socrates, Aristotle's a student of Plato. Right. Etc."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6158.77,"end":6159.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6159.57,"end":6184.86,"speaker":"Fr Stephen De Young","text":"But so then when. It's when you have this concept of building. Right. Or if you're, for example, a Western Christian, you'd say Thomas Aquinas built on Aristotle. Right. Then what you want if somebody's building on someone else is you want the latter part. Right? So Thomas Aquinas took all the good parts of Aristotle. So just take him. You don't have to worry about Aristotle anymore. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6184.86,"end":6186.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One of."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6186.54,"end":6222.73,"speaker":"Fr Stephen De Young","text":"One of two approaches. Right. But so when Hegel talks about concepts, he talks about them growing organically through time. Right? So it's like you have a stem and then it buds and then the flower opens. Right. And when that happens, you don't, like, cut off the stem in the bud and just keep the petals, because that's the important part that was at the end of the chain. Right, Right. Or to give another example that Hegel himself uses, if you want to claim to understand an oak tree, you also have to understand an acorn."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6223.77,"end":6224.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6224.57,"end":6233.66,"speaker":"Fr Stephen De Young","text":"And a sapling. Right. You have to understand the organism all the way through. Right. Not just the end result. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6233.66,"end":6245.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not that. The end result is not just the latest, greatest version. And so we don't need, you know, it's not like getting a new cell phone where, you know, it's better than all the previous cell phones that you don't need now."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6245.62,"end":6253.54,"speaker":"Fr Stephen De Young","text":"Right. And so I think this bit from Hegel is helpful as an analogy. That's why I'm bringing it up."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6253.54,"end":6253.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6253.98,"end":6254.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6254.26,"end":6255.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're not Hegelians."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6255.93,"end":6256.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6256.09,"end":6257.45,"speaker":"Fr Andrew Stephen Damick","text":"We're not endorsing Hegel."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6257.53,"end":6271.29,"speaker":"Fr Stephen De Young","text":"Oh, that's going to be all over Reddit tomorrow. Your spirit is Hegelian. But that this is helpful for thinking about Scripture."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6271.93,"end":6272.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6272.33,"end":6287.82,"speaker":"Fr Stephen De Young","text":"In that you see truth. Right. Which is Christ ultimately introduced in the Old Testament, and then it grows and it comes to flower in the New Testament. Right. In the person of Jesus Christ, in the full revelation of Jesus Christ in the New Testament."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6287.98,"end":6288.54,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6288.54,"end":6291.9,"speaker":"Fr Stephen De Young","text":"Right. And when that happens, you don't throw the Old Testament away."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6292.7,"end":6293.1,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6293.58,"end":6293.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6293.9,"end":6294.86,"speaker":"Fr Andrew Stephen Damick","text":"They certainly didn't."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6295.1,"end":6309.23,"speaker":"Fr Stephen De Young","text":"Because in order to really understand the full revelation of Christ in the New Testament, you have to also understand the acorn. Right. You have to understand the beginning and the growth and the development up to the fulfillment and the flowering."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6310.82,"end":6311.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6311.86,"end":6318.1,"speaker":"Fr Stephen De Young","text":"And this kind of approach is why we're always starting in the Neolithic era on this show."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6318.26,"end":6319.06,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6319.14,"end":6347.82,"speaker":"Fr Stephen De Young","text":"Right. Or the beginning of Genesis. Right. And. And tracing these things through, because to understand how they come to flower and be fulfilled in Christ, you have to follow that growth, you have to follow that gradual unfolding. Right, right. That happens through the Scripture. So on a more practical. Now we're going to get more practical, and we're going to get really practical in the third half. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6347.9,"end":6348.34,"speaker":"Fr Andrew Stephen Damick","text":"Here's."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6348.34,"end":6383.46,"speaker":"Fr Stephen De Young","text":"We're coming toward the end of half two. So we talked about. We're coming back to where we started here in Act 2, which. Where does that meaning lie? Right? So we're not going with the modernist presupposition. We don't think each text, each verse, each passage has this one single meaning that's off somewhere and locatable. Right, but then how, how do you go about beginning to interpret these texts if we're going to go through the Old Testament, the New Testament, and watch these things grow and unfurl."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6383.54,"end":6395,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And we're definitely, we're definitely not saying, because we don't think that there's a single objective meaning for every single text, that there's no therefore, no meaning, or that any meaning goes like that'. Definitely not what we're saying."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6396.04,"end":6397.32,"speaker":"Fr Stephen De Young","text":"There's no single."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6397.64,"end":6412.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And I think that's, that's the big fear is like, okay, well, look, if you, if you sort of lose that sense of scientific, scientificity, you know, of, of, of this, then, then what are you left with? Right? Like, it just all relativism."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6413.32,"end":6416.12,"speaker":"Fr Stephen De Young","text":"If you're not a modernist, you must be a postmodernist."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6416.68,"end":6420.28,"speaker":"Fr Andrew Stephen Damick","text":"Right? And, and, and you know what, everybody? Those are not the only options."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6420.71,"end":6422.87,"speaker":"Fr Stephen De Young","text":"Yes, those are not, thankfully."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6423.19,"end":6425.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, right, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6425.99,"end":6474.04,"speaker":"Fr Stephen De Young","text":"So unless you're writing a dissertation at certain universities, they are the only options. But no, so, so don't go. What's, what's the beginning of an approach? Right? A beginning of an approach is rather than trying to reconstruct the mind from which the text emanates, we try to reconstruct the ear, the people who heard these texts first. We're not going for any specific person here, right. In their individuality and their subjectivity. We're going for a time, a place, a people group, right. That we can know relative amounts about. How would they have heard this text?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6475.14,"end":6475.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6475.7,"end":6479.54,"speaker":"Fr Stephen De Young","text":"This is a starting point, not an ending point. Right, but this is a starting point."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6479.54,"end":6479.94,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6480.02,"end":6488.66,"speaker":"Fr Stephen De Young","text":"So what are some examples of this? So test case for this, Giants and demons, right? Something we talk about a fair amount."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6489.14,"end":6494.26,"speaker":"Fr Andrew Stephen Damick","text":"Our ratings just went up for this episode because you just mentioned giants. Everyone got very excited."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6496.82,"end":6514.09,"speaker":"Fr Stephen De Young","text":"So, and this is some interactions we've Gotten about. When we talk about giants, right. We get essentially requests that we. We have to prove that Nephilim are giants. We have to prove exactly what being a giant meant."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6514.09,"end":6514.61,"speaker":"Fr Andrew Stephen Damick","text":"We have to."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6514.85,"end":6519.01,"speaker":"Fr Stephen De Young","text":"Can you prove that? Right. And that's taking this modernist approach. Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6519.25,"end":6520.05,"speaker":"Fr Andrew Stephen Damick","text":"We learn."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6520.53,"end":6520.93,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6520.93,"end":6522.13,"speaker":"Fr Andrew Stephen Damick","text":"But that's what's going on."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6522.21,"end":6580.01,"speaker":"Fr Stephen De Young","text":"We love you, but you need to set yourself free from the chains of modernism. That unshackled, you're saying. Because what that question presupposes is there's this one meaning behind the text. You need to prove to me that this meaning you're proposing is the one meaning. Right. You're making this claim. Right. And then are they tall people? Are they like genetic hybrids of angel and human? Are they? Right. So we're approaching it more from the perspective of when the first readers, or early readers at least, of Genesis 6:1:4, when they heard that about the sons of God and the daughters of men, and they heard about the Nephilim, the men of renown, what connections would they have reasonably made?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6581.75,"end":6582.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6582.71,"end":6588.79,"speaker":"Fr Stephen De Young","text":"And we know, thanks to Second Temple Jewish literature, ancient Near Eastern literature, we know the other stories they had heard."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6589.59,"end":6589.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6590.63,"end":6607.76,"speaker":"Fr Stephen De Young","text":"We know how they would have seen these references connecting to each other. Right? They would have. These are the connections they would have made. Right. So we're not arguing about this hypothetical one single meaning behind it. We're saying, no, this is how people read it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6608.07,"end":6608.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6608.27,"end":6619.83,"speaker":"Fr Stephen De Young","text":"And going from giants to demons. Right. This is why that book. I want to say Archie Leach again. He's haunting me. Cary Grant."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6624.23,"end":6625.67,"speaker":"Fr Andrew Stephen Damick","text":"Now I'm blanking on it, too."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6625.67,"end":6646.97,"speaker":"Fr Stephen De Young","text":"Yeah. Origin of Evil Spirits. Right? Yeah, yeah, right. What he does is he goes to the 1st century who did? 1st century people living in Judea based on their writings, based on the text, the stories that were going around. Where did they think these demons that were possessing people came from?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6647.29,"end":6648.33,"speaker":"Fr Andrew Stephen Damick","text":"From Archie Wright."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6648.73,"end":6649.53,"speaker":"Fr Stephen De Young","text":"Archie Wright."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6650.33,"end":6651.93,"speaker":"Fr Andrew Stephen Damick","text":"No. Yeah. Where did they think it was? Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6652.25,"end":6654.13,"speaker":"Fr Stephen De Young","text":"Where do they think these demons came from?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6654.13,"end":6654.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6654.85,"end":6663.37,"speaker":"Fr Stephen De Young","text":"The people who first read the Gospels, that read these accounts of Christ casting out demons, and if you come to torment us before the time, what did they think that meant? How would they have read that?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6663.53,"end":6677.53,"speaker":"Fr Andrew Stephen Damick","text":"Which is a separate question from, were they wrong about this? Were they right about. Because, like, if they're wrong about it, then, you know, then how am I supposed to be right about it? Like, what do I have that they didn't?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6678.01,"end":6680.97,"speaker":"Fr Stephen De Young","text":"Well, even that question, were they right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6681.45,"end":6681.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6682.17,"end":6684.97,"speaker":"Fr Stephen De Young","text":"What does that mean again? That's treating the Bible as if."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6684.97,"end":6685.53,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6685.69,"end":6691.25,"speaker":"Fr Stephen De Young","text":"You're saying that this exorcism story in the Gospel claim is making a claim."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6691.57,"end":6691.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6691.89,"end":6693.09,"speaker":"Fr Stephen De Young","text":"It's not making a claim."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6693.81,"end":6694.93,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6694.93,"end":6696.05,"speaker":"Fr Stephen De Young","text":"It's telling a story."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6696.05,"end":6697.93,"speaker":"Fr Andrew Stephen Damick","text":"Telling a story. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6697.93,"end":6701.01,"speaker":"Fr Stephen De Young","text":"And the context in which that story was heard."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6701.17,"end":6742.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that this issue underlines how hard this is. I mean, as modern people, this is simply the way that we think. Right. So we have to, you know, part of, part of our project on this podcast is to try to at least give us a framework that we can enter into for a while, to try to begin to think differently, you know, not just to try to make everything into an empirical quest. Because some things, if you, if you embark on that, if you embark on empirical quest to understand what's in the scripture, you're going to actually miss the way that people received it when it was first given, because they weren't on that quest."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6743.15,"end":6748.83,"speaker":"Fr Stephen De Young","text":"Right, right. There was no quest for the historical Jesus before the 18th century. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6748.83,"end":6750.35,"speaker":"Fr Andrew Stephen Damick","text":"Just wasn't a thing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6750.59,"end":6751.23,"speaker":"Fr Stephen De Young","text":"Didn't happen."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6753.79,"end":6754.19,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6756.03,"end":6785.02,"speaker":"Fr Stephen De Young","text":"Another test case, another example. Right. I hate to bash our Calvinist friends, do you? For the sake of argument, I do, but Romans 9, right, Romans 9. When St. Paul brings up Jacob and Esau, he's talking about Jacob and Esau to people who were incredibly familiar with the story of Jacob and Esau that's contained in Genesis."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6786.38,"end":6786.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6787.26,"end":6823.88,"speaker":"Fr Stephen De Young","text":"He was not bringing up two hypothetical people, one of them good and one of them evil. Right, right, right. One of them loved by God and one of them hated by God, one of them elect and one of them reprobate. He's not bringing up two random people. Right. The people who first heard him make that argument knew that story. So they knew, for example, that Jacob and Esau reconciled at the end of that story. Right. They knew. They had read Deuteronomy 2 and knew that at that point the were still worshiping Yahweh, the God of Israel, and."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6823.88,"end":6827.24,"speaker":"Fr Andrew Stephen Damick","text":"The Edomites are Esau's people everywhere, by the way. Everybody."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6827.24,"end":6859.49,"speaker":"Fr Stephen De Young","text":"And they had read on to Obadiah and seen that. That changed later. And that's when they were judged. And so when they hear St. Paul talking. Right. We don't have to try to get inside St. Paul's head and see what he's trying to do. We can see how anyone familiar with that story would understand what he's saying. And you could go listen to a certain episode of whole counsel of God on that if you want to. It's not Calvin's approach. Right. If you take the actual story into account."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6860.77,"end":6870.05,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. He's importing that Whole history in that old sense. That whole history from the Old Testament into his conversation."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6870.93,"end":6872.21,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6872.21,"end":6878.5,"speaker":"Fr Andrew Stephen Damick","text":"And so reading what he says is contrary to that history, then therefore does not make sense. Right, right. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6878.5,"end":6900.82,"speaker":"Fr Stephen De Young","text":"Right. And the response when I point that out of, well, you have to use the New Testament to interpret the old testament. So St. Paul is saying that is what Genesis means, again, is kind of a quasi postmodern thing. Right. Like I've got to go back and read Genesis against the grain now to try and make it mean what you say St. Paul means."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6901.22,"end":6906.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Why is St. Paul negating Genesis?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6906.57,"end":6907.13,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6907.13,"end":6913.09,"speaker":"Fr Andrew Stephen Damick","text":"Why would he do that? If he's going to do that, he needs to explain why he's doing that. And he doesn't say that he's doing that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6913.09,"end":6927.53,"speaker":"Fr Stephen De Young","text":"Yeah, he doesn't. And saying he's doing it on apostolic authority is also a cop out because you're essentially arguing that St. Paul was given authority by the Holy Spirit to interpret the Bible badly, which doesn't make a lot of sense."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6927.69,"end":6928.09,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6929.21,"end":6933.93,"speaker":"Fr Stephen De Young","text":"So third test case, because we got to do things in three. We're orthodox."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6934.09,"end":6934.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6934.65,"end":6935.77,"speaker":"Fr Stephen De Young","text":"It's three or 40."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6936.01,"end":6940.81,"speaker":"Fr Andrew Stephen Damick","text":"Or 40. Occasionally 12. Yeah. Once in a while. 100."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6941.21,"end":6987.14,"speaker":"Fr Stephen De Young","text":"Yeah. So a third test case, which is a place where people have wasted a ton of time, frankly. And this is comparing Isaiah 7, verse 14, and Matthew 1, verse 23. Behold, a young woman or a virgin will bear a child, and they'll call his name Immanuel. Right, right. So what causes the problem here, Right. Is that the word in the Hebrew, alma, just means a young woman and not a virgin, per se. Parthenos. By the first century that St. Matthew uses, the first century mostly meant a virgin."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6987.86,"end":6988.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6988.18,"end":6990.58,"speaker":"Fr Stephen De Young","text":"But it could also just also meant a young woman."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6990.66,"end":6991.46,"speaker":"Fr Andrew Stephen Damick","text":"A young woman."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":6992.66,"end":7021.55,"speaker":"Fr Stephen De Young","text":"At the time the Greek translation of the Old Testament was made, it was more a young woman also. But anyway, so people get into this whole thing of, oh, see, it doesn't say virgin. So they treat. They're doing this thing we talked about. They're saying St. Matthew claims that Isaiah predicted a virgin birth. And so if we could prove that that's not what Isaiah was claiming, then St. Matthew's claim is false, the Bible's false and Christianity goes away. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7021.55,"end":7022.59,"speaker":"Fr Andrew Stephen Damick","text":"Boom. Check that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7023.07,"end":7121,"speaker":"Fr Stephen De Young","text":"Right. But so if we instead of reading this backward, read this forward. Right. Then when we read Isaiah 7, we'll read the whole chapter maybe, and see that this is in the middle of the Syro Ephraimite war, which was very poorly named because it was not a war between the Syrians and the Ephraimites. It was a war in which the Syrians and the Ephraimites, the northern kingdom of Israel, attacked Judah, but they attacked Judah. Judah was in dire straits. They were losing. Isaiah comes and makes this prophecy and says, this young woman standing here is going to have a baby. And before that baby is old, old enough to know right from wrong, if you're old enough to know good or evil, you'll be delivered from the combined army of the Syrians and the Israelites. Right? And that happened. It happened in Isaiah, it happened in the Old Testament. That prophecy he made came true. He wasn't talking at that time about a virgin birth. He wasn't talking about anything happening in the first century A.D. and St. Matthew isn't claiming he was right, because that's not how this works, Right? The truth comes, it flowers, right? This idea of fulfillment being filled full to overflowing. So what St. Matthew is doing is saying, hey, you guys who have all read Isaiah, you've all heard Isaiah read in the synagogues every day of your life. Well, maybe not every day, every Saturday of your life, that's every Sabbath."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7122.92,"end":7123.36,"speaker":"Fr Andrew Stephen Damick","text":"You'Ve."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7123.36,"end":7154.82,"speaker":"Fr Stephen De Young","text":"Heard this story a hundred times, right? And you remember how the birth of that child signaled that the delivery of God's people was near. Well, guess what? Right, right. Guess what? Even more birth of Christ that he's describing in Matthew chapter one, the birth of Christ in this much fuller, richer, deeper, eternal sense means that God is now going to shortly deliver his people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7155.62,"end":7288.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think one of the things that's really important to underline in the midst of this, like you just said, you know, they would have heard this, for instance, every Saturday of their lives in the synagogue. I think we should underline that because the way that a lot of modern people approach biblical interpretation is largely looking at a book that maybe they don't know the nooks and crannies of and haven't heard the same stories a hundred times before. Right? And I mean, some people certainly that know the Bible very, very well, but when even people that are that do know it really well, we receive it in the midst of a culture full of all kinds of other stories constantly, you know, like this is the massive information age, right? Whereas in 1st century, the Holy Land, yes, there were other stories going on in their culture other than what's in the Bible, but nowhere near like what we have. And they were ritually participating in these stories over and over and over and over again. So they all grew up hearing them. The general culture knew the Old Testament way better than most Christians today do because they were just in it all the time. Right. And so then when the New Testament makes allusions or references or quotes from the Old Testament, it's importing it stuff much more powerfully than it is even for us. Like, we have to look at little marginal notes like, oh, is that a reference to something in Isaiah? You know, I mean, this is obviously a very famous example. But, you know, they would not have needed these cross reference Bibles to the extent that we do now because this was just simply, these are their societal stories. This is the history of this people. You know, it's embedded, like, in a way that I think it's hard for us to really, really get. I mean, I think people who belong to liturgical churches who are really dedicated to being in services a lot begin to get this. Like, I've seen it with my own kids that they know so many biblical stories that I never, you know, to my shame that I didn't read them all to them. But they know them. Why? Because they're in church, because they're hearing them. They're richly participating in them."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7290.9,"end":7298.66,"speaker":"Fr Stephen De Young","text":"Yeah. And even if you absolutely hate my approach, at least it saves me a lot of these unending arguments."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7300.9,"end":7308.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. All right, well, that said, we're going to go ahead and take a break and we'll head on into our third half. We'll be right back."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7308.84,"end":7325,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-Radio."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7330.6,"end":7332.52,"speaker":"Fr Andrew Stephen Damick","text":"Big in Heaven, a collection."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7332.52,"end":7335.88,"speaker":"Announcer","text":"Of short stories available now on the Ancient Faith Bookstore."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7337.26,"end":7342.7,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes poignant, sometimes funny, sometimes heartbreaking, sometimes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7342.7,"end":7353.26,"speaker":"Announcer","text":"Convicting, these stories of life in an inner city, immigrant Orthodox parish are guaranteed to shake your assumptions and make you see your life and faith in a new way."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7353.98,"end":7361.42,"speaker":"Fr Andrew Stephen Damick","text":"They are not for the faint of heart, but they are very much for all who want to embrace the truth more fully."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7361.88,"end":7369.88,"speaker":"Fr Stephen De Young","text":"And you didn't have to ask Raskova for help cleaning, polishing, carrying in or out any work in the church."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7369.96,"end":7374.12,"speaker":"Fr Andrew Stephen Damick","text":"The woman was a stalwart, a Tovarish you could count on."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7374.84,"end":7381.92,"speaker":"Fr Stephen De Young","text":"No one knew her suffering. They never bothered to look into her eyes. It surprised me that most of the."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7381.92,"end":7384.36,"speaker":"Fr Stephen De Young","text":"Church folks at St. Alexander the Whirling."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7384.36,"end":7390.49,"speaker":"Fr Stephen De Young","text":"Dervish Parish didn't even know her name. It wasn't anything they thought about to."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7390.49,"end":7416.78,"speaker":"Announcer","text":"Find this book and others like it you can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2347. That's 855 AF radio."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7418.62,"end":7485.74,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. It's the third half of the Lord of Spirits here, the week before Holy Week, if you're listening to us live. So we're right on the cusp of hearing big, massive piles of scripture in church, which is always just such an amazing, amazing experience. Okay, so we've gone through to the end of the tunnel. We've seen some light, done a few test cases. How do we kind of take this forward? Like, how do we integrate this right into the way that we think, into the way that we interpret the Bible, the way that we read the Bible, into the way that we think about how the Orthodox Church does those things? All right, folks, we seem to be having a little bit of technical difficulty here. I guess it's been a long time since we had technical difficulties. Okay. Well, we're going to go ahead. And while we try to get Father Stephen back on the line, we're going to go ahead and take a caller who is calling, I believe from Canada, or at least his phone number says he's in Canada. So I'm not sure how to pronounce your name. You're going to have to tell me. Are you there, caller? Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7485.74,"end":7488.34,"speaker":"Radu","text":"This is Radu from New Brunswick, Canada."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7488.66,"end":7498.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay, welcome. Welcome to the Lord of Spirits. How are you this evening? We're trying to get Father Stephen back. So I can't guarantee that I would necessarily say whatever he would say. But what's on your mind?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7500.32,"end":7553.06,"speaker":"Radu","text":"Thanks for taking my call, Father. Yeah, I was just wondering what you kind of started touching on this at the end of the last half, which is we talked a lot about how the text should be interpreted and used that word a lot. But I'm also thinking about how people would have interacted with all this 12th century Romanian peasants. You know, nobody can read or very, very few. They see the icons painted on a wall on a country church. They maybe most of the text is not in a language they can understand. The liturgy might not be in a language they understand. It's all either oral tradition or you see a bunch of icons on the wall. Nespresso is on the outside of the monastery church they see once a year on pilgrimage, that sort of thing. And how all of this discussion would have been relevant and real for them in that kind of non textual world."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7554.02,"end":7704.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I mean, right. I mean, most people are not listeners to Lord of Spirits. You know, most people are not doing biblical scholarship. Most people are not diving into these questions in the way that we're talking about them, right. So there's, you know, even like within the scenario you're talking about, I mean, it's still, even now, most people are simply hearing the scriptures in church, right? That's, that's how they're getting it, right. So yeah, I mean, I think that what we're talking, I mean, we're analyzing this from a very kind of intellectual point of view on a certain level. But, but the way that most people, the way that most people are actually experiencing church. Right. Actually does produce this for them. Right? Because if like for instance, I think about my own kids, they're growing up in church, they're hearing the stories of the scripture, right? And so they receive all of this together as one narrative experience, right. For them, unless I tell them, look, the Old Testament and New Testament are not one integrated piece. They have no reason to believe that it, that it's not right. So what's happened is that there's a lot of weeds that have grown up within culture that have made it hard for people to simply have that experience of simply growing up with scriptures and growing, you know, growing up with all these things that are connected together. Right. I mean, we've said a bunch of times you don't have to have read the book of Enoch in order to understand, you know, in order to receive the scriptures in the church for your salvation, right? You don't have to have done that. But if you are faithful within the church, I'm not saying you have to have grown up within it, but if you are faithful and are willing as much as possible to, to be taught by what you're experiencing, then you, you will begin to get it. A lot of what we're trying to do is to try to clear away the weeds of modern culture that are simply there and that we can't, you know, we can't help but have to deal with it. Right? Does that make some sense? Yeah, yeah, it doesn't."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7704.11,"end":7708.35,"speaker":"Radu","text":"It's also quite heartening because I have young kids, so that's good, right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7708.35,"end":7806.09,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's been fascinating to me to watch my kids. Like My oldest is 15 and my youngest is 5 and then I have a 12 year old and an almost 10 year old. It's been fascinating to me, to watch them, the way that they understand the scripture, the way that they understand the story that the church is telling is actually very different from in many ways the way that I do, or in some cases, I've had to work really hard to get to where they are just growing up with it naturally. Right. And if they don't ever want to be biblical scholars or even just sort of fans of biblical scholarship, which is kind of what I sort of am, that's okay. They don't have to be. They can still receive this for their salvation. They can even still have this integrated view. Like one of the things that I've sort of observed is that a lot of Christians these days are functionally Marcionists. Right. You know, Marcion, that early church heretic who basically said the Old Testament, you should throw it out because that's an evil God who created the world and that's not the father of our Lord Jesus Christ. A lot of Christians are functionally Marcionists. Like I've even heard people within the Orthodox Church say to me, when I'll say, I'll make a reference to the Old Testament and they'll say, oh, well, you know, we don't need that anymore. We have the New Testament and that's exactly what we're talking about. I mean, that's a really terrible version of it even, you know, the idea that the Old Testament doesn't even matter anymore. So does that make sense?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7807.93,"end":7808.37,"speaker":"Radu","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7808.37,"end":7808.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7808.69,"end":7811.45,"speaker":"Radu","text":"Thank you, Father. Can I have just a tiny, tiny little follow up?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7811.93,"end":7813.13,"speaker":"Fr Andrew Stephen Damick","text":"Sure, absolutely."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7814.25,"end":7826.62,"speaker":"Radu","text":"Which is more of a tiny suggestion I'd like to throw in Golden Jubilee Hall Senior center in Sussex, New Brunswick, as location for the first inaugural Lord of Spirits of Palooza."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7827.02,"end":7833.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, all right. We will take that under their advisement. So thank you very much, Radu."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7833.82,"end":7838.14,"speaker":"Fr Stephen De Young","text":"All right, so longtime co host, first time caller."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7838.22,"end":7839.26,"speaker":"Fr Stephen De Young","text":"Hey, there you are."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7839.9,"end":7848.76,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, well, welcome back. Yes. So as you can hear, everybody, we've got Father Stephen on the phone. But, but, but there you are, everybody."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7848.84,"end":7852.52,"speaker":"Fr Stephen De Young","text":"It's late, so everything's going badly. Okay, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7853.56,"end":7868.84,"speaker":"Fr Andrew Stephen Damick","text":"So anyway, well, not ideal, but, but we can understand you. So. All right, well, we. Yeah, yeah, we actually. Okay, so we have one more caller and why don't we talk to Matt? So, Matt, what's on your mind?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7871,"end":7871.88,"speaker":"Radu","text":"Are you guys there?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7872.62,"end":7872.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7875.34,"end":7905.23,"speaker":"Radu","text":"I was wondering how to interpret scripture through the noose, the noetic way. I think about. I forget what desert father it was. I think I can never pronounce his name right. Marcavius or whatever his name was, how he explained Ezekiel 1 as a surrender soul. And I feel like that might be like a noetic way of interpreting scripture, but. Yeah, like, like that's an example of understanding Scripture through the news."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7907.47,"end":7909.39,"speaker":"Fr Andrew Stephen Damick","text":"Father Stephen, you want to start off on that one?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7910.59,"end":7915.79,"speaker":"Fr Stephen De Young","text":"Well, that's, I mean, that's kind of what we're going to be talking about in the third half. So there you go."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7915.79,"end":7916.39,"speaker":"Fr Stephen De Young","text":"That's a good thing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7916.39,"end":7958.86,"speaker":"Fr Stephen De Young","text":"It means you're tracking with us. Yeah, that. And so, yeah, we're about to go back to the fathers and sort of talk about what they're doing and how they're doing it. Right. And what that idea of the phronema, the way of the noetic way of reading the scriptures that the fathers do, what that is, if it isn't sort of taking a straw poll of patristic quotes. And then judging from that. So I guess mainly my unsatisfactory answer is stay tuned here."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7959.26,"end":7973.26,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, so hang on and just keep going with us. So thank you very much for calling. Okay, so Father, since before we got so rudely interrupted by whatever it is happened to your equipment there. Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7973.98,"end":7975.18,"speaker":"Fr Stephen De Young","text":"Low grade detonation."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7975.42,"end":7975.9,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7976.14,"end":7977.18,"speaker":"Fr Andrew Stephen Damick","text":"Oh boy."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7979.26,"end":7979.66,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7980.14,"end":7980.62,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":7981.18,"end":8030.17,"speaker":"Fr Stephen De Young","text":"So, yeah, so we talked about, you know, at the end of half two, we talked about sort of moving from the Old Testament into the New Testament, but we sort of, as we just mentioned, didn't forget about the Fathers. We aren't just casting them aside. But then the question is if, right. The truth comes to flower in the revelation of Christ in the New Testament, then what are the Fathers doing? And to get at that, we have to make a distinction between the idea of interpretation and the idea of application. These are two different things. So interpretation more describes what we've been talking about."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8030.94,"end":8031.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8031.26,"end":8053.98,"speaker":"Fr Stephen De Young","text":"In a more negative sense, the idea that the Fathers are looking at the text of Scripture and trying to ascertain this one true meaning. Right. That that lies behind it. And that when they therefore say different things, that means they disagree about what that one meaning is."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8054.86,"end":8056.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8057.72,"end":8073.48,"speaker":"Fr Stephen De Young","text":"Whereas we're going to suggest application is something different. And a good way, a good orthodox way of thinking about that distinction is the theological distinction we make between essence and energy."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8074.36,"end":8074.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8075.8,"end":8082.54,"speaker":"Fr Stephen De Young","text":"We make that distinction in terms of God, as we've talked about on the show. We make that distinction about everybody."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8083.58,"end":8083.98,"speaker":"Fr Andrew Stephen Damick","text":"Sure."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8083.98,"end":8111.22,"speaker":"Fr Stephen De Young","text":"But it's also worth thinking about in terms of, in terms of the Scriptures and their interpretation. So when we talk about the distinction between God's essence and his energies, what we're saying is that God is not like an essence. He's not a being, even a supreme being, that we comprehend with our intellect."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8112.1,"end":8112.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8112.46,"end":8146.54,"speaker":"Fr Stephen De Young","text":"That we go and perform an intellectual process and arrive at exactly who God is, but rather we encounter God in action. Right. The divine energies are God, but they're God in action. Right. We encounter God loving, we encounter God transfiguring, we encounter God saving, we encounter God justifying. Right. Setting things. Right. And so we should think about meaning in terms of the Scriptures in much the same way."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8147.02,"end":8147.42,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8147.42,"end":8184.99,"speaker":"Fr Stephen De Young","text":"And this is what we're suggesting the Fathers do, that the Fathers are not peering into the Bible and trying to use an intellectual process to arrive at the essence of this or that verse or this or that passage, this meaning that underlies it. Right. That stands behind it to intellectually comprehend what it is, but that through the Scriptures, God is encountered in action because God is acting through the Scriptures. And so as God is working through the Scriptures in applying those Scriptures."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8185.95,"end":8186.27,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8186.27,"end":8222.01,"speaker":"Fr Stephen De Young","text":"Whether they're doing it sort of in a direct way, as when St. John Chrysostom is preaching a homily after the reading of the Scriptures, and he's taking them and applying them a little more subtly, as you know, St. Gregory the Theologian, when he writes a treatise on a current trinitarian debate. Right. And references Scripture, they are participating sort of instrumentally as an instrument of God through which the work that God is doing in Scripture is applied to the people who are under their spiritual authority."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8222.41,"end":8222.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8224.14,"end":8249.9,"speaker":"Fr Stephen De Young","text":"In their particular time and place. And if we think about it that way, that has a whole bunch of consequences. Right. Over against the kind of interpretation model. It means that Scripture. We need to think of Scripture more as a mystery in the sense that that word is used in the Orthodox Church. Right. To talk about things that in the west are called sacraments."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8251.05,"end":8251.61,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8251.69,"end":8285.98,"speaker":"Fr Stephen De Young","text":"Sort of a material thing. That the reading of Scripture is a material thing, an audible thing through which God works, through which the divine energies are made present. God himself becomes present in a transformative way for people. And if we accept that this is the way the reading of Scripture primarily works, then that means that like all mysteries, like all sacraments, the proper home of them is within the liturgical life of the church."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8286.7,"end":8287.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8287.06,"end":8324.74,"speaker":"Fr Stephen De Young","text":"The sort of initial and proper home. So that also then has its own consequences. Right. And we're not really used to thinking this way because again, we're in the. The modern or postmodern contemporary world. And we've been by our culture, if not the church we attended, we've been encouraged to see sort of our own personal sitting down and reading the Bible as being the primary venue of the Bible."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8325.14,"end":8325.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8325.5,"end":8325.78,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8328.34,"end":8334.9,"speaker":"Fr Andrew Stephen Damick","text":"That Bible study equals me alone, you know, doing this thing with. With this book."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8336.5,"end":8354.66,"speaker":"Fr Stephen De Young","text":"Right, right. And we wouldn't say that about any other mystery slash sacrament. Right. Like, I know there are people who do this, but hopefully most of our listeners would understand why the whole communion, for one thing, is kind of out. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8355.06,"end":8357.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although it didn't happen on the moon."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8359.22,"end":8365.86,"speaker":"Fr Stephen De Young","text":"Yeah. So literally way out there who have done things. But."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8366.02,"end":8366.5,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8368.42,"end":8373.62,"speaker":"Fr Stephen De Young","text":"Or someone going and baptizing themselves other than Robert Duvall and the apostle. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8373.62,"end":8374.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8374.1,"end":8374.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8374.98,"end":8375.78,"speaker":"Fr Andrew Stephen Damick","text":"Excellent film."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8378.74,"end":8393.84,"speaker":"Fr Stephen De Young","text":"Right. But the same is true. The same is true in Scripture. That Scripture, because its natural home is in the liturgical life of the Church. That means its primary mode of reading is being read publicly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8394.08,"end":8394.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8394.56,"end":8400.96,"speaker":"Fr Stephen De Young","text":"Being read aloud. And the Hebrew word for read is even the verb that means to call out."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8402.08,"end":8404.48,"speaker":"Fr Stephen De Young","text":"So it's out loud to sit and think."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8404.64,"end":8405.8,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8405.8,"end":8426.99,"speaker":"Fr Andrew Stephen Damick","text":"And I think that in most of history, at least, you know, the more the European history that I'm aware of, reading out loud is the way that you read until, I don't know, like, pretty late. You know, like, it's pretty late. That the texts were not read silently. Hardly ever."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8430.11,"end":8440.75,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And St. Augustine mentions knowing a crazy person, and the reason everybody thought he was crazy was that he read to himself."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8441.47,"end":8444.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Without any words coming, any sound coming out."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8444.83,"end":8451.06,"speaker":"Fr Stephen De Young","text":"Yeah. Because everyone else, even if they were sitting in their house by themselves reading something, they read it out loud."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8451.86,"end":8452.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8452.82,"end":8459.62,"speaker":"Fr Stephen De Young","text":"So this guy was a complete weirdo. But that gives you an idea of."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8460.1,"end":8460.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8460.82,"end":8531.78,"speaker":"Fr Stephen De Young","text":"Understanding that collective initial context, and by it being in the context of a liturgical life of the Church, that means that whatever portion of Scripture is reading is also set in a larger ritual and narrative context. Right. So a good example of this will be for folks a week from today when we read the 12 Passion Gospels. We not only read the whole Gospel accounts of Christ's Passion in all four Gospels. Right. And. But we do that in the context of a liturgical service in which we also enact what's going on in those stories and so that those there are brought into a participation in those events. As we've talked about before, those events are made present, they're made now so that the people can participate. And the reading of Scripture is a part of that, a part of that whole. Right. These aren't sort of two separate things like, oh, we do this kind of reenactment, and then we also read the story. Right. Those are together and together for a reason."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8532.02,"end":8533.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8535.06,"end":8558.51,"speaker":"Fr Stephen De Young","text":"That is sort of the proper function and even in just your. Your typical Divine Liturgy on a Sunday morning, right. The. The Divine Liturgy itself is structured around the life and death and resurrection of Christ. And so the portions of Scripture read during it are set in that context as they're read publicly for participation."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8559.31,"end":8559.71,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8559.71,"end":8598.67,"speaker":"Fr Stephen De Young","text":"And so preaching that takes place, which. And this is a lot of the writing of the Fathers, right. Is some form of preaching and applying, whether it's literally a transcribed sermon or whether it's essentially a written sermon. Right. It's explicated, but it's aimed at. It would be a written sermon because it's aimed at some particular situation, some particular audience at some particular place in time. Right. Whether it's read, whether it's spoken aloud or whether it's written. And then someone went and read it aloud because, remember, the recipients of the writings were reading them aloud."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8598.91,"end":8599.31,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8601.07,"end":8643.19,"speaker":"Fr Stephen De Young","text":"Not silently. Preaching, then, is always a form of application. Right. So it would correspond. If we're thinking about the reading of Scripture as a mystery or a sacrament, it would correspond to, for example, actually giving the people communion. Right. Or pushing the kid's head under the water three times. Right, right. The. The. The actual direct application and participation by the preacher instrumentally in the work of God that's taking place through the Scriptures."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8643.75,"end":8718.29,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think one of the important things to underline in that context is like whether you're reading a patristic writing that's particularly a homily, or you're simply listening to a homily written in your own time or delivered in your own time. And is that the context in which it's given is an important element in understanding even the homily? Right. You know, that the way I remember, for instance, when I was in seminary, I mean, like, there's cultural pieces to this, too. I remember when I was in seminary that someone gave a sermon which was very exercised, you know, a lot of. A lot of very strong emotional experience expressions and so forth. And I thought to myself, oh, this is kind of similar to some of the Baptist preachers that I heard when I was younger. But we actually had a seminarian from Europe, from northern Europe who said, you know, if someone preached like that in my home country, we would think of them like they were some kind of crazy dictator. Right? So, like, you know, it was just received in a very different. And, you know, in northern Europe, they know something about crazy dictators. You know, it just received. Say that again."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8719.33,"end":8720.45,"speaker":"Fr Stephen De Young","text":"They've seen a couple."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8720.61,"end":8770.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. And so, I mean, so in his case, he didn't have the cultural context that the rest of us did. And so he received it very, very differently. Right. And he took a completely other meaning from it that was different from what the preacher intended and from what most of the hearers heard. So, I mean, that context is really, really important. So even if a church father says xyz, it's important to try to understand as much as possible the audience that he was saying that to the time, what maybe was historically happening in that place. All of that stuff matters. All of that stuff matters because it's precisely an action within a community. And so if you pull a text outside of that community, then you shouldn't expect it to function exactly the same way as when it was originally delivered."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8772.2,"end":8791.32,"speaker":"Fr Stephen De Young","text":"Right? Right. Because if the Fathers are not trying to communicate to us the secret essence of the Scriptures that lies behind them, right. Then what we're trying to do is not parrot, right. Some kind of claim that the Fathers are making."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8792.44,"end":8792.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8793.24,"end":8795.96,"speaker":"Fr Stephen De Young","text":"What we're trying to do is we're trying to do what they did."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8797.29,"end":8797.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8797.85,"end":8824.17,"speaker":"Fr Stephen De Young","text":"We're trying do the same thing. And the only way to determine exactly what they're doing is to understand what they actually did in their time and place, who that audience was, what the situation was that they were addressing, what the debate was about, that they were weighing in on what the view is that they're criticizing or condemning or warning against. Right. If we don't understand those things, we won't understand what they're doing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8824.93,"end":8855.97,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because they're not. They're not pushing out pure, encapsulated concepts into the ether. You know, like these are not the Platonic forms of the dogmas or whatever. Right. It's. It's. It's. It's contextualized. It's within it. And that doesn't mean it's. It's relativized. You know, it's not postmodern. It's just seeing that this. This was not, as you like to say, sometimes, you know, the Scriptures are written for us, but not to us. Right. You know, we're not the original audience."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8857.97,"end":8900.57,"speaker":"Fr Stephen De Young","text":"Right, Right. And so a good example of this that's near and dear to my heart because of the amount of my life that was spent on it is a lot of people know who listen to the show at least that my dissertation was on 1st John 2, verse 2d. Right. But 1st John 2:2 says that Christ died not only for our sins, but for the whole world. And if you go and look up the earliest commentary on that verse among the Fathers, what You find is that pretty much all the fathers from the 4th to the 8th century say that by saying this, St. John refutes the."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8900.57,"end":8910.91,"speaker":"Fr Andrew Stephen Damick","text":"Donatists, which is a weirdly anachronistic thing to say. We're not aware of any Donatists in the first century."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8912.03,"end":8916.39,"speaker":"Fr Stephen De Young","text":"Right. Donatus himself lived in the fourth century, so."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8916.39,"end":8917.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8918.67,"end":8937.79,"speaker":"Fr Stephen De Young","text":"After whom it was named. He was not born yet. Right. So it seems preposterous on the face to claim that. No, those fathers are saying that the single accurate meaning of that verse is referring to this specific North African heresy in the fourth century."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8939.44,"end":8939.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8939.64,"end":8958.8,"speaker":"Fr Stephen De Young","text":"Or the fifth century. Right. This would be a preposterous argument. Right. It would make that verse and any number of other passages of scripture completely irrelevant if you understood the Fathers that way. Right. And this is not a question of finding other later fathers who apply it to something else. Right. Either."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8959.36,"end":8959.76,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":8960,"end":9031.83,"speaker":"Fr Stephen De Young","text":"So what we have to do is we have to look at the sort of larger context of St. John. And I'm not going to reiterate my whole dissertation, thankfully, at this point in the evening, but essentially what St. John is doing is he's talking about the shift that happens in Christ from the way atonement worked in the old covenant, where it was for this one physical sanctuary, this one bit of land, this one structure in this one place among this one people. That's what was cleansed by these sacrifices. And St. John is expanding that out to encompass the whole world. And so what those fathers are saying is not that St. John had some kind of prophetic vision that this heresy would arise in the 4th century. Right. But what the Fathers are doing is they're saying these Donatists are making the same mistake that St. John was talking about. They're trying to restrict salvation to just their group, just their people, just in North Africa."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9033.51,"end":9033.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9033.83,"end":9051,"speaker":"Fr Stephen De Young","text":"They're trying to say we're the only ones who have held onto the path of salvation. Right. And St. John is saying, no, Christ made that available to the whole world. And so therefore what St John says does refute the Donatists among other people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9053.56,"end":9053.96,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9054.2,"end":9058.6,"speaker":"Fr Stephen De Young","text":"So they're not misinterpreting it. Right. But what they're doing is they're applying it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9059.24,"end":9060.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For their own time and place."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9061.08,"end":9067.24,"speaker":"Fr Stephen De Young","text":"That. Applying it in their own time and place. This is what this means now for this issue we're facing."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9067.56,"end":9067.92,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9067.92,"end":9094.99,"speaker":"Fr Stephen De Young","text":"In the church. So going from the fathers to ourselves. Right. If we're going to try to read the scriptures toward application in this way. Right. Try and make this move. Right. Sort of God in action through the scriptures. How do we actually do that? Right. So we've got some sort of quasi steps, I guess. I don't know if they're really steps. It would have been better if we put it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9094.99,"end":9098.03,"speaker":"Fr Andrew Stephen Damick","text":"Come up with steps five ways, turn."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9098.03,"end":9098.79,"speaker":"Fr Stephen De Young","text":"It into a book."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9099.25,"end":9100.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9101.57,"end":9110.93,"speaker":"Fr Stephen De Young","text":"Biblical application. We could have made them like alliterate. Right. We could have had like, words that rhyme or words that all start with the same letter."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9111.65,"end":9117.17,"speaker":"Fr Andrew Stephen Damick","text":"Or we could be subtle and use assonance. Oh, yeah, yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9119.41,"end":9139.34,"speaker":"Fr Stephen De Young","text":"The first one starts with apply, so we could just go with a bunch of A's. Yeah. Anyway, so the beginning, there's a quote. There's a quote from a church father, potentially that gets attributed to a lot of different people. I've used it and attributed it to various people, so I'm keeping the thing going."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9139.66,"end":9140.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9140.62,"end":9159.06,"speaker":"Fr Stephen De Young","text":"I realized at one point. So since the caller brought up St. Macarios, we'll just say it was St. Macarios. But the quote is that the wise man applies everything in the scriptures to himself and none of it to other people."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9160.5,"end":9161.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9163.14,"end":9179.41,"speaker":"Fr Stephen De Young","text":"And what he's talking about there is the idea that when we're doing this application, one of the first principles that has to guide us is we're applying it to ourselves and potentially to if there is someone who we have spiritual care for."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9180.44,"end":9196.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like if you're a pastor and you have a flock and it's your flock, or you're a parent and you have children and they're your children, then those are the people that you can apply it to in addition to yourself."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9197.72,"end":9206.77,"speaker":"Fr Stephen De Young","text":"Right, right. But the core idea is, if I walk away from the scriptures saying, yeah, those people over there are rotten, I'm doing it wrong."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9207.01,"end":9209.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9209.49,"end":9222.93,"speaker":"Fr Stephen De Young","text":"Right. I missed the boat. We don't find. I put this challenge out a lot. Find me a place where the fathers talk about Christians going to heaven and non Christians going to hell, where that's the dividing line."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9223.89,"end":9224.29,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9224.61,"end":9230.13,"speaker":"Fr Stephen De Young","text":"The reason nobody's found one yet is the fathers don't spend a lot of time talking about people outside the church."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9231.34,"end":9233.58,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because they're talking to their own flocks."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9234.62,"end":9300.64,"speaker":"Fr Stephen De Young","text":"Right. And they're often warning their own flocks about the potential of going to hell. Right. That potentiality out there. Right. That's what they're concerned about, not condemning the world outside of the church. Right. So let alone condemning their brother. Right. So that's principle one. You're looking at applying it to yourself first and foremost. And then if there are others who are under your spiritual care, for real, not who you've decided should be right. Then to them also. Right. But even in those cases, speaking as somebody who preaches fairly frequently, I found it most effective that I approach it as how do I need to apply it to myself? What do I need to hear? And then it's usually a good assumption that at least some of the people who I'm preaching to need to hear the same thing. They're enough like me in their humanity that they also might need it applied."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9300.64,"end":9304.44,"speaker":"Fr Andrew Stephen Damick","text":"In that way, even though they don't know what it's like to be father Stephen DeYoung."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9305.64,"end":9307.56,"speaker":"Fr Stephen De Young","text":"Yes. Yes. Or a bat."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9308.2,"end":9308.83,"speaker":"Fr Andrew Stephen Damick","text":"Or a bat."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9310.34,"end":9404.82,"speaker":"Fr Stephen De Young","text":"I am not claiming to be Batman. So when we're talking about applying, right, we're not talking about like thinking about virtues. Right. Applying is not reading and saying, yeah, it's true, I need to exercise more self control. That's not applying it. That's music. So remember we talked about this distinction between essence and energies. We encounter Christ, right, as Christ is working in the world. Right. We encounter God as he's working in the world. And so sometimes I think we lapse into thinking that an encounter with God will happen when we finally get some peace and quiet and are able to meditate and say the Jesus prayer. Enough time in sequence, and then we're going to have this encounter with God. But that's mostly not how it works. Unless you're a monastic. Right. If you're a monastic and you're called to go, and you're one of those tiny group of monastics is called to go and be a hermit. Right. Then that may be how God relates to you. But for the rest of us, especially those of us who are out here in the world, we're going to encounter him out here in the world. And that means through actually living the Scriptures, actually doing it, not just having the right opinions about it, but actually doing it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9405.3,"end":9485.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which explains why there's such an emphasis in the Scriptures on what you do. And even that the judgment where our eternal destiny is set is explicitly said over and over again in Scriptures to be based on what you do. And even in Matthew chapter 25, with some very specific actions in mind. Right. That it's. Yeah. Christ is not coming to judge every man according to his opinions. He's coming to judge every man according to his works. And in Matthew 25, where, you know, people are judged on whether they fed the hungry and clothed the naked and visited the sick and imprisoned, Christ explicitly says, if you did that, you did it to me. If you didn't do it. You didn't do it to me. In other words, the encounter with Christ is found in doing those works, in doing the things that the commandments of God. I mean, I actually checked recently, how many times do you actually see this explicit pairing of if you love me, keep my commandments. And I found 18 times just searching in the ESV. But the concept is even more ubiquitous, like it's all over the place. If you love Christ, you keep his commandments. You have to do that. There's just no way around it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9487.26,"end":9494.78,"speaker":"Fr Stephen De Young","text":"Right. And this paradigm over and over again of those who hear the law versus those who do it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9495.02,"end":9495.42,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9495.42,"end":9500.77,"speaker":"Fr Stephen De Young","text":"Hearing versus doing. Why do you call me Lord, Lord and not do what I say?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9503.33,"end":9504.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9509.89,"end":9586.84,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yeah. I mean, for instance, and one of the things I think that also underlines that is we see not just in the scripture where it says, if you love me, keep my commandments, but actually we do see what the result of that is. It says, for instance, the Lord says in Matthew 19:17, if you would enter life, keep the commandments. So, you know, if you keep the commandments, that means you're entering life. That means you're entering into eternal life. You're doing it. You know, like we had a caller earlier ask about, you know, kind of is there any hope for interpreting the Scripture correctly if you're not doing all this biblical study stuff? And of course I said yes. But also we should emphasize that even if someone understands intellectually none of everything we've just been talking about but keeps the commandments of Christ actually lives faithfully to him, then they're doing it. And it's not like a lower class version of Christianity. They're really doing Christianity. Like you can become a saint without understanding the principles that we're talking about. If you keep the commandments of Christ because that's what sanctity actually is."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9589.88,"end":9591.32,"speaker":"Fr Stephen De Young","text":"Yeah, right, right."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9593.08,"end":9631.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, the flip side then of course is if you're not keeping the commandments, if you're not, then you're not living as a Christian. And that means that your interpretation of the Scriptures or of the Fathers is probably not worth a whole lot, maybe nothing easily ignorable. It's not that the things you're saying might be wrong, but the message you're also delivering along with it is that this is the faith of demons. Like, I can be a jerk, I can be nasty and evil and not doing the things that Christ commanded and say things that are true, but demons do that."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9634.18,"end":9639.38,"speaker":"Fr Stephen De Young","text":"Yeah. St. James points out the demons know all that stuff for sure. They don't just think it or believe it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9639.94,"end":9647.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, their dogma is the best, right? They've got it really bad."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9648.34,"end":9649.9,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, they're dogma."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9649.9,"end":9931.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. Exactly. Well, so to wrap up this evening, this conversation about methodology, that's what this really was. I think now we've got enough episodes that it's hard to tell. People just simply listen to all of them, although I still think that that's the ideal. But I will say, though, even if someone doesn't listen to all of them, I think this is going to be an important one in many ways for this podcast, because this kind of lays out the method of what we're doing. And we're not claiming this is all 100% perfect or correct or whatever, but it certainly, to me anyways, does seem to represent what it is the Church Fathers are doing to represent what it is that are happening in the divine services. Right. To represent what's happening within Scripture. When you see people in Scripture interpreting and applying Scripture. Right. And so, but. But far from being a kind of just giving a sort of mechanism or technique, because that's not what we're about. The point of seeing the Scriptures, for instance, as a. As an integrated whole. Right. That there's not. Even though there are old covenant, there's an old covenant and a new covenant. That these are not disconnected from each other. Right. Like we talked about Hegel earlier, having at least this one good thing to say about, you know, in his case, philosophical concepts not just coming out of earlier ones, but actually resting on them. You know, you can't throw away the earlier stuff. The same is true with Christianity. Right. You know, a lot of. For instance, a lot of. A lot of people who convert to orthodox Christianity weirdly stop reading the Bible, you know, that they might have been reading before. And they're like, well, I kind of got that down. So now I want to do the Fathers. This is weird. Really is located. You know, this is where the truth really, really is. But that's violating what the Fathers themselves do. They're constantly going back to Scripture. They're constantly referring people to Scripture. The church does not treat their writings on a higher level than the Scriptures. It's clearly the other way. The Scriptures are central. The Scriptures are always being read to us in church services. The Scriptures are what we're participating with ritually, over and over. Like that should be our whole life. Right? And so the purpose of trying to understand the scriptures is, as St. John writes at the end of his gospel that we may believe and that we, you know, that we may believe that Jesus is the Christ, and believing that is to say, being faithful, we may have life in his name. The purpose is for our salvation. Right. And so I. I hope that one of the takeaways that people have is that all of this is worth it. It's truly, truly worth it. I mean, it's one of our constant themes that this podcast is not just about, like, weird, crazy, obscure Bible stuff or things dug up in the Turkish desert, but it is for our salvation. Scripture is for our salvation. Understanding these things is for our salvation. Can you be saved without this intellectual understanding? Absolutely. But if you have the capability, then you have the responsibility to use all of your capability in the service of Christ. And so if you have the ability to study the Scriptures and to understand them more deeply, then that is our responsibility. That's what we're supposed to be doing. Right? And it's been beautiful to me to see many people become excited about reading the Bible again in the conversations that we're having. And I think that the excitement comes, at least I hope not just from, like I said, nerdy, weird Bible stuff, but an excitement of encountering Christ, truly encountering Christ. And I think that, to me, the biggest thing to take away from this conversation this evening is that that encounter with Christ comes in obedience to Christ. It comes in obedience to Christ. This is not an esoteric experience. This is not a scholarly experience. It's an experience of becoming conformed to who he is. And that this knowledge that we're discussing is about bringing us more into that. And I know that I find myself encouraged by these conversations to head in that direction. And, God willing, a little bit more and more I try to do that. Father Stephen."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":9935.22,"end":10089.15,"speaker":"Fr Stephen De Young","text":"Yeah, so sort of our whole raison debt with the show is to talk about the spiritual world, right? The spiritual level of reality that we've kind of forgotten about in our modern and postmodern materialism. And what we've been talking about tonight, at least, where it went, which hopefully now, after hearing all this about methodology, you understand that, you know, each episode goes somewhere that where it went is critically important to understanding. Because this show isn't supposed to be about, like, oh, there's this spiritual warfare going on out there, and the Bible tells us about it so we can imagine it or think about it or know about it. It's to let us know that we're involved in it. Right. And, of course, our leader is our Lord and God and Savior, Jesus Christ. If you want to come to know him better, if you want to go to where he is, if you want to encounter him, if you want to be transformed by him, if you want to work with him, if you want to fight alongside him, right? Then there's a place where that's happening, right? There's a place where that's happening. And it's not a limited or restricted place. It's potentially every place, every space, every moment, your life that includes the liturgical services of the Church that are sort of the center and the nexus of it. That's sort of like the base camp, right? And we can certainly encounter Christ within the services of the Church through the Scriptures as they're read in the church, through the Scriptures as they're read in our home. But we also encounter Christ perhaps most powerfully and most transformatively, as we were saying there at the end in action. We've been doing the Liturgy of Saint Basil the Great here in Great Lent. So as a priest, I read all the long prayers, and my choir usually finishes early, so people get to hear some of those long prayers while I finish them. But one of the many things that at various points has struck me in those long prayers is that it describes God as the help of the helpless, the hope of the hopeless, the physician of the sick."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10090.28,"end":10090.52,"speaker":"Radu","text":"Right?"}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10090.52,"end":10243.88,"speaker":"Fr Stephen De Young","text":"And this isn't just a hypothetical. This isn't stuff God is willing to do if we ask or ways of praising Him. This is what God is actually doing. If you want to know where Christ is right now, he is with the people who are sick, the people who are alienated and suffering, the people who are alone and who are lonely, the people who are hopeless, the people who are helpless. That's where he is. That's what the Scriptures tell us over and over again. And we can go to those people and we can find him there. We can encounter him there. We can work with him there to help those who are helpless, to give hope to those who are hopeless, to help heal and bring comfort to the sick and the suffering. When we do that, we not only encounter Christ, but we encounter Christ in a way that changes, changes, and transforms us. Not where we learn some things intellectually, we become smarter. We're better able to win arguments on the Internet. We can teach other people. But we're transformed in a way that makes us whole, that heals what's broken in us, that gives us hope for the hopelessness that each of us has, that gives us help for the helplessness that each of us have. There's comfort in the suffering that every one of us faces. And so the study of the Scriptures always has to be directed out. It has to be directed out in this application, right? It has to be directed out to the world because Christ is in the business of saving the world. That's what he's about. That's what he's doing. Any other pursuit, whether it's an intellectual pursuit, scholarly pursuit, any other vain pursuit, right? It's not what he's about. And so that's not where we're gonna find him. So if anything in this show has interested you, if you think any of it is true about the spiritual world, spiritual warfare, any of that, then we have a very easy way to join the fight. Because the people who need you, the people who Christ loves and is caring for, are all around you every day. We just have to be willing to actually do it, to actually participate, to actually help and to actually love them also."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10247,"end":10267.21,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for tonight. Thank you very much everyone for listening. If you can't get through to us live, we would still love to hear from you. You can email us at Lord of Spiritscientientientientientfaith.com you can message us at our Facebook page, or you can leave us a voicemail@speakpipe.com LordOfSpirits I do listen to."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10267.21,"end":10268.21,"speaker":"Fr Stephen De Young","text":"All the speak pipes."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10268.53,"end":10269.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10269.25,"end":10275.19,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10276.22,"end":10285.82,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, you can like our page, join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10287.5,"end":10296.62,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com stroke support and help make sure we and lots of other AFR podcasters stay on the air. And Bobby gets those lawyers, guns and money."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10297.98,"end":10305.61,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless you and I hope you have a blessed holy week in a bright and beautiful Pascha."}
{"episode_id":"LOS - #040 - 2022-04-14 - How (and How Not) to Read the Bible","start":10316.97,"end":10354.18,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
