{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":0.48,"end":65.08,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":68.92,"end":103.63,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. It is one of all of our favorite things where we look at all that stuff that's integral to Christianity but that does not fit into a materialist worldview because that worldview is garbage. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania and my co host is Father Steven DeYoung who's with me from Lafayette, Louisiana. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. Matuska Trudy, who is just back from COVID Land."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":103.71,"end":104.23,"speaker":"Fr Stephen De Young","text":"Yay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":104.23,"end":188.35,"speaker":"Fr Andrew Stephen Damick","text":"We'll be taking your calls tonight. We will get to your calls in the second part of today's show. So in our last two episodes we talked about sacred geography, how the reality of sacred spiritual place overlaps material place, including paradise, which is the mountain of God. And last time we talked about the underworld. This episode is titled the Lord of Spirits Goes to Hell, which some people apparently thought was a repeat of last time, but it is not. We are talking about what happens when the Lord of Spirits himself, that is the incarnate Son and word of God Jesus Christ, makes the journey into the underworld. That journey is a major theme of the Holy Week in Pascha. Services that for the Orthodox Church are coming up this very next week in real time. So this is also our Holy Week and Pascha special. I feel like it, we should call it like our season finale, but we're not. We're not stopping. But so to begin our journey tonight, we're going to do what we almost Always do. We're going to take a trip back thousands of years, and we're going to arrive at an ancient ruined city in the Levant in northwestern Syria near the modern city of Latakia. That's right. We're heading back to Ugarit, and that means we're going to be talking about our old adversary, baal. So, Father Stephen, take us to Ugarit."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":189.39,"end":196.4,"speaker":"Fr Stephen De Young","text":"Ugaret. You betcha. Wow, that's the tourism slogan."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":196.56,"end":199.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. For people from the upper Midwest."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":199.68,"end":202.84,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. Say yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":202.84,"end":203.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, sure."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":206.72,"end":214.4,"speaker":"Fr Stephen De Young","text":"So, right, well, as you. As you said, this is a city that has not been around in a long, long time."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":215.6,"end":221.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. Like 4,000 years, roughly, or almost. More than 5,000. More than five."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":221.32,"end":250.3,"speaker":"Fr Stephen De Young","text":"No, no, it hasn't been around for about. Yeah, for about 3,200. But roughly. Yeah, give or take. But before that, it was around for a long time. Ugarit was originally built. Settled, I should say around. Well, it was early in the Neolithic period. We won't get into that again. The walls seem to have been built around 6,000 B.C. oh, wow."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":250.38,"end":252.06,"speaker":"Fr Andrew Stephen Damick","text":"And again, pretty old."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":252.38,"end":276.55,"speaker":"Fr Stephen De Young","text":"Right. And again, you know, if these dates are problematic to you adjust however you need to. But that's the. The current archaeological dating of when the walls were built, and then Ugarit was destroyed circa 1180 B.C. so this is a city that existed for thousands of years, but. Thousands of years. Thousands of years ago."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":277.43,"end":277.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":278.63,"end":290.39,"speaker":"Fr Stephen De Young","text":"It wasn't rebuilt. It was pretty much plowed over. And it was not discovered until the middle of the 20th century that the city was even there."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":290.79,"end":300.48,"speaker":"Fr Andrew Stephen Damick","text":"Now, were there indications? I mean, did people know that it had existed? They just didn't know where it was. Not kind of records or not really. Oh, wow."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":301.28,"end":313.6,"speaker":"Fr Stephen De Young","text":"Because it's in an area that's now called Roshamra. And when it was found, a new language was discovered and named Ugaritic because."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":314.96,"end":315.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":318.32,"end":400.99,"speaker":"Fr Stephen De Young","text":"But which is a. A Northwestern Semitic language, meaning it's sort of a close cousin to Hebrew. It's another one of the dialects that emerged from old Canaanite around the time that the city was being destroyed, actually. But it's unlike Biblical Hebrew. It's not written with the Phoenician alphabetic script. It was written with the cuneiform script that's used for Akkadian and other early Semitic languages. So phonetically, like, if you read it in transliteration and you know Hebrew. Well, if you've studied any Semitic languages, even Arabic, even modern Arabic, you, You know, basically the consonantal structure of most of the vocabulary. So the differences between Semitic languages are mainly vocalization, meaning vowels. So in transliteration, if you're good with Hebrew and Aramaic, you can pick up ugaritic really quickly to read it in the cuneiform script. You have to learn the cuneiform script, which is a lot more difficult, I could say, for firsthand attempts, because you've got a couple hundred symbols to learn."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":401.61,"end":401.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":402.33,"end":403.37,"speaker":"Fr Stephen De Young","text":"22 letters."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":403.37,"end":410.33,"speaker":"Fr Andrew Stephen Damick","text":"I remember when I was, you know, a preteen seeing. Seeing that Alphabet and going, that's really cool. And then, like, learning three symbols and then giving up."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":410.49,"end":413.85,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. They all look fairly similar."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":413.93,"end":416.57,"speaker":"Fr Andrew Stephen Damick","text":"They're not radically different from one another. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":417.93,"end":430.17,"speaker":"Fr Stephen De Young","text":"So. But the reason the language was so important is there were literally a ton of Hebrew words that we did not know what they meant."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":430.73,"end":431.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":431.45,"end":438.89,"speaker":"Fr Stephen De Young","text":"Because the only texts we had them in were sort of scattered parts of the Hebrew Bible."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":439.21,"end":442.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they just made guesses when they would translate."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":442.73,"end":476.99,"speaker":"Fr Stephen De Young","text":"Right. And that's why sometimes, if you compare any of the modern translations of the Old Testament to parts of, like, the King James Version, you'll see that they're sometimes radically different. And you're like, what is happening there? And it's because the King James translators were doing their best. They were looking at the Latin and they were looking at the Greek and kind of going, you know, and there are places, even in the Greek translation where you could tell the rabbis centuries later were kind of looking at it and going, you know, and kind of approximating."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":477.63,"end":480.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Is that where we get the donkey centaurs?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":482.46,"end":482.9,"speaker":"Fr Stephen De Young","text":"Sort of."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":482.9,"end":484.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sort of. Okay. Okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":484.38,"end":485.34,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":485.34,"end":487.18,"speaker":"Fr Andrew Stephen Damick","text":"I'm just gonna throw that out there for people. Don't."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":487.18,"end":518.1,"speaker":"Fr Stephen De Young","text":"That's a topic for another time, probably, when we talk about vampires, just to further tease it. But yeah. So you get a lot of weird things. You get, you know, the edge of the bed of Damascus versus a lion cub in one place. There's a lot of really interesting things. This house. But so we found these same words, albeit vocalized a little differently, in these Ugaritic texts. And so that gave us, like, a few dozen more examples."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":518.5,"end":521.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's of piles and piles of clay tablets. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":521.9,"end":539.67,"speaker":"Fr Stephen De Young","text":"Vocabulary usage. Right. Because this is all written on fire clay tablets. But these fire clay tablets from the ancient near east, once they fired them, they're almost indestructible. Like, if you hurled one at your floor, you dent your floor before you'd break the tablet."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":540.15,"end":542.71,"speaker":"Fr Andrew Stephen Damick","text":"That's really convenient. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":542.87,"end":544.95,"speaker":"Fr Stephen De Young","text":"So that's why we have so many."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":545.43,"end":550.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But I guess most of them are, like, useless. Right. Most of Them are like shopping lists and whatever."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":550.79,"end":564.72,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so if there are several places. Oh, listener. If you want to study further, there are several places where you could get a full ride to get a PhD in Sumeriology in the United States."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":566.88,"end":568,"speaker":"Fr Andrew Stephen Damick","text":"People writing this down."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":568,"end":574.16,"speaker":"Fr Stephen De Young","text":"Right now there are endowments and stuff for people to translate all this stuff."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":574.56,"end":575.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":575.08,"end":594.25,"speaker":"Fr Stephen De Young","text":"And there aren't enough people to do it. And part of it is that you end up translating, you know, a hundred grocery lists and trade documents before you get to something interesting. But they're still turning up interesting things. A few years ago, I mean, five or 10 years ago, they discovered a whole new version of the flood story."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":594.89,"end":595.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, nice."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":595.57,"end":605.13,"speaker":"Fr Stephen De Young","text":"On a Babylonian tablet. So this stuff's. So there is interesting stuff there. You just got to be willing to get into the weeds and to learn cudaform and do some language study."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":605.77,"end":607.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":607.77,"end":612.16,"speaker":"Fr Stephen De Young","text":"So the reason we're talking about this is one set of tablets in particular."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":612.88,"end":616.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's not just relevant to biblical studies, but there's also."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":616.8,"end":617.44,"speaker":"Fr Stephen De Young","text":"Broadly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":617.92,"end":619.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Broadly. Right, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":619.68,"end":620.04,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":620.04,"end":623.36,"speaker":"Fr Andrew Stephen Damick","text":"But. But there's also the. Yeah, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":624.16,"end":726.35,"speaker":"Fr Stephen De Young","text":"One of those has been named by us the BAAL cycle, because. Cycle, because it's like an epic cycle. It's like an epic poetry cycle. And BAAL because he's the main character. So this is. We get all through the Old Testament, we see BAAL worshipers, prophets of baal, altars built to baal. They're kind of the bad guys. Through most of the books of the kingdoms, or 1st and 2nd Samuel and 1st and 2nd Kings and 1st and 2nd Chronicles, you see them turn up in the prophets. So we knew about baal. We knew, like, for example, Queen Jezebel, who marries King Ahab in the northern kingdom of Israel, is from the Phoenician kingdom, which is in what's now Lebanon. Right. So we knew she brought the BAAL worship down from there. So we knew this religion's there, but this is the first time with these. These Ugaritic texts, including the BAAL cycle, that we got sort of the other side of that, where we got texts written by BAAL worshippers for BAAL worshipers instead of the other, instead of condemning BAAL worship. So we're getting to see how their religion looked from the inside. And there's lots of ritual texts and lots of other stuff, but the BAAL cycle is what we're here to talk about tonight. And BAAL himself, BAAL is both a title and a name of a God."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":726.91,"end":727.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":728.75,"end":735.71,"speaker":"Fr Stephen De Young","text":"So the word BAAL or BAAL is just the word for lord or master."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":736.35,"end":737.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":738.91,"end":753.34,"speaker":"Fr Stephen De Young","text":"And that creates some funny things for people who don't know that. So the founder, for example, of Kabbalistic Judaism is the BAAL Shem Tov. And you're like, wait, baal?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":753.9,"end":757.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. A rabbi or whatever named baal."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":757.1,"end":757.82,"speaker":"Fr Stephen De Young","text":"But they were."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":758.06,"end":759.1,"speaker":"Fr Andrew Stephen Damick","text":"But it just means Lord."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":759.1,"end":790.55,"speaker":"Fr Stephen De Young","text":"It's the Aramaic word for master. Right. The same way that we use various versions of master when we address bishops. They did for rabbis. Right, sure. In Aramaic. There's also a place in the minor prophets where Yahweh, the God of Israel, says, previously you knew me as baal, but now you know me as. As husband. Which, of course, our German, what, 19th century German friends jumped all over. Oh, see, look."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":792.07,"end":795.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. They were polytheists. Right. Worshiped baal. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":795.63,"end":838.79,"speaker":"Fr Stephen De Young","text":"They're bail orders. He's admitting it. But if you. If you read it in context, it's saying, previously you knew me as master, now you know me as husband. He's talking about the relationship with Israel, that he's not just their Lord, but he's also. He also loves them and cares for them. So. Yeah, but when we talk about baal, like when you have the prophets of BAAL on Mount Carmel with the prophet Elijah, the BAAL they're worshiping is a specific guy who was just referred to as baal, and that's the person who the BAAL cycle is about. His father's name is El, which is just for God."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":838.79,"end":847.95,"speaker":"Fr Andrew Stephen Damick","text":"A God. Yeah, exactly. Yeah, yeah. There's the most high God is named God and his son is named Lord."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":848.43,"end":867.14,"speaker":"Fr Stephen De Young","text":"Yeah, right, yeah. And that's not coincidental, right? The idea that you have most High God and then a son. We talked about this a little in. In a couple of previous episodes, but. Oh, yeah, right here."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":867.14,"end":869.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like early. Early on, some of our early episodes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":870.1,"end":885.15,"speaker":"Fr Stephen De Young","text":"Right. That this is. This is a pattern you see throughout ancient religion, is that the most high God is the father to a son, a divine son who presides over the divine council."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":885.79,"end":921.24,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And then that sets up in almost every single ancient mythology, not all of them, I think, but in almost every single one. What's referred to as the succession myth, where you've got a son or some kind of lesser God overthrowing his father or overthrowing some greater gods. I mean, the details slide around a little bit depending on which one you're looking at. And that's in the Baal cycle, which until, what was it, the 1960s, 1970s, no one had known those details for over 3,000 years."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":921.56,"end":924.04,"speaker":"Fr Stephen De Young","text":"Right. About Baal, about Baal in particular."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":924.28,"end":926.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yeah. You've got the succession myth in many mythologies."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":926.8,"end":933.32,"speaker":"Fr Stephen De Young","text":"Right. So you've got Zeus King killing Cronus, Cronus casting Odin killed his father. Right. I mean."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":933.32,"end":935.08,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, yep. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":935.08,"end":942.52,"speaker":"Fr Stephen De Young","text":"All the way through. So. And we talked about that in terms of the way the devil is portrayed in the prophets in particular."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":942.84,"end":943.48,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":943.64,"end":954.2,"speaker":"Fr Stephen De Young","text":"In the Old Testament, that it's sort of correcting the record that. Well, yeah, you. You maybe tried, but you didn't succeed in making yourself the most high God."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":954.2,"end":959.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. In. In pagan myths, generally there's a success that happens there. But."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":959.72,"end":974.8,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah, right, right. And so this is what the story of the BAAL cycle primarily is. The story of the BAAL cycle, sort of the through line of the epic cycle is this is the story of Baal's sort of insurrection."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":975.28,"end":975.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":976.64,"end":994.8,"speaker":"Fr Stephen De Young","text":"And his father. We talked before also how in. After a certain point in history, in all of these ancient religions, the. All these forms of ancient religion, the. The most high God sort of recedes off into the distance."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":995.52,"end":995.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":996.16,"end":1008.32,"speaker":"Fr Stephen De Young","text":"And you can really see this in the BAAL cycle because technically, Baal's revolt is to make his father El the most high God and for him to preside in the council. But El, like, doesn't do much of anything."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1008.56,"end":1025.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because so BAAL is actually revolting against Yam and Nahar. Right. Who are the gods of the ocean and the rivers, respectively. And I think even in modern Arabic, nahar means river. Write in. Let us know if I got that wrong."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1027.39,"end":1044.72,"speaker":"Fr Stephen De Young","text":"Yam is the word for sea or ocean. We talked about how that's chaos. Right, right. And he's the most high God at the beginning of the BAAL cycle. He's the one in charge. And then Nahar is referred to as the prince. So he's the one, the son who presides in the."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1044.72,"end":1047.48,"speaker":"Fr Andrew Stephen Damick","text":"The idea is to get a new dynasty in there, essentially."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1047.8,"end":1048.12,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1048.12,"end":1066.04,"speaker":"Fr Andrew Stephen Damick","text":"You know. Yeah, right, right. So, yeah. So, you know, especially for people who have read Father Stephen's blog, you might have heard some of this before. Almost certainly. But there's this very dramatic moment in the BAAL cycle where BAAL goes up on. Is it Mount Hermon? Am I remembering that correctly?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1067.01,"end":1067.77,"speaker":"Fr Stephen De Young","text":"No, that's not."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1067.77,"end":1068.37,"speaker":"Fr Andrew Stephen Damick","text":"No, no."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1068.61,"end":1069.17,"speaker":"Fr Stephen De Young","text":"Mountains."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1069.17,"end":1070.41,"speaker":"Fr Andrew Stephen Damick","text":"A phone with Ben Zaphone. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1070.41,"end":1072.77,"speaker":"Fr Stephen De Young","text":"Okay, let's wait, let's. Let's wait and get to that in a sec."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1073.01,"end":1076.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, that's fine. Sorry, don't want to spoil it yet. Okay. Okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1076.77,"end":1077.93,"speaker":"Fr Stephen De Young","text":"Yeah, sorry. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1077.93,"end":1078.93,"speaker":"Fr Andrew Stephen Damick","text":"I'm just so excited."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1081.01,"end":1094.27,"speaker":"Fr Stephen De Young","text":"Hold Your horses, man. Keep it the. So one of the primary things that the Bale cycle illuminates is one of the psalms."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1095.23,"end":1095.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1095.87,"end":1103.71,"speaker":"Fr Stephen De Young","text":"This is Psalm 24 in the traditional Hebrew numbering, Psalm 23 in the traditional Greek numbering."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1103.95,"end":1105.31,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1105.63,"end":1116.75,"speaker":"Fr Stephen De Young","text":"And so this. Once we found the BAAL cycle, we could see that this psalm, this Hebrew psalm is sort of a response."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1117.47,"end":1121.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. It directly. Directly references it."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1122.37,"end":1166.92,"speaker":"Fr Stephen De Young","text":"Right, yeah, right, right. And so in. Yeah, but one more thing about sort of the arc of the BAAL cycle before we read the psalm. So just again, to give the broad arc. Right, in the. The broad arc of the BAAL cycle, the broad arc of the action, BAAL decides he's going to take charge and put his dad in charge. So he's going to overthrow Yam and Nahar. So he sets out to stage this sort of rebellion and he totally wins by a lot, but decides to go to the underworld after he totally wins."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1167.08,"end":1169.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And get some real estate there."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1169.64,"end":1188.77,"speaker":"Fr Stephen De Young","text":"Yeah. And when he goes to the underworld, he runs into Mote, the God of death, who we're going to be seeing a lot of tonight, and gets in a fight with Mote, which he also totally wins. But even though he totally wins, he decides to just stay in Sheol and take up residence there."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1189.17,"end":1189.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1189.97,"end":1201.33,"speaker":"Fr Stephen De Young","text":"So that's sort of the broad strokes of the story that the BAAL worshippers were telling themselves in their pro devil propaganda. So now let's go ahead and look at this. All right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1202.6,"end":1300.66,"speaker":"Fr Andrew Stephen Damick","text":"Starting to give it away now. Okay. All right, so this is Psalm 24. You know, people, you should recognize a lot of this, but I'm just going to read the whole Psalm to you. It's only 10 verses long. Psalm 24. The earth is the Lord's, and the fullness thereof, the world and they that dwell therein. For he hath founded it upon the seas and established it upon the floods. Who shall ascend into the hill of the Lord, or who shall stand in his holy place? He that hath clean hands and a pure heart. Who hath not lifted up his soul unto vanity nor sworn deceitfully. He shall receive the blessing from the Lord, and righteousness from the God of his salvation. This is the generation of them that seek him, that seek thy face. O Jacob. Lift up your heads, O ye gates, and be Lift up ye everlasting doors, and the King of glory shall come in. Who is this king of glory? The Lord, strong and mighty. The Lord, mighty in battle. Lift up your heads, O ye gates, even lift them up, ye everlasting doors. And the King of glory shall come in. Who is this king of glory? The Lord of hosts. He is the King of glory. Okay, everybody, especially if you're orthodox, you've heard this psalm. You've definitely heard it. But, you know, if you're a Christian, if you read the Bible at all, you know this is a psalm. You should know. It's Psalm 24. All right, well, let's talk about all the cool things that are happening in this psalm with regards to the BAAL cycle. It's unbelievable. You guys are not going to believe this. You're not going to believe it even if you've read the relevant post from Father Stephen's blog, which talks about some of this, doesn't talk about all of it, but let's talk about a lot more of it. So verse one, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1300.66,"end":1304.58,"speaker":"Fr Stephen De Young","text":"Yeah. So you read the King James Version."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1304.74,"end":1305.62,"speaker":"Fr Andrew Stephen Damick","text":"The King James, yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1305.62,"end":1308.78,"speaker":"Fr Stephen De Young","text":"If it's good enough for the Apostle Paul, it's good enough for us. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1309.66,"end":1327.1,"speaker":"Fr Andrew Stephen Damick","text":"And there's someone out there, by the way, who doesn't like it when I say. Right. I feel like I'm gonna say it a lot more tonight, probably just to mess with that guy. Anyway, verse one. Okay. The earth is the Lord's and the fullness thereof."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1327.18,"end":1330.14,"speaker":"Fr Stephen De Young","text":"Such ressentement is not appropriate for Lent."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1330.3,"end":1336.94,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's true. With all due respect, I'm getting a little punch. I'm getting a little punchy here at the end of the sixth week of Lent."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1337.31,"end":1346.59,"speaker":"Fr Stephen De Young","text":"Okay, so. So that I mentioned that because there are some things that are kind of obscured by English translation."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1347.07,"end":1347.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1347.63,"end":1365.52,"speaker":"Fr Stephen De Young","text":"This isn't so much mistranslated as just sort of obscured. And so one of the big ones right off the bat is that English Bibles, by and large, with some exceptions, don't translate Yahweh is Yahweh."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1366.4,"end":1367.44,"speaker":"Fr Andrew Stephen Damick","text":"It's usually Lord."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1367.6,"end":1369.36,"speaker":"Fr Stephen De Young","text":"They put Lord in all caps."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1369.36,"end":1376.88,"speaker":"Fr Andrew Stephen Damick","text":"In all caps. Yeah. So you get the earth is the Lord's and the fullness thereof, but it's really the earth is Yahweh's and the fullness thereof."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1377.04,"end":1377.44,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1377.6,"end":1378,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1379.92,"end":1402.5,"speaker":"Fr Stephen De Young","text":"Why I'm saying that's important is that sometimes what the text is saying, and we're going to see this over and over again tonight, sometimes what the text is, is directly asserting is that things that the pagan nations were saying about their gods are actually true of Yahweh, the God of Israel, and not of those pagan gods."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1402.98,"end":1409.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So there's a lot of smack talk really going on in the Bible, frankly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1409.86,"end":1410.38,"speaker":"Fr Stephen De Young","text":"Right. So."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1410.38,"end":1413.22,"speaker":"Fr Andrew Stephen Damick","text":"But if you don't trace, not your guy. No."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1414.34,"end":1441.41,"speaker":"Fr Stephen De Young","text":"If you don't translate that, the name, right, then you kind of lose on that. You lose out on that idea. Right. So if you're saying, you know, no, Charles is king, right. Like, as opposed to somebody else. Right, right. He's king, not this other guy. Whereas if you just say, no, the king is king."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1442.14,"end":1442.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1442.94,"end":1445.02,"speaker":"Fr Stephen De Young","text":"Right. You don't get the, you know."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1445.02,"end":1445.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1445.26,"end":1458.94,"speaker":"Fr Stephen De Young","text":"It's like, no, this is the right. So that begins right away in verse one, right, where it says, right, the earth is the Lord's and the fullness thereof. Right. It's. The earth is Yahweh's and the fullness thereof."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1459.02,"end":1459.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1459.5,"end":1486.11,"speaker":"Fr Stephen De Young","text":"The world and they that dwell therein. Right. Meaning the world, the creation, the cosmos, and everything in it belongs to Yahweh, not to anyone else. Right, right. He's placing a claim, personal claim on it. That's why I think it's appropriate here to point out the personal name and eagle eared. That's not a phrase. What year? What would be ears? Eagle eyed. Right. What's the ear equivalent?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1486.99,"end":1487.79,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1488.19,"end":1490.11,"speaker":"Fr Stephen De Young","text":"Dog ear. Doesn't work anyway."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1490.35,"end":1494.23,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. Yeah, I don't know. There's a lot of. A lot of animals have good hearing."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1494.23,"end":1506.27,"speaker":"Fr Stephen De Young","text":"But yes, attentive listeners, amongst our listeners who have been to an orthodox funeral service might recognize that verse that said, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1506.35,"end":1521.15,"speaker":"Fr Andrew Stephen Damick","text":"When the priest anoints the body with oil and probably puts some ash or dirt, depending on the tradition, it's usually done right at the end of the funeral service or sometimes it's done right before the burial. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1521.15,"end":1524.67,"speaker":"Fr Stephen De Young","text":"Right before the bear, Right before the casket is sealed and the burial takes place."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1524.83,"end":1528.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The earth is the Lord's, the fullness thereof, the round world and all they that dwell therein."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1528.91,"end":1529.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1529.23,"end":1531.15,"speaker":"Fr Andrew Stephen Damick","text":"That's the. That's the version that's in my head anyway."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1531.39,"end":1540.51,"speaker":"Fr Stephen De Young","text":"Right. And so just hearing that in English, it might not be clear what any of that has to do with the fact that you're burying somebody."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1541.31,"end":1543.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. Except maybe it has something to do with dirt."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1544.03,"end":1546.19,"speaker":"Fr Stephen De Young","text":"You're putting him in the earth, I guess."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1546.59,"end":1549.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right, right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1549.07,"end":1569.07,"speaker":"Fr Stephen De Young","text":"But the point here, once we understand what the verse is doing, right. The. The earth, it's saying that. That the cosmos and everyone in it, Right. Every sentient being in it belongs to Yahweh and no one else. Right. Then you understand that when we do this in the funeral service, we're asserting a claim."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1569.79,"end":1578.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That this person is not being handed over to the God of death. This person belongs to Yahweh, Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1578.72,"end":1602.51,"speaker":"Fr Stephen De Young","text":"Even though he's about to go into the earth, he still belongs to Yahweh. He still belongs to the one true God. Right? So that's. That's where it starts, Right? So right off the bat, shots fired, right, that. No, all of this belongs to Yahweh and no one else. Verse two starts with four, right? It's because."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1603.07,"end":1603.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1603.47,"end":1620.19,"speaker":"Fr Stephen De Young","text":"Because why? Why does it all belong to him? Because he founded it. Because he built it. Right. So it's his. He made it. And he did that by founding it upon the seas, which is."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1621.07,"end":1621.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1621.55,"end":1627.79,"speaker":"Fr Stephen De Young","text":"Which is the word Yam Yum. And established it upon the floods is how the King James does it. And floods is Nahar."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1629.76,"end":1630.32,"speaker":"Fr Andrew Stephen Damick","text":"What do you know?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1631.04,"end":1636.4,"speaker":"Fr Stephen De Young","text":"So he built it on top of Yam and Nahar, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1636.56,"end":1685.39,"speaker":"Fr Andrew Stephen Damick","text":"Which is basically saying, remember, now BAAL is going up against Yam and Nahar to try to defeat them so he can set his dad and himself up as the new dynasty up on the mountain. But what God is saying here through this psalm prophetically is, no, no, no, no, no, no. I'm the one who conquered the chaos of the oceans and the seas and the rivers, and I built my world on top of them, you know, which is, you know, you got that image of sort of submission and defeat. Right. You know, just like if you level a city and then build your new city up on top of it, that's what's going on here. So again, it's a comment on the BAAL cycle. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1685.39,"end":1691.79,"speaker":"Fr Stephen De Young","text":"If you want power over chaos, Right. He didn't have to defeat it and fight it."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1692.11,"end":1692.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1692.47,"end":1706.83,"speaker":"Fr Stephen De Young","text":"The image is of him laying the foundation for a building on the ocean. Right, right, right. So this is. You get the same kind of imagery in the book of Revelation at the end. The sea, like glass."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1707.31,"end":1709.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It just obeys him."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1709.63,"end":1736.98,"speaker":"Fr Stephen De Young","text":"Right. It's just flat, Right. Solid, instead of chaotic and choppy and out of control. So it all belongs to Yahweh, the God of Israel, because he created it. Right. And he subjected the forces of chaos to order when he created. As we saw when we talked about Genesis 1 at a couple of points. So then verse 3, the smack talk continues."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1737.05,"end":1740.33,"speaker":"Fr Andrew Stephen Damick","text":"So the smack talk continues."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1740.97,"end":1758.01,"speaker":"Fr Stephen De Young","text":"Right, because it says, it asks the rhetorical question, who shall ascend the. Literally, mountain? Who will ascend the mountain of Yahweh? Right. This is the harmoe. This is the mountain. This is paradise that we talked about. The Mount of Assembly, right? The place where everyone meets."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1758.17,"end":1758.73,"speaker":"Fr Andrew Stephen Damick","text":"Who will."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1758.73,"end":1769.65,"speaker":"Fr Stephen De Young","text":"Who's going to go up the mountain or who shall stand in his holy place. Right, the holy place. The holy space of paradise. Right. Who's going to come into paradise?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1770.53,"end":1772.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not you, buddy."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1772.69,"end":1780.29,"speaker":"Fr Stephen De Young","text":"Yeah, right. He can't go back. He's gone, he's thrown out. He's done."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1780.29,"end":1782.25,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's right, Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1782.25,"end":1785.09,"speaker":"Fr Stephen De Young","text":"He's in the underworld, that he's staying there. Right, Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1785.57,"end":1799.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But this is connected again, once again, back to the funeral. Because who's going to ascend this person by God's grace that you're burying in the ground? They're going to ascend the mountain of God."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1800.25,"end":1800.61,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1800.61,"end":1801.93,"speaker":"Fr Andrew Stephen Damick","text":"BAAL doesn't get to do it."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1802.33,"end":1815.85,"speaker":"Fr Stephen De Young","text":"This guy does Verse four, verses four and five. He that hath clean hands and a pure heart, who has not lifted up his soul unto vanity or sworn deceitfully. Right. He shall receive the blessing from Yahweh. Right. And righteousness from the God of his salvation."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1816.42,"end":1816.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1818.1,"end":1852.71,"speaker":"Fr Stephen De Young","text":"So he's the one. And that righteousness is literally he will receive justification for all. Right? He will. He's the one who will be put in order. That's that creation language. The same way that that Yahweh put the creation in order and restored them and built them and blessed them, he's going to do that to this human who does not belong to baal, and he's going to do it instead of baal. So this is that replacement idea going on and sort of being rubbed in his. In his face. Right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1853.75,"end":1863.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So then it's clear then that this understanding of what the psalm is for is preserved in orthodox liturgical practice by virtue of it being used in the funeral."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1864.07,"end":1864.91,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1864.91,"end":1865.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1865.31,"end":1867.67,"speaker":"Fr Stephen De Young","text":"And now as we come."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1867.67,"end":1868.23,"speaker":"Fr Andrew Stephen Damick","text":"Here we go."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1868.63,"end":1907.27,"speaker":"Fr Stephen De Young","text":"The last four verses are also preserved in orthodox liturgical practice. That's starting in verse seven. The Lift up your heads, O ye gates, and be lifted up, ye everlasting doors. And the King of glory shall come in. There's this dialogue, right, of who is this King of glory? And it's Yahweh, strong and mighty. Yahweh, mighty in battle. Then again, lift up your heads, O ye gates. Lift them up everlasting doors, and the King of glory shall come in. Who is this king of glory? Yahweh Sabaoth. That's the Lord of hosts. Yahweh Sabaoth, Yahweh of armies, as we."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1907.27,"end":1910.35,"speaker":"Fr Andrew Stephen Damick","text":"Talked about before, also known as the Lord of spirits."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1910.59,"end":1928.76,"speaker":"Fr Stephen De Young","text":"Right. He is the King of glory. So again, the name is important. He is the King of glory. Not anybody else. Right? Not anybody else. And so this. These verses which seem Kind of weird. Taken by themselves."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1929.16,"end":1929.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1929.88,"end":1934.28,"speaker":"Fr Stephen De Young","text":"Because gates don't have heads, Right. They can't lift them per se."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1935,"end":1944.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It doesn't seem to have questions, it doesn't seem to have on its face, it doesn't seem to have much to do with the six verses that came before."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1944.84,"end":1954.93,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. And so it's interesting sometimes to go and look at, look at some of the weird exegesis of this you get from."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1956.93,"end":1958.61,"speaker":"Fr Andrew Stephen Damick","text":"Certain sources, our friends."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":1960.53,"end":2065.74,"speaker":"Fr Stephen De Young","text":"The early modern periods of the 16th and 17th centuries, but I'll leave that to others. But they didn't have the bail cycle. And in the bail cycle and the. This is, I'll give you the reference. So this is Baal, Roman numeral 1, period, Roman numeral 2, period, 24 through 29. And the way that works is that means it's tablet, one column, two lines, 24 through 29. So if you're one of the folks out there who knows cuneiform, you could actually go look at the tablet, find this. Otherwise you could find it in a critical edition with that information. There is this episode during Baal's rebellion in which a group of angels, it's malak, it's the word for angel, which also means messenger, of course, come from yam and Nahar coming because they've heard rumblings that BAAL is up to something. BAAL is sort of being a rabble rouser on Mount Zephone amongst the other gods and is trying to get them to join his rebellion. And so these messengers come to say, hey, we heard there's something brewing here, you better not try anything, basically, right? And when they come and they enter the room, right, the representatives of Yamunahar enter the room. All of the gods who are sitting on their, their little thrones, they all sort of put their heads between their."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2065.74,"end":2071.22,"speaker":"Fr Andrew Stephen Damick","text":"Legs, yeah, like, don't hurt us, we're sorry, we're not with that guy."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2071.86,"end":2094.93,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So they all sort of wimp out and so Baal's sort of standing there by himself. So then BAAL has his sort of brain Braveheart moment where he gives his speech, right? He's gonna give his speech, he's gonna rally the troops, he's gonna tell the other gods, look, man, no, we can do this, you know, they can take our lives, they'll never take our freedom, you can't handle the truth, etc."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2095.33,"end":2098.61,"speaker":"Fr Andrew Stephen Damick","text":"And it's not this day, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2100.53,"end":2109.3,"speaker":"Fr Stephen De Young","text":"So he goes to give this speech and he begins it because they all have their heads between their legs by saying, lift up Your heads, O ye gods."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2110.26,"end":2110.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2110.98,"end":2137.84,"speaker":"Fr Stephen De Young","text":"And be lifted up as he gives this sort of rousing speech about how, you know, we're going to go to Delaware and then we're going to go to Pennsylvania and then we're going to go to many screams. Anyway, there's a reference for all the Gen Xers out there. So. Right, so these are the words with which in the BAAL cycle, BAAL rallies the other gods in his rebell to victory."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2138,"end":2140.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lift up your heads, guys. I've got this."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2142,"end":2207.78,"speaker":"Fr Stephen De Young","text":"And so what we see in the psalm is that Yahweh, the God of Israel, is throwing those words back at baal. He's throwing those words back at baal, the devil, who, even though he totally won twice for some reason down in the underworld. I meant that, I meant to do that, guys. Yeah, it's throwing it back at him, right? He's throwing it back at his face. The very, the very words that he used. So then the question is, well, why is it gates rather than gods? Right? And this is related to a little bit of what we talked about last time. This palace in Sheol, this palace in the underworld that BAAL ends up building, right, with the brazen gates that we talked about. So the reason Yahweh is talking to the gates is that he's coming in, right? BAAL hears him knocking and now he's coming in, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2208.34,"end":2208.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2210.18,"end":2253.25,"speaker":"Fr Stephen De Young","text":"So, and as he's coming in, he's throwing these words back at BAAL as a taunt, right. As mockery as he comes to raid his. His palace, right? So when we understand that you take the psalm as a whole, this psalm is prophesying that there's going to come a day that those, even the dead don't belong to the devil, they don't belong to baal, they don't belong to the Lord of the underworld, they don't belong to Hades or Sheol, they still belong to Yahweh, the God of Israel. And he's going to come down there and get them. He's going to come down there, break in and take them because they still belong to him."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2253.81,"end":2256.85,"speaker":"Fr Andrew Stephen Damick","text":"This is what we call the harrowing of hell."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2257.41,"end":2266.86,"speaker":"Fr Stephen De Young","text":"Right? And so then, and then 1200 or so years later, it happens, right? That's."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2268.62,"end":2285.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You know that, that you've got the, the God of death, the devil, laying claim to these dead people and God saying, no, actually they're mine. They're totally mine."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2285.74,"end":2328.48,"speaker":"Fr Stephen De Young","text":"Yeah. And so this is then a big part of what we're going to be celebrating as we come to the end of Holy Week, especially Holy Saturday, both in the morning and evening. We are going to be making present again. We talked about sacred time and space, the day on which this actually happened, when Christ, after his death on the cross, his soul descends into Hades and goes there to kick in the gates and those there who belong to. To him and his Father and bring them out."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2329.12,"end":2359.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's what's fun is if you look at, you know, iconographic representations of this, both east and west, it is not depicted as being like a nice, gentle, peaceful action. You know, the doors are being not just open, opened or whatever, but smashed open, and often various icons knocked on the ground. And one of my favorite that I saw today, the doors are smashed on the ground, and there's a demon who's been crushed underneath it, you know, with his legs and arms coming out. And the other demons are off to."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2359.65,"end":2362.69,"speaker":"Fr Stephen De Young","text":"The side going, whoa, whoa, what's. Hey, what's happening?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2363.73,"end":2388.98,"speaker":"Fr Andrew Stephen Damick","text":"No, yeah, right, right. And, yeah. So then. Then, you know, if you're. If you're Orthodox and you've been to Pascha, you've seen this. Now, it's my understanding that not every single tradition has the one particular part we're going to mention. But. But a lot of people are aware of it, even if they don't have this in their tradition. And if you're not Orthodox people, I'm just going to tell you right now, go to Pascha. You will see exactly what we're about to talk about. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2389.22,"end":2389.86,"speaker":"Fr Stephen De Young","text":"May 1st."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2390.26,"end":2400.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. May 1st. Late at night. Yeah. Make sure they. Yeah, there's some poor people. They show up. Like, they're going to show up in the morning of May 2nd. Go. So I understand this is your Easter. I'm like, we're sleeping it off."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2402.1,"end":2410.26,"speaker":"Fr Stephen De Young","text":"May 1, 2021, will become March 26, 50 or 30 A.D. right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2410.74,"end":2551.84,"speaker":"Fr Andrew Stephen Damick","text":"So everybody's going to be outside the church. There's going to make a procession around the church, and then there's going to be an entrance made. And in many traditions, what you're going to see is the priest is going to go up to the door of the church and he's going to bang on the door. Now, sometimes he does it with his fist, sometimes he does it with a hand cross. I have broken a couple of hand crosses. And he says, lift up your gates, O ye princes. Be lifted up, ye everlasting doors, and the King of glory shall enter in. And there's a voice from inside that says, who is this King of glory? Or as A good friend of mine once said about 20 years ago, who is this kling of glory? Which I have never let him to live down? I say to him, I text it to him every single year, who is this king of glory? Now, see, I'm going to mess up and say it wrong. And then the priest says, the Lord strong and mighty. The Lord mighty in war. And this is done three times. And then at the very end, the priest then says, the Lord of Hosts, he is the King of glory, or Yahweh Sabaoth, as it says right there in my bad version of Hebrew, he is the King of glory. And then the doors are opened. So what you get then, is this liturgical. It's not a reenactment. Remember what we said about ritual participation a zillion times in this show, that moment, that place, it becomes the invasion of Hades, truly, and you are there. This is the Son and Word of God, the Lord of Hosts himself, the Lord of spirits invading hell because he's going in there to release those who are held captive by the power of death and the devil. And so this understanding was preserved in the liturgical tradition of the Orthodox Church, even though probably a lot of you out there, this is the first time you've ever heard any of this stuff from the BAAL cycle. It was new to me just a few years ago, but this understanding was preserved in liturgical practice, that these lines from this psalm are about the invasion of the realm of death by the Son of God himself to come and rescue the dead. If that doesn't just blow you away, I don't know what's. Well, there's a lot more to come, actually. There's more to come."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2552.64,"end":2562.56,"speaker":"Fr Stephen De Young","text":"And I mean, to put a fine point on that, if you'd asked any Orthodox person who's the voice coming from, they would tell you, oh, that's the devil."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2562.72,"end":2563.68,"speaker":"Fr Andrew Stephen Damick","text":"That's the devil."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2565.28,"end":2665.63,"speaker":"Fr Stephen De Young","text":"What is this? Well, this is Christ kicking down the doors. And we're quoting this psalm, right? So that interpretation, that context for this passage of scripture, for Psalm 24:23, the context for that, the original ancient context for that, even though Ugarit was buried in the dirt for 3,000 years, that context was preserved in the Orthodox Church through its worship. And so this is what we're talking about. Not to go all the way down this rabbit trail, but this is at Exhibit A of what we're talking about in the Orthodox Church when we talk about tradition. Tradition isn't like some additional information that's not in the Bible that we added to the Bible. It's not just sort of folk customs that accumulated along the historic the route of history. When we talk about holy tradition, we're talking about the way in which the worship, the practice, the theology, all of this of the Orthodox Church has preserved the original context of the Scriptures, the original context of the belief of the apostles and of the prophets and the authors of scripture and of generations past. And this is Exhibit A of it. Yeah, because about the only place you could get that original context until we dug up Ugarit was the Orthodox Church. And most people who encountered it in the Orthodox Church, until we uncovered Ugarit, just thought, well, that's a weird allegorical interpretation or something, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2666.67,"end":2681.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. So that's the first half of the show. We've got two more halves to go and. Well, let's have a break and let's hear from the voice of Steve. Let's go to break."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2681.8,"end":2698.08,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2705.12,"end":2708.24,"speaker":"Fr Andrew Stephen Damick","text":"Tolkien enchantment and the Christian Life, an."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2708.24,"end":2711.32,"speaker":"Announcer","text":"Ancient faith event for the Christian, the."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2711.32,"end":2715.84,"speaker":"Fr Andrew Stephen Damick","text":"Enchanted or sacramental worldview is critical to a wholesome, full life in Christ."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2716.32,"end":2721.2,"speaker":"Announcer","text":"The work of fantasy author JRR Tolkien provides a shaping for the imagination and."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2721.2,"end":2723.21,"speaker":"Fr Andrew Stephen Damick","text":"Soul that contributes to to this vision."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2723.45,"end":2725.57,"speaker":"Announcer","text":"Join the hosts of Ancient Faith Radio's."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2725.57,"end":2728.25,"speaker":"Fr Andrew Stephen Damick","text":"Amansul podcast in this special online event."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2728.25,"end":2731.05,"speaker":"Announcer","text":"That explores how this shaping happens in."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2731.05,"end":2732.13,"speaker":"Fr Stephen De Young","text":"Partnership with the St."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2732.13,"end":2737.05,"speaker":"Fr Andrew Stephen Damick","text":"Basil center for Orthodox Thought and Culture. The webinar will take place on Friday."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2737.05,"end":2739.37,"speaker":"Announcer","text":"May 7, and Saturday, May 8, and."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2739.37,"end":2747.69,"speaker":"Fr Andrew Stephen Damick","text":"Speakers include Dr. Cyril Gary Jenkins, Father Andrew, Stephen Damick and Richard Rowland. The cost is $30, and registration will."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2747.69,"end":2750.46,"speaker":"Fr Stephen De Young","text":"Close on Wednesday, May 5, at noon Eastern."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2750.7,"end":2754.36,"speaker":"Fr Andrew Stephen Damick","text":"To secure your spot, please visit store.ancientfaith.com."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2754.72,"end":2761.5,"speaker":"Fr Stephen De Young","text":"Doximoot that's store.ancientfaith.com Doxamoot."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2767.98,"end":2784.05,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2786.61,"end":2852.56,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second half of the show, and it's where we begin to take your calls, just like the voice of Steve just said. You can reach us at 855-AF-RADIO or 855-237-2346. And it looks like we actually have a couple calls Coming in here. Oh, actually the person I was going to take just disappeared off the call board. All right, well, try to call back and we'd love to hear from you. All right, so just to recap, we were just talking about Psalm 24 in the first half and about how it is basically a whole bunch of smack talk against BAAL worship because ancient Israel was surrounded by BAAL worshipers and occasionally BAAL worship even invaded the life of the people of Israel. Some of them began to worship baal, and so BAAL was definitely a going concern in that time and place. All right, well, let's go ahead and take a call. So it looks like we have Eugene calling. And if I remember correctly, Eugene, you're somewhere in the upper Midwest, isn't that right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2853.12,"end":2854.48,"speaker":"Eugene","text":"Yeah, sure, you betcha."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2855.76,"end":2869.13,"speaker":"Fr Andrew Stephen Damick","text":"There it is. You ready to take your trip to Ugarit? Oh, yeah. Oh yeah. So Eugene, what is it you've got for us tonight? Eugene?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2869.53,"end":2875.05,"speaker":"Eugene","text":"Well, first I just gotta say that I'm very glad to finally be calling into the Amon Sua live Call in program."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2875.61,"end":2882.33,"speaker":"Fr Andrew Stephen Damick","text":"Uh huh, sure. Let's cut this guy off right now. Just kidding, just kidding, just kidding."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2884.01,"end":2885.85,"speaker":"Fr Stephen De Young","text":"Is this the token Tolkien call?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2886.01,"end":2888.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes, this is the guy who says that they're the same podcast."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2888.93,"end":2889.49,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2889.73,"end":2892.61,"speaker":"Eugene","text":"I mean, you've already referenced it a couple of times in this episode."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2892.77,"end":2893.49,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2894.69,"end":2934.62,"speaker":"Eugene","text":"Anyway, so, you know, sometimes when you're talking to Protestants about the harrowing of Hades, they will say that it's not anywhere in the Bible. And you guys have already addressed this a little bit, but I think if you're. And I know there's a couple references throughout the New Testament, but I think if you're taking, if you take the, the idea that you guys have been talking about, about spiritual geography, I think just the fact that Christ was buried in the ground is a biblical testimony to him entering into Hades."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2935.02,"end":2942.3,"speaker":"Fr Andrew Stephen Damick","text":"Ding, ding, ding. Yeah, yeah. I mean, notice when people go underground, that means something."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2943.34,"end":2945.18,"speaker":"Eugene","text":"Yeah, right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2946.54,"end":2952.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So is that your comment or do you have a question in addition to that?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2952.22,"end":2953.9,"speaker":"Eugene","text":"I was just asking if that was correct."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2954.54,"end":2955.22,"speaker":"Fr Andrew Stephen Damick","text":"But I do have."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2955.22,"end":2961.58,"speaker":"Eugene","text":"You are correct, if I can ask another question. But if not, that's okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2961.74,"end":2964.82,"speaker":"Fr Andrew Stephen Damick","text":"No, no, go ahead, throw it out. You're on the line. You might as well. This is your chance."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2964.82,"end":2987.16,"speaker":"Eugene","text":"All right, all right. So I was explaining to someone in an arch that I know who's orthodox about the ritual, that you guys were just talking about the knocking on the doors of the church and reading the psalm and he hadn't Heard about it before, but he seemed to have a problem with the idea that the church becomes Hades."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2988.12,"end":2988.52,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2990.36,"end":2997.92,"speaker":"Eugene","text":"It'S kind of been. I mean, it's come up in my mind too, but I'll just listen to your guys input on that."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":2999.28,"end":3001.28,"speaker":"Fr Andrew Stephen Damick","text":"Well, what do you have to say about that, Father Stephen?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3002.88,"end":3090.59,"speaker":"Fr Stephen De Young","text":"Well, the church isn't becoming Hades, Right. What you have is the event being collapsed because there's really two parts. And the other part is also depicted in iconography, though that iconography is less common. So the common iconography of. Of the resurrection, you have Christ's invasion of Hades. He's grabbing Adam and Eve and. And you've got the Old Testament Saints there, and St. John the Forerunner. The other half of that is Christ, then leading them into paradise. Right. And that iconography, usually you'll see like this big crew of people behind Christ walking into like a. A garden through a door. And Abraham will be hanging out there with a bunch of little kids representing people who died as children. And there's a guy holding a cross. That's Saint Dismas, the wise thief. Those are the people who are already in paradise. And then Christ is leading sort of everybody else right into there. And so when we do that ritual, on you notice, we. We don't do that on Saturday morning. We do it on Saturday evening because we're collapsed. We're sort of collapsing it into the second part of that event."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3091.07,"end":3098.11,"speaker":"Fr Andrew Stephen Damick","text":"So let me add this though, Father. There actually are some places, I understand, like in Greece, where they do that the night before."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3098.91,"end":3099.47,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3099.55,"end":3103.7,"speaker":"Fr Andrew Stephen Damick","text":"So there is a little bit of variation. Yeah, yeah, there's a little bit of variation at that point."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3104.17,"end":3125.93,"speaker":"Fr Stephen De Young","text":"Yeah, they're not collapsing it, they're doing it as the entrance into Hades, whereas we're collapsing the event when we do it on Saturday night. And so the church, right. You're outside and you're in the darkness. And then the church has been. Hopefully, if the guy you told to do it does his job, that year is completely illumined. Right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3126.33,"end":3126.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3127.61,"end":3158.38,"speaker":"Fr Stephen De Young","text":"So you're coming from the darkness into the light. So the part of coming into the church is the second part of that event, the coming into paradise. And so when you make the procession, the procession in the darkness with just the small light of the candle is the waiting in Hades of the departed saints. Right. Which then culminates in Christ's rescue of them, and they're entering into paradise, which is sort of collapsed there at the end."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3159.74,"end":3162.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So does that answer your question, Eugene?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3163.34,"end":3164.78,"speaker":"Eugene","text":"Yes, it does. Thank you."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3165.34,"end":3170.22,"speaker":"Fr Andrew Stephen Damick","text":"Excellent. Well, thank you for Calling. We are happy to hear from you. All joking aside."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3171.9,"end":3173.5,"speaker":"Fr Stephen De Young","text":"90% of joking aside."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3173.5,"end":3206.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Most joking aside. Yeah. All right, thank you. Okay, so we talked Psalm 24 last time. We talked about the invasion of Hades by Christ and the smack talk against baal. So let's move into another. Another group of. Of gods that we're gonna throw some more smackdown on. You know, people sometimes, like, you know, how can you be so sarcastic like that? Is that biblical? I'm like, yes. You know, they got the prophet Elias, who's the patron saint of sarcasm."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3207.02,"end":3219.1,"speaker":"Fr Stephen De Young","text":"Yeah. So, yes, there is a lot of sarcasm at Christ is actually sarcastic. Very sarcastic on several occasions. It gets kind of neutered in the English translation because, you know."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3219.1,"end":3221.46,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, that'll have to wait for another episode."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3221.46,"end":3221.94,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3222.18,"end":3225.3,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, so let's. Let's head on over to Egypt."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3225.38,"end":3226.26,"speaker":"Fr Stephen De Young","text":"Right? Let's go."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3226.26,"end":3228.18,"speaker":"Fr Andrew Stephen Damick","text":"Let's go put the smackdown on those guys."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3228.26,"end":3232.98,"speaker":"Fr Stephen De Young","text":"We're at this point, we're probably bailed out. So, boom, we'll."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3233.86,"end":3234.34,"speaker":"Fr Andrew Stephen Damick","text":"We'll."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3235.06,"end":3259.99,"speaker":"Fr Stephen De Young","text":"We're going to move on now to the Egyptians and specifically to the Song of the sea in Exodus 15. This is the biblical song of the sea. Not immigrant song or a sea shanty, which I guess are in with the hep cats these days, but this. Or pirate rap. That was in about 15 years ago. There was a trend. Anyway, I had just blocked that out."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3259.99,"end":3263.31,"speaker":"Fr Andrew Stephen Damick","text":"And now you're opening up old wounds."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3263.63,"end":3270.75,"speaker":"Fr Stephen De Young","text":"Yes. You're just picturing. You're picturing Jamie Bennett with an eye patch now. I know you are."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3271.15,"end":3271.71,"speaker":"Fr Andrew Stephen Damick","text":"I am."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3272.03,"end":3300.08,"speaker":"Fr Stephen De Young","text":"Hey, Jamie. Exodus 15 contains the song of the Sea, which is the reason it's called the Song of the Sea is that this is the song which we're told the children of Israel, led by Miriam, Moses's sister, sing after Israel has passed through. We'll say for now, the Red Sea."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3301.04,"end":3303.84,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Just put a pin in that name."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3305.6,"end":3325.74,"speaker":"Fr Stephen De Young","text":"And then. And then they sing this. This song of victory. And this is. While recorded in Exodus 15, this is one of the oldest. This is one of the two oldest pieces of anything that are in the scriptures."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3326.14,"end":3329.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's kind of almost in another language, isn't it?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3329.58,"end":3404.74,"speaker":"Fr Stephen De Young","text":"Yes, it's in a kind of Paleo Hebrew, so it's even hard to translate. The other very, very old One is Deuteronomy 32, and we've talked about Deuteronomy 32 a little bit before. We're going to talk about it some more in a little bit. But those are the first two odes of the canon. They're the first two biblical odes, right. In the Orthodox Church. And they are also these sort of ancient. And when I say that, because I know we're going to get all the angry Moses wrote the Torah people showing up at my house with pitchforks and torches. Right. So I'm not saying Moses didn't write the Torah, but what Moses wrote, first of all wouldn't have been on paper. It would have been on tablets. It wouldn't have been in Hebrew because the language didn't exist. It would have looked a lot more like Exodus 15 and Deuteronomy 32, frankly, than the rest of the Torah. Right. So it's better to talk about the Mosaic origin of the Torah or Pentateuch, the Mosaic authorship."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3404.74,"end":3405.46,"speaker":"Fr Andrew Stephen Damick","text":"Authorship."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3405.86,"end":3411.22,"speaker":"Fr Stephen De Young","text":"Because what we have is not exactly what Moses would have written down."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3411.94,"end":3422.66,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because he didn't speak that language. There wasn't that Alphabet, you know, like this has been handed down through some hands before."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3422.9,"end":3434.26,"speaker":"Fr Stephen De Young","text":"Translated. Translated into Greek, if you're an Orthodox Christian. Right, right. We give just as much, at least just as much authority to the Greek, which was a language that didn't exist when Moses lived."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3434.5,"end":3434.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3436.9,"end":3453.94,"speaker":"Fr Stephen De Young","text":"As we do to any other version. So this shouldn't be a big problem for people. But. And there are places where this is made plain, where in the text of the Torah or Pentateuch, you know, it'll say he went to this city which used to be called this other name."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3455.1,"end":3455.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3455.34,"end":3462.14,"speaker":"Fr Stephen De Young","text":"Well, that had to be written by somebody later. Right. That has been updated for a later audience."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3462.62,"end":3467.86,"speaker":"Fr Andrew Stephen Damick","text":"And then. And then the big teller, you know, is. Is when you get to the. The funeral of Moses."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3467.86,"end":3472.86,"speaker":"Fr Stephen De Young","text":"Right. Where Moses dies. Yeah. And it says his body has not been found until this very day."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3473.5,"end":3478.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which I mean, I guess you could say, well, he was writing this prophetically, you know, but."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3478.3,"end":3484.31,"speaker":"Fr Stephen De Young","text":"But then that makes no sense to say his body had not been found to this very day if he hadn't died yet. When you day was that?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3484.31,"end":3485.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3485.79,"end":3488.99,"speaker":"Fr Stephen De Young","text":"It was the day before he died. Right. So."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3489.55,"end":3489.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3489.91,"end":3523.09,"speaker":"Fr Stephen De Young","text":"Don't get too hung up on that. Yes. The Torah, the Pentateuch as we have it comes down to us from Moses. Right. But, but these two pieces of the text, the one we're going to focus Now, Exodus 15, the saga of the sea in Exodus 15 has come down to us with little to no editing. Right. That's what we mean by. It's the oldest part. It hasn't been edited. The language hasn't been updated, the vocabulary hasn't been updated. So much so that it's Very difficult to read and translate."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3523.33,"end":3524.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3524.93,"end":3532.7,"speaker":"Fr Stephen De Young","text":"And contains words from other Semitic languages and stuff. Right. So that's all we mean by that."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3532.94,"end":3548.46,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So. And. And, you know, if you happen to be listening to this in the recording, then I just suggest that you. Because we're not going to read the whole thing to you, but I just suggest you pause and then go read Exodus, chapter 15 and then come back. Okay. Welcome back."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3550.46,"end":3595.83,"speaker":"Fr Stephen De Young","text":"Good to have you back. Yes. So. So now the other. The other thing that's going to have people throwing things at me as we court controversy. Part of the problem in terms of interpreting this text and understanding this text is that in our contemporary world, almost all of the literature and time and attention that's devoted to this text is devoted to historical concerns. Right. Meaning, did the Exodus happen? Was there really a Moses? What year did it happen? Who was the pharaoh? Where did it happen? What body of water did they cross?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3595.83,"end":3631.07,"speaker":"Fr Andrew Stephen Damick","text":"This is. This is the stuff that is what history is now. Like, this is what the way history works now it's about, you know, trying to figure out what is in text is trying to compare against archeology. And I mean, listen, we're not saying that those are bad things to work on. Right. I mean, we talk about archeology, we talk, you know, like we're, we're. We're looking at those details in this very show, but it's not really what's actually important, and it's not really what's being represented in the texts."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3631.47,"end":3646.95,"speaker":"Fr Stephen De Young","text":"Right. Some of my best friends are PhDs in history. So we're not, we're not out to get you. But. But we have to realize that what we call history came into existence in the 19th century in Germany."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3647.35,"end":3647.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3648.07,"end":3653.91,"speaker":"Fr Stephen De Young","text":"It did not exist as a discipline before that. There was something they called history, but it's not what we call history."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3654.39,"end":3654.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3655.35,"end":3667.19,"speaker":"Fr Stephen De Young","text":"What we call history. The. The Germans in the 19th century, beginning at the beginning of the 19th century, decided that history should be approached as Wissenschaft. Meaning it should be approached as a science."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3667.77,"end":3669.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A kind of forensic."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3669.61,"end":3670.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3670.01,"end":3672.25,"speaker":"Fr Andrew Stephen Damick","text":"You know, dissection."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3673.21,"end":3709.36,"speaker":"Fr Stephen De Young","text":"It's a. It's a positivist. If you read anything from the 19th century, this positivist approach is everywhere. Like you read Hodges, Systematic theology from Princeton, who was a Presbyterian, wrote a systematic theology. Like his whole introduction is about how theology is a science. And if you start with the right principles derived from Scripture and follow logical inference, you know, the, the findings of systematic theology are just as certain as the findings of physics or chemistry. Right. And you're kind of rolling your eyes. Right. But it was the 19th century, especially 19th century Germans, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3709.36,"end":3710.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They said, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3710.92,"end":3740.05,"speaker":"Fr Stephen De Young","text":"We could approach this. We can know the essence of things. We can know the essence of events through the scientific method. Right. So you get people like Hegel and Feuerbach and Marx who say, hey, we could discover the laws that work themselves out in history. The same way the scientists are discovering the laws of physics or the laws of nature. Right. That history works the same way. Right. There's rules and principles that we can scientifically arrive at, and that's how we're going to interpret history."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3740.37,"end":3763.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's this sort of attempt to have a totally. You know, the word would be objective, quote, unquote. But really what that means is a kind of perspective. Less take. That's just a contradiction of terms. But the idea is like, well, no, this is what really happened. It doesn't matter. No. No one's opinion about it or experience of it is what we're discussing. We're talking about what really happened."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3763.66,"end":3773.6,"speaker":"Fr Stephen De Young","text":"Right. The essence. The essence of the event. And to quote Thomas Nagel of what is it like to be a bat Fame. There is no view from nowhere."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3774.95,"end":3775.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3775.67,"end":3778.83,"speaker":"Fr Stephen De Young","text":"There is no. There is no viewpoint that is no."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3778.83,"end":3810.62,"speaker":"Fr Andrew Stephen Damick","text":"Place somewhere like this is one of the points that, for instance, that our good friend Jonathan Pageau makes. He has an article which I recommend you check it out, called Most of the Time the Earth is Flat. And by that he does not mean that he thinks that the Earth is a flat disk. Sorry, flat Earthers. What he means is that your experience of it is that it is flat and that you experience that the sun rises. But I mean, we've said some of this kind of stuff before, but. So this is. But this is important for us to review it just a little bit because of what we're about to talk about."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3811.02,"end":3815.58,"speaker":"Fr Stephen De Young","text":"Right. I was just gonna say we set up for this in the last couple episodes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3815.58,"end":3816.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3816.58,"end":3821.74,"speaker":"Fr Stephen De Young","text":"There is an objective historical event. We're not in any way denying that these things really happen."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3821.74,"end":3823.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We're not solipsists."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3823.98,"end":3829.07,"speaker":"Fr Stephen De Young","text":"We don't have access to the essences of things, including historical events."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3829.55,"end":3829.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3829.95,"end":3861.23,"speaker":"Fr Stephen De Young","text":"What we have are the record of human experience, of humans who experience those events. And there's an interaction between their human consciousness and the event. And the record we have is the interplay of those two things. And so if the person is telling the truth about their experience, then their account is true. It doesn't matter if we have another person talking about the same event. And those Things don't match up perfectly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3862.03,"end":3862.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3862.59,"end":3871.87,"speaker":"Fr Stephen De Young","text":"They could both be true. They could both be telling the truth if they're describing their experience accurately. And so this is. Yeah, go ahead."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3871.87,"end":3894.03,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say. And that's what the Bible is. Yeah. And like, I mean, a lot of you have probably heard this before, this argument, you know, talking about, for instance, the four Gospels. Okay. So if you read the four Gospels, you will notice that there are some details that don't quite seem to exactly reconcile with each other, which clearly means."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3894.03,"end":3895.55,"speaker":"Fr Stephen De Young","text":"They'Re totally made up, totally fast."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3895.55,"end":3981.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, exactly. Whereas what. What. What St. John Chrysostom actually says about this is what was new to me. I didn't know that he made this argument. I was so delighted to discover that he had. He basically says, look, if there's a conspiracy, and, you know, you have a group of people that all give the exact same testimony in court and it's exactly the same, you can tell that that is a conspiracy, that. That they're lying together in the same way. But when you've got these different perspectives that don't all quite line up of this, of various people who witness the same thing and experience the same thing, that actually is an authenticator for the truth of what actually happened. Right. And that is just a beautiful way of talking, of describing the problem that we're addressing right now. Because, you know, this sort of scientific method approach to history and so forth would suggest that the only true account would always perfectly line up, like you said, that these sort of. These laws of history that kind of play out. But the truth is, know that that's actually exactly wrong. That's exactly wrong. That if everything lines up, that's probably an indication that a whole bunch of people are all telling the same lie. You know, it just would never be that way. You know, especially if it's like a big traumatic or dramatic or violent event or something like that. You're going to get very different perspectives as to what occurred."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":3982.51,"end":4118.34,"speaker":"Fr Stephen De Young","text":"Yeah. And let me not very humbly suggest that this is the orthodox answer to the great impasse of Old testament studies. The 19th century ruined old Testament studies because with this new positivist definition of history and understanding of history, what you got was very quickly, our German liberal friends who had come up with this idea of history, start applying it to the Old Testament. And they say, well, okay, we have these written documents, and yes, those are evidence, but those are evidence from one perspective. Therefore, they aren't the essence of the events, they aren't the reality of the events. And so we're going to now construct our laws of history, and we're going to go and we're going to do archaeology, and we're going to gather all the other evidence, we can find documents from surrounding cultures, and we're going to reconstruct what actually happened. And if that conflicts with what the Bible says, then we just say, well, the Bible's got it wrong or the Bible's biased, or the Bible doesn't have the truth. So that's their approach. And so to this day, if you go to a biblical studies conference, you'll have people who go to the Book of Joshua and say, well, look, this is just Israelite propaganda. None of this happened. And we're going to reconstruct what actually happened. And since we accept the Marxist laws of history, that all of history up until the 19th century was the history of class struggle, that that's what's going on here. And there was really a Canaanite peasant revolt led by some escaped Egyptian slaves. That's what really happened. And then that was mythologized by the later Israelites into the book of Joshua. That's, to this day, that's a very common view of what. What's going on with Joshua in academia right now. Right. In reaction to that, your conservative Old Testament folks, mostly conservative Protestants, reacted to the exact opposite extreme. They didn't reject that definition of history. They accepted that definition of history. They just said, no, what the Bible records is the literal, actual essence of the historical events with no bias and no perspective whatsoever."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4118.92,"end":4119.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4119.24,"end":4121.64,"speaker":"Fr Stephen De Young","text":"So it happened exactly as it says."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4122.04,"end":4137.32,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is why then you get like, okay, so we're actually about to start talking about the crossing of the Red Sea, where you then get people coming up with theories about strong winds and, you know, all of this kind of stuff to try to sort of figure out the physics of how this worked."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4137.72,"end":4149.4,"speaker":"Fr Stephen De Young","text":"Right. And so when they do archaeology, you've got the Bible, King James Bible in one hand and a spade in the other hand, and you're out there trying to pray, prove. I'm going to prove that this is literally exactly true."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4149.72,"end":4151.52,"speaker":"Fr Andrew Stephen Damick","text":"Well, if it's the King James Bible, I mean."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4151.52,"end":4168.52,"speaker":"Fr Stephen De Young","text":"Yeah, so. And this is the impasse that Old Study, Old Testament studies has been in for 150 years. And I think there's a very orthodox way right through it, which is to understand that we don't know the essences of events and we can't know them."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4168.92,"end":4169.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4169.28,"end":4172.38,"speaker":"Fr Stephen De Young","text":"Especially events of the distant past. I mean, Aristotle could have told you."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4172.38,"end":4173.06,"speaker":"Fr Andrew Stephen Damick","text":"This too, but."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4174.82,"end":4189.54,"speaker":"Fr Stephen De Young","text":"We know how those events appeared to the people who experienced them. That's what we have access to. And we have particular accounts of those experiences which are authoritative and which have been handed down to us."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4190.34,"end":4196.98,"speaker":"Fr Andrew Stephen Damick","text":"Right. And that especially as Orthodox Christians, we believe that the Holy Spirit had something to do with that."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4198,"end":4203.68,"speaker":"Fr Stephen De Young","text":"Right. And we seek to share the experience of the people who experience God directly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4203.84,"end":4204.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4204.24,"end":4209.76,"speaker":"Fr Stephen De Young","text":"In these events, not to get at some reality that lies behind the experience."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4210.24,"end":4248.12,"speaker":"Fr Andrew Stephen Damick","text":"Right now that might seem like a long sort of rabbit trail or whatever go down, but it's. Well, number one, this is actually one of our kind of over overarching themes for this whole podcast. Right. But in particular for tonight, since we're about to start talking about the crossing of the Red Sea, it's really important so that you know that what we're about to talk about is the experience of the people who were there and how they recorded it and how that was then handed on within the context of the people of God as guided by the Holy Spirit, God himself. That's what we're talking about."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4248.93,"end":4249.17,"speaker":"Eugene","text":"So."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4249.49,"end":4252.69,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, let's. Should we talk about why Red Sea is not the name?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4252.93,"end":4254.73,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4254.73,"end":4257.73,"speaker":"Fr Andrew Stephen Damick","text":"It's not the Red Sea, everybody. Oh, it is the Red Sea, but it's not the Red Sea."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4257.73,"end":4346.67,"speaker":"Fr Stephen De Young","text":"Well, it sort of is the Red Sea. Yeah, yeah. So it was the Greeks who started calling it the Red Sea. We'll start there. Right. So, so the name Red Sea would have meant nothing to Moses or the Israelites or the Egyptians. That's not what they called it. That's what the Greeks called it. And so when the Septuagint gets translated, which is the Torah in Greek gets translated, they said, what body of water is this? Oh, that's the Red Sea. So they translated it as Red Sea. That gets into English Bibles because as we were talking about earlier, the King James translators, for example, were kind of scratching their head, head at the Hebrew saying, what body of water is this? They looked at the Greek, they looked at the Latin, they said, oh, the Red Sea. We know where that is. Right. So they carried that over into English. So in terms of colors, we'll do a callback there we go to our friend the mantis shrimp. The, the Egyptians not only didn't refer to it as the Red Sea, but they referred to all big bodies of water as the great green. That's what the Egyptian literally means, the great green. Because they didn't see blue, they couldn't see blue. There's our callback. But so they referred to the Mediterranean as the Great green to the north, or the great green of the north."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4347.31,"end":4347.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4347.63,"end":4356.84,"speaker":"Fr Stephen De Young","text":"Because they're in Egypt and they referred to what the Greeks called the Red Sea as the great green of the."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4356.84,"end":4367.4,"speaker":"Fr Andrew Stephen Damick","text":"East, which I feel like that. That should be, you know, a 1950s superhero exclamation. Great green of the east back then, you know."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4368.04,"end":4373.4,"speaker":"Fr Stephen De Young","text":"Oh, yeah, everybody had one. Yeah, great. Caesar's ghost was a good one."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4373.4,"end":4374.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes, indeed."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4374.28,"end":4379.8,"speaker":"Fr Stephen De Young","text":"Did Caesar's ghost just appear to newspaper editors at random? Like, how does that work?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4381.4,"end":4385.42,"speaker":"Fr Andrew Stephen Damick","text":"But that's another episode. Yeah, great."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4385.42,"end":4428.98,"speaker":"Fr Stephen De Young","text":"Greed of the East. Yeah. Was Caesar a Nephilim? Is that what's going on? Anyway, so now what's actually there in the Hebrew is yam suf, which, you know, this is. This is one of those tidbits that people pick up off of Bible documentaries, right? There's a few tidbits that people get and then sometimes, depending on what they do with them, cause people great consternation. Like, they hear that Satan is a title, not a name or something, and they go and start bothering people on Twitter. But in this case, it's. It's yam suf means sea of reeds is what you'll usually hear, which is not wrong, as we're about to talk about."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4429.46,"end":4429.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4430.5,"end":4448.04,"speaker":"Fr Stephen De Young","text":"But although it does mean sea of reeds, suf can mean reeds. The earlier meaning of the word suf, if you go back further into the Middle Kingdom in Egypt, suf meant the end, or the extremity, or the border. Or the border."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4448.44,"end":4449.08,"speaker":"Fr Andrew Stephen Damick","text":"The edge."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4449.08,"end":4465.02,"speaker":"Fr Stephen De Young","text":"The edge. Sort of the extreme part. And so in that context, it would have meant something like the sea at the end. The. The end of the. The end sea or the border sea."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4465.5,"end":4466.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4467.1,"end":4503.62,"speaker":"Fr Stephen De Young","text":"And that makes sense for that same rough body of water because it's at the eastern border, Right. Of Egypt. Right. It's sort of marked off the eastern border. And to get even more specific about the body of water, thanks to the Google and the Google Earths, we've now seen from satellite imagery that in ancient times there were a series of locks connected to the. What we now call the Red Sea."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4504.34,"end":4527.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. To. To control, you know, the flow of water, which super important, you know, if flooding is important, is a key part of your agriculture, which in Egypt, in the ancient world, it definitely was. So. Yeah, Right. So it's this border water that's got a series of locks, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4527.37,"end":4542.21,"speaker":"Fr Stephen De Young","text":"This sea of the end. And so anybody exiting Egypt is going to have. And heading east is going to have to cross through this system of locks. Right. In order to get out. They're going to have to move through them."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4542.69,"end":4544.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4545.41,"end":4545.81,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4545.81,"end":4597.52,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, I was going to say. So what's interesting then is you. You know, most people, when they think about the crossing of the Red Sea, they see one of two images in their head. One of them has Charlton Heston. The other one is probably the animated film about Moses. And it. It's, you know, the people of Israel all running away from Pharaoh and his soldiers so that they don't get killed and they cross it, and then it comes in on Pharaoh and his soldiers and they all die. And yet, weirdly then, Exodus 15, the song of the Sea, depicts the whole thing as being a battle. So what's going on there? What's that all about? Wait, it is not a battle. I thought it was a last desperate escape, you know, that they got away just in time. They didn't actually fight the Egyptians."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4598.08,"end":4610.08,"speaker":"Fr Stephen De Young","text":"And this is. This is part of the fallout, I think, of that. That whole impasse and debate we were talking about, right, is that it becomes about, well, did this miracle happen?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4610.72,"end":4611.68,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4611.68,"end":4635.93,"speaker":"Fr Stephen De Young","text":"This is this miraculous, absurd thing that we modern science people can't believe. Right? And then, you know, other people react and say, no, we. We must believe that this literally happened exactly like this, this miracle. But, yeah, that's not how the Song of the Sea sees it. It's not just like, wow, God did this cool thing with the water. There was a whale swimming around inside the water wall and all that. Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4636.01,"end":4642.01,"speaker":"Fr Andrew Stephen Damick","text":"Which, I mean, that's cool. I mean, I love those. You know, it's. It's. It's pretty neat, you know, Cecil B. DeMille and whatever."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4642.01,"end":4654.48,"speaker":"Fr Stephen De Young","text":"But, yeah, that's not the focus of the saga of the sea. The saga. The sea is. Yahweh just laid the smack down right on Pharaoh and his army at all."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4655.68,"end":4665.68,"speaker":"Fr Andrew Stephen Damick","text":"Right? Because. And God, you know, telegraphed this move at the beginning of the whole incident. God says, I am now judging the gods of Egypt."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4665.92,"end":4671.32,"speaker":"Fr Stephen De Young","text":"Right? That's at the pat. That's what he says he's doing at the Passover, which is what leads to the Exodus right now."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4671.32,"end":4675.39,"speaker":"Fr Andrew Stephen Damick","text":"I will. The throwdown happens. This is what I'm about to do."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4676.27,"end":4697.31,"speaker":"Fr Stephen De Young","text":"And so this is as it's presented in the Song of the Sea. This is sort of the crossing of the sea is the last battle of that war with the God of Egypt. And that's why right at the beginning, in verse three, it says, yahweh is a man of war. Yahweh is his name. Which would make a great book title, huh?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4697.31,"end":4699.94,"speaker":"Fr Andrew Stephen Damick","text":"But God is a man."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4699.94,"end":4723.38,"speaker":"Fr Stephen De Young","text":"Hang out there. Interestingly, you know. Now people find that kind of controversial because we don't like war. That was actually controversial in the ancient world because of the man part. Oh, people were like, wait, Yahweh's a man? What? Right, well yes, Stay tuned for a later episode on the second person of the Trinity."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4724.02,"end":4725.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, exactly."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4726.34,"end":4741.14,"speaker":"Fr Stephen De Young","text":"So actually. Yes, right. And so this is, this is this sort of climactic battle and you see that in some of the other language used also there are repeated references to Yahweh's right hand and strong arm."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4741.46,"end":4758.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, over and over. It's, it's there, yeah. Like verse six. The right hand, O Lord, has become glorious in power. Thy right hand, O Lord hath dashed in pieces the enemy. By the way, that's the verse that the priest says as he puts on his right cuff when he's getting his vestments on. How about that?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4761.23,"end":4781.23,"speaker":"Fr Stephen De Young","text":"Right, so this, this language is brought out there and you know it's easy to just kind of say oh that's, that's an allegorical thing. Right. Like oh you know, most people are right handed, so that's your strong arm. Right, so it's like, yeah, he slugged them. But this actually has a very specific, specific Egyptian reference."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4781.23,"end":4799.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. We're not just making, we're not just commenting, you know, using language like we used in, in the the Body episodes, everybody, you know, the right hand of the Lord is his strength. That is true. But that's not all that's going on here because once again we're talking about divine smack talk against demonic gods."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4800.31,"end":4800.67,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4800.67,"end":4803.59,"speaker":"Fr Andrew Stephen Damick","text":"So yeah, so what's, what's the right hand and strong arm stuff?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4804.49,"end":4817.61,"speaker":"Fr Stephen De Young","text":"The God of war in this period of Egyptian history is the God Mantu. And Mantu was seen as sort of an aspect of Re, the sun God, the most high God of the Egyptian."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4819.13,"end":4819.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4819.93,"end":4843.58,"speaker":"Fr Stephen De Young","text":"The Egyptian, what we would now call a pantheon. But of the Egyptian gods, he was the one who is the, of their council of gods. He was the most high God. And as an aspect of Rey, Mantu was particularly depicted as Rey's right arm. He's Rey's right arm and he's the war God. They're God of war."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4843.58,"end":4843.94,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4844.18,"end":4861.96,"speaker":"Fr Stephen De Young","text":"And this became a title because in this period I mentioned to you when we were, when we were talking about, about this episode that I have like a 300 page book on the naming conventions of the pharaohs throughout the various periods of Egyptian history."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4862.12,"end":4864.6,"speaker":"Fr Andrew Stephen Damick","text":"I bet it is a real page turner."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4864.6,"end":4887.61,"speaker":"Fr Stephen De Young","text":"Oh it is. And One of them during this period was every pharaoh had what was called his Horus name because the pharaoh was seen to be an sort of incarnation or aspect of Horus the son of Re. And so one of the pharaoh's titles was Horus of the strong arm."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4888.01,"end":4888.81,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4890.97,"end":4910.2,"speaker":"Fr Stephen De Young","text":"So this. This is an important. This is a way that the Egyptians expressed their power in war, their might in battle, the way the pharaoh himself expressed his might in battle. And so we have in response, Yahweh saying, oh, yeah, I just trashed Pharaoh and his armies, the Egyptian gods, with my right arm."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4911.64,"end":4913.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4913.88,"end":4918.76,"speaker":"Fr Stephen De Young","text":"And even centuries later, the prophet Ezekiel is still rubbing this in."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4919.08,"end":4938.21,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right, right. I love this. So Ezekiel, chapter 30, verse 21. Son of man, I have broken the arm of Pharaoh, king of Egypt, and lo, it shall not be bound up to be healed, to put a roller to bind it, to make it strong, to hold the sword. So it's still the smack talk continues."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4940.61,"end":4944.69,"speaker":"Fr Stephen De Young","text":"Notice, right, the right arm is broken. Can't hold a sword, can't make war."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4945.17,"end":4945.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4945.97,"end":4959.81,"speaker":"Fr Stephen De Young","text":"This is about war, Right. And about defeat. And we also have this referred to in the Politician of the Resurrection in tone three."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4960.54,"end":4961.74,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4961.74,"end":4973.9,"speaker":"Fr Stephen De Young","text":"Which says that the Lord has done a mighty act with his own arm. And that own there is again, this is that, like pointing out the name. It's his arm that's mighty."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4974.3,"end":4974.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4974.86,"end":4976.22,"speaker":"Fr Stephen De Young","text":"So not anybody else's."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4976.54,"end":4980.7,"speaker":"Fr Andrew Stephen Damick","text":"The smack talk continues even now to the very present day."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4981.5,"end":4982.86,"speaker":"Fr Stephen De Young","text":"Unto this very day."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4982.94,"end":4983.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4983.98,"end":4985.18,"speaker":"Fr Stephen De Young","text":"Until this very day."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":4986.99,"end":5004.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And what is. And just, you know, since this is our Harrowing of Hell episode, what is the act that the Lord has done with his own arm? Destroying death. That's right. Destroying death. So. Right, right. Okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5005.15,"end":5011.71,"speaker":"Fr Stephen De Young","text":"Yeah. But now going a bit further, right, and this is about the Reed Sea."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5012.52,"end":5013.8,"speaker":"Fr Andrew Stephen Damick","text":"The Reed Sea, Yam suf."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5013.8,"end":5036.92,"speaker":"Fr Stephen De Young","text":"Because we've set up the idea of sacred geography, right? So we've talked about. Yes, there's this border sea, right? There's this Yam Suf, this border sea that they have to cross. But we've also talked about how places, these material places become in time and space. Spiritual places, spiritual geography."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5037,"end":5037.26,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5037.49,"end":5077.9,"speaker":"Fr Stephen De Young","text":"And there is a spiritual place called the Sea of Reeds called the. The Yam Suf. This is in Egyptian. Yes, that first syllable is MK like Mr. Mackie. But the. The. This is. Or not. Not, McKay. Sorry, I got ahead of myself. So the Reed Sea. The Reed Sea is the sort of Egyptian equivalent in the Middle Kingdom. You see this in, like, the Pyramid texts of the River Styx. It's the body of water you have to cross after death to get to the place of your abode."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5077.9,"end":5093.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And all of you symbolic world people will recognize when you see some kind of border with water on it. You should be thinking about entering into a realm of chaos and death. Like, it's just. That's the margin. Right, the margin."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5094.07,"end":5107.11,"speaker":"Fr Stephen De Young","text":"And so if you can get past this watery body, the Sea of Reeds, then you'll get to the other side and you'll have this shadowy existence in the presence of the Egyptian gods."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5107.75,"end":5109.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just like in Greek mythology."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5110.47,"end":5130.06,"speaker":"Fr Stephen De Young","text":"And so the pyramid texts are burial texts with spells and. And invocations and that kind of thing to help get the spirits of the gods to guide the Ka, the soul of the departed person, through the sea of reeds to the other side safely."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5130.86,"end":5131.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5131.22,"end":5158.4,"speaker":"Fr Stephen De Young","text":"If you don't. This is where I got ahead of myself. If you don't make it, you become one of the mku. The MKU are the drowned ones is what that literally means. These are people who get tangled in the reeds and get pulled down into the sea of reeds and sort of lose their identity. Right. And become the drowned ones. They're the damned for Egyptians, that's what you don't want to happen to you."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5158.96,"end":5163.04,"speaker":"Fr Andrew Stephen Damick","text":"Sort of. Could they be called the Dead Marshes? Just putting it out there. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5164,"end":5165.76,"speaker":"Fr Stephen De Young","text":"Why are you trying to prove that guy? Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5168.16,"end":5172.83,"speaker":"Fr Andrew Stephen Damick","text":"But I mean, it's the same. But I mean. Okay, well, you know, if you don't mind if I go there for a second. It's the same. Same thing."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5173.07,"end":5173.79,"speaker":"Fr Stephen De Young","text":"Yeah, it is."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5173.79,"end":5198.03,"speaker":"Fr Andrew Stephen Damick","text":"It's the same thing. So you've got Frodo and Sam and Gollum crossing over this marshy area, and there's. What do you know, there's dead people down there in the water. And what's on the other side of it? Mordor, the place of death. The dark. The land that's governed by essentially the local Satan. So, I mean, I mean, yeah, obviously this is not the Tolkien podcast, but, I mean, Tolkien is working in these exact same images in there."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5198.03,"end":5198.31,"speaker":"Fr Stephen De Young","text":"He's."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5198.31,"end":5231.36,"speaker":"Fr Andrew Stephen Damick","text":"He's. He knows this stuff. So. Yeah, I mean, you know, Eugene is wrong, but he's not totally wrong. There are definitely touchstones between these images. Right. You know that there is this sense that human beings have that there's a watery thing that you cross over, and on the other side is the realm of death, and there's a big, bad death God over there. Like, that's something that kind of mankind has always thought in one way or another. So, yeah, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5231.52,"end":5261.59,"speaker":"Fr Stephen De Young","text":"And. And so the. The whole promise of Egyptian religion, what they're working towards as they serve their gods, right, and do these rituals and everything, is this idea that perhaps, you know, and especially the pharaoh has the best shot at it of getting across the Sea of Reeds to this. This. This shadowy existence safely. And lo and behold, look what the Song of the Sea points out happened. Pharaoh and his soldiers are the drowned ones."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5261.59,"end":5270.55,"speaker":"Fr Andrew Stephen Damick","text":"The drowned ones? But wait, I thought that all religions were just trying to get everybody to heaven. Isn't that what they're really all about? Aren't they the same? No, no, no."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5270.95,"end":5288.72,"speaker":"Fr Stephen De Young","text":"Okay, so the drowned ones are Pharaoh and his armies. And the ones who were guided through to the other side were guided through safely to the other side to go and dwell with their God in the Promised land by Yahweh. Yahweh is the one who did that."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5288.96,"end":5305.96,"speaker":"Fr Andrew Stephen Damick","text":"Right. And it's not, you know, and it's important to note here that they don't, like, take the long way around. They don't hop over, they don't tunnel underneath. They go through the realm of death. Order to get to the other side."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5306.44,"end":5306.8,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5306.8,"end":5310.2,"speaker":"Fr Andrew Stephen Damick","text":"They go through it. That's really important for this."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5310.2,"end":5348.81,"speaker":"Fr Stephen De Young","text":"Right. So they. So when we talk about Pascha, which means Passover and passing from death to life, right. That's not an allegorical thing. What they're telling us of the Song of the Sea is that the people who were there, who experienced this the first time, had the experience of passing through death, passing through the realm of death and being brought through safely to the other side, to new life by Yahweh, the God of Israel. And that's the experience we're sharing in when we celebrate Passover. When we celebrate Pascha."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5349.05,"end":5490.38,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yeah. And so this stuff. Then again, we're going to connect this directly to liturgical stuff that Orthodox Christians are experiencing in the next week, or if we do have at least one listener, I think, in Finland, who experienced it a few weeks ago. But anyway. Next week. Next week. Okay, so there is a canon that is the canon of Holy Saturday. So it's first sung on Holy Friday night during that matin service, which is what? The funeral of Christ, essentially. But then that same canon actually gets repeated during the midnight office at the Paschal services. So it's. It's. It gets reused. And in the sixth Ode. Right, which always. Which. Which I shouldn't say always. Well, yeah, it always thematically connects in one way or another with. With Jonah. So. Right. So often the sixth ode has references to Going underwater and this kind of thing and, you know, and experiencing death. In that sixth ode, you've got this line, the children of those who were saved hid underground, the God who made the persecuting giant of old to disappear in the waves of the sea. Right. So that means that the fathers who wrote these hymns deliberately picked this image of passing through the sea of reeds and describes Pharaoh as a persecuting giant of old, comes right out and calls him a giant, and made him disappear in the waves of the sea. So this image that we were just talking about now is specifically pointed in our liturgical hymns to be appropriate for the events that happen with Holy Saturday and with Pascha itself, because Pascha is Passover. It's the Christian Passover. These things are all connected. It's right there. And what do you know? There's a giant right there in the midst of it. You know, who is this demonized king? Pharaoh. Right down. Down in the part, horse in the underground. Right, right, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5490.38,"end":5556.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And then, of course, you know, this is. This is how. This is why St. Paul sees this connection between the crossing of the Red Sea and baptism, because he understands Christian baptism as dying and rising with Christ passing from death to life in the waters, which is exactly what Exodus is talking about. There's no allegory here. That's what it's talking about. And so that's why we read chant, depending on the parts, the story of the crossing of the sea and the song of the sea at the baptismal liturgy on Saturday morning, when you do the whole baptismal liturgy with the 15 Old Testament readings, which I always try to schedule at least a Chrismation so that we can do that, the longer version on Holy Saturday. And this, again. This is again, part of that. The darkness and light imagery we were talking about earlier at the rush service on Pascha night. And this whole idea of, again, sharing that experience of being brought through death into life on the other side."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5556.9,"end":5595.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're not avoiding death, they're passing through death to life. It's. It's resurrectional. That's what's going on here. So. All right, well, that is the second half of our show, but since it's the Lord of Spirits, there's a. There's a third half. So in our first half, we talked about the invasion of Hades and the smack talk against baal. The second half, we talked about Passover going through the sea of reeds, passing through death to life. What's going to happen on the third half? We'll be right back after this here's the voice of Steve."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5598.04,"end":5614.44,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5621.24,"end":5669.72,"speaker":"Fr Stephen De Young","text":"Ancient Faith Publishing presents I Live a Memoir of Ileana, Princess of Romania and archduchess of Austria, who in later life became Mother Alexandra, founder of the Orthodox Monastery of the Transfiguration in Pennsylvania, who wrote this memoir shortly after relocation, relocating to the US in the 1950s. It tells the story of a life full of suffering, tragedy and exile. But all is suffused with the author's deep faith, hope, love and even joy. This reprint includes additional material collected by the nuns of her monastery that sets the memoir in the context of Mother Alexandra's later life. To find this book and others like it, you can go to store ancientfaith again, that is store.ancient faith.com."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5671,"end":5687.16,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5689.16,"end":5743.9,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of our Holy Week in Pascha Spectacular, the Harrowing of Hell here on the Lord of Spirits. Wow. So that's a lot we just went through, but we've got even more. But before we get to that, I actually want to mention something that I know that a lot of you have been waiting on very anxiously and demanding pre orders and wanting to even see if you could possibly buy the bibliography. Yes. People are asking, asking to buy the bibliography, Father Stephen, of Father Stephen's book that's coming out in just about, God willing, about a week and a half. It's supposed to come out during Bright Week. We can't give you a precise date, but it is on track to release when it's intended. It's called the Religion of the apostles. It's about 300 pages long. Is that right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5743.9,"end":5745.34,"speaker":"Fr Stephen De Young","text":"Father Give or take."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5745.34,"end":5809.21,"speaker":"Fr Andrew Stephen Damick","text":"Give or take. Give or take. Yeah. And it is not Lord of Spirits in print. Okay. That's not what the book is, but if you like this podcast, you will love the book. I know that sounds very cheesy, but it's true because a lot of the things that we talk about in the show, Father Stephen has written in the book in a much more systematic kind of way. But there's also a whole lot more in there as well. And there is indeed a bibliography. This is probably the question we get every single day, you know, can you give me some suggestion for further reading? Well, it's going to now be there in the back of the book. And the book is indexed, it's fully indexed. That's a really important thing for a book like this. So God willing, it's going to come out, as I said, during Bright Week. And I hope everybody will order a copy, order 10 copies. We have a sort of competition going on in the Lor of Spirits Facebook discussion group trying, attempting to try to out buy the supply. We encourage you to do that if you possibly can. But you know, we will only just order up a reprint, so. So you will not defeat us at Ancient Faith Publishing."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5809.45,"end":5826.17,"speaker":"Fr Stephen De Young","text":"But it is, it is very important that everyone listening right now and everyone hearing the recording contact Father Andrew by any means at your disposal and ask to pre order the book. Because I've heard they might run out. I don't want to panic anybody, but I heard."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5829.29,"end":5845.87,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much. Yeah, no problem. Thank you. Thank you so much for that. All right, well, before we get to the third half of our show, we have a question, a call coming in from Aaron who has a question about the Sea of Reeds. So Aaron, are you there?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5847.31,"end":5848.51,"speaker":"Eugene","text":"Hi, can you hear me?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5848.83,"end":5855.23,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Welcome to the Lord of Spirits. Aaron, we are really happy to have you. What is your question or comment for us tonight?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5856.27,"end":5917.77,"speaker":"Eugene","text":"Okay, there is this common story with the Greeks and the Egyptians about this watery abyss that people have to travel through in order to get to wherever it is they get to. Now that Christ has raided Hades and taken all of the souls out of there, both good and bad, damned and righteous, I want to know where we fall into that. Now as Orthodox, we believe that there's this 40 day period where we pray for the soul. I wonder if that, if there's some kind of like parallel there, the 40 days that happens that we pray for the departed and this previous notion of having to kind of go through this intermediate phase on our way to Hades 4, if that, whatever the answer may be, how that applies to both Orthodox and non Christians and what you can make of that question."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5918.65,"end":5928.65,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, I have some ideas, but I know that Father Stephen has much more coherent ideas about this because we've talked about it. So I'm going to punt on over to Lafayette, Louisiana."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5929.05,"end":5938.9,"speaker":"Fr Stephen De Young","text":"Okay, well, if you're trying to get me to talk about toll houses, you done messed up, Aaron. Rod, I'm joking, I'm joking. I just wanted to make the key and peel joke."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5938.9,"end":5939.38,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":5941.86,"end":6013.18,"speaker":"Fr Stephen De Young","text":"So, yeah, a couple things. First of all, Christ only got the righteous out of Hades, right? This is, this is a place where our English translations fail us a little because you're, you're probably thinking of a lot of our hypnography. We'll talk about like, like with himself, he has raised up all the dead, right? And you're like, well, that, that sounds like all the dead, right? Sounds like everybody. But one of the tricksy things hidden in St. Paul's Greek is that he puts a definite article in front of the word necros sometimes and sometimes he doesn't. So when St. Paul uses the word necros, dead, right? The noun dead without the article, right? Without what we would call a, the. Right. Without an article, he's referring to just everyone who's dead, right? Dead people in general. When St. Paul puts the definite article in front of it, so it's the."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6013.18,"end":6013.66,"speaker":"Fr Andrew Stephen Damick","text":"Dead."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6016.87,"end":6196.67,"speaker":"Fr Stephen De Young","text":"Capital T, capital D. He's referring to departed Christians, he's referring to the departed faithful. And he distinguishes that very carefully. And so in our hymnography, when, when you hear like, he has raised up all the dead, it's all the dead, right? It's all the faithful, it's the, the Old Testament saints. So he brings them to paradise, the others remain in Hades. So, but to the, the main, the main thrust of your, of your question, we do believe and there is no, you know, there are theories which I won't go into more detail on, but there is no sort of dogmatic, structured way of looking at the sort of 40 day journey that a soul takes on its way to paradise or Hades to await the resurrection. We know that there is a 40 day period because that's part of the experience of the faithful that's been handed down to us. How exactly that works, we don't know. We probably can't know because, you know, you don't know what it's like to be a bat. You also don't know what it's like to be a disembodied human soul. That's right. And how that, you know, I mean, our experience of time and space and everything is related to our material bodies. So without that, what, how has that experience changed? We don't know. We'll find out. But that there is that period and that there is that journey, that on that journey the faithful Christians are protected by and guided by their guardian angel and by angels, that there are demons involved going the other way, we have those kind of things. But there's no sort of very Firm, detailed thing related to that. Now, of course, that would mean that in our understanding, before Christ's harrowing of Hades, everyone was going to the same place, different parts, as we talked about last time. Different parts of the same place, but the same place. And that's why the language that you get in the Old Testament prophets is all about, you know, the Lord will not abandon my soul to Hades or to the Sheol. Yeah, Right. Meaning I'm gonna go there. But even when I go there, God will still be with me and he will not leave me there. Right. That there will be some rescue coming, which is the prophetic element that points to the reality of the heroine of Hades. But so now there are different, quote, unquote, places. Of course, we're using the term place metaphorically. Right. Because where wherever Christ is, that is paradise. So when Christ is in our midst in the liturgy, that is paradise. And that means that all of the saints and all of the faithful departed are there with us."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6197.87,"end":6202.97,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Does that answer your question, Aaron?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6205.69,"end":6208.13,"speaker":"Eugene","text":"It gives me a lot more questions, but yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6208.13,"end":6213.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. This is not easy. This is not easy stuff. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6213.29,"end":6222.09,"speaker":"Eugene","text":"Will kind of have a kingdom down there in his, you know, because when Christ returns and we're all with him."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6222.97,"end":6223.97,"speaker":"Fr Stephen De Young","text":"Well, no, they're gonna."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6223.97,"end":6224.65,"speaker":"Eugene","text":"I was gonna."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6225.23,"end":6228.43,"speaker":"Fr Stephen De Young","text":"They're gonna get dumped in the lake of fire. That's what Hades gets emptied out."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6229.71,"end":6230.63,"speaker":"Eugene","text":"Oh, yikes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6230.63,"end":6240.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, we'll. Yeah, we'll probably talk about all that horrible, horrible stuff in a future episode. We like to say that a lot. But it's true. It's true."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6240.99,"end":6242.19,"speaker":"Fr Stephen De Young","text":"We love horrible things."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6242.83,"end":6250.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Somebody's got to talk about it, so. All right, well, thank you very much for calling, Aaron. It was a privilege to have you on the show tonight."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6251.24,"end":6252.04,"speaker":"Eugene","text":"Thanks, Fathers."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6252.12,"end":6313.73,"speaker":"Fr Andrew Stephen Damick","text":"All right, good night. All right, well, for our third half, the smack talk continues. Now, again, we're connecting with stuff that everybody should know. Who's Orthodox and goes to church in Holy Week in Pascha, because you're going to go to every single service you can this next week. There is, of course, one of the very most memorable moments is the paschal sermon of St. John Chrysostom. And as it gets towards the end, he quotes from First Corinthians, chapter 15, verse 55, O death, where is thy sting? O grave, where is thy victory? And it turns out that that actually is a quote from Hosea13, although a little bit reworded. What's going on there in Hosea, chapter 13 that St. Paul is quoting in First Corinthians 15."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6313.81,"end":6316.93,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah, specifically Hosea 13, verse 14."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6317.17,"end":6318.29,"speaker":"Fr Andrew Stephen Damick","text":"Verse 14. Yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6319.09,"end":6324.69,"speaker":"Fr Stephen De Young","text":"And, yeah, I think more people have read First Corinthians than Hosea for some reason."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6325.25,"end":6328.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which I like. Hosea is awesome, people, by the way."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6328.85,"end":6331.06,"speaker":"Fr Stephen De Young","text":"It's beautiful. It is beautiful."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6331.06,"end":6331.82,"speaker":"Fr Andrew Stephen Damick","text":"And not long."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6332.3,"end":6340.62,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So I'm going to give my own translation of Hosea 13, verse 14, because they're all over the place."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6341.18,"end":6344.78,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I looked this up and I was like, what? What? What?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6346.22,"end":6377.63,"speaker":"Fr Stephen De Young","text":"And part of this is because what we're going to bring out tonight here in the third half is that there are a bunch of proper names, specifically proper names of. To quote Winston, or to paraphrase Winston, Zedmore, moldy old Canaanite gods who are mentioned here. And so what happens is, most translations you pick up are not going to translate them as the names of these Canaanite gods, but are just going to try to translate them as words."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6378.11,"end":6378.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6378.67,"end":6381.31,"speaker":"Fr Stephen De Young","text":"And so you get a variety of interesting things."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6381.79,"end":6392.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. So like, for instance, if. If my name were in an ancient text and they did that, it would not say Andrew, Stephen. It would say manly crown, which would make no sense."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6392.45,"end":6395.89,"speaker":"Fr Stephen De Young","text":"Or the crowned man. They'll try to make sense of it. Right, the crowned man."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6396.45,"end":6404.89,"speaker":"Fr Andrew Stephen Damick","text":"Who's this crowned man? No, it's Andrew, Steven. So, yeah, so this is the Deyoung standard version of Hosea, chapter 13 version."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6404.89,"end":6438.16,"speaker":"Fr Stephen De Young","text":"I don't know that it's standardized, really. It's kind of the Deyoung intuitive version, provisional. I won't stand by it. Anyway, so Hosea 13, 14 is roughly, I will ransom them from the hand of Sheol, I will redeem them from Mote. O Mote, where is Deborah, O Sheol, where is Keteb? Compassion is hidden from my eyes. And we'll just leave it there. That's. I think that makes sense."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6438.48,"end":6439.92,"speaker":"Fr Andrew Stephen Damick","text":"That makes total sense, everybody. Good night."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6439.92,"end":6440.8,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. No."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6442.68,"end":6444.36,"speaker":"Fr Andrew Stephen Damick","text":"So, okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6444.84,"end":6472.71,"speaker":"Fr Stephen De Young","text":"Right. So a lot of times, for example, this is similar to something we were just talking about, the Song of the Sea, that first part, where it talks about the hand of Sheol, they'll say, like, the power of the grave, because they're translating Yad, their hand. Well, that means might or power. And Sheol means the grave. Right. But of course, Sheol is not just the grave. It's also a place and it's also personified."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6473.59,"end":6473.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6473.95,"end":6482.63,"speaker":"Fr Stephen De Young","text":"Either as a God or. And. Or as sort of a creature with a big gaping mouth. Right. Like swallowing."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6482.63,"end":6485.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Lots of iconography has the big mouth."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6485.63,"end":6524.07,"speaker":"Fr Stephen De Young","text":"Of hell, the hell or Hades, or. Right, the big mouth. So this is this is Yahweh saying, I will ransom them from the hand of Sheol. So if we think about the. This personification, this is an actual hand, a grip, right? They're being held, right? These people are being held by Sheol. And then in parallel with it, because this is how Hebrew poetry works, right? You have this. These parallelisms. So that's parallel, that ransoming them from the hand of Sheol is paralleled with I will redeem them from Mot, which is then translated into Greek as Thanatos, which is also the name of a God."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6524.88,"end":6535.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. And for Arabic speakers, you know the word Al Maut, right? That's death, you know, but it's not just death. It's Mot, the God of death."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6535.52,"end":6541.76,"speaker":"Fr Stephen De Young","text":"Right? This is. This is the one who BAAL was tangling with earlier when he totally victoriously went to the under."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6544.72,"end":6545.12,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6546,"end":6589.72,"speaker":"Fr Stephen De Young","text":"So it's not just that, well, I'm gonna redeem them from death in some allegorical or metaphorical sense, but Mote, the God of death, who rules this realm, has them, and I'm going to come get them. Right, Right. And so then. Right, and this makes sense when in the next sentence, O Mote, where Yahweh, the God of Israel, speaks to death. Again, this isn't an allegorical thing. He's talking to Mote, right? Right. The God of death, the Lord of the dead. And he says to him, where is Deborah? Right. And then he talks to Sheol. It says, oh, Sheol, where is Ketep? Compassion is hidden from my eyes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6591.08,"end":6592.88,"speaker":"Fr Andrew Stephen Damick","text":"So who's Deborah and who's Keteb?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6592.88,"end":6600.12,"speaker":"Fr Stephen De Young","text":"Right. He's asking Mot and Sheol where these other two people are. Right. Where these other two beings are."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6600.52,"end":6608.82,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this is the part that parallels then, First Corinthians 15:55. O death, where is thy sting? O grave, where is thy victory?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6609.3,"end":6627.3,"speaker":"Fr Stephen De Young","text":"Right. And so. And you see this pairing, by the way of right, of death and Sheol, of Thanatos and Hades, Also in Revelation 6, verse 8, the last. The last of the four horsemen."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6627.62,"end":6628.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes, death."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6628.9,"end":6630.9,"speaker":"Fr Stephen De Young","text":"And Hades follows with him."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6631.8,"end":6632.04,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6632.04,"end":6679.06,"speaker":"Fr Stephen De Young","text":"Right. So he's a horse man. These are getting personified in the inevitable Four Horsemen episode. We'll talk about how all four of the four horsemen are moldy old Canaanite gods in the book of Revelation. But so these two are paired there. The idea is that death sort of feeds Hades. Right? Hades is this creature with this maw. He's this beast who follows death. Right. And death sort of feeds people to him. Right. He's sort of the rancor keeper. Right. Who's throwing the. That was unexpected. That was. Yes. So he's throwing. He's Bosco. Feeding. Feeding the people. Okay, who is the job of the."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6679.06,"end":6680.14,"speaker":"Fr Andrew Stephen Damick","text":"Hut in this scenario?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6680.22,"end":6683.3,"speaker":"Fr Stephen De Young","text":"Yeah, that's what I'm guessing. I don't know."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6683.3,"end":6684.62,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Okay. All right. All right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6684.62,"end":6742.37,"speaker":"Fr Stephen De Young","text":"So Bib Fortuna. We won't go there anyway. So Deborah and Keteb, then, are these servants of Moat. Right. Deborah and Keteb are also Canaanite gods who are mentioned a whole bunch of places when their names are translated. They're usually translated as Pestilence and Plague. So you may already be thinking about the Four Horsemen again. But the idea is that these two sort of work for and accompany Moat. Right. So Moat wants to feed Sheol, and he does that by sending his boys round, right. Deborah and Keteb who are going to go out there, plague and Pestilence and kill people. Right? Kill people with famine, kill people with disease, kill people. Then Moat gets a hold of them, feeds them to Sheol, feeds them to Hades, feeds them to hell."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6742.61,"end":6743.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6743.01,"end":6777.1,"speaker":"Fr Stephen De Young","text":"And right, we see that accompaniment idea in Habakkuk 3, verse 14. And I know everyone has read Habakkuk if they haven't read hosea, but Habakkuk 3 is actually the fourth biblical ode. We're going through a lot of the biblical odes that's tonight. And in that, it describes Deborah Keteb as sort of part of this posse. And this wasn't just a thing with Mot in Canaanite thinking. This was also a thing with Marduk."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6778.46,"end":6779.66,"speaker":"Fr Andrew Stephen Damick","text":"He's Babylonian."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6779.98,"end":6815.54,"speaker":"Fr Stephen De Young","text":"Yeah. Who was the Babylonian baal, essentially, he's the one who went and took out his parents and took over the Neo Babylonian empire. So, and Marduk had Nergal, you know, he had his posse who went out and killed for him. But in Habakkuk 3, which is also smack talk, it's talking about how Yahweh actually has Deborah and Keteb in his entourage, that he's the one. It's Yahweh, the God of Israel, who has control over Pestilence and plague."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6816.27,"end":6846.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And then this connects us with this theme we've seen before, which is that these afflictions, right, these demonic afflictions that are loose in the world, they obviously have their own agenda, but ultimately they are, to use St. Gregory the Great's language, the left hand of God. They are the demons. They're doing their will, but ultimately still they're doing the will of the Lord, who is trying to bring people to repentance. That's the whole. The whole point."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6847.22,"end":6852.66,"speaker":"Fr Stephen De Young","text":"Right. And so none of these pagan gods could be appeased in order to protect you from plague or pestilence."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6853.22,"end":6853.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6853.94,"end":6892.24,"speaker":"Fr Stephen De Young","text":"They're not the ones who wield them. They're not the ones who. Who have control over them. We also see Keteb shows up in the second ode, second biblical ode, in Deuteronomy 32. He shows up there with Reshef, who we'll find out in that inevitable episode is one of the four horsemen, who is a guy who shoots arrows of plague. There's actually a very early chthonic version of Apollo, who's basically Reshef brought over into Greek thinking. And in Deuteronomy 32, their keteb is hanging out with Mo."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6894.16,"end":6894.96,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6895.2,"end":6934.4,"speaker":"Fr Stephen De Young","text":"And then these folks also show up in Psalm 91, in the Hebrew numbering of the Psalms 90, in the Greek numbering of the Psalms, verses 5 and 6. And if you've been to any of the great compline services in Lent or at the Orthodox church, or if you go to sixth hour, you'll also hear about this both in the prayers and in the reading of the Psalm. But in verse 5 and 6, if you translate the names as names, it refers to Deber who walks in darkness, and Keteb who destroys at noon."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6934.88,"end":6951.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. Or as probably most of us have heard, the demon who walks in the darkness and the demon of noonday or something like that. The noonday demon. Right. And doesn't that get read also in the funeral? Right. Isn't it the psalm that's at the beginning of the funeral?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6951.2,"end":6951.52,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6951.52,"end":6956.53,"speaker":"Fr Andrew Stephen Damick","text":"That we're actually asking God to save the. This person from Deborah and Ketep."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6956.77,"end":6988.54,"speaker":"Fr Stephen De Young","text":"Right. This is. There were in the Second Temple period in Judaism, we find these. For example, in the Dead Sea Scrolls, there were six psalms that were considered Davidic psalms of exorcism that David wrote to be sung over someone who is demon possessed in order to exorcise them. This is the only one of them that's a canonical psalm. The other five are not canonical. But so this was an exorcism psalm from very early and from as far back as we know, was used at orthodox funerals as well."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6989.02,"end":6995.1,"speaker":"Fr Andrew Stephen Damick","text":"So you've got exorcisms at baptism and now an exorcism again at the funeral. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":6995.58,"end":7013,"speaker":"Fr Stephen De Young","text":"And by the way, the reason it's translated as demon of noonday is that the Greek translators of what was for them, Psalm 90, realized this, that these were proper names. And so they translated it. They didn't say, the plague that destroys at noon."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7013.56,"end":7014.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7014.92,"end":7067.94,"speaker":"Fr Stephen De Young","text":"The demon who destroys at noonday. Right, the new day demon, because they realized what it was referring to. And also in that psalm, the arrows that fly by day is referenced to Reshef, again, who we mentioned earlier. But, yeah, as an aside. So the. The idea here in, in when we piece together Habakkuk, when we. When we look at what's going on in Hosea, is that God has disarmed. Has disarmed Death, right? The God of Death. These weapons that he thought he had have been taken away from him, and God now has them. And so he's literally in Hosea, sort of taunting him, right? He's like, hey, Death, where's. Where's your boy, Deborah? Oh, he's over here with me. Oh, where's Ket at? Oh, yeah, he's here with me, too."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7069.86,"end":7145.54,"speaker":"Fr Andrew Stephen Damick","text":"Right? You're all alone, Right, Right. And you know, another thing I wanted to mention, as we've been kind of moving along this, you know. So, okay, you've got this line from Chrysostom's homily where he's quoting 1 Corinthians 15, oh, death, where is thy sting? O hell, or O grave or Hades, whatever. Where is thy victory? That's what this is referring to. It's talking directly to these demons and saying that their power has been stripped from them. But at the same time, there's another liturgical connection, if you understand these references to Mote, to the God of death, right? So if you sing the Paschal Apolitikian, Christ has risen from the dead. If you sing it in Greek, Christosaenestiaknekron thanato thanaton patissas. That means. So we translate it as, you know, trampling down death by death. But a more. A clearer reading of that might be trampling down Thanatos, the God of death, by the means of death. That's what's going on there. And of course, if you sing it in Arabic, you've got Maut al bamaut, right? So again, Mote, the God of death, being trampled down by means of death."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7147.22,"end":7149.86,"speaker":"Fr Stephen De Young","text":"Demon with the door on his face, Right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7149.94,"end":7180.95,"speaker":"Fr Andrew Stephen Damick","text":"The demon whose face is smashed in by the door when the Lord busts his way into Hades, Right? So, you know, like when you sing. So next week you're going to sing this hymn. Christ has risen from the dead, trampling down death by death, and upon those in the tombs, bestowing life. When you get to that line, trampling down death by death. Understand what you're singing, that Christ is smashing the God of death by means of his own death, his own entrance into Hades."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7182.23,"end":7204.76,"speaker":"Fr Stephen De Young","text":"Right. And this. This idea of disarmament and stripping of power is exactly what St. Paul does with it in First Corinthians. And you have to understand this to understand what he's doing, because what he says immediately after quoting Hosea is he says, now the statement sting of death is the law, which is sort of like, wait, what? Like, where did that come from? Right. Because he's talking about the resurrection."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7205.24,"end":7205.56,"speaker":"Eugene","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7205.56,"end":7241.89,"speaker":"Fr Stephen De Young","text":"But if you think about this, the imagery we have here that Hosea is working with is that death is laying claim to people, right through plague and pestilence, right through his minions. It's laying claim to people and dragging them to Hades, to Sheol. Right. That's what death is doing. Right. So for St. Paul, how is. How is the Devil laying claim to people and dragging them into Sheol, into Hades, into death? Through sin. Right, through sin, through the violation of the law."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7242.05,"end":7242.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7243.01,"end":7271.74,"speaker":"Fr Stephen De Young","text":"But the law, The Torah, for St. Paul, is not evil. It's neutral. And so Christ has taken it back and has now made the commandments, has now made the Torah, something which gives life instead of death. This is one of St. Paul's ongoing themes. So he's using it in the same disarmament sense. And then he makes that quite literally plain in Hebrews chapter two, if you want to read that."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7272.38,"end":7297.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, sure. So in Hebrews 2:14, forasmuch, then, as the children are partakers of flesh and blood, he also himself likewise took part of the same, that through death he might destroy him that had the power of death, that is the devil. Yeah."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7299.6,"end":7302.77,"speaker":"Fr Stephen De Young","text":"So pretty direct, right?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7303.33,"end":7349.24,"speaker":"Fr Andrew Stephen Damick","text":"Right. Well, that is the third half of our show, and Father Stephen is going to give his closing remarks, and then I have something to share with you, but before we do that, I just want to wish all of you a very, very powerful Holy Week and Pascha coming up. And our next episode, which will be, again, the. It'll be the second Thursday of May, so it's going to be three weeks from today. If you're listening to us live, is going to be a Q and A episode where we're just going to hammer one question after another. So, you know, especially if you've called in and, you know, your question wasn't directly applicable or we couldn't answer it tonight, you know, call in for that time, and we'd love to talk to you. So. All right, Father Stephen, your final thoughts?"}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7349.4,"end":7362.58,"speaker":"Fr Stephen De Young","text":"Yeah, well, people may or may not have noticed I didn't make as many pop song references tonight. That's because Father and Andrew and I had a discussion. Do you remember this discussion, Father Andrew? No."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7362.74,"end":7363.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7363.38,"end":7616.53,"speaker":"Fr Stephen De Young","text":"Well, we had. We had this discussion because I. I made a reference to screaming trees and I nearly lost you. And so then I was like, well, can I make like a space hog or a helmet reference in the meantime? And you were like, no, no, but that. That you suggested that I make an Oasis reference. And I said, maybe. I said maybe. But 90% of kidding aside. Again, thank you. So I think, though it may not seem so at first, I think an important thread running through what we talked about tonight, not directly related to Holy Week and Pasca, is the issue of what sometimes gets called the problem of e. Evil, Specifically, the way it takes the form of the problem of suffering in the world, even though we've talked about one element of it that we came to again tonight, the idea that these evil powers are indeed evil, but are not outside of God's control, that God has control of them. And God can ultimately use. Use them to bring about his will and to bring about good. He can bring good out of evil. That's what God does. But another important aspect of that is something that we just sort of touched on when we talked about the song of the sea. And that's the idea that, as Father Andrew said, you know, God doesn't take them around the sea. He doesn't take them around death. He doesn't just sort of swoop down and strike Pharaoh and his armies dead on land. He doesn't, you know, break all their chariots so they can't catch up with the Israelites. He doesn't spare them from danger. He doesn't spare them from the experience of death. And I think often when we look at our lives and when we look at our prayer lives and when we. We interact with God prayerfully, we treat it as if God is supposed to spare us from sorrow and spare us from pain and spare us from death. And when these things enter our lives, we act like they're these weird foreign intruders. And why is God doing this to me? Or why is God allowing this to happen to me? And we've got it exactly backwards, right? Because the sorrow and suffering and pain and struggle and sin in our lives is a foreign invader to God's creation. But it's not a foreign invader to our lives into our consciousness, because we continually invite and bring it in and bring it about and cause it where God intervenes is not to stop us from choosing it, not to stop us from bringing it into our lives, but to graciously bring us through it and out the other side to something better. God isn't going to stop us from suffering. He's not going to make us immortal so we never die on this earth. He's not going to make it so we never get sick. He's not going to make it so we never suffer loss or hardship or any of those things. All those things are in the world because of us. But what God is going to do, what he's promised to do and what he is actively doing is bringing us through all of those things and out the other side, side to light and to peace and to joy and to life that is eternal with him, not to some kind of shadowy existence, but to rule and reign with Christ for eternity. And so that is. That is the promise. That is where our joy as Christians in suffering can come from. That's why Lent is a bright struggle, not just a struggle. That's why all of our efforts can be conducted with joy. Because as the Psalm says that we read at the end of the pre sanctified liturgies we've been having in Lent, many are the tribulations of the righteous man, but the Lord will deliver him from them all."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":7620.85,"end":8164.6,"speaker":"Fr Andrew Stephen Damick","text":"Well, to close, I want to share with you one of my favorite passages of anything that I've ever read. So this comes from a text that is called the Gospel of Nicodemus. And it is, as far as I know, I think it's dated generally to the 4th century, but you know, it comes out of traditions that are certainly older than that. And there's a portion of the Gospel of Nicodemus that the best way that I can understand how to describe it would be that there's all these things that we go through together, for instance, during Holy Week. And this is what's described in the Gospels, right? And you know, Christ's passion, his suffering, his death, his resurrection. Well, there's a portion of the Gospel of Nicodemus that's called the Descent into Hell. And it's probably best described as what's going on down in the underworld while all these other things are happening on earth. Okay. And right before the passage I'm about to read to you, Hell and Satan are having a conversation. So, you know, we've been talking about a whole bunch of these various gods, right? So you think of this as, you know, Mot and Sheol, you know, having a conversation, or Satan in Hell. You Know however you want to talk about it, right? There's just different names for these, these beings. And, and it's being set up so that Satan is basically saying, you know, hell, open up your gates, because I'm bringing Jesus in here. You know, we, we got him. We finally got him, right? The devil thinks he's finally got him. So they're having this conversation. It's going back and forth, and it picks up right here. Hell answered and said, thou has told me that it is he that hath taken away dead men from me. For there be many which, while they lived on the earth, have taken dead men from me, yet not by their own power, but by prayer to God. And there Almighty God hath taken them from me. Who is this Jesus, which by his own word, without prayer, hath drawn dead men from me? Perchance it is he which by the word of his command did restore to life Lazarus, which was four days dead and stank and was corrupt, whom I held here dead. Satan, the Prince of Death, answered and said, it is that same Jesus. When Hell heard that, he said unto him, I adjure thee by the strength and mine own that thou bring him not unto me. For at that time I, when I heard the command of his word, did quake and was overwhelmed with fear. And all my ministries with me were troubled. Neither could we keep Lazarus. But he, like an eagle shaking himself, leaped forth with all agility and swiftness and departed from us and the earth also, which held the dead body of Lazarus straightway gave him up alive. Wherefore now I know that that man which was able to do these things is a God, strong in command and mighty in manhood, and that he is the savior of mankind. And if thou bring him unto me, he will set free all that are here shut up in the hard prison and bound in the chains of their sins that cannot be broken, and will bring them unto the life of his Godhead forever. And as Satan, the Prince and Hell spoke this together, suddenly there came a voice as of thunder and a spiritual cry. Remove, O princes, your gates and be ye lift up, ye everlasting doors, and the King of glory shall come in. When Hell heard that, he said unto Satan the prince, depart from me and go out of mine abode. If thou be a mighty man of war, fight thou against the King of glory. But what hast thou to do with him? And Hell cast Satan forth out of his dwelling. Then said Hell unto his wicked ministers, shut ye the hard gates of brass, and put on them the bars of iron, and withstand stoutly lest we that hold captivity be taken captive. But when all the multitude of the saints heard it, they spake with a voice of rebuking unto hell, open thy gates, that the King of glory may come in. And David cried out, saying, did I not, when I was alive upon earth, foretell unto you? Let them give thanks unto the Lord, even his mercies and his wonders. Unto the children of men who hath broken the gates of brass and smitten the bars of iron and sunder, he he hath taken them out of the way of their iniquity. And thereafter, in like manner, Isaiah said, did not I when I was alive upon earth, foretell unto you the dead shall arise, and they that are in the tombs shall rise again. And they that are in the earth shall rejoice, for the dew which cometh of the Lord is their healing. And again I said, o death, where is thy sting? O Hell, where is thy victory? When they heard that of Isaiah, all the saints said unto hell, open thy gates. Now shalt thou be overcome and weak and without strength. And there came a great voice, as of thunder, saying, remove, O princes, your gates and be lift up, ye doors of hell, and the King of glory shall come in. And when Hell saw that, they so cried out twice, he said, as if he knew it not, who is this king of glory? And David answered Hel. And said the words of this cry, do I know. For by his spirit I prophesied the same. And now I say unto thee that which I said before the Lord, strong and mighty, the Lord mighty in battle, he is the King of glory. And the Lord looked down from heaven that he might hear the groanings of them that are in fetters and deliver the children of them that have been slain. And now, O thou most foul and stinking hell, open thy gates. The King of glory may come in. And as David thus spake unto hell, the Lord of majesty appeared in the form of a man and lightened the eternal darkness and brake the bonds that could not be loosed. And the succour of his everlasting might visited us that sat in the deep darkness of our transgressions and in the shadow of death of our sins. When hell and death and their wicked ministers saw that they were stricken with fear, they and their cruel officers, at the sight of the brightness of so great light in their own realm, seeing Christ of a sudden in their abode. And they cried out, saying, we are overcome by thee. Who art thou that art sent by the Lord for our confusion? Who art thou that without all damage of corruption, and with the signs of thy majesty unblemished dost in wrath condemn our power. Who art thou that art so great and so small, both humble and exalted, both soldier and commander, a marvelous warrior in the shape of a bondsman, and a king of glory, dead and living, whom the cross bears slain upon it. Thou that didst lie dead in the sepulchre hast come down unto us living, and at thy death all creation quaked, and all the stars were shaken, and thou has become free among the dead, and does rout our legions. Who art thou that set us free? The prisoners that are held bound by original sin, and restorest them into their former liberty. Who art thou that sheddest thy divine and bright light upon them that were blinded with the darkness of their sins? After the same manner all the legions of devils were stricken with like fear, and cried out all together in the terror of their confusion, saying, Whence art thou, Jesus, a man so mighty and bright in majesty, so excellent without spot, and clean from sin. For that world of earth, which hath been always subject unto us until now, and did pay tribute to our prophet, hath never sent unto us a dead man like thee, nor ever despatched such a gift unto hell. Who then art thou that so fearlessly enterest our borders, and not only fearest not our torments, but besides essayest to bear away all men out of our bonds peradventure Thou art that Jesus, of whom Satan our Prince, said that by thy death of the cross thou shouldst receive the dominion of the whole world. Then did the King of glory in his majesty trample upon death, and laid hold on Satan the Prince and delivered him unto the power of hell and drew Adam to him unto his own brightness. And that is our show for today. Thank you for listening. If you didn't get a chance to call in during the live broadcast, we would love to hear from you, either via email@lordofspiritscientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything, but we can't respond to everything we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":8168.36,"end":8174.28,"speaker":"Fr Stephen De Young","text":"4 Thursdays of the month at 7pm Eastern 4pm Pacific and if you're on."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":8174.28,"end":8185.45,"speaker":"Fr Andrew Stephen Damick","text":"Facebook, like our page and join our Discord discussion group. Leave reviews and ratings everywhere. But most importantly, do what I know a lot of you are doing. Share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":8185.77,"end":8198.57,"speaker":"Fr Stephen De Young","text":"If you join our Facebook group now, you can be sworn as a Space Monkey before Project Mayhem begins. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":8199.45,"end":8204.49,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much. God bless you and may he give you a bright and glorious Pascha."}
{"episode_id":"LOS - #018 - 2021-04-23 - The Lord of Spirits Goes to Hell","start":8218.17,"end":8255.38,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
