{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":0.8,"end":78.48,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":79.28,"end":135.48,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, yuletide yellers at Yant Gantitin. You are listening to the Lord of Spirits podcast. My co host, Father Stephen DeYoung, the scourge of Surgat is with me, straight from the swamp in Lafayette, Louisiana. And I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, high atop the Eldritch tower of podcasting, perched above a disused gateway to the underworld. We're not live today because this is a pre recorded episode fashioned for you. For this Christmas season we're cleaning out our speak pipe backlogs and our intern Nero Ahenobarbus has collated no fewer than 17 voicemails, sifting them carefully out from a pile of 616 options that also included, and I'm not joking about this, the effect of holiness on bodily functions. And no fewer than seven separate serial voicemails from one non denom pastor who has so many bones to pick with us that he could teach an anatomy class with them."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":135.88,"end":137.4,"speaker":"Fr Stephen De Young","text":"So you're just teasing me with that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":139.32,"end":146.36,"speaker":"Fr Andrew Stephen Damick","text":"See, I chose him. Father Stephen doesn't listen to anything or read anything I have to do. Our intern took care of it this time."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":146.36,"end":148.03,"speaker":"Fr Stephen De Young","text":"Yes, Our intern. Come on, keep with the."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":148.1,"end":172.42,"speaker":"Fr Andrew Stephen Damick","text":"That's right, that's right. So he's been, he's been quite, quite the busy intern. He does good work. He keeps leaving and coming back. But anyway, so yeah, we do have, we do have 17, so. And it's, it's quite a. Quite a variety actually. I think. I think people will like this one. I. I hope. Anyway, so. Are you ready, Father Stephen?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":172.5,"end":175.74,"speaker":"Fr Stephen De Young","text":"I'll I'll say something incredibly spicy if it starts to get dull."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":175.74,"end":177.25,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, all right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":177.25,"end":178.61,"speaker":"Fr Stephen De Young","text":"I have takes on reserve."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":179.89,"end":183.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we have to get people to listen to these Q and A episodes, you know?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":183.57,"end":183.93,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":183.93,"end":189.97,"speaker":"Fr Andrew Stephen Damick","text":"So. All right. Okay. So this first one is from David, who has a question about incense."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":191.73,"end":243.3,"speaker":"Fr Stephen De Young","text":"Father's Bless. I have a question with regards to offering incense. In the Old Testament, Aaron is commanded to offer incense day and night and to have it be a continuous offering. And we still do that in the Orthodox Church by offering incense during matins and vespers. My question is, why are laity allowed to offer incense? The reason why I ask is because there are certain things that priests can do and bishops can do that laity cannot. For example, offering the Eucharist. And if incense is also a form of sacrifice, why are we allowed to do it? Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":244.1,"end":350.99,"speaker":"Fr Andrew Stephen Damick","text":"All right. So, I mean, some people may not know the background to what he's saying, and that is that a lot of lay people at their homes will have, like, incense burners. And I think it's especially very common amongst. In. In the Greek tradition. Like, a lot of people talk about their grandmothers, you know, taking incense all around the house. But it's. But even liturgically, right. Like, it's a. It's not. It's a little bit ambiguous liturgically, where the deacon is usually the one that's bringing the censor out. And even in the. The Latin tradition, it's, you know, acolytes, altar servers who are laymen, who are usually the ones swinging the censer and so forth. But I know that at least in some cases, the censor is brought to the priest or bishop to actually put incense on it before it's offered up that way or, you know, distributed, really. Right. And then even in, like, the. The Byzantine tradition, even though the priest may not necessarily be the one who's putting it on there, at least within the context of the Proskamidi service, he's the one actually saying a blessing over it and saying that it's being offered to God. So it's. I don't know. It's a little. Not quite as obvious exactly how one might think of this. So, I mean, is it the case that a layperson lighting a sensor at home is like making a sacrifice of incense? Is that what's going on there? No, no. So is that unsacrificed incense? I mean."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":351.07,"end":352.23,"speaker":"Fr Stephen De Young","text":"Well, so, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":352.23,"end":355.23,"speaker":"Fr Andrew Stephen Damick","text":"So this is a very common devotional practice."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":355.79,"end":368.35,"speaker":"Fr Stephen De Young","text":"Yeah. Oh, no, by the way, true story. So when I first came into the church. I was flat broke. This was during my Subway sandwich artist period."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":369.55,"end":372.08,"speaker":"Fr Andrew Stephen Damick","text":"I love the fact that they call them sandwich artist."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":372.08,"end":372.48,"speaker":"Jason","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":372.8,"end":390.88,"speaker":"Fr Stephen De Young","text":"Yeah. I took my art very seriously. But so someone gave me some incense, and I, of course, did not own an incense burner. Didn't even own any charcoal or anything. And so ingenuity set in."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":391.2,"end":391.56,"speaker":"Fr Andrew Stephen Damick","text":"Uh."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":391.56,"end":391.92,"speaker":"Brian","text":"Oh."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":392.72,"end":399.28,"speaker":"Fr Stephen De Young","text":"Oh, yeah. So I very thoroughly cleaned out a tuna can and took the label off."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":399.36,"end":400.64,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Are you serious?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":400.84,"end":412.44,"speaker":"Fr Stephen De Young","text":"Yes, I'm dead serious. And I got tongs to hold the metal tuna can with, and I put the incense in it, and then I lit a lighter underneath the tuna can."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":412.52,"end":413,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":414.28,"end":428.21,"speaker":"Fr Stephen De Young","text":"Believe it or not, it works. It burns the incense, but I'm not recommending this process to anyone. Yeah. So that was my incense burner for, like, wow. A while early on today. Crafted."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":428.61,"end":428.97,"speaker":"Bethany","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":428.97,"end":451.09,"speaker":"Fr Andrew Stephen Damick","text":"You know what I think is weird is. And you can get these little, frankly, tchotchkes. They're sold. I know there's places in the Holy Land that make these things, but you can get them in various kinds of religious bookstores and stuff where they'll take pieces of incense and they'll put them inside what is basically like a little reliquary."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":451.57,"end":451.97,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":451.97,"end":461.46,"speaker":"Fr Andrew Stephen Damick","text":"And they'll embed them in crosses and stuff like that. I'm just like, that is not what that is for. You know, like, it's like, somebody take that out and burn it, because that's."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":461.46,"end":462.18,"speaker":"Fr Stephen De Young","text":"But it happens."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":462.18,"end":465.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's weird to venerate incense like that. I don't know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":466.1,"end":493.46,"speaker":"Fr Stephen De Young","text":"Well, so here's the comparison I would make. If you're at home and you're eating that meal may include bread and wine, and you may say a prayer before you all eat it as a family, where you thank God for it. But that's not the Eucharist. Right. Even though Eucharist, Thanksgiving. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":494.18,"end":494.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":495.06,"end":521.79,"speaker":"Fr Stephen De Young","text":"You're thanking God for it. You're eating it together. It's bread and wine. Right. That's the comparison I would make with burning incense at home. It's a pious practice. It's a good thing that you should do, just like, thanking, you know, God for your food and eating it together as a family, but it's not the same thing as the sacramental element that goes on at the church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":521.79,"end":531.79,"speaker":"Fr Andrew Stephen Damick","text":"Would you say that it's still like this? This sense of purification from spirits and that kind of thing? Would you say that it still does that?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":533.64,"end":535.08,"speaker":"Fr Stephen De Young","text":"Not in a magical way."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":535.16,"end":535.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":536.28,"end":545.84,"speaker":"Fr Stephen De Young","text":"Like, this isn't the orthodox version of burning sage or smudging. Yeah, right. Like, not in a magical Way."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":545.84,"end":546.36,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":547.56,"end":550.2,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":550.2,"end":561.96,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. And you know, like, connected with what I said earlier about the deacon taking the incense out. He's not the one actually offering it. Right. He's distributing it just as like."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":562.42,"end":562.66,"speaker":"Sarah","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":562.74,"end":570.02,"speaker":"Fr Andrew Stephen Damick","text":"You know, there might be multiple priests or deacons who serve the Eucharist. They're distributing it. Only one, the Protos, is the one who's offering it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":570.74,"end":571.06,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":571.06,"end":575.62,"speaker":"Fr Andrew Stephen Damick","text":"You know, so. All right. Okay. This next one comes from Luke, who has a question about dreams."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":577.78,"end":647.53,"speaker":"Spencer","text":"Hi, fathers. The episode you guys did on the noose really fascinated me. The thing is, even after listening to the follow up episodes, I still don't fully grasp this principle of how thoughts are received by the noose rather than generated. And if they don't come more directly from angels or demons, I'm especially curious about how this might apply to dreams, which I previously understood to be generated by the unconscious mind and sometimes supernatural in origin. Could you guys flesh this idea out with some examples, especially as it pertains to standard dreams and even how occasionally they might be influenced by spirits, especially in the case of nightmares. And in the phenomenon of lucid dreaming, the state of conscious awareness within a dream. Experienced lucid dreamers can explore dreams and converse with figures or even bodyless voices who sometimes present themselves as guides or guardians when asked questions or even argue that they have their own consciousness, while other figures just reply with gibberish or nothing. Do you guys think these figures are mostly demonic or just sometimes, to restate my question is about dreams and the noose and related to that, spiritual influences on dreams. Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":648.41,"end":688.9,"speaker":"Fr Andrew Stephen Damick","text":"This is an interesting question. I mean, we've, we've gotten. Every discussion that we have where we talk about thoughts and thoughts being received rather than generated always creates this flurry of questions. This is probably the most interesting one, I think. And we haven't really ever talked about dreams very much. We've, you know, we've talked about dreams but never really focused on it. So I mean, I think it's a good question because like, I mean, most of the time I do not remember my dreams at all, but sometimes I wake up and do remember them and sometimes they're just complete nonsense. In fact, most of the time they're complete nonsense."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":689.7,"end":692.58,"speaker":"Fr Stephen De Young","text":"You just give up on your dreams a long time ago. Father Andy."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":697.3,"end":730.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, although, fun etymological moment. Dreamus, you know, it actually refers to, to joys, interestingly enough. I don't, I don't know exactly how that word shifted to mean dream. Like we mean it now, but yeah, so like it's Easy enough, I guess, to say about a prophetic dream that it's, you know, message from the outside, but what about the rest? And I don't even know what to think about lucid dreaming. What do you think?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":732.36,"end":762.83,"speaker":"Fr Stephen De Young","text":"So, yeah, first I would say dreams are the activity of the noose. Right. But the activity of the noose includes the consideration of thoughts. Right. Once they enter, like when we talk about discerning between thoughts and focusing on thoughts. Right. All of that is included. Right. So, yeah, a lot of dreams just are nonsense because a lot of our thought life is nonsense."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":763.07,"end":773.95,"speaker":"Fr Andrew Stephen Damick","text":"So maybe. Yeah, yeah. I mean, maybe this will be the point to distinguish between thoughts and thinking, perhaps. Does that make sense? You know, you know what I'm saying?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":774.03,"end":776.47,"speaker":"Fr Stephen De Young","text":"Like, there's thoughts and attention, maybe."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":776.47,"end":782.92,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Because I mean, I think we. We, like I just used the word, the phrase I think. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":783.48,"end":783.96,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":784.28,"end":805.58,"speaker":"Fr Andrew Stephen Damick","text":"We use that word to mean a variety of you exist. That. That may. That could be distinguishable. Right. Like I'm. I'm looking, for instance, at the little dorm fridge that's in my studio right now. And that's a thought that's coming through my eyes. And, you know, but then I think about what's in it. And like, you know, like, those are not necessarily the same. The same thing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":806.14,"end":824.46,"speaker":"Fr Stephen De Young","text":"Right, Right. Well, I think the idea of focus, like again, if we compare noose to vision. Right. Which is the most common comparison, the eye of the heart. So you compare it to vision. You're constantly taking in a vast amount of data through your vision."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":824.54,"end":826.22,"speaker":"Fr Andrew Stephen Damick","text":"Sure. And most of it you just ignore."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":826.86,"end":857.33,"speaker":"Fr Stephen De Young","text":"Yeah. And you're ignoring almost. There's like, this is the whole. Heidegger talks about using terms of figure and ground. Right. Where there's something that's a figure that you're focused on that you're aware of. And then everything else is just sort of ground, like the background. Right. That most of it, you just. You can't focus on everything all the time. You literally can't. Right. And so if we think that way about thoughts. Right. You can understand. You could have a jumble of thoughts in your head."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":858.37,"end":859.13,"speaker":"Fr Andrew Stephen Damick","text":"I often do."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":859.13,"end":884.73,"speaker":"Fr Stephen De Young","text":"Right. But you learn how to hopefully focus on certain ones, reject certain ones. Just like there are certain things, when you become aware of them in your vision, you look away. Right. You choose not to look at them and focus on them. Right. But it may be within your field of vision for a while before you realize what it is and turn away. Right. Same kind of thing can happen with thoughts."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":885.46,"end":885.7,"speaker":"Spencer","text":"So."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":889.06,"end":912.19,"speaker":"Fr Stephen De Young","text":"While you're asleep, you have the Same jumble of thoughts. Right. And that leads into basically what lucid dreaming is. And it's something I do on occasion, not on purpose. Like I don't use some technique or something. I'm not like a New age thing. Like, I just become aware that I'm dreaming sometimes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":912.19,"end":912.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":914.39,"end":989.93,"speaker":"Fr Stephen De Young","text":"Basically all that is is extending that focus into when you're dreaming. Right. In that you have some control over what you focus on while you're dreaming, instead of it just being sort of a kaleidoscope of whatever, experiencing something. So, yeah. And you can ask my wife about this. It has caused weird experiences for her. Like, oh, we should get her. Oh, yeah, no, like me in the middle of the night, just like saying her name repeatedly. And then she'll like, wake me up and I'll be. At night, I'll be like, o, thanks. I was having a dream that something was eating my fingers, but I realized I was dreaming, so I decided to get you to wake me up. Right. Like, my wife lives with an insane person. You should all realize this. So, yeah, and sometimes I wake myself up, you know, like. Yeah, so, yeah, and, and, but so within that, there are. There are people who. And that's some of what the caller is referring to. There are people who engage in meditative practices that are designed to let you sort of maintain that ability to focus while you dream. But like lucid dream on purpose."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":989.93,"end":990.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":992.89,"end":1018.98,"speaker":"Fr Stephen De Young","text":"And that basically become. That falls into the category of some of the things we've talked about with psychedelic use and that kind of thing about using techniques and techne in the broad sense to sort of enter into the spiritual world sort of deliberately. So I would say mostly demonic in terms of those people you run into lucid dreaming who want to communicate things to you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1020.26,"end":1020.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1021.3,"end":1030.67,"speaker":"Fr Stephen De Young","text":"Same way the machine elves are demons. But yeah, so that's what I'd say about that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1030.83,"end":1035.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right, this next one comes from Bethany, who has questions about God's glory."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1036.99,"end":1126.59,"speaker":"Bethany","text":"Hi, Podfathers, my name is Bethany and I have a question about glorifying God. In my prior to orthodox Christianity religious experience, God's glory was the highest end of all things. It was explained to me as the chief reason why God did and does anything. I previously understood glorifying God to be something akin to making him famous. I was taught that this was my purpose in life and why God made me to glorify God even in suffering, because he wanted humans who freely chose to boast about and praise him without being directly forced to. Apparently forced praise didn't mean as much to God as having people praise him who could choose otherwise if they wanted to. I'm sort of having a shift in my understanding of things while also holding space for the reality of God being glorified. I understand this is something good, but it is also difficult to sort out when God has been painted as having the desire for glory in a very narcissistic sense. When reading Greek mythology, for example, the myth of echo and narcissus all too eerily resembles what I was taught about God and how I should relate to him. I do not experience God as narcissistic. However, I occasionally read orthodox theologians pointing to God's glory as the chief end of all things. For example, one author states, Christian marriage does not exist for the benefit of the two people in the marriage. It is for the benefit of the world that God would be glorified. And so I am a bit confused, especially when God self describes as meek and motivated by. Motivated by self sacrificing love. I guess I'm asking if the podfathers could disambiguate what the orthodox Church means by glorifying God. Does God really have a glory complex? And is all of this, the angelic powers, saints, human experience, all for the sake of boosting God's ego?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1127.55,"end":1134.43,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, I feel like she's got a little bit of a. Isn't that the Westminster Confession hangover there?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1134.59,"end":1135.71,"speaker":"Fr Stephen De Young","text":"The chief end of man."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1135.95,"end":1137.79,"speaker":"Fr Andrew Stephen Damick","text":"Glorify God. Glorify God. I enjoy him forever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1137.79,"end":1138.59,"speaker":"Fr Stephen De Young","text":"Enjoy him forever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1140.44,"end":1165.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, actually I. So I looked up what. Who she might be quoting when she said about an orthodox author and I. And it's. It seems that it is. Father Alexander Schmeman said that it's, you know, Christian marriage does not exist for the benefit of the two people in the marriage. It is for the benefit of the world that God would be glorified. I don't know what that's from, but I'd see that it's quoted all the time on the Internet."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1166.56,"end":1167.44,"speaker":"Fr Stephen De Young","text":"Nobody bats a thousand."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1167.76,"end":1173.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I, yeah, right. Like, I disagree with that. I mean, with all respect to the."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1173.6,"end":1181,"speaker":"Fr Stephen De Young","text":"Late Father Alexander, that is out of context too. So. Yeah, like the rest of the context of the paragraph might clarify that more."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1181,"end":1182.92,"speaker":"Fr Andrew Stephen Damick","text":"Apparently it's from for the world, not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1182.92,"end":1188.16,"speaker":"Fr Stephen De Young","text":"Only for the benefit of the couple, for example, you know, that kind of thing. But."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1188.24,"end":1243.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. It's interesting actually, you know, now looking at this, this might not actually be a quote from him in particular, but anyway, I think, I mean, it's from his book for the Life of the World, which Is all about everything being. It's been a while since I read it, but it's about everything being oriented towards God. Right. That the. The creation shows itself to be what it truly is supposed to be when it's oriented towards God. I would definitely not say that it's not for the benefit of the people in the marriage because it's for their salvation. I mean, that's. That's what it is, right? Yeah. Yeah. Actually, this looks like it might be someone's commentary on what Schmeman said. I should have looked this up more beforehand. I know, I know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1245.61,"end":1249.57,"speaker":"Fr Stephen De Young","text":"But yeah, I mean, here, read a couple Wikipedia articles. Act like you're."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1249.57,"end":1256.33,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. I'm just a slap dash dilettante."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1257.21,"end":1262.81,"speaker":"Fr Stephen De Young","text":"I, on the other hand, did absolutely no research. I just showed up cold. I didn't even look at what the questions were going to be about."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1262.89,"end":1263.69,"speaker":"Fr Andrew Stephen Damick","text":"From the hip."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1264.09,"end":1264.57,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1264.65,"end":1293.83,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that. Well, that's too bad, because there's one question, and I hope that you had looked it up, but maybe you just know it off the top of your head. I can't. Sure. When we get to that one. Actually, it's toward the end. Yeah. Yeah. I mean, I think so. I think that a lot of the problem here, Bethany, is this idea of glory being about, as you said, making God famous, which I've heard that a lot, particularly in kind of pop evangelical circles. We're going to make God famous. I'm just like, what?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1294.47,"end":1297.27,"speaker":"Fr Stephen De Young","text":"It's the young guns theory of religion."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1298.07,"end":1304.43,"speaker":"Fr Andrew Stephen Damick","text":"What? What make him famous? Like fame. That's, that's. It's."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1304.43,"end":1305.83,"speaker":"Fr Stephen De Young","text":"He's already gonna live forever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1307.27,"end":1307.71,"speaker":"Jason","text":"Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1307.71,"end":1308.79,"speaker":"Fr Stephen De Young","text":"He already knows how to fly."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1309.11,"end":1366.49,"speaker":"Fr Andrew Stephen Damick","text":"Nice. See, I caught that reference that was watched many times in my house when I was young. Yeah. I mean, glory is okay. Yes. So glory does have this sense of fame, right. It's reputation, opinion, the things that are said about someone or something like that. That's doxa, is all of that. But in orthodox theology, glory is much more of a fulsome idea. Right. It's like the glory of God is actually transformative of people who participate. People and beings who participate in it. So that means it's not just God being famous. Right. Would it be correct to say that the glory of God is his energies or one of his energies or something like that? Well, I don't know. I'm asking the question."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1367.21,"end":1375.21,"speaker":"Fr Stephen De Young","text":"Yeah, here's part of the issue. Part of the issue is doxa in Greek is used to translate two very different Hebrew concepts."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1375.37,"end":1377.13,"speaker":"Fr Andrew Stephen Damick","text":"Okay, tell us about the Hebrew concepts."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1378.57,"end":1385.78,"speaker":"Fr Stephen De Young","text":"Because it's used to translate both the Hebrew word chavod and the Hebrew word shekinah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1385.78,"end":1388.94,"speaker":"Fr Andrew Stephen Damick","text":"Oh, the Shekinah glory God. Shekinah. Shekinah glory God."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1389.34,"end":1392.26,"speaker":"Fr Stephen De Young","text":"Yeah. If you're from the south, when Baptist."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1392.26,"end":1395.5,"speaker":"Fr Andrew Stephen Damick","text":"Preachers learn a Hebrew word, like, all their sermons become about that thing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1395.74,"end":1396.22,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1397.18,"end":1399.7,"speaker":"Fr Andrew Stephen Damick","text":"I mean, Orthodox people do it with Greek words, too."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1399.7,"end":1403.82,"speaker":"Fr Stephen De Young","text":"Orthodox priests, yeah. And chavod literally means."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1403.82,"end":1406.22,"speaker":"Fr Andrew Stephen Damick","text":"Wait, okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1407.35,"end":1440.64,"speaker":"Fr Stephen De Young","text":"And is used in Hebrew to mean something like substance, like heaviness, like. Right. Like. So when in Exodus 33, when Moses asks to see God, what he actually has to see is his chavod. Right. And if you just translate it as, oh, he wants to see God's glory, well, that doesn't make a lot of sense that he can't see that and live. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1440.88,"end":1441.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1444.4,"end":1530.25,"speaker":"Fr Stephen De Young","text":"But this kavod idea and Shekinah is very much something that is revealed to people all the time. That's like the glory cloud that descended on the tabernacle. Right. That was seen. Right. The cloud that followed the fiery cloud that led Israel in the wilderness. So both of those just get translated by doxa in Greek. And so based on context, like in the New Testament and in the Fathers, you have to kind of figure out which of those ideas is being referred to. So something like what you're getting at, if it's referring to more of the chavot idea, then yeah, it's more like that. Right. Although tending more towards essence than energies, actually. Whereas something like Shikina has more to do with that idea of doxa as appearance. That might be more related to God's energies, actually. And I think that gets at the crux of giving God glory in our modern terms. Right. Is more like the idea of giving him credit."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1531.85,"end":1534.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1534.25,"end":1542.81,"speaker":"Fr Stephen De Young","text":"As in, you know, and that's why St. John Chrysostom famously, glory to God for all things. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1543.1,"end":1543.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1545.5,"end":1573.13,"speaker":"Fr Stephen De Young","text":"The idea is. And God saying, I will not share my glory with another, it's not an idea of his ego. It's an idea of God gives us blessings. And the biggest problem with idolatry among the nations is that it begins with them giving credit to these other spirits for the blessings that God gives."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1573.21,"end":1575.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1575.57,"end":1657.92,"speaker":"Fr Stephen De Young","text":"Of attributing these things to someone other than God. And so. Right. And this is. I think we talked about this a little bit when we were Talking about how St. Paul makes the analogy of covetousness to idolatry, like greed to idolatry. Right. Because greed trying to accumulate wealth and possessions can be a way of giving credit to ourselves. And Our own ingenuity and hard work, etc. For what God has given us and trust, and then from there, trusting in those instead of God. So, yeah, it's more a question of not trying to take credit for God's blessings. Ourselves would be the more common temptation today. Right. Most people listening to this are not tempted to give credit to Zeus for the rains coming to their season. But we may be tempted to say that our health, wealth slash prosperity slash whatever. Whatever good things we have in our life are our own doing because we were smart and wise and made good choices."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1657.92,"end":1658.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1658.96,"end":1666.8,"speaker":"Fr Stephen De Young","text":"And it doesn't have anything to do with God, which would be glorifying ourselves. Right. Taking for ourselves the glory that belongs to God."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1667.52,"end":1696.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I decided, while I was listening to you, I decided to try to hunt down that quote a little bit better. And it is not only. Not only is it not actually from Father Alexander Schmemann, not only is it from someone commenting on misreading what Father Alexander Schmemann wrote in for the Life of the World, it's actually a pastor who's not even an orthodox Christian making that comment about."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1697.15,"end":1697.55,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1697.55,"end":1716.01,"speaker":"Fr Andrew Stephen Damick","text":"So now, Bethany didn't know this. She. Because I found a number of places that said this was just. They just made it a quote out from Father Alexander. Right. You know, but it's not from him. He did not say that. He did not say that. It's not for the benefit of the two people in the marriage that, you know, that it's for God's glory. No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1716.01,"end":1719.25,"speaker":"Fr Stephen De Young","text":"Because how the turntables have turned."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1719.25,"end":1744.05,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. God's glory does benefit the people in the marriage. I mean, everything we do is for our, you know, everything we do in the church. Everything that God does for us is for our salvation. It's not this separate thing. So, yeah, I think there's a little bit of this Calvinist hangover. I don't. I haven't. I haven't done a lot of looking up on this guy who wrote this thing about what he was reading in Schmeman, but he's not even orthodox, so."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1744.13,"end":1754.09,"speaker":"Fr Stephen De Young","text":"Well, and that it's. Calvinism takes that to a super, super problematic place."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1754.09,"end":1760.05,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which I think is why Bethany says she feels like it's this narcissistic image of God."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1760.76,"end":1776.76,"speaker":"Fr Stephen De Young","text":"Literally. Literally. Calvinism teaches that if one of your kids is a reprobate, you will spend eternity glorifying God for how wise and wonderful he is, that he created your child to punish him in hell for eternity."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1776.76,"end":1778.76,"speaker":"Fr Andrew Stephen Damick","text":"Right. That is perverse."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1778.76,"end":1779.88,"speaker":"Fr Stephen De Young","text":"That's dysfunctional."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1780.76,"end":1781.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1782.12,"end":1785.88,"speaker":"Fr Stephen De Young","text":"But that's dysfunctional. A lot of Calvinists get mad when you bring that up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1785.96,"end":1786.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1786.32,"end":1789.44,"speaker":"Fr Stephen De Young","text":"I mean, again, some of them will just double down and be like, yep."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1789.44,"end":1791.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the system requires it. The system requires it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1791.92,"end":1792.32,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1792.56,"end":1809.2,"speaker":"Fr Andrew Stephen Damick","text":"When. When the aim is. Is that idea of God's glory and everything is just simply subjected to it, then it's. It's become. It's not really even theology anymore, it's ideology. Because ideology is always willing to destroy anyone in its path to serve the idea."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1809.92,"end":1823.5,"speaker":"Fr Stephen De Young","text":"Right, right. And so spirituality becomes essentially stoicism in the face of. Yeah, God's. In the face of God's will, which is why Dutch people are as messed up as we are."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1825.02,"end":1825.82,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1827.74,"end":1833.42,"speaker":"Fr Stephen De Young","text":"This is why your Dutch dad didn't tell you he loved you enough. Anybody listening? Who had one?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1833.58,"end":1847.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah, God does love us. He really does. Okay, so the next one comes from Brian, who has a question about what do the Orthodox think of Roman Catholic Marian apparitions?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1850.04,"end":1935.4,"speaker":"Brian","text":"Hello, Fathers, this is Brian from Pittsburgh. And my question is inspired by the episode on Assumptions and Ascensions and also by a comment made by Richard Rowland on another podcast, who it's about the Theotokos and Marian apparitions in the Roman Catholic tradition. I reason, I ask this is because Father Stephen said in that episode on Assumptions and Ascensions that he made the comment that since Mary is assumed body and soul, she can make appearances still, but then didn't go deeper into that. And so I guess one, I was wondering, as a Roman Catholic myself, I'm not familiar, are there Marian apparitions like the ones in Catholic tradition? In the Orthodox tradition or not? But also, the main part of my question is actually, what is the Orthodox Church's take on the Catholic Marian apparitions? And the reason I ask that is because Richard Rowland had made the comment that in Texas, where he's from, a lot of Orthodox churches do venerate icons of the Blessed Mother under the title of Our lady of Guadalupe, which is decidedly a Catholic apparition. So I was just curious what the Orthodox Church's take is on Catholic Marian apparitions. If it's like a case by case basis or if it's based more on popular piety, you know, or is it just kind of up to the individual faithful person? Yeah, I just interested to know. Thanks."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1935.88,"end":1969.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, the thought that I had while I was listening to this is Muslim apparitions of the Virgin Mary, by which I mean, like, Muslims who are seeing the Virgin Mary. Right. Like he said, our lady of Guadalupe is a Catholic apparition. It's like. But I don't know what about that is Catholic, other than the fact that it's venerated by Catholics and celebrated by Catholics. Did the Virgin Mary appear and say, you have to believe in papal supremacy and infallibility. And if you have the temerity."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1970.09,"end":1971.13,"speaker":"Fr Stephen De Young","text":"Not at that one."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1972.41,"end":1975.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. There are some where. Apparently she does say she showed up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1975.09,"end":1988.17,"speaker":"Fr Stephen De Young","text":"In Lourdes and said, I am the Immaculate Conception. So. But yeah, now. So now Rodan is over there defending Mexican Roman Catholicism. Is that what's going on?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1988.33,"end":1989.73,"speaker":"Fr Andrew Stephen Damick","text":"Well, okay, so it is the case."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1989.73,"end":1992.97,"speaker":"Fr Stephen De Young","text":"Roman Catholics don't defend Mexican Roman Catholicism."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1995.13,"end":1996.49,"speaker":"Fr Andrew Stephen Damick","text":"It is the case, though."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1996.57,"end":1999.69,"speaker":"Fr Stephen De Young","text":"They just say, we don't talk about Mexico. When you bring it up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":1999.85,"end":2085.49,"speaker":"Fr Andrew Stephen Damick","text":"It is the case. I will say this, and this actually is a statement of affection and admiration. Is that in terms of religious kitsch? Mexican Catholics, I think, are the experts. And I love religious kitsch. I love it. I really do. But. Okay, so if you go to. I mean, set Texas aside, if you go to Orthodox churches in Mexico, there are ones that have icons of Our lady of Guadalupe that they will venerate in church and even include. I think I've seen photos of ones painted on the walls, you know, and it's clearly that image. But I mean, what is that image? Right. It's. That's basically the Virgin Mary as the image of. Is it Revelation 12. Right. With the, you know, the moon beneath her feet, clothed in the sun, a crown of 12 stars. I mean, this is like Our lady of the Gate of Dawn in Vilnius. It's the same. The same kind of thing. And. Which is definitely an icon that actually has an Orthodox feast day. So I don't know. I mean, like, I think unless. Unless the. Unless, you know, an apparition, an appearance, a manifestation. Right. Is. Is like preaching a dogma. It's hard for me to say, oh, it belongs to this one group or whatever. Yeah. I mean, you're right about that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2085.49,"end":2086.97,"speaker":"Fr Stephen De Young","text":"I mean, it happens in a context."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2086.97,"end":2106.45,"speaker":"Fr Andrew Stephen Damick","text":"Immaculate Conception. Yeah. Right. And there's people there who are recording it and describing it and experiencing it and, you know, telling the story and all that kind of stuff. And I mean, the Orthodox Church has no problem with taking stuff that is outside of the canonical boundaries and bringing it in. There is an adaptation that goes along with it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2107.33,"end":2111.33,"speaker":"Fr Stephen De Young","text":"Right. But, yeah, there's a. There's a difference between having a certain style icon."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2112.01,"end":2112.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2112.97,"end":2120.81,"speaker":"Fr Stephen De Young","text":"Of the Theotokos, you know, and all the complications related to that in Revelation 12, which we won't go into now because it's a rabbit trail."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2120.97,"end":2122.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2122.65,"end":2135.77,"speaker":"Fr Stephen De Young","text":"And celebrating the historic interest, the historic event of her supposedly flying past a certain Mexican peasant."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2136.25,"end":2136.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2136.85,"end":2138.61,"speaker":"Fr Stephen De Young","text":"I don't think those are two different things."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2138.61,"end":2147.4,"speaker":"Fr Andrew Stephen Damick","text":"I don't think the Orthodox are celebrating a feast day. I. I don't know. I don't think they are. I do know. I mean, I do know. I know I tend to bring it up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2147.4,"end":2149.76,"speaker":"Fr Stephen De Young","text":"I mean, I'm not their bishop, so I mean, that's not my call."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2149.76,"end":2163.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. I do know. For instance, there is. There was a Catholic feast day in Lithuania of a particular icon, the Our lady of Pajislas."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2163.72,"end":2163.88,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2163.88,"end":2189.79,"speaker":"Fr Andrew Stephen Damick","text":"Which is the. Called the. In Russians called the Pozeskaya icon, where they literally just took the Catholic feast day and absorbed it for the monastery that frankly, it was a Catholic monastery that was taken by the Russian Empire and given to Orthodox monks. And they kept the feast day. Like the feast day is still on the Russian Orthodox calendar and they're keeping the old calendar version of the feast day, even while the Catholics. Yeah, that is a thing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2191.71,"end":2192.91,"speaker":"Fr Stephen De Young","text":"That's not a historical."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2193.31,"end":2199.47,"speaker":"Fr Andrew Stephen Damick","text":"No, it was an adoption of a pilgrimage day, you know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2199.63,"end":2231.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so, I mean, you're right in that it's less problematic than the ones. And I know people got mad at me when I referred to this in a previous episode about the Roman Catholic Eucharistic miracles, but I'm sorry, it is super sus if there's like a doctrinal point under debate and someone shows up and they have a miracle or an apparition that just happens to confirm one side of that debate. Like it's a little convenient. Right. Like, I can hear all the people."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2231.11,"end":2235.31,"speaker":"Fr Andrew Stephen Damick","text":"Complaining about Chalcedon right now, based on what you just said with St. Euphemia."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2236.43,"end":2239.23,"speaker":"Fr Stephen De Young","text":"Right. Because it was totally going to go the other way otherwise."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2240.83,"end":2256.13,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Although I'm told, I'm told as long as we're keeping a little spicy, I am told that our Coptic friends basically say that that story is. Is completely made up. I don't know if that they. I don't know that they say that, but I'm told that they say that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2256.85,"end":2260.41,"speaker":"Fr Stephen De Young","text":"But let's say that story never happened. Do you think it would have turned out differently?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2260.41,"end":2261.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't think so."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2261.57,"end":2282.87,"speaker":"Fr Stephen De Young","text":"I don't think exactly. Right. Like, so that's not really the Right. But I mean, you know, there's this starting point of contention all of a sudden. Now, I suppose a Roman Catholic verse could be like, no, that's how God works. When there's Something important under contention he sends a miracle to confirm one side or the other. Like, okay, I mean, you know, you could make that counterargument."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2282.87,"end":2284.23,"speaker":"Fr Andrew Stephen Damick","text":"Why have counsel?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2284.31,"end":2286.55,"speaker":"Fr Stephen De Young","text":"There's a lot of other points under. Yeah, why?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2286.55,"end":2287.55,"speaker":"Fr Andrew Stephen Damick","text":"Why? Yeah, why?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2287.55,"end":2289.19,"speaker":"Fr Stephen De Young","text":"How about the Trinity? You know, like."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2289.19,"end":2291.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2292.39,"end":2295.03,"speaker":"Fr Stephen De Young","text":"I guess they could point and say spirit on in the brick. I don't know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2295.03,"end":2310.56,"speaker":"Fr Andrew Stephen Damick","text":"But well, and you know, the truth is that, you know, there are recorded miracles and decidedly. Like, like we don't have to make it between, you know, within, you know, Christian debates. There are miracles happening in non Christian contexts."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2311.92,"end":2312.72,"speaker":"Fr Stephen De Young","text":"Oh, yeah. No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2313.04,"end":2314.16,"speaker":"Fr Andrew Stephen Damick","text":"What does that prove?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2314.96,"end":2329.52,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yeah. Well, that's the other piece. That's the other piece that I was going to get to is that biblically you don't base things on signs because we know there are false signs and wonders."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2329.6,"end":2331.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, totally a thing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2331.84,"end":2344.91,"speaker":"Fr Stephen De Young","text":"Right. And things and false doesn't always mean demonic. I'm not saying that Our Lady Guadalupe was a demonic apparition per se. Right. Or Our lady of Lourdes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2345.47,"end":2357.87,"speaker":"Fr Andrew Stephen Damick","text":"I mean, could the Theotokos appear to someone outside the Orthodox Church for the benefit of those people in that time and place? Absolutely. Why not? Why not? You know, why not?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2358.03,"end":2360.27,"speaker":"Fr Stephen De Young","text":"Could they misinterpret it? Yes, yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2361.4,"end":2361.88,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2363.24,"end":2364.12,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2364.2,"end":2366.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2366.68,"end":2388.55,"speaker":"Fr Stephen De Young","text":"So, yeah, lots of things could happen. But so. Right. So I would say to hone in on the answer to the question, I would say the Orthodox Church can be open to the idea that these things happen. Right. But that, that does not in any way confirm the interpretation of them."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2388.71,"end":2389.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2390.31,"end":2445.94,"speaker":"Fr Stephen De Young","text":"In the context in which they happen. Right. Like, I think this is stretching it, but I mean, if someone really wanted to be an ecumenist pan heretic, Right. They could, you know, be like, okay, well, maybe something non demonic. Right. Something holy happened at Fatima. This is a stretch. Right. But because much of the prophecies are false. But now I got Roman. Now I've lost all our Roman Catholic listeners. They're gone. But I'm sorry, Russia mass converting to Roman Catholicism hasn't happened and it's not going to happen anytime soon. That's a false prophecy. Okay, that's it. Disqualified. I'm not going to be easier on Roman Catholic apparitions than I am on Protestants when they make false prophecies. I'm going to be consistent. You make a prophecy, it doesn't come true. You get stoned to death. First one."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2445.94,"end":2446.9,"speaker":"Fr Andrew Stephen Damick","text":"That's what the Bible says."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2447.3,"end":2456.74,"speaker":"Fr Stephen De Young","text":"Yes. So I'm not going to stone anybody either. But I'm just saying you're Done. You're done with the prophesying when you get one wrong. Right. Time for a new career."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2457.22,"end":2458.9,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, since we're."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2458.9,"end":2478.91,"speaker":"Fr Stephen De Young","text":"Anyway, we could be open to them happening, but we wouldn't embrace that for us. Doesn't mean the secrets of Fatima and the prophecies are true, even if we. Well, okay, someone had a spiritual experience there, and this is the danger of. This is the danger of people publicizing their personal spiritual experience."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2479.07,"end":2481.39,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2481.47,"end":2481.87,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2481.87,"end":2483.59,"speaker":"Fr Andrew Stephen Damick","text":"Turning it into something you're not going."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2483.59,"end":2495.67,"speaker":"Fr Stephen De Young","text":"To see in the Orthodox Church is a ton of people making a pilgrimage to a glass building in Florida where the glass got warped and it kind of looks like the outline of the Virgin Mary."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2495.67,"end":2542.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One thing that a lot of people, a lot of Orthodox Christians from the west, when they travel to countries that are traditionally Orthodox, that they find, which is kind of like a surprise, is they'll be in some place, whatever, and then they'll be told, oh, by the way, this miracle happened right over. Right over there on that corner or right. You know, whatever. And they'd be like, why haven't I heard of this? Well, because that's not. That's not the way it's done. You know, it's just not. Orthodox culture is to turn everything into a spectacle. You know, it's just like, well, God loves us. Of course he does these things, you know. All right, since we're being. Since we're, you know, starting to put some spice on Orthodox and Roman Catholic relationships."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2542.1,"end":2543.62,"speaker":"Fr Stephen De Young","text":"Alienating our Roman Catholic."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2543.62,"end":2543.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2543.9,"end":2544.1,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2544.1,"end":2547.02,"speaker":"Fr Andrew Stephen Damick","text":"So Dennis has a question about why exactly are we still apart?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2549.34,"end":2588.64,"speaker":"Spencer","text":"Greetings, Fathers Blessed. My name is Dennis from Texas. I've listened to every Lord of Spirits podcast and have found your content immensely enriching to the practice of my faith as a Roman Catholic. This constantly raises for me a why are the Catholic and Orthodox churches not yet in full communion? This great schism seems to be one of the church's biggest scandals, not unlike the splitting of Israel into the northern and southern kingdoms. In your opinion, what are the biggest obstacles to the restoration of full communion between the Orthodox and Catholic churches? What would reunification look like, and how can we work toward it? Thank you for all you do."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2589.04,"end":2592.68,"speaker":"Fr Andrew Stephen Damick","text":"All right, so your boy Frank needs."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2592.68,"end":2594.96,"speaker":"Fr Stephen De Young","text":"To humble himself and be willing to work as part of a team."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2594.96,"end":2666.1,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Exactly. Yeah. I mean, since he asked for our opinion, I mean, number one, there are. There are big dogmatic problems. Okay? And I know that Vatican II developed the ideas of papal supremacy and infallibility, but the reality is that Vatican I still says that if you reject papal supremacy and papal infallibility, then, you know, then you are anathema. Like it says that. It says that explicitly in the Council of Vatican I. Vatican II does not say, oh, by the way, we're, you know, repealing those provisions. It doesn't do that. It just sort of develops the ideas a little bit, but still not in a way that's acceptable to the Orthodox. And so that means that the Orthodox Church still rejects, I personally reject those things that are in Vatican one about that. Which means I have the temerity. I love the fact that they use the word temerity, which means I'm officially under the anathema of the Roman Catholic Church. You know, like it's, it's simply the case."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2666.1,"end":2666.81,"speaker":"Fr Stephen De Young","text":"Congratulations."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2667.04,"end":2674.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, thanks. I'm okay with that. Because what does anathema means? It means you're not in our, you're not in our group. I mean. Yes, that's correct."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2674.76,"end":2676.64,"speaker":"Fr Stephen De Young","text":"Means you're mean. You're mean and exclusive."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2676.64,"end":2678.08,"speaker":"Fr Andrew Stephen Damick","text":"I'm not, I'm not in your group."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2678.56,"end":2680.96,"speaker":"Fr Stephen De Young","text":"That's what Protestant apologists told me. Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2681.28,"end":2700.97,"speaker":"Fr Andrew Stephen Damick","text":"So, I mean, that's the first thing that I would say. But, but there is, I believe, a more visceral level. And it's not just some of the shenanigans we've seen in the last few years about same sex blessings. Yes, I know there's all kinds of ways people are trying to talk about that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2701.53,"end":2703.61,"speaker":"Fr Stephen De Young","text":"There are definitely shenanigans at foot."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2703.85,"end":2819.71,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. And it's not even just the stuff that's under the current papacy or whatever. There is, frankly, the most important thing that Christians do is worship God. That is the most important thing that Christians do is worship God. And there has come to be so much about the way that Roman Catholicism worships God that has become alien to the average Orthodox Christian. Like not even the ones who could talk about dogmatic issues. They look at stuff and they say, that is not my church. I'm not part of that. I can't be part of that. Right. And I know, I know there's probably some of our Catholic friends right now that are saying, well, what about Eastern Catholics? It is true that a significant number of Eastern Catholics have a form of worship that is quite recognizable to the Orthodox, though not all, not all. But to that I say with the utmost love and respect and admiration for the piety of those people. That is 1.5% of the population of the Catholic Church. So even. Yes, it's millions. It's millions of Eastern Catholics. But when you're talking Orthodox, Catholic, Eucharistic, Communion, union, whatever, reunion, reunification, whatever term you want to use. You can't say, well, you know, this shows this. Like, no, I'm sorry. Yes, it's. It's a consideration, but it is a very small consideration because you've got the 98.5% that are doing something that is not recognizable. And I don't just mean because it's, you know, Latin liturgics. No, it's. It's changed, you guys."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2819.71,"end":2822.55,"speaker":"Fr Stephen De Young","text":"I mean, y' all know, getting rid of Latin liturgic."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2822.55,"end":2825.15,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Y' all know. I mean, frankly, this is part of."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2825.15,"end":2827.67,"speaker":"Fr Stephen De Young","text":"The history actively in my area."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2827.91,"end":2913.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And you live in a Catholic region. Right. Like, you know, literally, when the Mass was being reformed, the committee that put it together included Protestants on the committee. Modern Roman Catholic worship was shaped not entirely by, but with definite strong input from Protestants. And there were Catholic cardinals at the time who said, the stuff we're doing right now is going to alienate the Orthodox. What do you know? Here we are. So I think that there's, to quote a 90s, I can't remember exactly. It was given at Georgetown University, now that I recall, speech by the Ecumenical Patriarch Bartholomew I. Constantinople. He said that we've come to do Christianity in ways that are ontologically different. And I think that's true. Like, and it's, again, you got to have somewhere where you live and worship is the most important thing that Christians do. You can't say. It's just, well, you know, there's different tastes. That is a very Protestant thing to say and a certain kind of Protestant thing to say. Not all Protestants, even. So, I mean, that's why. Because there's a sort of visceral sense of, that's not us, that's not us. There are big dogmatic questions, and the papal dogmas are top among them. Although there are other issues, too. But. Yeah, so that's my little rant about all that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2914.91,"end":2932.55,"speaker":"Fr Stephen De Young","text":"Well, yeah, I mean, I essentially agree in that I've said for a long time now, the biggest obstacle to us ever unifying is not anything up at the top. It's what goes on in typical, average Roman Catholic parishes right across the country. That's the big obstacle."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2932.55,"end":2938.02,"speaker":"Fr Andrew Stephen Damick","text":"It's not just bishops arguing with each other. It's not. It's the stuff on the ground."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2939.06,"end":2994.3,"speaker":"Fr Stephen De Young","text":"And I know, I understand to the traditional Roman Catholics, and I think Roman Catholics who listen to this show are probably on the more traditional end. Right. And I know they don't identify with a Lot of this stuff. And I know they want to not think about this stuff, and I know they want to downplay this stuff, but this is the state of affairs, and it's not moving in your direction, Guys. I mean, I'm. I'm not that far from Tyler, Texas. The whole Bishop Strickland thing. Right. I used to live in Longview, Texas, which was part of that diocese. Okay. Like, this is not far away from me. Like, there's an active effort. Okay? Anybody who's traditional and conservative in American Roman Catholicism is considered to have schismatic tendencies and is targeted right now."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2994.3,"end":2994.9,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2995.22,"end":2997.02,"speaker":"Fr Stephen De Young","text":"By the Roman Catholic hierarchy."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2997.02,"end":2997.46,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":2997.46,"end":3071.72,"speaker":"Fr Stephen De Young","text":"Okay. So it is. It is not moving back in the other direction, despite the fact that a lot of young Roman Catholics, like most young people in general, want more traditional Roman Catholic worship. I understand that. Okay? But your hierarchy doesn't understand that. Or at least they don't want to give it to you. Okay? And I mean, just on a local level, and I know anecdotal evidence. Right? But I am in a 70% Roman Catholic city, Okay? I live across a cemetery from the headquarters of the Archdiocese of Lafayette. So we're right in the middle of this, Right? Heavily Roman Catholic. Right. And Louisiana, Southern Louisiana is as red state as you can get, okay? Like, there's not a bunch of libs running around here in any sense of the word. Okay? But you go to the Mass at the University of Louisiana Lafayette Church, you will see. Last time one of my parishioners went there with a friend, you know, teenage girl in a halter top, distributing the Eucharist."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3073.72,"end":3074.28,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3074.92,"end":3076.16,"speaker":"Fr Stephen De Young","text":"This is not acceptable."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3076.16,"end":3076.92,"speaker":"Fr Andrew Stephen Damick","text":"I remember when they."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3076.92,"end":3097.93,"speaker":"Fr Stephen De Young","text":"This is why that whole Eastern Rite Roman Catholicism is irrelevant. Yeah, it's irrelevant. The fact that you would. Oh, well, we would let you join the Roman Catholic Church and still keep worshiping the way you do now it's like, okay, sure, I'm supposed to ignore what's going on down the street at the other church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3097.93,"end":3101.89,"speaker":"Fr Andrew Stephen Damick","text":"I'm in communion with the 98.5%."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3102.77,"end":3187.35,"speaker":"Fr Stephen De Young","text":"And that's low grade. We all know that's low grade. I'm not gonna do this whole thing where I trot out, like, the real abominations. You can find them online at different masses that people have videoed. Okay, I'm not gonna run through all that. I know our Roman Catholic listeners. That's not fair to you. But you know what I'm talking about. Okay? This is. That's low grade. Right. What I just mentioned happening here. It's just we cannot Right. And so the house is not in order. And the whole purpose of having one guy on the top who can make all the decisions is that you're not supposed to have chaos. You're not supposed to have liturgical chaos. I thought that was the whole point. That was supposed to be the whole point of having the Papacy. We're supposed to be in chaos because we don't have a Pope. But I can walk into an Orthodox Church pretty much anywhere in the world, and they're gonna be celebrating the same liturgy, reading the same scripture readings, doing the same thing on any day, given day of the year. I can't do that with a Roman Catholic Church at all. It's like a box of chocolates."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3187.35,"end":3195.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't know how you put that toothpaste back in the tube, like, once there's this sense that the liturgical tradition is in your hands. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3196.07,"end":3199.91,"speaker":"Fr Stephen De Young","text":"Yeah. That's a huge problem. Toothpaste, back of the tube. That's the problem with."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3200.86,"end":3201.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3201.06,"end":3208.46,"speaker":"Fr Stephen De Young","text":"I've had conservative Anglicans who are like, oh, well, maybe we could do it. We could become an Orthodox jurisdiction. I'm like, yeah, you're going to depose all those women you ordained."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3209.26,"end":3210.3,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3210.86,"end":3214.3,"speaker":"Fr Stephen De Young","text":"Nope, that's not so. Too faced isn't going back in the tube."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3215.02,"end":3240.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't. It's. That's the thing is, like. And that goes back. I mean, that's. That's more than half a century now. Right. Like, you can point. I don't like this Pope. I like this Pope, but it's not like everything's, you know, like, oh, if only could have this Pope back again. Yeah, yeah, yeah. Okay, one more before we finish up this half. This is."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3240.07,"end":3241.27,"speaker":"Fr Stephen De Young","text":"We both got to rant a little."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3241.43,"end":3242.79,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3243.19,"end":3263.7,"speaker":"Fr Stephen De Young","text":"But I hope. I hope the real idea came through. Like, I'm in this majority Catholic area, and I know when I say this, the gut reaction of all Roman Catholics is to get mad. Right. But, like, when I look at the disarray and stuff that's going on in the Catholic parishes here, I want to save people from that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3264.1,"end":3264.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3264.46,"end":3266.02,"speaker":"Fr Stephen De Young","text":"I don't want to be in communion with that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3266.98,"end":3311.27,"speaker":"Fr Andrew Stephen Damick","text":"And, I mean, I, like, I. I have Roman Catholic friends, good friends. And I don't know how you do it, you guys. Maybe you do. I don't know how you do it. Are you just waiting and hoping that somehow the next Pope is going to be better and is going to change things? I think some of you are going to grow old and die, you know, and you got to live somewhere you got to live somewhere. And I think if. If, you know, the worship is. Is so skewed. Yeah, it's just a problem. Okay, one more question for the end of this half."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3313.83,"end":3391.52,"speaker":"Stephen","text":"Hello, Fathers. I have a question connected to Father Steven's comments about Calvinism and the Council of orange. In the 100th episode. An acquaintance of mine has brought to my attention. There was a popular teacher of theology in Russia who offers a response to the question of whether people outside the Church, or who perhaps never heard of Christ, could be saved. He teaches that because God knows who will and who will not accept him, therefore, God will make sure that someone he knows will accept him, will be born either within an Orthodox family or God will provide the means for that person to discover Orthodoxy and join the Church during the course of their life. On the other hand, this scholar declares that anyone who died outside the Orthodox Church was therefore someone God knew would never accept him anyway. And so God never provided the means for him to become Orthodox and therefore would never attain salvation. This teacher presents this as the only logical conclusion to St. Cyprian's principle, outside the Church, there is no salvation. However, I personally find that this, what this teacher says, hard to swallow, or is this indeed the true teaching of the Orthodox Church? I would like to hear your own thoughts on this, Fathers. Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3391.76,"end":3452.88,"speaker":"Fr Andrew Stephen Damick","text":"All right. I didn't identify him, but this is Stephen sending this message in. So, yeah, I think. I think that, you know, I can't say that I can understand the mind of St. Cyprian, but my understanding of the way that the Orthodox Church would affirm the idea that there's no salvation outside the Church is that that does not mean that everyone who is formally a member of the Orthodox Church is saved, and everyone who's not formally a member of the Orthodox Church is damned, if only because, frankly, again, St. Isaac of Syria, you know, who canonically was not a member of the Church. He was a member of the Church of the East. I'm not saying he wasn't an Orthodox Christian because obviously we venerate him as an Orthodox Christian, but there's, you know, there's no indication that he was canonical. I know that some people argue about that, but my best reading of that history is that he was not canonically part of the Orthodox Church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3453.12,"end":3457.2,"speaker":"Fr Stephen De Young","text":"They're just trying to fumble with the history to make it match their theological."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3457.28,"end":3492.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, what I would say about outside the Church, there is no salvation is. I would say that, number one, it's a pastoral thing to say, which is like if you want to be saved, you better get in the church and do your salvation. There's like, it's an exhortation, but also in terms of like a dogmatic or a doctrinal statement. It's an eschatological statement that the church is salvation. So all who are saved ultimately are in the church, you know, will be in the church. You don't like that? Okay, tell me what you don't like about that. That's my understanding."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3492.75,"end":3494.91,"speaker":"Fr Stephen De Young","text":"Get a little proddy on me there."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3494.91,"end":3498.99,"speaker":"Fr Andrew Stephen Damick","text":"No, no, I don't. I'm not saying invisible church stuff that everything, whatever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3498.99,"end":3499.35,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3499.35,"end":3501.31,"speaker":"Fr Andrew Stephen Damick","text":"I'm just saying that better clarify that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3501.31,"end":3502.89,"speaker":"Fr Stephen De Young","text":"Because there' somebody in the end."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3503.05,"end":3508.09,"speaker":"Fr Andrew Stephen Damick","text":"In the end. Right. Everyone who's saved is the church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3508.73,"end":3510.97,"speaker":"Fr Stephen De Young","text":"The church is the kingdom. So everybody who's in the kingdom."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3511.13,"end":3512.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, that's what I'm saying."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3512.09,"end":3513.13,"speaker":"Fr Stephen De Young","text":"De facto in the church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3513.13,"end":3513.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3513.33,"end":3513.53,"speaker":"Jason","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3513.53,"end":3513.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3513.77,"end":3514.09,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3514.09,"end":3527.13,"speaker":"Fr Andrew Stephen Damick","text":"There is no separate thing called salvation that exists outside of that. And in, in any sense people are, are saved. It's, it's in relation to the church. I don't, I don't know. I mean, that's, that's my, my understanding. I'm not saying I dogmatically teach that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3527.86,"end":3534.54,"speaker":"Fr Stephen De Young","text":"Well, so here's, here's. I should say, amazing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3534.54,"end":3541.1,"speaker":"Fr Andrew Stephen Damick","text":"And how. I was saying, I am interested in how the council. Because you made mention of the Council of Orange. How the Council of Orange kind of."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3541.1,"end":3548.34,"speaker":"Fr Stephen De Young","text":"Yeah, I don't know how the council. Well, I think the Council of Orange maybe because the Council of Orange condemned the idea of reprobation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3548.42,"end":3548.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3548.94,"end":3553.38,"speaker":"Fr Stephen De Young","text":"So I think he's trying to say, well, isn't this a version of the doctrine of reprobation?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3553.38,"end":3553.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3554.43,"end":3568.51,"speaker":"Fr Stephen De Young","text":"To say that, you know, God even, even that it wouldn't technically fall under the Council of Orig, because what this Russian person apparently is saying is that it's based on foreknowledge."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3568.59,"end":3569.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3569.63,"end":3577.79,"speaker":"Fr Stephen De Young","text":"Whereas. Which is which the Council of Orig is talking about God creating people in order to damn them. Which is more like the Calvinist view."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3577.79,"end":3578.19,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3578.19,"end":3616.26,"speaker":"Fr Stephen De Young","text":"Than the, the actual Arminian view that it's based on foreknowledge is the actual Armenian view, which most people who identify as Arminians, they just mean non Calvinist. They aren't actually Arminians. They don't believe God actually chooses people based on foreknowledge. They don't believe God chooses people at all. But yeah. So I was going to say it baffles me that people haven't made this connection, but it doesn't really give it the People who fail to make this connection. So the church is Israel. Right?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3616.5,"end":3616.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3619.54,"end":3629.86,"speaker":"Fr Stephen De Young","text":"What does Christ say to the Samaritan woman in St. John's Gospel? You worship what you do not know. We worship whom we know because salvation is from the Jews."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3630.42,"end":3630.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3632.02,"end":3634.1,"speaker":"Fr Stephen De Young","text":"Does he mean there only Jews are saved?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3635.06,"end":3643.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's the thing that apparently this, whoever this Russian commentator is essentially saying, but substitute the Orthodox Church for the Jews."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3643.94,"end":3654.9,"speaker":"Fr Stephen De Young","text":"Yes. Is Christ saying, well, God knew who would be faithful and so he caused them to be born Jews? Obviously not. He's talking to a Samaritan about her salvation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3655.54,"end":3657.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And she's definitely saved."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3657.86,"end":3665.31,"speaker":"Fr Stephen De Young","text":"Right. She's a saint. And he's acknowledging that the Samaritans, who were heretics at best. Okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3665.31,"end":3666.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That they actually worship."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3667.27,"end":3700.15,"speaker":"Fr Stephen De Young","text":"Whatever you think about the relationship between Orthodox, the Orthodox Church and a Protestant group. Okay. Like you're not going to think less of that Protestant group that Jewish people thought of Samaritans. Okay. Like that's. They're a heretical group. But Christ says they're worshiping God. They're just doing it in ignorance. They're doing it without knowledge. And he's now come to bring them that knowledge."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3702.95,"end":3703.35,"speaker":"Jason","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3707.03,"end":3718.87,"speaker":"Fr Stephen De Young","text":"Whoever this Russian teacher is, he's all wet. Right. Because first of all, he doesn't realize that the church is Israel. But more importantly, why has the Orthodox Church evangelized then? Historically."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3719.11,"end":3723.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Wouldn't God just cause them to be born into Orthodox families? Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3723.5,"end":3810.43,"speaker":"Fr Stephen De Young","text":"Yes. Right. So let me tell you, for those of you who aren't Dutch, about a little group called the Protestant Reformed. And it will always be a little group because they don't evangelize. They split off from the Christian Reformed Church where the Dutch Reformed denominations in the 1920s, they set up parallel institutions. It was led by Hermann Hoeksema and Danhoff in Grand Rapids. They said they didn't believe in common grace. Right. They said, so you don't evangelize because election in the little town I grew up in with the big Dutch community there was across the street from First Christian Reformed Church. And the Christian school was the Protestant Reformed Church. And the Protestant Reformed School. And they believed. They honestly believed. And the pastor there, what's told my grandfather directly, that if someone was elect in the city of Redlands, California, the Holy Spirit would bring them to the Protestant Reformed Church and sit them there in the pew and they would find salvation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3811.15,"end":3811.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3812.43,"end":3815.75,"speaker":"Fr Stephen De Young","text":"And so if they went out there and evangelized ever, they were casting pearls."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3815.75,"end":3824.91,"speaker":"Fr Andrew Stephen Damick","text":"Before swine, I should note. I just looked this up, by the way. That this denomination has 33 churches and about 8,000 members."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3825.55,"end":3828.59,"speaker":"Fr Stephen De Young","text":"Yes. Well, they don't evangelize. Right, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3828.83,"end":3834.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Well, I mean, the elect are few. Yeah, exactly. There's super duper few."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3835.45,"end":3854.65,"speaker":"Fr Stephen De Young","text":"Right. So this is what this Russian guy is preaching. It's not only Calvinism, it's bad Calvinism. Not even good Calvinism. Now I'm going to find out this is a bishop or something. But, you know, he's still wrong."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3854.65,"end":3855.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3859.14,"end":3860.66,"speaker":"Fr Stephen De Young","text":"And he's not my bishop, so."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3861.38,"end":3870.66,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. All right, well, that wraps up this first half of this pre recorded episode. We'll be back in a minute with even more spicy takes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3870.74,"end":3888.51,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-23723. That's 855 AF radio."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3891.79,"end":3949.52,"speaker":"Announcer","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality. But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world. In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by De Jong's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology. By using words and ideas grounded in 1st century Judaism, de Young hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3949.52,"end":3964.01,"speaker":"Announcer","text":"Of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3966.49,"end":3992.98,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the second half of this pre recorded episode of the Lord Spirits podcast. We had a pretty ranty first half, so I don't know what's going to come up in this one. There is actually a reference to Peter at the end, so. But that's not the first one we have. The first one we have is Jerome who has called in and he wants to ask you, Father Stephen, about some things you said about Christian influence on Neoplatonism."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":3994.34,"end":4060.84,"speaker":"Spencer","text":"Good evening, Fathers. This question is for Father Stephen in particular. In the past you've commented on the Christian influence on Neoplatonism rather than the other way around. When I look for resources on this matter, it's a bit crowded with noise on the line for the other way around. Neoplatonist influence upon Christianity. I remember you've rattled off some names in the past, if I remember correctly. Most recently you commented on Daniel Boyar in regards to Philo. And I'm also aware of a book by Archbishop Golitsyn on Saint Dionysius. If you could name any names or any books or studies, whether Christian or secular academics on this topic, I would really appreciate it. I've seen some people ask about this on the Facebook group as well, but there hasn't been many answers. As a side note too, I would also like to ask if you think that the so called Gnostics might have any hand in this."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4062.28,"end":4088.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so this is well outside of my field. Not that a lot of this isn't. But you know, this, this I really have never really looked that much into. I mean the one thing I remember you saying is that I think it was Porphyry actually is clearly is interacting directly with Christianity. So clearly there's an influence there. But that's the one thing that I remember. What else is there to say about this? Where should Jerome go and read?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4088.41,"end":4100.37,"speaker":"Fr Stephen De Young","text":"Yeah, so I mean, yeah, I'm not big on, super big on doing bibliography for people, but that's not a shot at Jerome. That's not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4100.86,"end":4102.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but you know, if someone says."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4102.42,"end":4103.94,"speaker":"Fr Stephen De Young","text":"Hey, what should I look up?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4103.94,"end":4105.42,"speaker":"Fr Andrew Stephen Damick","text":"I don't, I don't know where to start here."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4107.02,"end":4339.8,"speaker":"Fr Stephen De Young","text":"There are some people who are super good at that, like the late Mike Heiser. That, that was for me at least that was the thing he was most brilliant at was bibliography. Like you could go to that guy and he could give you lists on just about any topic to go and do the reading yourself. That was like his skill. That is not my skill. Obviously I have bibliographies on things, sometimes dozens and dozens of pages if we're talking about dissertations. But the two places that he mentioned Archbishop Alexander's book and that Daniel Boyar Nargol that I reference a fair amount, are good starting points. But one thing I would really encourage is I would encourage people to actually read Porphyry and Plotinus and in that order, which is the historical order. Porphyry was the teacher of Plotinus. We tend to get bogged down a lot in secondary sources and never get to the primary sources. I think it's important that you need to get a little bit of a grounding in what's going on. I get that just picking up Plotinus Enneads and trying to read it is a big lift. Okay, I get it. But once you're grounded at least a little bit, you need to actually read the stuff. And the reason I say this, particularly in this case, is that when you read Porphyry, Porphyry is directly an anti Christian polemicist in favor of the pagan philosophical position. And so when you read what he has to say and then you read what student Plotinus has to say, because Plotinus is then going to present the positive case, he's laying out sort of a positive philosophical vision incorporating both Porphyry's critiques of Christianity and the critiques coming from Christianity that Porphyry was trying to respond to. Right. And so when you read them in that order, it becomes very apparent what Plotinus is doing in his project and casts a lot of light on Plotinus. Then once you've done that, you can start delving into Plotinus scholarship. And I recommend going to scholarship that has nothing to do with the Church Fathers or Christianity directly. Just. Just things talking about Plotinus. Right. Scholarship about Plotinus, like from classicists. Right. Who don't have an ax to grind one way or the other. Right. In terms of the relationship of Plotinus to Christianity. Right. That's sort of the reading order I would recommend. So start with a couple of things you mentioned. Sounds like you're kind of grounded in the issue in general. Read Porphyry, read Plotinus, then get into some classic Plotinus scholarship. And I think it will bear out what I'm saying. Gnosticism. Go ahead."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4339.8,"end":4358.1,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say, before you get into the Gnosticism thing, I've read, but it's been a long, like probably 20 years. Yaroslav Pelicans, Christianity and Classical culture. Does he deal with that at all in there? Because, I mean, that's. The whole book is a. Is about. Well, it's. It does what it says on the label."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4358.42,"end":4364.98,"speaker":"Fr Stephen De Young","text":"I mean, a little bit. A little bit. He's very focused in that book, actually, on the Cappadocians."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4365.22,"end":4369.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. I mean, they're on the COVID Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4370.14,"end":4386.38,"speaker":"Fr Stephen De Young","text":"So, I mean, that is about their use of classical culture. Broadly. It includes their use of philosophy. But he's not looking at. From the perspective of where does Neoplatonism come from?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4386.54,"end":4387.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4387.46,"end":4399.73,"speaker":"Fr Stephen De Young","text":"He's looking at it from the perspective of how much of an influence was Neoplatonism on St. Basil the Great, St. Gregory the Theologian. Right. That particular case."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4400.13,"end":4400.77,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4400.85,"end":4401.25,"speaker":"Jason","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4404.05,"end":4457.09,"speaker":"Fr Stephen De Young","text":"So the reason lots of folks see crossover between Neoplaton Platonism and Gnosticism is sort of that their project is similar Gnosticism that could be called Christian. Gnosticism is sort of an attempt to incorporate certain Christian elements into the framework of Roman paganism as it existed in the second and third centuries. And Neoplatonism is an attempt to import certain elements of Christianity into Platonic philosophy as it existed in the third century. Right. So you can see right there there's a similar project going on."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4457.73,"end":4458.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4458.69,"end":4493.46,"speaker":"Fr Stephen De Young","text":"Once, once you accept that Platonism was not something totally other than paganism, which is another thing I have to argue for. But you can see how that's a similar project. And so yeah, there's, there's going to be certain through lines and crossovers. But the biggest place where Neoplatonism and Gnosticism separate themselves is the level of practice, level of religious praxis, which is a level that most studies don't talk."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4493.46,"end":4515.04,"speaker":"Fr Andrew Stephen Damick","text":"About that much, weirdly enough. Well, I mean this plays into the thing we were talking about in the first half, right. Which is this idea that if we could just sort of sort these dogmatic questions out, then everything will be kind of fine. It's like, no, no, no, no. Where do you live? What is the day to day life like? Yeah, that's what actually matters the most."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4515.68,"end":4520.64,"speaker":"Fr Stephen De Young","text":"Yeah. The real meanings of ideas comes, come. Comes from the practices that generate."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4520.8,"end":4522.24,"speaker":"Fr Andrew Stephen Damick","text":"That's right, yep."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4523.76,"end":4607.93,"speaker":"Fr Stephen De Young","text":"So, and praxis wise the various Gnostic sex, while there's a variety of praxis, there are certain through lines in terms of mystery, initiation and stuff that you do, you don't really find in the academy, in Plato's academy. Now Plato's academy did, and this is another underestimated thing, all these philosophical schools had sometimes very rigorous ways of life, including things like meditation and fasting that look very religious to us once you actually become aware of them. And Neoplatonism proper, not people influenced by its ideas, but Neoplatonism proper had a way of life attached to it. And it's pretty different than the Gnostic way of life. Gnostic way of life was more drawn from the preceding mystery cults and Roman paganism more broadly. Whereas the tradition of the academy really started with Plato himself. And Plato of course points to Socrates, but that's a rabbit hole. But there's another open question as to how much of Plato's Socrates is the historical Socrates and how much of it is Plato. Plato."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4607.93,"end":4620.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. All right, this next question comes from Anker. A N k E R And yeah, I'll just let him speak for himself. This one's a little complicated."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4620.9,"end":4640.98,"speaker":"Spencer","text":"Father's Bless, this is anchor from Colorado. I have a follow up question to your Israel I choose you Episode A Caller asked about the process of canonizing a saint. You said that it begins with the informal veneration of that person. I could understand how this happens. If someone local with a reputation for holiness dies, you'd be praying for their intercession. Naturally."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4642.01,"end":4643.17,"speaker":"Jason","text":"At the same time, I get the."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4643.17,"end":4662.37,"speaker":"Spencer","text":"Sense that we probably shouldn't be plumbing the depths of heaven or blindly ice fishing to see if some unknown saint might answer our prayer. Is this right? Would it be because we should be happy with the saints that God has chosen to reveal? Or is there any sort of danger that some other spirit might bite the hook if we extend the fishing metaphor?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4662.37,"end":4662.97,"speaker":"Jason","text":"Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4664.09,"end":4703.81,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah, to me it sounded like he started out asking one thing and then, and then it's sort of focusing on something else. But I mean, the first thing I'll say is I think that if you, if you're asking for something that is beneficial and good and for your salvation, like there's no worry that a demon is going to jump in. And you know, unless you're trying to address one, you know, like if you're asking Thor for help for your crops or whatever, like, yes, that's a problem. But if you're just saying, you know, like, you know, Hamlet, angels and ministers of grace defend us. There's no one named there. But you know, that didn't work out."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4703.81,"end":4704.61,"speaker":"Fr Stephen De Young","text":"So well for Hamlet."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4704.61,"end":4705.45,"speaker":"Fr Andrew Stephen Damick","text":"No, it didn't."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4705.45,"end":4706.45,"speaker":"Fr Stephen De Young","text":"That's the best example."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4706.45,"end":4708.57,"speaker":"Fr Andrew Stephen Damick","text":"It's just not how it, how it worked for him."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4709.05,"end":4713.97,"speaker":"Fr Stephen De Young","text":"But we also, I mean, we don't have an icon with like a silhouette on it that says the unknown saint."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4713.97,"end":4748.27,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right. That's right. But I do think, but I think there's something underneath what he's saying here, which maybe he did, maybe this is not what he's asking. But I was a question that came up in my mind to think about. This is, you know, there is a kind of a weird thing that has happened now in the Internet age about the canonization of orthodox saints where like people have heard that there's informal veneration that goes on first and then later you get an official canonization. And so they like just say, father."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4748.27,"end":4750.95,"speaker":"Fr Stephen De Young","text":"Seraphim wrote campaign, just say it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4750.95,"end":4754.27,"speaker":"Fr Andrew Stephen Damick","text":"He's not the only one. But, but yeah, I mean, he's the main one."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4754.27,"end":4754.79,"speaker":"Fr Stephen De Young","text":"Come on."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4754.79,"end":4891.33,"speaker":"Fr Andrew Stephen Damick","text":"There's clearly campaigning going on for him and people saying, you know, like, very boldly saying, saint Seraphim, pray for us and all this kind of stuff. And. And none of that is to say anything about his holiness or whether. And maybe someday he will be. Can maybe tomorrow he's gonna be candid as a saint. I mean, I don't know. I don't know. But, like, that's not how this works, guys. That's not how it works. Like, as. As. As Anchor said, there's. It's like, local veneration, people who knew the person, or there's experiences that are happening locally or whatever it might be. And, like, that's part of the reason why. Maybe it's the reason why canonization happens locally that you don't do. Like a group of bishops in another country does not normally. I've never heard of actually canonizing someone from the other side of the world that had nothing to do with them and was not part of their church or whatever, even if they might eventually venerate that person after they have been canalized locally by whoever, you know, And I know, like. Well, since you mentioned Father Seraph from Rose, you know, there apparently is a bishop in Georgia who has, like, put his icon on the wall and people declared that this was him canonizing Father Seraphim Rose. That is not a canonization. And I remember mentioning this. Yeah, that's. That's not how it works. It's just not how it works. I actually was. I actually mentioned. Well, it wasn't me. Someone else mentioned this. I was in the conversation when someone else mentioned this to another bishop, and the bishop said, you need more than one bishop for that. You can't do that. That's not how it works. It's not just like, it's every man's game until finally some synod says, oh, we'll catch up to all this veneration that's happening all over the world and this campaigning that's going on in the Internet. No, that's not how it works. And so, yes. I mean, yes, Anchor, we should be happy with the saints that God has revealed to us. Absolutely. Those are the ones that God has given to us for our salvation. And, you know, there's a gazillion saints that are officially canonized."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4892.21,"end":4895.41,"speaker":"Fr Stephen De Young","text":"I think most of the problem here is that people just won't shut up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4896.21,"end":4896.61,"speaker":"Jason","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4897.49,"end":4900.77,"speaker":"Fr Stephen De Young","text":"No, really. I mean, I'm being dead serious."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4901.09,"end":4902.77,"speaker":"Fr Andrew Stephen Damick","text":"I know you are. You, like."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4904.54,"end":4914.06,"speaker":"Fr Stephen De Young","text":"Go on a pilgrimage to Platina, pray, and ask Father Seraphim Rose to pray for you. Something wonderful happens for you. Wonderful. Beautiful."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4914.22,"end":4914.9,"speaker":"Fr Andrew Stephen Damick","text":"Good for you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4914.9,"end":4915.82,"speaker":"Fr Stephen De Young","text":"Shut up about it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4915.9,"end":4920.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because what is it it's all about, actually, it's all about imposing that on someone else."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4920.14,"end":4924.58,"speaker":"Fr Stephen De Young","text":"Right. It's not about public. We don't publicize these things. We just talked about this with miracles."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4924.58,"end":4940.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I've seen people on, like, on, you know, X, formerly known as Twitter, essentially making whether you call him St. Seraphim of Platina like a shibboleth for the purity of your orthodoxy. I'm like, yes, y' all definitely need to shut up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4941.76,"end":4946.12,"speaker":"Fr Stephen De Young","text":"You know, half of those people aren't even inquirers or merely inquirers."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4946.12,"end":4950.96,"speaker":"Fr Andrew Stephen Damick","text":"I know. It's not actual faith. It's just a thing in their heads."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4951.52,"end":4954.72,"speaker":"Fr Stephen De Young","text":"Just live an orthodox Christian life and shut up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4954.72,"end":4955.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4955.84,"end":4964.05,"speaker":"Fr Stephen De Young","text":"If you want to pray to Father Seraphim, pray to Father Seraphim. Rose, go ahead. Okay. Go ahead."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4964.13,"end":4964.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4964.85,"end":4967.09,"speaker":"Fr Stephen De Young","text":"Right. He may be a saint. I'm not saying he's not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4967.09,"end":4967.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4967.57,"end":4972.53,"speaker":"Fr Stephen De Young","text":"Like I said, he may be a saint. He may pray for you. God may do something wonderful through his prayers."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4973.09,"end":4973.65,"speaker":"Fr Andrew Stephen Damick","text":"Cool."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4974.61,"end":4981.33,"speaker":"Fr Stephen De Young","text":"Right? And if that happens, and that happens a lot, trust me. Right. He'll end up being glorified as a saint."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4981.33,"end":4982.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Canonization."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4984.13,"end":4985.33,"speaker":"Fr Stephen De Young","text":"For now, just shut up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4985.58,"end":4985.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4987.26,"end":4988.06,"speaker":"Fr Stephen De Young","text":"Live your life."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4989.74,"end":4992.22,"speaker":"Fr Andrew Stephen Damick","text":"Repent. All right, this next one comes from."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4992.22,"end":4995.42,"speaker":"Fr Stephen De Young","text":"Katie, who has that needs to be our next T shirt. Just shut up."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4996.78,"end":4998.14,"speaker":"Fr Andrew Stephen Damick","text":"Lord of Spears podcast with the Lord."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4998.14,"end":4999.34,"speaker":"Fr Stephen De Young","text":"Of Spirits logo on the back."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":4999.58,"end":5010.88,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Hashtag. Okay, so this next one comes from Katie, who has a pretty specific question about King St. Josiah in the Ultimate."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5013.67,"end":5048.05,"speaker":"Sarah","text":"Hi, this is Katie from Wisconsin. I'm calling regarding Josiah removing the high places in four kingdoms. 23 in multiple points, it mentions him burning bones on the altars to defile them. And in verse 14, it says he cut down the idols and filled their places with human bones. I'm confused by this behavior. Is he burning the false priests bones? Does verse 14 relate to cleansing spaces with relics? Which doesn't seem right since later it mentions Josiah leaving the tombs of two righteous prophets alone. Any thoughts would be appreciated. Thank you very much."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5048.61,"end":5055.97,"speaker":"Fr Andrew Stephen Damick","text":"I like this question. I have no idea what the answer is, but yeah, I want to hear what you have to say about this because this is a very Lord of Spirits kind of question."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5056.77,"end":5064.01,"speaker":"Fr Stephen De Young","text":"Yes. So what he's doing is he."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5064.01,"end":5064.37,"speaker":"Sarah","text":"Is."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5066.67,"end":5164.69,"speaker":"Fr Stephen De Young","text":"He is being ecumenical. Right. King St. Josiah. Right. He's. He's learned about the beliefs of these other groups. He's learned about the things they believe would defile their altars of their High places. And he's doing those things. Yeah, right. He's doing those things. And so he doesn't touch the tombs of the righteous. Right. So there's a very different understanding. And we saw this, we had quotes about this, remember we were talking about in our episode about relics from pagans who thought the Christian use of relics was disgusting. Yeah, right. Because they thought that the remains of the dead were sort of vile and unclean and. Right. Why would you parade them around? And these were criminals anyway. Right. And so this is that kind of thing. Right. This is manifesting part of the manifestation of true versus false religion here is their attitude toward the body and vis a vis the resurrection. And so, see, it's one thing to go and tear down a high place. Right. I mean, what does that even mean? It's a high place because it's up on a hill and we're talking about, in some cases, not temple buildings. We're talking about, you know, fenced off groves or, you know. Right. Like someone could come back and rebuild the altar the next week."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5165.89,"end":5166.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5166.25,"end":5184.6,"speaker":"Fr Stephen De Young","text":"You tear it down, somebody else comes and rebuilds it. That happens throughout Israel's history. Right. A good king comes along and does something like this and gets rid of them and then they pop back up. Right. Well, if you defile it from the perspective of that other religion, then they can't go back and rebuild it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5184.6,"end":5188.04,"speaker":"Fr Andrew Stephen Damick","text":"It's like salting the earth. You can't plant anything there anymore."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5188.52,"end":5202.77,"speaker":"Fr Stephen De Young","text":"Right, Right. And you have to remember, well, why couldn't they just cleanse it and rededicate it like the way the Israelites did the temple? Well, because that's not how pagan holy sites worked. Remember, pagan holy sites were discovered."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5202.85,"end":5203.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're God's discovery."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5203.77,"end":5206.53,"speaker":"Fr Stephen De Young","text":"This is the place where we encountered this spiritual being."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5206.69,"end":5207.73,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5208.61,"end":5212.65,"speaker":"Fr Stephen De Young","text":"So once it's defiled, well, now it's done. Now this isn't a holy place anymore."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5212.65,"end":5213.81,"speaker":"Fr Andrew Stephen Damick","text":"Josiah ruined it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5214.29,"end":5221.73,"speaker":"Fr Stephen De Young","text":"They didn't make a place holy. They discovered a place that they already believed was holy. A spring, a grove, whatever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5221.73,"end":5224.61,"speaker":"Fr Andrew Stephen Damick","text":"Thus demonstrating how utterly weak and pathetic their gods are."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5225.21,"end":5244.09,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. They can't even reconsecrate a place. Right. So they'd have to go and find new holy places if they were going to build new high places. So that's what's going on there. He's trying to get rid of the paganism in a way that will last."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5245.45,"end":5252.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not because he believes in the rituals he's doing in and of themselves, but he knows that they will hate it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5253.18,"end":5253.46,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5253.46,"end":5254.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5254.62,"end":5262.7,"speaker":"Fr Stephen De Young","text":"See it says he burns bones on the altar. It doesn't say he sacrificed to their God. Right. He goes and takes unclean things and burns them there."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5263.18,"end":5276.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay. Rob has a question about assurance of salvation in the Orthodox context. Hi, Fathers, this is Rob from Kalamazoo. I was hoping you could speak to."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5276.58,"end":5305.33,"speaker":"Spencer","text":"Assurance of salvation and what that means in the Orthodox Church, especially in light of the Puritan derived American traditions we're surrounded by, which all seem to require and oblige you to have ultimate and incredible assurance of your salvation at this very moment. So how that looks different for us and. Yeah, thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5305.96,"end":5443.35,"speaker":"Fr Andrew Stephen Damick","text":"All right. Yeah. I mean, I think having been raised, you know, in an evangelical context, back when that meant something different than it means now. But yes, this idea of like, you can know that you are saved. So assurance of salvation is defined as epistemological certainty, like you absolutely know, which, I mean, thus the big event, you know, evangelistic question. If you were to die tonight, do you know where you would spend eternity? Right. But I mean, here's the problem with this. That kind of knowing doesn't apply to this. That kind of knowing actually, I mean, there is a certain level on which that kind of knowing doesn't even exist at all. Like, I could say, I know that one plus one equals two, but that's because I have concepts of one and one and two that I've defined as being that. Right. So like, you set the system up and of course it works the way you set it up. And I think that that's part of the difficulty, that's what's going on with this version of assurance of salvation is that it's like, well, we define salvation as you did this, and so therefore you have this. And. But the only reason you're going to believe that is because someone said that's how the system works. Right. But that's not actually the way that the Scriptures are presenting that, especially because there's all of these exhortations about remaining faithful and enduring to the end and all that kind of stuff, which doesn't mean that there's no assurance of salvation. It's just. And I've heard you use, I mean, this is a great, great analogy, Father. I've heard use this analogy like, you know, you did not wake up this morning going, oh, is my wife going to divorce me today? You know, could she? Yes, she could. But you're assured that she's not because of the life that you have together, because of the relationship that you actually have. Right. It's much more like that, you know, and it actually turns out that the marriage. Marriage as a metaphor for salvation is something that's in the scripture. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5445.43,"end":5458.47,"speaker":"Fr Stephen De Young","text":"Right. And part of the problem is right off the bat, how we're defining salvation. Yeah, right. Defining salvation is going to heaven instead of hell when you die."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5458.79,"end":5459.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5461.91,"end":5471.77,"speaker":"Fr Stephen De Young","text":"I mean, this is. This is a morning. What. We're recording this in the morning. This is an evening of spicy takes. So I'll go ahead and say that's sub Christian."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5472.17,"end":5481.37,"speaker":"Fr Andrew Stephen Damick","text":"We're actually recording this on the day that is festivus for the rest of us. Yes. So if you want to air some grievances, this is the time."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5481.85,"end":5486.33,"speaker":"Fr Stephen De Young","text":"Well, that's what we've been doing, isn't it? Yeah. We didn't even try to do that. It just turned out very apropos."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5486.57,"end":5487.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5489.77,"end":5504.1,"speaker":"Fr Stephen De Young","text":"Yeah. So that's just some Christian. That's not Christianity. That's not Christian eschatology. Christianity is not a religion that teaches that good people, however defined, go to heaven for eternity and bad people go to hell for eternity."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5504.82,"end":5505.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5505.86,"end":5516.58,"speaker":"Fr Stephen De Young","text":"That's not Christianity. Sorry. And so that's definitely not like the core of the gospel or the heart of what salvation is."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5519.95,"end":5520.19,"speaker":"Sarah","text":"So."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5523.31,"end":5567.04,"speaker":"Fr Stephen De Young","text":"The question is, then. Well, then what is salvation? Well, if salvation is being conformed to the likeness of Christ, if salvation is theosis, it's becoming like God. Right. That's not a binary thing. That's not a zero or a one. It's not. You're completely unlike God or you are exactly like God. Right. It's never zero and it's never one, in fact. Right. Every human being is somewhere in between and in process and in a continuous process of drawing closer to God or moving farther away from God, of becoming more like God or becoming less like God and less human, less like Christ."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5567.28,"end":5567.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5568.88,"end":5734.57,"speaker":"Fr Stephen De Young","text":"That's on a continuum. That's not a continuum. So are you saved? Well, do you mean am I perfectly conformed to the likeness of Christ? No. Right. Am I saved in the sense that. Am I worried that if I die, if I walk out of this building and get hit by a bus, I'm going to go to hell? Well, then, yes, I guess I am saved because I'm not worried about that. Right. Like, it's kind of. And it's a weird. It's a weird way of even thinking about it from a Christian perspective. I know it's trying to boil it down or something, but it really is weird. And I think, like that marriage analogy that I've used before, that I'm not worried that my wife is Going to divorce me while I'm recording this, even though she could print out the paperwork and do it, is because I know my wife. But the other piece is I'm even less worried that I'm randomly going to divorce her someday for no reason. Which is for Calvinists, like, the big concern about assurance apparently. Like, they just think they're going to get a wild hair and apostatized for no reason someday unless it's impossible for them to do so. And to me, that's like me worrying that, well, unless I make it impossible to divorce my wife, I might do it someday. Right. Like, I mean, I may be crazy. I'm not that crazy. Right. Where I'm just going to go off on a wild hair and do that. But more important than just that surface example is this idea of a relationship, right. Actual human relationships and actual human life is like way more messy than that. Right. Like, you don't get a printout every day about your relationship with each of the people in your life saying like, oh, this relationship is 78% good today. You might want to put a little effort into it. This other one, 98% good. Don't worry about it. Right. Like, that doesn't happen. Right. Why would you think your relationship with God in Christ at real life was going to be like just this neat, tidy thing where it's like, okay, got that salvation box checked off. You don't have to worry about that now, I guess. Right. And there's a reason why people who are taught that. Right. There's a reason why, you know, they've been baptized multiple times."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5736.02,"end":5736.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5736.38,"end":5738.74,"speaker":"Fr Stephen De Young","text":"And they've come forward at altar calls multiple times."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5739.06,"end":5739.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5739.62,"end":5741.38,"speaker":"Fr Stephen De Young","text":"Because it doesn't work."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5741.78,"end":5742.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5743.46,"end":5777.26,"speaker":"Fr Stephen De Young","text":"You're trying to convince yourself everything's okay. Right. And much better to be both realistic and biblical and say, hey, you know what? This is a process. This is a give and take. And sometimes I screw up and I fall into sin and I'm farther away from the goal, I need to repent and get back on my feet. And sometimes I'm growing in the grace of God. Right. And I see transformation happening in my life. Right. But it goes both ways over the course of a life. Right? And just accepting that that's how it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5777.26,"end":5777.54,"speaker":"Jason","text":"Is."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5779.7,"end":5782.26,"speaker":"Fr Stephen De Young","text":"That seems to be a much more rational and less crazy making."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5786.27,"end":5801.19,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. I think like, you know, it's like asking the question, am I healthy? You know, you can go into your doctor and your doctor's like, okay, well, do you exercise? Do you eat well? You know, do you have any, you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5801.19,"end":5805.03,"speaker":"Fr Stephen De Young","text":"Know, Even when I say no to all those questions, my tests still come back fine."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5805.03,"end":5825.86,"speaker":"Fr Andrew Stephen Damick","text":"So there you go. Yeah, you know, it's much more like that. That's that kind of assurance. Not, not did I pay my taxes, you know, so. Okay, this next one comes from Jason who wants to know if we should use the word we when we're talking about Israel in the Old Testament."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5827.38,"end":5839.8,"speaker":"Fr Stephen De Young","text":"Greetings fathers. Thank you for considering my question and my call. I am Jason calling from Massachusetts, and my question is about pronouns and salvation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5839.8,"end":5844.36,"speaker":"Jason","text":"History or universal history. I'm a middle school social studies teacher."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5844.6,"end":5861,"speaker":"Fr Stephen De Young","text":"And I've noticed, or at least I'm under the impression that Americans are unique among English speaking peoples in using we and us when talking, at least informally about our history. We dumped the tea in the harbor."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5861,"end":5863.08,"speaker":"Jason","text":"We beat the Nazis, etc."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5863.88,"end":5888.08,"speaker":"Fr Stephen De Young","text":"And it got me thinking about how we discuss God's people, especially in the Old Testament. And my question is, should we use those terms, those pronouns when talking about Israel? Should we talk about we were led out of Egypt, we were a stiff necked people as those grafted onto the tree and does this even matter?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5888.08,"end":5889.2,"speaker":"Jason","text":"Is this just semantics?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5889.6,"end":5892.64,"speaker":"Fr Stephen De Young","text":"Thank you so much and I appreciate everything you do with the show."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5893.03,"end":5906.23,"speaker":"Fr Andrew Stephen Damick","text":"You know, I've recently been getting into the Rest is History podcast with Tom Holland and Dominic Sandborn. I think is his name Sandbrook. I don't know, it's some compound last."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5906.23,"end":5909.35,"speaker":"Fr Stephen De Young","text":"Name outward of geographical features."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5909.75,"end":5949.24,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. I know. And I mean one thing I'll say is it's always funny to me when Dominic, whatever his last name is, makes Spider man jokes to the historian Tom Holland. But I, I believe I recall them using the term we and we using terms we and us when we when talking about British history, you know, because they're both, they're both Brits. But so I don't, I don't, I don't know that I don't think we're. The Americans are unique in using we and us referring to our history. But whether we are or not, I, I mean the more important part of his question is should we talk about."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5949.24,"end":5953.4,"speaker":"Fr Stephen De Young","text":"I was going to say you should stop on that score. And it was the Red army who beat the Nazis."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5955.96,"end":5958.12,"speaker":"Fr Andrew Stephen Damick","text":"I'm not going to use we or us for either one of those."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5961.08,"end":5963.08,"speaker":"Fr Stephen De Young","text":"But come on, comrade. Oh no."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":5965.96,"end":6009.46,"speaker":"Fr Andrew Stephen Damick","text":"You'Re making, you're triggering all of my Baltic blood there. That, I mean, right, that like you've made the point a bunch of times. I mean this is what we see in the scriptures is that like when the Passover is celebrated, the Family celebrating. It uses we and us to refer to the events in Exodus. Is that. I can't recall off top of my head now. Does St. Paul use we and us. And when referring to, you know, talking to. Now, he does talk about. He tells. When he's talking to former pagan converts to Christianity, he does use our fathers and that sort of language."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6009.62,"end":6016.82,"speaker":"Fr Stephen De Young","text":"Yeah. Not just to talk about Abraham, Isaac and Jacob, but to talk about Moses and the Israelites."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6018.82,"end":6024.02,"speaker":"Fr Andrew Stephen Damick","text":"So it is a Wenaz, although I've never heard anyone in English use."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6024.1,"end":6030.6,"speaker":"Fr Stephen De Young","text":"He writes to. Well, we kind of do every liturgy. Blessed art thou, Lord, God of our fathers."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6030.6,"end":6035.56,"speaker":"Fr Andrew Stephen Damick","text":"Okay, yeah, God of our fathers is definitely Israel language."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6036.68,"end":6038.24,"speaker":"Fr Stephen De Young","text":"Yeah. Rabbi Isaac and Jacob."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6038.24,"end":6038.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6040.44,"end":6103.49,"speaker":"Fr Stephen De Young","text":"But yeah, and St. Paul does that very freely. He's talking to the Corinthians, who are mostly former pagans and says, remember, all of our fathers were passed through the sea, were baptized into Moses in the cloud and in the sea, and they ate the spiritual food and they died in the desert. Right. That's the Israelites, specifically. Right. Because when he says that about them being grafted in, he actually believes they're grafted in. They're now in. And so that history of that heritage becomes their history. And that's not a new thing in the New Testament. Caleb's a Kenizzite when we first meet him, and then he's an elder of the tribe of Judah. Right. So once he's an elder of the tribe of Judah, Judah is his father. He is a descendant of Judah. And that doesn't make sense to us because we're thinking DNA."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6103.65,"end":6104.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6104.54,"end":6159.68,"speaker":"Fr Stephen De Young","text":"And ethnicity and all of these later ideas. Right. But these father son relationships, these things were all actual social bonds, community bonds, and had nothing to do with. Right. This is why you run into this. You know, hey, I'll choose a non controversial example. You run into this all the time with whether people, whether Jewish people today are actually Jewish. You get these people with these theories like, no, these are actually this group of Europeans or that group there that converted to Judaism 800 years ago, 500 years ago, 1000 years ago, whatever. It's like, okay, they're still Jews. Even if those theories are true, their descendants are still Jews. Because that's how it works."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6160.96,"end":6170.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah. All right, so our final question for this half comes from Nathaniel, who has a question about Simon the Rock Bar. Jonah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6172.08,"end":6190.69,"speaker":"Fr Stephen De Young","text":"Good evening, fathers and bless. I would just like to ask a single question. It's not related to anything we're talking about. I'm sure if Peter is not the Rock. Why name him Peter Cephas? You know, what have you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6192.21,"end":6197.01,"speaker":"Fr Andrew Stephen Damick","text":"All right, I know you like to call him Rocky or the Rock. Simon the Rock. Bar Jonah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6197.01,"end":6198.93,"speaker":"Fr Stephen De Young","text":"Simon the Rock. Bar Jonah, yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6199.57,"end":6221.22,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean. I mean, what's. I think is the assumption in Nathaniel's question is, if he's not the Rock, why call him the Rock? Well, obviously, he is the Rock. The question is, what does the Rock mean? Or Rocky? What does it mean in these various contexts?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6221.94,"end":6228.38,"speaker":"Fr Stephen De Young","text":"Right. I mean, I'm assuming he's appealing to the passage the on this rock, I will build my church. Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6228.38,"end":6228.82,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6229.78,"end":6232.34,"speaker":"Fr Stephen De Young","text":"He was called Peter before that, right?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6233.46,"end":6234.1,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6234.18,"end":6264.43,"speaker":"Fr Stephen De Young","text":"So there is no account of this. Right. You could be an ardent traditional Roman Catholic. Right. That's not why he was called that. Right. That's Christ making a play on words between his name and what he's saying. And then you can interpret that. However, basically, I hate to break it to you, but it's the same reason Rock, the Dwayne Johnson is called the Rock. It's a nickname."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6264.83,"end":6265.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6266.12,"end":6274.04,"speaker":"Fr Stephen De Young","text":"Kephos basically means Rocky, like Rocky Balboa. Like, so what."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6274.04,"end":6276.76,"speaker":"Fr Andrew Stephen Damick","text":"So is the nickname like a tough guy nickname just like it is now?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6277.16,"end":6278.6,"speaker":"Fr Stephen De Young","text":"Yes, yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6278.76,"end":6280.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6282.04,"end":6294.92,"speaker":"Fr Stephen De Young","text":"People called him Rocky even though that wasn't his name, because he was a hard man. He's a hard man. And you kind of see that borne out, Right. When you read about him in the Gospels."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6295.88,"end":6296.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6296.16,"end":6328.94,"speaker":"Fr Stephen De Young","text":"Let me grab this sword and try and cleave this guy's head in half. And if you read it in the Greek, he was trying to kill that guy. He wasn't sitting there with, like, a rapier, like, I'm gonna take his ear off as a warning, like a little surgical strike. He was trying to cleave that fool's skull and just took off an ear. Right. Because he missed, like. So. Yeah. So he comes off as a Rocky kind of guy. Right. When you read the text of the Gospels, that's how he got that nickname."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6329.02,"end":6338.62,"speaker":"Fr Andrew Stephen Damick","text":"There are ways. I mean, there are ways that some of the church fathers interpret him as the Rock in the sense of, like, something greater than that. Right. But, well, yeah, that doesn't."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6338.86,"end":6341.02,"speaker":"Fr Stephen De Young","text":"When he got it. Yeah, when he got the name."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6341.02,"end":6371.92,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And that doesn't necessarily equal papal supremacy. That's one of the things. It's like, look, you know, Peter can be the Rock all day long, even in this big, like, almost, you know, papal supreme, you know, in this supreme sense. But I don't know why this turned out to be an episode with, like, lots of Roman Catholic stuff in it, but it's just how it worked out. That doesn't mean that the Pope of Rome is Peter's exclusive successor."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6372.56,"end":6372.96,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6373.44,"end":6377.46,"speaker":"Fr Andrew Stephen Damick","text":"It doesn't mean that. It doesn't mean that. It doesn't mean that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6377.46,"end":6397.78,"speaker":"Fr Stephen De Young","text":"But you could. You could. And you could live up to a nickname you get as a kid in various ways. Right? Like, so, yeah, you could say, yeah, he became a rock, right. He became a pillar as St. Paul refers to him of the Church. Right. He became, you know, these things. But when he got the nickname, he's probably just a tough kid."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6399.54,"end":6400.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6401.14,"end":6402.94,"speaker":"Fr Stephen De Young","text":"It's some fights in Galilee, you know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6402.94,"end":6435.58,"speaker":"Fr Andrew Stephen Damick","text":"And famously, of course, and this is what Nathaniel's alluding to, there are patristic interpretations, you know, the rock on which Christ builds the church. Some will say it's Peter. Again, that doesn't mean papal supremacy. Some will say it's the confession that he just gave, you know, that he is the Christ, the son of the living God. You know, there's all kinds of things that people. Some will say Jesus is the rock. And of course, St. Paul very famously says the rock was Christ, you know, so there's. There's various ways of interpreting it that don't equal papal supremacy. So the fact that he has this nickname."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6435.97,"end":6501.11,"speaker":"Fr Stephen De Young","text":"To put a finer point on this. To put a finer point on this. And this is worth saying, and this is not a shot at anybody. This is just trying to clarify the issue, right? Because I know we probably have Roman Catholic listeners who don't entirely understand the orthodox position on the papacy. Right. We believe in primacy amongst bishops. We even believe in Petrine primacy among bishops. We believe in the primacy of the Petrine seas, and we believe in the primacy of old Rome in particular. What we disagree with is the idea that the Bishop of Rome has universal jurisdiction over every church in the world. That's what we disagree with. And so to make this clear, right. Because again, I don't think most Roman Catholic listeners understand how it works in the Orthodox Church. In the Orthodox Church, if the Patriarch of Constantinople. Okay. Wanted to walk into my parish."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6502.95,"end":6503.23,"speaker":"Fr Andrew Stephen Damick","text":"On."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6503.23,"end":6516.71,"speaker":"Fr Stephen De Young","text":"A Sunday and celebrate the liturgy with me. Okay. Patriarch of Constantinople, our current Primate of the Orthodox Church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6516.71,"end":6517.11,"speaker":"Bethany","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6517.11,"end":6521.51,"speaker":"Fr Stephen De Young","text":"I love primate. That just cracks me up because it's like we're ruled by apes. But anyway."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6524,"end":6525.52,"speaker":"Fr Andrew Stephen Damick","text":"It just means first, everybody."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6525.76,"end":6537.12,"speaker":"Fr Stephen De Young","text":"The current Primate of the Orthodox Church, the Ecumenical Patriarch, he wants to come and serve liturgy in my parish here in Louisiana on Sunday. Okay. He has to get permission from my bishop."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6537.76,"end":6539.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6541.28,"end":6541.84,"speaker":"Jason","text":"Yep."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6543.12,"end":6546.96,"speaker":"Fr Stephen De Young","text":"Even though he has primacy. He has to get permission from my bishop."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6546.96,"end":6549.28,"speaker":"Fr Andrew Stephen Damick","text":"And he's not even in the Roman Catholic Church."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6550.18,"end":6578.17,"speaker":"Fr Stephen De Young","text":"Right. If the bishop of Rome wanted to come and celebrate Mass at any church, any Roman Catholic church in Lafayette, he could just walk in and do it anytime he wants. And if he decided he really liked that church, he could take it out of its diocese and make it part of his see and make it a basilica. That's the difference with that's what universal jurisdiction means."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6578.25,"end":6588.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I was going to say that like the ecumenical patriarch is because you're in an Antiochian parish, he's not even in a position to depose your bishop that he couldn't even."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6588.05,"end":6588.29,"speaker":"Bethany","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6588.29,"end":6588.77,"speaker":"Fr Stephen De Young","text":"No, he has."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6588.77,"end":6588.93,"speaker":"Jason","text":"No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6588.93,"end":6589.41,"speaker":"Fr Stephen De Young","text":"Say it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6589.41,"end":6589.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6590.57,"end":6596.29,"speaker":"Fr Stephen De Young","text":"If my bishop says to him, no, you can't go and serve liturgy there in Lafayette, Louisiana, that's it. He can't."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6596.29,"end":6600.82,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep. All right. Well, on that note, we're going to wrap up this half of this pre recorded episode."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6601.45,"end":6619.05,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6622.09,"end":6701.62,"speaker":"Announcer","text":"During one of the darkest times in recent history, God gave us a saint. This saint had to be someone stubborn, stubborn enough to outshine evil even when confronted with it face to face. But how did St. Maria become a person whom God could inspire, help and guide during such a dark time? How did she wrestle with her own temptations and allow Christ to grow brightly in her soul? Stubborn Love by Rita Thola is one book in three parts written for young people. Her Life tells the story of Mother Maria Skabstova of Paris from birth to death. The first section of the book is accompanied by graphic novel style illustrations to help the young reader imagine her work, family and adventures. Her writings comes next, a smattering of some of the notes and thoughts that shaped her. Your Life is the final section where the reader is is challenged to consider his or her place in the world. Using Mother Maria's life and sayings as a springboard for journal entries and also some group study questions to answer. Pray for us, dear Mother Maria. You can find this book@store.ancient faith.com Again, that is store.ancientfaith.com we're back now with."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6701.62,"end":6716.66,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346 that's 8-55-AF-ADIO."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6718.58,"end":6749.39,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back, everybody, to this pre recorded episode of the Lord of Spirits podcast. It's Christmas time. Merry Christmas, everybody. We just have five more questions that we're going to be pulling from our voicemails. These are the last five that our intern pulled out of the pile and we're wiping the slate clean of all those old speak pipes. So if you don't hear your question tonight, that means we have thrown it into the memory hole. But, you know, you could, you could contact us again. Leave another voicemail. We, we'd like to hear from you, et cetera, et cetera."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6749.71,"end":6750.83,"speaker":"Fr Stephen De Young","text":"Or call in live."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6750.99,"end":6756.43,"speaker":"Fr Andrew Stephen Damick","text":"Call in live. That's always the best way. Then you can hear Father Stephen yell at you directly over the Internet."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6757.07,"end":6757.55,"speaker":"Bethany","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6757.55,"end":6757.87,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6757.87,"end":6758.8,"speaker":"Fr Stephen De Young","text":"Or make fun of you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6758.87,"end":6760.07,"speaker":"Fr Andrew Stephen Damick","text":"That's right, exactly."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6760.15,"end":6768.15,"speaker":"Fr Stephen De Young","text":"Oh, by the way, I forgot to that the person who left the message from Kalamazoo, I forget what his first name was."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6771.27,"end":6774.47,"speaker":"Fr Andrew Stephen Damick","text":"The second half, I can't remember which one was from Kalamazoo."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6774.47,"end":6774.79,"speaker":"Jason","text":"No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6774.79,"end":6781.39,"speaker":"Fr Stephen De Young","text":"Okay. But anybody you run into with the last name Huizenga, say hi to them for me because they're my cousin."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6781.39,"end":6790.6,"speaker":"Fr Andrew Stephen Damick","text":"There you go. There you go. I mean, every time I've been either to Grand Rapids or Kalamazoo and I look around, there are people, I'm like, oh, this person's definitely related to Father Steve."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6791.64,"end":6798.2,"speaker":"Fr Stephen De Young","text":"Well, Kalabazu in particular, because that's where my family all settled when they came from the Netherlands."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6798.68,"end":6800.2,"speaker":"Fr Andrew Stephen Damick","text":"How about that? That's the."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6800.28,"end":6802.12,"speaker":"Fr Stephen De Young","text":"So about a century ago now."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6802.12,"end":6814.42,"speaker":"Fr Andrew Stephen Damick","text":"Ground zero. All right, first question of this final half is from Alec, who? This is a continued reverberation of your talk at Pageau Fest."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6815.69,"end":6818.41,"speaker":"Fr Stephen De Young","text":"Oh, there we go. I got some great feedback about that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6818.81,"end":6876.01,"speaker":"Spencer","text":"My name is Alec. A long time listener, first time question sender. I listened to Father Steven's talk at Peugeot Fest and I listened attentively to the past two episodes. I have many questions and I have attempted to form a question that is the most representative of what could be. I don't know. Ten different questions. I understand that for identity to be preserved in eternity, our relationships to other persons will somehow be kept intact because they are integral to our identity. Using the language that has been explored in the past two episodes, how would we understand the scenario of someone who is a part of the resurrection of the just to have an eternal relationship with someone a part of the resurrection of condemnation? I know that some people use this line of thinking to say that all will eventually be saved. I am very coincidentally reading George MacDonald's unspoken sermons at this time as well, which could be informing my question. If you have any thoughts on him, I would be appreciative of those as well. Thanks, Alec."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6876.41,"end":6895.13,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean, George MacDonald, very famously a universalist, and probably C.S. lewis was his biggest fan. I think Lewis put together an anthology of bits from George MacDonald. Okay, so what about this?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6896.26,"end":6896.58,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6896.66,"end":6898.1,"speaker":"Fr Andrew Stephen Damick","text":"Relationships with the damned."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6898.5,"end":6926.58,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, if you want to say more about George McDonald, this is where I'm going to disappoint. So my dad was huge into CS Lewis, Tolkien. George MacDonald had all the stuff. Like, I read some CS Lewis when I was young. I've kind of barely read Tolkien, like the greatest hits, and I haven't read any George MacDonald at all. Like, that's totally just not my bag. I know, that's totally Father Andrew's bag."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6926.58,"end":6935.06,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I. Okay, I admittedly have. I've read some George. I was gonna say I've admittedly not read much. You would think that I would, but."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6935.22,"end":6936.22,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6936.22,"end":6944.5,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I've. I've appreciated some of the stuff that I've read, for sure. But yeah, no, I've never really made a study of George MacDonald. I haven't."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6944.5,"end":6962.68,"speaker":"Fr Stephen De Young","text":"There's a reason why for the. There's a reason why for the YouTube show, you had to go with the C tier. C tier co host. Right. Like, I'm just not into that stuff as much, so I'm not qualified. Landsman only returns your calls half the time, so who are you stuck with?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6962.84,"end":6978.94,"speaker":"Fr Andrew Stephen Damick","text":"I know. Even though on the Areopagus, it's literally a show about anything, we want it to be like we have no topic. Any. I mean, we do sort of. Kind of, but it's just sort of like the topic is us. We are the ones who are making it the show that it's."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6979.33,"end":6980.93,"speaker":"Fr Stephen De Young","text":"It's just. It's about vibes, man."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6981.01,"end":6981.61,"speaker":"Fr Andrew Stephen Damick","text":"The show's."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6981.61,"end":6982.81,"speaker":"Fr Stephen De Young","text":"It's a Vibes based show."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6982.81,"end":6986.53,"speaker":"Fr Andrew Stephen Damick","text":"Just Vibes. Vibes, yeah. Okay, so."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6986.77,"end":6988.29,"speaker":"Fr Stephen De Young","text":"So. But to the other."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":6988.69,"end":7019.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. In one sense, if you have a relationship with someone who is damned and you're among the resurrect, you know, the res. Not, you know, not the damned here among the resurrection of life, what does that mean? I mean, like, this is. That sounds so. Okay, that sounds very kind of abstruse. But here's another way of putting it. How happy would I be in the kingdom of God if my family are damned? You know, that would be another way of putting this question. Right, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7020.4,"end":7034.33,"speaker":"Fr Stephen De Young","text":"And so part of the underlying issue here is still this idea that people who are damned who face eternal condemnation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7034.49,"end":7034.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7035.85,"end":7059.53,"speaker":"Fr Stephen De Young","text":"Like somehow, like they didn't make the cut or something. Right. Like, like these were, these were all around good people, but just like, you know, they didn't quite accrue enough merit."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7059.53,"end":7061.81,"speaker":"Fr Andrew Stephen Damick","text":"Or, you know, it's like when I."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7061.81,"end":7066.41,"speaker":"Fr Stephen De Young","text":"Couldn'T get a committed immortal sin right before they got hit by a bus or just reprobate through no fault of their own."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7066.41,"end":7078.77,"speaker":"Fr Andrew Stephen Damick","text":"It's like when I couldn't get a Pell Grant worth thousands of dollars because my parents made $27 a year too much. I'm not kidding about that, by the way. $27 a year at all."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7078.77,"end":7080.37,"speaker":"Fr Stephen De Young","text":"I'm like, not bitter at all."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7082.93,"end":7088.75,"speaker":"Fr Andrew Stephen Damick","text":"It was just like that was the moment I was black pilled. No, just kidding."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7089.07,"end":7094.43,"speaker":"Fr Stephen De Young","text":"See, this is how I know you didn't have Dutch parents because they would have found a way to make that math work and not technically be lying."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7095.71,"end":7103.39,"speaker":"Fr Andrew Stephen Damick","text":"Right in my house. It's like, well, that's just how it is, son. I'm so sorry we can't change it. We've already filed our taxes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7110.99,"end":7137.39,"speaker":"Fr Stephen De Young","text":"But yeah, but then it's like. Right. And so part of. And I mean, I can't obviously rehearse here everything I'm saying, but think of the Onion story, right? Like if you had this important and godly relationship with a person, the idea would be that that would be one of the means that God would be using to save that person."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7139,"end":7141.48,"speaker":"Fr Andrew Stephen Damick","text":"Like spouses being sanctified by each other, as St. Paul says."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7141.48,"end":7191.03,"speaker":"Fr Stephen De Young","text":"Right, right. And so like, I don't. I mean, I can. You can come up with the hypothesis, right. Of just, you know, the people who, when we talk about the show, the people who were talking about who would end up in eternal condemnation. And this is why, like, even though I am obviously probably one of the things I'm still most well known for on the Internet is being opposed to universalism. If you actually listen to what we say on this show and what I say, local council of God and books and wherever else. Right. Like, of the two, I lean kind of toward universalism."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7191.03,"end":7198.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You often say things like, you know, and if. And if anyone is damned, I hope it's very few. Like, you often say that. Exactly those lines."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7198.85,"end":7214.05,"speaker":"Fr Stephen De Young","text":"Right. Like, and we have no assurance that there's going to be a certain number of people. But there is built into a lot of the Puritan. Right. Worldview we've absorbed from American Christianity, this idea that. No, most people."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7215.97,"end":7216.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7216.69,"end":7220.16,"speaker":"Fr Stephen De Young","text":"God created most people to end up in eternal torment."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7220.16,"end":7232.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean I mean, I was frankly, the kind of Christianity that I was raised with, believed that everyone is damned by default. You're born damned, period, and you have to do something to get out of that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7233.56,"end":7250.41,"speaker":"Fr Stephen De Young","text":"And only those 3,000 PRs are going to be saved. Right? Yeah. Yeah. And that's a whole skewed way of looking at this. Right? God didn't create humanity to damn humanity."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7252.01,"end":7253.61,"speaker":"Fr Andrew Stephen Damick","text":"Not even for his glory, huh?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7254.01,"end":7307.87,"speaker":"Fr Stephen De Young","text":"Right. No. How about John 3:17? Christ didn't come to condemn the world, but that the world might be saved through him. Right. Like this is. This is basic Christianity stuff. God loves people, all people. He takes no delight in the death of a wicked man, but rather that he should turn and live. That's the Old Testament mean, God saying that. Right. Like, that's not who our God is. The most true full expression of who our God is that we have received as humans is our Lord Jesus Christ, God incarnate, praying and asking God to forgive the people who are murdering him."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7310.43,"end":7310.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7311.39,"end":7317.23,"speaker":"Fr Stephen De Young","text":"This is not a God who's interested in sending 99% of humans who have ever lived to hell."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7317.47,"end":7323.79,"speaker":"Fr Andrew Stephen Damick","text":"I thought you delighted in people burning for all eternity, Father Stephen, you infernalist."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7324.19,"end":7328.27,"speaker":"Fr Stephen De Young","text":"Exactly. Because if you're not a universalist, there's only two binary options."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7328.27,"end":7328.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7329.55,"end":7332.91,"speaker":"Fr Stephen De Young","text":"And I say to you, universalists only sits. Steal it. Absolutes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7336.99,"end":7337.39,"speaker":"Announcer","text":"The."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7341.63,"end":7363.04,"speaker":"Fr Stephen De Young","text":"Right. So the, the. Yeah. So, I mean, you could come up with this hypothetical situation where there's this. The people who end up in eternal condemnation are not lost souls. They're like. They've become demonic and subhuman."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7363.28,"end":7366.32,"speaker":"Fr Andrew Stephen Damick","text":"They're monsters. They've become monsters."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7367.2,"end":7439.49,"speaker":"Fr Stephen De Young","text":"Right. And I mean, sure, you know, I'm guessing there's a family member who still loved Richard Ramirez. You know, like Charles Manson had his groupies who liked him, you know, like, you know, but it seems hard to me to be like, well, you know, Richard Ramirez, dad, could never be happy in the kingdom of God. Because, you know, Richard, you know what I mean? Like this, like, people don't go to hell accidentally. People don't go to hell because they mess up. People don't go to hell because they're sad or depressed or mentally ill. Okay? That's not how you end up under God's eternal condemnation, if anybody does at all. It's not by accident, it's not by misadventure, it's not because of illness, it's not because of the hardships of life driving you there. Right. That's not how God works."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7439.89,"end":7450.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, I think it's important to underline again, as we already have, what is salvation? It's not just whether you get into the kingdom or not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7450.85,"end":7451.25,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7451.41,"end":7458.29,"speaker":"Fr Andrew Stephen Damick","text":"It's about becoming equal to the angels. And it's not like, well, you're not equal to the angels in every possible sense, so therefore you're in hell."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7459.7,"end":7459.94,"speaker":"Bethany","text":"No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7462.42,"end":7480.26,"speaker":"Fr Andrew Stephen Damick","text":"There'S a hierarchy in the kingdom of heaven. There are greater and lesser people in the kingdom of heaven. Jesus talks about some being least, some being greatest. I mean, that's clearly a thing. And even those, I think. Is it St. Paul that says those who are rescued as if by fire or the skin of their teeth or something like that?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7480.42,"end":7483.46,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But they're still saved."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7483.78,"end":7484.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7485.74,"end":7485.98,"speaker":"Jason","text":"Not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7486.14,"end":7493.02,"speaker":"Fr Andrew Stephen Damick","text":"Not frankly as much as some other people. Yeah, as much as. I mean, there are. You can be more or less."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7493.02,"end":7526.97,"speaker":"Fr Stephen De Young","text":"You don't experience all the joys and all the things that other people do. Yeah, we know. That's just true about life. Yeah, right. That's true about life. You make bad decisions in life, you're going to have a harder life in general. Not always, but in general. Right. So, you know, like, this is kind of basic stuff. Right. But like the fact that you made bad decisions, like it had a hard life, that's not something God needs to punish for eternity."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7528.65,"end":7529.77,"speaker":"Fr Andrew Stephen Damick","text":"It'll get burned away."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7531.05,"end":7531.53,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7532.41,"end":7539.07,"speaker":"Fr Andrew Stephen Damick","text":"Okay, now to take it in a very different direction. Spencer has."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7539.07,"end":7540.19,"speaker":"Fr Stephen De Young","text":"That was something completely different."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7540.19,"end":7559.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, yeah. This is quite different. Spencer wants to know whether Eglon. Thank you for making so many references this time that I'm actually getting. Spencer wants to know whether Eglon was actually fat or handsome."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7561.19,"end":7588.36,"speaker":"Spencer","text":"Greetings, podfathers. This is Spencer in South Carolina. The book of judges says that Eglon was a very fat man. And that pays off later with some gory details. I've noticed, however, when reading translations of the Greek, aside from the Orthodox study Bible, it says instead that Eglon was a very handsome man, which is a different adjective. That doesn't set up the payoff with the gory details. I was wondering if you could provide some insight on what happened there."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7589.08,"end":7591,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is a straight up translation question."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7591,"end":7592.68,"speaker":"Fr Stephen De Young","text":"Por que dolos dos?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7592.84,"end":7595.24,"speaker":"Fr Andrew Stephen Damick","text":"He could be good looking and fat."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7595.8,"end":7596.28,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7599.24,"end":7617.48,"speaker":"Fr Andrew Stephen Damick","text":"I kind of wondered if you might go there with that. And I checked, actually, this is one that I looked up. I was like, I'm not going to just throw this out there. I want to look up this up for myself. Because I'd never. It had never. I'd never noticed this before. So I looked up in the versions of the septuagint that I have the translation of the Septuagint I have here. And sure enough, they all say hands, except it's judges."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7617.48,"end":7618.16,"speaker":"Fr Stephen De Young","text":"So it's not the."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7618.16,"end":7623.65,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, yeah. Judges. Yeah. It's true. The Old Greek. Excuse me, the Old Greek."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7625.17,"end":7626.21,"speaker":"Fr Stephen De Young","text":"How dare you, sir?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7630.05,"end":7651.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, is it. Is there any chance that the Old Greek translators mistook the Hebrew, or are they just looking probably at a different tradition, a different manuscript tradition? You have to look up what the Hebrew word there is."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7652.38,"end":7655.34,"speaker":"Fr Stephen De Young","text":"No, it's because we know, like, for."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7655.34,"end":7677.11,"speaker":"Fr Andrew Stephen Damick","text":"Instance, there's a line in the Psalms which says, shall physicians raise them up, maybe praise them? And I remember you pointing out that the Greek translator mistook a Hebrew word, rephaim, for a word that actually sounds very similar and means doctor, physician. Yeah. So, like, is this that kind of thing or is this."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7677.27,"end":7685.51,"speaker":"Fr Stephen De Young","text":"Is that kind of. So the. The word that's used to describe him as corpulent."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7685.99,"end":7687.11,"speaker":"Fr Andrew Stephen Damick","text":"I knew you would say that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7687.75,"end":7698.31,"speaker":"Fr Stephen De Young","text":"Shall we say, is also a word that when used to describe a baby."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7700.8,"end":7701.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7702,"end":7706.96,"speaker":"Fr Stephen De Young","text":"Can have the meaning of. It's like what we would say. It's a cute baby. It's a good looking baby."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7706.96,"end":7707.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7708.48,"end":7709.44,"speaker":"Fr Stephen De Young","text":"Right? Like a child."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7709.76,"end":7710.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7711.84,"end":7719.92,"speaker":"Fr Stephen De Young","text":"When it's used about an adult, it means more obese. Right. When it's used about a child, it means more like healthy. Right. Good looking."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7720.08,"end":7721.28,"speaker":"Fr Andrew Stephen Damick","text":"That fat little baby."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7722,"end":7734.57,"speaker":"Fr Stephen De Young","text":"Right. And so they translated it into Greek as handsome. So big Baby Eglon. I guess we could call him Baby Face."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7735.05,"end":7740.25,"speaker":"Fr Andrew Stephen Damick","text":"Baby Face Eglon. Yeah, that's it. That's it. That brings it all together."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7740.89,"end":7741.25,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7741.25,"end":7749.69,"speaker":"Fr Andrew Stephen Damick","text":"Baby Face. Okay. Sort of throw out nicknames. Okay. So this one comes from Sarah, who has a question about the Holy Spirit."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7751.62,"end":7840.79,"speaker":"Sarah","text":"Fathers, I have a question that I haven't been able to get answered anywhere else, and that is that I believe that Scripture teaches that women are the created representation of the Holy Spirit. And I'm wondering if that's reflected anywhere in Orthodox thought. I derive this from a bunch of different parts of Scripture, but I guess there are three that I would want most clarity on. One is that when Eve is created, she's referred to as a helper, appropriate to Adam. And that term, which, excuse my pronunciation, is Ezra or Ezra can geto, is the same term that's used then throughout the Old Testament for God who helps, which I would interpret as the Spirit, the helper. I again then see it in Proverbs 8, where Lady Wisdom describes herself in the same terms that God describes himself to Job in the End of Job. And I would suggest that that Is this picture of the Spirit as Lady Wisdom. And then in again, when Jesus gives the parable of the woman and the coin bookended between two parables of God who saves. In that instance, I think he's talking about the Spirit. And obviously this is very abbreviated version of that. But I'm just wondering if there's any legitimacy there and if you could speak on whether or not orthodox thought encompasses this. Thank you so much. Really appreciate everything you do."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7841.19,"end":7855.84,"speaker":"Fr Andrew Stephen Damick","text":"All right, what do you think? I mean, it's certainly the case that the grammatical words for spirit in multiple languages, certainly Greek, I don't know about the Hebrew, are grammatically feminine."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7857.04,"end":7858.12,"speaker":"Fr Stephen De Young","text":"Actually, the opposite."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7858.12,"end":7858.88,"speaker":"Fr Andrew Stephen Damick","text":"Oh, it's actually."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7859.28,"end":7867.76,"speaker":"Fr Stephen De Young","text":"It's feminine in Hebrew. It's often neuter. Most often neuter in Greek. There is no neuter in Hebrew."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7867.92,"end":7915.6,"speaker":"Fr Andrew Stephen Damick","text":"All right. But as we've mentioned before, grammatical gender doesn't necessarily have anything to do with human sex, which is the real traditional term for referring to male and female in humans. Just like, for instance, in French, table is feminine. What's feminine about a table? I don't know, But I don't know. I mean, is there something to this? Is it just sort of like associations? I mean, she starts off by saying that she thinks that women are the created representation. I think that was the term she used for the Holy Spirit. Or maybe it would be better to say that there are certain qualities that are used to describe women traditionally and also used to describe the Holy Spirit traditionally. What's going on with this?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7916.72,"end":7930.8,"speaker":"Fr Stephen De Young","text":"Right, so we need to key in on the fact that God, Right, God the Father. God does not have a biological sex."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7931.12,"end":7931.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7933.93,"end":7941.29,"speaker":"Fr Stephen De Young","text":"We refer to him as him and as the Father because he's told us his preferred pronouns in the Bible, and so we use them."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7941.53,"end":7941.93,"speaker":"Jason","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7941.93,"end":7961.13,"speaker":"Fr Stephen De Young","text":"I mean, kind of seriously, in this case. Sure. Right. Like, we aren't able to comprehend God. So we pare it back to God, the language that he's revealed to us concerning Himself, rather than making up our own and referring to him the way we want to refer to Him. I, by the way, am so woke that my pronouns are now it and it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7963.77,"end":7966.09,"speaker":"Fr Andrew Stephen Damick","text":"I will keep that in mind for future reference."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":7966.09,"end":8090.38,"speaker":"Fr Stephen De Young","text":"Okay, so this means that. And it's very clear in Genesis, both male, biologically male and biologically female humans are made in the image of God. Yeah, Right. And so I don't know what it would mean. So this is getting into trinitarian theology. I don't know what it would mean to say that someone is in the image of the Holy Spirit, in particular, in the sense that, like the Son, the Holy Spirit is the perfect image of the Father, but unlike the Son, who is incarnate and is biologically male, still after the resurrection, you wackos at Fordham, the. The Spirit is not incarnate. Right. So image sort of doesn't work the same way with humanity and the Spirit the way it works with the Son. But insofar as both the Son and the Spirit are the perfect image of the Father, that image wouldn't actually be different. Right. So the Holy Spirit is not the problem with the idea. She's advancing the difficulty with it. Right. I'm not saying it's a heresy or something. I'm just saying the difficulty with it is the idea that the Holy Spirit. That would require the Holy Spirit to be somehow finite. Like the Holy Spirit possesses certain qualities of God but not others. Or that the other persons of the Trinity do not possess those qualities in the same way that the Holy Spirit does. Right. See what I'm saying, how that would be a problem?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8090.38,"end":8091.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8092.74,"end":8126.6,"speaker":"Fr Stephen De Young","text":"So I don't want to go that far. But because the Spirit of God, Ruach, because it is grammatically feminine, when those more traditionally feminine aspects of God are discussed, that language kind of gravitates to language about the Spirit in the Hebrew scriptures. So it's not that those qualities. Right. It's not like only the Holy Spirit comforts people."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8127.96,"end":8128.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8128.32,"end":8131.64,"speaker":"Fr Stephen De Young","text":"Even though we call them the Son comforts no one. The Father comforts."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8131.72,"end":8132.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8132.04,"end":8181.14,"speaker":"Fr Stephen De Young","text":"Like, you're right. But that kind of language, because it is feminine, literally feminine language. Right. In Hebrew sort of aggregates to Ruach. Right. Which is. Which is grammatically feminine. And I think she's kind of going the wrong way with Etzer Connecto. Etzer is used helper, comforter. Not so much that part, but Connecto really literally means fits. And that is literally talking about the way it's starting at the level. It means at the literal level, men and women literally biologically fit together."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8181.94,"end":8183.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's talking about reproduction."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8184.26,"end":8186.5,"speaker":"Fr Stephen De Young","text":"Yeah. Without being overly graphic. They fit together."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8186.58,"end":8187.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8189.3,"end":8218.43,"speaker":"Fr Stephen De Young","text":"But then that's the literal level. Right. The meaning of Scripture is literal plus. Right. So obviously, then it would fit together in. Right. Emotional, spiritual, other ways beyond just the physical. Right. So, yeah. And so, I mean, she's seeing something that is legitimate. Just you got to be a little careful about how you try to sort of systematize."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8218.59,"end":8219.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8219.56,"end":8223.8,"speaker":"Fr Stephen De Young","text":"That in light of the Doctor, of the Trinity at all."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8223.88,"end":8229.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. Our next question comes from Jacobos, who has a question about music."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8232.28,"end":8243.08,"speaker":"Jason","text":"Greetings, fathers. Hailing all the way from the city of Iron, otherwise known as Birmingham, Alabama, it is I, Jacobos."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8243.48,"end":8243.96,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8244.28,"end":8313.3,"speaker":"Jason","text":"Shout out to St. Simeon's Orthodox Church, as well as an Honorable mention to St. Clement of Rome's mission in Rome, Georgia. I have a question regarding music. It has been mentioned before on this show that music was handed down to man via the fallen angels along other things such as metallurgy and fire. You have both mentioned why man wasn't ready for metallurgy and fire because both can easily lead to war and destruction. But I raised to you, why was man not ready for music? My homebrewed theory is that music can act as a particularly potent logismos, opening our minds with feeling and passion to feelings and ideas we would not normally be as subject to. I myself find that I cannot listen to wham's iconic hit Last Christmas without succumbing to the holiday blues. So what say you, fathers? Care to correct or expand upon my theory? Or mayhaps you will enlighten me to a completely new possibility? Only time will tell. Thank you."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8314.34,"end":8317.86,"speaker":"Fr Stephen De Young","text":"Well, music can lead to premarital sex, and that can lead to dancing."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8318.74,"end":8328.62,"speaker":"Fr Andrew Stephen Damick","text":"That's right, yes. What are the logis mi of George Michael and his band or the exclamation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8328.62,"end":8329.78,"speaker":"Fr Stephen De Young","text":"Point, George Michael, Greek."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8330.1,"end":8349.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, the short answer, right? Like Saint Irenaeus says this when he's talking about this, right? He says he connects music with sorcery and, you know, drugs. It's about seduction. It's about sorcery."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8349.31,"end":8350.43,"speaker":"Fr Stephen De Young","text":"Drugs, sex and rock and roll."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8350.43,"end":8351.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Drug, sex and rock and roll."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8352.27,"end":8355.39,"speaker":"Fr Stephen De Young","text":"Second century A.D. exactly, exactly."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8357.86,"end":8381.22,"speaker":"Fr Andrew Stephen Damick","text":"So is George Michael some kind of sorcerer, despite him telling everyone, you've got to have faith? Yeah, yeah. I mean, that's it, right? It's basically just. It's that association with demonic control over other people, specifically seduction, sorcery, all that kind of stuff."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8381.62,"end":8386.53,"speaker":"Fr Stephen De Young","text":"But I mean, beyond that, I mean, music is a very powerful tool."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8386.93,"end":8388.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8388.25,"end":8411.41,"speaker":"Fr Stephen De Young","text":"Like one of my back in Protestant seminary, one of my. See, this isn't as true as Orthodox people, but this was true at the Protestant seminary I was at. One of the professors would take us all to task. This will also date when I was there. But he would say, I bet not one of you can recite the Nicene Creed. But if I asked you for Britney Spears lyrics."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8413.56,"end":8415.56,"speaker":"Fr Andrew Stephen Damick","text":"Wow. At a seminary."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8416.52,"end":8423.12,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But it was probably true."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8423.12,"end":8426.44,"speaker":"Fr Andrew Stephen Damick","text":"I was gonna say that seminary should be thinking hard about their equipment if that's the case."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8428.76,"end":8432.28,"speaker":"Fr Stephen De Young","text":"Well, in the sense that. In the sense that. And fill in Pop song."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8432.28,"end":8432.56,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8432.56,"end":8433.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes, of course. Right, Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8433.88,"end":8483.13,"speaker":"Fr Stephen De Young","text":"Fill in pop song. Right. And most Protestants do not have the Nicene Creed memorized. Right. Like, let's be real. Depending on their church, they may have the Apostles Creed memorized. Maybe, but. Right. So. But he was making the point. Right. He's making the point that, like, I know some Britney Spears. I never tried to learn any Britney Spears lyrics. If anything, I tried not to. Right. Like fill in pop band here. Right. Like, when I make these musical references and pop culture sub references, I don't sit and watch things trying to find things to refer to later. It's just all in my brain. Right. Like, and a lot of it got there because it was set to music."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8483.21,"end":8489.98,"speaker":"Fr Andrew Stephen Damick","text":"Now someone's going to be checking at the end here and seeing if you're going to reference. Hit Me baby one more time in the. The closer."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8489.98,"end":8490.34,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8490.5,"end":8493.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay. I didn't think you would, but. But I never know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8494.74,"end":8508.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Could come from anywhere. But. Yeah, like this. And, you know, political jingles. Arius writing jingles."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8508.82,"end":8509.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8510.26,"end":8540.54,"speaker":"Fr Stephen De Young","text":"Theological jingles that are catchy earworms. Right. You can use music to. But all manner of ideas and all kinds of things shape the way people think and view things. We've talked about this when we were talking about the phenomenological world that we all actually live in and how that's shaped. Right. Remember we said the four things that shape it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8543.83,"end":8544.55,"speaker":"Fr Andrew Stephen Damick","text":"Is it a quiz?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8544.87,"end":8548.67,"speaker":"Fr Stephen De Young","text":"Art, language, art, music, language, ritual, music and ritual."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8548.67,"end":8549.75,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I remembered."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8550.31,"end":8555.51,"speaker":"Fr Stephen De Young","text":"Yes. Right. Just kind of in the wayback machine. But language, art, music and ritual. Music is one of those."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8555.59,"end":8556.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8557.51,"end":8563.03,"speaker":"Fr Stephen De Young","text":"Music can shape how you experience the world. Meaning music can literally change everything."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8564.07,"end":8564.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8564.51,"end":8566.79,"speaker":"Fr Stephen De Young","text":"And it's about how you perceive things."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8567.03,"end":8571.16,"speaker":"Fr Andrew Stephen Damick","text":"And it's not just the lyrics. Right. Like, there's a reason."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8571.56,"end":8572.04,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8572.28,"end":8574.16,"speaker":"Fr Andrew Stephen Damick","text":"That, you know, I don't know."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8574.16,"end":8575.88,"speaker":"Fr Stephen De Young","text":"Beethoven fans are going to come after me again."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8575.88,"end":8576.88,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, yes."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8576.88,"end":8577.4,"speaker":"Fr Stephen De Young","text":"Here we go."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8577.4,"end":8597.49,"speaker":"Fr Andrew Stephen Damick","text":"There's a reason that, like, for instance, I'm sure there is probably something called a church out there that's using death metal, but there's a reason that most Christians have not used music that sounds like that in their churches. And that's because the sound itself, not just the words, the sound itself, has an effect on the human person, you know?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8597.65,"end":8599.17,"speaker":"Fr Stephen De Young","text":"Well, you got to pick out death metal."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8599.17,"end":8601.33,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. It's just the thing that came to mind."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8604.05,"end":8620.05,"speaker":"Fr Stephen De Young","text":"THROATY SCREAMING but yeah, yeah. No, the music itself. And by the way, the reason I point out that Beethoven is pagan, because it was written in praise of paganism. And classical values, meaning pagan, Greek and Roman values. Right. Is that because I don't like Beethoven?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8621.1,"end":8621.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8621.66,"end":8630.78,"speaker":"Fr Stephen De Young","text":"Frankly, I like Beethoven too much. It gets my Germanic blood up. I want to go pillage Ireland or something. I don't know what's going on."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8630.86,"end":8633.1,"speaker":"Fr Andrew Stephen Damick","text":"Like, is that how I feel about Volsnow Saga?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8633.58,"end":8634.06,"speaker":"Bethany","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8636.14,"end":8668.4,"speaker":"Fr Stephen De Young","text":"So, but like, right. Like it's not. So. Yeah. Music is this very powerful thing. Right. And so, yeah, I mean, Wham's a little kitschy, but there are certainly songs that if you are in a depressive mood and you listen to them. Right. They can help make your world a lot like, darker, dismal place."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8668.48,"end":8669.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8669.12,"end":8677.05,"speaker":"Fr Stephen De Young","text":"Right. Like Wham and vice versa. Right. And people know this because people select music based on that."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8677.05,"end":8682.69,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Or they'll sometimes try to counter the way they feel. Like I'm feeling really down. So I need to have this. Right. You know?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8682.69,"end":8692.49,"speaker":"Fr Stephen De Young","text":"Right. And sometimes you want to wallow in it. Right. You just broke up, so you go listen to a bunch of breakup songs or you're in any mood at all. So you listen to the Cure's Disintegration, the best album ever."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8696.73,"end":8777.9,"speaker":"Fr Andrew Stephen Damick","text":"Okay, for our final. Our final question, Mike has a question about Burt Reynolds. Hi, Fathers. Mike from Pennsylvania. We just had Halloween, and I'm remembering back 20 years ago when I was a young guy in a college town and I chose to dress up as Burt Reynolds for the holiday. And I'm wondering that by doing so, was that a ritual participation in the character of J.J. mcClure? Was I being the Bandit? While I didn't drive across the country in a Trans Am or go on any ill fated canoe trips, I do feel that being burnt was kind of different. And I may have been harnessing some spiritual energy of Gator McCloskey. So do you think that by dressing up on Halloween, that could be a ritual participation? And since there's food and drink involved, does that make it somewhat of a sacrifice? Might this suggest some guide rails as to what the faithful choose to dress up as if they participate at all? And should we maybe make post Halloween exorcisms a regular part of orthodox campus ministry every November? Thanks. Looking forward to your thoughts. There we go. Another very Lord of Spirits kind of question on multiple levels. I mean, I'm always in favor of exorcisms. I mean, I think there should just be a lot more exorcisms."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8777.9,"end":8781.56,"speaker":"Fr Stephen De Young","text":"Somebody write that down. Mother Andrew is always in favor of exorcism."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8782.43,"end":8785.87,"speaker":"Fr Andrew Stephen Damick","text":"That's what I want. On my teacher, my Lord of Spirits theme."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8785.87,"end":8789.15,"speaker":"Fr Stephen De Young","text":"You're going to Set up the little booth in front of your house. Exorcisms. 10 cents."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8791.95,"end":8822.56,"speaker":"Fr Andrew Stephen Damick","text":"I mean, it's hard to tell how seriously Mike intends this question, but I'll say this. This is my off the cuff thought about this. Ritual participation. It's not always a super grave thing, right? Like you. If you go to a football game and you wear, you know, the jersey and you scream out the, the slogans and, you know, or paint your bare."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8822.56,"end":8824.2,"speaker":"Fr Stephen De Young","text":"Belly with the team colors, right?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8824.2,"end":8825.96,"speaker":"Fr Andrew Stephen Damick","text":"Like that is ritual participation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8825.96,"end":8827.32,"speaker":"Fr Stephen De Young","text":"But howl in the wind."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8827.48,"end":8845.79,"speaker":"Fr Andrew Stephen Damick","text":"In what? You know, in what? Or actually, I learned about this just recently, apparently. Tell me if you've heard of this. Jeep owners apparently have this thing that they do where they leave, like little rubber duckies on each other's vehicles. Have you heard of this?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8847.07,"end":8847.79,"speaker":"Fr Stephen De Young","text":"I have not."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8847.79,"end":8903.57,"speaker":"Fr Andrew Stephen Damick","text":"I have just. I just learned about this yesterday. And the reason I learned about it is because a friend of mine, he has like a Jeep Grand Cherokee, and apparently they are the ones that are like the bottom of the, the heap. And he had never gotten any rubber duckies. And his, his children had heard about him complaining about this, that he had never gotten any rubber duckies. And so, like, he came on his birthday to discover 17 rubber duckies. And then when he left church, then there was like 60 or something like that. So obviously people were, were really helping him out there. But that's a ritual. That's a ritual act. But what does it signify? Like, what is the actual participation? It's just sort of like, I see you. We're also. We're. We're both Jeep people, you know, like, just. That's all it means. Like, it's. There's nothing super deep about it. So not every ritual participation is something that grave. I don't know. What do you think? Smokey and the Bandit."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8904.61,"end":8919.25,"speaker":"Fr Stephen De Young","text":"So, yeah, so personally, right? I think everybody's way overdoing at most Halloweens. All you have to do is throw on a suit and some chucks and claim you're the tenth doctor. Like, it takes two seconds. Two seconds, people. Perfect costume."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8919.41,"end":8921.89,"speaker":"Fr Andrew Stephen Damick","text":"That would be weird to have everybody dressed up that way."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8923.01,"end":8941.34,"speaker":"Fr Stephen De Young","text":"There's going to be like a thousand David tenants at everybody's, like, holiday party now. But there is an element, right? So, you know, hey, this is, this is gonna be. Is this the last question?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8941.5,"end":8942.54,"speaker":"Fr Andrew Stephen Damick","text":"This is the last question."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8942.94,"end":8946.46,"speaker":"Fr Stephen De Young","text":"Okay, well, this is. This is gonna be kind of new content, I think, for the show."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8946.46,"end":8948.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh. I mean, a lot of this has."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":8948.7,"end":9045.46,"speaker":"Fr Stephen De Young","text":"Been relatively new kind of. We've, we've alluded a lot of it's been fine tuning. But yes, yes, you've kind of alluded to this at a couple points, like back at the Giants episode. But this gets at the role of masking and ritual, which is a thing, right? And was probably involved with most of what gets called, quote unquote, the Nephilim ritual was part of embodying the God or spirit was using masking masks. Because there is sort of a ritual process of attempting to take on at least aspects of a particular thing by dressing as it, posing as it. Right. Seeking to embody it in that kind of physical, representational way. Right. And. Well, again, this isn't something you could. You really do accidentally. But for example, right, I could see someone dressing as a Hollywood movie star and going to a Halloween party and letting themselves get out of hand with the drinking and the womanizing, maybe in the way that that particular character or actor does. Right?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9048.74,"end":9049.14,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9049.54,"end":9067.31,"speaker":"Fr Stephen De Young","text":"And this is, I mean, the reason people do cosplay. Well, okay, so there's like 80% of the people who do cosplay, and I'll just be super offensive to everybody. 95% of the women who do cosplay are doing it to make money from pictures and stuff."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9067.54,"end":9069.94,"speaker":"Fr Andrew Stephen Damick","text":"That's, that's probably true, actually."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9070.1,"end":9093.22,"speaker":"Fr Stephen De Young","text":"To try to get cast in acting jobs and that kind of thing. But the other piece of it, right, you know, the 12 out of shape Deadpools and Jokers, right, at your local comic book convention, right. They're doing that because they are looking for a kind of ritual participation."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9096.61,"end":9096.73,"speaker":"Brian","text":"In."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9096.73,"end":9118.85,"speaker":"Fr Stephen De Young","text":"This thing that they love, this world that they love, right? They're doing it because they want to be more like their hero, right? Or represent themselves as being sort of more like that. Here's. Here's going to be the spiciest take possibly that I have ever had on this program."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9118.93,"end":9119.45,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9119.68,"end":9120.36,"speaker":"Fr Stephen De Young","text":"Are you ready for it?"}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9120.36,"end":9121.04,"speaker":"Fr Andrew Stephen Damick","text":"I'm ready."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9121.6,"end":9127.2,"speaker":"Fr Stephen De Young","text":"The Joker sequel, the musical with Lady Gaga in it, I didn't watch is actually a really good movie."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9129.04,"end":9131.68,"speaker":"Fr Andrew Stephen Damick","text":"I didn't watch. I didn't watch it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9131.84,"end":9139.8,"speaker":"Fr Stephen De Young","text":"Yeah, it's actually a really good movie and I am the only one who thinks so. I think it's unironically a good movie because I've never been Quentin Tarantino. Tank."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9139.8,"end":9142.64,"speaker":"Fr Andrew Stephen Damick","text":"I didn't even know it existed, now that I think about it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9142.96,"end":9261.82,"speaker":"Fr Stephen De Young","text":"Oh, yeah, they made a sequel to the Joker movie and it's a musical. But this is part. And the reason I think it's such a good movie is that this is what it's about. It's about the way an identity, a mask, a costume, right? Takes on a life of its own that's separate from the person wearing it, even if it's the person who created it. And then what that relationship is and what it does to people who then adopt it, right? And so, yeah, there is something there, right. I don't think you need to be scared that like, you know, all of a sudden you're going to be unable to chew gum like a normal person. You're just going to chomp at it with your mouth open because you're dressed as Burt Reynolds, just de facto or that kind of thing. But there is something there, right? And I think here's an obvious place where that applies to Halloween costumes. If we want to stick right to the question, look at most women's Halloween costumes. Oh yeah, yeah, right. Like, what's that all about? They're all kind of sexy. Fill in the blank. And some of the blanks get filled with disturbing things, right? There is something going on there, right? You are dressing for something or to express something or to embody something, Right. And so those kind of things are not unimportant."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9266.46,"end":9300.71,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, this has been our our Christmas time pre recorded episode. Thank you very much everyone for listening. That's our show. Thanks especially to Jonathan Britain or Britain, I'm not sure which it is for the 8 bit version of our opening theme. We were not live this time, but we'd still like to hear from you. You can email us@lordofspiritsandancientfaith.com you can message us through our Facebook page. You can leave a voicemail as all these people did@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need to need help to find a parish, go to orthodoxintro.org and join."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9300.71,"end":9314,"speaker":"Fr Stephen De Young","text":"Us for our live broadcast on the 7th, 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. When I see a man chilling with his dog in the park, I approached him very slowly with my heart full of fear, looked at his dog. It's an ill reindeer."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9314.48,"end":9325.52,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, follow our page, join our discussion group. You can leave those reviews and ratings in all the appropriate places and share this show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9326.08,"end":9342.17,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to Ancient Face Support and help make sure we and lots of other AFR podcasters stay on the air. And then I was ill. And because the man had a beard and a bag full of goodies. 12 o' clock it neared, so I turned my head a second and the man was gone. But he must have dropped his wallet smack dead on the lawn."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9342.57,"end":9346.49,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. God bless you. Merry Christmas and a happy New Year."}
{"episode_id":"LOS - #107 - 2024-12-26 - Pantheon and Pandemonium XIV - Asynchronous Q&A Dec 2024","start":9350.17,"end":9387.47,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
