{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":0.4,"end":65.03,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation. This the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":65.67,"end":91.59,"speaker":"Fr Andrew Stephen Damick","text":"Hey, good evening, giant killers, dragon slayers and hammers of hydras. You are listening to the Lord of Spirits podcast and it is episode 119. My co host, Father Stephen DeYoung, the half or homunculus horker, is with me. Straight from the swamp in Lafayette, Louisiana. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, perched precariously atop the arcane tower of of podcasting, hovering dozens of stories above a disused gateway to the underworld."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":91.91,"end":104.39,"speaker":"Fr Stephen De Young","text":"You know, I like the voice of Steve, but one of these anniversary episodes. Yeah, I think just for one episode, we need to do the opening with AI Morgan Freeman. I'm just throwing that out there."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":105.27,"end":111.51,"speaker":"Fr Andrew Stephen Damick","text":"I will see what I can do. I will see what I can do. I could just do my best Morgan Freeman impression."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":112.9,"end":128.82,"speaker":"Fr Stephen De Young","text":"No, that would probably not be good. Or if you want an even deeper cut, we could do like AI Harrison Ford and have it be like the theatrical cut of Blade Runner and just make the show worse."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":129.3,"end":172.21,"speaker":"Fr Andrew Stephen Damick","text":"Nice. Wow. So if y' all are listening to us live, you can call us at 855-237-2346 and you can talk to us and we'll get to your calls beginning in the second half of the show. And tomor Mike Marzipan Degan will be taking your calls. Last time on the Lord of Spirits podcast, we talked about the authority of Moses as it was passed on in succession from him to Joshua and then to the Sanhedrin, the elders of Israel. And this time. So this is a two parter, we're turning to the authority of the apostles and their successors. So are They, I mean, are they connected in some way? Is. Is the authority of the apostles from Moses."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":175.89,"end":176.61,"speaker":"Fr Stephen De Young","text":"Kinda."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":176.93,"end":177.57,"speaker":"Fr Andrew Stephen Damick","text":"Kinda."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":178.37,"end":181.09,"speaker":"Fr Stephen De Young","text":"So yeah. This is the second part of a two parter."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":181.17,"end":182.01,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":182.01,"end":200.94,"speaker":"Fr Stephen De Young","text":"This episode is not itself a two parter. Like we're not going. We're not going full Thomas Aquinas and like, you know. Objection. Part one. Part one of part two. Part two of part two. Right. We're not doing that with you. Right. This is just two of two. And now I need a Chuck Woolery drop in."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":201.34,"end":203.58,"speaker":"Fr Andrew Stephen Damick","text":"Oh man. Is he still alive?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":204.22,"end":206.94,"speaker":"Fr Stephen De Young","text":"He is. He's become a right wing pundit."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":208.06,"end":208.94,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":208.94,"end":211.5,"speaker":"Fr Stephen De Young","text":"I mean like D tier right wing pundit. Like."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":211.5,"end":211.98,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":212.54,"end":213.02,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":213.58,"end":214.94,"speaker":"Fr Andrew Stephen Damick","text":"Who could have predicted that?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":215.5,"end":220.26,"speaker":"Fr Stephen De Young","text":"Yeah, I guess seeing all those bad dates go down, I mean, you could."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":220.26,"end":229.49,"speaker":"Fr Andrew Stephen Damick","text":"Have just become a. I don't know how you would classify Pat Sajak these days, but he's sort of a culture critic. But a friendly culture critic, you know?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":229.49,"end":237.93,"speaker":"Fr Stephen De Young","text":"Yeah. I think Chuck Woolery saw all these just horrible relationships in modern dating and said we need to get back to some traditional values."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":237.93,"end":239.21,"speaker":"Fr Andrew Stephen Damick","text":"Went full trad, huh?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":239.77,"end":247.69,"speaker":"Fr Stephen De Young","text":"Yeah, I think that's what happened. Or he was broke and Bill Riley offered him some money. I don't know, something like that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":248.17,"end":251.69,"speaker":"Fr Andrew Stephen Damick","text":"I think this might be our first Chuck Woolrey reference and in the whole show."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":252.01,"end":252.89,"speaker":"Fr Stephen De Young","text":"It is possible."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":253.45,"end":259.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't know. Super fans. Let us know. Have we mentioned Chuck Woolery before? It's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":259.77,"end":271.53,"speaker":"Fr Stephen De Young","text":"I'd be surprised if I haven't made some kind of 2 and 2 reference at some point. But yeah, yeah. Chuck Woolery was like the upscale new generation dating game."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":271.69,"end":276.01,"speaker":"Fr Andrew Stephen Damick","text":"No, he actually, he is dead as of November."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":276.74,"end":277.7,"speaker":"Fr Stephen De Young","text":"Oh, he just died recently."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":278.18,"end":279.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he was 83."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":280.42,"end":281.14,"speaker":"Fr Stephen De Young","text":"There we go."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":281.54,"end":282.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":282.26,"end":290.06,"speaker":"Fr Stephen De Young","text":"Well, at the end of his life he had a brief resurgence as a. Yeah. Tier right wing radio personality and he."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":290.06,"end":303.37,"speaker":"Fr Andrew Stephen Damick","text":"Apparently also worked as a wine consultant for a while in Columbus, Ohio. Huh. And. And since I'm looking at his Wikipedia entry as one does, he served aboard the USS Enterprise. The. The aircraft carrier. How about that?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":304.17,"end":314.17,"speaker":"Fr Stephen De Young","text":"See, this is what people tune in for. They're not really interested in theology. They want to hear Father Andrew Googling D list celebrities of the late 80s."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":314.57,"end":321.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Love connection. He did Wheel of Fortune too. Like Pat Sajak for a while in the late 70s."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":321.17,"end":328.81,"speaker":"Fr Stephen De Young","text":"Yeah, no, he was like. So, yeah, so people forget that like the Dating Game was actually kind of a game show."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":329.6,"end":331.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, absolutely. Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":331.84,"end":335.28,"speaker":"Fr Stephen De Young","text":"And Love Connection, likewise. They followed the game show model."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":335.76,"end":336.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":336.56,"end":348.08,"speaker":"Fr Stephen De Young","text":"But Love Connection, as far as I know, unlike the Dating Game and Unlike the reality show Cheaters, no one was ever killed."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":349.28,"end":361.7,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Well, that's. Yeah. Wow. And apparently, see, this is something I also didn't know. He had a musical career in psychedelic pop and in country. I'm learning all kinds of fun things today."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":362.42,"end":376.58,"speaker":"Fr Stephen De Young","text":"Yeah. So I'm just going to go ahead and get us back to talking about the authority of Moses, because if I wait for you to come up with a segue from Chuck Woolery to that, we know that's not going to happen anytime soon."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":377.3,"end":381.3,"speaker":"Fr Andrew Stephen Damick","text":"Did Chuck Woolry lay hands on Pat Sajak? Call in, let us know."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":381.94,"end":388.43,"speaker":"Fr Stephen De Young","text":"That can be interpreted a lot of ways too. Like that could be a who would win in a fight kind of thing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":388.43,"end":389.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":389.27,"end":786.44,"speaker":"Fr Stephen De Young","text":"I suppose now say Jack, because he's alive. But yes, indeed, you know, in a previous era. But anyway, so, yeah, last time we were talking about Moses and sort of the nature and structures of the authority that Moses had, which is not necessarily the way a lot of people think about it. Like, yeah, Moses is a prophet and Moses was the leader of Israel. But the particular emphases that Mosaic had this unique authority to make rulings right, to take what God had revealed and said to him and then apply it authoritatively in the life of the people of Israel, both in response to questions, resolving disputes, and generally laying out the path in different circumstances. Like, we pointed to the way Passover was celebrated when they were celebrating it in a camp in the wilderness versus how it was celebrated by Moses Instructions once they were in the land and settled, when those new sort of practical realities took hold, he reapplied the same commandments from God to that sort of new situation. And in both cases, it was equally, equally authoritative. And we talked about how that authority didn't sort of end with Moses. This wasn't just sort of like, okay, well, Moses made all these rulings and we recorded them in the Torah. And so now we're good. All questions answered, all disputes resolved. Everything is totally clear. Nothing will ever have to be applied because society will never change in any fundamental way. And so there is, as God promised, a succession of. Of prophets after him. We talked about their qualifications. We also talked about how they had that same authority to take and to apply. And in fact, that what you have sort of codified in the rest of the Old Testament in different ways, you know, whether we're talking about psalms or proverbs or the prophets proper or what are sometimes called the historical books or the former prophets, those are all in various ways, taking the revelation of God in the Torah, the Revelation of God to Moses that was shared by his successors and applying it to the history of Israel, to everyday situations in the life of Israel, sort of in different ways, in different contexts. And we talked about how there was a sort of physical manifestation of this authority being handed down from Moses. This was not just a purely like, oh, hey, look, this guy has shown up and he seems kind of like Moses. He has sort of charismatic authority, right? But that there was an actual laying on of hands that we see begin with Moses laying his hands on Joshua and passing that authority to him in a very literal way. So there was both a, what we might compare to a soul of the succession from Moses, which is the succeeding prophets sharing the experience of God that Moses had in different ways into different extents. And then the sort of body, the physical or material element of that would be the laying on of hands, right? And so toward the end, we talked about the fact that you could have a false prophet, a prophet who had the physical part, who had the laying on of hands, but did not share the experience. You could have faithless prophets, just like in the same way that there were Israelites who were circumcised on the eighth day, but went on to become wicked people and not sort of fulfilled the calling that had been placed upon them. And that this means was given in Deuteronomy for determining sort of, how do I know that this is the guy who's making the authoritative rulings as opposed to, you know, the other category, the false prophet. And we talked about how that was typically done through signs, right? God gave signs through the prophets, Right? And when those signs were demonstrated to be true, then that was a way of God revealing who the prophet who had that authority was at any given point in time to the people of that region. And we talked about how we start out with just Moses when they're a camp in the wilderness, but then once they get settled in the land and they are spread out, we see that there are a bunch of prophets at any given time who are all utilizing this same kind of authority in their respective communities, right? You've got the northern kingdom of Israel, the southern kingdom of Judah. You have different prophets active, sometimes at the same time in those two places and even within Israel or within Judah. So as we get to the New Testament, people begin to perceive as Jesus of Nazareth comes out and is publicly preaching and teaching, he is speaking as one who has authority. He's speaking as someone who is making these kind of authoritative pronouncements and rulings. And at the same Time. There are certain parties within Galilean and Judean life who don't always like what he's saying and doing or have some disagreement. And so we get sort of repeated instances of people asking him questions like, by what authority do you do these things? Who gave you this authority? We talked about some of these last time. Right. Sort of asking for his bona fides. Who laid hands on you? Right. Who made you the. Right. And of course, they haven't keyed in on Jesus being the Messiah or the Logos incarnate, obviously. Right. But so they're asking these questions, and sort of the culmination of that comes, as described in St. Matthew's Gospel, when the religious authorities come to him and demand a sign. They say, okay, well, we'll find out for sure whether you're the real deal or not. Give us a sign so we can. We can test this thing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":786.52,"end":821.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So this is in Matthew, chapter 16, starting with verse one. And the Pharisees and Sadducees came, and to test him, they asked him to show them a sign from heaven. He answered them, when it is evening, you say, it will be fair weather, for the sky is red. And in the morning it will be stormy today, for the sky is red and threatening. You know how to interpret the appearance of the sky, but you cannot interpret the signs of the times. An evil and adulterous generation seeks for a sign, but no sign will be given to it except the sign of Jonah. So he left them and departed."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":822.34,"end":826.74,"speaker":"Fr Stephen De Young","text":"Right. So they didn't see the sign or it would have opened up their eyes."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":827.7,"end":864.95,"speaker":"Fr Andrew Stephen Damick","text":"You know, when I was an undergraduate, decades ago now, I took a Philosophy 101 class. And I recall the professor, he was teaching the Platonic concept of the forms. And the. The example that he gave was the form of the Scandinavian pop band. And so then he mentioned several instances of this, you know, abba, ace of bass. And to this day now, whenever I hear any reference to them, I immediately think about Platonism. It's weird."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":865.19,"end":869.03,"speaker":"Fr Stephen De Young","text":"When you said form, I thought you were going for form of water, shape of a wildebeest."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":870.95,"end":874.91,"speaker":"Fr Andrew Stephen Damick","text":"Deep cut, that is. I mean, that's from the sun."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":874.91,"end":898.04,"speaker":"Fr Stephen De Young","text":"Right. So what's going on here, one might ask. Well, wait, I thought signs were how they were supposed to check out. Tell a false prophet from a real prophet. But note here. And I could have talked about this last time, frankly, from Isaiah, chapter seven, but we've gone over that a lot and kind of beat it to death. But first of all, Christ has been doing a lot of Signs, right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":898.2,"end":900.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a bunch up to this point."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":900.6,"end":1042.59,"speaker":"Fr Stephen De Young","text":"So there's a whole bunch of things that these Pharisees understood perfectly well were signs that the Messiah had come were signs of the Messianic age, right? Like blind people seeing lame people walking, right? Et cetera, et cetera. By the time we get to Matthew 16, like, Christ has healed a lot of people. He's cast out demons. He's been teaching publicly, right? They have all the signs they need, but they've, you know, as anyone can, right. With any argument or any proof, right. If you really don't want to believe it, you will find a way to discount it. And they have. And so they're demanding this sort of further sign, and they're doing it to test him. So the idea is signs are given by God, and a human who is pious, a human who is seeking God, a human who is seeking God's authority will recognize them. That's why Christ gives these examples of, hey, you see these signs in nature and you recognize what that means. But you see all this stuff I'm doing and you're like, meaning they're motivated to not believe. And what that really reveals, the fact that they are motivated to not believe reveals the kind of wicked generation it is that he's speaking to. Meaning that there's nothing he could do at that moment, right? There was no miracle. There was no wonder. There was no sign he could do in front of them that they wouldn't have found some way to dismiss. And we know this from the rest of the text of Matthew, right? He casts out a demon and they're like, oh, he cast out demons by the prince of demons, right? I mean, Christ doesn't bother doing anymore, right? Other than making this reference to the sign of Jonah, which has something to do with the resurrection. But you can go and see past episodes about that. But so these signs are sent by God. They're not things that humans demand, right? And the reference I made to Isaiah 7, if you go back there without getting into that whole thing all over again, Isaiah comes to the king and says, ask God for a sign. He says, oh, no, I couldn't. He's sort of very pious. Isaiah says, okay, well, God's going to give you one anyway. Here it is."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1043.07,"end":1048.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. It's not proof that should be demanded. It's a gift, Right? Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1049.55,"end":1117.82,"speaker":"Fr Stephen De Young","text":"So we begin with that clarification, right, Surrounding Jesus. But there are some folks who stand in this line from Moses at the time that Jesus is traveling and preaching in Galilee and Judea and doing these miracles. And those people are the Pharisees, the Sanhedrin in particular, who are Pharisees. They made sure to keep the Sadducees out at this point in history. And then the scribes who we sometimes see, or in one translation that we're going to read later tonight, I think the lawyers. Woe to you lawyers, the experts in the law. But that's the Torah. Right. These are scribes who are sort of in training for the laying on of hands, for sort of ordination. Right. These are the folks. Right. And based on sort of the Sunday school version of the Gospels, we get some folks may be thinking, oh well, as soon as, as soon as Christ shows up on the scene, those guys are done."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1118.46,"end":1120.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They have no authority. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1120.02,"end":1150.55,"speaker":"Fr Stephen De Young","text":"Any authority they might have had is, is gone. Yeah, that's, that's not what Jesus says, like at all. And not only is it not what Jesus says, you could go to pretty much the harshest passage where Christ is just railing against the Pharisees for all the things wrong with, with the Pharisees and he doesn't deny the authority they've received from, handed down from Moses while he's excoriating them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1150.71,"end":1154.15,"speaker":"Fr Andrew Stephen Damick","text":"But I thought Jesus was offering a relationship, not religion."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1155.59,"end":1156.15,"speaker":"Yvonne","text":"I know."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1156.31,"end":1197.35,"speaker":"Fr Stephen De Young","text":"Well, you have to understand, he was being really unchristlike in this passage. Very mean, very mean, very judgy. So. But we're talking about Matthew 23, and this is where Christ pronounces woes upon the Pharisees. And woe to you just, it doesn't have a ring like to us it just sounds antiquated. Right. But like for example, the scholars version, back in the 90s, they translated it as damn you. Saying woe to you is sort of like, is basically saying, you're going to hell."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1197.91,"end":1198.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1198.55,"end":1201.27,"speaker":"Fr Stephen De Young","text":"You're on the way, you're on the road to hell. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1201.27,"end":1201.91,"speaker":"Dan","text":"Right Now."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1202.71,"end":1210.15,"speaker":"Fr Stephen De Young","text":"Now keep in mind, as Christ says that to the Pharisees, he is saying that to the Pharisees, meaning he's trying to get them to get off that road."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1211.19,"end":1214.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If he just wanted them to go, then he wouldn't bother to say it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1214.43,"end":1215.27,"speaker":"Fr Stephen De Young","text":"He would ignore them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1215.64,"end":1220.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So Matthew chapter 23, which we're gonna."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1220.16,"end":1222.84,"speaker":"Fr Stephen De Young","text":"Read the whole thing, but I will stop in, I will jump in."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1223.56,"end":1236.52,"speaker":"Fr Andrew Stephen Damick","text":"Then Jesus said to the crowds and to his disciples, the scribes and the Pharisees sit on Moses's seat. So do and observe whatever they tell you, but not the works they do. For they preach."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1236.6,"end":1251.19,"speaker":"Fr Stephen De Young","text":"So do not practice. Right. There they sit in Moses seat. So they have this authority handed down from Moses. And so notice Christ says, do and observe whatever they tell you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1252.47,"end":1260.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not the stuff you agree with or what seems right to you or what you think is in accordance with the law. Whatever they tell you. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1260.87,"end":1285.94,"speaker":"Fr Stephen De Young","text":"If they tell you it is not lawful to walk more than a certain distance on the Sabbath, don't walk more than that distance on the Sabbath. He says that to it, not just to his disciples, but to all the crowds that are following him now. He says, don't do what they do because they preach, but do not practice. But when they make these rulings, he is saying the Pharisees have these author the authority to make these rulings. And these rulings are binding at this point."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1287.14,"end":1327.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, continuing on with verse four. They tie up heavy burdens, hard to bear and lay them on people's shoulders, but they themselves are not willing to move them with their fingers. They do all their deeds to be seen by others, for they make their phylacteries broad and their fringes long. And they love the place of honor at feasts and the best seats in the synagogues and greetings in the marketplaces, and being called rabbi by others. But you are not to be called rabbi, for you have one teacher, and you are all brothers, and call no man your father on earth, for you have one father who is in heaven. Neither be called instructors, for you have one instructor, the Christ."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1327.62,"end":1330.1,"speaker":"Fr Stephen De Young","text":"Right. And instructor there is teacher."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1330.26,"end":1331.14,"speaker":"Fr Andrew Stephen Damick","text":"Teacher. Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1331.78,"end":1345.14,"speaker":"Fr Stephen De Young","text":"So this, of course, you know, not totally germane, but we're just. We're just pausing here because of course there are people who seems like this is. This is the only verse of the New Testament they know by heart."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1345.78,"end":1346.22,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1346.22,"end":1348.9,"speaker":"Fr Stephen De Young","text":"Maybe that's just because I'm a priest, so I have to hear it all the time."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1349.47,"end":1352.11,"speaker":"Fr Andrew Stephen Damick","text":"This is the verse that forbids the celebration of Father's Day."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1352.51,"end":1356.75,"speaker":"Fr Stephen De Young","text":"Yes. Celebrating Father's Day is because you shouldn't."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1356.75,"end":1357.95,"speaker":"Fr Andrew Stephen Damick","text":"Be calling anybody your father."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1358.03,"end":1359.15,"speaker":"Fr Stephen De Young","text":"How dare you?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1359.15,"end":1364.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, for you, very Reverend Doctor, you shouldn't be called doctor because that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1364.07,"end":1380.82,"speaker":"Fr Stephen De Young","text":"Well, that's the point where. That's where this is going, Teacher. So you get that they know that one. You're not supposed to call anyone Father, but I have literally heard this lecture from Protestant teachers who are Dr. So and so doctoris in Latin is the word for teacher."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1381.22,"end":1381.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1382.34,"end":1387.54,"speaker":"Fr Stephen De Young","text":"So they're literally complaining about verse nine. Oh, how dare you be called Father Stephen."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1388.5,"end":1388.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1389.94,"end":1404.96,"speaker":"Fr Stephen De Young","text":"When verse 10 says you shouldn't be calling yourself Dr. Whatever. If we're going to read it the same way. But Is. Is that really what. What Christ is concerned about? I mean, does that make sense? If we stop and think about it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1404.96,"end":1410.68,"speaker":"Fr Andrew Stephen Damick","text":"For a minute, it's sort of a weird. Yeah, it's like a weird non sequitur."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1411.16,"end":1416.68,"speaker":"Fr Stephen De Young","text":"Like you could call it just those two words too, right? Like father and teacher are out."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1417.24,"end":1420.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but king is cool and, you know, emperor and."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1420.44,"end":1428.3,"speaker":"Fr Stephen De Young","text":"Yes. So in the Dutch tradition. In the Dutch tradition, ministers refer to as Domini and then their last name, Master."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1428.3,"end":1428.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1428.78,"end":1433.82,"speaker":"Fr Stephen De Young","text":"Adoni means lord or master. But that's fine because Jesus didn't say you can't call people that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1435.02,"end":1436.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, as long as you don't call."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1436.18,"end":1500.74,"speaker":"Fr Stephen De Young","text":"Him father or teacher. You know, you call them Lord, you can call them master, you can call them sire, you can call them. Right. Like, is anyone serious in taking that interpretation that. That Jesus was just concerned about these two titles? Because rabbi means teacher also. Right. So he's just concerned about those two titles. That's it. All other titles are good. Right. You can call yourself the Grand Mufti, you can call yourself whatever, but just not father or teacher. Obviously, that's not what it's talking about. If you read. When we read the context. Right. We just saw the context of them. Like to make a big show in public places and make people make a big show of respect to them. That this is about not ascribing a bunch of titles to yourself and lording it over people. But there are folks who are just going to jump up and down on verse nine. Who, me. Referring to myself as the Very Reverend Dr. Stephen DeYoung, PhD. Totally cool. But somebody calling me Father Steve. How dare you?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1501.94,"end":1503.86,"speaker":"Fr Andrew Stephen Damick","text":"And on your Twitch stream, no less."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1504.1,"end":1520.06,"speaker":"Fr Stephen De Young","text":"Yes. How dare you, sir. Right. Why are you exalting yourself with that title, Father Steve? Opposed to The Very Reverend Dr. Stephen de Young, PhD. Whatever. Right. Like it. It. It doesn't make sense. The dog don't hunt. Never mind the fact that St. Paul says he's the Father of the Corinthians."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1520.38,"end":1522.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lots of people are called fathers in."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1522.66,"end":1529.1,"speaker":"Fr Stephen De Young","text":"Scriptures, but, you know, I guess St. Paul was sinning when he. Yeah, yeah, when he did that in Corinthians."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1529.26,"end":1550.61,"speaker":"Fr Andrew Stephen Damick","text":"Okay, but say on verse 11, the greatest among you shall be your servant. Whoever exalts himself will be humbled, and whoever humbles himself will be exalted. But woe to you, scribes and Pharisees, hypocrites, for you shut the kingdom of heaven in people's faces, for you neither enter yourselves, nor allow those who would enter to go in."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1551.25,"end":1558.09,"speaker":"Fr Stephen De Young","text":"So. Pause it there. I know you've heard this probably especially Orthodox people have heard this during Holy Week every year."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1558.09,"end":1558.45,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1559.09,"end":1586.03,"speaker":"Fr Stephen De Young","text":"And you've probably read it and heard it other times. Right. And even if you're not Orthodox, have you ever stopped and thought about that? How could the Pharisees shut the door of the kingdom of heaven? How could the Pharisees not allow someone to get into the kingdom of heaven? Because they had the authority to bind into loose. That's how. That's how. It's like they had the keys to the door or something."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1586.91,"end":1607.67,"speaker":"Fr Andrew Stephen Damick","text":"How about that? Okay. Verse 15. Woe to you, scribes and Pharisees, hypocrites. For you travel across sea and land to make a single proselyte. And people, it's not proselytite. It's not proselyte. And when he becomes a proselyte, you make him twice as much a child of hell as yourselves. Double hellion."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1608.15,"end":1613.35,"speaker":"Fr Stephen De Young","text":"I like that. They changed it to child of Hell instead of son of Hell. So we gotta be more inclusive, people."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1613.43,"end":1614.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1615.03,"end":1618.47,"speaker":"Fr Stephen De Young","text":"Are you daughters of Hell out there too? Not who are Pharisees, but anyway."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1618.71,"end":1676.31,"speaker":"Fr Andrew Stephen Damick","text":"Well, I mean, in Norse tradition, the devil herself is female. Woe to you, blind guides who say, if anyone swears by the temple, it is nothing. But if anyone swears by the gold of the temple, he is bound by his oath, you blind fools. For which is greater, the gold or the temple that has made the gold sacred? And you say, if anyone swears by the altar, it is nothing. But if anyone swears by the gift that is on the altar, he is bound by his oath, you blind men. For which is greater, the gift or the altar that makes the gift sacred. So whoever swears by the altar swears by it and by everything on it. And whoever swears by the temple swears by in it and by him who dwells in it. And whoever swears by heaven swears by the throne of God and by him who sits upon it. Woe to you, scribes and Pharisees, hypocrites. For you tithe mint and dill and cumin, and have neglected the weightier matters of the law, justice and mercy and faithfulness. These you ought to have done without neglecting the others."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1677.03,"end":1704.53,"speaker":"Fr Stephen De Young","text":"Yeah, so let's pause there again. So Christ is saying, look, you go and you tithe. You take a tenth from your herb garden, right? You sit there like you're trimming a little bonsai tree, right? And you get these little herbs. You're so fastidious about this, right? But things like justice, mercy, faithfulness, those you don't seem all that concerned about."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1705.36,"end":1705.6,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1705.84,"end":1731.2,"speaker":"Fr Stephen De Young","text":"But notice what Jesus response is. Jesus response is not. Those are the important things. Who cares about your herb garden? That's not what he says. He doesn't say, you need to stop making up these silly rules. God doesn't care about them. He says you should tithe from your herb garden, but not to the neglect of these other things. Not to the neglect of these other things."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1732.85,"end":1733.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1733.09,"end":1750.69,"speaker":"Fr Stephen De Young","text":"So again, he's not condemning. Right. You could go through the Torah front to back. There's nothing in there saying you need to tithe from your herb garden. This is a quote unquote rule the Pharisees added. This is an interpretation and application of the laws of tithing, the commandments regarding tithing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1751.17,"end":1754.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he's here backing that up."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1754.53,"end":1762.46,"speaker":"Fr Stephen De Young","text":"Right. And Christ is saying that interpretation, application is authoritative. He's not saying, oh, that's not spelled out in the Torah. How dare you?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1762.78,"end":1766.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because they sit on the seat of Moses."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1766.86,"end":1767.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1768.3,"end":1871.13,"speaker":"Fr Andrew Stephen Damick","text":"All right. Picking up with verse 24, you blind guides, straining out a gnat and swallowing a camel. Woe to you, scribes and Pharisees, hypocrites. For you clean the outside of the cup and the plate, but inside they are full of greed and self indulgence, you blind Pharisee. First clean the inside of the cup and the plate, and that the outside also may be clean. Woe to you, scribes and Pharisees, hypocrites. For you like whitewashed tombs which outwardly appear beautiful, but within are full of dead people's bones and all uncleanness, so you also outwardly appear righteous to others, but within you are full of hypocrisy and lawlessness. Woe to you, scribes and Pharisees, hypocrites. For you build the tombs of the prophets and decorate the monuments of the righteous, saying, if we had lived in the days of our fathers, we would not have taken part with them in shedding the blood of the prophets. Thus you witness against yourselves that you are the sons of those who murdered the prophets. Fill up then the measure of your fathers, you serpents. You brood of vipers. How are you to escape being sentenced to hell? Therefore I send you prophets and wise men and scribes, some of whom you will kill and crucify, and some you will flog in your synagogues and persecute from town to town, so that on you may come all the righteous blood shed on earth, from the blood of righteous Abel to the blood of Zechariah, the son of Berechiah, whom you Murdered between the sanctuary and the altar. Truly I say to you all these things will come upon this generation. O Jerusalem. Jerusalem, the city that kills the prophets and stones those who are sent to it. How often would I have gathered your children together as a hen gathers her brood under her wings and you are not willing See, your house is left to you desolate. For I tell you, you will not see me again until you say, blessed is he who comes in the name of the Lord."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1871.77,"end":1906.96,"speaker":"Fr Stephen De Young","text":"So that whole last section, he talks about them having murdered the prophets in the past. What's that about? That's not just about, oh, you like killing people. The prophets, the people who God gave that authority to in the past, they, they killed. Talking about rebellion. And he says, then I'm going to send you prophets and wise men. He's going to send people with authority to them. And they're not going to listen to them either. They're going to kill them, they're going to stone them, they're going to beat them in the synagogue."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1906.96,"end":1907.24,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1909,"end":1961.71,"speaker":"Fr Stephen De Young","text":"That'S what's going to happen. Because the charge of being a hypocrite against the Pharisees is that they are sort of as a person rebelling against the authority that God gave to them. God gives them the authority to make rulings, they make rulings and then don't follow their own rulings. That's what hypocrisy ultimately is. It's sort of a bizarre self rebellion on their part. And so certainly when someone else with that authority comes to them and tells them to do something that they don't like, they're certainly if they rebel against their own authority, they'll certainly rebel against it when it comes from someone else. Right. So notice all through that. I mean, this is excoriating the Pharisees."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1961.71,"end":1962.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1962.43,"end":1972.67,"speaker":"Fr Stephen De Young","text":"But nowhere in there does Christ deny. But rather everywhere, all through that as he's chewing them out, he affirms that they actually have this authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1973.25,"end":1991.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's interesting, there's a couple of comments in our YouTube chat that are basically saying almost the opposite of this. Like, well, they are misinterpreting, so you shouldn't. But again, read the whole chapter, folks. There's nowhere where Jesus says you guys are not authoritative because you're interpreting it wrong."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1991.29,"end":1993.97,"speaker":"Fr Stephen De Young","text":"Right. Do and observe whatever they tell you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1994.21,"end":1995.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they are the interpreters."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1996.21,"end":1998.29,"speaker":"Fr Stephen De Young","text":"Do and observe whatever they tell you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":1998.86,"end":2001.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is not democracy. It's just not."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2004.38,"end":2008.7,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yeah, Christ says that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2010.22,"end":2010.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2011.02,"end":2016.38,"speaker":"Fr Stephen De Young","text":"So it is not. Oh, they're interpreting the Torah wrong. So don't Follow it. Christ says the exact opposite here."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2016.86,"end":2018.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not, you know, as long he."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2018.22,"end":2022.22,"speaker":"Fr Stephen De Young","text":"Says, yes, they may be, but you're bound by it because they have the authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2022.46,"end":2028.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not as long as you agree with them, obey them. Because that's not what obedience is."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2029.03,"end":2030.47,"speaker":"Fr Stephen De Young","text":"No. That's doing what you want."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2032.07,"end":2040.55,"speaker":"Fr Andrew Stephen Damick","text":"That is what the scripture calls. Every man did what was right in his own eyes. Which is how the Bible expresses anarchy and wickedness."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2041.27,"end":2045.75,"speaker":"Fr Stephen De Young","text":"Yes. There's a way that seems right to a man and its end is destruction, as we talked about last time."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2046.95,"end":2051.03,"speaker":"Fr Andrew Stephen Damick","text":"Okay, moving on. Oh, this is where we get the woe to you, lawyers."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2051.35,"end":2055.13,"speaker":"Fr Stephen De Young","text":"Christ is. Let me put an even finer point on it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2055.37,"end":2055.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2056.01,"end":2069.93,"speaker":"Fr Stephen De Young","text":"Where does it end up? Christ is literally saying to the Pharisees, you Pharisees are going to go to hell for not obeying the Pharisees. That's the charge of hypocrisy. That's what Christ is literally saying."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2070.33,"end":2073.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not obeying their own words and."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2073.05,"end":2082.46,"speaker":"Fr Stephen De Young","text":"Very clearly saying, right. They don't do it. That's why they're heading for hell. Because if you outside of the cup and dish look nice, but inside."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2084.06,"end":2093.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If you interpret it the other way, that's suggesting that the Pharisees are actually being obedient to the law, but they're telling everyone else not to be, which."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2093.5,"end":2095.02,"speaker":"Fr Stephen De Young","text":"Is the opposite of what Christ says."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2095.26,"end":2098.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It actually goes the other way."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2098.62,"end":2100.58,"speaker":"Fr Stephen De Young","text":"That's the exact opposite."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2100.58,"end":2100.86,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2100.86,"end":2115.88,"speaker":"Fr Stephen De Young","text":"Yep. So I bet. I know this isn't the way you. Maybe you've been taught it in the past, but, I mean, we're literally just reading it. I mean, we're not. I'm not. We're not quoting a bunch of church fathers, interpreting it in some allegorical way. We're just reading it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2117.88,"end":2118.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2118.2,"end":2148.45,"speaker":"Fr Stephen De Young","text":"This isn't an unclear passage. This is a very clear and direct passage in what it is saying. The version of this in St. Luke's Gospel is in chapter 11, something we breezed over in the Matthew 1. I want to highlight in the Luke. Luke 11 is the same big content, basically, just kind of condensed. But just to, you know, it's not doubling down at this point. It's probably quadrupling down. But verse 46 in Luke 11."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2149.25,"end":2161.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It says, and he said, and this is Jesus, woe to you, lawyers. Also for you load people with burdens hard to bear, and you yourselves do not touch the burdens with one of your fingers."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2161.25,"end":2161.69,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2161.69,"end":2163.41,"speaker":"Fr Andrew Stephen Damick","text":"So the interesting thing he says there."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2164.1,"end":2324.65,"speaker":"Fr Stephen De Young","text":"In verse 45, it's actually kind of interesting. This isn't just lawyers catching strays. They bring it on themselves. Like in verse 45, leading up to verse 45, Christ is saying all this stuff to the Pharisees. And then these teachers of the law who are there with the Pharisees are like, what you're saying would seem to apply to us also. Like they're like, hey, wait a minute, right? And Christ's Response in verse 46 is what? Woe to you too. Right, like to go after them too. Just to make it clear, yes, this does apply to you. But notice you load people with burdens hard to bear and you yourselves do not touch the burdens with one of your fingers. Doesn't say you load them with burdens and make it difficult for them. Yeah, doesn't say you load them with burdens and they should ignore you and those burdens you're putting on them. Christ is condemning them. Cuz he says you're loading people with burdens and, and then not lifting them. You're doing a lot of binding and no loosing. Yeah, he's criticizing them for how they use the authority they've been given. Christ is pronouncing judgment against the people who have been given this authority because they're misusing it. But the fact that they're misusing it doesn't mean they don't have it. Just like Pontius Pilate misuses his authority, but he had it. You could say to him like, oh, you're misusing your authority. You're not really the governor. No, he was really the Roman governor. This is the same thing. No, the Pharisees have this authority and they're misusing it. That doesn't mean they don't have it. They're misusing what they have what God has given them and they're going to be held accountable for it. There's judgment coming against them for it. So another place, Matthew 21. Now this, now understanding what's going on in Matthew 21. The big problem here is really that this isn't a criticism of our lectionary because our lectionary has to be sort of the way it is. We can't read a whole gospel right front to back, every liturgy. So we've got to take it in chunks and pieces, right? And we cycle through and we read the whole gospel, but it's, it's taken in pieces. But sometimes, because especially, especially if we don't go to church every day, therefore maybe don't do the gospel reading every single day, like we're kind of Supposed to. We kind of lose the flow. We just think about these individual parables individually, you know, and we don't think about like, oh, this parable is part of a sequence of parables in the Gospel."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2324.73,"end":2330.81,"speaker":"Fr Andrew Stephen Damick","text":"That's why it's good to just sit down and read like multiple chapters at once. Or if you can't, both are full books at once."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2331.61,"end":2426.52,"speaker":"Fr Stephen De Young","text":"Yeah, you've got to understand parts, but you've also got to understand the whole. You've got to get both. And we, we get a lot of one through the daily readings. If we do them, we don't always get the big picture stuff. And so the beginning of Matthew 21, we get a couple of parables. We get the parable of the prodigal son, and then we get the, the. The parable of the vineyard with the evil tenants. Right. So parable of the prodigal son. Most of us probably have an understanding that the, the older brother kind of represents the Jewish leaders or the Pharisees kind of have that idea. But a lot of times when, when the parable of the vineyard is taught, which is where the owner of the vineyard lets out the vineyard to tenants, and the tenants sort of refuse to send the money back. And so he sends messengers there, and they kill the messengers. Then he sends his son and they kill his son, and then he wipes them all out and gives the vineyard to somebody else. Usually when that's taught, if you're in a church where they have the guts to teach it these days, they act like it's about the Jewish people and it's about the temple and the land and the Romans coming after Jesus is killed. That's not totally off base. But if you actually read it, and especially if you read the end, right, the culmination, because after that parable, Christ says, therefore. Meaning he's about to tell us what he's getting at and what this means."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2426.84,"end":2455.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. After all that, Matthew 21, starting with verse 43, therefore, I tell you, the kingdom of God will be taken away from you and given to a people producing its fruits. And the one who falls on this stone will be broken to pieces. And when it falls on anyone, it will crush him. When the chief priests and the Pharisees heard his parables, they perceived that he was speaking about them. And although they were seeking to arrest him, they feared the crowds because they held him to be a prophet."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2456.44,"end":2466.7,"speaker":"Fr Stephen De Young","text":"So the crowds, the people, the Judean people, do not take this to be about them. And the text here isn't telling us that it's about them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2466.86,"end":2469.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is not about taking it from the Jews and giving it to the Gentiles."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2470.14,"end":2470.54,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2471.1,"end":2472.46,"speaker":"Fr Stephen De Young","text":"This is about the leaders."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2473.98,"end":2474.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2474.38,"end":2512.31,"speaker":"Fr Stephen De Young","text":"This is about the Pharisees and the chief priests. This is about the Sanhedrin and the chief priests. This is about the people who have that authority that's been handed down from Moses. That's what Christ is saying is going to be taken away from them because of their misuse of it. Not only is Christ saying that, you know, individually, you're going to be judged for what you did with the authority God gave you as a person, but as a collective, that authority is going to be taken away from you. That chain leading from Moses to you is going to get broken."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2512.91,"end":2525.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And not to beat a dead horse too much here, but also worth pointing out that even as he's doing this, he never tells people, generally, you don't have to obey these people who currently have this authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2525.63,"end":2528.51,"speaker":"Fr Stephen De Young","text":"Yes. Stop taking sacrifices to the temple."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2528.99,"end":2530.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He never says that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2531.07,"end":2534.15,"speaker":"Fr Stephen De Young","text":"Don't go to the temple to pray. In fact, Christ goes to the temple, right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2534.15,"end":2536.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Even though it's run by the Sadducees."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2537.23,"end":2540.35,"speaker":"Fr Stephen De Young","text":"He pays the temple tax. Even though it's a completely corrupt system."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2540.91,"end":2541.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2541.63,"end":2615.82,"speaker":"Fr Stephen De Young","text":"Right. He doesn't tell them, don't pay the temple tax. He doesn't tell them, don't listen to the Pharisees. He doesn't say, don't do what the Pharisees tell you to do. He says the opposite. He never says any of that. So what Christ is talking about here, what he's saying is going to happen in terms of those chains ending in terms of that authority going away, happens historically, not just from a Christian perspective. From, from a Jewish. You can look this up, look this up in Jew, purely Jewish resources. Okay. And you will find this out. Now, a piece of this is the Roman de Judification project in Palestine. Right. The province of Judea becomes the province of Palestine in the Roman Empire after the Bar Kokva rebellion. And this isn't just the temple's been destroyed. It's, you know, Jerusalem gets leveled and rebuilt by Hadrian. The. The Jews are driven out of the city of Jerusalem. Synagogues are destroyed all over the place. The reason we have so many 1st century synagogues in Galilee and Judea preserved archaeologically is because the Romans wiped them out in the first century."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2616.14,"end":2616.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2617.58,"end":2795.85,"speaker":"Fr Stephen De Young","text":"Plowed them under. So they have this brutal dejudification process. And part of that was it was illegal to perform an ordination to Reform the right of laying on hands because they were Trying to destroy the Sanhedrin, right. They'd already gotten rid of the Herodian dynasty. They had already gotten rid of effectively the Sadducee and chief priests because they destroyed the temple. They also went after the Pharisees. They also went after the Sanhedrin. And one of their ways of doing that was outlawing the ordination. So already you start getting breaks in some of those chains because we don't have the regular process anymore of the Sanhedrin sort of ordaining replacement members as they lost members, for example, and the different levels of ordination and the people who we read about being scribes or teachers of the law, who are sort of in training, all of that gets kind of mangled. It becomes very difficult because of the Romans. And some of those lines already get tenuous. And then there's a shift in the second century where a couple of things happen. The first thing that happens is. And the first one is because of just the realities of you don't have a Sanhedrin in Jerusalem anymore, right. And so rather than the ordinations taking place through that, the laying on of hands and the passing of authority taking place through that, it becomes the sort of the sole prerogative of the head of a school or the head of a family to sort of choose an individual successor. So you start seeing this was already true before this, but even more after this, you get lines of rabbis that are like father, son, grandson, because it's going down through the family or sort of schools where they're studying Torah and it's going from the head of the school to the next head of the school. So you have a different situation. And in the context of that change, the actual laying on of hands part goes away. Before that, when the documents we have in the Second Temple period and stuff that's preserved in the Jerusalem Talmud and stuff from this early period, they had a basic understanding within Judaism that this laying on of hands communicated grace and authority to the person on whom the hands were laid, which is what we would call sacramental ordination. Sorry, Protestants, that's in pre Christian Judaism. And the reason it's that the right of the laying on of hands and this particular understanding of it goes away in Judaism is because Christians had taken it over. Christians were doing it. And so because the Christians had kind of taken it over. This is one of those areas where the non Christian Jewish communities distance themselves from Christian communities."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2797.05,"end":2798.09,"speaker":"Fr Andrew Stephen Damick","text":"We're not like them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2799.05,"end":2851.63,"speaker":"Fr Stephen De Young","text":"Yeah. So this is a place so that actual physical part of the right. So when does do these ordinations actually stop they come to an end. These chains that were traced all the way back to Moses come to an end somewhere between the year 360 AD and 425 AD. And this is part of the story of Christianity and Judaism separating, as we already noted. But we know they're gone by 425. We know by 425 chain has been broken. Those kind of ordinations are no longer happening. So why do we say somewhere between 360 in there? Well, in 361, a prominent, very prominent rabbi standardized the Jewish calendar going forward."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2853.79,"end":2855.07,"speaker":"Fr Andrew Stephen Damick","text":"What was it before that?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2855.47,"end":2937.4,"speaker":"Fr Stephen De Young","text":"So previous to that, the Sanhedrin, right, the religious authorities, the chief rabbis, set, you know, the date of Pascha, the date of Passover every year. And when one of those extra months was going to be added because it was a lunar calendar, they added it and said how many days it would be. That was done sort of in real time by the religious authorities. But by the time you get to 360, these ordination chains have become the Shemikah, right, in Hebrew, have become sort of so tenuous that there's, as this prominent rabbi, some others are looking around. There's not a clear cut authority to keep doing it every year. There's not a clear cut authority who everybody recognizes throughout the Jewish Diaspora to do this every year. And so the decision is made, well, we need to sort of standardize this going forward until the end of time so that there's no ambiguity about it because they kind of realized those chains were dying. And that happens in 361. So somewhere between 360 when it's noticed that, oh, this is all kind of falling apart and 425, where it's fallen apart, it falls apart."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2938.28,"end":2938.84,"speaker":"Fr Andrew Stephen Damick","text":"That's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2941.05,"end":2949.13,"speaker":"Fr Stephen De Young","text":"And this is, this is in the period between 360 and 425 before the Babylonian Talmud kind of all comes together."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2950.01,"end":2950.41,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":2952.41,"end":3023.16,"speaker":"Fr Stephen De Young","text":"Picking out exact dates where a lot of these things happen is tricky. That's why we have a range and it's a kind of a large range. And so the kinds of ordinations that were practiced from Moses until that time have not been practiced since then within Judaism. And there have been a few attempts at different points in history in different Jewish communities in different areas to try to revive them, to try to sort of do archaeology and genealogy and try to, well, you know, hey, this rabbi was, you know, a disciple of this guy who was a disciple of that guy, right? And try and trace it back and try and revivify them. But they've never sort of taken. They've never been sort of widely acclaimed or recognized enough to sort of start it back up. And so to this day, there is rabbinical ordination, but it is very much, and any Jewish source will tell you this, not the same thing. So someone who is made a rabbi now after finishing, you know, they go to Jewish Theological Seminary, if they're Reform or they study at a particular place to be Orthodox or part of another group."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3023.4,"end":3023.76,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3023.76,"end":3082.92,"speaker":"Fr Stephen De Young","text":"Jewish, they get an ordination, they're made a rabbi, they're recognized as a rabbi. But there's not someone who has the kind of authority that, say, a Gamaliel did who could trace that authority back to Moses and whose rulings are sort of always final. There are rabbis who gain good reputation, who have sort of charismatic levels of authority above other rabbis and that kind of thing. But there's not a pope of the Jews. There's not sort of one person or even a group like a Sanhedrin, like a recognized group that all the Jewish people of the world recognize as having this authority for Moses. And their rulings are sort of final. And so any given rabbi's opinion, more negotiable or, or, you know, more provisional, some scholars say. Right. And so there's a lot more arguments and."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3083.08,"end":3083.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3083.72,"end":3090.56,"speaker":"Fr Stephen De Young","text":"Different viewpoints and that kind of thing. And that's. Yeah, you know, I'm sure from a Jewish perspective, that's not a bad thing. That's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3090.56,"end":3090.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3090.88,"end":3109.49,"speaker":"Fr Stephen De Young","text":"There are various norms to that. But it is a change. It is a change. And what we're going to talk about here now in the second half is, as we've already mentioned here, the way in which Christianity carries on the original mode of understanding of ordination and succession."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3109.57,"end":3116.77,"speaker":"Fr Andrew Stephen Damick","text":"Yep. All right. We're going to go ahead and take our first break, and we'll be right back with the second half of this episode of the Lord of Spirits podcast."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3116.93,"end":3133.21,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3137.85,"end":3147.13,"speaker":"Fr Stephen De Young","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3147.82,"end":3150.54,"speaker":"Fr Andrew Stephen Damick","text":"But Paul operated during his entire life."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3150.7,"end":3153.74,"speaker":"Fr Stephen De Young","text":"As a faithful Pharisee within the Roman Jewish world."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3154.14,"end":3157.1,"speaker":"Fr Andrew Stephen Damick","text":"In St. Paul the Pharisee, Jewish apostle."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3157.1,"end":3180.11,"speaker":"Fr Stephen De Young","text":"To all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by DeYoung's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar traditional terminology. By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3180.11,"end":3185.91,"speaker":"Fr Andrew Stephen Damick","text":"Commonly held notions and help the reader reassess St. Paul in his historical context."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3186.39,"end":3195.99,"speaker":"Fr Stephen De Young","text":"Available now at store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3195.99,"end":3210.51,"speaker":"Announcer","text":"Of Spirits, the Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3210.99,"end":3267.4,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. Before we take a couple calls, I just want to give a little brief advertisement. We've sold out all the rooms at the Antiochian Village for the Lord of Spirits Conference. However, there are still lots of commuter tickets available. And, and I think there's still a waiting list if you'd like to try your chance to get one of the rooms at the village. But if you can't get one of those rooms, you can get a room somewhere else in the area. There are places to go, so you can go to store.ancientfaith.com events to get your tickets. The Lord of Spirits Conference is the first weekend in October of this year at the Antiochian Village. So it's going to be a lot of fun. We're going to have, I know that we're going to have a tournament playing the royal game of urban. There's going to be a couple of surprises. Father Stephen has assured me he's not going to throw rotten vegetables at the crowd like he did last time, just, you know, in a show of inversion or whatever."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3267.48,"end":3280.76,"speaker":"Fr Stephen De Young","text":"But there's, there's for people who need lodging. There's an abandoned house near an old graveyard about 150 yards from the village. So if you want to squat there. Yeah. Feel free."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3281.44,"end":3292,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, we do have some callers, so we very patiently have William from Tennessee. He's been waiting all this time. He called like right after the show started. So this guy is very serious."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3292,"end":3294.16,"speaker":"Fr Stephen De Young","text":"So was he born on the mountaintop there?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3295.52,"end":3299.92,"speaker":"Fr Andrew Stephen Damick","text":"Good old Rocky Top, Probably. William, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3300.8,"end":3305.76,"speaker":"Dan","text":"Thank you. Can you hear me, Domine, Andrew and Vera? Rev. Dr. Stephen, we hear you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3305.76,"end":3308.85,"speaker":"Fr Stephen De Young","text":"Yes, you should call him Dominique."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3308.85,"end":3309.85,"speaker":"Fr Andrew Stephen Damick","text":"He's the Dutch guy."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3310.97,"end":3318.01,"speaker":"Dan","text":"You know, Father Stephen has made that same born on a mountaintop in Tennessee multiple times when I've called in. Maybe I should say I'm from Kentucky or something."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3318.57,"end":3319.05,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3320.49,"end":3321.53,"speaker":"Fr Stephen De Young","text":"If nothing Else."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3323.53,"end":3324.09,"speaker":"Dan","text":"Indeed."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3324.41,"end":3325.13,"speaker":"Fr Andrew Stephen Damick","text":"What's up?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3326.25,"end":3411.29,"speaker":"Dan","text":"I have two questions, both of them on apostolic succession and it's continuity with the seat of Moses. My first question goes back to the episodes of world of priestcraft and prophet motive where a distinction was made between priestly roles and prophetic roles where the prophetic role represents God to men and priestly roles represents men to God. In world of priestcraft you mentioned the priestly role and prophet role, while ideally unified, were split at the time of Moses between the priestly role of Aaron and the prophetic role of Moses which suggests that the authority of the seat of Moses was, is prophetic and potentially distinct from the priestly authority. So my first question is cheating because it actually has parts A, B and C. But hopefully parts A and B have monolithical answers. So 1A is the authority of the seat of Moses, prophetic, priestly or both. 1b is the authority of apostolic succession, prophetic, priestly or both. And one see, if they do have prophetic and or priestly authority, how do we understand the authority of these priests and prophets coming from this ordination of laying on of hands as distinct and interacting with the authority of prophets and priests who do not have this, such as the priest Aaron, the prophetess Deborah or Saint Matrona the blind."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3412.5,"end":3419.78,"speaker":"Fr Andrew Stephen Damick","text":"So it's one A, B and C. I was getting a little lost with all of the sub questions there. Did you catch that?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3419.78,"end":3420.86,"speaker":"Fr Stephen De Young","text":"I did, I followed."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3420.86,"end":3425.38,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay. All right, all right, all right, all right, all right. Well come on, go ahead."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3425.7,"end":3434.3,"speaker":"Fr Stephen De Young","text":"Okay, so, so in terms of Moses, we're talking about prophetic authority and it's distinct from priestly authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3434.3,"end":3434.66,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3434.98,"end":3536.16,"speaker":"Fr Stephen De Young","text":"So it's like in the one text we read in the Gospels, it's the chief priests and the Pharisees realize he's talking about them. Right. Those are sort of the two pieces of the leadership grouped together as the shepherds of Israel. Often in like Ezekiel, when God is condemning them. In the case of the apostles, apostolic succession which we're going to turn to now there those roles are recombined and they're recombined based on a couple of things. One of them being Pentecost and the Holy Spirit and the relationship with the Holy Spirit to the prophetic role. The other one being that the, the New Testament priesthood is a different priesthood. It is not the Aaronic Levite priesthood, Levitical priesthood. Right. And see Hebrews. Right. It is sharing in participating in the. So the priesthood Father Andrew and I have is a participation at a certain degree in the priesthood of Christ who was not A Levite who was not descended from Aaron and Hebrews deals with that sort of at length. That's the purpose of the figure of Melchizedek that the figure of Melchizedek plays, which he brings in through Psalm 110 to apply to Christ in His priesthood. So then third question was about people who did not have per se ordination that played a prophetic role. If I'm remembering right, it seems right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3536.96,"end":3539.28,"speaker":"Fr Andrew Stephen Damick","text":"Can we confirm, Is that right, William?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3539.68,"end":3540.72,"speaker":"Dan","text":"That's right. That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3540.88,"end":3582.3,"speaker":"Fr Stephen De Young","text":"Okay, okay. Yeah. So that's something we actually see in the Old Testament too. So, for example, Deborah in Judges has not received the laying on of hands. Right. Passed down from Moses, but has this prophetic role sort of directly, directly from God. And so this is a case of God is not bound by his own rules. We're bound by God's rules. God isn't bound by his rules. So just like we have martyrs who were never baptized in water. Right. In a church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3582.78,"end":3583.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3583.58,"end":3622.43,"speaker":"Fr Stephen De Young","text":"And that doesn't mean, oh, baptism is the correct way for someone to be received in the church and receive remission of sins. There are people who God gives authority to and reveals himself to directly in non normal cases. But that doesn't affect the normal case. Right. You don't argue from the abnormal case to the normal case. You don't say, as some do, unfortunately. Well, look, the thief on the cross next to Christ wasn't baptized and went to paradise. Therefore baptism isn't important or is unnecessary."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3622.43,"end":3624.07,"speaker":"Fr Andrew Stephen Damick","text":"These things don't set precedences."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3624.76,"end":3636.36,"speaker":"Fr Stephen De Young","text":"Right. And the correct response to that is, well, yes, if you are ever being crucified next to our Lord, you don't have to be baptized."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3636.44,"end":3639.88,"speaker":"Fr Andrew Stephen Damick","text":"And he says to you, today you'll be with me in paradise. You're good."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3640.52,"end":3662.17,"speaker":"Fr Stephen De Young","text":"Right? Right. So Christ as God, right. Has authority that sort of, sort of supervenes that. And so there are these exceptional cases, but the normal case, the normal case, the way God normally operates with us is that this authority is passed down through ordination."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3662.33,"end":3689.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, another example of this sort of thing that's actually, that is very directly germane to what we're discussing is where the scribes and the Pharisees will criticize Jesus because of things that he chooses to do on the Sabbath. They'll say, our rulings say, you should not do this. But it's. And Jesus never says, now everybody, you know, you don't have to obey them anymore. But rather he says, look, I'm the Lord of the Sabbath. So in other words, my rulings supersede yours."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3689.25,"end":3691.01,"speaker":"Fr Stephen De Young","text":"Right. He has superior authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3691.25,"end":3696.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. He can make rulings as to what's appropriate for him to do on the."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3696.41,"end":3700.21,"speaker":"Fr Stephen De Young","text":"Sabbath, but he never tells other people. Oh, just ignore them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3701.01,"end":3716.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, never. Never. Yep. So, all right, thank you very much for calling, William. Good to talk to you. All right, we're going to move on to our next caller, and that is Brian calling from Virginia. So, Brian, welcome to Lord of Spirits podcast."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3717.58,"end":3718.54,"speaker":"Fr Stephen De Young","text":"Thanks, Fathers."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3718.94,"end":3720.86,"speaker":"Dan","text":"I've always wanted to greet you from Virginia."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3720.86,"end":3721.26,"speaker":"Fr Stephen De Young","text":"Father."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3721.82,"end":3728.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes. The Holy Land, the Old Dominion. Looks like a turkey on its belly or a chicken on its back."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3732.07,"end":3753.11,"speaker":"Dan","text":"My. My question is about Matthew 15. So here it seems like the Pharisees are criticizing Jesus's disciples for not following this tradition of washing their hands when they eat. And I was curious from, from what y' all were talking about earlier, just how to. To make what y' all were talking about fit with that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3754.31,"end":3763.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So is this one of those cases, Father, where Jesus has basically told his disciples, this is what I expect of you, or I mean, how does this work?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3763.09,"end":3769.25,"speaker":"Fr Stephen De Young","text":"Do you think Jesus didn't want them to wash their hands before they ate? I mean, that's kind of a good idea, Pharisees aside."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3769.49,"end":3772.65,"speaker":"Fr Andrew Stephen Damick","text":"But doesn't he defend them for that? I'm trying to remember now. Exactly."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3772.65,"end":3870.28,"speaker":"Fr Stephen De Young","text":"Well, no, what he does is he turns that around on the Pharisees, and it's another thing like the you tithe of mint and dill and cumin. And the point he makes, so he really makes a very technical point about the law there, that even a person who eats an unclean animal is not technically made unclean themselves by it. They have sinned by violating a commandment, but they haven't contracted uncleanness. Whereas what comes out of a person, literally bodily secretions does make a person ceremonially unclean. But then Christ analogizes from that back to the Pharisees, right? About instead of, you know, talking about bodily secretions, talking about what comes out of your mouth in terms of speech. Right. And in terms of. Right. And what you do. And so it's a criticism of the Pharisees saying, okay, yeah, this is another case where you're concerned about these. Very concerned about these outward things. He's not saying, don't wash your hands before you eat. Like no one's ever interpreted that way that I know of, that Christians ought not to wash their hands before they. Because of this passage, but that you should be even more concerned about these other more serious things. And he's talking to the people who are talking to him in Particular, he's not talking about abstract Pharisees. He's talking to the Christ knows the individual people because he created them who are talking to him at that moment. And he's saying, you Bob the Pharisee and Tim the Pharisee."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3870.36,"end":3870.76,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3871.94,"end":3873.54,"speaker":"Fr Stephen De Young","text":"You need to be more concerned about this."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3874.18,"end":3876.26,"speaker":"Fr Andrew Stephen Damick","text":"So this is like a mint and cumin thing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3876.82,"end":3902.19,"speaker":"Fr Stephen De Young","text":"Right. And there's, there's also. So there's another element here in terms of rabbinical interpretation too, where the way in which they're publicly calling out Jesus disciples, subjecting someone to that kind of public humiliation is something that's forbidden to those in authority. So there's a level of that too. Yeah, I mean, Christ is correcting, judging."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3902.19,"end":3903.71,"speaker":"Fr Andrew Stephen Damick","text":"Another man's servant kind of thing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3903.79,"end":3904.19,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3904.75,"end":3911.71,"speaker":"Fr Andrew Stephen Damick","text":"Which I mean, until and then when the Internet was invented, then you can judge everyone else's servant and their masters."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3912.19,"end":3924.51,"speaker":"Fr Stephen De Young","text":"Yeah, that's cool. But I don't see how you can read that and get out of it. That what Jesus is saying is, you know, don't listen to those Pharisees, eat without washing your hands. I don't think that's a viable interpretation."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3925.59,"end":3928.23,"speaker":"Fr Andrew Stephen Damick","text":"Is that clear, Brian? Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3928.23,"end":3929.03,"speaker":"Fr Stephen De Young","text":"Yeah, thank you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3929.35,"end":3940.07,"speaker":"Fr Andrew Stephen Damick","text":"Great. All right. Thank you very much for calling. We're going to take one more call before we roll on. And we have Caleb calling from Michigan. Are you calling from Michigan, Caleb?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3941.03,"end":3943.27,"speaker":"Dan","text":"No, I am calling from the Upper Peninsula."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3943.67,"end":3947.39,"speaker":"Fr Andrew Stephen Damick","text":"Oh, you don't consider that. Well, are you? Are you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3947.39,"end":3949.51,"speaker":"Fr Stephen De Young","text":"So you're saying no to Michigan?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3949.83,"end":3955.68,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. He's a yooper, but apparently considers that to be a separate entity."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3955.68,"end":3958.92,"speaker":"Fr Stephen De Young","text":"You don't even consider the trolls your company, your countrymen? I guess?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3959.8,"end":3962.44,"speaker":"Dan","text":"No, I consider them like North Ohio."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3963.16,"end":3964.04,"speaker":"Fr Stephen De Young","text":"Oh, wow."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3964.68,"end":3968.04,"speaker":"Dan","text":"Wow, yeah, that was a dis."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3969.4,"end":3972.2,"speaker":"Fr Andrew Stephen Damick","text":"Well, what's on your mind, Caleb from the up?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":3974.44,"end":4054.57,"speaker":"Dan","text":"My question, it's bit of a delicate question because there are so many people that have been harmed by divorce. And coming from a. I was a conservative Anabaptist before I was brought into the church a few years ago. And in Matthew 19, Christ gets asked questions about divorce. Is it okay to divorce our wives for just any reason? And he says, you know, having not read that God created a male and female and that they should come together, become one flesh. And they say, well then why did Moses give us the ability to write out a writ of divorce? I just re listened to Deuteronomy and it was kind of interesting, but he said, because of the hardness of your hearts. But from the beginning it was not so. And when I'm having discussions with extended family or friends, this one always comes up. And I try to explain that church's position on this is a little bit more nuanced than just allowing divorce, but it is a very difficult question. I would love to hear a whole show on this, but particular to this series or these two episodes, what is going on there? Authority wise, where Christ is saying, yes, Moses told you this, but that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4055.78,"end":4061.54,"speaker":"Fr Andrew Stephen Damick","text":"So what do you think, Father? Is this a. Moses said this, but that. Is he changing what Moses said?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4061.78,"end":4110.97,"speaker":"Fr Stephen De Young","text":"No, I mean, Christ obviously is pointing out the original created intent when God created the world that there would not be divorce. That's the two, Right? As he says, the two would become one flesh and be together forever. That was the original sort of intent behind marriage. But notice Christ doesn't say Moses was wrong or all of you who did what Moses said were actually sinning. Moses had the authority to make that judgment call. Christ is not denying that. He's explaining why. Right. That he said, you know, he looked at you people, he saw how hard your hearts were, and he. He made a concession. Basically. He made a ruling that was a concession to your weakness."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4111.21,"end":4116.33,"speaker":"Fr Andrew Stephen Damick","text":"But he put. He put some boundaries around it, saying, right, you. You can't just throw her out."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4116.41,"end":4117.77,"speaker":"Fr Stephen De Young","text":"You can't just abandon her."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4117.85,"end":4118.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4118.25,"end":4137.29,"speaker":"Fr Stephen De Young","text":"Yeah. You have to. You have to give her a writ of divorce. And of course, at that time, you know, they were abusing that concession to like, oh, it's okay. I can divorce her for any reason as long as I give her a writ of divorce. Which also pretty sure isn't what Moses intended when he made that concession."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4137.77,"end":4138.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4139.45,"end":4187.16,"speaker":"Fr Stephen De Young","text":"And this really carries over into the church's practice regarding divorce, which is, we all acknowledge, it's a bad thing. The church doesn't give divorces. The church penances divorces, meaning the church helps people who have been harmed and damaged by going through a divorce, helps them heal and be reintegrated into the community and come close to God again. That's what the church does. Now, there's some other folks out there based in Italy who will say, oh, no, we don't allow divorce, but if you give enough money to your local bishop, you can get an annulment where we say that you were never married and all your kids are illegitimate."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4187.55,"end":4189.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, all you did was fornicate."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4189.31,"end":4197.47,"speaker":"Fr Stephen De Young","text":"So we create this elaborate fiction and pretend that no divorce happened. What's the problem with that? Well, there's no healing in that for anyone."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4198.35,"end":4198.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4201.07,"end":4229.08,"speaker":"Fr Stephen De Young","text":"It'S a nice legal dodge, and it helps your apologists score points. By saying they don't. They don't allow divorce. But you're not actually helping anyone enter the kingdom of heaven because you're not helping anyone heal, you're not helping anyone grow, and you're not helping the situation. So the same thing. And anybody who has a problem with the church allowing people to have a second marriage, go read the service of second marriage. I've done one."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4229.48,"end":4230.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, me too."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4230.28,"end":4318.45,"speaker":"Fr Stephen De Young","text":"Okay. When you're standing there doing one and you're literally reading St. Paul, saying, you know, well, we're basically here because it's better for you to marry than to burn with lust in a public wedding ceremony. You get the drift, right? We're not saying, oh, this is fine. We're saying, look, this is the real world. Bad things happen. People have hard hearts. We're not in the ideal world. We're in a sinful world. And so we've got to do the best we can. And the people who have the authority to bind and to loose, to allow things and not allow things, those people have to use that authority to try to help people enter the kingdom of heaven, because that's what Christ is condemning the Pharisees for. All through that chapter we read, you're supposed to be trying to help people enter into the kingdom. And instead you're stopping them. You're making it harder. You're blocking the door. You're burdening them down and not lightening their load. So you're doing the exact opposite of what you're supposed to be doing with your authority. But shepherding someone toward the kingdom requires both mercy and discipline. That's why we get called Father, because it's like parenting a child, right? You have to have mercy and discipline and know when to apply which in order to help guide them to where they need to be."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4319.17,"end":4327.02,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thanks for calling, Caleb, and greetings to all the hosers up there in the Upper Peninsula of Michigan."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4328.38,"end":4329.34,"speaker":"Dan","text":"All right, sometime."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4329.9,"end":4337.02,"speaker":"Fr Andrew Stephen Damick","text":"Bye. Bye. I would love to. You know, one of. One of the bishops of our archdiocese is from Iron Mountain, actually. Bishop Anthony. He's a Yooper."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4337.82,"end":4343.26,"speaker":"Dan","text":"Yes, I know. I know. Bishop Anthony. Yeah, he got. He got stolen from us."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4343.74,"end":4345.26,"speaker":"Fr Andrew Stephen Damick","text":"Alas. Alas."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4345.34,"end":4354.66,"speaker":"Fr Stephen De Young","text":"I have a former resident, too. Down here is a parishioner. Oh, and boy, was that a weather shock. Southern Louisiana after leaving the Upper Peninsula."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4355.06,"end":4367.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes. All right. Okay. Well, here we are in the second half of this episode of Lord of Spirits. What exactly is it that the apostles get like? What is the authority that Jesus gives to them? How does that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4367.46,"end":4370.14,"speaker":"Fr Stephen De Young","text":"Well, now we can Move on. So people can stop hating on the Pharisees."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4370.14,"end":4371.82,"speaker":"Fr Andrew Stephen Damick","text":"Everybody I know, I know."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4371.82,"end":4373.04,"speaker":"Fr Stephen De Young","text":"Hating on them. Pharisees."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4373.51,"end":4382.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just a lot of people just utterly incredulous that they had any kind of authority whatsoever. Yep. But God bless you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4382.47,"end":4391.27,"speaker":"Fr Stephen De Young","text":"It's in the Bible. Read it, Read it, fellas. I'm not using fellows as gendered language there. I'm using it in the Seamus sentence."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4393.59,"end":4394.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4394.15,"end":4414.66,"speaker":"Fr Stephen De Young","text":"So that change, just historically, not just from a Christian perspective, but historically gets broken. But what we find when we read the New Testament closely is that Christ begins a new chain. Christ begins a new ordination. That's coming from him and his authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4414.82,"end":4415.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4415.38,"end":4426.1,"speaker":"Fr Stephen De Young","text":"So remember where Moses's authority actually starts? Where does that start? That starts when Moses sees God. So Christ's new chain is going to start with the apostles, because what did the apostles do?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4427.39,"end":4428.19,"speaker":"Fr Andrew Stephen Damick","text":"They saw God."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4428.27,"end":4453.63,"speaker":"Fr Stephen De Young","text":"They saw God. So already in the Gospels, Christ is going to talk about the fact that he is going to give. He is going to give this authority to his disciples and apostles. And one of the most famous places he starts talking about that, a passage about which there is no controversy whatsoever, is in Matthew 16:13, 20."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4454.35,"end":4510.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. All right. Matthew 16, 13:20. Now, when Jesus came into the district of Caesarea, Philippi, he asked his disciples, who do people say that the Son of Man is? And they said, some say John the Baptist, others say Elijah, others Jeremiah or one of the prophets. He said to them, but who do you say that I am? Simon Peter replied, you are the Christ, the Son of the living God. And Jesus answered him, blessed are you, Simon bar Jonah, for flesh and blood has not revealed this to you, but my Father who is in heaven, and I tell you, you are Peter, and on this rock I will build my church, and the gates of hell shall not prevail against it. I will give you the keys of the kingdom of heaven. And whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven. Then he strictly charged the disciples to tell no one that he was the Christ."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4513.2,"end":4515.56,"speaker":"Fr Stephen De Young","text":"So that's totally clear and uncontroversial, I'm sure."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4515.56,"end":4517.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, no one's argued about this."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4517.44,"end":4531.76,"speaker":"Fr Stephen De Young","text":"This is just saying, St. Peter, you're the Pope, when I leave, you take over. Yeah, no, obviously not. Well, maybe not obviously. Sorry, sorry. Roman Catholic listeners. Right. To whom that may actually seem obvious."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4532.08,"end":4536.98,"speaker":"Fr Andrew Stephen Damick","text":"I mean, hey, you and I are priests of the successor of Peter, so."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4537.06,"end":4538.46,"speaker":"Fr Stephen De Young","text":"Well, yeah, Right, yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4538.46,"end":4540.26,"speaker":"Fr Andrew Stephen Damick","text":"An Antioch. Yeah, yeah, yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4540.26,"end":4544.98,"speaker":"Fr Stephen De Young","text":"Since Peter and Paul were in Antioch first, man, everybody knows the Reunion tour. Not as good as the original."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4545.54,"end":4546.26,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4547.54,"end":4575.69,"speaker":"Fr Stephen De Young","text":"Had to be there for the original. So that we're talking about authorities. Politic should be pretty clear by now, after an episode and a half or so of this, that this binding and loosing this authority to bind and loose the keys of the kingdom of heaven, that door that the Pharisees were shutting in front of people. This is in Matthew. We're within a couple chapters. All these things, passages we're reading in Matthew are in one big block of text together."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4576.09,"end":4578.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It seems that authority is on Jesus's mind."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4579.13,"end":4637.45,"speaker":"Fr Stephen De Young","text":"Yes. So this is that same authority, that same authority that the Pharisees he's condemned for misusing, even though he acknowledged that they legitimately had it, they've misused it. He's told the Pharisees he's going to take it from them and give it to someone else. And now he's saying to St. Peter, hey, you're at least one of. We'll stay open here since we just read this one text. He's at least one of the people to whom Christ is going to give that authority. And a lot is made, of course, again, people read this text in isolation from the texts around it. A lot is made about the location. And so. And we've talked about the location where, where St. Peter says this and all of these things. But do you think, hear me out here. Do you think that in understanding what verses 13 through 20 are talking about, do you think verses 1 through 12 might be relevant? And have we already read four of those verses tonight?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4637.93,"end":4638.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4638.89,"end":4639.85,"speaker":"Fr Stephen De Young","text":"Yes, we have."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4640.01,"end":4642.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is where they come to Jesus and say, give us a sign."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4643.29,"end":4646.89,"speaker":"Fr Stephen De Young","text":"Right. And then after that, Christ talks about the Levitt of the Pharisees."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4647.46,"end":4651.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which. That's their, that's their hypocrisy. Right. Their bad behavior."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4651.86,"end":4735.34,"speaker":"Fr Stephen De Young","text":"So he's just spent what would become. Because of course, the verse numbers weren't there originally, but what would become 12 verses criticizing the Pharisees use of their authority? And that's when we get to this, that's where we get this story. And this story is not in the same place in the text in all the Synoptic gospels. But here it comes right after the Pharisees and before some more talk about the Pharisees. So it is nested within Christ's critique of the way in which the Pharisees have used their authority. It uses the same language that he's used regarding the Pharisees use of authority. He's told the Pharisees he's taking the authority away from their giving to someone else. And now he's telling St. Peter, I'm going to give it to you, and notice it's I will. So he's not doing it right here, but he's saying he's going to do it at this point. Matthew 16, he's going to to give it to him. Now, we also can't neglect where the text goes. So let's go a little further in Matthew, another little piece in these couple of chapters. We're reading all this stuff out of a couple of chapters out of a few chapters in Matthew. Let's go to Matthew 18, because he's going to use that language again there."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4736.06,"end":4783.94,"speaker":"Fr Andrew Stephen Damick","text":"Okay, starting with verse 15. If your brother sins against you, go and tell him his fault between you and him alone. If he listens to you, you have gained your brother. But if he does not listen, take one or two others along with you. That every charge may be established by the evidence of two or three witnesses. If he refuses to listen to them, tell it to the church. And if he refuses to listen even to the church, let him be to you as a Gentile and a tax collector. Truly, I say to you, whatever you and this is plural. So whatever y' all bind on earth shall be bound in heaven, and whatever y' all loose on earth shall be loosed in heaven. And again, I say to y', all, if two of you agree on earth about anything they ask, it'll be done for them by my Father in heaven. For where two or three are gathered in my name name there am I among them?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4784.58,"end":4787.02,"speaker":"Fr Stephen De Young","text":"Actually, the correct plural is all y'."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4787.02,"end":4787.22,"speaker":"Dan","text":"All."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4787.38,"end":4792.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's the pervasive plural. That means every single last one of you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4794.58,"end":4812.43,"speaker":"Fr Stephen De Young","text":"So here, here's even this piece that we read gets chopped up a little, right? Like, how many times have you heard verse 20 quoted all by itself, as if that's talking about worship. Whereas notice where two or three occurs at verse 16."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4814.27,"end":4816.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is about making this ruling."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4816.31,"end":4859.81,"speaker":"Fr Stephen De Young","text":"Two or three witnesses. So when you act as two or three, those of you with authority, when you act as two or 3, they are acting with Christ's authority to bind and toulouse. This is talking about church leadership. And if you don't believe it just based on that, this whole discussion started in verse one of Matthew 18 when the disciples came to Jesus saying, who is the greatest in the kingdom of heaven? So this is part of a discussion about how authority works in the kingdom, about how authority works in the church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4860.69,"end":4864.21,"speaker":"Fr Andrew Stephen Damick","text":"I mean, this is basically setting up conciliar authority, like."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4864.21,"end":4864.57,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4864.57,"end":4869.81,"speaker":"Fr Andrew Stephen Damick","text":"There's certain things that. That needs to be decided by authority as a group."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4870.61,"end":4882.21,"speaker":"Fr Stephen De Young","text":"Yes. That when they do that. And that's why the use here are all plural. Which tells us, since this is, you know, nowadays two chapters. Right. Later."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4883.26,"end":4883.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4883.38,"end":4888.38,"speaker":"Fr Stephen De Young","text":"And it's the same language, but in the plural, it's not just St. Peter who receives that authority."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4889.5,"end":4889.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4890.86,"end":4892.3,"speaker":"Fr Stephen De Young","text":"It's all of the disciples."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4892.54,"end":4896.06,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. And something similar in John 20."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4897.02,"end":4917.81,"speaker":"Fr Stephen De Young","text":"Well, so this has all been sort of future aimed. I will give this authority to you. This is how you will handle things in the community in the future when your leader's in it. And now as we get to John 20, we're after the resurrection of Christ. We're between the resurrection and the ascension."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4918.21,"end":4919.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4919.97,"end":4925.25,"speaker":"Fr Stephen De Young","text":"And so now some of these things that Christ said he was going to do are going to start happening."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4925.65,"end":4979.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, this should be a very familiar passage to orthodox Christians. This gets read at Agape Vespers, right after, you know, on Pascha. And then also then a bigger selection from John 20 on Thomas Sunday, the following Sunday. So John 20, starting with verse 19. On the evening of that day, the first day of the week, the doors being locked where the disciples were for fear of the Jews, Jesus came and stood among them and said to them, peace be with you. When he had said this, he showed them his hands and his side. Then the disciples were glad when they saw the Lord Jesus said to them again, peace be with you. As the Father has sent me, even so I am sending you. And when he had said this, he breathed on them and said to them, receive the Holy Spirit. If you forgive the sins of any, they are forgiven them. If you withhold forgiveness from any, it is withheld."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4980.55,"end":4991.59,"speaker":"Fr Stephen De Young","text":"So this text is viewed by a lot of our Protestant friends as a problem text because. Well, wait a minute, I thought the apostles received the Holy Spirit on Pentecost."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4992.82,"end":4993.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4993.22,"end":4995.46,"speaker":"Fr Stephen De Young","text":"No, this is not 43 days after this."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":4995.62,"end":5000.9,"speaker":"Fr Andrew Stephen Damick","text":"Right. This is receiving the Holy Spirit for this ministry. He is giving them."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5001.06,"end":5009.78,"speaker":"Fr Stephen De Young","text":"Right. This is different. Right. The Spirit is poured out on all flesh at Pentecost. See Joel 2, which St. Peter quotes."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5009.78,"end":5013.38,"speaker":"Fr Andrew Stephen Damick","text":"This is behind closed doors with just the apostles."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5013.46,"end":5130.43,"speaker":"Fr Stephen De Young","text":"This is just the apostles. This is the beginning. This is now. They have this authority, divine and de loose. That's why he uses the same language. They have now received it. And it's they plural. No apostle is singled out here. Not St. Peter, not the disciple whom Jesus loved, who wrote it. Right. None of them are singled out. It's all of them. Receive this authority. And therefore, each one of them represents the beginning of a chain. Each one of them is now going to become the first link in the chain. But before we move on to that in the third half, we're going to talk about the chains continuing. What kind of authority do we see the apostles exercising it and how do they exercise it in the New Testament? Yeah, we sort of talked about how the prophets after Moses exercised their authority in the Old Testament, how a lot of that is reflected in the text itself. Same is true of the New Testament. A lot of folks don't know, unless you've read my book about it, that Gamaliel, the rabbi, St. Paul's teacher, wrote epistles. We don't have the texts of them, but it is recorded in the Talmud, some of the places he sent letters to, and a sort of a summary of the context, like contents. Like he sent a letter to this community about the date of this feast, like that kind of summary. But so what is. What is Gamaliel doing there? Well, he, as a member of the Sanhedrin, someone who has this authority, is answering questions and making rulings. Four different Jewish communities scattered around the world who recognize his authority and write to him and ask him questions and ask him for these rulings."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5130.59,"end":5130.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5131.71,"end":5137.71,"speaker":"Fr Stephen De Young","text":"And St. Paul, when he begins writing epistles, seems to be doing the exact same thing."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5138.51,"end":5143.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's acting in a very rabbi kind of way, like he's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5143.27,"end":5195.89,"speaker":"Fr Stephen De Young","text":"He's answering questions. He's making rulings on disputes that they're having. He's correcting things. Right. He's applying things. Here's how you ought to do this. Here's how. I mean, very practical. Here's how people ought to dress. Here's how people ought to act. You know, here's how you ought to organize things, like very practical things. And part of this is, again, we have to reorient ourselves to what the epistles actually are, because a lot of us have gotten this really wonky way of looking at not just St. Paul's epistles, but all of the epistles from the apostles. There's a whole vessel with a pestle joke, you know, waiting to be made in here. But that may be so deep in the crates that, like, some of you kids have never seen a Danny Kaye movie. And it shows. But people have this idea that, like, for example, St. Paul's Epistle to the Romans is a systematic theology. Sorry, Calvinists."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5196.29,"end":5197.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5197.65,"end":5404.2,"speaker":"Fr Stephen De Young","text":"It's not. There are philosophical and theological treatises from this time period, like Philo wrote Them who's a Jewish guy, century before St. Paul. St. Paul was super educated. He could have written those if he wanted to. For all we know. He may have written some of those, but they're not in the Bible. Right. So they're not scripture. That's not what epistles are. Epistles are letters to communities of people dealing with actual real time issues, problems, disputes, things that need to be taught and explained. And that's what the epistles are doing. Not just St. Paul's St. James, St. Peter, St. John. That's what they're all doing by these epistles. They're making rulings, they're exercising their authority and dealing with this in the real life right of, of communities. And we're going to get into this more in the third half. But after the last Epistle written in the New Testament, people with authority in the church don't stop writing epistles. That keeps right on going. But we'll talk more about that in the third half. Yeah, the other way we see them exercising their authority. So that's basically Acts as narrative where we see them exercising their authority. And the rest of the Bible is basically epistles. Even Revelation has, has the letters attached to the beginning. So pretty much the whole rest of the New Testament is epistolary literature, which is them firsthand exercising this authority. But then in Acts, we read secondhand descriptions of them exercising this authority. And the primary way we see that happening is conciliar authority. And that conciliar authority exhibit a is Acts 15 and the council held in Jerusalem. But even outside of that, right. I mean that's an exhibit A because that's everybody getting together formally to resolve a question. But there are all kinds of times, you know, St. Paul visits and he meets with Saints Peter, James and John. Like we see these other episodes of the apostles coming together and doing things together in the book of Acts, it's not just limited to the council. We also see, and there are two elements here to this conciliatory. There's conciliarity, but there's also primacy. On one hand, this authority is given to all the apostles. On the other hand, within the operation of the apostles as a group, there are certain figures who have primacy. And that primacy is primarily there at the beginning. As you get later in the century, it's going to push more towards 1st century, it's going to push more towards Saints Peter and Paul. But in the earlier phase and especially in Jerusalem, it's Saints Peter, James and John. And we see in the Gospels Already Christ, when he goes off by himself, when he does some of his most unprecedented miracles, like raising the dead and things, or when he's transfigured, right. He takes Saints Peter, James and John. Those are the ones who always go with him. And St. Paul is later going to call Saints Peter, James and John the pillars, which is a way of comparing them to Abraham, Isaac and Jacob. So Saints Peter, James and John have this kind of primacy. Here's the really interesting thing, though, that you may not have thought about. The James in Acts is not the same human as the James in the Gospels."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5404.92,"end":5408.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's Peter, James and John, and there's Peter. Different James and John."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5409,"end":5440.05,"speaker":"Fr Stephen De Young","text":"James, the son of Zebedee, is the one who's at the transfiguration, sees the little girl raised from the dead. Right. All these things. And it's St. James, the brother of the Lord, who's the head of the church of Jerusalem, who makes the final ruling at the. At the Council of Jerusalem in Acts 15. That's not the same person. So St. James in the New Testament is in office."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5441.49,"end":5442.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Weirdly."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5445.33,"end":5553.68,"speaker":"Fr Stephen De Young","text":"The successor to St. James is St. James within the New Testament. So that already is telegraphing. That already is sending us a signal. If you're reading it closely, if you're reading the narrative of Acts closely, because the narrative of Acts tells us about St. James, the son of Zebedee, being killed by Herod. So this isn't. He's not trying to pull a switcheroo. He tells us, oh, yeah, that St. James. Now, who I was talking about with Saints Peter and John in the Gospel of Luke in volume one, here in volume two, at the beginning, he dies. But there's this other St. James, who takes his place, and that primacy of those three. And so each of them has authority to make rulings and do what they're doing. And then when there are big things that affect everybody, they gather together. Two or three, right. Or like the Sanhedrin would gather, the elders of Israel would gather, and they make these. They make these decisions together. So it's a pattern we see already with the apostles. It's telegraphing what we're going to see. Because of course, the day is going to come, you know, as we. As we move late into the first century, when we get, you know, there's only going to be one apostle left. That's going to be St. John. By the time you get past, you know, probably 80 A.D. 80 for sure, we've only got one left, and that's St. John. And by the time you get a few years into the second century, St. John is gone, too. So in the third half, we will talk about what happens to that authority that Christ gave the apostles once the apostles aren't around anymore."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5554.73,"end":5562.17,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, you've wasted another perfectly good hour or so of your life listening to the Lord of Spirits podcast. We're going to be right back with the third half. See you soon."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5562.41,"end":5578.73,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5590.98,"end":5644.68,"speaker":"Fr Stephen De Young","text":"Perhaps you are a seeker exploring the abundance of the Orthodox faith. Or maybe you're a young mother wanting to share the fullness of Orthodoxy with your children and family. Or perhaps you are single, trying to find shelter from unclean images or words, or an empty nester wanting to fill your time with edifying thoughts, prayers, discussions and content. Or maybe you feel alone and just want to find solace and comfort regardless of your own unique circumstances. Ancient Faith Radio is here to help with your Orthodox journey. Please consider partnering with us by becoming a monthly recurring donor so that we can continue our mission to spread the Orthodox faith and help support the spiritual lives of the already faithful. Any consistent donation, large or small, will enable us to focus on our mission unabated. Simply visit www.ancientfaith.com support and start your monthly donations today. All gifts are tax deductible and greatly appreciated. Thank you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5646.6,"end":5662.72,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5663.44,"end":5699.65,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back. It's the third half of the 119th episode of the Lord of Spirits podcast. We're talking about apostolic succession, the authority given by God first to Moses and his successors and now to the apostles of Jesus and their successors. So we left off talking about the authority given to the apostles. So what happens next in this exciting episode? I know this is like an early episode of Laura Spirit's podcast. I call in Father Stevens, just not even there. I love it. It's very retro."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5701.25,"end":5703.01,"speaker":"Fr Stephen De Young","text":"It'd help if I turned my mic back on."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5703.25,"end":5708.45,"speaker":"Fr Andrew Stephen Damick","text":"Oh, should I find a Mexican radio station?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5708.61,"end":5711.76,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. We can start playing that in the background. There's. There's no calls."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5711.76,"end":5712.08,"speaker":"Fr Andrew Stephen Damick","text":"We've."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5712.08,"end":5715.36,"speaker":"Fr Stephen De Young","text":"We've pacified everyone and I. Yeah, I."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5715.36,"end":5718.12,"speaker":"Fr Andrew Stephen Damick","text":"Think I don't know. I think we've either made all the people."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5718.12,"end":5720.64,"speaker":"Fr Stephen De Young","text":"Pharisee talk triggering everyone, all of the."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5720.64,"end":5728.6,"speaker":"Fr Andrew Stephen Damick","text":"The anti Pharisee types who are not going to buy the T shirt that says be a Pharisee. I think they. They walked off angry. So."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5728.68,"end":5729.24,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5729.32,"end":5733.08,"speaker":"Fr Andrew Stephen Damick","text":"It's okay. It's okay. It's all right. You're welcome."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5733.56,"end":5736.84,"speaker":"Fr Stephen De Young","text":"Don't go away mad. Just go away. No."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5737.64,"end":5740.91,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Don't drive angry, whatever you do."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5740.99,"end":5742.79,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5742.79,"end":5743.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5743.55,"end":5746.83,"speaker":"Fr Stephen De Young","text":"It does not indeed stop with the apostles."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5747.23,"end":5747.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5748.27,"end":5773.7,"speaker":"Fr Stephen De Young","text":"As we said, the apostles are the beginning of a new chain of authority. Because just like we said about the Torah and about the rest of the Hebrew Bible. Believe it or not. Believe it or not, even once we add in the New Testament writings to Scripture, there are still some questions that people have about how to interpret and apply various things."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5774.82,"end":5777.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Rulings need to be made."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5779.06,"end":5794.9,"speaker":"Fr Stephen De Young","text":"Yeah. And let's Protestant friends gather in. This is not a dunking on sola scriptura thing. It honestly isn't. You gotta admit there's. There's a lot of questions."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5795.38,"end":5795.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5796.1,"end":5804.06,"speaker":"Fr Stephen De Young","text":"I mean, just like, not everything having to do with the Christian life and theology is abundantly clear to everyone who reads the scriptures."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5804.06,"end":5804.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5804.34,"end":5808.02,"speaker":"Fr Stephen De Young","text":"We all. We all know that you don't have to read textual scripture to say that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5808.18,"end":5818.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is why y' all have. Have preachers and commentaries and like, you got people that are interpreting and applying, making rulings too."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5819.3,"end":5847.23,"speaker":"Fr Stephen De Young","text":"Problem is. Problem is all those folks are doing it differently. And so the issue is just as the issue faced in Deuteronomy by the Israelites. Well, how do we know who the person is? How do we know who to listen to? If I got five guys, I'll call themselves prophet, and they're all saying different things. How do I know who really has the authority to rule on this?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5847.95,"end":5852.83,"speaker":"Fr Andrew Stephen Damick","text":"Well, you know, on that question, we have. We have a caller calling."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5852.83,"end":5853.39,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5853.71,"end":5855.23,"speaker":"Fr Andrew Stephen Damick","text":"From the Great White north."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5857.23,"end":5859.39,"speaker":"Fr Stephen De Young","text":"Even further north of the Upper Peninsula."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5859.79,"end":5861.47,"speaker":"Fr Andrew Stephen Damick","text":"That's correct. From Ontario."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5862.27,"end":5865.47,"speaker":"Fr Stephen De Young","text":"Although, you know, well, depending on where in Ontario, that could be south."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5865.71,"end":5871.07,"speaker":"Fr Andrew Stephen Damick","text":"I know. It's true. It's true. That's the thing about Canada. So much of it is south of America."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5871.6,"end":5871.92,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5871.92,"end":5883.6,"speaker":"Fr Andrew Stephen Damick","text":"It's not South America, but yes. So we have Dan calling from Ontario. See the call board, it's saying Ontario, Cali. Like California, but that can't."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5883.6,"end":5886,"speaker":"Fr Stephen De Young","text":"Oh, Ontario, California. That's a whole different place."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5886.08,"end":5887.12,"speaker":"Fr Andrew Stephen Damick","text":"Is that really true?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5887.44,"end":5889.28,"speaker":"Fr Stephen De Young","text":"Yes, that's the ie. No, that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5889.84,"end":5891.52,"speaker":"Fr Andrew Stephen Damick","text":"Dan, are you from California?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5892.64,"end":5894.24,"speaker":"Dan","text":"I am actually from California."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5894.56,"end":5896.64,"speaker":"Fr Stephen De Young","text":"Ontario, California, California."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5897.05,"end":5897.37,"speaker":"Dan","text":"Okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5897.37,"end":5898.97,"speaker":"Fr Stephen De Young","text":"You know, I grew up in Redlands, Right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5899.93,"end":5907.33,"speaker":"Dan","text":"I do, I do. And I know there's an interesting story about you and something about what I'm gonna ask about that happened."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5907.33,"end":5914.89,"speaker":"Fr Stephen De Young","text":"Okay. Yeah, no, Ontario, California is a real place. They had a cool mall back in the day."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5915.05,"end":5917.61,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I knew that there was an Ontario, Ohio, but."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5917.77,"end":5921.45,"speaker":"Fr Stephen De Young","text":"Yeah, no, Ontario Mills, while they have an airport, too. It was like the cheaper airport."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5924.96,"end":5928.92,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, Dan, I'm a little disappointed you're not from Canada, but that's okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5928.92,"end":5932.88,"speaker":"Fr Stephen De Young","text":"I, on the other hand, think Ontario, California is way better than Canada, so."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5936.32,"end":5938.16,"speaker":"Fr Andrew Stephen Damick","text":"All right, Dan, what is on your mind?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5939.36,"end":5961.15,"speaker":"Dan","text":"Well, I have a question and I also have a hot take. So my question is everything that you guys have described about the prophets and the laying out of hands and. And things like that kind of sound like a lot of what Joseph Smith said. And."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5961.63,"end":5963.15,"speaker":"Fr Andrew Stephen Damick","text":"Well, where do you think he got it from?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5964.35,"end":5977.55,"speaker":"Dan","text":"Well, that's the thing. I mean, was he a genius who happened to be able to know everything about the Bible and recreate it in a. A story? Or did he maybe actually have it happen?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5978.11,"end":5979.55,"speaker":"Fr Andrew Stephen Damick","text":"Can I start with this one, Father?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5979.79,"end":5980.99,"speaker":"Fr Stephen De Young","text":"Oh, no, go for it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5981.23,"end":5982.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5983.07,"end":5983.59,"speaker":"Fr Stephen De Young","text":"I have."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":5983.59,"end":6005.2,"speaker":"Fr Andrew Stephen Damick","text":"I have a. I don't know. I have an enduring love for Mormons. I love Mormons. I've been to many Mormon historical sites, including the one that is right here in Pennsylvania, Dan, which is called the priesthood restoration site. Did you know about this? I'm checking your LDS knowledge, Dan."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6006.32,"end":6017.04,"speaker":"Dan","text":"Yes, that's where Joseph Smith had a vision of. I think it was. It was. Yeah, it was Peter, James and John."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6017.92,"end":6020.32,"speaker":"Fr Andrew Stephen Damick","text":"So that's part of it. Yeah, you got part of it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6020.32,"end":6026.64,"speaker":"Dan","text":"And so, yeah, they restored the Melchizedek priesthood upon Joseph."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6027.28,"end":6166.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a site now, it's no longer called this, but back when he was up there, it was called Harmony, Pennsylvania. Now it some kind of lame something or other township name, but Harmony, Pennsylvania, up on the Susquehanna. And there he and his buddy Oliver Cowdery baptized each other in the Susquehanna. And Joseph Smith claims that he saw Peter, James and John. They gave him the Melchizedek priesthood. But he also said that he saw John the Baptist, who gave him the Aaronic priesthood. And also he lived up there for a while. And that's where he says that he translated the golden plates that he got up there in upstate New York. And I've visited this site actually a couple of times. And yeah, it's true that he's essentially, he's reading the Bible and he's claiming to have experiences like the apostles had or whatever. But there's actually something quite interestingly different between what he even claims, which number one, I will say I do not believe that that happened to him or that it. Or that whatever happened to him is not exactly the way he interpreted it. I'll just put it that way. I'm not saying he didn't have some kind of spiritual experience, but doesn't mean it was a good one. But he claims that he, you know, that these saints appeared to him and ordained him, which is different than the way that prophecy becoming a prophet works everywhere in the Bible, which is that God directly picks you. You know. Now, obviously the Mormon system works different, but that is a pretty significant difference, even what he says about it. Now, I don't believe that Peter, James and John ordained him. I do not believe that John the Baptist ordained him. But, yes, he's clearly drawing on these traditions and claiming them for himself. I do recommend. I mean, you might well know way more about this than I do. But for those who don't, maybe there's a book that I recommend reading to get a sense of Joseph Smith. I mean, there's a number of biographies of him. There's actually a new one that just came out. I can't remember the author, but the one that I like the best is by a woman named Fawn Brody. And Fawn Brody was the niece of one of the prophets, presidents of the LDS Church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6166.52,"end":6166.81,"speaker":"Dan","text":"And."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6166.88,"end":6254.45,"speaker":"Fr Andrew Stephen Damick","text":"And she wrote a book called no Man Knows My History, in which you get. I think it's a pretty convincing story of the life of Joseph Smith. And you mentioned the idea of like, you know, did he have some kind of ability or whatever. And her take on this, which seems believable to me, is that initially Joseph Smith probably knew that he was a charlatan and that there were some particular events that made him begin to believe in himself and were so convincing that he even convinced his own immediate family that he was a prophet. Like, there was a. He prayed over a woman who had a paralyzed arm and then suddenly just walked out of the room and she lifted her arm. And a lot of people saw that and they said, whoa, you know, now there's all kinds of explanations one could give that. And obviously if somebody's a Mormon, they're going to say that was a miracle through the prayers of Joseph Smith. But, yeah, I mean, he's obviously drawing on some of these same kind of traditions. But there's significant difference even in what he claims. Of course, to me, the most significant difference is that I don't think it happened the way that he said, but it's worth. If someone's driving through Pennsylvania, near northeastern corner of Pennsylvania, it's worth going to. Worth taking the tour. If you're interested in Mormon history, which I am. So does that answer your question, Dan from Ontario, California?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6255.33,"end":6259.09,"speaker":"Dan","text":"Yeah, that answers some of it. You have a spicy taste."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6260.13,"end":6272.14,"speaker":"Fr Andrew Stephen Damick","text":"What's your spicy take? We do have Mormon listeners, right? So just. Although they seem to be pretty thick skinned, our Mormon listeners are very thick skinned. They're still with us. So God bless you guys. We do love you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6273.9,"end":6279.5,"speaker":"Dan","text":"My spicy take is that actually Captain Janeway is the best captain in all of Star Trek."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6280.78,"end":6294.62,"speaker":"Fr Stephen De Young","text":"Okay, now you've lost all credibility. Cut that guy off. You've lost all credibility. Every episode she tries to blow up her own ship and another endless, tedious argument with Chakotay. Come on."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6295.9,"end":6300.05,"speaker":"Dan","text":"But Kirk did blow up his ship, which makes him a much lesser cap."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6301.57,"end":6316.77,"speaker":"Fr Stephen De Young","text":"So Kirk knew he was in a dangerous spot. But you notice when Kirk blows up his ship, there's this whole elaborate thing you have to go through to activate the self destruct. Like, Janeway was so ready to do it. It was just like code Janeway 1, blow up the ship."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6317.17,"end":6317.65,"speaker":"Fr Andrew Stephen Damick","text":"Boom."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6318.05,"end":6322.05,"speaker":"Fr Stephen De Young","text":"Like she had it like on a speed dial. Right. Just hit the button, blow the ship up."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6325.71,"end":6332.27,"speaker":"Dan","text":"Father Stephen, will you please once tell us the story of why you got kicked out of the temple? And I'm pretty sure it was the one in Redlands."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6332.75,"end":6342.83,"speaker":"Fr Stephen De Young","text":"No, it was not. It was the one in Salt Lake City. Okay. But there's not time to tell that story now. I will at some point. At some point, maybe at the Lord Spirits Conference, I don't know."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6342.83,"end":6344.51,"speaker":"Fr Andrew Stephen Damick","text":"And then you will know that the end is coming."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6344.91,"end":6348.51,"speaker":"Fr Stephen De Young","text":"Right. Well, let me add on the question. Let me add a piece on the question."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6348.91,"end":6349.55,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6349.79,"end":6381.26,"speaker":"Fr Stephen De Young","text":"To me, the issue is central to our argument last time, and this time is connection. That there is a direct chain, a direct connection going down through the centuries, going back to the apostles. And to me, the biggest thing that rules what Joseph Smith is saying there out of court is the whole idea of the great apostasy, the idea that that chain was fundamentally broken for."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6381.26,"end":6381.82,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6381.98,"end":6383.02,"speaker":"Fr Stephen De Young","text":"1800 years."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6383.1,"end":6386.54,"speaker":"Fr Andrew Stephen Damick","text":"Restoring the church, or close to 17, disappears all those years."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6387.18,"end":6391.02,"speaker":"Fr Stephen De Young","text":"Right. And by the way, Mormonism is not alone in that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6391.58,"end":6392.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A lot of. A lot of church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6392.86,"end":6394.94,"speaker":"Fr Stephen De Young","text":"Right. There are a lot of restorationist groups."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6395.1,"end":6395.58,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6395.58,"end":6412.23,"speaker":"Fr Stephen De Young","text":"A lot of even, like reform groups will talk about, you know, the Pauline Gospel being lost and being recovered by Martin Luther. And to me, any theological viewpoint that requires the gates of hell to have prevailed against the church for some number of centuries. I rule it out of court."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6412.87,"end":6413.59,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6413.75,"end":6422.23,"speaker":"Fr Stephen De Young","text":"That's. That's just my perspective on it. And that's. That, I think, is the point of discontinuity between what we're saying and what Joseph Smith said."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6423.43,"end":6436.29,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling, Dan. All right, all right, we will. We'll take one. My father. Oh, we have, we have Yvonne calling from New York. So, Yvonne, welcome to the Lord Spirits podcast."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6436.85,"end":6447.09,"speaker":"Yvonne","text":"Hi, fathers. Welcome and thank you. Captain Janeway is the best, but I'm not going to argue that point. I'm just going to say it, period."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6447.89,"end":6448.45,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6449.17,"end":6590.36,"speaker":"Yvonne","text":"Also, you, you partly answered my question, I think when William called and he asked about was Moses a prophet and. Or a priest? And you, you had said that, yes, he was a prophet. And my question is regarding that. That was part A of my question, which you already answered. And then part B regarding that had to do with, like, you know, how in the Nicene Creed it says the Holy Spirit spoke by the prophets. Right. And also regarding, like, the authority given. So like Peter in his Epistle, he talks about how he has authority, but then he goes on to say, like, he equates prophecy with teaching, which I was going to ask, like, is that the same thing prophesying and teaching, which. I think you had already said yes to that in a previous episode about prophecy. But then also he says that prophecy came not in old time by the will of man, but holy men of God spake as they were moved by the Holy Ghost. So my question is that the Holy Spirit being, you know, the third person of the Trinity being actually God. Right. If a prophet is being used as a vessel by the Holy Spirit, then in the last episode, when you were speaking about how Moses was given free will to kind of decide, you know, and rule and this and that, it almost sounded like he was speaking separately from God. Whereas according to the Nicene Creed and then this letter from Peter, it means, you know, I was under the impression that every word spoken by the prophet was spoken by the Holy Spirit. And then also, real quick, when Jesus is to the Pharisees, you nullify the word of God for the sake of your tradition. That sounds like there is a separation. Like the Pharisees are speaking a word that nullifies God, words which would mean that the Holy Spirit would intend one thing and they were not allowing themselves to be used as a vessel. Does that question make sense or should I rephrase it? Or was it rambly."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6591.32,"end":6594.92,"speaker":"Fr Andrew Stephen Damick","text":"It was a little bit rambly, but I think not. It was fine."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6595.24,"end":6596.48,"speaker":"Fr Stephen De Young","text":"Yeah, no, no, it's fine."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6596.48,"end":6597.28,"speaker":"Fr Andrew Stephen Damick","text":"It was fine. It's fine."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6597.28,"end":6613.72,"speaker":"Yvonne","text":"I get it. Right. It's basically about the Holy Spirit. Like what role. When somebody who is in a position of a prophet is speaking, at what point do they say, oh, this is me talking separate from the Holy Spirit?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6613.96,"end":6634.53,"speaker":"Fr Stephen De Young","text":"So I'm going to say those aren't separate. Yeah, right. Those, those aren't two different things. So like the Scriptures. Every word of the scriptures. And the quote you gave is on Point from St. Peter. The, the every word of the scriptures."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6634.77,"end":6635.17,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6635.17,"end":6635.65,"speaker":"Fr Stephen De Young","text":"God."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6637.73,"end":6638.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6638.09,"end":6798.08,"speaker":"Fr Stephen De Young","text":"Ultimately comes from God, comes from the Holy Spirit's guidance. We would say the decisions of the church councils are guided by the Holy Spirit. All these things are guided by the Holy Spirit. Apart from God, we can do nothing. But that doesn't mean that all the humans involved are robots or just being puppeted. And this is. So this is part of this dilemma in sort of Western thinking. It's part of Plato brain that like. And it's what produces things like Calvinism, right, Where a Calvinist will say, well look, if unless God is in absolute control and he does everything and is just puppeting everything, then how can he predict the future? Because someone could make a choice and ruin everything. And that's not the understanding of, of Scripture. The understanding of scripture is that there is a human being. And if you read especially the New Testament in Greek, in the original Greek, you could very much tell it's different humans who wrote this, some of their Greek is really bad. It's not good Greek, it's not all the same Greek. A human sat down and wrote this. St. Paul sat down and wrote a letter to the church in Rome. He didn't sit down and say, well, today I'm going to write some scripture, or he didn't go into a trance and wake up. And the Holy Spirit had written this. He wrote a letter helping them solve their problems, making rulings, saying, this is, this is what you should do by my authority as an apostle. And we believe that God was guiding him in the decisions he made and the rulings he made and what he said. And then God guided the church into including the epistles we have from St. Paul in scripture, including those and not other things St. Paul wrote. He wrote other letters to the Corinthians, we know that aren't in the Bible. Right. But the Holy Spirit guided the church so that the ones that God wanted to be there in the New Testament are there in The New Testament. But again, God didn't have to take away anyone's free will all along the line in order to do that. So both of those things are always true. People are always acting freely and using the abilities and gifts and the authority and all the things that God gave them freely. And God judges them for how they use those things and how they apply those things. And at the same time, God, the Holy Spirit is guiding all of human history toward an end."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6798.48,"end":6799.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6799.52,"end":6879.46,"speaker":"Fr Stephen De Young","text":"And in terms of the other piece with the Pharisees, with the Kurban rule, again, it's important that we take it in context. Right. What is the tradition that Christ is talking about? The tradition Christ is talking about is the Corban Rule. What is the Corban rule? The Pharisees said that you could dedicate all of your possessions to the temple, essentially. Okay, you could say, you know what? When I die, instead of leaving all of my property and all of my belongings to my heirs, I'm going to leave it to God. I'm going to give it to the Temple. Now, there's nothing wrong with that. That's. I mean, it's a tradition in that. It's not in the Torah explicitly to do that or that you can do that. But they ruled that, you know, hey, this is something that would be allowable within the Torah for you to do this. Christ isn't criticizing people for doing that. But here's the thing. Some of the Pharisees were then using that and saying, for example, well, I've dedicated all my belongings to the temple. When I die, that means I can't, you know, go giving my. Give money to the poor. I can't spend this money to take care of my parents."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6880.5,"end":6880.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6880.9,"end":6883.7,"speaker":"Fr Stephen De Young","text":"I can't spend this money to these things because I've already promised it to God."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6884.18,"end":6885.62,"speaker":"Fr Andrew Stephen Damick","text":"I'm doing legacy giving."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6886.62,"end":6982.95,"speaker":"Fr Stephen De Young","text":"And so they were using that. They were exploiting that. And in the way they exploited it, they were not honoring their father and mother. They were neglecting mercy and compassion for the poor. Right. All of these things that the Torah commands, they were using this tradition to try to get around. And so Christ was criticizing them for how they were abusing the tradition. He wasn't saying there's anything wrong with the tradition. I don't. I don't think any Christian today would say it's wrong for someone in their will to leave some portion or even all of their possessions to the church if they want to. I don't. I don't think a Christian would say, no, that's Evil. But if someone did that and then, like, their child was in trouble and they refused to help their child, then we'd have a problem there. We'd be like, whoa, like, leaving money to the church is a good thing, but you have other responsibilities with the money that God gave you. And you leaving the money to the church doesn't let you off the hook for those other responsibilities. So that's the discussion Christ is having. And I know it gets taken out of context a lot, and I know a lot of our Protestant friends, we would use that to say, therefore, all traditions are bad, which is just sort of woefully out of context. Like, there's no way to get that. It's a distortion to even say that Christ is saying that particular tradition is bad, let alone all traditions are bad. Right. It's how they're abusing that tradition. And so he's saying, like, look, yeah, you're following your tradition, but you're violating the commandments. Right. That's not good."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":6984.47,"end":7001.27,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling, Yvonne. I hope that helps. All right, well, rolling on now to the. Here in the third half, succeeding the apostles is a successor, the same thing as an apostle. They're just, you know, apostle."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7001.27,"end":7003.39,"speaker":"Fr Stephen De Young","text":"Well, it's better than part being a failure, I guess."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7003.39,"end":7005.51,"speaker":"Fr Andrew Stephen Damick","text":"Part duh. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7005.51,"end":7070.04,"speaker":"Fr Stephen De Young","text":"So the apostles, of course, are directly commissioned by Jesus in person, and that's sort of one of the requirements. And so that's why St. Paul is always pressing that point. Right. Because there are people who don't want to acknowledge him as having the same apostolic authority, because he wasn't one of the 12 with Jesus, like, during his earthly life. And that's why he's always stressing the fact that, no, he was directly commissioned by Jesus in person after the resurrection, and that Christ actually appears to him several more times after that in the book of Acts. But apostleship stops with the apostles, meaning they don't make the next generation of people apostles. They don't appoint apostles to replace them. We don't get in the pastoral epistles in one and two, Timothy and Titus. Here are the requirements to be an apostle. Yeah, there aren't going to be anymore. In general, anybody who refers to themselves as an apostle in the contemporary world is someone to be marked and avoided, as St. Paul said."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7070.28,"end":7074.28,"speaker":"Fr Andrew Stephen Damick","text":"You mean the new apostolic reformation is not actually apostolic?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7077.17,"end":7078.45,"speaker":"Fr Stephen De Young","text":"No, not remotely."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7079.01,"end":7079.89,"speaker":"Fr Andrew Stephen Damick","text":"Not remotely."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7079.97,"end":7101.57,"speaker":"Fr Stephen De Young","text":"There is no sense of the word apostolic in which the nar is apostolic. They do not teach what the apostles teach. There is no line of succession. There is No, I mean, there's like just zero. Like, yeah, the Mormons have a better claim than the new Apostolic Reformation. So what you have."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7102.62,"end":7102.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7102.82,"end":7121.42,"speaker":"Fr Stephen De Young","text":"What we have discussed is Episcopals, what will become bishops and presbyters and of course deacons. But of course people don't argue that much about deacons. Well, presbyter. Huh? I said well. Well, that's a whole other set of issues. Yes, yes. I'm just germane too."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7121.42,"end":7122.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Throwing that out there."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7125.74,"end":7132.51,"speaker":"Fr Stephen De Young","text":"We coming with your creeping liberalism again? I know where you're. I know you crazy progressive."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7133.23,"end":7143.07,"speaker":"Fr Andrew Stephen Damick","text":"On some days I'm some kind of alt, right. You know, radical. On other days I'm some kind of liberal progressive or whatever."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7143.55,"end":7147.47,"speaker":"Fr Stephen De Young","text":"Yeah. Today I'm feeling I'm a radical anti centrist. Like me."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7147.47,"end":7151.79,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Shire party. That's my party. Shire Party."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7153.47,"end":7174.42,"speaker":"Fr Stephen De Young","text":"And the, the word you will sometimes get, and this is mostly from our Protestant friends, they will say, well, in the New Testament, you know, this idea of Episcopal or bishop and presbyter, they're kind of, they're kind of used interchangeably. There's not really bishops, there's just these two kind of things."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7174.42,"end":7176.26,"speaker":"Fr Andrew Stephen Damick","text":"There's like presbyters and then there's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7176.34,"end":7177.26,"speaker":"Fr Stephen De Young","text":"There's deacons."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7177.26,"end":7179.78,"speaker":"Fr Andrew Stephen Damick","text":"Presbyters, slash bishops and deacons."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7179.86,"end":7183.3,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And they lean toward wanting to use Presbyterian."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7183.61,"end":7184.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7184.69,"end":7230.39,"speaker":"Fr Stephen De Young","text":"Of course, the bishop thing, that's an outlier. Okay. And so they argue. See, you know, there's not sort of a clear three tier structure necessarily of bishop, priest, deacon. Now there certainly isn't the history of the church, but they'll argue in the New Testament. If you just go to the New Testament, that's not clear. There's a few problems with this idea that the titles Episcopal bishop and presbyter are interchangeable. First one is if you read the Apostolic Fathers and New Testament scholars and patristic scholars never talk to each other. So that's why people don't know this. You know that from Papias and other Apostolic Fathers, they frequently refer to the apostles as presbyters."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7230.95,"end":7231.59,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7232.55,"end":7283.26,"speaker":"Fr Stephen De Young","text":"Okay, so St. John, who wrote the gospel, it's referred to by Papias as an elder, as a presbyter. Okay. I don't think any of our Protestant friends would say that the title apostle and the title presbyter are interchangeable. So that tells us that the term presbyter or elder gets more broadly applied beyond just the. An office of presbyter proper. Right. There are people who are apostles. There are other people who get referred to as elders who aren't necessarily a presbyter in the sense that first or Second Timothy talks about presbyters. The other problem with this interchangeable idea is that interchangeable works both ways."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7284.7,"end":7289.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. If something is equivalent one way, then it should be equivalent the other way too. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7289.82,"end":7312.42,"speaker":"Fr Stephen De Young","text":"So while we have lots of examples of apostles and bishops episcopy being called presbyters, we have no instances of run of the mill presbyters being referred to as apostles or bishops. And so apostles and bishops frequently called presbyters as well."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7313.3,"end":7320.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. It just means elder. It's like just a respect for leaders, you know, religious leaders."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7321.03,"end":7327.43,"speaker":"Fr Stephen De Young","text":"But people with the actual office of presbyter don't get called those other two things ever. It's not interchangeable."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7327.67,"end":7365.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and the other thing is that no matter where you look, whether it's the New Testament or the Apostolic Fathers, like, it's super duper clear in the epistles of Saint Ignatius of Antioch, who is writing at the very latest, like maybe 107, maybe earlier. I mean, this guy's a disciple of the apostle John. It's very clear that there's always three levels. So no matter what word you used as a title, there's always one man who's at the center of the community and then there's another group that's around him and then there's another group that are the ones assisting."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7366.3,"end":7366.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7366.78,"end":7379.71,"speaker":"Fr Andrew Stephen Damick","text":"And traditionally these are called bishops, presbyters and deacons, but you might also call them the apostle and the presbyters, bishops and deacons, but there's always one and then a group and then, well, it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7379.71,"end":7381.99,"speaker":"Fr Stephen De Young","text":"Would be apostles, presbyters and deacons. Right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7381.99,"end":7382.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, exactly."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7382.99,"end":7396.11,"speaker":"Fr Stephen De Young","text":"Because if, and this is where this is going, we'll just spoilers telegraph it. Right. If the office of bishop is essentially successor to an apostle, then when there are apostles around, there aren't going to be bishops around."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7396.59,"end":7399.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because you don't need a successor when you've got the original."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7399.39,"end":7401.94,"speaker":"Fr Stephen De Young","text":"Right. You're going to have apostles, presbyters and deacons."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7402.81,"end":7403.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7403.01,"end":7498.14,"speaker":"Fr Stephen De Young","text":"But then when you start losing apostles, the apostles start appointing successors. That is going to shift over time as your apostles go away. Right. To being bishop, presbyter, deacon. And while there are still some apostles around, you're going to have a mix. In some places you're going to have an apostle and presbyters and deacons. Other places you're going to have bishop presbyters and deacons. Right. But part of the, part of the solution to this with, with the way the term presbyter is used in these sources is that you have to understand that this is the Greek word that translates the Hebrew zaken, which means elder. And the term zaken, all the members of the Sanhedrin had that title. Senior scribes had that title. Other rabbis and teachers who were prominent in various places in the Jewish Diaspora had that title. So they're using that same honorary title for all kinds of people who hold authority in the church, not just for the people who have that particular office of presbyter, but using it for them also. And so in terms of isolating, you know, this sort of nascent office of bishop, which is nascent in the New Testament because the New Testament is being written by the apostles. So de facto, the apostles are there while they're writing and active in the churches while they're writing. We get at that by asking, what is Timothy?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7499.74,"end":7500.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7500.62,"end":7546.41,"speaker":"Fr Stephen De Young","text":"What office does Timothy have? Or Titus, These people who Christ or Christ St. Paul appoints. St. Paul is appointed by Christ. St. Paul appoints Timothy and Titus to be overseers of viscopy, which is. Comes from a Hebrew term for a herdsman. That's really where that comes from. And that's why that gets translated as pastor in Latin. Which pastor in Latin, by the way, is the word for shepherd. So going back to the first half, if you think it's wrong to call someone doctor so and so or Father so and so, but it's cool to call them shepherd so and so. Hey, we have one shepherd, and that's Christ, right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7548.09,"end":7550.57,"speaker":"Fr Andrew Stephen Damick","text":"Wait, are you saying Book was some kind of bishop?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7552.73,"end":7715.7,"speaker":"Fr Stephen De Young","text":"Yes, that's what I'm saying. Commander shepherd in Mass Effect also, unless you're playing Fem Shap, then no. No women's ordination, even in bioware games, huh? So Timothy and Titus get sent. Get put in charge of these areas, in charge of these regions by St. Paul, he's doing it self consciously. When you read first and second Timothy and Titus, knowing that his life in this world is coming to an end, and he is appointing them to continue his ministry in these different areas, to be his successor. And one of the things he tells them to do, for example, he tells titus in Titus 1, verse 5 to appoint presbyters at every city. Did St. Paul think any given presbyter could just go around making more presbyters, as many as he wanted in every city he went to. No to say no. And part of the reason I would say no is if you look at Acts 14, verse 23, it talks about St. Paul and his journeys. Appointing presbyters at every city. It's the same language. So he's telling Titus to continue his ministry, and part of his ministry was appointing presbyters in each city. But then what is Titus? He is a successor to St Paul who stands over the presbyters and has the authority to ordain them to lay hands on them and ordain them and make them presbyters. And that is how that laying on of hands, that exact same ritual that was done starting with Moses and Joshua, to pass on and convey that authority, is exactly what the apostles were doing. We read about that in the New testament. In Acts 6, verse 6, they bring the first seven deacons in front of the apostles. They pray, they lay their hands on them and give them authority as deacons. Second Timothy 1, verse 6. St. Paul says to St. Timothy, for this reason I remind you to end and deflame the gift of God which is in you through the laying on of my hands. St. Paul laid his hands on St. Timothy to make him his successor. And in doing that, this was not just a designation. This was not just a rite or a prayer through him laying on hands. Sorry, Protestants who don't believe ordination is a sacrament. St. Timothy received within himself the flame of the gift of God. First Timothy 5:22, he says to him, do not be hasty in the laying on of hands, nor take part in the sins of others. Keep yourself pure."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7716.1,"end":7717.38,"speaker":"Fr Andrew Stephen Damick","text":"So bishops are ents."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7718.02,"end":7735.07,"speaker":"Fr Stephen De Young","text":"Yes, that's exactly what it is. Don't just ordain everybody and anybody. Why? Why is that dangerous? Because you're giving them authority. With that authority, they can do a lot of damage. Yeah, if you weren't giving them any authority, then who cares?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7735.15,"end":7735.95,"speaker":"Fr Andrew Stephen Damick","text":"It wouldn't matter."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7735.95,"end":7738.91,"speaker":"Fr Stephen De Young","text":"Yeah, right. It's an online ordination certificate."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7738.99,"end":7740.27,"speaker":"Fr Andrew Stephen Damick","text":"Universal Life Church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7740.51,"end":7777.63,"speaker":"Fr Stephen De Young","text":"Yes. Like, doesn't mean anything. And then in Hebrews 6:1 and 2, and this is. We won't go into the whole argument now, homily from St. Paul. Right. But says, therefore, let us leave the elementary doctrine of Christ and go on to maturity. Not laying again a foundation of repentance from dead, works of faithfulness toward God, of instruction about baptisms, the laying on of hands, the resurrection of the dead, and eternal judgment. So this is a list of things that the Jewish Christians to whom St. Paul is speaking already know all about. And he doesn't need to say anything about."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7777.79,"end":7779.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is the elementary stuff that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7779.83,"end":7793.31,"speaker":"Fr Stephen De Young","text":"You repent from dead works, you become faithful to God, you're baptized, the laying out of hands, ordination, resurrection of the dead, and eternal judgment. You guys know all about that. As Jewish Christians. Now let's talk about some deeper stuff."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7793.55,"end":7793.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7794.43,"end":7847.17,"speaker":"Fr Stephen De Young","text":"Meaning that these Jewish Christians who he's talking to in the first century already had this understanding of what laying on of hands ordination in the church meant. Meaning it was a carryover of the Jewish practice. So this is a continuation of that original Jewish practice. Right. And so we see here, as St. Paul is appointing his successors, part of the balance of what we were talking about in the last half between individual authority or personal authority and primacy. And then the multiplicity. Right. The conciliarity. And part of that takes the form of regional sovereignty. St. Paul sends people to places."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7847.65,"end":7849.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He appoints presbyters in cities."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7850.37,"end":7864.29,"speaker":"Fr Stephen De Young","text":"Yes. And he sends St. Timothy and St. Titus to particular places to be bishops, to be his successor over this region, over this place. Doesn't send them all the same place. Doesn't send them roaming the earth."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7864.85,"end":7865.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7865.57,"end":7908.54,"speaker":"Fr Stephen De Young","text":"Like Cain and Kung Fu to go from place to face place it just. Right. Gunslingers and you know, wandering bishops. Exercise your authority as you see fit, wherever you see fit. And so by assigning these particular regions, then you have a group of people with authority over particular churches, particular communities who can now gather in council to solve larger issues. And we see some of these successors, like Saint Clement in Rome writing epistles first. Clement, he writes to the church in Corinth because apparently even after all of St. Paul's letters, they still needed some more."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7908.86,"end":7909.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7909.5,"end":7983.63,"speaker":"Fr Stephen De Young","text":"But to make rulings and to exercise this authority. Okay. And so just like we saw with Moses, apostolic succession has these two elements corresponding to the body and the soul. The body being the physical, the laying on of hands, this chain reaching back to the apostles that can be documented. This, this material connection. And then there is a soul to it which is a sharing of the apostolic faith that gives life to the ministry of that person. But the person who's had the laying on of hands, if they don't have the soul part, still has the authority. No donatists here. An atheist who has been properly ordained, the things he does, this baptisms he does are baptisms. Eucharist he does, is their Eucharist, really makes other rulings he makes until. Unless he's deposed. But even when he's deposed, that's not retroactive, like, oh, we gotta go back and re baptize all those people he baptized. Because he was a bum. Right. Because he was faithless."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7983.63,"end":7983.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":7983.99,"end":8015.69,"speaker":"Fr Stephen De Young","text":"Because he was like one of the fairest. Because again, remember what Christ said to the Pharisees, Said a lot of bad things about them personally. And about their life and the way they conducted themselves and said they're on their way to hell, but didn't say, therefore, don't listen to anything they tell you. They still had that authority. Okay. So there's this primacy within regions when they're gathering, as we talked about. And then there's also a primacy that develops from manifest holiness."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8016.41,"end":8024.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The sense that some of them. It's clear that they are set apart in a particular way by God."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8024.81,"end":8028.97,"speaker":"Fr Stephen De Young","text":"Yes. They have particular gifts. They're wise, they're particularly holy. Particularly."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8028.97,"end":8038.65,"speaker":"Fr Andrew Stephen Damick","text":"And it's not a. It's not an institutional primacy. It's that everyone just kind of defers to that one because they can all see that they're holy."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8038.89,"end":8166.54,"speaker":"Fr Stephen De Young","text":"And so there are these kinds of primacies going to narrow in on some things here because there were a lot of pope questions about our last episode. So that's. That's where we're going here at the end of our third half. So, yes, the Orthodox Church believes there's primacy. We have metropolitans, patriarchs. Those are all bishops. Those aren't separate offices. And each of them is sovereign in their own city. The Bishop of Homs is just as sovereign in Homs as the Patriarch of Antioch is in Damascus. But the Patriarch of Antioch has primacy. Right. In terms of the way in which things work conciliarly, the way things work in gatherings. And when. When the bishops come together. We absolutely believe in that. We don't believe that, like, there is no primacy and all bishops are just identical. Also, believe it or not, this may shock some people, Orthodox and not Orthodox alike. The Orthodox Church has always taught Petrine primacy. You don't have to look very far. We just had the feast of Saints Peter and Paul, or we're just about to, I guess, if you're on the old calendar, read the liturgics. Right. St. Peter is the Prince of the Apostles. Right. All that stuff, all that good stuff about St. Peter. Is there some of our Roman Catholic friends, Anytime a church father says anything positive about St. Peter, it's like Pope. No, we don't deny that St. Peter had. We talked about it last night. Saints Peter, James and John had this primacy. St. Peter's certainly one of them, that primacy. The Orthodox Church is also always taught. Get ready for this. Didn't stop when St. Peter died. His successors have a kind of privacy, too. In fact, you need look no further than one of the former bishops of Rome, St. Gregory the Dialogist, also known as Pope St. Gregory the Great. In the west, who, in his letters to the patriarch of Constantinople talks about the three Petrine seas."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8166.94,"end":8172.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not just Rome, but also Alexandria and Antioch. Yes."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8173.11,"end":8215.96,"speaker":"Fr Stephen De Young","text":"And saying those three. The reason those three churches have a kind of primacy is because Antioch and Rome are successors of St Peter and St Mark, who was a successor of St Peter, went to Alexandria and became the bishop there. So you have three patriot sees. And that was acknowledged, by the way, by Constantinople. Which is why, you see, and this may really break the hearts of some of our Greek listeners. And so I apologize in advance, but this is the truth. You could look this up historically. True. When Constantinople was founded, it was not in any way connected with St. Andrew."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8216.68,"end":8217.56,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8217.56,"end":8220.6,"speaker":"Fr Stephen De Young","text":"I mean, that is a tradition that develops over time."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8221,"end":8221.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8221.72,"end":8223.96,"speaker":"Fr Stephen De Young","text":"St. Andrew did evangelize that area."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8224.68,"end":8225.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8225.56,"end":8249.24,"speaker":"Fr Stephen De Young","text":"So it's not made up. Right. But the, the connection to St Andrew becomes much more prominent a few centuries later. And that is not unrelated to the fact that St. Andrew was St. Peter's older brother, the better brother, really. And that St. Andrew is a way of connecting Constantinople to St. Peter and his primacy. We acknowledge Petron primacy."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8249.24,"end":8249.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8249.52,"end":8261.96,"speaker":"Fr Stephen De Young","text":"That is not a thing that, that we deny. So these folks who are like, oh, it does seem like St. Peter was a leader of the early church. I guess I gotta become Roman Catholic. You missed the plot, man."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8261.96,"end":8279.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, and the dots like, to make that work, you have to assume, and there's no basis for this, actually, but that's why you have to assume it, that the bishop of Rome is Peter's sole and exclusive successor."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8280.64,"end":8280.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8280.84,"end":8281.84,"speaker":"Fr Andrew Stephen Damick","text":"But that is."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8281.84,"end":8286.64,"speaker":"Fr Stephen De Young","text":"And by extension, that St. Peter was Christ's only right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8287.12,"end":8291.36,"speaker":"Fr Andrew Stephen Damick","text":"And neither one of those things is present in the scriptures or present in the early Church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8291.36,"end":8340.67,"speaker":"Fr Stephen De Young","text":"And this is what gets to the issue. This is what gets to the issue. From an orthodox perspective. The problem with the way the Roman Church has structured itself since a couple a century or two before the schism is that the Bishop of Rome is the only bishop in the Roman Church from our perspective. Meaning the authority given to bishops as successors of the apostles. The orthodox tradition. The only bishop who can. Who can really exercise that full authority in the Roman Church is the Bishop of Rome himself. All of the other bishops in the Roman Church are effectively presbyters."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8341.79,"end":8343.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, this is."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8343.07,"end":8344.99,"speaker":"Fr Stephen De Young","text":"They cannot rule authoritatively."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8345.39,"end":8345.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8346.27,"end":8348.51,"speaker":"Fr Stephen De Young","text":"Individually or even as a council."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8348.99,"end":8374.71,"speaker":"Fr Andrew Stephen Damick","text":"Obviously our Roman Catholic friends would disagree with that idea that there's no other bishops in the church. But like, let's be clear about this. If a council of the Roman Catholic Church gathers. The Pope does not have to obey them. He can call them, he can dismiss them, he can overrule them, he has authority over them. He can hire and fire any bishop of the Catholic Church anywhere on earth."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8374.87,"end":8376.71,"speaker":"Fr Stephen De Young","text":"He's the only one who can make bishops."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8377.75,"end":8387.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, others do the consecrating, whatever, but he's the one that has to approve every single episcopal consecration which to."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8387.7,"end":8396.26,"speaker":"Fr Stephen De Young","text":"Us demotes them to presbyter. Yeah, right. So for us, a presbyter. I'm a presbyter. You're a presbyter. I'm a pepper. You're a pepper. He's a pepper."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8396.26,"end":8401.18,"speaker":"Fr Andrew Stephen Damick","text":"Be a pepper too. That's an old, old headline there."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8401.18,"end":8401.5,"speaker":"Dan","text":"That's."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8401.5,"end":8408.54,"speaker":"Fr Stephen De Young","text":"Wow. Okay, so I do not have Episcopal authority. I can't rule on things authoritatively."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8408.78,"end":8409.5,"speaker":"Fr Andrew Stephen Damick","text":"Thank God."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8409.66,"end":8410.18,"speaker":"Fr Stephen De Young","text":"You know why?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8410.18,"end":8411.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8411.5,"end":8460.19,"speaker":"Fr Stephen De Young","text":"You know why? I could be asked my opinion, but I have a bishop. And if my bishop comes in and says, father Stephen, you're out to lunch and rules that I'm wrong, his ruling is what everyone has to follow, including me. Not mine. I have to be obedient to him. He can suspend me, he can defrock me. He is in authority over me. The Bishop of Rome has that authority over every other bishop in the Roman Church. Every other person who's called a bishop. That's what I mean when I say they're effectively devoted to presbyters. Bishops in the Roman Catholic Church have the kind of authority. It's not that they have no authority, but they have the kind of authority that I have as a presbyter in the Orthodox Church."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8460.67,"end":8463.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, you're not the final rule."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8463.19,"end":8502.34,"speaker":"Fr Stephen De Young","text":"I'm not the final. I'm a say I am trusted by my bishop to handle most day to day small matters. Remember Moses? Remember Moses? Moses had the appointed the, the presbyters, the elders to deal with the day to day stuff and they brought all the big stuff to him. Moses is the bishop of this situation. So that's what I mean. The Bishop of Rome is like Moses, he's a bishop, he has that authority. And the people called bishops and archbishops and cardinals and whatever else under him have the authority of presbyters under him. And so this is the fundamental ecclesiastical divide."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8503.22,"end":8504.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8505.54,"end":8537.53,"speaker":"Fr Stephen De Young","text":"The issue is not just like, oh, you orthodox just need to acknowledge that he has a primacy. We'll acknowledge he has a primacy, different kinds of primacy, and that is based on St. Peter and all that stuff. But that has to be coupled with him acknowledging other Bishops, not just the other patriarchs, every other bishop in the Orthodox Church and every other bishop in the Roman Church as his equals."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8538.57,"end":8539.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8540.57,"end":8543.45,"speaker":"Fr Stephen De Young","text":"And he fundamentally cannot do that and still be the Pope."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8543.61,"end":8544.17,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8544.17,"end":8545.37,"speaker":"Fr Stephen De Young","text":"Then you don't have a papacy."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8545.69,"end":8547.21,"speaker":"Fr Andrew Stephen Damick","text":"Does not work in the Roman Catholic."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8547.21,"end":8548.81,"speaker":"Fr Stephen De Young","text":"System that you don't have a papacy."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8549.1,"end":8570.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think. I think it was, if I remember correctly. I mean, correct me if I'm wrong here in the Council of Nicaea, the canons with regards to primacy say, let all the bishops of a province or whatever do nothing without him who is first. In other words, the Primate. But let him who is first do nothing without all the other bishops. Meaning that they're all dependent on each other."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8571.98,"end":8617.47,"speaker":"Fr Stephen De Young","text":"Right. And from the perspective of Rome, they're cool with the first part of that. Yes. None of you other bishops could do anything without the Pope, but they're not cool with the second half of that, that the Pope can't do anything without all the other bishops. Because again, if you say that the other way, now you don't have a papacy and now you've got the Orthodox Church. And would it be beautiful if we just had the Orthodox Church? I think so. So, but what this also means, now that we've, you know, we've been mean all around tonight. We got. We hit the Mormons a little bit and we hit the Protestants and we've hit the Roman Catholics now. Now it's time to get some Orthodox people mad at us, particularly in the United States."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8617.87,"end":8618.51,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8619.31,"end":8622.91,"speaker":"Fr Stephen De Young","text":"Remember how we ended the last episode talking about how Moses couldn't be wrong?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8623.87,"end":8624.39,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8624.39,"end":8662.45,"speaker":"Fr Stephen De Young","text":"Bishops can't be wrong in the Orthodox Church. It's logically impossible for a bishop to be wrong. Here's what we mean by that, because remember how we qualified this with Moses. We're not saying that bishops are always right about their politics. We're not saying they're always right about math and science. We're not saying they're always right about predicting tomorrow's weather. That's not what we're talking about. We're not even talking about a bishop can't be a heretic because there's been a bunch of those."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8663.57,"end":8679.37,"speaker":"Fr Andrew Stephen Damick","text":"This is him making the rulings of within his diocese. It'd be like, for instance, when my wife says, this is what we're having for dinner. That is the decision that has been made and that is what is being cooked, and that's what's going to be on the table."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8679.37,"end":8681.73,"speaker":"Fr Stephen De Young","text":"Can't be wrong about that, because she's the one cooking it."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8682.05,"end":8694.21,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Exactly. She can't be wrong about that because she's the one who has that authority to do that. So when the bishop says, this is the rule in my diocese, he can't be wrong."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8694.21,"end":8700.85,"speaker":"Fr Stephen De Young","text":"We're going to do this. The thing is, within his authority, he makes the. Make rulings to apply the canons and the scriptures."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8701.81,"end":8734.16,"speaker":"Fr Andrew Stephen Damick","text":"And just like Jesus when he's talking about the Pharisees, he has all kinds of criticisms for them, but he never tells people to disobey them or ignore them. Yes, he might even criticize the rulings they're making, but he still doesn't tell people to disobey them. Right. You know, it's like. It's like. It's like when my, you know, when. When my wife and I are dealing with my children, she just. She doesn't agree with every single ruling that I make. She doesn't. But she will say things sometimes like, well, that is what your father said. So that is the rule."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8735.13,"end":8735.45,"speaker":"Dan","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8736.09,"end":8769.45,"speaker":"Fr Stephen De Young","text":"So I'm just going to go ahead and court controversy and irritate a bunch of people. If an orthodox bishop says, I don't want you to. Chris, Mate people anymore. We're going to receive everyone by confession. No baptisms, no chrismations. Anybody who's been baptized in any vaguely Christian church received them by confession. He's not wrong. Yeah. Everyone who is received that way is just as legitimately an Orthodox Christian."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8769.61,"end":8770.25,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8770.73,"end":8778.65,"speaker":"Fr Stephen De Young","text":"As the people received in another diocese by another bishop where that bishop says, we're going to baptize everyone regardless of their background."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8778.81,"end":8779.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8779.93,"end":8786.41,"speaker":"Fr Stephen De Young","text":"All those people who he baptizes are just as legitimately Orthodox Christians as all of these people received by confession."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8787.4,"end":8788.84,"speaker":"Fr Andrew Stephen Damick","text":"And what people who. You know."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8788.84,"end":8791.08,"speaker":"Fr Stephen De Young","text":"And they're both right. Both bishops are correct."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8791.08,"end":8818.8,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. And what people who would flip their lids about that may not know is that both of those methods are sanctioned by the ecumenical councils. So even a bishop who makes that decision, it's not like he's making something up. He's not Right. Those are actually in the ecumenical councils, which again, are decided and then applied by bishops."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8819.2,"end":8823.12,"speaker":"Fr Stephen De Young","text":"That's their job. That's their authority. They have the authority to do that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8823.36,"end":8824.16,"speaker":"Fr Andrew Stephen Damick","text":"They're the ones."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8824.32,"end":8826.16,"speaker":"Fr Stephen De Young","text":"They do it. It's done. The people are received."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8827.04,"end":8863.72,"speaker":"Fr Andrew Stephen Damick","text":"That's right. There's a story, I think it's from St. Viadicosophotici maybe, where he was preaching some sermon about baptism and someone who had been received into the church who had been part of a heretical Group who had been received in the church through some other method. I think Chrismation or whatever heard this sermon and was so moved by it that he freaked out. And like, you know, I didn't really receive an orthodox baptism and please, you know, do it. And this guy had been in the church for years and the saint said to him, I would not dare to baptize you. You were received already. You are part of the church period."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8864.68,"end":8866.6,"speaker":"Fr Stephen De Young","text":"Because the bishop has the authority to do that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8866.68,"end":8878.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because whoever the bishop was that had received this other guy, he was authoritative. He had, you know, and the saint recognized that and simply, you know, he didn't say, well, I have another opinion."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8879.47,"end":8903.09,"speaker":"Fr Stephen De Young","text":"Yeah, well, what about this canon? If a bishop ordains someone divorced, if a bishop allows someone to continue to serve as a priest after being divorced, if a bishop allows a priest to remarry after being widowed and remain a priest, if a bishop decides. These are all things that have happened at various times in various places."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8903.17,"end":8903.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8903.89,"end":8912.69,"speaker":"Fr Stephen De Young","text":"Not just all contemporary times either. If you're thinking like, oh, well, there's all this loosey goosey stuff now. No, no, no, no, no, no, no, no. 15th, 13th, 12th century."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8912.93,"end":8923.26,"speaker":"Fr Andrew Stephen Damick","text":"I mean, read the canons. Read the canons. All of those canons which have a lot of weird scenarios in them come up. Because that thing happened. Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8923.74,"end":8934.38,"speaker":"Fr Stephen De Young","text":"So at every bishop who made every one of those rulings was right when they made those rulings. And the bishops, sometimes the same bishop, when he made the opposite ruling in a different case was right when he made the opposite ruling."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8934.38,"end":8945.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now, related to all of that, because I'm sure some people are like, well, wait a minute, what about if a bishop really is off, off the reservation?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8945.18,"end":8952.35,"speaker":"Fr Stephen De Young","text":"Right. Well, that's the question is accountability. We're all big accountability, like, because. Because especially about other people, not ourselves, but other people."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8952.35,"end":8961.15,"speaker":"Fr Andrew Stephen Damick","text":"That's right. The truth is that sometimes bishops do get overruled, but the really important thing to notice is by whom."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8961.95,"end":8971.39,"speaker":"Fr Stephen De Young","text":"So the fact, the fact that this is not the church is not a democracy, the fact that your bishop is not accountable to you does not mean he's not accountable."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8971.71,"end":8972.43,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8973.55,"end":8998,"speaker":"Fr Stephen De Young","text":"Because first of all, there's that whole conciliarity thing we were talking about. It takes two or three bishops to make a bishop, but the bishops of the synod could get together and depose a bishop and make him not a bishop anymore, take that authority away from him. Now, if that authority is taken away from him, as we said before, that doesn't invalidate all the stuff he did while he was a Bishop. And while he had that authority, that's all done."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":8998.4,"end":9005.01,"speaker":"Fr Andrew Stephen Damick","text":"I mean, they could overrule it because they have that authority to do that. Right?"}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9005.01,"end":9009.97,"speaker":"Fr Stephen De Young","text":"Well, they could. Going forward, there are things you can't undo. Right, right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9009.97,"end":9011.01,"speaker":"Fr Andrew Stephen Damick","text":"But there are some things you can."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9011.01,"end":9016.93,"speaker":"Fr Stephen De Young","text":"Like for instance, they could depose priests you ordained, but that's still not undoing it because that person was still a priest during the time you were a priest."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9016.93,"end":9023.17,"speaker":"Fr Andrew Stephen Damick","text":"Or like if a bishop, unerring bishop, deposes someone, the synod could say that was unjust. We're restoring you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9023.17,"end":9027.09,"speaker":"Fr Stephen De Young","text":"Right. But he still wasn't a priest during the period in which he was deposed."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9027.41,"end":9028.29,"speaker":"Fr Andrew Stephen Damick","text":"Right? That's right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9028.37,"end":9030.29,"speaker":"Fr Stephen De Young","text":"So you're not undoing it is what I mean."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9030.65,"end":9031.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9031.65,"end":9071.75,"speaker":"Fr Stephen De Young","text":"You could moving forward, you could go in a different direction, but you can't undo what he did. So they're accountable to the other bishops. The other bishops break communion. He's not an orthodox bishop anymore. If they depose him, he's not a bishop anymore. If they write there all these things that they can do. So there is that direct accountability there. But more importantly. And yes, this is more important and part of our problem as modern people as we don't really think this is more important. I don't know if it's because we don't really believe in God or if it's because we don't really believe in the resurrection of the dead, but it's got to be one of the two is that for some reason we think accountability to God doesn't count."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9073.11,"end":9075.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, like God's not going to do anything. You guys."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9077.03,"end":9129.35,"speaker":"Fr Stephen De Young","text":"This is what the Old Testament is talking about when it says, the fool says in their heart there is no God. So a lot of us are a little foolish. We somehow think that if someone escapes this life without being held accountable, oh, they have to be accountable to me, that somehow they've gotten away with it and there was no accountability. I would much rather be judged by my fellow humans than by God. Which is more important, that we expose the bad financial dealings of some bishop or other church authority figure now so that I can hold them accountable or they die in their sins and God holds them accountable. Now, if our desire to hold them accountable came from a desire to see them repent. Right. So they wouldn't face the judgment of God, that would be different. But I don't see a lot of that."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9130.23,"end":9136.12,"speaker":"Fr Andrew Stephen Damick","text":"No, I think it's mostly about making people feel better or feel like they're right or that they're winning."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9136.12,"end":9150.96,"speaker":"Fr Stephen De Young","text":"Yes. I think it's anger Personal anger and pride. And you have to be accountable to me. You have to be accountable to me. You have to answer to me. Person who's authority over."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9150.96,"end":9174.59,"speaker":"Fr Andrew Stephen Damick","text":"I mean, the, the example we see in the Scriptures from people who are being trodden down by those in authority is that they cry out to God for vindication and that he will vindicate them. That's what we see from the righteous is that they cry out to God for vindication."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9175.07,"end":9324.73,"speaker":"Fr Stephen De Young","text":"This is why St. James, one of those bishops with great primacy in his epistle, said, not many of you should become teachers, my brothers, for you know that we who teach will be judged with greater strictness. There's a greater judgment. And I've said this a bunch in my Bible study and stuff, but this is real, okay? When you stand in front of Christ's judgment seat on the last day, you are going to have to give an account for yourself. If you are married, you're going to have to give an account to Christ for yourself and your spouse. If you have are married and have children, you will have to give an account to Christ for you, for your spouse, for each of your children, because you have authority over them as their parent. I, as a priest, I'm going to have to give an account for myself, for my wife, for every one of my parishioners who I've ever had at any church I've served at, my bishop is going to have to give an account for every single clergy person and every single human in every one of his churches. People don't want that. When they want to get ordained, there's a lot of things they want. They don't want that awesome responsibility. They don't want that weight on their shoulders. They don't want to shoulder the sins of the people who they're in authority over. But that's the reality of what it means. That's the accountability that our bishops have that go with. That goes with that authority. The bishop who decides to let somebody get remarried is going to have to explain that to Christ, why that was the right thing to do, why that was the best thing to do for that person's salvation. These aren't decisions that bishops make lightly. And having the authority and responsibility to make them is not a light thing. And this isn't just theoretical or imaginary or a parable. This is real. This is real. I'm going to have to explain to Christ why I told people what I tell them in confession. Why advise them to do certain things or not do certain things."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9327.45,"end":9327.85,"speaker":"Fr Andrew Stephen Damick","text":"All of."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9327.85,"end":9390.56,"speaker":"Fr Stephen De Young","text":"That, every word that came out of my mouth, I'm going to have to give an account for. So nobody's getting away with anything. Nobody's unaccountable. Okay. And the kind of accountability that people with authority in the church have to Christ, being accountable to some people or group of people or a parish council or something like that, that's nothing. Get out of here with that. That's all ego. If you think that's real, this is going to end up being my closing comments, I think. Oh, yeah, all right. Because I'm going to be done after this, I think. But this is the real deal. This is where the rubber meets the road. This is what actually, being an Orthodox Christian, not a Protestant, who's read a lot of church fathers and owns a copy of the Rudder, but being an actual Orthodox Christian, this is part of what it means, is realizing what authority means, realizing what real accountability before God is, and therefore submitting and being obedient to the authorities that God has put over you. So you can go ahead and finish up."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9390.88,"end":9669.45,"speaker":"Fr Andrew Stephen Damick","text":"All right, I get the last word, huh? One of the things you'll hear people cynically say sometimes when talking about church authority is they'll say they just expect us to pray, pay and obey, be good little churchgoers, give your money, be obedient. And you know, as Americans. Right, that sounds horrifying. Like that's, that's a recipe for oppression. This country wasn't founded on that. And, and it's true, it's. It wasn't. But that is what Christianity is actually to pray, to worship God, to request all the good things for our salvation from him, to pay, right, to give, to give to Christ, whether our time, our money, our talents, and to be obedient. And I know that a lot of people, when they encounter the Orthodox Church for the first time and they see that we have this tradition of obedience, I think because the United States of America does not have a tradition of obedience, really has a tradition of disobedience and really lauds that. Examine everything for yourself, decide for yourself, right? That then seeing that obedience is part of the orthodox tradition, interpreting that, understanding that, and practicing that can be very skewed, right? So on the one hand, you have people who, they'll go to their, their priest, their confessor, their spiritual father for a blessing, to do a lot of different things that they could just decide for themselves, you know, really. And so it's extreme, you know, And I think that some of that probably comes from reading monastic related literature where that kind of obedience is the norm. In a monastery, although maybe not as extreme as some people might think. And then on the other hand, it's really the sense of, well, I'm going to decide whether what my priest or my bishop or my patriarch or my holy Synod are doing is right or wrong. And if they're right, then I'll go along with it. But if they're not, then I'll not go along with it. I'm going to resist. I'm going to call them to account, I'm going to expose them. And emotionally, you know, that feels great to do that. Like, you feel righteous, you feel, you know, you're the underdog, you know, stick it to the man, speak truth to power, all that kind of stuff. But as we have seen very, very clearly throughout the scriptures and throughout the whole history of the church, that is not the way that erring church leaders are held accountable, as we just said. Doesn't mean that they're never held accountable, but that's not the way they're held accountable. I do not hold my bishop accountable. I do not like speaking as a presbyter, as a priest. My job in particular, I've had actually people tell me, like, well, if your bishop said or did this, then you shouldn't go along with that. You know, you should resist. I'm sorry, but that is a complete misunderstanding of particularly what the role of the presbyter is. Presbyter's job is to execute the policies of his bishop because the bishop is the pastor of the diocese of every parish. He is the pastor. And if a presbyter cannot obey and obey his bishop and execute his will, then he cannot be his presbyter. Either he needs to be deposed from the priesthood or. Or he needs to request a release to be with a different bishop. You know, so this idea of priests in resistance, that is not a thing. That is not how this works. It's not how it works. It's very, very clear with regards to the office of the priesthood. But the truth also is that we all are supposed to be practiced this obedience. And yes, it is a freely chosen obedience, but that doesn't mean that you listen to every word and every command and decide for yourself, okay, I'm going to choose this one. I'm going to choose this one. I'm going to choose this one. No, no, no, no, no, no. That would be like deciding for myself, you know, I'm going to be faithful to my wife in this way, but not this way, this way, but not this way."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9669.69,"end":9670.09,"speaker":"Dan","text":"Right."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9670.09,"end":9945.68,"speaker":"Fr Andrew Stephen Damick","text":"Either I'm faithful to my Wife or not. Either I'm obedient to my bishop or not. Obedience means that sometimes my will is not going to be in alignment with the will of the one to whom I owe that obedience. And if it's always if. If I only obey when my will aligns with his will, then that's not obedience, not to him anyway. That's obedience to me. Again, that's what, as we said earlier, that's. That's doing what's right in my own eyes. I mean, Scripture is very, very clear about that, that, that yes, you can have your conscience bound by the spiritual authority over you. That is the way that it works. You cannot get around that. You can't. There is no Orthodox tradition of rising up against your spiritual leadership and throwing them down. That is not a thing. Now, that doesn't mean that spiritual leadership in the Orthodox Church is absolute. It's not. It is under God. It is under a bishop. It is under a synod of bishops. Ultimately, it's under God. And that actually makes a difference. I mean, Father, you said earlier, I'm not sure people believe in God or not when they act this way. I think it's a functional atheism, like God's not going to do anything. And so we have to, brothers and sisters. We have to. Or maybe worse, our righteous anger. Is the Holy Spirit moving us? No, it's not. Holy Spirit doesn't move you to do things that are against the Holy Scriptures. That's not true. That doesn't happen. It's not a thing. I know that's probably hard here for a lot of people, but I can tell you that maturity in Christ is learning to let go of the need to be in charge. That is part of what it means to be mature. And even church leaders who have a lot of authority, the really mature ones are the ones who have set aside the need to. To be in charge. And so since they've set aside that. That need, that desire for that, then they're actually able to exercise that authority as servants, as those who are leading in love. And I've met a few holy people in my life, including some who are bishops. And when someone has that holiness, it's certainly a lot easier to obey them. A lot easier. You do it out of love and joy. It's just, wow, you know, I want to. But there are also times when their holiness is not apparent to us. I'll just put it that way. Doesn't mean they're not holy. They might be, and I just can't see it. And we know from the scriptures that those who live under an oppressive and wrong and messed up leadership, the righteous receive that as from the Lord as being a call to repentance that we're being afflicted so that we may repent. That doesn't mean that that that wicked ruler isn't wicked. God uses wicked rulers over and over again in the scriptures, over and over again. But it does mean that receiving that wicked rule is for our repentance. So for suffering, the response is to repent. God will hold the oppressors accountable. Our task is to be faithful and yes, pray, pay, obey. Because it turns out that that's actually the path to the Kingdom of Heaven. It really is. So that is our show for tonight. Thank you everyone for listening. If you didn't happen to get through to us live this time around, we'd like to hear from you. You can email us at LordOfSpirits and AncientFaith.com you can message us through our Facebook page. You can also leave us a voicemail@speakbite.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help to find a parish, then go to orthodoxintro.org Join us for our live broadcasts."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9945.68,"end":9956.64,"speaker":"Fr Stephen De Young","text":"On the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. There's a time for love and a time for living. You take a chance and face the wind, an open road and a road that's hidden. A brand new life around the bend."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9957.28,"end":9970.41,"speaker":"Fr Andrew Stephen Damick","text":"And if you're on Facebook, you can follow our page, you can join our big discussion group, you can leave reviews ratings on your podcast apps. But most importantly, please share this show because word of mouth is how this thing works."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9970.81,"end":9983.45,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other Zefr podcasters stay on the air. There were times when I lost a dream or two. Found the trail and at the end was you. It's a path you've taken, a path untaken. The choice is up to you, my friend."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9984.33,"end":9986.01,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night. God bless you."}
{"episode_id":"LOS - #120 - 2025-07-10 - Apostolic Succession","start":9988.41,"end":10025.63,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
