{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":0.24,"end":64.92,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":70.84,"end":200.87,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of spirits podcast. I'm Fr. Andrew Stephen Damick in Emmaus, Pennsylvania and with me is my co host father Stephen DeYoung in Lafayette, Louisiana. Normally our shows are live and we take phone calls, but this episode is pre recorded. So despite what you'll hear from the voice of Steve and the voiceovers in this one, if you try to call, you won't get anywhere. That said, we will be incorporating messages and emails that you sent us in anticipation of this episode. And wow, there were a lot tonight we're of course talking about giants, also known as the Nephilim. And this may be among the most anticipated episodes of this podcast. So what is it about giants? Well, we probably all remember the story of David and Goliath from Sunday School, but after you grow up, are you just supposed to take that seriously? And if you read deeper in the Bible, you start to see that Goliath is not the only giant in the Bible. And what's more, the existence of giants is a practical problem for people in the Bible, such as in Numbers chapter 30 where the Israelite spies who go into the land of Canaan see giants there and they feel like they are grasshoppers by comparison, so they don't want to go in and fight them. And if you read the Bible even more deeply, you discover that the biblical origin of giants is truly, truly bizarre. Can modern people believe in giants? Can modern Christians believe in giants? Could there still be giants around today? Buckle up because this is the giants episode. And parents, please note there are some very adult themes in this episode. And while we won't be graphic. You will want to listen to this one before you decide whether to share it with your kids. So we're going to start our discussion with the origin of giants in Genesis chapter six, since that's the earliest reference in the Bible. So here we go. Are you ready, Father Stephen?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":202.07,"end":203.03,"speaker":"Fr Stephen De Young","text":"I am prepared."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":203.03,"end":204.79,"speaker":"Fr Andrew Stephen Damick","text":"That's right. You were born ready."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":206.63,"end":213.35,"speaker":"Fr Stephen De Young","text":"Yeah. I could pretty much talk about giants at a moment's notice. And then people get excited when I talk about giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":213.35,"end":214.79,"speaker":"Fr Andrew Stephen Damick","text":"There it is. There's the catchphrase."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":215.59,"end":217.35,"speaker":"Fr Stephen De Young","text":"A fun time is had by all."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":217.51,"end":277.76,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right, well, so let's start with that most enigmatic passage from Genesis chapter six. And it starts with verse one. I'm going to read this one for us. When man began to multiply on the face of the earth and daughters were born to them, the sons of God saw that the daughters of man were attractive, and they took to themselves any they chose. Then the Lord said, my spirit shall not abide in man forever, for he is flesh. His days shall be 120 years. The Nephilim were on the earth in those days and also afterward, when the sons of God came in to the daughters of men and they bore children to them, these were the mighty men who were of old, the men of renown. And there it is. And many can. Conspiracy theories and careers were launched, Right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":277.84,"end":278.4,"speaker":"Fr Stephen De Young","text":"Indeed."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":278.4,"end":282.8,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of crazy stuff out there about these four verses."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":283.76,"end":299.92,"speaker":"Fr Stephen De Young","text":"Yeah. Trying to do actual research on this topic. Right. You can't just go and type Nephilim into Google and get good and helpful and productive things on the first, say, 133 pages, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":301.44,"end":362.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, just, just think about the problem, right. Of just trying to research it. Like if you were to type in some common, common, common word into Google, you wouldn't get very far because there would just be so much about that thing. Like if you're just typing sports, you know, Right. Sports. It would just be just too much. You know, if you start to say, you know, the. The Oakland Raiders in this decade, then you start. You would start to find a little bit more or whatever. But what's interesting is that this topic, even though it is about something that, you know, we think would be a really sort of obscure, obscure bit of biblical research, it's actually super interesting to people. And so there's a lot of crackpot stuff out there. And I think this, maybe more than anything else is the topic where you and I get. Have you read so and so? Have you read so and so? What about so and so? Have you read so and so. Right. We've had novel recommendations, popular theology, you."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":362.67,"end":365.63,"speaker":"Fr Stephen De Young","text":"Know, weird science, self published books of various kinds."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":365.63,"end":377.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And there's even, I mean, as we were just discussing in the prep time, you know, this even shows up in some Hollywood films. Right? Yeah, we'll get to that, I guess."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":377.23,"end":377.91,"speaker":"Fr Stephen De Young","text":"A little bit later."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":378.87,"end":439.43,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, so we're going to attempt to, to make some clear depictions of what this is based on, what's in scripture, based on research into the ancient world, based on what's in some of the books that are sort of near scripture, like Enoch and that kind of stuff. All right, so we start out with those four verses from Genesis. And a kind of, you know, I don't know, obvious reading of them is suggesting that there are these people called the sons of God who are having relations with human women and that's why there are these giants. I mean, that's what it says. Nephilim is just the word for giants. Right. And they're these mighty men of old, the heroes. Right. So what do we do with that?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":440.55,"end":452.47,"speaker":"Fr Stephen De Young","text":"Yeah, well, we have to start with the word Nephilim. Just as a brief note, because there are some people who try really hard to get this to not mean giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":452.47,"end":453.83,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":456.95,"end":478.44,"speaker":"Fr Stephen De Young","text":"And they're trying to do some chicanery with Hebrew because there is a Hebrew root, nefal, that means to fall. Okay, Right. So you could say, oh, well, so they're going to try and get it to mean the fallen ones, which, you know, has certain resonances. You think, oh, well that, that sounds good."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":478.44,"end":478.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":479.44,"end":484,"speaker":"Fr Stephen De Young","text":"Except that based on the form of the Hebrew word, it would be passive."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":484.4,"end":485.24,"speaker":"Fr Andrew Stephen Damick","text":"So fallen upon."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":485.24,"end":499.74,"speaker":"Fr Stephen De Young","text":"So it would mean the fallen upon. Right. So there's some people who aren't deterred by that. And so they try to argue. Well, as we're going to see later in Joshua, the giant clans are going to be attacked in battle. So they say. Oh, it means fallen upon in battle. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":499.74,"end":500.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":500.98,"end":518.24,"speaker":"Fr Stephen De Young","text":"Except there's no battle in Genesis 6. And the much, the much easier way to go about this is with Hebrew. The Hebrew scriptures are the only documents in biblical Hebrew that we have. Really."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":518.32,"end":520.64,"speaker":"Fr Andrew Stephen Damick","text":"Okay, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":522.32,"end":532.08,"speaker":"Fr Stephen De Young","text":"Almost everything else, even if you're talking about like Second Temple Jewish literature and that kind of thing, most of it's in Aramaic or Greek or later a later form of Hebrew."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":532.08,"end":532.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":534.08,"end":540.24,"speaker":"Fr Stephen De Young","text":"We don't have any other samples of Hebrew as old as the Torah other than the Torah, for example."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":540.24,"end":540.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":542.45,"end":572.02,"speaker":"Fr Stephen De Young","text":"So what we have to do a lot in reading the Hebrew of the Bible is you have to look at what are called cognate languages, other Semitic languages, languages that are, like, cousins to Hebrew. So it would be like if you didn't know what a Spanish word meant, but you found an Italian word and a French word that were similar. Right. It had the same derivation from Latin. You could say, oh, well, the Spanish word probably means something like this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":572.02,"end":573.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":573.82,"end":584.34,"speaker":"Fr Stephen De Young","text":"And you do the same thing with. With Hebrew. There were words. There's a lot of weird readings in the Old Testament of the King James Version, especially the original King James Version."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":584.34,"end":585.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. The real King James."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":587.18,"end":597.27,"speaker":"Fr Stephen De Young","text":"And that's. That's because there are literally dozens and dozens and dozens of words that only occur once in the Hebrew Bible."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":597.51,"end":598.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":598.03,"end":609.83,"speaker":"Fr Stephen De Young","text":"And so there's no context clue as to what it means. They literally didn't know. And we've only discovered what they mean through, like, the discovery of the Ugaritic language in the middle of the 20th century."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":609.83,"end":611.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's another Semitic language."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":611.91,"end":612.87,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":613.35,"end":613.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":613.87,"end":627.51,"speaker":"Fr Stephen De Young","text":"And so in this case, the place where we go to understand what Nephilim means is the word nephilim. It ends with an N instead of an M in Aramaic, which means giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":627.83,"end":628.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":629.11,"end":629.83,"speaker":"Fr Stephen De Young","text":"It's very simple."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":629.83,"end":648.47,"speaker":"Fr Andrew Stephen Damick","text":"And of course, it's telling that when ancient Judeans, you know, and were translating the Old Testament into Greek, the word that they chose to translate this word was gigantes, which is literally the origin of the English word giant."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":649.39,"end":651.91,"speaker":"Fr Stephen De Young","text":"Yeah. Is derived from it. So they translated as giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":651.91,"end":652.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":652.51,"end":675.31,"speaker":"Fr Stephen De Young","text":"As a note. And we'll come back to this in the third half of the show. I think when they translated this passage originally, what we call. What. What is properly called the Septuagint. Right. The 70 scribes in Alexandria around 250 BC, when they translated this passage, they translated the sons of God as the angels of God."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":675.39,"end":675.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":675.79,"end":678.35,"speaker":"Fr Stephen De Young","text":"And they translated Nephilim as giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":678.51,"end":763.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So those third century BC Jews, Judeans, that's probably another conversation for another. Another podcast. They. They understood the Hebrew scriptures that they were reading as talking about angels and it's talking about giants, because those are the words that they used to translate. And, you know, Greek of that period is not anywhere near as mysterious as the Hebrew of Genesis. Yeah. Biblical Hebrew. I mean, there's, like you said, you know, biblical Hebrew. It's the. The Bible is the only. The only texts we have in that. That period of that language. Whereas with Greek, there's lots of texts, but, you know, from. From piles and piles from pretty early on. And that's why, for instance, you know, New Testament scholarship, at least, linguistically speaking, is. Is a lot easier because there's just so much more kind of context available. You know, you can say, well, it may not be clear here in the Bible as to what this means, but look at the way that pretty much everyone else in this period used this word. Right, Right. So it's interesting. It's great that you bring up the Septuagint translators because it shows that this was their understanding of this passage, that it's talking about angels and that the product of these unions is giants. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":764.08,"end":770.8,"speaker":"Fr Stephen De Young","text":"So you have angels and human women cohabiting in some way."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":771.2,"end":773.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Which we'll talk about that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":773.92,"end":780.16,"speaker":"Fr Stephen De Young","text":"Right. And then they produce these progeny who are giants. So that's what it says."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":780.32,"end":781.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":781.08,"end":785.6,"speaker":"Fr Stephen De Young","text":"Now we have to get into what in the world that means. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":786,"end":786.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":787.52,"end":792.4,"speaker":"Fr Stephen De Young","text":"Which is a second question. Right. Once we determine what it says, that it's. What does it mean?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":793.16,"end":793.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":794.12,"end":818.52,"speaker":"Fr Stephen De Young","text":"And in terms of what it means, we actually have a lot of context, not in terms of grammar and vocabulary, but in terms of other stories from the ancient world, parallel stories. Most people, I think, know that the flood story in Genesis 6 through 9 is not sort of a unique story."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":818.68,"end":824.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. That, that, that pretty much that almost every ancient culture has a flood story."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":824.92,"end":854.14,"speaker":"Fr Stephen De Young","text":"Right. Has some story of a previous advanced civilization that was destroyed in a flood and there were some small group of survivors. Right. Who. Who were. Who were brought through it. So that. That's fairly well known. That. I mean, everywhere in the world you find that. And that the. The flood story in Genesis is not even the oldest version that we still have of the story. Right. The Epic of Gilgamesh is from a good, minimally, 500 years earlier, maybe 1,000 years earlier."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":854.14,"end":854.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":855.82,"end":858.14,"speaker":"Fr Stephen De Young","text":"In terms of just the copies we have."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":858.14,"end":858.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":858.54,"end":879.05,"speaker":"Fr Stephen De Young","text":"Right. So people are aware of that. They're less aware of the fact that there are other parts of this historical story that are also just about universal. Right. That you also find paralleled in all of these ancient cultures."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":879.05,"end":1027.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think that one of the things that's really important to note, you know, like, you know, growing up as a Christian in Sunday school and you get the story of Noah and the flood, I think it can be easy not to think about what exactly that event means. Right. You know, certainly it's this sort of sense of, okay, there's a lot of wickedness out there and God is wiping it out by sending this flood and he saves Noah and his family. But if you think about it, I mean, this is. There is, you know, civilization all over the world. And it's just ended in one action from God and everything is wiped away. Right. And so, you know, we have this word of course, antediluvian, which means before the flood. And then later there's this. And we're going to talk about this, I know, this fascination with the idea of, you know, lost wisdom that, you know, that didn't survive the flood. And how do you get these secrets, right, that you know, there's this massive sort of line in history that's drawn by the flood and there's everything that happens before it and then everything that happens after it. I mean, now we have of course the notion of BC and AD right before Christ and then anno Domini, the year of the Lord, you know, with the advent of Christ. And that is sort of for Christians is the massive demarcating line in history. But, but before this, the flood is kind of it and it's worldwide. You know, that there was this whole flourishing or you know, from their point of view, human civilization from God's point of view was not flourishing in the right way. Right, right. And then, and then it's gone. It's all gone. Right. So I think we have to take a second and just sort of realize sort of how cataclysmic this is. It is like the end of the world, but not quite, you know, the world is ended, but almost, almost ended, but not quite, you know, group of people is saved. So I just kind of want to emphasize that because like I said, it's a cool story and everyone loves putting Noah's ark on their kids walls, in their bedrooms. But if you think about it like that is, that is a huge dangerous story we're talking about. So that's kind of what we're all caught up in now with this discussion of giants. So. Yeah, so you said there was another aspect that's also universal in ancient cultures stories."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1028.39,"end":1105.88,"speaker":"Fr Stephen De Young","text":"Well, also another product of that is that when, when ancient readers read the Torah and read the story of Noah in the flood, they weren't like receiving new information like, oh really, there was this ancient civilization and it was wiped out by a flood. Right. This is something they already knew about. And the biblical story is speaking into that. So to give a modern example, right. If I write a book about the American Civil War, right. Most of the people who see that book and pick it up are not going to think what America had a civil war in the 19th century, right. Like they're not, that's not new information to them. Right, right. But I'm going to Be writing it to say, well, I have some information about the Civil War that you may not have yet, or I need to correct some misconceptions you have about the Civil War. Right. And so that's why I'm writing this. Right. Not just to give you new information you don't already have. So the story in Genesis, including the flood and the other stories we're about to talk about are not there. And that's why these, like the mention here of the Nephilim is so brief and sort of in passing. Right. You say, well, why does it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1105.88,"end":1106.16,"speaker":"Fr Andrew Stephen Damick","text":"The."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1106.16,"end":1111.4,"speaker":"Fr Stephen De Young","text":"Why doesn't Genesis go into the detail that you and I are about to go into? Well, because Genesis didn't have to."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1111.4,"end":1113,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1113,"end":1132.91,"speaker":"Fr Stephen De Young","text":"It's commenting on things they already know, things that they already conceive of as part of their history. It's commenting on them, not laying them all out and explaining them. Yeah, but so another, another aspect of this has to do with that advanced civilization."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1133.07,"end":1133.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1133.43,"end":1180.72,"speaker":"Fr Stephen De Young","text":"The antediluvian advanced civilization. And that part that it's an advanced civilization is another part of the story that's sort of ubiquitous. It's everywhere. And so the Babylonian form of this is what's called the story of the seven Sages. A lot of times in English translation, the word that's translated sages there is the Babylonian word apkallu. And these apkallu are sort of divine beings. The first one is sort of half fish, half man. And the way you see a lot of divine beings in the ancient world being conceived of as sort of composites of human and animal forms, especially like."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1181.21,"end":1191.37,"speaker":"Fr Andrew Stephen Damick","text":"The Egyptian deities are almost always depicted as human bodies with some kind of animal head. Although of course, the Sphinx is the notable opposite."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1192.17,"end":1193.29,"speaker":"Fr Stephen De Young","text":"Right. But it's."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1193.45,"end":1195.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's usually human bodies with animal heads."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1196.41,"end":1227.35,"speaker":"Fr Stephen De Young","text":"And that was universal. That was true also in, for example, when you look at the earliest phase of Greek religion and later they were changed into sort of human forms and patterned after the image of, of Greek kings who wanted, you know, make a statue of Zeus that looks like me. Right. Because I'm a lot like him. Right. But before that, so. And you see little bits of that creeping out. Like in Homer, for example, where he talks about cow eyed Hera."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1228.55,"end":1229.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1229.99,"end":1241.65,"speaker":"Fr Stephen De Young","text":"Having eyes like a cow is usually not conceived of as a compliment. I would try and use that as a pickup line to any of the guys who might be. Listen, you have eyes like a cow, right? No, that's not good."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1243.89,"end":1254.97,"speaker":"Fr Andrew Stephen Damick","text":"Doe eyed. Doe eyed is the. Is doe eyed. That would. That, that's That's. That's the nice modern English way. Although I think most people probably wouldn't even know that phrase. That's a little archaic, but."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1254.97,"end":1260.69,"speaker":"Fr Stephen De Young","text":"But that goes back to a period when Hera is sort of a fertility goddess. Was depicted as a heifer."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1260.69,"end":1261.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1261.97,"end":1278.54,"speaker":"Fr Stephen De Young","text":"Was depicted as sort of this. This cow form. And the scriptures have that too. Right. You look at the descriptions of cherubim and seraphim and angelic beings that a lot of times you've got these composites of sort of human and animal parts."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1278.94,"end":1289.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which we talked about that in our episode on the ranks of angels. You know, the seraphim are kind of serpentine. The cherubim are like lions, I guess."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1289.82,"end":1290.78,"speaker":"Fr Stephen De Young","text":"A little bit sphinxy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1290.78,"end":1292.14,"speaker":"Fr Andrew Stephen Damick","text":"Sphinxish. Yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1292.14,"end":1318.56,"speaker":"Fr Stephen De Young","text":"But you have the four heads and that kind of thing. The ox and the eagle. Right, but so the first of the seven sages is described in that way. He comes up out of the river, meaning the Euphrates, because we're talking about Babylonian story. But then what you find is these seven sages become advisors to the Babylonian kings and Sumerian kings before the flood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1318.64,"end":1319.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1320.79,"end":1344.79,"speaker":"Fr Stephen De Young","text":"And this is laid out, for example, the Sumerian kings list. You have each of these kings listed before the flood and the apkallu, who was sort of their advisor and what he taught them. Yeah, taught them the mysteries of astrology or magic or some kind of technology involving metallurgy, that kind of thing."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1344.79,"end":1359.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And this kind of. This pattern continues. Right. Long, long, long, long after the flood. So, for instance, you've got in Roman imperial religion, the genius of the emperor. Right. And of course, genius of an advisor."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1359.01,"end":1359.33,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1359.33,"end":1401.59,"speaker":"Fr Andrew Stephen Damick","text":"Genius is this wonderfully Is word that's wonderfully cognate with genie or, you know, Socrates talking about the daemon that. That speaks to him and gives him wisdom. This idea of a spirit that accompanies someone and gives them knowledge. Right. Like this, this, this, you know, or even, like, even in. In late later Western European folklore, you get witches who have a familiar spirit, which often, interestingly, is depicted as kind of like a small animal, you know? You know, that. That teaches them things and gives them knowledge that they otherwise wouldn't have. So this is the earliest depiction of that kind of thing that we're aware of, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1403.19,"end":1417.99,"speaker":"Fr Stephen De Young","text":"Yeah, it's the earliest one we have. But there's obvious parallels. Right. In Greece, the story of Prometheus, who comes and gives fire to man, and Pandora and her jar. It was a jar, not a box. I just ruined everyone."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1418.07,"end":1418.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1420.71,"end":1421.67,"speaker":"Fr Stephen De Young","text":"Childhood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1423.59,"end":1438.38,"speaker":"Fr Andrew Stephen Damick","text":"I thought it was an online music Service which I, you know, when Pandora first, when that service first came, came out online, I was like, well, that's an interesting thing to name your music service. What are they?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1438.38,"end":1441.1,"speaker":"Fr Stephen De Young","text":"Well, the last thing that comes out is hope, so. Indeed."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1441.58,"end":1445.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, but, but of course her name, her name means all gifts."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1445.98,"end":1446.94,"speaker":"Fr Stephen De Young","text":"Right, yeah, so."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1447.02,"end":1490.82,"speaker":"Fr Andrew Stephen Damick","text":"So it's, you know, from the point of view of. And it's funny because it's depicted ironically in Greek mythology. Right. So it's all gifts, but what is most of what comes out? Disease and war and all this kind of horrible stuff. And then hope remains at the very end. So even in Greek myth, you've got this irony of. Here's this great gift from the gods, but. Haha, we got you. Right. Which that's interesting because it begins this kind of critique of the gods which, you know, gradually flowers more and more as time goes by. They're not, well, these not just depicted as being benevolent spirits giving all these wonderful things to man, like fire, you know."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1491.3,"end":1545.27,"speaker":"Fr Stephen De Young","text":"Right, well, yeah, there's sort of an ambivalence about it because the, the figures who do this, that includes the Apkallu. So the Apkallu, the other gods, get mad at them for revealing this stuff to humans and imprison them in the abyss, which is in the depths of the waters at the bottom of the rivers in Babylonian thought. And Prometheus, of course, gets his liver pecked out by a vulture for the rest of eternity and these kind of things. So the other gods sort of punish them. So it's looked at as sort of. The other gods look at it as bad. Yeah, right, look at it as bad, but humans looked at it as good. Right. And so what you find is later generations of kings claiming that they're the ones who have maintained this secret divine knowledge from before the flood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1545.43,"end":1545.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1545.99,"end":1566.4,"speaker":"Fr Stephen De Young","text":"As part of their claim to supremacy. Probably the most well known group to do that were the Martu, who are the Amorites in the Old Testament. The most famous one of them is probably Hammurabi, the Babylonian king, around 2500 BC was one of the martins, the code guy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1567.28,"end":1586.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Yeah. A lot of people probably heard of Hammurabi's code as being kind of, you know, an example, the earliest example of written law. But he's also claiming to have antediluvian knowledge by means of spirits talking to him. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1586.26,"end":1640.73,"speaker":"Fr Stephen De Young","text":"And so we see this same thing, the same story in the genealogy of Cain, in particular in Genesis 4, the end of Genesis 4, where Cain goes. And the first part of this is often mistranslated where they have him, him naming the first city after his son Enosh. It's not that he names his city after Enosh's son Irad. That's the city of Eridu, which ancient people, the Sumerian city that ancient people thought was the first city ever. And so Cain goes and founds the first city. We see his later descendants invent metallurgy and music and all these cultural. They've sort of become the culture heroes of the world of this pre flood civilization."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1640.89,"end":1645.45,"speaker":"Fr Andrew Stephen Damick","text":"Wait, so maybe define that term culture hero because it actually has a specific meaning."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1646.49,"end":1655.93,"speaker":"Fr Stephen De Young","text":"Yeah, well, after, after the flood, the figures who are referred to as culture heroes are going to be the flood survivors who have this knowledge."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1655.93,"end":1656.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1657.13,"end":1675.75,"speaker":"Fr Stephen De Young","text":"Right. And they sort of become the instituters of culture as it rebuilds after the destruction, after the collapse and after the fall. But so these figures in scripture. Right. Are not the good guys."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1675.75,"end":1677.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. The mighty."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1677.23,"end":1678.79,"speaker":"Fr Stephen De Young","text":"So this line, are not the good guys."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1678.79,"end":1684.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the mighty men who were of old, the men of renown. Right, Right, Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1684.03,"end":1715.6,"speaker":"Fr Stephen De Young","text":"Right. So they're, they're. So the Bible is saying, no, these are people bringing wickedness into the world. Right. And so the demonic powers. We would call demonic powers, the beings who are giving this knowledge to humanity are not doing it to help humanity or aid humanity. They're doing it to further mankind's destruction. Right. I'm going to give you the ability to forge weapons of war so that you could be more efficient at killing each other."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1716.48,"end":1719.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's like giving a knife to a baby."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1720.56,"end":1723.4,"speaker":"Fr Stephen De Young","text":"Right. Like, here you go, here's the fork. Go put it in the plug socket."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1723.4,"end":1724.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1727.12,"end":1741.32,"speaker":"Fr Stephen De Young","text":"So it's giving this knowledge that should be familiar from a chapter previous, from Genesis 3, where. What does the serpent, what does the devil do? He says he comes to bring knowledge."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1741.32,"end":1785.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You eat this, you're going to become like God. You're going to know good and evil. Right. So there's this theme then, that forbidden knowledge is being offered to mankind by spirits who have no business doing that. And of course, this raises this question, right? So, you know, Cain's line doesn't just come up with weapons of war, they also come up with, you know, music and architecture. And, you know, it'd be, it's kind of easy to sort of say, well, yeah, weapons are bad, but, but what's wrong with music? What's wrong with architecture, what's wrong with agriculture? Right. And I think that, well, it's not."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1785.26,"end":1788.38,"speaker":"Fr Stephen De Young","text":"Really agriculture, it's, it's, it's herding yeah, there's a distinction."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1788.38,"end":1789.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. There's hurting."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1789.7,"end":1792.26,"speaker":"Fr Stephen De Young","text":"Kane can't do agriculture because of his curse."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1792.26,"end":1809.44,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay. Yeah, yeah, exactly. But, but yeah. So you know, what's, what's sort of wrong with those things and my, you know, my sense is, and correct me if I'm sense is there's nothing sort of inherently wrong with them. It's just that mankind wasn't ready for them yet. Right, right, yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1809.84,"end":1813.48,"speaker":"Fr Stephen De Young","text":"Just like your kid. Mankind wasn't in a position to use it responsibly."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1813.48,"end":1820.92,"speaker":"Fr Andrew Stephen Damick","text":"Like my 3 year old should not be handed a knife, but my 13 year old is pretty responsible with it. You know, she cooks dinner and can."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1820.92,"end":1821.64,"speaker":"Fr Stephen De Young","text":"Use it to do good."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1821.64,"end":1822.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1822.2,"end":1850.2,"speaker":"Fr Stephen De Young","text":"Could use it to do good things. Yeah, right, yeah. And this is, this is the same thing with the Tree of the Knowledge of Good and Evil. It wasn't evil in and of itself. It's just there would have been a time when God allowed man to eat from it, but that time wasn't yet. And so jump the gun could have brought about his, his destruction. But so notice how the pagan versions of the story have recast this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1850.2,"end":1851.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1851.4,"end":1855.48,"speaker":"Fr Stephen De Young","text":"Who's the bad guy in the pagan versions? All of them. Of the story."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1855.48,"end":1855.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1855.8,"end":1874.44,"speaker":"Fr Stephen De Young","text":"It's always the other gods who punished Prometheus or the Apkalu. Right. They're the bad guy. They're the ones who don't want humans to have this knowledge. Right. And the good guys are these spirits who want to reveal the knowledge."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1874.68,"end":1876.04,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1876.04,"end":1885.52,"speaker":"Fr Stephen De Young","text":"Right. So that's why we may have said it on the show already that some of these pagan myths, if you understand the biblical version of the story, you could see how they're kind of pro devil propaganda."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1885.52,"end":1892.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Depicting them as benevolent. Right, right, right, exactly."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1892.21,"end":1894.45,"speaker":"Fr Stephen De Young","text":"But it's unjustly persecuted."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":1894.45,"end":2046.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean it's interesting. I mean even. The thing is, so thinking about Prometheus, which is probably the story that's most familiar to our listeners, he's sneaky about it. So he has to defy the divine order in order to bring fire to man. And so that's interesting because even though like, so like, you know, as, especially like as Americans, we kind of love the underdog, we love the whistleblower, like. Right. You know, we love that kind of story. Like the guy Rebel. Yeah, the rebel. Right, but, but you know, in the ancient world, rebellion is, is, is super bad because the order that exists is a divine order. Right. So it's interesting that even in the story there still is this element of truth. That Prometheus is engaging in an act of rebellion. And of course, you know, from the context of our previous episodes where we talk about that there is this angelic rebellion that occurs. You know, you read these stories from a biblical point of view and you can say, oh yes, well, the other gods who punish these knowledge giving gods are actually the Lord of hosts and his angels, you know, like the Archangel Michael who, you know, drive out these evil spirits from the presence of the Lord and send them to the abyss. You know that this is, this is, this is situated within this ongoing spiritual war. You know, that these, one of the ways that these spirits rebel, and we talked about this in the five Falls, five ish falls of angels. One of the ways that these spirits fall and rebel is by giving forbidden knowledge to mankind specifically for the purpose of man destroying himself. You know, and it's interesting, you know, I mean, man kind of, I think, I think humanity understands this on some level, but we, we're just so tempted, we're just so addicted to sort of knowing stuff that like for instance, when nuclear weapons were invented, I'm not saying that they were revealed by an Apkalu, but who knows? But, but you know, there's this, there's this concern and it's a, A, a valid concern which is like, if mankind knows how to do this, are we going to just wipe out everything on the planet? And that's been a question that's been being asked for the last several decades and you know, not entirely an unreasonable outcome."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2047.09,"end":2050.61,"speaker":"Fr Stephen De Young","text":"You know, Oppenheimer did quote the Bhagavad Gita."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2050.93,"end":2055.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I am become death, the destroyer of worlds. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2055.84,"end":2091.72,"speaker":"Fr Stephen De Young","text":"So, but, so we find sort of a more full version of these traditions written down in, in sort of later literature like first Enoch, the Book of Enoch, the Book of Giants at Qumran, some of this other Enochic and apocalyptic literature. The reason we find it written down that late is you write things down when you're worried about losing them at the time the Torah is composed. This is sort of stuff that everybody knew."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2091.72,"end":2093.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they can just sort of sketch it out."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2094.36,"end":2116.83,"speaker":"Fr Stephen De Young","text":"Right. So by the time you get to the late Persian Empire, some of this stuff is less secure. Right. And so that's when the sort of fuller forms of this tradition get put down in writing to make sure they get preserved. The, the, in the ancient world, something being written down turned it into a kind of monument."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2116.83,"end":2117.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2117.99,"end":2128.11,"speaker":"Fr Stephen De Young","text":"And this is the subtext behind. Does it always strike us when we read the Bible, but it is written. Yeah, that's why that carries so much weight."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2128.11,"end":2128.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2129.27,"end":2136.59,"speaker":"Fr Stephen De Young","text":"That people didn't have bibles and a concept of canon yet. Right. But it is written. This was written down. That means it's important."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2136.75,"end":2138.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2138.27,"end":2142.59,"speaker":"Fr Stephen De Young","text":"Right. This is like a monument left for us by our fathers."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2143.07,"end":2143.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2145.71,"end":2178.65,"speaker":"Fr Stephen De Young","text":"So when we find the more full version of this written down, that's made more explicit, you know what these secrets were. Right. That includes things from sort of means of seduction to things involving witchcraft and sorcery and divination, different ritual things in addition to your sort of technological metallurgy and those kind of things. So you can see how these are all things that are going to help lead humans into deeper and deeper into sin."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2178.65,"end":2192.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So how like we would draw a sharp distinction between a manual of metallurgy and a manual of potion making. Right. But would ancient people draw that distinction?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2193.32,"end":2198.28,"speaker":"Fr Stephen De Young","text":"Right. No, because they don't have the materialistic view of the world that we do."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2198.28,"end":2206.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. So metallurgy is just a spiritual on activity as making a love potion."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2207.16,"end":2211.04,"speaker":"Fr Stephen De Young","text":"Right. It's knowledge about how the cosmos works."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2211.04,"end":2282.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's, that's such a hard thing, I think for us. Like I'm, I'm, I, like, I believe that. Right. Like that, that these things are all inherently spiritual acts and so forth, but it's really hard to just wrap your mind around it, even if you consciously believe it. You know, I still like, I, I think, you know, a manual and metallurgy to me is possibly one of the most dull things that could exist. I mean, I have friends who are, who are in material science are like, why are you saying that? But, but you know, like to me it's a dull technical kind of thing. And even though I mentally can say to myself, no, no, no, this is about elemental forces of the universe, you know, still, that looks different from a book of spells. And yet for ancient people, they're the same thing. They're, they're basically. And of course, if you understand this idea of this spiritual origin of technological knowledge, then it starts to make a lot more sense. And of course you're going to call upon Hephaestus or Vulcan or whoever your metallurgy God is to assist you in this work, because he's probably the one who gave you that knowledge to begin with."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2283.25,"end":2297.71,"speaker":"Fr Stephen De Young","text":"Right, right, right. And so in the ancient world, there's no difference between like chemistry and alchemy or astronomy and astrology. These are like separate things. The way we've."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2297.71,"end":2302.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I've once heard it said that astronomy is just the bookkeeping of astrology."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2303.03,"end":2306.75,"speaker":"Fr Stephen De Young","text":"Yeah. Basically, in a way. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2306.75,"end":2307.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2308.63,"end":2312.39,"speaker":"Fr Stephen De Young","text":"Because we've kind of severed off this stuff and decided it's superstition."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2313.43,"end":2313.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2314.79,"end":2343.16,"speaker":"Fr Stephen De Young","text":"But so that sort of culminates in something. Right. All of this forbidden knowledge, all of this ritual knowledge, this knowledge of wickedness culminates in sort of the two great paradigmatic sins of the Israelite and Jewish and Christian traditions are idolatry and sexual immorality. So if you smash those two things together, there's your sort of apex of human sin."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2343.57,"end":2343.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2344.85,"end":2355.17,"speaker":"Fr Stephen De Young","text":"And so that. That culmination takes the form of sexual immorality in the context of idolatrous pagan ritual."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2355.65,"end":2356.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2356.69,"end":2378.26,"speaker":"Fr Stephen De Young","text":"And so the same way that in a literary sense, Genesis 6:1 through 4 that we're talking about are sort of the culmination of the material in Genesis 4 and 5 in those genealogies. Right. This is sort of the culmination point of that human sinfulness before the flood leads to what's being described by the generation of the Nephilim."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2378.26,"end":2409.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's a really important point because, like, we just read those verses kind of out of context, but there's a reason that they appear at the. At that point in the. In Genesis where they do. And it has a lot to do with what came before it. You know, as you said, it's this culmination point. It's not. It's funny because I've heard people treat these verses like, oh, there's this weird little detour, you know, about giants and. And. Okay, now back to the main story, you know."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2409.74,"end":2410.1,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2410.1,"end":2411.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. But that's not."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2411.3,"end":2418.78,"speaker":"Fr Stephen De Young","text":"Who wants to read. Who wants to read genealogies, Right? I mean, come on, we're going to get back. Unless you're hobbiter, but yes. Nobody reads genealogies. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2418.94,"end":2422.04,"speaker":"Fr Andrew Stephen Damick","text":"Hobbits love genius. See, this is just proof for so."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2422.04,"end":2422.64,"speaker":"Fr Stephen De Young","text":"And Mormons."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2422.64,"end":2423.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and Mormons. There you go. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2423.84,"end":2424.4,"speaker":"Fr Stephen De Young","text":"Love Genie."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2424.4,"end":2433.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is just proof for the one guy who wrote to us in our group saying that Lord of Spirits and Aman Sul are really the same one podcast."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2434.4,"end":2434.88,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2435.04,"end":2437.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I'm going to just throw him a bone every so often."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2439.04,"end":2443.6,"speaker":"Fr Stephen De Young","text":"And we managed to get through the whole thing about the pre flood civilization without mentioning Numenor."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2443.6,"end":2444.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2444.12,"end":2445.56,"speaker":"Fr Stephen De Young","text":"You had to do it. You had."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2445.56,"end":2449.04,"speaker":"Fr Andrew Stephen Damick","text":"There we go. The Akaliba. So."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2450.96,"end":2509.23,"speaker":"Fr Stephen De Young","text":"But. So we talked about this a little in the 5ish Falls episode. The idea that what's being described here is sort of ritual that actually took place. We talked about Ogsbed, which now has its own meme as a Life verse in our Lord of Spirits group on Facebook, but that we there the OG's bed. OG is one of the giant kings, and we're going to talk more about him in a little bit. But his bed is described in sort of this random verse in Deuteronomy. Right. Why do we care about his bed and how big it is? But the reason for that, we now know archeologically, is we found a bed of exactly those dimensions and of the same metallic construction in the Ziggurat of Edamananki, which is the great ziggurat of Babylon. That was used for ritual purposes. Yeah, sexual rituals."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2509.23,"end":2576.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So let's talk about the dimensions. Right. If I recall correctly, it would be a bed for someone that's about 15ft tall. Right, right. Yeah. And. And, you know, as we. We talked about this in previous episodes. Yeah. So funny. In early episodes, a lot of our comment commentary was like, okay, we're going to get to that in a future episode. And now. Now we're kind of saying, well, in last time on Lord of Spirits, you know, the clips. Yeah, well, right. Because there were a lot of people that kind of wanted us to talk about this subject right off, because they're just really excited about it. But it really kind of does need a lot of this prior background. So if, listener, if you haven't listened to our previous episodes yet, I'm not going to tell you that you must pause right here and go back and listen to all that stuff. But it will make more sense. So why Is this bed 15ft tall? Well, that particular measurement is the way that ancient peoples said they saw spiritual beings appearing to them, that when a God shows up, that they're about 15ft tall."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2576.98,"end":2584.14,"speaker":"Fr Stephen De Young","text":"Yeah, we're going to. Now I'm going to flip it. We'll talk more about bodies, divine bodies, in a future episode."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2584.14,"end":2584.66,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2584.98,"end":2598.41,"speaker":"Fr Stephen De Young","text":"But, yes, one of the bodies that a God had in the ancient world was what's now called his liturgical body. And that's 15ft tall. Right. Pretty much uniformly across all over the world."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2599.37,"end":2600.25,"speaker":"Fr Andrew Stephen Damick","text":"All over the world."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2600.89,"end":2634.01,"speaker":"Fr Stephen De Young","text":"So, but what if you're talking about what a video camera would see, right. If you had a TARDIS and you went back and took a video camera right into Edamananky and snuck in and videoed what was happening on the bed? Right. On the bed. Is that as part of the festival cycle of these cultures, the king, as the high priest of the religion, would ritually embody the God who they were worshiping."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2634.01,"end":2639.17,"speaker":"Fr Andrew Stephen Damick","text":"And so how does that happen? I mean, do they say prayers over him. Do they? I mean, what do they do?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2639.17,"end":2677.38,"speaker":"Fr Stephen De Young","text":"Yes. How do you get sacrifices? Probably blood drinking, anointing, likely the wearing of a mask, and then would go in and ritually have intercourse with a temple slave or a temple prostitute on this bed. And that would be part of bringing about fertility for the crops and fields, consummating the relationship between the God they were worshiping and the people."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2677.46,"end":2677.74,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2677.74,"end":2695.78,"speaker":"Fr Stephen De Young","text":"The demonic spirit they were worshiping and the people. And so if a child was conceived to said king out of this ritual, that child would essentially have two fathers."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2696.99,"end":2697.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2697.19,"end":2712.11,"speaker":"Fr Stephen De Young","text":"The king, who was regarded as divine himself, the God, and then one human mother, the temple slave, who actually gave birth to him."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2712.19,"end":2721.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And doesn't displace. Put a sort of weird Paul now on that sitcom, was that in the 90s called My Two Dads?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2722.76,"end":2723.08,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2724.12,"end":2725.56,"speaker":"Fr Andrew Stephen Damick","text":"Which probably was not about."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2726.92,"end":2768.19,"speaker":"Fr Stephen De Young","text":"There's a very dark Sumerian version of that show. Sorry, little comic relief. And so what you find in the Babylonian sources in particular is, for example, on that same Sumerian kings list we mentioned, that lists the apkallu for each king before the flood, after the flood, each of the kings is two thirds apkallu, one third human. And you say, well, how could you be two thirds, one third? Well, if you have three parents, then you can. And Gilgamesh in the Epic of Gilgamesh is two thirds divine, one third human."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2768.35,"end":2768.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2768.83,"end":2809.84,"speaker":"Fr Stephen De Young","text":"And sometimes in some cultures, by the way, just this was reversed where it would actually be the temple prostitute or slave or priestess who would embody a goddess and the king would. Right. In which case you would have sort of two mothers and one father. So you get that with Gilgamesh being an example of that. So, yeah, that happened. But this is the kind of ritual activity. So this is idolatry, sexual immorality in the extreme. And so it's sort of saying this is how bad. How bad it got."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2809.84,"end":2810.84,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2810.84,"end":2813.4,"speaker":"Fr Stephen De Young","text":"Right before the. Before the flood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2813.4,"end":2892.19,"speaker":"Fr Andrew Stephen Damick","text":"And. Right. And. And then this is the ritual that produces giants. Right, right. And. And, you know, I think it's important to emphasize this because the, the, the passage from Genesis 6 doesn't give any of this kind of detail. It just sort of has this idea of angelic beings and human women. And, you know, and so then a lot of times people read that without the historical context, and they say, well, how can a demon hybridize with a human being? Right. Like they can't, you know, they can't mate. Right. But. But that is a misunderstanding of the way that the Nephilim ritual Works. And I know we're going to talk a little bit more about that, but I think it's just important to underline that. What the whole thing with OG and his bed, who is just one example of this ritual activity. It's happening all over the world. What that is is actually there are two human beings involved and one divine being. Although ancient peoples would have said that one of those human beings was effectively being divine during the. During. During the activity, which is."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2892.19,"end":2893.87,"speaker":"Fr Stephen De Young","text":"Well, the king was divine all the time."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2893.87,"end":2894.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2894.79,"end":2907.11,"speaker":"Fr Stephen De Young","text":"But doubly so when he's. Yeah. Embodying. Yeah. The reason that. That Genesis doesn't have to go into detail on this. Right. Is because the original readers knew about this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2907.19,"end":2907.75,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2907.75,"end":2930.99,"speaker":"Fr Stephen De Young","text":"Abraham lived his. Well, most of his life because he was quite old when he left in Ur, where there was a ziggurat. Right. That had just been rebuilt to enormous size during his lifetime. The great ziggurat of Ur was built literally while he was there and alive where these kind of rituals were taking place continuously."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2931.07,"end":2932.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2933.15,"end":2942.78,"speaker":"Fr Stephen De Young","text":"And he had members of his own family, we're told in scripture, and. And it's reiterated at the beginning of Joshua, who are involved in that idolatrous worship."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2942.94,"end":2943.5,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2943.98,"end":2946.06,"speaker":"Fr Stephen De Young","text":"So this isn't something Abraham didn't know about."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2946.46,"end":2946.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2946.78,"end":2962.38,"speaker":"Fr Stephen De Young","text":"It isn't something that there's, like, people that know about. There are versions of this going out. Right. The pharaoh's divine in Egypt. Right. He's married, usually to his sister. So the same kind of thing is going. They're aware of this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2962.38,"end":2972.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, but. So which ancient texts are describing this ritual? Like, where are we getting this from? Exactly. It's not in the Bible explicitly. Where is this being described?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":2973.44,"end":3021.61,"speaker":"Fr Stephen De Young","text":"Well, it's. I mean, it's all over the place. You have to read a bunch of Egyptian ritual texts and Ugaritic ritual texts from Canaan and Sumerian ritual texts. But as I mentioned to you, and then you repeated it, a bunch of people doubted you. But until they looked into it. But this, basically, this ritual still goes on in Japan with the Japanese emperor Right. At his accession. Every time. Even to the present day, though. Though Since World War II, it has been largely desexualized. Largely."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3023.29,"end":3065.26,"speaker":"Fr Andrew Stephen Damick","text":"And that's especially interesting because that is not an Indo European culture over there. And I make that point because one could say, okay, well, this particular ritual idea existed in this one culture, and then it just spread as that culture spread itself across Europe and Asia and so forth. But the thing is that we find this. This ritual activity happening all over the World and as we have seen, still happening in places where Christianity never really took hold. And so."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3065.42,"end":3070.06,"speaker":"Fr Stephen De Young","text":"And Mesoamerica. Yeah, the Aztecs, the Toltecs, you're right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3070.06,"end":3114.34,"speaker":"Fr Andrew Stephen Damick","text":"Again, not connected. Right. So, you know, there. That kind of is a big problem for the hypothesis that just sort of spread with human culture, though if you believe in the things that we've been talking about all this time, then it's actually much more reasonable to conclude that the reason why this ritual exists all over the world is because demonic beings came to human beings and taught them how to do it, just like they were teaching them all this other stuff, you know, so. So before we go to break, then, let's raise the question of why would a demon want to do this? What is the point? What is the goal of this other."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3114.34,"end":3115.86,"speaker":"Fr Stephen De Young","text":"Than just being perverse in general?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3115.86,"end":3119.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right, exactly. Which, I mean, that's kind of a goal that they have."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3121.18,"end":3121.58,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3121.98,"end":3123.42,"speaker":"Fr Andrew Stephen Damick","text":"Why would they want to do that?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3123.98,"end":3151.3,"speaker":"Fr Stephen De Young","text":"What's what we have set up for us in Scripture? We have to go back again to the beginning of Genesis. God creates man in his own image, right? And we tend to think of that, or discussions of it at least. Modern American Christian discussions of it at least tend to focus on the idea that the image of God is some quality that humans possess, right? Like it's their intellect or language or."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3151.3,"end":3152.62,"speaker":"Fr Andrew Stephen Damick","text":"This or that particular attribute."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3152.62,"end":3174.74,"speaker":"Fr Stephen De Young","text":"What's. Right? What separates a human from an animal, all of this kind of thing. Right. But the concept in Scripture is more of a verbal idea, right? You image someone, something, right? You image God."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3174.98,"end":3175.38,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3175.54,"end":3195.85,"speaker":"Fr Stephen De Young","text":"So Adam and Eve. Eve are called to fill the earth and subdue it. Right? To go and fill the earth with life and put it in order. And that's exactly what God did in creation, leading up to his creation of them and the giving of that commandment. So they're created to go and do what God does."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3195.85,"end":3201.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sub creation basically bring a ton."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3202.09,"end":3271.89,"speaker":"Fr Stephen De Young","text":"To bring the works of God and the will of God into creation, right? As his. As his image, as his icon. Right. To serve in that way. And so this goes all the way through the scriptures. I mean, when David is king of Israel, his duty as king is to bring about God's justice in his rule. Right? And so that's the idea. And doing that is transformative to humanity, right? Being that agent of God transforms humanity. This is why the Fathers taught, even though in the Hebrew the words for image and likeness are basically synonyms, but the Fathers use those words to describe how image is, this capacity to do this and likeness is the fruit of doing it. We become more like God by being the means by which God acts in the world, by participating in his will and in his works and in his actions in the world, we become like him."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3271.89,"end":3272.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3272.77,"end":3277.89,"speaker":"Fr Stephen De Young","text":"And this is. This is of course, the stuff of theosis that we talked about in terms of becoming sons of God."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3277.89,"end":3278.45,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3278.61,"end":3284.37,"speaker":"Fr Stephen De Young","text":"Because this is what it means to be a son Biblically. The Son is the image of the Father."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3284.37,"end":3285.89,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3286.27,"end":3289.75,"speaker":"Fr Stephen De Young","text":"Adam had a son in his own image after his own, like a chip."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3289.75,"end":3291.55,"speaker":"Fr Andrew Stephen Damick","text":"Off the old block, as it were."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3292.51,"end":3304.51,"speaker":"Fr Stephen De Young","text":"Right. And so we see that the devil, as the fathers tell us, falls through envy. The reason the devil wants to destroy Adam and Eve is because he's jealous."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3304.51,"end":3305.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3306.35,"end":3309.39,"speaker":"Fr Stephen De Young","text":"Because he was not created for that destiny."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3310.51,"end":3310.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3313.08,"end":3398.85,"speaker":"Fr Stephen De Young","text":"The eternal Son of God was not going to become an angel. He was going to become incarnate to become man, to give man this destiny. And out of jealousy, he decides to destroy humanity. And so these demonic powers we see following in his footsteps, to try to destroy man by revealing these secrets, ultimately, in this culmination, they're trying to create their own image. They're trying to create human beings after their image and likeness who will bring their will and desires into the world and who will become like them. And they can't create from the dust of the earth the way God did. All they can do is take the human beings who God has created and corrupt them and twist them and lure them into. Through evil, becoming like themselves. So it's sort of an anti theosis where these people become like demons and so the giants. To be a giant is to be one of these sort of fully demonized people. It's like the opposite of a saint. It's the opposite of someone who's achieved theosis and become like Christ. It's someone who's become like a demon with all of their lust and fury and violence and destructive capacity and spite."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3399.41,"end":3409.25,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Okay. Well, we are going to go to break, and when we come back, we're going to answer a couple of your questions. So we'll be right back."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3409.57,"end":3425.9,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3430.3,"end":3433.26,"speaker":"Fr Andrew Stephen Damick","text":"We're so glad you're listening to Ancient Faith Radio."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3434.06,"end":3436.7,"speaker":"Fr Stephen De Young","text":"I'm a listener and an educator and."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3436.7,"end":3457.82,"speaker":"Fr Andrew Stephen Damick","text":"Am grateful for the variety of resources that Ancient Faith offers to those of us who are working to help young Orthodox Christians Christians grow in their faith. Ancient Faith Ministries recently learned that the Renaissance fund will match dollar for dollar any contributions made between November 24th and December 2nd. Please consider how much you can give."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3457.82,"end":3462.62,"speaker":"Fr Stephen De Young","text":"To help ensure that Ancient Faith will continue to offer new resources to the."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3462.62,"end":3464.42,"speaker":"Fr Andrew Stephen Damick","text":"Youngest members of our parishes."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3464.98,"end":3466.86,"speaker":"Fr Stephen De Young","text":"Remember that any donation we make to."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3466.86,"end":3471.75,"speaker":"Fr Andrew Stephen Damick","text":"Ancient Faith between November 24th and December 2nd will be matched dollar for dollar."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3471.83,"end":3474.23,"speaker":"Fr Stephen De Young","text":"Up to the $50,000 goal."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3474.87,"end":3478.15,"speaker":"Fr Andrew Stephen Damick","text":"Visit ancientfaith.com today and click the Support."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3478.15,"end":3484.35,"speaker":"Fr Stephen De Young","text":"Tab in the upper right hand corner to make your donation. On behalf of Orthodox Christian teachers and."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3484.35,"end":3487.75,"speaker":"Fr Andrew Stephen Damick","text":"Their students, I thank you in advance for your donation."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3488.31,"end":3504.42,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3510.66,"end":3643.35,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. Welcome back. As I said before, this is a pre recorded episode of Lord of Spirits. So even though the voice of Steve just told you to call, if you call that number right now, you're not going to connect to us. We're not there. But anyway, we wanted to talk about some of the questions that you sent that are related to everything we just discussed. And so this first one is an email from Deborah. And Deborah wrote this as I was listening to your most recent podcast, when you talked about OG's ritual bed and the pagan king coming to commit fornication with a temple prostitute and thereby conceiving the next king, I thought about comparing and contrasting this with the conception of Christ. So she makes several contrasts. There's a temple prostitute versus the temple virgin. There's two fathers in the Nephilim ritual versus one father in Christ. The future king is conceived. That's a parallel in both. In the Nephilim ritual, The person is 2/3 Apkalu and one third human. And then in the incarnation of Christ, he is 100% divine and 100% human. She goes on to say, I'm wondering if the way the Gospel story is written would have been immediately recognizable as a sort of subversion, if you will, of the pagan practices of the day. And you know, my immediate reaction to that is I wouldn't say that the Gospel story is a subversion, but actually it kind of reveals that the Nephilim ritual is the subversion. You know, that these demons are engaging in the thing that they're not kind of authorized to do. And of course they fail, right? They succeed in making demonized people but they don't actually succeed in kind of having their own actual offspring in any real sense. Like, demons cannot reproduce. Right. They're sort of commandeering human beings in order to make this thing happen. You have any comments on that, Father?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3645.19,"end":3674,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, there's a definite. Obviously, as you point it, there's a definite, like, direct contrast there. And, you know, I'll throw in another one. Right. In our salvation, in the incarnation, God saves and transforms us by becoming like us, by taking our humanity right upon himself. Whereas in all of pagan religion, and any ancient pagan would agree with this, the goal is by worshiping these beings and performing these rituals to become like them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3674,"end":3674.56,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3675.68,"end":3687.85,"speaker":"Fr Stephen De Young","text":"Right. They would have absolutely agreed with that. And that's the goal. And Caesar or someone, one of these kings who experiences apotheosis, that's it. When they die, they go and become like the gods they've been worshiping."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3687.85,"end":3787.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it kind of underlines, too, like, you know, the giants who. We didn't really emphasize this yet, but, I mean, they have what we might describe of as sort of superhuman power, influence, maybe size, depending on how you read it. They. They are not, from the biblical point of view, they are not nice, just good, virtuous people. They are domineering, destructive conquerors who are able to control lots of people. And the thing is, outside of the people of God, in the ancient world, that was seen as positive. You know, if you had control over a lot of people and were able to dominate them, that was because you were in tight with the gods. And that was a good thing for you anyway, not for the peasants that you had under your boot. But it just shows, again, what a difference. Christ, who comes in the humblest of circumstances, and he comes in peace, he comes in humility. He does not come with the sword. Right. His weapons are truth and meekness and righteousness. And it just underlines again, the morality of the ancient world was so utterly different from ours that, you know, if you could control other people and you had domination over other people, that was an indication that the gods smiled upon you and were one with you. You had succeeded. You were it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3787.67,"end":3796.96,"speaker":"Fr Stephen De Young","text":"You know, Julius Caesar was first celebrated as being godlike because he had killed a million Gauls and enslaved a million more."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3797.12,"end":3798.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3798.48,"end":3800.72,"speaker":"Fr Stephen De Young","text":"That was his slogan. That's what they were celebrating."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3800.96,"end":3802.44,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3802.44,"end":3803.52,"speaker":"Fr Stephen De Young","text":"About how great he was."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3803.68,"end":3822.49,"speaker":"Fr Andrew Stephen Damick","text":"And so, by contrast, now in the 20th and 21st century, when we say someone is like Hitler, we mean exactly the opposite. But if Hitler had lived in the ancient world, he would have been Regarded as a success, as a big hero."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3823.45,"end":3825.73,"speaker":"Fr Stephen De Young","text":"Well, he would have been kind of a trifler by ancient state."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3825.73,"end":3826.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes. By comparison."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3826.73,"end":3828.49,"speaker":"Fr Stephen De Young","text":"A lot more. They killed a lot more people."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3828.57,"end":3828.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3828.97,"end":3873.17,"speaker":"Fr Stephen De Young","text":"But the point stands. We look at him as we say this is a demonic person. And that's because we've taken on board what the scriptures say about giants as opposed to how the ancient world viewed these giants. And the word giant itself, both in the Greek and the Aramaic, we should say. And this has been memed too, since apparently I've said it a couple too many times. But the word. They don't call someone a giant to tell you he's a big guy. They tell you he's a big guy to indicate to you that he's a giant. And the word giant means more like tyrant or thug or bully."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3873.17,"end":3873.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3873.97,"end":3913.13,"speaker":"Fr Stephen De Young","text":"And it's kind of the way we. In the modern world. This is the part that got memed. Use the word strongman when we're talking about a dictator. Right. So they'll talk about Panamanian strongman, Manuel Noriega. They don't mean he had an awesome bench. Right. And was just ripped. They mean he's a tyrant. Right. He's a strong man, he's a bully, he's a thug. Right. That's the kind of administration he has. That's what the scriptures are saying about these people, these kings and these rulers and these leaders, that they're this demonically evil type of person."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3913.21,"end":3926.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. So we also got a recorded message from Adam, who had something relevant to ask as well. So I'm going to play that then for us. Hello, Lord of spirits."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3928.38,"end":3946.3,"speaker":"Fr Stephen De Young","text":"My question is, do we know of any literature that details how Noah built the ark? Meaning did Noah build the ark by himself? Or did Noah have help from angels? Or did Noah have help from giants?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3948.06,"end":3957.33,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, guys. Appreciate the show. So. So what? This is where you said something about that Russell Crowe movie earlier. We were talking. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3957.97,"end":3960.53,"speaker":"Fr Stephen De Young","text":"So Darren Aronofsky's Noah. Yes."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3960.53,"end":3961.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3963.25,"end":3966.45,"speaker":"Fr Stephen De Young","text":"Which he adapted from his graphic novel, actually. Interesting."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3966.93,"end":3969.97,"speaker":"Fr Andrew Stephen Damick","text":"And I have to admit, I have not. I have not seen it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3971.25,"end":3974.85,"speaker":"Fr Stephen De Young","text":"Right. I highly recommend it, but not for historical accuracy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3974.85,"end":3981.45,"speaker":"Fr Andrew Stephen Damick","text":"Right. So is Adam onto something here? I mean, you said he thinks you're pretty sure that Adam watch this movie."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":3982.65,"end":4006.73,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. In the movie the Watchers of Enoch. And I'm sure we'll do a future episode just talking about first Enoch. But the watchers are the term that's used to refer to the angelic beings. The sinful, rebellious, angelic beings. They, as their punishment get turned into these sort of giant rock guys."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4007.25,"end":4009.33,"speaker":"Fr Andrew Stephen Damick","text":"Right, I've heard. I've heard about that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4010.77,"end":4035.17,"speaker":"Fr Stephen De Young","text":"And they. They kind of repent and decide to help Noah and sort of help him build the ark and. And fight off the people who are trying to besiege the ark. Because, yeah, it's sort of. It's. If you take all the Noah traditions from Second Temple literature and from the Bible, and then you smash that together with Gladiator, that's what this movie is."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4036.62,"end":4037.74,"speaker":"Fr Andrew Stephen Damick","text":"I have to see it now."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4039.26,"end":4091.13,"speaker":"Fr Stephen De Young","text":"Are you not including Russell Crowe? Are you including his presence? But. So I think that maybe, but maybe not. But that may be a generator's question. But there are in those traditions, not that the rebellious angels helped Noah, but there are sort of bits and pieces and scraps of Noah traditions in some of those things that, yes, he was assisted by sort of angelic beings. A lot of that is related to trying to present Noah as this prophet. He's presented sometimes as an almost supernatural being himself in a lot of these traditions. So he sort of knows angels and hangs out with them. Right, because he has this sort of prophetic life and special capacity. And so there are stories where he's interacting and they're helping him build things."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4091.29,"end":4097.93,"speaker":"Fr Andrew Stephen Damick","text":"And isn't there this tradition that. That sort of thing that Noah himself was one of the Nephilim?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4099.29,"end":4151.81,"speaker":"Fr Stephen De Young","text":"There are. Yeah, there are bits of that on both sides. There are some traditions that. That he was, and then other traditions that seem very clear to try to indicate that he wasn't, which means it was something that was being discussed, because you wouldn't make a protracted argument that he wasn't one of the. Unless somebody thought he was. But, yeah, there are these stories that sort of. When he was born, he sort of came out glowing and talking and all these other things to indicate his special status in Genesis 5. In another one of those genealogies, nobody reads Noah's father. Lamech actually makes this prophecy about him that frames the whole story of the Flood. But. So that's been sort of elaborated on that the reason Lamech makes this prophecy is that he's got this glowing baby who talks."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4153.09,"end":4157.25,"speaker":"Fr Andrew Stephen Damick","text":"You guys are never going to read the story of knowing the ark the same way ever again, are you?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4159.49,"end":4187.04,"speaker":"Fr Stephen De Young","text":"But so based on that, there are these whole stories where Lamech sort of has these doubts, like, am I really Noah's father because he's glowing and talking and stuff, or is he one of the Nephilim? And there's sort of an. Sometimes it's an angelic revelation to him, sometimes it's Enoch actually shows up. He comes back from heaven and says, listen, Lamech, don't worry about it. It's really your kid."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4187.76,"end":4196.72,"speaker":"Fr Andrew Stephen Damick","text":"And of course, Enoch is really important to all of this stuff because he's antediluvian himself, and it's taken up into."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4196.72,"end":4219.17,"speaker":"Fr Stephen De Young","text":"Heaven and sort of joins the divine council beforehand. But the really interesting thing about those stories is that St. Matthew draws on them a little bit. St. Matthew's gospel actually has a lot of the Anakic literature, themes and language woven into it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4219.97,"end":4220.69,"speaker":"Fr Andrew Stephen Damick","text":"Oh, boy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4220.77,"end":4258.27,"speaker":"Fr Stephen De Young","text":"But one place where he plays on that is when he tells the whole story of St. Joseph the betrothed doubting what's going on with the Theotokos when she becomes pregnant, sort of being worried, right, about what's going on. And he gets the exact opposite message. Lambet gets sort of reassured, no, this is your child. Right? Don't worry about it. He's just special. Right. Joseph gets told, well, no, this isn't your child, but also doesn't have a human father. So St. Matthew kind of inverts that. That's. Since we're talking about biblical inversions."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4259.15,"end":4263.07,"speaker":"Fr Andrew Stephen Damick","text":"And now you'll never read Matthew the same way ever again."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4263.95,"end":4265.63,"speaker":"Fr Stephen De Young","text":"Of flood related service. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4265.71,"end":4337.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. All right, well, we've got one more question before we continue on. And this one comes from Father Stephen, who is an Anglican military chaplain. So Father Stephen writes this. Genesis 6 teaches that the Nephilim, or giants, are the offspring of the sons of God entering the daughters of men. This unholy offspring should all have been destroyed in the flood. Yet we see giants appearing later in the scriptures. If the giants are the result of demons mating with humans and they were destroyed in the flood, how did they come back? Did the demons mate with humans again after the flood? If so, could that happen again today? And to that we will simply respond. Welcome to part two of this week's episode. So, yeah, all right. Well, he makes the point that there's giants after the flood. Right. So the point of the flood is to rid the world of giant culture. Right. And yet there are giants after the floods. So let's start talking about giants after the. The flood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4338.48,"end":4349.2,"speaker":"Fr Stephen De Young","text":"And even Genesis 6:1:4 alludes to that. Right. Because it says at this time and after. And after the Nephilim were in the earth."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4350.56,"end":4351.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4351.92,"end":4383.98,"speaker":"Fr Stephen De Young","text":"So, yes, it even alludes to the fact that there are going to be some later. And since that's right before the flood, it doesn't mean before the flood. That would be at this time. So what we see. When we see the giants again. Right. When we see the giants again later, starting in Genesis, and then especially when we get into numbers and Deuteronomy and Joshua is. It's not just sort of these isolated people, but there are whole sort of giant clans."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4384.14,"end":4384.78,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4385.82,"end":4418.91,"speaker":"Fr Stephen De Young","text":"There are clans, tribes. Right. Sort of the. These social units that are described as being sort of made up of giants. Right. So it's not just, you know, there's a bunch of poor oppressed people who have this tyrant for their king, but they're sort of all engaging in something. Right. That they all get categorized this way. And so this is related to how sort of identity worked in the ancient world."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4418.91,"end":4419.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4419.67,"end":4428.19,"speaker":"Fr Stephen De Young","text":"This is. This is something that we now, as modern people, understand DNA."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4428.75,"end":4429.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4429.43,"end":4464.96,"speaker":"Fr Stephen De Young","text":"We understand genetics. We have these ideas of ethnicity and race and these kind of things in our head, and we read those back into the scriptures and into other ancient texts, and it really sort of distorts what we're reading. Yeah. This really makes hash of. We won't go into this today, but this really makes hash of everything St. Paul has to say about Jews and Gentiles. If you think that's a racial or ethnic thing."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4464.96,"end":4465.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4467.53,"end":4482.81,"speaker":"Fr Stephen De Young","text":"But when we go back into the ancient, ancient world, right. You are a member of a social unit. Right. Whether it be a tribe, a clan, a city, there's some social unit that you belong to."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4482.81,"end":4489.65,"speaker":"Fr Andrew Stephen Damick","text":"It's the people you live and work and eat and worship with. All of those."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4489.65,"end":4525.21,"speaker":"Fr Stephen De Young","text":"Right. It's all encompassing. Yeah, yeah, Right. It's all encompassing. Yeah. And that is primarily manifested and made real by ritual in the ancient world. And it still is today, to a large extent, though we're less aware of it and we have sort of secularized rituals. Right. You know, I don't know if we'd go so far as to say this is what makes you an American, but there are definite American rituals, right. Celebrating the fourth of July, voting. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4525.21,"end":4557.7,"speaker":"Fr Andrew Stephen Damick","text":"And if you want to become an American, you have to go through a ritual. You have to go through naturalization, which not only includes, like, taking a test, which of course is one of our wonderful American rituals, but. But also, like, you have to take an oath, right? You have to take an oath to become an American, Which, I mean, what is the point of that? I mean, does that do something? It's words that are understood to have a power over you. It's a very spiritual act, frankly."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4558.02,"end":4581.72,"speaker":"Fr Stephen De Young","text":"Right. And whatever you were before, however you identified before, now you're in America because you've gone through that. Initiation. And now you're gonna celebrate the rituals. Right. We just went through this election and had people say, oh, the vote is sacred. Right. The ballot box is sacred. Right. It's like, well, wait, what is that? Well, that's. That's this idea intruding, despite secularism, can't escape it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4582.2,"end":4582.76,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4583.24,"end":4600.6,"speaker":"Fr Stephen De Young","text":"So in the case of ancient Israel, right, that was if you were. You were an Israelite, if you were circumcised or the wife or daughter of a circumcised male, and you ate the Passover. Right? That was sort of the basic."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4600.6,"end":4655,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's an important point. Point, because. And this is something I learned from reading stuff that you've written. You know, when Israel engages in the exodus from Egypt, there are people who are not what we would regard as ethnically, you know, descendants of Abraham, you know, there are Egyptians, there are Canaanites that participate in the Passover, eat the Passover and make the Exodus, and some of them even become leaders of Israel. Like, they're so much part of Israel that they're leading Israel, you know, and it's not an ethnic thing at all. It has nothing to do with DNA. It has to do with ritual participation, especially in the Passover, which, you know, is so important in that particular account in Scripture that before the event happens, you get instructions on how to commemorate it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4655.87,"end":4656.11,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4657.15,"end":4666.67,"speaker":"Fr Andrew Stephen Damick","text":"So fascinating, you know, that you become part of this people by engaging in these participatory acts, you know."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4668.99,"end":4706.2,"speaker":"Fr Stephen De Young","text":"And two big examples are Caleb, who, when he first shows up, is a Kenizzite, which is one of the Canaanite tribes, and ends up being an elder of the tribe of Judah, and Phinehas, Aaron's grandson, Phinehas, who was ethnically a black African who became the high priest of Israel. So, yeah, the ethnic ideas right out they were. Caleb and Phidias are no less a son of Abraham than anybody else."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4707.02,"end":4752.23,"speaker":"Fr Andrew Stephen Damick","text":"And this is underlined in the church now, where you see all this language in liturgical texts about belonging to a new nation, belonging to this phrase is even used, the race of Christians, right? And what makes us all Christian together, it's that we've been initiated through baptism, that we partake in the Eucharist together, that we live as have been commanded us by God through Christ, you know, in Christ and through the apostles and prophets. It's what we do that makes us Christians. It's not genetic at all. You know, it's this ritual participation that makes us Christians, and ongoing ritual participation which keeps us being Christians."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4752.71,"end":4865.02,"speaker":"Fr Stephen De Young","text":"Right, right. And that's Where. This is where in Orthodox canon law, right. The bare minimum to be an Israelite is your circumcised and you celebrate Pascha. If you look at Orthodox canon law, what makes you an Orthodox Christian is that you've been baptized and at least on Pascha, you receive the Eucharist. Yep, yep. And if you don't do that, you're lapsed. You're now outside the social unit and have to be brought back in ritually. Yeah, but. So the same thing was true for these giant clans and tribes. They weren't members of these giant clan and tribes because they just happened to be born into it ethnically. They went through initiation rituals and they participated in the ritual life of this clan. And the ritual life of this clan not only involved sort of the sexually immoral rituals we've already discussed, but we get some clues again in the sources. I won't read the full text of this, but if anyone wants to look up first, Phoenix 746, in describing the wickedness and the lifestyle of the giants, it talks about not only sort of the mass slaying of animals in sacrifice, but cannibalism and human sacrifice. Yeah, sacrifices. We'll do an episode on sacrifices eventually. I know people love when we do that, but sacrifices in the ancient world are not killing something. Sacrifices are meals. And so when we're talking about human sacrifice, in most cases it's involving cannibalism, minimally in the form of blood drinking, sometimes worse."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4865.02,"end":4883.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, so I don't know, maybe, you know this off the top of your head. You know, when. When the. The Catholic conquistadores came to South America and they encountered the Aztecs who are doing human sacrifice, was there cannibalism involved with that?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4884.14,"end":4884.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4885.42,"end":4886.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4887.02,"end":4893.38,"speaker":"Fr Stephen De Young","text":"Yeah. And that was one of the motivations for this. Has to be wiped out."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4893.38,"end":4894.02,"speaker":"Fr Andrew Stephen Damick","text":"Wiped out."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4894.58,"end":4895.62,"speaker":"Fr Stephen De Young","text":"Right. This."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4897.7,"end":4898.1,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4901.3,"end":4916.03,"speaker":"Fr Stephen De Young","text":"This is going to be important. Right. When we get to talking about Joshua, which people today want to present as genocide, they say, oh, well, this is going and murdering these people because of their race or ethnicity. And no, there's not a concept of race or ethnicity."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4916.1,"end":4916.66,"speaker":"Fr Andrew Stephen Damick","text":"Ethnicity."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4918.74,"end":4925.22,"speaker":"Fr Stephen De Young","text":"This is not a popular thing in the modern world either. But this is the idea of wiping out these ritual and cultural practices."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4925.46,"end":4925.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4927.3,"end":4928.42,"speaker":"Fr Stephen De Young","text":"This is what has to stop."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4928.42,"end":4958.48,"speaker":"Fr Andrew Stephen Damick","text":"And it's not the way we tend to think of ritual and culture. Now, again, we're talking about people who are in communion with demons and are engaging in demonic fornication rituals in order to produce demonized human beings who have supernatural abilities. That's what's going on that's being wiped."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":4958.48,"end":5016.62,"speaker":"Fr Stephen De Young","text":"Out, mass enslaving people, murdering those people, sacrificing them to these demons and eating them, drinking their blood, potentially more. Right, right. These are. This is what the Old Testament is describing as abominations that need to be put an end to. Right, Right. So you could do that in a couple of ways. Right. If someone won't stop doing these things. Right. In the ancient world, the scripture is saying that person, if they won't stop doing this, has to be put to death. Right. If. But if someone is ritually brought into another tribe, into another clan, abandons these things, they're no longer part of that clan. Right. So if everyone from a giant clan has. Is either dead or assimilated into another group that is not practicing those things, the clan has been eradicated."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5016.86,"end":5017.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5018.22,"end":5057.41,"speaker":"Fr Stephen De Young","text":"And that's, that's really. You can't underestimate the importance of that to understanding a lot of the Old Testament history we're about to talk about. So talking about gigantomachy and this war against the giants, this is really directed at these specific clans. And when Israel is sent to war against these specific clans, the commandments and the guidelines and the rules of warfare are different for these clans than they are for the other residents of the land."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5057.49,"end":5119.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think that's a really, really important detail because, you know, the book of Joshua, I think, can get kind of a bad rap in the modern world. And there are even orthodox people who will say, well, you know, could God really have commanded people to go and wipe out whole civilizations? You know, and I think that that reveals that the detail that you just mentioned, that the rule for engaging a giant clan is different than the rule for engaging in combat with, you know, sort of an ordinary pagan group that's somewhere else there in can. In Canaan, because, you know, everybody there is some kind of pagan, except for the Israelites. Right. So there's. There's a conquest going on, but it's not just, okay, God has decided to give you guys this land and go ahead, just wipe out everybody. Right. It's way more complex than that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5120.53,"end":5139.24,"speaker":"Fr Stephen De Young","text":"Right. And it's, it's. I mean, you see this in stark relief sort of in, in Deuteronomy, chapter 20, where it's giving the commandments for warfare in general, you know, and it talks about how basically they. They aren't allowed to engage in aggressive warfare to take territory and spoils, which."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5139.56,"end":5143.88,"speaker":"Fr Andrew Stephen Damick","text":"That's super different in the ancient world. Yes. Nobody believes in that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5144.76,"end":5152.67,"speaker":"Fr Stephen De Young","text":"And even, even when they do go into war, before they lay siege to a city, they were, they have to offer the city peace."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5153.22,"end":5153.62,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5154.18,"end":5160.66,"speaker":"Fr Stephen De Young","text":"It's only if they refuse all offers of peace that Israel is allowed to make war against the city."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5160.66,"end":5162.74,"speaker":"Fr Andrew Stephen Damick","text":"Does that count with giant clans as well?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5163.46,"end":5178.1,"speaker":"Fr Stephen De Young","text":"Well, that's it. There's. And then in the midst of all that, in Deuteronomy 20, there's this. Except, right. The Hivites, the Jebusites. Right. It lists the particular clans, the particular tribes and groups."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5178.46,"end":5185.7,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which, if you don't know that those are giant clans, it might just look like, okay, God decided to single out these people for."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5185.7,"end":5244.04,"speaker":"Fr Stephen De Young","text":"Right. He just doesn't like them for some reason. Yeah. But it's very explicit, right, that whenever those groups are all listed, Yahweh says, you know, number one, he says he's the one who's judging them. He's the one who's going to defeat them. He's the one who's going to destroy them. Israel is sort of the instrument for that. And he says that it's because of their idolatry and their abominations. It's because of these things we've been talking about, the rituals that make them who they are, that constitute that tribe, are rituals of enslavement, tyranny, human sacrifice, idolatry, sexual immorality. And so there's not a difference between those things stopping and the tribe ceasing to exist as a tribe. Because those are the things that constitute the tribe."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5244.12,"end":5244.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5244.6,"end":5245.72,"speaker":"Fr Stephen De Young","text":"As a social unit."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5245.8,"end":5246.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5247.72,"end":5257.8,"speaker":"Fr Stephen De Young","text":"And so, yeah, so they're sort of accepted from those general rules, which were amazing for the ancient world, as you mentioned."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5257.89,"end":5258.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5258.09,"end":5258.53,"speaker":"Fr Stephen De Young","text":"You know."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5258.61,"end":5259.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5259.33,"end":5260.37,"speaker":"Fr Stephen De Young","text":"Drop out of nowhere."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5260.37,"end":5283.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Why wouldn't. Why wouldn't you engage in wars of conquest as often as you possibly could manage it? That's, you know, now we have this idea, well, that's immoral. You shouldn't do that. But no one at that time had that idea except this one. People that God had chosen for himself, had made, created this nation for himself."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5284.54,"end":5295.1,"speaker":"Fr Stephen De Young","text":"Right. And the total warfare that Israel is supposed to make against these tribes is the kind of warfare that all of Israel's neighbors waged against everyone all the time."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5295.1,"end":5296.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5296.86,"end":5332.44,"speaker":"Fr Stephen De Young","text":"So that's not the exceptional part, that's the more normal part, the accepting everyone else in the world from that is the strange part about the Torah. These are just to be treated the way you would normally treat enemies, with one exception even there, and that's that to reinforce the fact that it wasn't them defeating them that it was Yahweh, their God, defeating them, and that this was an act of his judgment, not just their military might and expansionist tendencies. They weren't allowed to take any of the spoils."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5332.76,"end":5334.76,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's interesting. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5335.25,"end":5358.93,"speaker":"Fr Stephen De Young","text":"The physical objects, the gold, the silver, the livestock, all of the wealth of these tribes was considered to be tainted by what they had done. And so it was all dedicated and considered accursed and put under a ban and had to be destroyed."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5359.09,"end":5363.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There was that incident about someone who took some gold, and I'm trying to remember who that was now."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5363.67,"end":5364.19,"speaker":"Fr Stephen De Young","text":"Achan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5364.19,"end":5366.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5366.03,"end":5381.83,"speaker":"Fr Stephen De Young","text":"Achan in Joshua, who tried to keep some of it, and a curse came on the camp because of it. Yeah. So the word, the Hebrew word herem there, it's actually from the same root as Haram and Mount Hermon that we've talked about before."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5381.99,"end":5386.31,"speaker":"Fr Andrew Stephen Damick","text":"You know, forbidden, cursed, sinful, all those things."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5387.35,"end":5398.29,"speaker":"Fr Stephen De Young","text":"But the word is used both for things that are set apart because they're accursed and things that are set apart because they're holy or are going to be offered as a sacrifice."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5398.29,"end":5398.89,"speaker":"Fr Andrew Stephen Damick","text":"Interesting."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5399.61,"end":5416.13,"speaker":"Fr Stephen De Young","text":"So the idea is that it's sort of. Sometimes the word dedicated is used there to kind of try and cover both meanings. These things are dedicated for destruction. Right. They belong to Yahweh as his spoils, and he's destroying them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5416.44,"end":5471.57,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which I think that. That, as you said, kind of underlines also, just from the point of view of people who think, okay, God is commanding genocide. If that's just sort of the bare understanding of what it is, of what's happening there, then why would God, you know, put these things off limits? It just underlines that the whole point is to blot out these practices from the face of the earth. And Israel is his instrument. If it was just, okay, God is giving them permission to go and wipe out these certain people and take all their stuff, then that would be a different ballgame. But they're not allowed. They're not allowed. The point is that they're going in and enacting God's justice, which is to set things right. Yeah, yeah, yeah. A really important. Interesting detail. Interesting detail."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5471.81,"end":5494.47,"speaker":"Fr Stephen De Young","text":"Yeah. And through these tribes of their practices, these demonic entities that stand behind them, right. Who are the fathers of their chieftains, right. Are subjecting the land, their neighboring peoples, to this demonic tyranny and injustice. You know, they're enslaving their neighbors and sacrificing them to their gods, literally."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5494.71,"end":5518.88,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So I mean, what about the problem of. So, you know, okay, Israel moves In, they take one of these cities, they kill everybody in it. I mean, what about, I mean, are there some innocence there? There's got to be kids, babies. I mean, what, you know, like how do we, what do we do with that?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5520.47,"end":5541.03,"speaker":"Fr Stephen De Young","text":"If a one year old or a two year old horite in one of these giant clans perishes without having participated in these rituals, we look at that and say, oh, that's a horrible thing. That's the worst thing that could happen to him. This little 2 year old never got to live his life in this world, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5541.75,"end":5542.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5542.23,"end":5585.1,"speaker":"Fr Stephen De Young","text":"What would his life in this world have been like if God hadn't done anything about the horites? He would have grown up to be initiated into these things. These things. Right. So to be blunt, we have to remember that the last judgment and eternal life and eternal condemnation exist when we're reading the Bible. I know that sounds bizarre, but. Right. So the perspective of scripture, like you read in the book of Wisdom, right. That someone who lives a short time in innocence and then God takes them to himself. Right. That's a blessed person."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5585.26,"end":5614.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. So it's basically, we should look at it as we would an infant who dies shortly, you know, in maybe before birth or shortly after birth and not by any human sin, but let's say they were born with some kind of birth defect and they die. A lot of times people look at that and they'll say, why God?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5614.68,"end":5615.08,"speaker":"Fr Stephen De Young","text":"Why?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5615.48,"end":5648.69,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because it seems, I mean, it's such a difficult thing to endure, especially if it's your child. But from a Christian point of view, that person, their entire earthly existence was in innocence and they are in the hands of God. And from an earthly point of view, it's the worst thing ever. Right. Here's someone who had their whole life snatched from them. And yet from a Christian point of view, what is this life but preparation for the next?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5650.44,"end":5663.56,"speaker":"Fr Stephen De Young","text":"The purpose of this life is repentance. And it ends when that's either complete or when we've rejected repentance so many times and so thoroughly that our chances have run out and God's patience has run out."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5663.64,"end":5776.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I recall there was kind of a hard saying I remember reading, and I think this was in the writings of Saint Paisios, the relatively newly canonized saint, the elder from Greece. He was talking to someone about children who, who die, people who die young. And he essentially said, well, the reason why God took them is because he knew that if they continued in life that they would probably become very sinful. And so he took them earlier out of mercy. And you know, I remember reading that and like, I thought to myself, okay, this does make sense to me. But I imagine that would be hard to hear, like, oh, how dare you say that my kid was going to turn out bad, you know, but here's St. Paisios who talks to angels, who, you know, who has clairvoyant insight from God saying this. And while not every single thing, every single saint says is, should be, you know, is right. Like all their opinions about everything, you know, based on what we've just been talking about, if you understand the providence of God, it does make sense. Like there's a sense that God protects people from sin sometimes by making their lifetime shorter than we think it should be. And so children in a Nephilim city who by the hand of God working through Israel are removed from this life early. It's actually a blessing because it's preventing them from becoming involved in idolatry and they'll be judged much, much, much, much more mercifully because they never were involved in that sin. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5777.95,"end":5787.41,"speaker":"Fr Stephen De Young","text":"And in our Orthodox funeral service over and over again, we refer to the person who's passed away as the one who God has chosen and taken."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5787.89,"end":5789.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's a delusion."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5789.21,"end":5803.89,"speaker":"Fr Stephen De Young","text":"Chosen and taken to himself. So they haven't, they haven't suffered a misadventure, they haven't lost a battle with an illness. Right. They've won a battle against sin. Hopefully they haven't, you know, it's not something bad has happened to them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5804.78,"end":5805.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5805.26,"end":5827.9,"speaker":"Fr Stephen De Young","text":"There's something to grieve there. I mean, something bad has happened to us in terms of our loss and that kind of thing. But the person, from the perspective of the Christian faith has been chosen by God and taken to himself. And that's not a bad thing."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5828.22,"end":5846.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. It's hard. I mean, it's a hard saying. But that's because we're materialist minded, because we function as though this life is all there is. That's why it's hard. And. Or we don't believe that God is really using the Israelites here."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5847.91,"end":5861.31,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, we demythologize the text. We say what's really going on is just one tribe is killing its neighboring tribes and calling them demons to justify it. Yeah, right. But that's not what the text says, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5861.31,"end":5872.07,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you could just simply say, well, I don't believe the text. But that of course, like, well then why, why be Christian? Right. You know, really, like if."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5872.15,"end":5872.95,"speaker":"Fr Stephen De Young","text":"Why is it important?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5873.11,"end":5873.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, why is."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5873.75,"end":5874.79,"speaker":"Fr Stephen De Young","text":"It's all a bunch of Nonsense."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5875.43,"end":5977.68,"speaker":"Fr Andrew Stephen Damick","text":"Why take the Bible seriously if you're not going to take it seriously? You know, like, why, like I said, why is this important if we're not actually going to take it seriously? And I think that that's one of the most valuable things about what we're trying to do with this show is to say, okay, look, there is some hard, weird, difficult stuff in there. And we can either just say, ah, well, you know, people in the ancient world thought all kinds of things, you know, or we can say, well, this is in the text. They were all taking it seriously at the time. If I can stop assuming for a second that I'm just smarter and better informed than everyone who lived before me for thousands of years, then maybe there's something there that we can come away with. And of course, I mean, this episode is sort of the par excellence of dealing with the weird and the difficult in the Bible. So, yeah, yeah, I appreciate the conversation about that difficult thing because it is hard. It is hard. You know, yet nevertheless, I think that if we're going to work on purging materialist thinking from our thoughts, then we need to really be willing to go all the way in terms of trusting in the providence of God and trusting that what he says that he intends and he's going to do is true. You know, that when he takes, for instance, a child to himself, that that actually is good for that child and not just say, well, he's pulling a fast one, you know, so. All right, so let's, let's talk about some of these very specific groups then."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5977.92,"end":5994.33,"speaker":"Fr Stephen De Young","text":"The book of Joshua and all of these texts in numbers, in Deuteronomy that present this kind of gigantomachy. And even some of the later historians, historical books, the Old Testament, are presenting this picture of spiritual warfare. That's not an allegorization of what they're presenting, that's what they're presenting."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5994.73,"end":5995.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":5995.01,"end":6009.61,"speaker":"Fr Stephen De Young","text":"It's this war of Yahweh, the God of Israel, against these demonic forces who are enacting their will through these specific groups. And so when we look at these specific groups, we see that kind of reinforced with each group."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6009.69,"end":6010.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6010.49,"end":6040.81,"speaker":"Fr Stephen De Young","text":"So we talked about already a little bit the Amorites, as they're called in the Old Testament, who are the Martu in most other ancient texts. As this group, Martu literally means Westerners. Interesting, because they came from the west to take over Akad and Sumer. But yeah, they aren't west from our."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6040.89,"end":6043.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and that's the bunch that Hammurabi is from."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6044.17,"end":6059.13,"speaker":"Fr Stephen De Young","text":"Yeah, Hammurabi is the most famous one of them. And they, of course, claimed to have access to this wisdom from before the flood that had come through these spiritual beings. And that's what made them powerful."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6059.13,"end":6075.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. By the way, you've said the word gigantomachy several times, and I'm not sure you actually defined it. I mean, if you know a little bit of Greek, you know, basically it means war against giants. That's what it is. It's war against giants. So just wanted to kind of put that out there."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6076.32,"end":6106.58,"speaker":"Fr Stephen De Young","text":"Right. So the most famous Hammurabi would be the most famous Amorite outside the Bible. Probably the most well known one inside the Bible, if any of them are well known, would be Sihon, king of the Amorites, who, along with the guy we're about to talk about, Israel, makes war against him in the Transjordan under Moses before entering into the land of Canaan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6106.58,"end":6106.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6107.62,"end":6115.62,"speaker":"Fr Stephen De Young","text":"And that brings us to the second guy, Og Og, King of Bashan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6116.58,"end":6153.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and Og and Og and Sion, I'm not sure how to pronounce it. Are both. Those defeats are both commemorated in the psalms that we use in the palaelios that we sing. Like this morning we're recording this on November 25th, which is the feast of St. Catherine on our calendar. This morning I sang the Polyelios. And in that is this. We've defeated Og and Sion. You know, it's sung. It's such an important victory that it gets sung about in the Psalms."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6154.2,"end":6253.19,"speaker":"Fr Stephen De Young","text":"Right. It gets mentioned again and again and again in the Old Testament, not just in those two psalms, but it gets mentioned again and again in Joshua. Again and again. I mean, in second Kings, there's still. Right. And sort of. Well, why. Why is this such a major event? Event. Right. We already talked about Ogs bed. Because these are these giant kings, these are these tyrant kings, these demonically powerful kings who were unstoppable, and this image of spiritual and worldly evil. Right, right. And this ragtag group that had just wandered around in the desert for years with sort of makeshift farming implements turned into weapons, defeated them through the power of Yahweh, their God. And so that victory is symbolic of so much. Right. That's why it's repeated again and again and again and again. So, and Og is the last of the Rephaim, which. The Rephaim are mentioned several times in this context. We're going to see. They're mentioned in terms of being giants who were removed from the land in another place. They're also, however, mentioned going forward in the book of Isaiah, when it's talking about the underworld, the spirits of these dead kings, the shades of these dead kings, this is hidden a lot of times in English translations where they translate it as shades or just the dead."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6253.19,"end":6257.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Will the dead arise and praise thee? Right, that's in the six Psalms."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6258.07,"end":6266.79,"speaker":"Fr Stephen De Young","text":"Yeah, it's Psalm 88 or 87 in the Greek numbering, verse 10. That's. How about. Are the Rephaim going to praise God? Well, obviously not."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6267.67,"end":6279,"speaker":"Fr Andrew Stephen Damick","text":"Right, so Rephaim are. I mean, does that term refer to them only after they're dead? Or was it used for Nephilim as their, you know, still on earth?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6279.32,"end":6303.37,"speaker":"Fr Stephen De Young","text":"It's used for them still on earth. So when they come to Bashan or Bashan, Og is the last of the Rephaim, the other ones have already been killed, but he's still a Rephaim while he's alive. Who are sort of these fully demonized kings. They're sort of exhibit A. I see. And so they become these sort of ones even once they die. They become these sort of demonic spirits in the underworld."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6304.01,"end":6312.73,"speaker":"Fr Andrew Stephen Damick","text":"So does the word Rephaim and the word Nephilim, are those essentially synonyms or is there a distinction in how they're used? No, they're not."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6312.81,"end":6315.85,"speaker":"Fr Stephen De Young","text":"The Rephaim is a particular group of kings."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6316.01,"end":6316.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay, all right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6316.97,"end":6326.57,"speaker":"Fr Stephen De Young","text":"A particular group of giant kings. And the term isn't original to the Bible. Oh, the term is what they were called by everybody."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6326.57,"end":6327.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6327.33,"end":6394.72,"speaker":"Fr Stephen De Young","text":"So when you look at Ugarit, Ugarit was a city in what's now Lebanon. That's Rashamra. And their particular dialect of old Canaanite is called Ugaritic. And so the BAAL cycle and other things are. In Ugaritic we have ritual texts. Ugaritic ritual texts that, for example, when their king would die, who they viewed as a God, there were a whole series of sacrifices and rites that were performed to try to appease the spirits of the dead Rephaim of these ancient kings. Because they were going to meet the now departed king on his way to Sheol and to try to appease them so they'd let him pass and not terror. They were sort of these, these princes of the underworld now that they were dead. And their tombs are these stone tombs called Dolmen that are in what was Bashan, what's now the Golan Heights. You can go there and see them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6394.88,"end":6395.36,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6396.08,"end":6461.13,"speaker":"Fr Stephen De Young","text":"The, the, the remains of these, these tombs of these dead kings. And that's part of why Bashan, that whole area there in the north, was considered Harem Haram. Right. It's right next to Mount Hermon. This was sort of a center of this sort of evil. Evil and corruption. And so, yeah, these, these parts show up there. And Isaiah sort of uses. Refers to that same idea that we see in the ugaritic ritual text. He's actually Talking in Isaiah 14 about the devil being cast down into the underworld. And it talks about the Rephaim rising up to meet him and greet him. So, yeah, OG is the last one still alive that Israel needs to deal with, but that again, is why he's such a major figure. And in the Greek Old Testament tradition, a lot of the places where the Hebrew text has Gog, as in like Gog and Magog."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6461.21,"end":6473.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which so excited, like Hal Lindsey and his late great planet Earth back in the 70s or 80s, if I remember correctly. Gog and Magog, the kings of the."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6473.09,"end":6488.57,"speaker":"Fr Stephen De Young","text":"North, the Greek actually has Og. It's talking about like the spirit of Og, this demonic spirit of Og as a dead Rephaim, like coming back as a leader of the forces of evil."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6488.57,"end":6489.25,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6491.41,"end":6498.09,"speaker":"Fr Stephen De Young","text":"So, yeah, OG's a bad dude. And that's why his defeat is such a major thing."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6498.09,"end":6512.39,"speaker":"Fr Andrew Stephen Damick","text":"It's like defeating, you know, it's like in Psych, in Lord of the Rings, defeating Sauron, you know, we just defeated basically a demon guy, you know. Yeah, I mean, it's a major historical event. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6514.07,"end":6522.71,"speaker":"Fr Stephen De Young","text":"But this isn't isolated. Right. These are these two kings who Israel meets on the way into the land. Before that, they'd already had their run in with the Amalekites."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6522.95,"end":6530.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. And if I remember correctly, the Amalekites, aren't they the ones that attack them while they're at Sinai, Is that right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6530.79,"end":6541.29,"speaker":"Fr Stephen De Young","text":"Yes, to attempt to obliterate Israel, sort of before Israel could even fully be formed and come up come of age. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6541.29,"end":6555.01,"speaker":"Fr Andrew Stephen Damick","text":"And so, you know, at Sinai, they're offering sacrifices to Yahweh. Moses is meeting God face to face. He's being given the law, and this giant clan comes up and interferes with this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6555.81,"end":6564.12,"speaker":"Fr Stephen De Young","text":"Right, right. It attacks, attacks Israel. And in the text, the way it's described is that they lay siege to the mountain which had become the mountain of God."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6564.36,"end":6564.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6564.72,"end":6661.87,"speaker":"Fr Stephen De Young","text":"So it's war on heaven. Right. It refers to them trying to lay a hand on the throne of Yahweh. Right. Like they're trying to. God's saying they're attacking me. Right. In addition to you. So again, there's this spiritual warfare element. Right. Well, so why do we say that the, the Amalekites are a giant clan. Well, it's because Amalek, if you want a figure who is very clearly a giant, Amalek is your guy. Right, right. His. His. Now, again, for some reason, people don't spend a lot of time studying the genealogies of Esau. I don't know why, but Genesis 36, verse 12, which is part of that genealogy of Esau, it talks about Esau's grandson who has wives and has children. And then it also says he has this son Amalek. And it says that he has this son Amalek with a concubine. Right. A sexual slave named Timna, who's a horite. The horite. All right. The horites are identified as Nephilim in Deuteronomy. So this is someone from a giant clan who is a concubine, who is in a kind of ritual sexual slavery, and who is described as being literally the sister of Leviathan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6662.19,"end":6662.91,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6663.15,"end":6663.47,"speaker":"Fr Stephen De Young","text":"Where."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6663.47,"end":6666.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so where is that? That she describes as a sister Leviathan?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6667.28,"end":6695.83,"speaker":"Fr Stephen De Young","text":"Right there at Genesis 36, verse 12. Oh, man. She's identified as the sisters of Lotan. That's how it's rendered in English. But Lotan. In English, Lotan is a literal rendering of what we otherwise translate as Leviathan. It ended up being Leviathan in the early English translations for the same reason we got Jehovah. They kind of plugged in consonants around the Hebrew. Or they plugged in vowels around the Hebrew consonants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6695.83,"end":6724.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the identity. I'm just looking in Genesis 36 now, and the identification of Timna as Lotan's sister is verse 22. Yeah, these. These parts that no one reads right. Yeah. You know, so. But. But, yeah, but. But it's a little bit earlier. Yeah. And it's verse 12, where it says that she's the. The one who becomes the concubine of Esau's son, Eliphaz."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6725.7,"end":6731.3,"speaker":"Fr Stephen De Young","text":"Right. Or. Well, the original text doesn't say it's his concubine. It just says she's a concubine."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6731.3,"end":6736.3,"speaker":"Fr Andrew Stephen Damick","text":"A concubine. Oh, oh, oh, right. So this is the king. I'm looking at new King James here."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6736.3,"end":6741.62,"speaker":"Fr Stephen De Young","text":"Right. Potentially a temple prostitute, man. Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6742.02,"end":6743.3,"speaker":"Fr Andrew Stephen Damick","text":"Careful who you sleep with."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6743.86,"end":6769.31,"speaker":"Fr Stephen De Young","text":"Who's a. Who's a horite, who's a horrid. Who's a member of one of these giant clans. So that. And. And we're going to see that giant clan was destroyed by Esau's descendants, the Horites. That was part of their. That was their. Part of the gigantomachy of the war against the giants was defeating the Horites. But Esau's grandson went over and participated with the enemy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6769.71,"end":6770.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6770.51,"end":6773.98,"speaker":"Fr Stephen De Young","text":"And Amalek was produced out of the. That."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6774.7,"end":6805.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. I mean, is there any indication that he. That this union was. And again, parents, this is why we gave you the warning at the beginning. Is there any indication that this union was him? Just Eliphaz, you know, like. Like he just met some girl and they, you know. Or is there any indication that he actually went over and participated in some kind of ritual act when he fornicated with her?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6805.7,"end":6807.7,"speaker":"Fr Stephen De Young","text":"Right. Well, it doesn't describe it in detail."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6808.02,"end":6808.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6808.42,"end":6812.18,"speaker":"Fr Stephen De Young","text":"But we've got these two pieces. She's a horite, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6812.34,"end":6812.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6812.7,"end":6850.89,"speaker":"Fr Stephen De Young","text":"Why would she. Concubine. Right. She's a horite concubine and the sister of Lotan of Leviathan. Now there was. Now there's a place where a Lotan is listed as one of the chiefs of the Horites. But it's unclear if that's saying they worshiped Lotan, if there was a giant chieftain among the Horites named Lotan after Leviathan, this chaos monster. But you get the idea either way, of what the text is indicating, right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6850.89,"end":6867.89,"speaker":"Fr Andrew Stephen Damick","text":"That she's bound up with demonic ritual sexual activity. She's from a people who do that. She's one of the people engaged in that. And this guy goes and lies with her. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6867.97,"end":6882.57,"speaker":"Fr Stephen De Young","text":"And his other children, his legitimate children are all Edomites. They're the line of the. Amalek is this other thing who starts this other tribe and this other clan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6882.65,"end":6888.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yikes. Man, it does get weird when you get down deep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6891.45,"end":6892.81,"speaker":"Fr Stephen De Young","text":"Read those genealogies."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6893.29,"end":6927.67,"speaker":"Fr Andrew Stephen Damick","text":"Although the thing is, the thing is, of course, like, if I were, you know, like, I've read. I've read the whole Bible several times, so I've read this passage. There was never any point, never any point in the past when I read it. And I thought, oh, he's. That, you know, he's. He's. He's. He's fornicating with this demon person. You know, it's just. You have to have. You have to have some guide, you know, to. To know that that's what's going on here. But of course, you know, ancient people reading this, you know, hearing this largely for the first time, they would know all this context."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6928.71,"end":6929.91,"speaker":"Fr Stephen De Young","text":"Right, right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6929.99,"end":6930.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we do."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6930.87,"end":6954.23,"speaker":"Fr Stephen De Young","text":"And. And when. And when we're reading it in English too, not only do the genealogies, a bunch of names I can't pronounce right, sort of run through them, but also all of these ites in the Old Testament start to just all blur together, like remembering that, oh, the Horites are a giant clan. Oh, okay. You know, and connecting a genealogy in Genesis to a passage we're about to talk about in Deuteronomy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6954.23,"end":6956.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6956.15,"end":6973.87,"speaker":"Fr Stephen De Young","text":"Which you. If you get to Deuteronomy, if you don't bail out of reading through the Bible somewhere in Leviticus or numbers, Right. Which a lot of people do, you've probably forgotten Esau's genealogy by the time you get to Deuteronomy. Right. Like, that's not the piece you've held on to in your mind."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6973.87,"end":6985.23,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Okay, so I remember that. So the Amalekites, right. So his tribe eventually does get finally defeated by Israel. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6986.19,"end":6987.23,"speaker":"Fr Stephen De Young","text":"By David."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":6988.04,"end":7000.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, by David. Okay, okay. But there was. Oh, that's. So that's the final defeat. But there was an earlier victory. There's an earlier victory, right, with Joshua at Rephidim. Right. With Moses. That's where Moses holds up his hands."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7001.72,"end":7003.8,"speaker":"Fr Stephen De Young","text":"That's when they attacked Israel at Sinai."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7003.8,"end":7004.16,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7004.16,"end":7007.6,"speaker":"Fr Stephen De Young","text":"That was self defense. Not to get wiped out by the Amalekites."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7007.6,"end":7008.92,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha. Gotcha."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7009.32,"end":7022.43,"speaker":"Fr Stephen De Young","text":"Right. But then, because they had declared war on Yahweh and his people, that's where after that battle, after Israel wins that battle, that's where Yahweh vows, this is. This is it for them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7023.23,"end":7023.75,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7023.75,"end":7054.93,"speaker":"Fr Stephen De Young","text":"Right. They've. They've declared war on me. So there aren't going to be Amalekites. And Saul's big sin that loses him the throne of Israel is not obeying God about the Amalekites. God tells him to go and wipe out the Amalekites as a giant clan. And instead he takes a bunch of their livestock and their treasures for his own treasure. You know, takes their king, takes their king captive to parade him around and brag about how Saul defeated him."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7055.01,"end":7055.73,"speaker":"Fr Andrew Stephen Damick","text":"Don't do it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7056.85,"end":7082.96,"speaker":"Fr Stephen De Young","text":"There's this, there's this amazing moment where, where Yahweh sends. Sends the prophet Samuel to confront Saul about it. Right. And he sort of says, oh, did you do what God said with the Amalekites? It's also like, oh, yeah, yeah. And Samuel says, you know, I'm hearing a lot of sheep and goats bleating off in the distance. You know, could it be, man? Yeah. Which, I mean, that's."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7083.04,"end":7118.49,"speaker":"Fr Andrew Stephen Damick","text":"That's really interesting because again, right. If you have a kind of a Sunday school level knowledge of the whole Saul and David story and all this, you just kind of get this idea that, that Samuel picks Saul At God's command. And then God sort of changes his mind and decides that David is the guy. But it's really about that. His failure to engage in gigantomachy, you know, his failure to do the thing that he was supposed to do. Yeah, I mean. I mean, it's just mind blowing when you realize that major parts of the Old Testament story are about making war on giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7119.45,"end":7122.93,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, like, major parts, Samuel."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7122.93,"end":7131.11,"speaker":"Fr Andrew Stephen Damick","text":"I mean, you know, like this is. Yeah. Welcome, everybody. Yeah. You've just taken your first step into."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7131.11,"end":7141.03,"speaker":"Fr Stephen De Young","text":"A larger world, right? This is described in sort of larger terms or programmatic terms in Deuteronomy, chapter two."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7141.03,"end":7141.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7142.31,"end":7342.19,"speaker":"Fr Stephen De Young","text":"Because the whole book of Deuteronomy, really, almost all of the book of Deuteronomy, parts of it are historical, but most of it is about. As Israel is now coming to prepare to enter the. The land of Canaan, Moses gives sort of his parting, his farewell address, right? His last sermon. And that's why there's so much recapitulation of things from the rest of the Torah, right, Where he's reminding them and putting these things together and theologically tying these things together. And so part of this is as they're approaching, they're traveling through not just lands that belong to these, like Og and Sihon, but also the lands of sort of their cousins, their fellow Abrahamites, right? Like the Edomites, the Ammonites, the Moabites, right? Moab and Ammon were the sons of Lot, right? Abraham's nephew. So they're part of this larger Abrahamite family to whom God had promised this whole area of land, right. It wasn't just to Israel, right? He makes this promise, this huge sweep of land. It's to Abraham and his descendants. And so there are these pieces that he's already given at that point. Israel are kind of late comers to the gigantomachy. The war is already going on. He's already given portions of this promised land to the Edomites, Esau's descendants, and to the Ammonites and the Moabites, Lot's descendants. And when this is described, it describes how when they came to that land, God brought them there, gave them that land. So Israel is not to take a single foot of it. That's literally what it says, not to take the breadth or length of a foot of that land from them because God gave it to them. But they come there, God gives it to them, and they have to drive out the giants, and God drives the giants out before them. So these clans are named who have already been Destroyed. And sort of the headers for them are the Anakim, the sons of Anak, who cover several of these tribes. Or the Rephaim, who we already mentioned, where OG's the last one. The region. OG is the last one is a lot of them are already gone from these other groups descended from Abraham. And so the Moabites have dispossessed the Emim to take Moab Esau has dispossessed the Horites, who that the tribe that concubine was from. Right. So this gives us another part of that picture that Esau's descendants were brought to the land of Edom to take it from the Horites. And his grandson sort of switches sides, right, to the enemy and engages in this. And that's where the Amalekites come from. But the Horites as a whole had been removed. The Zamzumim, which is probably the best tribe name, right, who are said to have been part of the Rephaim, were dispossessed by the Ammonites. And then the really interesting one that people gloss over is it says that the Avim were dispossessed by the Caphtarim. Okay, the people of Kaftor."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7342.5,"end":7343.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so who are they?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7344.66,"end":7348.1,"speaker":"Fr Stephen De Young","text":"Kaftor is the ancient name for the island of Crete."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7348.5,"end":7349.06,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7350.9,"end":7356.82,"speaker":"Fr Stephen De Young","text":"And the people who were from Crete, who this is talking about are the Philistines."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7358.26,"end":7365.78,"speaker":"Fr Andrew Stephen Damick","text":"Wait, but aren't. So are these one of the. The sea peoples from the ancient world who do engage in this massive, massive."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7365.78,"end":7404.97,"speaker":"Fr Stephen De Young","text":"Attack on invasion at the. As the Bronze Age collapsed, human civilization collapsed at the end of the Bronze age in the 11th century BC. So part of that was this invasion, this mass migration from Crete, the end of the Minoan civilization, this, this exodus. And one of those peoples were the Philistines, right. Who? They were actually the Paresti originally, but Egyptians apparently turned their R's into L's so they ended up becoming the Palesti and they tried to invade Egypt. They got repelled and they settled along the coast, Right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7404.97,"end":7426.07,"speaker":"Fr Andrew Stephen Damick","text":"And of course, that's where we get the word Palestine from as well, right? Yeah. So it's interesting to think that there are giant clans living in what is now Palestine and Lebanon. And the ancient Palestinians, ancient Philistines show up from Crete and wipe them out and settle those areas."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7427.91,"end":7454.93,"speaker":"Fr Stephen De Young","text":"Right? And they found these cities, Ashdod, Ashkelon, Gaza, Ghat, which is usually pronounced Gath. And so the thing here, though that's interesting is that we've got a bunch of Abrahamites, right, people descended from Abraham. And then we've got these Greeks who."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7454.93,"end":7456.65,"speaker":"Fr Andrew Stephen Damick","text":"Have showed up and they defeated."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7458.09,"end":7478.26,"speaker":"Fr Stephen De Young","text":"Right. And so the question is, well, wait, what are they doing here? And it actually creates this interesting and weird thread in the Old Testament, the Christian Old Testament, that somehow the Greeks are descended from Abraham."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7479.22,"end":7480.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7481.94,"end":7490.02,"speaker":"Fr Stephen De Young","text":"Which is bizarre. Right. As an idea. And I'm not saying it's like, genetically true."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7490.02,"end":7503.71,"speaker":"Fr Andrew Stephen Damick","text":"Right. But if we think about descent and being someone's son and as you said, imaging the father, these people, when they engage in gigantomachy, are acting like Israel."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7505.15,"end":7561.9,"speaker":"Fr Stephen De Young","text":"Right. And that's reflected. There's this weird little thing again. First Maccabees, that I know not a lot of people have read in depth, but after the Maccabee brothers have successfully staged their revolution and gained independence for Judea from the Seleucid Greek Empire. Right. They are this small little independent kingdom surrounded by much more powerful kingdoms. In fact, they're kind of on the border of the Seleucid Empire and the Ptolemaic empire in Egypt. And so to try to not immediately be overtaken again, they sign these treaties. One of them is with Rome, which ends up going very badly. That's how the Romans got into Judea and annexed it. By the time you get to the New Testament, they were kind of invited. The other one is with Sparta, with the Spartans."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7562.38,"end":7562.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7563.66,"end":7588.13,"speaker":"Fr Stephen De Young","text":"And part of the text of the treaty with Sparta is preserved in First Maccabees. And in it, the Spartans say that Jewish envoys to them, Judean envoys to them had shown them in the Jewish sacred texts that the Spartans were descended from Abraham."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7589.33,"end":7589.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7589.81,"end":7591.17,"speaker":"Fr Stephen De Young","text":"Had a common cause."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7591.33,"end":7591.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7591.85,"end":7592.77,"speaker":"Fr Stephen De Young","text":"With Judea."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7592.77,"end":7593.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm looking at."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7593.53,"end":7594.13,"speaker":"Fr Stephen De Young","text":"That was the."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7594.13,"end":7598.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm looking at that verse now. And it's like that we're related. Where both of our nations descended from Abraham."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7601.25,"end":7608.8,"speaker":"Fr Stephen De Young","text":"Yeah. And the only text in the Torah that you can get that from is this one in Deuteronomy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7609.43,"end":7613.35,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that's amazing."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7614.55,"end":7653.95,"speaker":"Fr Stephen De Young","text":"So. So that's. That's what. At least that tradition, that idea that, hey, we had this common cause once and we could have. So we should have it again many centuries later. Is. Is there later on in the Scriptures. And so once. Once Joshua leads the people into the land. Right. That's his goal. And the book of Joshua expressly says that that's his goal. The end of the book of Joshua says in Joshua 11, 21 and 22. Right. Okay. Conquest is done because we've wiped out all the. Anakin, we've taken care of the giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7654.03,"end":7660.35,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's not. It's not it's done because we've. We've grabbed the piece of real estate that God has set aside for us."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7660.83,"end":7699.57,"speaker":"Fr Stephen De Young","text":"Right. Because they hadn't actually taken all of the real estate that they were supposed to, but they had dispossessed the giant clans. There are some stragglers at the end of the book of Joshua who it says escaped into the Philistine cities. And this is where things go bad with the Philistines. The Philistines become a problem then in the Book of Judges, and then for Saul and David and the early Israelite monarchy, because they flip from being part of the gigantomachy to sort of giving aid and comfort to the enemy by receiving these giants and allowing them to continue their ways."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7700.69,"end":7710.77,"speaker":"Fr Andrew Stephen Damick","text":"So does that mean that the Philistines, then, did they begin to adopt the Nephilim ritual or at least sort of let people in their midst who are doing it?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7711.41,"end":7713.53,"speaker":"Fr Stephen De Young","text":"They let people in their midst who are doing it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7713.53,"end":7714.05,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7714.21,"end":7725.25,"speaker":"Fr Stephen De Young","text":"Because even when you get to Saul and David, they're still commanded to take out these last members of the giant clans. Like, they have to be removed, but God never tells them they have to obliterate the Philistines."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7726.05,"end":7733.65,"speaker":"Fr Andrew Stephen Damick","text":"So. So the Philistines obviously were not. Were not doing that stuff themselves, but, you know."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7733.65,"end":7738.21,"speaker":"Fr Stephen De Young","text":"Right. Not wholesale. Yeah, right, Yeah. I mean, they were pagans. They were worshipping pagan gods."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7738.21,"end":7738.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7738.57,"end":7750.16,"speaker":"Fr Stephen De Young","text":"But there's this. There's still this difference, right. Where what these giant clans are doing is sort of over the line. Right. Their cup of iniquity is full. This can't be allowed to go on anymore."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7750.24,"end":7752.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7752.56,"end":7755.36,"speaker":"Fr Stephen De Young","text":"Because of. Because of its consequences anywhere."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7755.84,"end":7756.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7756.2,"end":7777.68,"speaker":"Fr Stephen De Young","text":"And then it's David who ends up finishing up the gigantomachy. Right. It's David who ends up. Goliath being the most obvious example, Right. Who comes from. Got from one of the cities where they took refuge. He's portrayed as one of these refugees or the descendants of these refugees."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7777.68,"end":7786.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's interesting. He's described as a Philistine, but he's not actually a Philistine Philistine. He's from a sort of immigrant community, so to speak."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7786.76,"end":7788.96,"speaker":"Fr Stephen De Young","text":"Right. He's one of the. He's one of the anakim."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7789.12,"end":7789.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7789.76,"end":7811.41,"speaker":"Fr Stephen De Young","text":"Right. And they're using him as sort of this Special Forces troop. Right. And there's lots of stuff about the way Goliath is described. Like, it's significant that all of his armor and weaponry is described as being made of bronze because bronze technology had been largely lost at that point. We're at the beginning of the Iron Age."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7811.41,"end":7813.73,"speaker":"Fr Andrew Stephen Damick","text":"So he's a kind of ancient warrior."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7814.37,"end":7834.25,"speaker":"Fr Stephen De Young","text":"Right. His armor and weaponry is this throwback to the age when the Amorites were in power. Wow. Right. Sort of the height of Bronze Age civilization. So he's portrayed as the last of one of these ancient men of renown. Right. One of the last of these Nephilim. One of the last of these giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7834.81,"end":7843.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And if I recall, he's described as being. I don't know, the number I grew up with was. He was nine feet tall. I remember hearing stories about that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7844.41,"end":7847.93,"speaker":"Fr Stephen De Young","text":"Numbers are tricky in all ancient texts because they didn't have numerals."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7848.09,"end":7848.73,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7848.73,"end":7856.69,"speaker":"Fr Stephen De Young","text":"So they did numbers with letters. So sometimes it gets confusing. Sometimes you can't tell if something's a number or a word because the consonants just happen to make up a word."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7856.69,"end":7857.13,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7857.7,"end":7865.94,"speaker":"Fr Stephen De Young","text":"Or they could be using. So. And that's why when you compare, like, the Greek Old Testament and the Hebrew Old Testament, the numbers are all weird."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7865.94,"end":7866.5,"speaker":"Fr Andrew Stephen Damick","text":"They don't match."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7866.66,"end":7875.7,"speaker":"Fr Stephen De Young","text":"Don't match because it's a translation issue. But so depending if you go by the Hebrew text, he was nine foot nine."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7875.94,"end":7876.5,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7877.06,"end":7880.18,"speaker":"Fr Stephen De Young","text":"If you go by the Greek text, he was 6 foot 6."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7880.58,"end":7881.14,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7881.7,"end":7888.5,"speaker":"Fr Stephen De Young","text":"But since the average person at that time in Palestine was about 5ft tall, the average adult male."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7888.5,"end":7888.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7889.81,"end":7891.97,"speaker":"Fr Stephen De Young","text":"He's. He's still bigger than everybody else."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7891.97,"end":7898.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, either way, he's either way huge. He's like Shaquille o' Neal compared to even tall people like you and me."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7899.65,"end":7917.37,"speaker":"Fr Stephen De Young","text":"Yeah. So. So, yeah, either way, he's big. But again, that. That his making. The point of his height is to another clue to you, along with the bronze armor and weaponry, all these things to give you this picture of who he is, that he's one of these. He's one of the last of these."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7917.45,"end":7918.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7918.65,"end":7955.54,"speaker":"Fr Stephen De Young","text":"And David. David goes out and defeats him explicitly. This is part of what's going on. Right. Saul did go to war against the Amalekites, but he did it sort of his sin was doing it for his own glory and his own honor, Right. As a battle leader rather than being the agent of God. And that's why David, when he goes to face Goliath, is so explicit about the fact, right? He says, you come to me with your spear and your sword. I come to you in the name of Yahweh. Right, right. That. That it's Yahweh who's going to defeat him. Right. And David's just playing his small part, right, of being the way that. That God does it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7955.54,"end":7968.17,"speaker":"Fr Andrew Stephen Damick","text":"Right. And you get this Sort of. That's a deliberate underdog kind of story. David and Goliath. You know, there's tiny little David and there's big old Goliath. And the only way that David is able to defeat him is because of God's help."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7969.77,"end":7973.13,"speaker":"Fr Stephen De Young","text":"Right. But that's. That's really a misread is my point here."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7973.53,"end":7974.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7974.57,"end":7977.93,"speaker":"Fr Stephen De Young","text":"Because it's not about David the underdog, beating the bigger guy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7978.57,"end":7978.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7979.13,"end":7981.77,"speaker":"Fr Stephen De Young","text":"Yeah. Yahweh is a lot bigger than Goliath."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7982.57,"end":7982.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7983.61,"end":7985.93,"speaker":"Fr Stephen De Young","text":"Goliath is the actual underdog."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7986.33,"end":7989.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he gets squished and David is the instrument."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7991.85,"end":7993.38,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7994.5,"end":7994.98,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":7995.22,"end":8014.82,"speaker":"Fr Stephen De Young","text":"So, yeah, David is the actual mighty man in this scheme. But then he goes on, and it's narrated in Second Samuel how David and his gibboriim, his mighty men, his commanders, take out the rest of basically Goliath's clan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8014.98,"end":8015.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8016.5,"end":8021.93,"speaker":"Fr Stephen De Young","text":"Those last stragglers at his defeat of the Amalekites is narrated, that this is what establishes David as king."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8021.93,"end":8022.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8023.29,"end":8031.93,"speaker":"Fr Stephen De Young","text":"But this is. This is important because remember, David is our paradigm. David is our icon of who the Messiah, who the Christ is going to be."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8031.93,"end":8058.88,"speaker":"Fr Andrew Stephen Damick","text":"Right. Right. So David is the king of Israel. David defeats the giants finally. Completely, totally. And then when Jesus shows up as the. And says he's the son of David and everyone calls him that, he's doing battle directly with spirits, he's doing exorcisms, he's sending them into the abyss."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8058.88,"end":8060.56,"speaker":"Fr Stephen De Young","text":"The same beings. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8060.56,"end":8089.99,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so let's. Let's, let's. I mean, this is a super deep dive episode. So. Yeah. So when we were doing prep, we talked about, for instance, the exorcism of Legion, where the spirits are sent from Legion into the pigs and they go down the embankment and are drowned in the water at their request. They get their request to go into the pigs rather than the abyss, but."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8089.99,"end":8091.23,"speaker":"Fr Stephen De Young","text":"They end up in the abyss anyway."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8091.31,"end":8144.44,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, yeah. Kind of. Jesus sort of pulls a fast one on them because, you know, drowning in the water is understood as a descent into the abyss. Yeah. So I remember. So we talked about this, and I realized that I was unclear on exactly what was happening. So my. The way that I understood, which now I understand is incorrect, the way that I understood the Nephilim ritual and then these spirits that go into the pigs is that you get this demonized person who comes as the fruit of the Nephilim ritual, and they've got a demon hanging around in them with them, and then they die. And then. And then eventually some of those demons end up in Legion and then get Sent into the pigs. But that's. That's a little bit wrong. Right, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8144.44,"end":8148.88,"speaker":"Fr Stephen De Young","text":"That's not. That's not how people at the time of Christ understood it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8148.88,"end":8156.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so. All right, so let's. Let's take the deep dive and talk about exactly what we're looking at with those spirits."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8157.9,"end":8166.38,"speaker":"Fr Stephen De Young","text":"This is an extension of what we were talking about in terms of that Antitheosis. Right. This is that come to fruition."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8167.34,"end":8168.22,"speaker":"Fr Andrew Stephen Damick","text":"Demonosis."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8168.78,"end":8170.3,"speaker":"Fr Stephen De Young","text":"Right. I don't know that there's a good."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8170.3,"end":8171.98,"speaker":"Fr Andrew Stephen Damick","text":"Word for this, but that's the word I've picked."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8172.62,"end":8187.44,"speaker":"Fr Stephen De Young","text":"We have one of these Nephilim, one of these giants, one of these leaders, chiefs, members of this giant clan who's participating in these rituals. That means they have this relationship of fatherhood and sonship with this demonic spirit who is a fallen angelic being."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8187.44,"end":8189.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they're imaging their father."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8190.08,"end":8221.89,"speaker":"Fr Stephen De Young","text":"They're imaging them. They're bringing their works. You know, St. John uses this language in First. In First John, it talks about not just the sonship, starting with Cain and his line in First John, but also the idea that Christ came to destroy the works of the Son Devil, that these works are brought into the world through these people, in this relationship with these beings. But just as in theosis, when we become sons of God, that means our transformation to become like God."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8221.97,"end":8222.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8222.29,"end":8258.38,"speaker":"Fr Stephen De Young","text":"We talk about that as being divinized. We become by grace what Christ is by nature. The same thing happens to such an unrepentant person who has this kind of relationship with the demonic where they become demonized. And so the understanding was that, like the Refa' im who we were talking about, these other. These other Nephilim, they, through their actions and their ritual practices and their worship, are changed and transformed and become like the demons in every way."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8259.27,"end":8269.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although there's one exception as to the way they become like them. Right. Which is that they. They don't have demon bodies. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8269.43,"end":8323.1,"speaker":"Fr Stephen De Young","text":"Right. So when their. Their soul or spirit is separated from their human body, they are an evil spirit. They are a demonic spirit. And so the way it was understood in the first century A.D. and for a couple, at least a few centuries before that, minimally, a few centuries before that, is that these unclean spirits, the spirits we see in the Synoptic gospels who are the subject of Christ's exorcism, are the spirits of these dead Nephilim who have become demonic and demonized. 90% of them are in the abyss according to the book of jubilees. The other 10% are still roaming around. That's why they're unclean spirits. Because they're a mixture. Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8323.98,"end":8335.5,"speaker":"Fr Andrew Stephen Damick","text":"So we could call them demons, but that's actually only relatively true about them because they're not fallen angels. These are fallen humans."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8337.19,"end":8337.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8337.59,"end":8359.91,"speaker":"Fr Andrew Stephen Damick","text":"But they've become so fallen, they are essentially demons. And it's interesting, like, you know, we sometimes in the Orthodox church talk about monastics living the angelic life. And, boy, doesn't that sort of throw all this into stark relief when you think about exactly what that means. You know, they functionally become angels. They don't become angels in kind of."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8359.91,"end":8366.77,"speaker":"Fr Stephen De Young","text":"In terms of species change ontologically. Right, yeah, changing species, as we were talking about with the saints."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8367.25,"end":8369.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8369.01,"end":8376.13,"speaker":"Fr Stephen De Young","text":"And theosis, this is the flip side. This is the dark side of theosis. This is demonization as opposed to divinization."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8376.21,"end":8376.85,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8378.29,"end":8390.7,"speaker":"Fr Stephen De Young","text":"Yeah. And so the same way that the saints in heaven are like the angels and fulfilling this angelic role. Right. And functioning in the role that the. The angelic powers had functioned in."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8390.78,"end":8391.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8391.06,"end":8400.7,"speaker":"Fr Stephen De Young","text":"And have functioned in, these demonic spirits of these fully demonized people are like the demons and are functioning in this demonic role."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8400.94,"end":8452.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, man. Okay, so before we go to break, we had a question that came over the speak pipe. But before we talk about that, I just wanted to underline that this notion of gigantomachy is not just an ancient Near Eastern thing. Right. There are other cultures that talk about wars with giants, pretty much all of them. Yeah. So again, just like the flood is everywhere, everybody's got wars with the ones that I think of off, right off the top of my head is Ragnarok, the Norse. Norse story, you know, where you've got gods versus giants. And now, mind you, obviously, it gets kind of mixed up when you start trying to, you know, make it into an allegory of the real. The real war."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8452.19,"end":8453.35,"speaker":"Fr Stephen De Young","text":"It's not an allegory."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8453.35,"end":8455.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. You can't."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8455.07,"end":8455.31,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8455.31,"end":8479.63,"speaker":"Fr Andrew Stephen Damick","text":"You can't say, for instance, that the. You know, like that Odin and Thor, for instance, on the kind of the quote unquote, good side of that Norse war are actually angelic beings, you know, you know, fighting against giants because, you know, it's, as you said, it's a kind of pagan propaganda, like, yeah, we defeated the giants, actually. No, you were on their side, you know, but yeah, so what."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8479.63,"end":8480.11,"speaker":"Fr Stephen De Young","text":"So what other."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8480.11,"end":8484.31,"speaker":"Fr Andrew Stephen Damick","text":"I mean, what other cultures have this kind of giant story, this giant war story?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8485.19,"end":8618.12,"speaker":"Fr Stephen De Young","text":"Well, in. In Celtic stories, you've got the Fomorians, Okay. Who are sort of these misshapen giants because they're part human. Part ferry. Yep, yep, yep. And they're, they're tyrants, they're cannibalistic. Right. They had to be defeated. Right. In order to take possession of, of the area. And you know, possibly the most famous. I mean, if you look up Gigantomachy. Right, right. On the Internet, you're probably going to find the Greek form of the story, which Gaia, who is the mother of the Titans. We already talked about how the Titans in a lot of ways are parallel to these rebellious angels who were responsible for the Nephilim in the first place who get imprisoned in Tartarus. Right. In fact, St. Peter in second Peter talks about the angels who sinned in the past having been confined to Tartarus. He uses the word Tartarus to make that parallel. So Gay is mad that the Titans have been imprisoned. Right. And so to get revenge for the Titans, she sends the giants out of the earth to go and sort of counterattack. Right. And these, these figures play out a lot in the book of the visions of Daniel and then the visions of Revelation through that the giants, Typhon, who's another sort of monstrous creature that Gaius ends to get revenge for the Titans. A lot of the depictions about the Antichrist that you find in Daniel and Revelation are based on that, are based on this story that it's this figure who's coming to get quote unquote, revenge for the Titans, for these angels who produced the Nephilim and were imprisoned. And that continues into the patristic period. Saint Irenaeus. One of his proposed readings for what 666 represents is the name Titan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8618.36,"end":8621.96,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow, man."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8622.52,"end":8655.96,"speaker":"Fr Stephen De Young","text":"So, yeah, yeah. So these stories are sort of. It's not just that these are versions of the same story in different cultures. It's that the ancient Israelites, the people of the second Temple period and the early Christians saw a connection between those Greek and Roman stories and as they played out in the actual ritual religion and worship of the Greeks and the Romans and the truth which they saw as preserved in their scriptures."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8656.04,"end":8656.52,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8656.92,"end":8657.48,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8657.56,"end":8672.52,"speaker":"Fr Andrew Stephen Damick","text":"All right, so we got a question from Christopher who left us a message and I'm going to play that now and we're going to try to answer it briefly before we go to break. So here's what Christopher had for us. Good morning, this is Christopher from Tucson."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8673.08,"end":8678.04,"speaker":"Fr Stephen De Young","text":"And I was wondering if the depictions of St Christopher as a giant in."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8678.04,"end":8679.89,"speaker":"Fr Andrew Stephen Damick","text":"The west or as a dog headed."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8680.44,"end":8684.92,"speaker":"Fr Stephen De Young","text":"Person in the east had any connection with the giants in the Bible."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8685.4,"end":8745.62,"speaker":"Fr Andrew Stephen Damick","text":"Thank you so much and have a very good day. Okay, so Father Stephen And I talked about this before we were, when we were preparing for the show and both of us kind of concluded we didn't really have much to say about this. But I thought it would be kind of cool to still put it out on this episode, just to kind of get it out there. And the one thing, and I don't know whether, I mean, I can't comment on how accurate it is, but I just recommend that you check out. There's an article by Jonathan Pageau called Understanding the Dog headed icon of St. Christopher. And he actually does talk about the fact that St. Christopher is depicted in Western iconography as a giant. And he relates that to stuff that's in, in the scripture about giants. It's a really interesting article. I don't like I said I can't comment on its accuracy or whatever. I, I do like a lot of the stuff that Jonathan Pageau does. So I just recommend you check that out. Did you want to add anything to that?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8745.62,"end":8749.18,"speaker":"Fr Stephen De Young","text":"Father STEPHEN no, that punt suffices for me."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8749.18,"end":8749.9,"speaker":"Fr Andrew Stephen Damick","text":"All right. All right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8749.9,"end":8752.3,"speaker":"Fr Stephen De Young","text":"Well, let's go to break."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8752.78,"end":8769.11,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-852-372346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8772.63,"end":8851.01,"speaker":"Fr Stephen De Young","text":"What a year this has been for all of us. 2020 has dealt some difficult blows, but in God's grace and providence, it's also reaped many blessings. One of the blessings is a large matching grant from the Renaissance fund, up to $50,000 to be exact. And it's not a soft match, meaning if we don't reach our part of the 50,000, they will give it anyway. Nope. It's what we call a true match. If we fall short of the goal, even by a mile, we'll only get that same amount matched. So it could be 50,000 plus 50,000 for 100,000, or it could be 5,000 plus 5,000 for 10,000. Wouldn't it be a shame to leave that much money on the table? Think of what AFR could do with this additional windfall. Can we count on you to be as generous as you can this week? We only have until December 2nd to meet the entire goal. We need you and ask that you consider being a part of making this work. Go to ancientfaith.com now and look for the large banner for the Giving Tuesday matching gift campaign. Thank you so much."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8851.33,"end":8867.58,"speaker":"Announcer","text":"We're back now with the Lord of Spirits. With Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AFraid Radio."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8872.78,"end":8945.31,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, welcome back for the third half of our show. And just as a reminder, this is a pre recorded episode. So even though the soothing voice of Steve just suggested you should call in, please don't call there, there won't be anybody to take your call. But this is a, like I said, it's a pre recorded episode and we did take some of your questions and comments and stuff. We're incorporating them into this particular episode. All right. Well, now we're going to talk about the way that these biblical texts and traditions and understandings of what's going on in those biblical texts were received in the church in especially the early years. And then look at some of the later stuff as well. And this is probably some of the points where we're going to, you know, have a, there's a little bit of controversy that we're going to actually highlight, I think, a little bit. But it doesn't have to be controversial, I think, and honestly I believe that the, the, the way that we've read it makes sense of the biblical text. And as you're about to discover, actually this is the way that almost all of the earliest church fathers read it as well. Isn't that right?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8946.12,"end":8956.76,"speaker":"Fr Stephen De Young","text":"Absolutely. And we're also going to talk about why those later fathers who, who didn't. Didn't."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":8957.48,"end":9007.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, so we're going to underline the fact that there is a discrepancy between the way that the earlier church fathers read these texts and the way that some later church fathers read these texts. And you know, just as to kind of help frame that, we should say that the fact that some fathers read it one way and other fathers read it another way does not mean that the patristic tradition is bunk. It doesn't mean that. It means that this is one of those areas where they actually do disagree. And so, and it's a real disagreement. You know, you can't, you can't kind of hold both positions at the same time. And it's okay to disagree with some fathers about certain things, not about everything."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9008.66,"end":9012.74,"speaker":"Fr Stephen De Young","text":"When they disagree with each other, you kind of have to. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9012.74,"end":9061.88,"speaker":"Fr Andrew Stephen Damick","text":"I mean. Yeah. What else can you do? Right. So I'll just also say that even if you've listened to this point in this episode and you're like, I do not agree with the way those two priests just read all that stuff, that's not what's happening. Whatever, you know, fine. I mean, that's okay. But at the same time, there is space within the church to have these conversations and not to anathematize each other because we're reading giants differently. I think that the reading that we've taken makes the most sense of the biblical text and that the other one kind of doesn't. So anyways, let's look at kind of a sampling of what's going on in the church Fathers."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9062.36,"end":9093.82,"speaker":"Fr Stephen De Young","text":"Well, there's. Just to set out, even before we do that, there's a methodological thing here. How do we approach an issue like this where there's disagreement in the church Fathers and there's different traditions. Right. And there's different. There's different understandings. How do we. How do we interact with that? Because one very negative thing I've seen this may be especially prominent in Internet orthodoxy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9094.38,"end":9095.42,"speaker":"Fr Andrew Stephen Damick","text":"Interdoxy."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9095.66,"end":9100.22,"speaker":"Fr Stephen De Young","text":"Yeah. Which I was about to say, is it really orthodoxy? But that's not totally fair."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9101.1,"end":9101.5,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9103.66,"end":9111.82,"speaker":"Fr Stephen De Young","text":"Is this idea that, well, okay, if one father says one thing and another father says another thing, or it looks like that, then I just pick the one I like better."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9111.82,"end":9113.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. We're not saying that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9113.82,"end":9177.23,"speaker":"Fr Stephen De Young","text":"Right. If I could find a father who says something I want to believe, I'm okay to hold that as an orthodox Christian because some father did. Right. I think. Or I have a proof text. Right. That would indicate that. Right. So the methodology that we're about to use and that I think is correct. And the way to approach this is with an issue like this, we've got the witness of the Old Testament, we've got the witness of the New Testament, we've got the witness of the fathers. So if you're going to take a position on an issue, like any issue that's like this, where there's disagreement, you need to present how your position takes into account all of the Old Testament data, all of the New Testament data, the patristic data that agrees with you and explains the patristic data that doesn't agree with you."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9177.39,"end":9177.95,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9178.35,"end":9221.36,"speaker":"Fr Stephen De Young","text":"Right. Meaning that explains these fathers who know Christ better than I do, which at whatever position you take on this one, for example, you're going to have to say that some fathers who know Christ far better than I do, know the Scriptures far better than I do, are more spiritual and more holy than I am, somehow got it wrong. And so if your view can't explain that, then your view doesn't work. So if you take the view, some view and some obscure writing of one church father and say, okay, well, this is the one I agree with. You've got to be explained to me how every other church father got it wrong."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9221.76,"end":9222.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9222.96,"end":9238,"speaker":"Fr Stephen De Young","text":"For 2,000 years. That's why that's not a good approach. Right. So in terms of church fathers who talk about what we were just talking about before we even get to the church fathers, let's talk about the New Testament."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9238,"end":9241.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which we haven't really talked much about the New Testament."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9241.93,"end":9265.29,"speaker":"Fr Stephen De Young","text":"Yeah. We already mentioned the fact that even before the New Testament, in the Septuagint proper, the translation by the 70 of the Torah, they translated in Genesis 6:1:4, this as being angels of God, human women."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9265.93,"end":9266.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9266.41,"end":9293.27,"speaker":"Fr Stephen De Young","text":"And giants. So there's that before we even get to. And this is, of course, this is the primary way in which not necessarily all of the apostles were reading the Scriptures, because St. Paul was certainly plenty fluent in Hebrew. But it's the way they interact because the New Testament's in Greek. That's the text that they're quoting and that they're interacting with in the New Testament text."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9293.42,"end":9331.04,"speaker":"Fr Andrew Stephen Damick","text":"Right. So our first witness, our first, you know, sort of canonical, if we want to put it that way, witness to interpreting the Hebrew Old Testament reasonably, we could say, is the Septuagint. Right. That's right. Because it's a translation, but it's. And it interprets that passage from Genesis 6, as we said that when we first started this, as talking about angels having relations in some way and giants being produced as a result of that. Those are the words that are actually used in the Septuagint. Greek. Yep, yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9331.04,"end":9364.21,"speaker":"Fr Stephen De Young","text":"Okay. So when we get into the New Testament in particular, we find the stories we've just been talking about about the angels who revealed things to humanity and then rebelled and were imprisoned and produced the giant offspring as their sons, is referred to several times in what are called the general epistles, first and Second Peter and Jude."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9364.37,"end":9365.01,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9366.21,"end":9384.58,"speaker":"Fr Stephen De Young","text":"So the one in First Peter, a lot of people take in a different way. I don't want to. We could spend two hours just talking about this. But I'll put it to you this way."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9384.58,"end":9385.94,"speaker":"Fr Andrew Stephen Damick","text":"Restrain yourself, father Stephen."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9386.02,"end":9412.37,"speaker":"Fr Stephen De Young","text":"Yeah. First Peter 3, 1920, talks about Christ's proclamation in his descent into Hades to the spirits who were imprisoned there who sinned in the days of Noah. Right, okay. So that reference to in the days of Noah is kind of clear and unavoidable."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9412.45,"end":9413.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9413.49,"end":9455.49,"speaker":"Fr Stephen De Young","text":"And if you want really solid evidence of that, St. Augustine, who was one of the first church fathers to take a view different from the one we're talking about of who the giants were and whether there were fallen angels involved. When he comes to this text, admits he doesn't know what it means, he says, I don't know why it says in the days of Noah, because he wants to read the text as talking about Christ preaching the gospel in terms of giving certain people in Hades a second chance at repentance."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9455.57,"end":9456.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9456.13,"end":9462.85,"speaker":"Fr Stephen De Young","text":"And then he's like, well, I don't know why Noah? Right. Why, why them? Why not anybody else?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9462.85,"end":9467.33,"speaker":"Fr Andrew Stephen Damick","text":"So he's basically admitting that he doesn't have this frame of reference. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9467.33,"end":9478.45,"speaker":"Fr Stephen De Young","text":"He doesn't know what to do because he's rejected, consciously rejected, what we've been explaining. He doesn't know what to do with that reference to spirits that sinned in the days of Noah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9478.45,"end":9478.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9481.16,"end":9526.53,"speaker":"Fr Stephen De Young","text":"It just. He can't fit it in. So second Peter 2, verses 4 through 9, talks about angels who sinned and who are imprisoned in chains of gloomy darkness. That chains of gloomy darkness phrase is essentially a quote from first Enoch talking about the imprisonment of the angels who created the Nephilim. And I would also add. I would also add that if you want to say this isn't talking about that. That this isn't Talking about Genesis 6, you're going to have to show me somewhere else in the Old Testament where angels are said to have sinned. Angels, plural."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9528.05,"end":9562.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's also kind of interesting. I'm looking at some of the translation notes for 2 Peter 2, 4, for. You know, the translation I'm reading, it says, for if God did not spare the angels who sinned, but threw them into hell, locked them up in chains and under darkness. What's interesting is that the. The phrase that gets translated as threw them into hell sometimes is translated as casting them into Tartarus, but it's actually a verb. Tartaro, which I would translate as sort of tartarized, became tartarized, which doesn't mean."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9562.3,"end":9563.98,"speaker":"Fr Stephen De Young","text":"They had tartar sauce based upon it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9563.98,"end":9575.94,"speaker":"Fr Andrew Stephen Damick","text":"But yeah, they became tartarized. So that's this reference to imprisoning these spirits in this place where you put Titans."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9577.06,"end":9591.14,"speaker":"Fr Stephen De Young","text":"Right. And so it's very clear what St. Peter's talking about. Right. You could try and argue he's using it as an analogy or something, but there's no clear other thing that he could be speaking about."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9591.14,"end":9597.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in verse 5, he mentions specifically Noah. There it is. And you know, and then the flood."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9598.38,"end":9655.72,"speaker":"Fr Stephen De Young","text":"Right, right. And you see the same thing. The text of second Peter, the text of St. Jude's epistle are very close. And again, I'm not going to spend hours going into the different ideas of the relationship between the two. But you find the same kind of thing in Jude verses 6 and 7. We're also referring to this event. And just to hammer on it one more time, these speak about angels, plural, sinning. I know there are some folks who disagree with us about what we presented about there not having been this sort of fall of the devil and a whole bunch of angels before the world was created. I won't go into that again. But even if you hypothesize that that's the case, that's not talked about anywhere in the Old Testament."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9656.2,"end":9656.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9657.8,"end":9715.58,"speaker":"Fr Stephen De Young","text":"So then you're saying, well, okay, St. Peter and St. Jude are referring to something that's not in the Old Testament. And so then I'll say, okay, show me that in Jewish literature from the Second Temple period. And it's not there. The only thing that's there in terms of an angelic rebellion, where the rebels are imprisoned, is this tradition that you see recorded in the Book of Enoch that you see alluded to in Genesis chapters four and six. Right. And the origin of the giants. So we've already got a. We've at least shown that the viewer talking about. We went through the Old Testament in some detail. We've now talked about the New Testament. So when you get to, for example, Saint Irenaeus in the. His on the Apostolic Preaching. So on the apostolic preaching, St. Irenaeus is summarizing the preaching of the apostles."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9715.66,"end":9716.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9716.46,"end":9718.94,"speaker":"Fr Stephen De Young","text":"What they taught. Yes. And we've got to read this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9718.94,"end":9787.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we've got a quote here from, from. This is from Chapter 18 of on the Apostolic Preaching. St. Irenaeus. And for a very long while, wickedness extended and spread and reached and laid hold upon the whole race of mankind, until a very small seed of righteousness remained among them and illicit unions took place upon the earth. Since angels were united with the daughters of the race of mankind, and they bore to them sons, who for their exceeding greatness were called giants. And the angels brought as presents to their wives teachings of wickedness. In that they brought them the virtues of roots and herbs, dyeing in colors and cosmetics, the discovery of rare substances, love potions, aversions, amours, concupiscence, constraints of love, spells of bewitchment and all sorcery and idolatry, hateful to God by the entry of which things into the world evil extended and spread, while righteousness was diminished and enfeebled. So pretty clearly St. Irenaeus taking exactly the view that we just described."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9787.75,"end":9791.75,"speaker":"Fr Stephen De Young","text":"Yeah. And he's not just saying he personally holds this view."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9791.75,"end":9792.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9792.31,"end":9798.47,"speaker":"Fr Stephen De Young","text":"He's saying this is what the apostles taught. And he is the spiritual grandson of St. John the Evangelist."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9798.47,"end":9804.65,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yeah. Because his teacher, as he says, was Polycarp, and Polycarp was the disciple of John."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9807.61,"end":9810.45,"speaker":"Fr Stephen De Young","text":"So he was in a position to know, at least to know better than me."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9810.45,"end":9813.61,"speaker":"Fr Andrew Stephen Damick","text":"And this is mid what, mid second century? Early second century."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9814.09,"end":9816.13,"speaker":"Fr Stephen De Young","text":"Mid second century, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9816.13,"end":9820.97,"speaker":"Fr Andrew Stephen Damick","text":"So he's within 60 years of the death of the last apostle."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9821.77,"end":9871.22,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And this isn't isolated Saint Justin martyr in the second century. Same thing. Even into the third century. We see the same thing in the third century. We're primarily talking about Origen in Tertullian. Yes. Who aren't saints. And so that's why I'm not quoting them at length about it. Tertullian actually thought the Book of Enoch was canonical. And Origen did at the beginning of his career and then said, well, things are kind of swinging against it. This interesting thing happened in early church history where in the second and first half of the third centuries, a lot of people weren't sure if St. Jude's Epistle was canonical."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9871.3,"end":9871.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9872.58,"end":9908.84,"speaker":"Fr Stephen De Young","text":"And people may know St. Jude's Epistle actually quotes the Book of Enoch. Right. As prophecy says that Enoch is a prophet and said this. Right. And so people actually argued from the Book of Enoch for the canonicity of St. Jude's Epistle. And then about halfway through the second century, and Origen talks about this because it was happening during his lifetime, that flipped. And by that time, almost everyone had accepted St. Jude's Epistle. And so from there on, people start arguing for the Book of enoch based on St. Jude having quoted it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9909.23,"end":9909.87,"speaker":"Fr Andrew Stephen Damick","text":"That's cool."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9911.31,"end":9911.71,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9911.71,"end":9920.75,"speaker":"Fr Andrew Stephen Damick","text":"And just so people can look up where this is, this is in verse 14 of Jude is where this that he quotes. He begins quoting Enoch. Yep, yep."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9921.07,"end":9933.31,"speaker":"Fr Stephen De Young","text":"Yeah. And these things are referenced other places. So obviously the Book of Enoch does not end up being part of the canon unless you're Ethiopian."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9933.31,"end":9933.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":9935.4,"end":10011.49,"speaker":"Fr Stephen De Young","text":"And the reason for that is that Ethiopian Christianity at its earliest stage. Sometimes when I mentioned the Ethiopian canon, people will say, well, they're non Chalcedonian, so they don't count. Right. But they didn't change the contents of their Bible after the Council of Chalcedon. Right. This is what they all said because the Ethiopian Jews considered it authoritative. Their Old Testament canon is the canon of Ethiopian Jews that they adopted. So they had this continuous line of it. And so that continues, though, in the Church all the way up until in the 9th century. You have George Sankelos, so we're in the Byzantine period. And he describes First Enoch, the book of what we call First Enoch, the Book of Enoch, as being an apostolic apocryphon, meaning apocrypha, meaning hidden. It's hidden in that we don't read it publicly in the Church."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10011.65,"end":10016.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not hidden in the sense of we keep this locked away in a vault because no one's supposed to read this."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10016.29,"end":10075.21,"speaker":"Fr Stephen De Young","text":"Right, right. We don't read it publicly. It's a book to be read in the home, not in the churches. But apostolic, because he believed it preserves part of the apostolic preaching, as St. Irenaeus had said centuries beforehand. And George Sieglos, when he writes his chronicle of world History, talks about the exact same thing that St. Irenaeus talked about with the angels and the humans. So he still holds this position in addition to still seeing the value of the Book of Enoch and its apostolic connection. So we're about to talk about the view that sort of comes to predominance among the Church fathers. But I wanted to make it clear that the view we've been describing, that's the universal view of the first. The first three centuries, almost four centuries of the Church doesn't just go away. It isn't that everyone rejects it. Yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10075.21,"end":10089.69,"speaker":"Fr Andrew Stephen Damick","text":"Well. And so what do we do with this idea that some people have? We say, well, you know, like, there were Achilleasts in the early Church, but eventually the Church kind of, you know, ruled against that. And now we fully, you know, we don't believe in Kiliasm."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10089.69,"end":10090.05,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10090.05,"end":10103.09,"speaker":"Fr Andrew Stephen Damick","text":"So could we say that the Church has rejected the depiction of giants and so forth that's given in the Enochic literature that we've been talking about. Has the Church rejected it and settled on something else?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10104.29,"end":10110.37,"speaker":"Fr Stephen De Young","text":"Right. And that's why it's so important to point out that this view still stays around."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10111.49,"end":10119.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's not like. So there is conciliatory rejection of Chileanism. Right. By virtue of the way that the creeds are written and so forth."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10120.07,"end":10120.39,"speaker":"Fr Stephen De Young","text":"Forth."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10120.55,"end":10123.91,"speaker":"Fr Andrew Stephen Damick","text":"There is no conciliar rejection of this reading of the giant story."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10124.39,"end":10136.63,"speaker":"Fr Stephen De Young","text":"Right, Right. The idea that there's a. That the Orthodox Church has very few dogmas. The idea that one of them is a particular interpretation of Genesis 6:1:4 is kind of silly on the face."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10136.63,"end":10176.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And honestly, I mean, you know, every Pascha. Every Pascha, there's that canon that's. That's sung, it's Actually the Canon of Holy Saturday, but it gets then repeated during the midnight office or the nocturnes of Pascha in which it talks about the Passover and the Exodus and it describes Pharaoh as being this persecuting giant of old. So it's interesting that this language is in our liturgical texts. You know, it's, it's there. Right, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10176.27,"end":10181.27,"speaker":"Fr Stephen De Young","text":"I've seen references to watchers and. Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10181.27,"end":10192.91,"speaker":"Fr Andrew Stephen Damick","text":"Now I have seen. I did see it. I did see a translation, that text, which actually refers to the persecuting Pharaoh of old, which I get why they use that. But it actually. The word is giant. The word is giant. That's, that's what's in there."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10193.23,"end":10234.53,"speaker":"Fr Stephen De Young","text":"You know, there are some, there are some recensions of it that say tyrant, but as we were saying, that's a synonym. Right, yeah, yeah. So the other view that comes to predominance is actually the Rabbinic Jewish view. Yep, that's where it originates. It originates in Rabbinic Judaism because, and I know we've mentioned this on the show before, but there's this huge problem in Western theology caused by the assumption that the quote unquote Jews of any given period of history are identical to the Rabbinic Jews in your local synagogue."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10234.53,"end":10236.45,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10236.45,"end":10248.69,"speaker":"Fr Stephen De Young","text":"And that's just not that Rabbinic Judaism is something that really comes into existence between the 2nd and 5th centuries and is only codified in the 5th and 6th centuries with the Talmud."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10248.69,"end":10249.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10249.57,"end":10265.21,"speaker":"Fr Stephen De Young","text":"And it's a reaction the Talmud, any Talmudic scholar, go ask an Orthodox Jewish Talmudic scholar, they'll tell you that a lot of the Talmud is a reaction to the Christian tradition that had emerged."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10265.29,"end":10393.16,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So the, the particular rabbinic interpretation of this that we're going to talk about briefly now is that the so called sons of God in Genesis 6 are not angels, are not angelic beings, contrary to what the Septuagint says about them, contrary to all these other stuff that we've just been mentioning, but are actually the descendants of Seth, Seth the son of Adam and Eve. And so then the notion of him being a son of God is more metaphorical than reference, than an angelic reference. And then that's what happens is that there's this intermarrying between descendants of Seth and descendants of Cain. And then that's what this is about. So it's not about. And often this interpretation is put forward because there's this idea like, well, how could demons interbreed with human beings? And that essentially just shows ignorance of what the Nephilim Ritual actually involved, which is that there's, you know, from a material point of view, like if you were to sort of videotape the thing. And again, this is why we give this trigger warning for parents. At the beginning, if you were to videotape the ritual, you would see two human beings engaging in fornication. You know, you wouldn't necessarily visibly see a demon involved in this. But you know, saying well, you know, demons can't hybridize with human beings is a misunderstanding of what that ritual actually involves because it just suggests that there's two beings involved. A human woman and you know, a fallen angel. And, and that's because of a reading of Genesis 6 where the, these other details which are not mentioned there are not taken into account. But as we've mentioned, there is all kinds of evidence that this is what was going on. You know, again, that these, they're regarded as being 2/3 divine. Right. That means that there's three beings involved in their conception. So. All right, well, let's talk about that a little bit."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10393.4,"end":10485.91,"speaker":"Fr Stephen De Young","text":"Yeah, so the non Christian Jewish communities, right, ended up rejecting all of the anarchic literature, all of the literature from their own tradition that recorded this part of the tradition. Right. And they did this in the second and third centuries. And we have second and third century church fathers who talk about how the, the, the Jews had rejected, for example, the Book of Enoch because it was too Christian. That's literally how they phrase it. So this is based in a repeat. This is how Christians were taking it pretty much universally, as we just said. And so the Jewish community repudiated that and came up with what's called the Sethite hypothesis. Sometimes in the literature that it's the line of Seth and the line of Cain, this gets adopted by church, the first, very first sort of church. I mean, Julius Africanus is not famous, we'll put it that way. I think he's a church father, but he's the first Christian to sort of adopt this. And then we see it show up in St. Ephrem the Syrian in the east and then St. Augustine in the West. So we're talking about like the very late, very end of the 4th century, very beginning of the 5th century, where this first appears in Christian writings."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10485.99,"end":10486.67,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10486.67,"end":10487.75,"speaker":"Fr Stephen De Young","text":"The Sethite hypothesis."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10488.31,"end":10521.24,"speaker":"Fr Andrew Stephen Damick","text":"And just, just to help people date. So Sextus Julius Africanus, not to be confused with Julius Africanus who was an earlier person. Yeah, yeah. So this is a Christian, right. The earlier one is, was not a Christian. He was born the year 160 and dies in 240. So, you know, he's writing relatively late second century, early third century. Right? Yeah. He's the earliest data point we have for this view. He's a Libyan. He's a Libyan, Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10521.64,"end":10536.6,"speaker":"Fr Stephen De Young","text":"And so when it starts, when you get prominent people, St. Ephraim and St. Augustine, St. Ephraim's at the end of the fourth, and St. Augustine is writing at the beginning of the fifth. And that's when the view kind of goes mainstream."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10538.2,"end":10539.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because of their influence."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10540.49,"end":10572.26,"speaker":"Fr Stephen De Young","text":"Right. And comes to become the predominant view among the church fathers. Now, that said, St. Augustine, as we already mentioned, has certain problems, like he doesn't know what to do with that reference to the days of Noah. He also has this weird ambivalent discussion of the Book of Enoch because he says, well, okay, St. Jude says Enoch is a prophet and he wrote this and it's a quote from the Book of Enoch. So Enoch wrote something."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10573.14,"end":10573.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10574.58,"end":10642.61,"speaker":"Fr Stephen De Young","text":"And at least some of what's in the Book of Enoch must be that. And so he tries to argue that, well, you know, the Book of Enoch then is so old, it comes from before the flood. And you get people like St. Jerome, who's St. Augustine's contemporary, giving protracted arguments about how the Book of Enoch would have survived the flood. Like, well, Noah must have had a copy of the ark, which is copy from there. Right. Which to us seems like extreme special pleading. But for the Fathers, this was. So St. Augustine is saying, this must represent this text we have now must represent Enoch's work. But he says, look, that makes it so old. You know, we can't verify what in this text we have now actually comes from Enoch and what doesn't. And then he makes this circular argument where he says, you know, you can't trust this story about the watchers, about these sinful angels in the Book of Enoch. Right. Because not everything in the Book of Enoch is true and goes back to Enoch. And so you say to him, well, what's an example of something that's not true? And does it go back to Enoch? And he says, well, the watcher's story."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10643.64,"end":10646.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10646.44,"end":10676.81,"speaker":"Fr Stephen De Young","text":"It's untrustworthy because it has stuff like this story in it. So you can't believe this story. Right. It's a circular argument. So he has some problems even getting this view forward. But there are more basic problems with this view. For example, it doesn't make sense of the Old Testament data because, okay, before the Flood, the line of Seth and the line of Cain intermingle somehow. That makes giants."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10677.21,"end":10686.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Who are Impressive enough in some way that when the people of Israel show up to Canaan, that the spies."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10686.41,"end":10687.33,"speaker":"Fr Stephen De Young","text":"But we're not even there yet."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10687.33,"end":10687.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10687.81,"end":10688.85,"speaker":"Fr Stephen De Young","text":"Before the flood, still."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10688.85,"end":10696.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Yeah, but. Yeah, yeah, right, exactly. Before the flood. Yeah, but I mean, the point is that when people see giants in the Old Testament, they're freaked out by them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10697.02,"end":10723.5,"speaker":"Fr Stephen De Young","text":"Right, right. That this has some kind of impressive element. Right. I don't know why marrying your sort of distant cousin from a different child of Adam would do anything like that. Right? Yeah, right. Why would it be? Then you also have, you know, you have the problem after the flood of. Okay, so did the line of Cain and the line of Seth survive the flood independently somehow and then mingle again?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10723.89,"end":10725.25,"speaker":"Fr Andrew Stephen Damick","text":"So you get more giants to make."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10725.49,"end":10736.37,"speaker":"Fr Stephen De Young","text":"The Nephilim after the flood. Yeah, right. Like, well, then how does that work? Right, right. So Old Testament wise, it doesn't make a lot of sense."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10736.45,"end":10755.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Now, I remember reading that there is some passage that. And I think we should spend a moment or two on this because I know you did some research about this. There is some passage in St. John Chrysostom where he takes the Sethite view. Is he actually, Is that actually his view?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10757.74,"end":10761.9,"speaker":"Fr Stephen De Young","text":"Yeah, well, there's. It's hard to know for sure."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10761.98,"end":10763.42,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so why, why is it hard."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10763.42,"end":10769.9,"speaker":"Fr Stephen De Young","text":"To know that if, if he does take that view? Right. He's taking that view around 4:12, 4:13."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10770.06,"end":10772.06,"speaker":"Fr Andrew Stephen Damick","text":"So relatively late, so comparative."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10772.14,"end":10779.75,"speaker":"Fr Stephen De Young","text":"So this is after. This is post Saint Ephraim, post Saint Augustine. Right. So it's reasonable."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10779.83,"end":10781.91,"speaker":"Fr Andrew Stephen Damick","text":"It's reasonable that he would have taken that view."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10782.31,"end":10876.05,"speaker":"Fr Stephen De Young","text":"That he would have taken that view. Right. The place where he really takes that view and spells it out is in a set of homilies where there are a lot of theories, because he's got two sets of homilies on Genesis, essentially, and scholars disagree about how those relate to each other. A lot of people argue that he gave both and try to make one the earlier set and one the later set. So it's sort of a revision, or they'll say one represents notes taken by a different person on the same homilies. The dating in the early 5th century is secure, but there are also a significant number of people, and these people include St. Photius the Great, his notes on the library at Constantinople, who think that what are now considered to be the later homilies weren't St. John Chrysostom, or at least reflect another hand, that someone else came and revised them. So it's very possible St. John Chrysostom held this view. I'm not arguing that he didn't. It's also very possible that we don't know what view he held. And this was sort of expanded upon by a later editor of his homilies. And certainly you go later in the fifth century, sixth century, there are plenty of people who held the Sethite hypothesis who could have done that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10876.05,"end":10888.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, but so it's not a slam dunk to you. So the point being that it's not a slam dunk to use this text from Chrysostom and say, well, that's what Chrysostom's view was and that's it."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10888.27,"end":10897.03,"speaker":"Fr Stephen De Young","text":"Period. And therefore that's right. Yeah, absolutely. Yeah, yeah. Against all the other. That's a methodological problem on top of everything else."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10897.03,"end":10897.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10898.27,"end":10904.03,"speaker":"Fr Stephen De Young","text":"So in addition to this view not working with the Old Testament view doesn't work with the New Testament."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10904.35,"end":10904.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10904.67,"end":10915.56,"speaker":"Fr Stephen De Young","text":"Those passages we just read in first and Second, Peter and Jude, as we already talked about a little. Who are these angels then? Why were they after strange flesh?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10917.88,"end":10928.92,"speaker":"Fr Andrew Stephen Damick","text":"Right. It just kind of. It creates these, you know, sort of dangling bits that then aren't integrated into the rest of the Old Testament narrative that has then commented on in the New Testament."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10929.72,"end":10939.49,"speaker":"Fr Stephen De Young","text":"Right. And so, and so then the last piece as we talked about is. Okay, well, so then either side has to explain why the other group of fathers got it wrong."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10939.49,"end":10953.09,"speaker":"Fr Andrew Stephen Damick","text":"Right. In other words. Yeah, yeah. Like why? Okay, if they did get it wrong, then at least let's understand how they could have possibly gotten it wrong. Because you can't just sort of leave it, leave it there, you know?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10953.17,"end":10959.41,"speaker":"Fr Stephen De Young","text":"Right, yeah, right. We're not going to say any of the fathers didn't know what they were talking about. We're not going to say that any of the fathers were dumb."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10959.73,"end":10963.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right, right. Yeah. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":10963.25,"end":11019.65,"speaker":"Fr Stephen De Young","text":"Yeah. So I will leave it to someone who holds to the Sethite hypothesis to explain to me how all of the earliest church fathers most closely connected to the apostles got it wrong. That's up to them. I don't know how you would do that, but I won't strawman them by making an argument and defeating it. I'll let them put that forward. But I will put forward that it's very clear how the later fathers, beginning at the end of the fourth and beginning of the fifth century and onward, would have not understood what was going on. Because what we find, first of all is the fathers who start moving to the Sethite hypothesis are all approaching the other view as being an angel appears to a human woman, has intercourse with her, she gets pregnant and has a baby that's half angel, half human."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11019.96,"end":11032.28,"speaker":"Fr Andrew Stephen Damick","text":"Right. And they're saying that's not possible because angels don't have bodies that could reproduce with human bodies that could reproduce. So in other words, the thing that they're rejecting is not even what the ancient tradition is."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11033.32,"end":11053.08,"speaker":"Fr Stephen De Young","text":"Right, right, right. They're rejecting, rightly rejecting that if someone proposed that. Yeah, right, right. And we did the child warning. So I'll go ahead and say it. Their issue was not about the sexuality. Their issue was about the reproduction. Because St. Augustine, for example, demonstrably believed in incubi and succubi."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11053.08,"end":11053.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11054.56,"end":11106.73,"speaker":"Fr Stephen De Young","text":"And so that wasn't the part they thought was impossible, it was the reproduction part. But so that's not what the tradition was claiming. So first of all, they're rejecting that now. Why wouldn't they know what the tradition was actually claiming? St. John Cassian, who's one of the people in the 5th century who takes the Sethide hypothesis, gives us a really good clue. St. John Cassian, who's a saint, who's very important to me and who I respect a great deal, but disagree with about this. When he's talking about how, you know, the Sethe hypothesis is right and the other isn't because he's writing in the early 5th century, there's this. Right. The predominant view is the one he's not taking at the time he's writing. He says, well, if this is what happened, why isn't it still happening now?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11108.33,"end":11109.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11109.37,"end":11134.41,"speaker":"Fr Stephen De Young","text":"That's his question. And we've gotten a lot of questions, a lot of when we talk about this, about, well, could this happen now? Right, right. So he's asking the same question, but he's saying, look, this doesn't seem to be happening now. If that's what happened before, why isn't it? And the answer to St. John is, well, yeah, it wasn't happening in the."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11134.41,"end":11136.21,"speaker":"Fr Andrew Stephen Damick","text":"Provence where he lived."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11136.21,"end":11151.01,"speaker":"Fr Stephen De Young","text":"Right. It wasn't happening in Marseille, where his Monastery of St. Victor was. It was happening in Mesoamerica and in China and Japan and in Khmer Empire."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11151.25,"end":11189.1,"speaker":"Fr Andrew Stephen Damick","text":"He didn't see it happening. So that. Yeah, so he was looking at a fundamentally different set of data than what the earliest Church fathers were. And because they're living in different times, and John Cassian lives in a time in which Christianity has conquered a lot of the world, whereas the earliest fathers are living in times like, for instance, Justin Martyr writes these apologies to the Emperor to try to explain Christianity, at least partly to try to convince the emperor not to kill so many Christians."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11189.66,"end":11191.06,"speaker":"Fr Stephen De Young","text":"Yeah, because that's his work."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11191.06,"end":11201.1,"speaker":"Fr Andrew Stephen Damick","text":"He's living in a pagan world in which Christianity is a little minority. So he's surrounded by pagans doing pagan things, including probably the Nephilim ritual."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11201.42,"end":11206.46,"speaker":"Fr Stephen De Young","text":"Right. These rituals, mystery cults, they're offering sacrifices to the emperor as a God king."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11207.73,"end":11207.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11209.57,"end":11266.71,"speaker":"Fr Stephen De Young","text":"This is very real to him. He sees this all happening. Right. And so he has an understanding of what this is talking about. St. John Cassian had never seen an animal sacrifice take place. Right. And so that changes your perspective. Paganism really started dying at the beginning of the second century A.D. or the beginning of the third century. I'm sorry, the beginning of the third century, beginning of the 200th A.D. and that was for two reasons. Number one, Christianity was just clearly ascendant in the Roman Empire and the old pagan rights weren't fulfilling. And so what you see is paganism start trying to Christianize itself, to compete. So you see this in Neoplatonism is just trying to Christianize Platonism or Julian."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11266.71,"end":11270.83,"speaker":"Fr Andrew Stephen Damick","text":"The Apostate, wishing that pagans were basically moral in the way that Christians are moral."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11271.47,"end":11318.11,"speaker":"Fr Stephen De Young","text":"Yeah. In the fourth century, he's the last gasp of trying to turn the clock back. Yeah. But you see this in all these Gnostic sects that arise are just attempts to Christianize mystery religions and different cultic ritual aspects of pagan religion sort of put a Christian veneer on them to try to get that audience. Someone in our Facebook group posted some quotes from Hermes, Tribe of Justice from the Hermetic literature from the third century, from the same period, which is very clearly adopting all of this Christian language and Christian ideas to this kind of quasi Gnostic framework. They're trying to compete. And part of that was by the middle of about the third century, animal sacrifice starts dropping off."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11318.27,"end":11318.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11319.79,"end":11341.92,"speaker":"Fr Stephen De Young","text":"So Saint Constantine, apparently even before converting to Christianity, was not a big fan of animal sacrifice. He just thought it was kind of gross and repugnant, interesting, and sort of sub moral. And so when he became Christian, he instantly sort of did away with it in terms of the military and the imperial part of the religion so that he wouldn't have to do it anymore."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11341.92,"end":11363.36,"speaker":"Fr Andrew Stephen Damick","text":"And, and we should emphasize that it's these rituals that are what make paganism go like this is the engine that drives it. And not just in the sense of like, you know, this is social bonds or whatever. Although it's that too. But, but, but when people stop interacting with demons in the way that is the most effective, then it weakens the demon's influence over them."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11364.72,"end":11411.56,"speaker":"Fr Stephen De Young","text":"Right, Yep. Right. They're not worshiping them anymore. Now they're sort of opining or trying to draw moral lessons that are more along the line of Christian morality than pagan morality from Homer, for example, which is a fundamentally different thing than classical paganism. And so in the fourth century, you know, paganism is fighting its last gasps. You know, St. John Chrysostom, rhetoric teacher, was one of the last. Was literally a member of the last pagan generation in the Roman Empire. And they basically given up hope. They were just kind of sticking to their guns and being contrarians about not wanting to embrace Christianity."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11411.56,"end":11434.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's this parallel development. On the one hand, you have the death of paganism going on, and pretty much in parallel with that, then this rise of misunderstanding where Nephilim come from, and therefore rejecting that misunderstanding that we see reflected in some of the church fathers. Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11434.78,"end":11441.66,"speaker":"Fr Stephen De Young","text":"And they're trying to address it at a metaphysical level of like, how could you have interspecies reproduction."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11442.06,"end":11442.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11442.62,"end":11444.96,"speaker":"Fr Stephen De Young","text":"Rather than in this ritual and religious culture."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11445.43,"end":11454.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Okay. So we. We just wanted to. Before we finish, and I know this has been a mondo long episode, but you love it, all of you listeners."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11454.55,"end":11455.27,"speaker":"Fr Stephen De Young","text":"Super size."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11455.27,"end":11477.02,"speaker":"Fr Andrew Stephen Damick","text":"That's right. This has been the one you've been waiting for. I know, but before we close, I just wanted to take a couple of questions that were sent to us. So this first one is a message that was left for us by Father Photius. So I'm going to go ahead and play this one now. Hi, this is Father Photius Avant from Saint Sava Orthodox Church in Allen, Texas."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11477.02,"end":11500.84,"speaker":"Fr Stephen De Young","text":"And I have a few questions. Are giants recognizable only by their size, or is it more by their violent and terrible deeds? Also, are giants, by virtue of their demonic parentage and. Or intimate influence, beyond the scope of redemption? And finally, are there giants among us today? And if so, how do we. We deal with them?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11501.4,"end":11526.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay, well, we've kind of addressed most of what Father Photius says, but the one, the two maybe that are kind of left dangling a little bit. Are. Can giants repent? And then also, you know, are they potentially around today? What do we do about that? All right, so let's take them and let. Can giants repent? Is that possible? Possible?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11526.82,"end":11532.42,"speaker":"Fr Stephen De Young","text":"Well, we. We talked about how, you know, if you leave the giant clan, you're no longer a member of the giant clan."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11533.14,"end":11533.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11533.86,"end":11534.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11534.26,"end":11536.86,"speaker":"Fr Andrew Stephen Damick","text":"So it's a kind of a citizenship almost if you're."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11536.86,"end":11644.42,"speaker":"Fr Stephen De Young","text":"If you're ritually admitted to another community that's constituted by another ritual. Right. So, so the short answer is yes. If. If there's a giant clan somewhere right now that's doing these rituals, right. Someone who's a person of. That is not, like, irredeemable. Right. They're still alive and they're still human, no matter how far gone, how far down that road they may be. They could be baptized into Christ. They could come and receive the Eucharist. They can be Christian and experience. Experience theosis. Right. In terms of, are there giants today and how should we deal with them? So if we take that seriously, in terms of what we've been talking about, we'd be talking about a human being who's not just like, they're demonically possessed, but a human being who has become demonic, who has become demonized fully. So we'd be talking about. I don't want to be graphic. I've met someone like this in a prison setting, someone who is not even really human anymore, who's committed acts, the kind of things we're talking about involving the killing of children, the torture of, you know, cannibalism. Right. So if we're talking about someone like this, and this is a person who has no interest in anything related to the Gospel. Right. Then as controversial as what I'm about to say may be, this is why civilizations still have the death penalty."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11645.62,"end":11646.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11648.42,"end":11682.29,"speaker":"Fr Stephen De Young","text":"Yeah, right. And when someone like that receives the death penalty, Right. I mean, when. When the Orthodox Church talks about the death penalty, if you read, for example, the social statement of the Russian Church, it is a good thing to not make use of the death penalty in that it can sometimes give a longer opportunity for repentance to someone. And so that makes that element a good thing. But the Orthodox Church has never declared the death penalty as such unjust."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11682.45,"end":11685.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right, right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11685.49,"end":11699.49,"speaker":"Fr Stephen De Young","text":"Because to allow that kind of person to continue with that kind of evil is unjust in and of itself to produce more victims and bring more horror into the world."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11700.45,"end":11789.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay. So we got a question over email from Ian in Charleston, West Virginia. And Ian wrote this. Presupposing the existence of giants based on the literary evidence in the Holy Scripture scriptures, is there likewise physical evidence to further prove their existence beyond the scriptures? I remember in a previous episode that you mentioned the archaeological find of a large metal bed used in pagan rituals that was used by a giant king. But do fossil records, or even more interestingly, DNA evidence exist? Furthermore, do giants constitute a different species from mankind or from a very materialistic point of view, are still human, but are the result of a variant allele to a gene. Like in the case of achondroplasia, I'm going to have to look that up through the interaction of demons. I think Ian works in the medical field, if I remember correctly. Yeah. And we actually got a number of questions that are like this. And I recall that there was in one of our earliest episodes, we actually had someone call in that unfortunately did not get through who wanted to ask about, you know, giant, gigantic fossils being found. So this is kind of related to that as well. I mean, we talked about how giants are not necessarily large, physically large human beings. So that kind of answers some of this. Are they. I mean, do they have a different DNA?"}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11790.79,"end":11797.77,"speaker":"Fr Stephen De Young","text":"Well, let me first say before I answer that briefly, I want to heartily endorse Ian from Charleston, West Virginia. Very good."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11797.77,"end":11798.13,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11798.61,"end":11801.49,"speaker":"Fr Stephen De Young","text":"He is a great guy. So shout out to Ian."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11801.49,"end":11811.89,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah, yeah. And you know, Father Stephen and I both served at that church there in Charleston, West Virginia. Although, Ian, I think you were still a kid when I was there, but it's been a long time since I left, so."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11811.89,"end":11819.06,"speaker":"Fr Stephen De Young","text":"Yeah. But, yeah, I mean, the answer. We wouldn't expect to see a DNA difference."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11819.53,"end":11822.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. Necessarily because it's two human beings involved."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11823.29,"end":11848.5,"speaker":"Fr Stephen De Young","text":"Right. Right. Now, I mean, if we're talking about giant clans and, you know, with any social unit of people who are primarily marrying and reproducing with each other. Right. There would be common genetic factors. But those genetic factors, as we've said, aren't the basis for who's in and who's out of the clan. Right, Right. It's just something that would naturally happen over time."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11848.58,"end":11848.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11849.14,"end":11851.06,"speaker":"Fr Stephen De Young","text":"So to give that as full an answer as possible."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11851.06,"end":11855.46,"speaker":"Fr Andrew Stephen Damick","text":"So if you're looking for fossils, that's kind of looking in the wrong place."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11856.34,"end":11859.14,"speaker":"Fr Stephen De Young","text":"Yeah. You're digging in the wrong place, literally."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11859.7,"end":11870.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, yeah, I would say I don't have an explanation for. For giant fossils other than maybe they had, like, Marfan syndrome or, I don't know, something like that."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11870.27,"end":11879.15,"speaker":"Fr Stephen De Young","text":"But we don't really have fossilized remains from the period we're talking to. Human skeletal remains don't last that long."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":11879.15,"end":12048.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there we go. So I hope that helps Ian and everyone. Thank you very much, everyone who sent in questions and comments. Whether you emailed it to us or sent it in via our Speak pipe recording service, I hope that this has been a. Interesting. I know it's definitely been interesting for me. Discussion. So let's just. Let's give some some closing remarks, and I think I'll. I'll go first. You Know, I, I entered into this discussion of giants. I mean, not today necessarily, but, you know, when I first started trying to understand it, you know, kind of along the lines when Father Stephen says people get excited when I talk about giants because it is kind of exciting. It's really just a fascinating element in scripture, especially when you decide to actually take it seriously. Right. And, but on the other hand, I think that the personal journey that I went through in trying to understand this subject, I went from starting out thinking, okay, here's a really weird obscure thing. Let's figure out what it means so at least I can make an account for it to, you know, understanding gradually that we're actually talking about a major overarching theme of the scriptures that actually had to do with, you know, David and the Lord Jesus Christ. And, you know, it's. It's huge. It's just, it's a, it's a, it's a big, big arc within Scripture. And, and I. That alone should make it something that we try to understand. The other thing that's been very valuable for me was dealing with the fact that Church fathers didn't have the same views on this and understanding what that means and how to account for that and what to do about it, which just as kind of a meta issue, you know, helps us to understand the way to read the Church Father Fathers. You know, we can't treat them as a kind of set of proof texts or a closed canon kind of in and of themselves. And I find that to be very valuable as well, because there are sometimes some orthodox people would treat the Church Fathers the way that sola scriptura Protestants treat the Bible, and that's not the correct way to read the Church Fathers. So I just wanted to say that for me personally, that, you know, this discussion, you know, not just in this episode, but the discussion that I've been having, you know, now for a few years, trying to understand this has been a really valuable one for me of personal growth and understanding the Holy Scriptures and in understanding the rest of orthodox tradition. And I'm just very, very grateful for it on a personal level. Father Stephen."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12049.78,"end":12332.59,"speaker":"Fr Stephen De Young","text":"Yeah, I think, you know, nerdery aside, and I clearly am one because I consider reading ugaritic ritual texts and picking through Esau's genealogy to be fun and exciting ways to spend an afternoon. But beyond that, Nerdery, why is this important at all? Why is this important to the orthodox faith or theology other than just, hey, it's interesting and fun and neat? I think this actually goes to the core. What we've been talking about today goes to the core of what salvation is, and here's how I think that is. My father used to tell me about my grandfather, that at one point, my father was watching the Nuremberg trials on television, which were the trials of Nazi war criminals, so sort of the most demonically evil humans, you know, of our. Of our era. And my father asked my grandfather what he thought about what had happened and. And these trials. And my grandfather's response was, there but for the grace of God go I. And usually when we say that, we say that about some misfortune. Someone has suffered, someone has ended up homeless, someone has ended up bankrupt, someone has died at a young age. And we say, oh, there for the grace of God go I. It's God's grace that I have the things I have, and that's not untrue. But my grandfather was saying that about becoming a Nazi war criminal. He was saying that about becoming this sort of immoral monster who would murder other people en masse and do these other things. And this is how the scriptures present the demonic and our sin as participation in the demonic. After Adam and Eve have disobeyed, God says it's not good that man should live forever. Because if we had, if we'd lived forever in that state, we would have been just like the demons, immortal and immoral, immortal and evil. And so God gives us this life in this world and our mortality and our repentance to prevent us from suffering that fate. A lot of times our Western Christian friends present salvation as well. God has these laws, we've broken those laws. So he's angry at us, or he's compelled by his attribute of justice. He has to punish those violations of the law. And so Christ comes to save us from that. So God has to save us from himself or save us from one of his attributes, save us from his own justice. That's not what the scriptures say. The scriptures say that Christ came to save us from our sins because our sins are destroying us. Our sins are turning us into these demonic monsters if we keep going down that path. So the truth we have here, when we look at these, these giants who are the far end of where that road leads, who represent someone, not become like God, but become like the demons, dehumanized and inhuman. We see where the path of sin leads, and it shows us that in reality Christ came to save us from ourselves. And it gives us a clarity of exactly what that means. So I think this is important beyond all the history and the tying things together in the Old Testament and understanding some of the hymns of the church. That's the core. That's the core that despite our sin and wickedness, which is deliberate, despite our throwing in our lot with these demonic spirits who rebel against and hate God, Christ still loved us enough to come and die and rescue us, redeem us and buy us back so that we could become sons of God. As we've talked about in previous episodes, this shows us the other side. We talked about past episodes. What we're saved to, what we're saved for. This is what we're saved from."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12334.03,"end":12362.26,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Thank you for listening. If you didn't get a chance chance to call in during one of our live broadcasts, we'd still love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. Or you can leave a message for us at our Speak Pipe page. We read everything, listen to everything, but can't respond to everything. I'm sorry about that, but we do save what you send for possible use."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12362.26,"end":12379.95,"speaker":"Fr Stephen De Young","text":"In future episodes and join us for our live broadcast podcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And don't forget to like our Lord of Spirits Podcast Facebook page. While you're at it, join our Facebook discussion group, leave a recommendation and invite all your friends."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12380.03,"end":12388.11,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts then and that raises the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12388.27,"end":12395.56,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to ancient faith.com and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12395.56,"end":12397.64,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and God bless you."}
{"episode_id":"LOS - #008 - 2020-11-26 - A Land of Giants","start":12399.56,"end":12436.77,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
