{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":0.64,"end":65.21,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits the modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":66.65,"end":103.91,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, Manticore manglers. Christ is risen. He truly is risen. You are listening to the Lord of Spirits podcast. My co Host, the Very Reverend almost double Dr. Stephen DeYoung is with me from Lafayette, Louisiana. And I'm Father Andrew Stephen Damick, Almost Double Master in Emmaus, Pennsylvania. And we are live. And if you are listening to us live, you can call us at 855-237-2346 and speak with us. And we're going to get to your calls in the second half of the show. And our very own most beloved Matryzka Trudy will be taking your calls and."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":103.91,"end":109.75,"speaker":"Fr Stephen De Young","text":"We are both checking in safe from Kendrick Lamar diss tracks. Dude's a savage."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":112.47,"end":112.83,"speaker":"Fr Andrew Stephen Damick","text":"So far."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":112.83,"end":115.77,"speaker":"Fr Stephen De Young","text":"He's left us alone so far."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":118.01,"end":163.8,"speaker":"Fr Andrew Stephen Damick","text":"So last time we talked about the testaments of the twelve patriarchs, beginning our series on apocryphal literature from the period of Second Temple Judaism. Tonight we're going to be talking about the Book of Jubilees, which is probably my favorite text of this sort. I think it's the most accessible of all of these books, requiring the least background knowledge to get what's going on in the text. Unlike books such as First Enoch, which we'll talk about that at some point on this podcast. If you know Genesis and at least the beginning of Exodus, then you have the framework that you need for this text for Jubilees. But nonetheless, it's still kind of a bit different among all the apocrypha related to the Old Testament. So why is that? Why is this one different from the."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":163.8,"end":166.68,"speaker":"Fr Stephen De Young","text":"Rest of those different title?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":167.41,"end":168.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, there you go."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":168.57,"end":177.09,"speaker":"Fr Stephen De Young","text":"This one's this one's called the Book of Jubilees. Other ones are called other stuff. You know, different titles. Verstean Ecker."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":177.65,"end":184.29,"speaker":"Fr Andrew Stephen Damick","text":"I was trying to remember when Jubilee was first introduced in the X Men. And my. My memory is failing me now, but I feel like it was in the 1950s."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":184.37,"end":198.5,"speaker":"Fr Stephen De Young","text":"So that would have been. It's either 1989 or 1990. It was actually in an off issue. So when the X Men were in Australia, it was the Australian team."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":201.06,"end":201.38,"speaker":"Fr Andrew Stephen Damick","text":"After."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":201.38,"end":213.7,"speaker":"Fr Stephen De Young","text":"The fall of the Mutants. And there were four female members and four male members. And the four female members went to a mall in Australia and they ran into Jubilee."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":214.02,"end":217.54,"speaker":"Fr Andrew Stephen Damick","text":"May 1989. Uncanny X Men 244."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":218.34,"end":241.44,"speaker":"Fr Stephen De Young","text":"I think it was about 1989. And yeah, 244. And then she ended up kind of hanging around. People didn't realize she was hanging around in what had been the Reavers base in the Australian outback. And so then when Wolverine nearly got killed by the reavers in issue 251, she came and rescued him and then sort of became his sidekick for a while."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":242.56,"end":249.52,"speaker":"Fr Andrew Stephen Damick","text":"That I remember. Man, that was a long time ago. We were just starting high school. As I recall."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":249.76,"end":256.22,"speaker":"Fr Stephen De Young","text":"That was like right at the transition from Mark Silvestri Pens canceling it to Jim Lee, which is before Jim Lee got really big."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":256.54,"end":257.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":258.78,"end":264.38,"speaker":"Fr Stephen De Young","text":"And in the middle of Chris Claremont's like 17 year run writing on Kenny X Men."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":264.54,"end":268.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. And so tonight we're gonna be talking about a second temple Jewish text dedicated."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":268.62,"end":270.14,"speaker":"Fr Stephen De Young","text":"That is not related to that at all."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":272.06,"end":272.78,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":273.66,"end":274.46,"speaker":"Fr Stephen De Young","text":"In no way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":274.78,"end":275.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":276.06,"end":279.58,"speaker":"Fr Stephen De Young","text":"Like, her name just comes from the fact that her given name is Jubilation Lee."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":280.16,"end":282.8,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. It's just a nickname. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":282.8,"end":284.4,"speaker":"Fr Stephen De Young","text":"And so it's like shortened."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":285.2,"end":290,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but we couldn't. We couldn't not reference her at some point in this episode. So."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":290.16,"end":292.24,"speaker":"Fr Stephen De Young","text":"Yeah, so might as well get it over with."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":292.32,"end":300.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, all right. So why else is the Book of Jubilees different from the other Second Temple Jewish literature?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":300.68,"end":377.68,"speaker":"Fr Stephen De Young","text":"Oh, aside from the title. Yes, that would be. The contents are different. Oh, anyway, yeah, no more. What we were getting at in terms of. I mean, that's how they're all different from each other. But how the. So the uniqueness is sort of the legacy and the history that the text of the Book of Jubilees has had. So last time we were talking about the Testaments of the Twelve Patriarchs. And the Testaments of the Twelve Patriarchs is kind of typical for a lot of these that we're going to be talking about in that the Text was preserved among Christians and not among rabbinic Jewish groups. So like we talked about last time, testaments of twelve patriarchs, we have from basically two places, the Dead Sea Scrolls, which is of course a pre Christian Jewish community, and then Christian monasteries. Right. And the monasteries are where it was preserved. Because a number of these texts, and the reason for that is that many, if not most of these texts."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":380.24,"end":380.52,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":380.52,"end":406.41,"speaker":"Fr Stephen De Young","text":"Were made use of by the early Christians or come from Jewish communities that ended up developing into Christian communities were, if they had a lot of currency in other Jewish groups, and especially in Pharisaic Judaism, they tended to be then rejected because they were seen as being Christian."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":406.73,"end":407.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":407.17,"end":428.5,"speaker":"Fr Stephen De Young","text":"Christians were pointing to them and, and using them to show the antiquity of their own beliefs. And so, because when you get to the point where rabbinic Jewish communities are declaring Christian communities heretical, they're also going to declare the communities that produce those texts the Christians were using heretical."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":428.9,"end":463.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, this is not some weird crazy thing, right? If you remember what first century Judaism is like, it's not this single religious group that believes exactly one list of things and has exactly one list of text. There's a variety there. There's, you know, as we've said before, Judaisms. Right. So just as Christianity kind of took one track and said, okay, no, this, this viewpoint, this set of interpretations is the true Judaism, so to speak, Rabbinic Judaism took, you know, another, another turn and ruled out, you know, various other things."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":464.22,"end":488.55,"speaker":"Fr Stephen De Young","text":"Right. And then because of the political realities of Rabbinic Judaism and Christianity developing in parallel, there was more of an onus for one side to condemn the other and fight about it than there was in the diverse pre Christian Judaism where sort of just different Jews in different parts of the world were doing their thing in their own communities."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":488.71,"end":489.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":489.91,"end":522.03,"speaker":"Fr Stephen De Young","text":"Nobody was super worried about it, but there were any number of other political realities, especially those caused by the Roman Empire, that caused it to be a critical issue for the two groups to want to distinguish themselves from each other. But so that's sort of the normal thing. That's what you expect. That's what you're going to find with 1st Enoch, 2nd Enoch, any number of other texts that we're going to end up talking about on the show. But that's not what you actually find with the Book of Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":522.27,"end":522.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":524.74,"end":569.66,"speaker":"Fr Stephen De Young","text":"And so first of all, you find the Book of Jubilees being used across a wise swath of Jewish groups in different parts of the world already in the second Temple period, in the pre Christian period. So it's not just a question of. Even though technically, because of certain things in it, Jubilees might be considered part of the Anakic literature. The Book of First Enoch, for example, is intensely popular among certain groups, certain sects, certain communities in Second Temple Judaism and either unknown or rejected across a swath of other communities."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":569.9,"end":570.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":572.78,"end":600.38,"speaker":"Fr Stephen De Young","text":"So the Pharisees, for example, in some cases. The reason I want to specify unknown or rejected is that it's not the case that, for example, the Pharisees. And it's really out of the Pharisees that Rabbinic Judaism comes, Right. It's not that they rejected all of these books or that they had previously accepted all these books and then later rejected them. A lot of them they just didn't use. They didn't have any tradition of using them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":600.46,"end":602.14,"speaker":"Fr Andrew Stephen Damick","text":"Right. They just were never in there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":602.46,"end":605.49,"speaker":"Fr Stephen De Young","text":"Yeah, they were never in. They didn't get taken out. They were never in."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":605.73,"end":606.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":607.73,"end":619.89,"speaker":"Fr Stephen De Young","text":"The Rabbinic Jewish Old Testament canon is basically, other than a couple of books on the edges, is basically the Pharisaic canon, what the Pharisees always considered to be authoritative, for example."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":619.97,"end":620.37,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":623.25,"end":627.33,"speaker":"Fr Stephen De Young","text":"But even though they never seem to have considered canonical the same way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":629.66,"end":629.78,"speaker":"Maureen","text":"The."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":629.78,"end":669.49,"speaker":"Fr Stephen De Young","text":"Book of Jubilees was used or referred to among the Pharisees. And sort of exhibit A of that is Josephus in his Antiquities, when he's going through the history, right. He's writing a work of history, history of the Jewish people for a Roman audience. And so when he's going through the events in the Book of Genesis, he's very clearly working from the Book of Jubilees on any number of counts. Right. He's got all kinds of content in there that's clearly coming from the Book of Jubilees and not Genesis itself. And he's a Pharisee."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":670.29,"end":672.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. And."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":675.33,"end":747.01,"speaker":"Fr Stephen De Young","text":"We also, as I mentioned, you could consider, because the contents to be anarchic literature, we also find it with other anarchic literature in other Jewish communities. So it crossed over between these groups. But that Pharisaic relationship with the text where it's not canonical, but it's kind of the way we've talked about Christian apocrypha functioning. Right. It's a book that's worth being read but isn't read publicly, that has been maintained in Rabbinic Judaism. That has been maintained in Rabbinic Judaism. If you go to any of the. There are online websites that are sort of the Jewish equivalent of Bible Hub or Bible Gateway or Blue Letter Bible for Christians, but there are Jewish versions of that that have the texts of the Hebrew Bible and different Rabbinic Commentaries and that kind of thing, all cross referenced and available there. If you go there, sometimes you have to dig around a little, but if you go to any of those, you will eventually find the Book of Jubilees on there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":747.88,"end":748.28,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":749.4,"end":769.8,"speaker":"Fr Stephen De Young","text":"It'll be there somewhere. Does that mean the average Jewish person you meet, even if they attend an Orthodox synagogue, will know all about the Book of Jubilees? No. Right, right. Just like, you know, we talked last time about the Testament of the 12 Patriarchs and how it's on Mount Athos and all this. But if you ask the average Orthodox person about it, they won't know much about it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":770.04,"end":771.08,"speaker":"Fr Andrew Stephen Damick","text":"I've heard of it. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":772.2,"end":808.92,"speaker":"Fr Stephen De Young","text":"So that's what I mean also when I say it functions in kind of the same way. Historically, it has functioned that way. In modern times, maybe it's fallen into a lack of knowledge. And the comments you will find on those websites or if you ask, if you talk to somebody, a Jewish person who knows, sort of knows their stuff, they will say that the Book of Jubilees is not canonical, but it contains important historical information or it's historically accurate. Now, later on tonight, when we talk about some of the contents, that's going."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":808.92,"end":813.08,"speaker":"Fr Andrew Stephen Damick","text":"To make you wonder because some fun stuff in there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":813.08,"end":817.88,"speaker":"Fr Stephen De Young","text":"There's a lot of stuff in there that is not accepted by Orthodox Judaism today."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":818.44,"end":818.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":820.44,"end":826.2,"speaker":"Fr Stephen De Young","text":"In the contents. But that's probably why they preface it with the not canonical part."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":826.6,"end":827,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":829.49,"end":876.61,"speaker":"Fr Stephen De Young","text":"Because there are parts that they accepted parts, maybe not so much, but that's pretty unique. There aren't any other, to my knowledge, that I've been able to find any other Second Temple Jewish texts of these kind of texts that are still current in Rabbinic Judaism. In the same way, there are elements of lots of things. There are elements of early Midrash itself that were incorporated into the Talmud and then through the Talmud, still have currency in Rabbinic Judaism. But there's not a text like this still in its original Second Temple form that still functions this way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":876.93,"end":878.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":879.98,"end":942.97,"speaker":"Fr Stephen De Young","text":"In, in Rabbinic Judaism. So that's unique. Right. And so that also means that at the point where we have these two communities that are slowly separating, getting more and more separate, more and more opposition even is taking place. The Rabbinic Jewish communities and Christian communities that are separating out of Second Temple Judaism, that the Book of Jubilees is being used by both the Book of Jubilees, even though. Right. Not given canonical public reading status for the most part in either of them, still holds some currency, is still functioning as apocrypha, is still functioning as this book worth reading in Both of those sets of communities, which, again, is really unique for any of these texts."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":942.97,"end":959.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. And kind of interesting. And like, I've thought about this since we. Since you and I talked about this, and I thought, like, well, why? What is it about this book? I don't know. I mean, we could speculate, but I don't know that there's a clear answer to that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":959.74,"end":978.46,"speaker":"Fr Stephen De Young","text":"Yeah, I think we're going to get into that a little here, or at least I think some of the things we're going to talk about here in this first half, if you put a number of them together, I think they help point to why, but some of them also point away from it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":978.86,"end":980.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, sure."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":980.06,"end":988.87,"speaker":"Fr Stephen De Young","text":"So, as I mentioned, technically speaking, the book of Jubilees would be classified with Anakin literature."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":989.83,"end":990.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":992.63,"end":1004.71,"speaker":"Fr Stephen De Young","text":"While it had this relationship with Phariseeism that's unique, it also was. Is very prominent in any community where the Anakin liturgy is prominent."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1004.87,"end":1007.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So like Qumran, the Dead Sea Scrolls, people."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1007.47,"end":1089.99,"speaker":"Fr Stephen De Young","text":"Yeah. And it's the reason we say it's part of the Adak literature is not just sort of that association. Right. Because like, yeah, Isaiah is in the Dead Sea Scrolls too. Right. That's not an archic literature. It's a couple of things. First is that it's a text that's in the apocalyptic genre. And it's apocalyptic. It's an apocalypse in the sense that we've talked about before on the show. Right. We have apocalypse in our head, meaning the end of the world, which is actually completely wrong. Apocalypses means revelation, something being revealed. And as we've talked about before, apocalyptic literature presents a situation, usually some kind of heavenly journey. Someone enters into the heavenly realm. And based on having entered into the heavenly realm, they have a new perspective on the world, on its history. Yes. On certain future events, but on sort of the whole sweep of human history, what's going on in the world. And that unique perspective allows them to flesh out in particular what is going on spiritually behind various events."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1090.15,"end":1094.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of the heaven's eye view. Right. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1095.75,"end":1120.72,"speaker":"Fr Stephen De Young","text":"So there are things going on that we can all see and experience. Right. But then there's also spiritual realities behind that that may not always be as apparent to us, especially when we're going through whatever the situation is. The person who has sort of exited time as we're experiencing it and sees it for this other perspective can then fill in the rest of that vision for us."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1120.8,"end":1121.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1121.28,"end":1209.3,"speaker":"Fr Stephen De Young","text":"And so this is very much what happens in the book of Jubilees. It's just mostly framed as history. Right. So the central figure is Moses in the book of Jubilees and he is seeing history up to his time. So sort of Genesis 1:1 through Moses being up on Mount Sinai, and he's seeing that from that heavenly perspective. Now, that said, although it's a vision of the past history, another part of what happens in apocalyptic literature is that apocalyptic literature provided a way to speak about the present in a kind of coded way. So in this case, you're speaking about the past. Right. And we'll see this in, in the Book of Enoch and other anarchic literature, you're talking about the past. You're talking about like the days of Noah or you're talking about the days of the patriarchs, but you're really talking about the present. Yeah, you're talking about. Because you're making sort of direct comparison, direct, sometimes not subtle comparisons between things that happened in the past and the spiritual reality behind them and things that are going on now and the spiritual reality behind them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1209.94,"end":1210.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1210.34,"end":1225.22,"speaker":"Fr Stephen De Young","text":"And really that's the intent of the communication. Right. This is important when you're reading, say The Apocalypse of St. John, right, the book of Revelation in the Bible, that St. John is really writing about things that were going on then."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1226.99,"end":1227.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1227.39,"end":1313.78,"speaker":"Fr Stephen De Young","text":"People then let the reader understand, as he keeps saying, but by talking about these spiritual realities in general or in terms of things that happened in the past, like the birth of Christ, that was in the past from his perspective. But then through that talk about now, through this comparison, and we'll see some more examples of that as we go on. And then especially sort of blatantly in your face obvious in the book of Jubilees in terms of it being Anakin literature is almost constant apologetics for the Anakin calendar. When we eventually talk about the Book of Enoch, we'll go into some detail on the Enoch it calendar because there's a big section of the Book of Enoch that is just laying out that calendar. But the Unaki Calendar was a 364 day calendar that had four sets of three 30 day months with a sort of interstitial day between them, right? So you have four 90 day periods, three months each, that give you 360 days. And then you had four more days that were each one day was stuck in between each group of three months, each group of 90 days."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1314.34,"end":1317.98,"speaker":"Fr Andrew Stephen Damick","text":"It's like the Shire calendar and what."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1317.98,"end":1348.43,"speaker":"Fr Stephen De Young","text":"The Adaka calendar did for you, they considered it to be mathematically perfect because, for example, all the Jewish feast days fell on not only the same date, but the same day of the week every year. And so everything sort of lined up as far as they were concerned. That meant it was mathematically perfect. That meant it was God's calendar. Whereas the regular Jewish calendar that the Pharisees used, for example, you have to add a whole month every few years."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1348.51,"end":1349.95,"speaker":"Fr Andrew Stephen Damick","text":"To get it back. Each month?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1350.11,"end":1399.43,"speaker":"Fr Stephen De Young","text":"Yeah, because it's a lunar calendar. Right. So you have to add like huge chunks of days. They're like, well, look, see, obviously that's a bogus calendar. That's a man made calendar. Because it's not perfect. It's not mathematically perfect. If it came from God, it would be perfect. It wasn't in use long enough, as far as we could tell, for anyone to notice that it wasn't perfect either. But it was only a day and a quarter and a couple of hours off. So it would have taken longer to notice. But so that in these communities, again, we tend to treat these texts as sort of these free floating things, but they weren't, they were deeply connected to the lives of communities."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1399.91,"end":1400.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1402.23,"end":1421.08,"speaker":"Fr Stephen De Young","text":"And so this calendar issue, this calendar thing was really the central issue for most Enochic communities like Qumran. They went out in the desert and left the temple in Jerusalem. And sighting was the best. Because of this calendar issue."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1421.4,"end":1428.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because this is about how you live your life day to day. I mean, it shapes, shapes your actual real life."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1429,"end":1464.54,"speaker":"Fr Stephen De Young","text":"Right. So this is what it was really about. It was about the way the community's life and the rhythms of the community's life and the patterns of the community's life. And these texts were embraced because these texts laid out, explained, argued for, defended that way of life right here, signified by the calendar. This is again why it's so interesting that in Pharisaic and Rabbinic Judaism, the book of Jubilees had any currency."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1464.86,"end":1465.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1465.22,"end":1502.25,"speaker":"Fr Stephen De Young","text":"Because it so blatantly argues for a calendar that they did not use. And we'll see some actual examples of that as we go forward in terms of understanding the text. Right. So the sort of shape of the text of the book of Jubilees is very different than like the Testament of the 12 Patriarchs that we read last time or a lot of them that we're going to read in the future. Like the Ascension of Isaiah or the book of Enoch."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1502.41,"end":1508.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, probably the biggest, most obvious difference is that Jubilees is basically just narrative."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1508.81,"end":1509.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1509.69,"end":1511.21,"speaker":"Fr Andrew Stephen Damick","text":"Just simply telling a story."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1512.09,"end":1524.01,"speaker":"Fr Stephen De Young","text":"Right, right. And when you read, when we talk about the Testament of the twelve Patriarchs. Right. This is an incident that's not recorded in The Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1524.97,"end":1525.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1525.69,"end":1536.97,"speaker":"Fr Stephen De Young","text":"The deaths of the twelve sons of Jago are not recorded in the Bible. Whatever their last words were is not recorded. Right. So this is completely composed. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1536.97,"end":1537.73,"speaker":"Fr Andrew Stephen Damick","text":"This is just."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1538.45,"end":1571.1,"speaker":"Fr Stephen De Young","text":"I'm going to write this thing and I'm going to communicate certain things through the mouth of this biblical character. And we saw that that had reference to if there was much information about them in the Bible that was sort of incorporated or used as a jumping off point. But really this was a whole new story. Or the Ascension of Isaiah. Talking about Isaiah's martyrdom. That's not recorded in the Old Testament at all. Yeah, right. So this is just a sort of new. Even though it's a narrative, it's like a new narrative."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1571.18,"end":1571.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1571.5,"end":1572.06,"speaker":"Fr Stephen De Young","text":"It's a creative."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1572.06,"end":1589.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. Whereas Jubilees. Jubilees basically takes Genesis and a little bit of the beginning of Exodus and tells the same story with a lot of the same details, honestly. Yeah. But kind of expands on certain parts and it's commenting on it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1590.2,"end":1590.52,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1590.52,"end":1591,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1591.4,"end":1647.96,"speaker":"Fr Stephen De Young","text":"Right. And this is a mode of commenting on the text that was very common in Second Temple and later Rabbinic Judaism. So this is one of the things that might explain why this is a text that maybe had a little more currency in Rabbinic Judaism in that there are texts sort of like this or formatted like this within Rabbinic Judaism. So, for example, you've got the Targumim, the Targums, right. That we've talked about at various points on the show, the Aramaic Targums. Targum just means translation, but the Aramaic Targums are what's usually referred to when people just refer to the Targums. And these are Aramaic translations of the Hebrew Bible, Various parts of the Hebrew."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1647.96,"end":1654.24,"speaker":"Fr Andrew Stephen Damick","text":"Bible, but not like word for word or thought for thought translations. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1654.72,"end":1655.6,"speaker":"Fr Stephen De Young","text":"In many cases."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1655.68,"end":1659.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. There's a little bit of explanation or other comments included."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1660.32,"end":1742.41,"speaker":"Fr Stephen De Young","text":"So what's understood here by translation. Yeah. So we today, our modern idea of translation is you're either trying to go, as Father Andrew said, you try to go word for word, like, okay, so here's this. I'm going to translate the New Testament into English for the 50,000th time for some reason. And so I see this Greek word, I am going to figure out what English word is relatively similar in meaning to this Greek word. And I will write that English word. Right. And then depending on your translation strategy, you smooth that out a little or a lot for an English reader once you have a whole sentence. Right. Or as Father Andrew said, the other very common modern approach is thought for Thought where you say, well, we can't do it word for word because Greek syntax and grammar is totally different than English syntax and grammar. Right. So sometimes there's going to be one Greek word and we're going to need three or four English words to really convey the meaning. Right. Like it's a future perfect. Right. So I have to say he will have had gone."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1743.61,"end":1747.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. Whereas in Greek that'll just be the ending of a verb."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1748.01,"end":1812.76,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And that'll just be one word in Greek. Right, yeah. So, right. So you say, okay, well, we're just going to try the thoughts, the ideas, Right. We're going to take the idea that the Greek is communicating and communicate that same idea in English. This ancient mode of translation that produced the Targums is closer to that second one, but goes even further. Yeah, right. Because it not only is sort of like trying to convey the thought and the idea and will use as many words or even sentences as necessary to try to communicate what they believed the idea of the Hebrew to be with some precision. It would also seek to answer obvious questions about the text sometimes. Right. So if you read a verse and after reading it, there's sort of an obvious, sort of obvious question about it. Well, wait, what does that mean? Or why did he do that?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1813.64,"end":1814.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1816.68,"end":1834.42,"speaker":"Fr Stephen De Young","text":"The translator would just supply the reason. We just put it there. Oh, he did this because da, da, da. Yeah, right. And you get a little bit of the flavor of this. You get a little bit of the flavor of this actually when you read St. John's Gospel in the New Testament."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1834.81,"end":1837.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah. Because he gives little comments here and there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1837.25,"end":1867.77,"speaker":"Fr Stephen De Young","text":"Yeah, he's not translating, but he just writes that way. He just puts in these parenthetical comments. Right. See, this is sort of a very Jewish mode of writing at this time. Right. And so when you read the Aramaic, it's not just that it was a little free with the translation. Right. Like you're reading the NIV or something. It was that, you know, shots fired. They'd add the never inspired version. That's what I said anyway."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1867.77,"end":1868.21,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1870.61,"end":1896.51,"speaker":"Fr Stephen De Young","text":"But they'd, you know, add like in some cases almost a whole story, you know, like a whole like explanatory thing. And so the, the Jewish communities, even the ones where people knew Aramaic and their Hebrew wasn't very good, so they needed to use Aramaic Targums a lot. They kind of knew that was going on."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1896.75,"end":1897.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1897.23,"end":1969.99,"speaker":"Fr Stephen De Young","text":"And so when you look at the rules for synagogues in the Second Temple period and around the time of Christ, you couldn't just go and read a Targum in the synagogue. If you were going to use the Targum in a synagogue, you had to read the Hebrew first. Right. You get up and read the Hebrew first, and then you could read the Aramaic for the people there who only knew Aramaic, but because of how loosey goosey it was, they wouldn't let you just. Right. Read the Targum by itself. You could read the Greek by itself, by the way. So there was a recognition that the. The Greek translate the Old Greek and the Septuagint in the case of the Torah were recognized as being, you know, what we would call closer to a word for word kind of thing. And so could be read by themselves. But so people were used to reading, you know, the text of Scripture with some enhancements, with some explanatory notes that weren't in footnotes or margins that were just in there in the text, just added in."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1969.99,"end":1972.51,"speaker":"Fr Andrew Stephen Damick","text":"And there was not a sense of like, they're pulling a fast one."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":1973.16,"end":2037.57,"speaker":"Fr Stephen De Young","text":"Right. And then you get the midrashim, which go even further than that Midrash. Midrash is basically a method of commentary where you would have the actual text of Scripture, but then copious amounts of explanatory material. Again, not in a footnote or a margin note, but just put in there with the text. So a good. A good example of something from the midrash that St. Paul actually refers to. St. Paul in First Corinthians is talking about. He's sort of going through, in an analogical way the history of Israel in the wilderness and making a comparison to Christians living in the world. And so he talks about how all of the Israelites passed through the sea and passed through the cloud, and they were baptized into Moses."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2037.57,"end":2037.77,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2037.77,"end":2046.17,"speaker":"Fr Stephen De Young","text":"And he says, and Israel had a rock that followed them in the wilderness, and that rock was Christ. And we go, oh, yeah, the rock. You know, Moses hit it. It gave water."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2046.89,"end":2047.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2047.21,"end":2062.81,"speaker":"Fr Stephen De Young","text":"The rock is Christ. Cool. And we skip right over that followed them part. Yeah, right. That the rock was following them around. You're not going to find that anywhere in the book of Exodus."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2062.89,"end":2063.45,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2064.41,"end":2088.61,"speaker":"Fr Stephen De Young","text":"But it comes from the answer to a question. At the beginning of their 40 years of wandering in the desert, they get water from that rock. At the end of their 40 years wandering in the desert, there's another rock that Moses hits that he's not supposed to. And they get water from that rock. Where did they get water for the rest of the 40 years? Right. The manna was falling wherever they were. But where'd their water come from."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2089.73,"end":2090.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2090.93,"end":2099.81,"speaker":"Fr Stephen De Young","text":"And so the answer that you get when you read the midrashim about the rock is that, well, the rock followed them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2101.89,"end":2102.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2102.69,"end":2103.49,"speaker":"Fr Stephen De Young","text":"The whole time."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2103.81,"end":2104.33,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2104.33,"end":2117.82,"speaker":"Fr Stephen De Young","text":"And not just like a little note, oh, by the way, the rock followed them. What you find in the midrash is not only a whole story about the rock following them, but the complete text."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2117.82,"end":2118.7,"speaker":"Fr Andrew Stephen Damick","text":"Of a song."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2120.86,"end":2133.46,"speaker":"Fr Stephen De Young","text":"That Israel sang every time they made camp to get the rock to pick up from where it was and to roll over to them and deposit itself where they were camped."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2133.46,"end":2135.21,"speaker":"Fr Andrew Stephen Damick","text":"Now, that's so amazing."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2136.25,"end":2152.49,"speaker":"Fr Stephen De Young","text":"And all the rejoicing they did every time it happened. So it's like this whole developed story. Right. But it's just incorporated into the text. I believe it's in the midrash on numbers. So, again, this is a thing."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2152.73,"end":2153.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2153.05,"end":2186.26,"speaker":"Fr Stephen De Young","text":"The midrashim are still being used in rabbinic Judaism. And. Right. So again, this was just a way of. Oh, yeah, this is. We're accepting. Right. This other stuff isn't on the same level as the Hebrew text of the Torah itself, but there's, you know, this other information. And by the way, St. Paul feels totally free to just reference these traditions. Right, right. He doesn't feel the need to parenthetically say, oh, but that whole following thing, that's just a tradition. That's not actually in the Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2186.62,"end":2188.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he just says the rock was Christ."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2188.54,"end":2196.06,"speaker":"Fr Stephen De Young","text":"He just says, yeah, there was a rock that followed them. Everybody knows that. By the way, the magicians were named Janice and Jambres. He says later on."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2196.38,"end":2196.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2199.34,"end":2246.47,"speaker":"Fr Stephen De Young","text":"It'S almost like he didn't believe in Sola Scriptur or something. But so that's an example. The kinds of stories that you get. So there are other forms of rabbinic literature dealing with and commenting on the text that follow that kind of format, which is also kind of the way Jubilees is written, which is different from the way most apocalyptic literature and most Anakin literature is written. And so this is, I think, one of the reasons why it might have had more currency with that community in that they kind of had a box to put it in. Right. Oh, this is interpretations and traditions associated with the book of Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2247.03,"end":2247.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2247.35,"end":2249.35,"speaker":"Fr Stephen De Young","text":"This is sort of a midrash on Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2249.35,"end":2249.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2249.71,"end":2254.87,"speaker":"Fr Stephen De Young","text":"This is a sort of weird tarkum of Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2256.87,"end":2258.95,"speaker":"Fr Andrew Stephen Damick","text":"There is some weird stuff in there. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2261.67,"end":2291.35,"speaker":"Fr Stephen De Young","text":"There'S plenty of wild stuff in the midrash, though. So, I mean, it kind of fits in there pretty well. But so that said, that is part of how we have to look at the book of Jubilees because of. Because that's how it's written. So what I mean by that and what that means is when we're talking about, again, we'll look at the testament, the 12 patriarchs that we talked about last time, the Testaments. Each of those is a composition."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2291.67,"end":2291.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2291.95,"end":2336.9,"speaker":"Fr Stephen De Young","text":"We talked about how at least several of them definitely circulated on their own. This is a composition. It's composed by somebody. It has a theme, it has a message. Right. Or a set of messages around a theme composed at one point. Whereas when we're looking at the Book of Jubilees and we're sort of tracking through Genesis and then there are these sort of added details and added bits. Right. We shouldn't assume that there's one person who sat down the right to write the Book of Jubilees and came up with all of those added bits out of his own head. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2336.9,"end":2337.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2337.58,"end":2392.53,"speaker":"Fr Stephen De Young","text":"Because that's not how that kind of commentary was written. Right. Rather, the person who's finally putting together what we now call the Book of Jubilees has all of these bits of tradition and interpretation already has received them from somewhere. Right. There may be some of it. That's his own thinking, but a lot of it, at least, the majority of it at least, is stuff that he's received probably orally. Maybe some of it textually were texts we don't have anymore, maybe from other bits, bobs of anarchic literature that already existed. But that stuff is all finding a resting place here in the Book of Jubilees. So it's a. It's a repository of all these different bits of tradition and interpretation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2393.25,"end":2394.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2394.93,"end":2413,"speaker":"Fr Stephen De Young","text":"And it's important that we set that out because we're going to talk about later on places where things from the Book of Jubilees show up in the New Testament. And when they show up in the New Testament, there are some times where it's like virtually a quote."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2414.44,"end":2415.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2415.24,"end":2450.43,"speaker":"Fr Stephen De Young","text":"Those places look like places where it's the Book of Jubilees. There are other places where there are just references to things that are in the Book of Jubilees where we can't be sure if, oh, the author is taking this from the Book of Jubilees or if it's just, you know, this is a Jewish tradition of interpretation that lots of people had. The earliest written source we have, we have it in. That we today have it in is the Book of Jubilees. But, I mean, it may have been much older than that. It may have been in all kinds of other literature that we don't have anymore."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2450.59,"end":2512.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, I think, you know, for people maybe to get Some sense of this. If people know about like the tradition of like Arthurian literature. I mean, a big difference, of course, is there is no, as far as we know, original Arthur story that we can all point to. Unlike that, there is Genesis, you know, but like, for instance, you get Thomas Mallory, who, you know, he writes Mort Darthur. Right. Well, what he's doing is he's compiling a whole bunch of other Arthur stories that he's gotten from various sources, you know, so you can see these things combined together. And he did some editing. It's pretty clear that he did some editing to make it kind of fit together in certain ways. But. But probably none of it did he actually compose himself in the sense of coming up with a story. Almost all of it. We can point at other sources and say it's. It's probably from this, you know, whereas with Jubilees, it's so old that we just don't. If there are other textual sources, we don't. We don't have them, you know, largely speaking."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2512.7,"end":2514.5,"speaker":"Fr Stephen De Young","text":"Probably. Yeah, yeah, probably."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2514.5,"end":2522.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. A lot of probabilities in this point in history. Talk about text. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2522.2,"end":2534.44,"speaker":"Fr Stephen De Young","text":"Well, the reason, the main reason I said probably is, for example, Right. Like, obviously the 364 day Anaka calendar that Jubilees points to pre existed it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2534.68,"end":2536.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, yes, of course."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2536.52,"end":2611.03,"speaker":"Fr Stephen De Young","text":"Because the Book of Enoch was written before the Book of Jubilees and it's laid out in the Book of Enoch. Right. But we can't say for certain that, oh, the book of Jubilees got this from the book of first Enoch as we have it today. Yeah, right. It could be both be drawing on something else that we don't have. Right. There's all kinds of different options. Right. And I know I'm kind of belaboring this. Right. But the reason I belabor this is one of my pet peeves is again, you, anyone who listens to this show for a long time hears me rant all the time about how people need to take logic courses before they get PhDs. But people argue all the time, right. Make what is essentially a kind of bad scholarly, post hoc ergo propter hoc right argument. Right. That, well, X existed before Y, therefore Y plagiarized, stole from copied X."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2613.91,"end":2617.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. Ergo propter hoc."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2618.23,"end":2638.78,"speaker":"Fr Stephen De Young","text":"Yeah. Whereas. No, that doesn't prove anything. Right, right, right. You know, Doom Patrol and X Men were developed at the same time. You can't prove either of them stole from the other. But early Doom Patrol is definitely swiping from the Fantastic Four."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2641.42,"end":2643.26,"speaker":"Fr Andrew Stephen Damick","text":"They're drawing on similar traditions."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2643.42,"end":2650.9,"speaker":"Fr Stephen De Young","text":"Yeah. Right, so. So you have to be much more careful and much more nuanced than that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2650.9,"end":2651.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2651.9,"end":2677.26,"speaker":"Fr Stephen De Young","text":"Just the fact that something preexisted something else does not mean that they had any relationship whatsoever. Yeah, right. And the, the, especially when we're talking about history, the historical documents, I don't even say ancient text, just the historical documents that are extant today are a tiny fraction of all of the documents that have ever existed."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2677.76,"end":2679.36,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2679.76,"end":2689.36,"speaker":"Fr Stephen De Young","text":"And so basing conclusions on making sweeping statements. Right. No one in the early church did this. Everyone in the early church thought this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2689.68,"end":2690.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2690.64,"end":2708.21,"speaker":"Fr Stephen De Young","text":"All of these statements are ridiculous because we don't have the voices of anything but a tiny fraction of the people in the early church. A tiny fraction of the bishops of the early church."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2708.93,"end":2732.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's similar to when people will sometimes say things like the church fathers say, or my favorite is none of the church fathers say. And I'm like, hold on, hold on, hold on. Number one, can you read all of the languages that would be required to literally read all the church Fathers? You know, and if it's like Yaroslav Pelican, okay, yes. This guy reads all those languages."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2732.93,"end":2738.53,"speaker":"Fr Stephen De Young","text":"Yeah. But he's smart enough to say no extant writings of the church fathers say."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2738.93,"end":2740.21,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2740.85,"end":2745.25,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right. So. Because he knows most of them are not extant."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2746.05,"end":2755.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. That's why you have to more often say, I'm not aware of, you know, or something like this Church father says this in this text."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2755.97,"end":2877.7,"speaker":"Fr Stephen De Young","text":"So if I seem to be belaboring these things sometimes or sound like I'm being mealy mouthed about things like, well, we don't know for sure. It could be the good. I'm trying to be responsible. I'm trying to model good behavior, a little intellectual humility to my brethren, who. You can't model humility. As soon as you set out to do that, you failed. But, but I tried to model logic. Right. Of. Right. You not jumping to conclusions. Right. What can we say for sure? What can we say? Probably. What can we say? Maybe. Right. And be consistent about that and fair about that. Right. So again, we know that the Book of Jubilees is a repository for all of these traditions surrounding the Book of Genesis. We know it is probably not the origin of most of them, but a repository of them. And in many cases, it is our earliest written text that contains some of those traditions. All of those are fair statements. So we've been talking about when it was written and things written before and things written after it. The book of Jubilees was written in the mid second century BC, which is circa 150 BC, is what that means. And that puts it in the time period, the Hasmonean era, immediately after the Maccabean revolt, to sort of frame it historically. And there are things in the contents that reveal that pretty clearly. Even if we weren't just going based on the manuscripts, that we have manuscript evidence. For example, there is a very obvious shot at the Greeks. And, you know, of all places, the story of the expulsion from Paradise."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2878.34,"end":2878.82,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2880.74,"end":2907.01,"speaker":"Fr Stephen De Young","text":"There's a comment about Adam receiving the garments of skin. Right. To cover his shame. And it says, unlike those who go about naked with unconcealed shame. Right. Referring to the gymnasia that the Greeks built in and around Judea."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2907.49,"end":2909.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where people are naked."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2909.89,"end":2916.45,"speaker":"Fr Stephen De Young","text":"Yes. That's. That's what gymnasium means. Yes, Means naked place."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2918.93,"end":2922.45,"speaker":"Fr Andrew Stephen Damick","text":"So please don't take that literally when you go to the gym next time, boys and girls."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2922.77,"end":2924.21,"speaker":"Fr Stephen De Young","text":"And you will get thrown out."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2924.77,"end":2925.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2925.33,"end":2927.81,"speaker":"Fr Stephen De Young","text":"Don't ask me how I know. Anyway, of course, in Europe, that's just."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2927.81,"end":2928.69,"speaker":"Fr Andrew Stephen Damick","text":"The word for high school."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2929.27,"end":2929.59,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2930.71,"end":2931.11,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2931.83,"end":2962.92,"speaker":"Fr Stephen De Young","text":"But. But they did that. It came from a very literal thing that they exercised in the. Dude. But. So that's a deliberate shot. Right. And that was to carefully give a little background on that. That was one of the issues preceding the Maccabean revolt is there were Jewish men who had concocted various means to try to reverse or hide their circumcision."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2963.64,"end":2964.12,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2964.44,"end":2965.4,"speaker":"Fr Stephen De Young","text":"Because of that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2965.88,"end":2968.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2968.36,"end":2974.44,"speaker":"Fr Stephen De Young","text":"So that they could go to the gymnasia and look, like, not be obviously Jewish."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2974.68,"end":2975.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2975.12,"end":2989.79,"speaker":"Fr Stephen De Young","text":"And so there was a whole idea of being ashamed to be Jewish. This kind of thing associated with the gymnasia. So that's why you would get sort of this seemingly random shot."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2990.43,"end":2990.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2991.79,"end":2997.95,"speaker":"Fr Stephen De Young","text":"You're talking about the expulsion from paradise at Adam, and all of a sudden you're like. Yeah. Running around naked, shameless."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":2998.03,"end":2998.59,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3001.07,"end":3118.66,"speaker":"Fr Stephen De Young","text":"But that's why. Right. Because it's coming from this time period and taking a shot at the Greeks. The earliest copies we have are fragmentary. They're not the whole text, but they're in Hebrew and Aramaic and come from the Dead Sea Scrolls. Hebrew is clearly the original language. We have enough of the Hebrew and enough of other languages to be able to determine that pretty accurately. We have a lot of. Even though they're fragmentary, we have a lot of copies among the Dead Sea Scrolls. It is the third most common text among the Dead Sea Scrolls in terms of number of copies there. And in general, because of the time and expense and effort that was required to copy A manuscript. When you're looking at a library, an ancient library, whether it's at a monastery or like at Qumran or that kind of thing, the more copies of a text you find, generally it's considered the more important that text was because the more effort and time and expense they were putting into preserving that particular text as opposed to others. And the three most common texts for the record in the Dead Sea Scrolls, number one is the Book of Genesis, number two is the Book of Enoch, and number three is the Book of Jubilees. Most of the text is available in a Latin translation. And here's what this is also definitely a unique thing among Second Temple Jewish texts. You can reconstruct almost the entire Greek text from patristic citations. You could take quotes from the Church Fathers and construct almost the entire Book of Jubilees in Greek."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3119.3,"end":3126.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which I think the only other text you can do that with is probably portions of the Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3126.58,"end":3129.7,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3129.7,"end":3130.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3131.46,"end":3139.06,"speaker":"Fr Stephen De Young","text":"So, yeah, you can't do that with any of the other Second Temple literature texts that we're going to talk about."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3139.38,"end":3144.57,"speaker":"Fr Andrew Stephen Damick","text":"Which is another way of kind of showing how. How popular this text was."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3144.73,"end":3147.61,"speaker":"Fr Stephen De Young","text":"Right. And that's in Christian. In a Christian context."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3147.85,"end":3148.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3149.29,"end":3162.17,"speaker":"Fr Stephen De Young","text":"Of the church dwellers. And of course, we have the entire text in Ge', ez, and there it's called, it's titled the Book of Divisions."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3162.17,"end":3169.48,"speaker":"Fr Andrew Stephen Damick","text":"Like the divisions of time and everybody. That's the liturgical language of the Ethiopians. Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3170.6,"end":3233.48,"speaker":"Fr Stephen De Young","text":"And that's because it was publicly read by Ethiopian Jews, the pre Christian period. And then Ethiopian Christians took over the Ethiopian Jewish canon as their Old Testament. That's why we have the whole text in that language. So this means the fact that we have all that, you know, we talked about with. Since it's the other one we talked about, I would keep using it for comparisons. The testaments of the twelve patriarchs, we talked about how we have some of them in Aramaic, all of them in Greek, how there are differences between the Aramaic and Greek. Right. This amount of testimony to the text in this many different language sources is kind of unprecedented for any of these texts, which is another testament to the popularity across a range of different people, across a range of centuries. And so. But having all those different translations, we have a really good idea of what the text is."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3234.2,"end":3238.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The original you can really reconstruct well what the original must have been."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3239.08,"end":3289.35,"speaker":"Fr Stephen De Young","text":"Right. Even though we've got a lot of these texts are fragmentary and we're talking about most. And almost the entire text. Right. We've got so many different witnesses in different languages that we can pinpoint, you know, what the text says. Really? Really. Well, that's unusual. A lot of these texts, there are multiple versions in multiple languages, as we saw last time, as we'll see in the future, talking about these texts. So the basic overview of the structure and when we get into our second half, we're going to go into much more detail about the structure. But basically, the structure of the Book of Jubilees is that there's sort of this frame story. And the frame story is Moses on Mount Sinai. Moses on the top of Mount Sinai, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3289.35,"end":3305.63,"speaker":"Fr Andrew Stephen Damick","text":"Which, you know, that's in Exodus, right. You know, you get Moses on Sinai, and we know that Moses has given the Torah on Sinai. But you don't like. That's never sort of plays out on camera, so to speak, in the Scriptures."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3306.04,"end":3313.52,"speaker":"Fr Stephen De Young","text":"Right. You know, and when we say Torah here, we're saying Torah, like the Book of Genesis. Right, right. As part of the Torah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3313.52,"end":3323.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. So this is, you know, Jubilees is sort of saying, now, what if you could have been there, you know, as Moses is getting this vision and you."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3323.68,"end":3518.4,"speaker":"Fr Stephen De Young","text":"Saw it with him, and then it plays out, right? So the body of the text within the frame story is a retelling of the Book of Genesis. Right. But it sort of begins and ends, you know, the frame. The narrative frame begins and ends with Moses on Mount Sinai. And so that does mean that the contents of the Book of Genesis are being framed as a vision that Moses is receiving as something that's being revealed to Moses. Right, Meaning the story of the creation of the world, the expulsion from Paradise, Noah and the Flood, the Tower of Babel. These aren't like traditions that were handed down to Moses. This isn't Moses rewriting those stories as they were told by the other nations. This isn't Moses communicating certain theological ideas that he received from God. This is Moses recounting this vision he received of these things according to the Book of Jubilees. Right. That's how the Book of Jubilees is presenting it. He's sort of seeing this play out and then he's recording it. Right. That doesn't mean that the Book of Jubilees is presenting this all as, quote, unquote, literal modern history. Right? No, because it's being presented as a vision that opens up all these different levels of interpretation. Right. Of interpreting Moses's vision. What this also means, though, about the text, because of the way the text is written, that because this is sort of a recap or retelling of Genesis, part of what's being communicated by the text. Part of the way in which the text communicates is based on what within the text is moved over quickly and what within the text is expanded upon. Right. So the text is free to add in stories, add in information, add in details. Right. Flesh out things that are only briefly discussed in Genesis, and they're a place where it does that. And so if we have a place where one or two verses in Genesis becomes two, three chapters in Jubilees. Right. Well, obviously this is. The author of Jubilees thought this part was very important. Right. If we have something that's three verses in Genesis and is also three verses in Jubilees or even gets skipped over Jubilees in the retelling, then that's something that the author of Jubilees didn't think was as important. Right. To touch on again and comment on. Right. So just that emphasis, or lack of emphasis is part of how the book of Jubilees communicates. Part of what the author is telling us is what episodes in Genesis, what stories, what figures in Genesis he thinks are really key and important and wants to focus on."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3518.56,"end":3527.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's worth pointing out, like, this is not intended to be a replacement for the book of Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3527.52,"end":3527.92,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3528,"end":3551.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. It's. It's. It's a commentary of sorts. So it's not like he's saying, well, these parts don't matter, so I'm not going to include them in my version of the story. You know, it's just like, you know, just like, let's sing the Father Stephen's Bible study and occasionally just sort of reads through a genealogy. Some genealogies he reads through. He points out a bunch of stuff for an hour, but others you're like. And begot, begot, begot, begot. Okay, next."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3552.32,"end":3559.92,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. Sometimes you just have more to say about this than about that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3559.92,"end":3560.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3560.96,"end":3570.64,"speaker":"Fr Stephen De Young","text":"But this is. This is true of all authors. Any author you read who's writing secondary literature."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3571.44,"end":3572,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3572.32,"end":3585.25,"speaker":"Fr Stephen De Young","text":"Right. And this is secondary literature. Jubilees is secondary literature is commenting on Genesis. Right. Anyone writing secondary literature that includes all history writing, for example."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3585.73,"end":3586.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3586.85,"end":3588.21,"speaker":"Fr Stephen De Young","text":"You have to make choices."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3589.65,"end":3589.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3589.97,"end":3633.19,"speaker":"Fr Stephen De Young","text":"You don't end up focusing on every figure and every event and every line of text to the same degree. And if you do, your work becomes very tiresome. Hard to read. You always make choices. Right. And so part of reading and understanding a text, a secondary text, is understanding and identifying those choices that were made and what the author is doing and how he's communicating by way of those choices. So this isn't something weird that Jubilees does This is something that everybody writing secondary literature does."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3633.59,"end":3634.63,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3637.75,"end":3775.42,"speaker":"Fr Stephen De Young","text":"And then sort of a last note, because we could pretty much reconstruct. I mean, we have a lot of the Hebrew text firsthand from the other language versions. We could reconstruct the rest. This is just kind of an interesting tidbit that the Hebrew text that Jubilees is working from and commenting on. Right. Because it's just quoting it a lot of the time, doesn't quite match any Hebrew texts that we're aware of. It doesn't really match the Proto Masoretic text. I won't go too far down that rabbit hole. But technically, the Masoretic text didn't exist in the second century B.C. because the masoretes, who it's named after, the scribes who it's named after, didn't exist for hundreds of years afterward. And what makes it the Masoretic text is their notes. So that's. But the text that they would later put their notes on did exist in the second century bc, and it's not that. So it's not the Hebrew text that's commonly used by Rabbinic Judaism today or that's used for Protestant Old Testaments. It's also not the Hebrew text that underlies the Greek translations, because there's a different Hebrew text. And this is part of what we have to remember, that in the second century B.C. still, the Hebrew text was not settled. The Hebrew text was fluid, and there were a number of different Hebrew textual traditions at that time. So, for example, the Book of Jeremiah is much longer in the Hebrew text in the Masoretic text than it is in the Greek version at Qumran. In the Dead Sea Scrolls, we found Hebrew copies of the long version and the short version of the Book of Jeremiah. A Hebrew text that matches the Greek text and a Hebrew text that matches the later Hebrew text."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3775.98,"end":3776.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3776.7,"end":3807.21,"speaker":"Fr Stephen De Young","text":"Side by side, the same community had both of them. Right. So there was not a single canonical text at this point, even in Hebrew. Yeah, there are variations at this point. And so whatever text the author of Jubilees is using, it's not identical to either of those. So there's another Hebrew textual tradition now lost out there that Jubilees is using."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3809.93,"end":3819.25,"speaker":"Fr Andrew Stephen Damick","text":"Cool. Yeah. So it's valuable for biblical scholarship in and of itself, even apart from the sort of commentary side Old Testament textual."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3819.25,"end":3821.12,"speaker":"Fr Stephen De Young","text":"Criticism, which is an interesting world."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3821.36,"end":3836.72,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Yes, it is. I've been reading some more of that stuff lately. It gets weirder the deeper you go. All right, well, that's our first half on this episode on the Book of Jubilees. We'll be right back with the second half of this episode of the Lord of Spirits."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3837.12,"end":3853.37,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3858.25,"end":3896.37,"speaker":"Fr Stephen De Young","text":"Ancient Faith Radio is brought to you by our listeners with help from Byzantine Coffee. Enjoy a great cup of Byzantine coffee while tithing to your parish. A non profit organization. Byzantine coffee is the product of prayer, reflection and the work of a few Orthodox Christians. When purchasing our small family co op sourced and air roasted coffees, add your parish discount code at checkout to tithe 10% of your purchase price. We also offer a fine grind for your Greek or Arabic coffees. Subscribe and save 5% on every purchase. Visit us at byzantinecoffee.com to learn more."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3900.05,"end":3916.05,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3917.33,"end":3918.29,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3918.85,"end":3919.49,"speaker":"Fr Stephen De Young","text":"I have a question."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3920.13,"end":3921.01,"speaker":"Fr Andrew Stephen Damick","text":"You have a question?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3921.49,"end":3928.13,"speaker":"Fr Stephen De Young","text":"Yes. Does Byzantine coffee concoct elaborate schemes to assassinate you and make itself the emperor?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3929.09,"end":3930.77,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is what Harnack said."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3931.33,"end":3939.81,"speaker":"Fr Stephen De Young","text":"Yeah. Just curious. I mean I could be down for that on a boring Saturday. That could add some intrigue, sexual."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3940.05,"end":3942.37,"speaker":"Fr Andrew Stephen Damick","text":"I'll pay extra if my coffee can do that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3942.53,"end":3943.97,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3945.81,"end":3966.43,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Assassin's grind. So yes, we're talking about the book of Jubilees and getting a lot of great engagement on the YouTubes from some of our commenters there. So hello YouTube, we're very happy to have you with us this evening or morning for those of you over in East Asia, which some of you engagement."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3966.43,"end":3968.15,"speaker":"Fr Stephen De Young","text":"Do you mean they're fighting you or."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":3968.87,"end":4006.01,"speaker":"Fr Andrew Stephen Damick","text":"No, not that kind of engagement. Yes. Yes. Yeah. So we're talking about the book of Jubilees. We just discussed basically what, what it is right. Kind of in a meta sense and its place in in Jewish and Christian history early on why it it was being read and continue to be continues to be read by both Jews and Christians even up until this very day. So, so yeah, so this second part of the, of this episode we're going to be discussing sort of the structure of the book. You know what's."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4006.01,"end":4007.45,"speaker":"Fr Stephen De Young","text":"Well, the first part of the second part."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4007.45,"end":4010.21,"speaker":"Fr Andrew Stephen Damick","text":"Yes. First part of the second. That's true. Yes. The structure of it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4010.45,"end":4018.69,"speaker":"Fr Stephen De Young","text":"Tonight's episode is constructed after Thomas Aquinas's Summa Theologica."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4018.69,"end":4019.09,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4019.33,"end":4024.21,"speaker":"Fr Stephen De Young","text":"There's a first part, a first part of the second part, a second part of the second part, and then a."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4024.21,"end":4027.01,"speaker":"Fr Andrew Stephen Damick","text":"Third part and a third part of the fifth part with."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4027.01,"end":4029.49,"speaker":"Fr Stephen De Young","text":"Yeah, but not four halves."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4029.81,"end":4036.91,"speaker":"Fr Andrew Stephen Damick","text":"No, just three halves. We've only ever had one episode with four halves. Yes, that was the Thunder Gods episode, if I remember correctly. Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4036.91,"end":4039.95,"speaker":"Fr Stephen De Young","text":"Which was 2. 2. 2 shows in one."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4040.19,"end":4050.03,"speaker":"Fr Andrew Stephen Damick","text":"Indeed, indeed. So, yeah. So structure is actually a theme of the book. Like it's not just. We're talking about that. This book has structure."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4050.67,"end":4052.67,"speaker":"Fr Stephen De Young","text":"Structure is part of the Book of Divisions."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4052.99,"end":4060.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, The Book of Divisions is the literal name of it. Yeah. Which. A Jubilee is a division from, from the Old Testament."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4060.8,"end":4061.68,"speaker":"Fr Stephen De Young","text":"Division of time."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4061.68,"end":4063.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Division of time."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4063.28,"end":4095.85,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So, yeah. So there is basically the entire book is structured around the Enochic calendar, therefore around the Jewish feast, the festal cycle, the various other cycles of the calendar as mapped out on the 364 day in Akit calendar. Now we're gonna get into a little more of what that means."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4096.09,"end":4096.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4096.41,"end":4114.17,"speaker":"Fr Stephen De Young","text":"In a little more detail. So it's centered around the most important feast. We talked about this a few episodes ago, but if you haven't heard that episode, you probably wouldn't guess which feast it is. Right. You might guess like, well, Passover."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4114.57,"end":4114.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4115.05,"end":4121.77,"speaker":"Fr Stephen De Young","text":"Or Day of Atonement. But no, it's centered around Pentecost. It's centered around the Feast of Weeks."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4122.41,"end":4124.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4126.17,"end":4143.34,"speaker":"Fr Stephen De Young","text":"Which is interesting for a bunch of reasons. But is the feast that celebrated every year the giving of the Torah at Mount Sinai. Right. Which as we said, is sort of the frame story."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4143.74,"end":4144.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4144.14,"end":4172.4,"speaker":"Fr Stephen De Young","text":"For the book. But that is the central, that is the central feast. And Moses, as we talk about the Book of Jubilees being apocalyptic literature. Right. Apocalypt elliptic literature, has someone making this divine ascent. And so Moses ascent of Sinai in the book of Jubilees is such a divine ascent because he, he goes to the top and he is now in the presence of God."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4173.52,"end":4173.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4174.08,"end":4204.36,"speaker":"Fr Stephen De Young","text":"So the top of the mountain has become paradise. He has entered into it. He is now in the heavenly realm. And there, the feast of Pentecost, the feast of the giving of the Torah, of the giving of the covenant, of the ratification of the covenant is an eternal reality. And that is because God is eternally faithful to, loyal to the covenant."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4205,"end":4205.4,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4205.8,"end":4219.38,"speaker":"Fr Stephen De Young","text":"The ratification of the covenant. What we're concretely talking about, the first time it was done, right. Was when the people of Israel said all these things you have said, we will do. And then they got spattered with blood."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4220.5,"end":4220.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4221.46,"end":4224.46,"speaker":"Fr Stephen De Young","text":"And they had their fingers crossed. We know from the rest of the Hebrew Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4224.46,"end":4224.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4224.98,"end":4247.22,"speaker":"Fr Stephen De Young","text":"But they said all these things you have said we will do. Right. That was them ratifying it. Right. So God eternally ratifying it means there's no doubt, there's never a question God is going to honor his covenant."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4247.78,"end":4248.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4248.18,"end":4288.19,"speaker":"Fr Stephen De Young","text":"Right. In terms of blessings, in terms of curses, in terms of all the things he promised. No doubt from his side. Right. And so the Feast of Weeks, then Pentecost was a yearly representation, reenactment, ritual participation in it from the other side, where the people, again every year, right. Through the ritual participation of participating in the Feast of Weeks, stood at the foot of Mount Sinai and said, all of these things that you have commanded we will do."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4288.51,"end":4305.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's that there's kind of an eternal Pentecost being celebrated in heaven. And once a year, humanity goes and celebrates with the angels, basically joins in what. What's ongoing in heaven."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4305.64,"end":4335.05,"speaker":"Fr Stephen De Young","text":"Right, right. And so this presents a certain idea of the relationship between eternity and cyclical time. Right, and cyclical time. I know you've heard this thing. It's a very modern thing. Right. That all the pagans thought that time was cyclical and the Jews didn't. They thought it was linear."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4336.09,"end":4337.53,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4338.01,"end":4357.35,"speaker":"Fr Stephen De Young","text":"It's nonsense. So, yeah, there's. There's an element of truth to it. Here is the more accurate statement. Pagans thought that time was circular. Circular, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4357.35,"end":4358.51,"speaker":"Fr Andrew Stephen Damick","text":"Meaning still linear."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4359.15,"end":4367.87,"speaker":"Fr Stephen De Young","text":"Everything just happens over and over and over and over again. Right. All of this has happened before and all of this will happen again."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4368.11,"end":4375.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That the whole universe will, you know, collapse eventually in destruction and be reborn. All the gods will come back."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4375.35,"end":4404.49,"speaker":"Fr Stephen De Young","text":"And they believed the world was eternal. There's all of these things. Yes. Gods were born and gods died. Humans were born and humans died. Civilizations arose and civilizations fell. Everything just repeated itself over and over again and went nowhere. Whereas in scripture, you have this presentation of time and eternity. Right. And time is cyclical, which is not the same thing as circular."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4405.23,"end":4439.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And like one of the ways that we see this, I mean, we mentioned this over and over again on this show. This idea of ritual participation bringing us to experience eternal realities. Right. That we keep coming back to them on calendar days, but we're entering into an eternal reality. Well, this is simply illustrated here in Jubilees, this principle that we've been talking about over and over again and is the reason that so many orthodox hymns begin with the word today, even if they're talking about an event that, from a kind of historical point of view, is long in the past."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4440.02,"end":4441.38,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4441.38,"end":4441.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4442.66,"end":4578.59,"speaker":"Fr Stephen De Young","text":"And so what a calendar does, a liturgical calendar. Well, any calendar. What any calendar does, right. Because any calendar you use is going to be cyclical. There'll be a series of weeks that make up a series of months. Right. That make up a series of years. That cycle is going to repeat. Right. There's going to be a May 23rd every year. It loops back around. And even if you want to talk about the. Let's talk about the most secular calendar I can think of, which is the American consumer calendar. Right? Meaning it's structured around holidays that are built to sell things. Right? So we just had Memorial Day, sell barbecue supplies and flags. We're going to have. Now, Juneteenth has been added to the list. I think that's also going to end up being a lot of barbecuing for most people. Fourth of July, sell fireworks, sell flags. You know, Mother's Day, Father's Day is in there. Buy gifts for dad, get the Thai cake from Carvel, Valentine's Day, St. Patrick's Day, sell a lot of beer and green stuff. Right. Etc. Right. So this is the most about as secular as you could get of a calendar, even though some of those days are still named after saints. It's pretty secular. That calendar, right, if you follow, will shape the rhythm of your life. And that's what it's designed for. That's what it does for retail establishments. Want that to shape the rhythm of your life. That seasonal section at your local Walmart where they have the stuff for whatever the next one of these holidays that aren't really holy days per se in most cases. Right. They're counting on that cycle. They want that to shape your life. Oh, now I go and I buy and consume this. Now I go and buy and consume that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4579.07,"end":4579.47,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4579.47,"end":4639.15,"speaker":"Fr Stephen De Young","text":"It'll shape your life. It'll form you. This. This, to me, right, is one of the worst backlashes of particularly the Puritan movements that come out of the Protestant Reformation. Bear with me here. Protestant friends really think about this, right? They had such an antipathy for, like, saints days, right. Some of those Puritan movements, Right. Well, most of those Puritan movements wouldn't celebrate Christmas, the birth of Christ, and some of them won't even celebrate Easter. Right. Pasca. But definitely we don't want a lot of, you know, feast days. I think it's in the Westminster standards that says you must guard against the proliferation of saints days."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4639.55,"end":4640.03,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4640.51,"end":4654.35,"speaker":"Fr Stephen De Young","text":"Protect everyone from this Right. So all of this stuff from the Christian liturgical calendar gets removed. Right. And most American Christianity, American evangelicalism, really comes out of those Puritan movements."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4654.93,"end":4655.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4657.49,"end":4670.29,"speaker":"Fr Stephen De Young","text":"Just historically. But then what do you end up centering even your church life around? Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4670.29,"end":4670.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4670.85,"end":4674.05,"speaker":"Fr Stephen De Young","text":"You got Mother's Day sermons. Mother's Day sermons."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4674.13,"end":4676.77,"speaker":"Fr Andrew Stephen Damick","text":"You're going to have a liturgical calendar one way or another."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4677.49,"end":4681.09,"speaker":"Fr Stephen De Young","text":"Fourth July sermons where you sing patriotic songs."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4681.58,"end":4682.06,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4682.22,"end":4691.82,"speaker":"Fr Stephen De Young","text":"In a church. Right. All of these things. Right. It's the same thing. You've just chosen the most secular possible version."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4692.14,"end":4702.22,"speaker":"Fr Andrew Stephen Damick","text":"What I want to know is, and I'm pretty sure the answer to this question is yes. I just haven't encountered it yet because I haven't Googled it up yet. Are there Amazon Prime Day sermons?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4703.26,"end":4706.78,"speaker":"Fr Stephen De Young","text":"Probably. I know there are Black Friday sermons."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4707.09,"end":4708.69,"speaker":"Fr Andrew Stephen Damick","text":"Oh, absolutely. Yeah, of course."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4710.77,"end":4721.97,"speaker":"Fr Stephen De Young","text":"So, right. Just pause and think about it for a minute. What's better? Right. To base and structure your liturgical life on the life of Christ."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4724.37,"end":4724.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4724.77,"end":4767.69,"speaker":"Fr Stephen De Young","text":"And the stories about Christ recounted in the Bible, or to base the cycles of your church life on random national holidays that often don't even have any particular religious significance. Yeah, right. I mean, the answer to that seems so obvious to me. Right. And I think the Puritans would be horrified by Fourth of July sermons and Mother's Day and Father's Day sermons. Right. So think about that. But this is why, again, the calendar is so important. Right. But so you end up, if you're on any calendar at all, you end up with these cycles."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4768.33,"end":4768.73,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4769.37,"end":4810.6,"speaker":"Fr Stephen De Young","text":"And the key thing here is about, again, that cycle being connected to eternity, that cycle coming around and bringing you back to eternal realities over and over and over again. Because we in this life on this earth cannot participate in those eternal realities eternally. Yet this is why St. Peter couldn't build the booths on Mount Tabor at the Transfiguration. This is why Moses had to go down from the mountain."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4813.64,"end":4814.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4814.04,"end":4847.05,"speaker":"Fr Stephen De Young","text":"We're not able as humans to live perpetually in these eternal realities. That's what we're looking forward to. That's what we're hoping for in the age to come, that we can live eternally in those realities, but we can't here in this world. But what we can do is live our life in a series of cycles, concentric cycles, as it were, that lead us out into the world and then back to those eternal realities again."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4849.15,"end":4849.27,"speaker":"Gregory","text":"Over."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4849.27,"end":4856.51,"speaker":"Fr Stephen De Young","text":"And over and over again and form our life around that. Around that structure of return."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4858.03,"end":4858.43,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4860.51,"end":4876.26,"speaker":"Fr Stephen De Young","text":"So as we mentioned, there's this frame story with Moses, right. We're Getting this from Moses's perspective, on top of Mount Sinai, Moses is there with the angel of the Presence."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4877.3,"end":4877.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4879.3,"end":4930.36,"speaker":"Fr Stephen De Young","text":"And the angel of the Presence. If you go back to our Old Testament Christology episodes, right. This is one of the titles given in Second Temple Jewish literature for what we call the second Yahweh figure, the second hypostasis of the God of Israel. Right. The second person, whatever language you want to use. Short version, this is Christ. Right. But one of the ways this is telegraphed in the text, right. He's referred to as the angel of the presence. Oh, well, it's an angel. Right. But every time he's describing God's actions, he says we. Yeah, he says when God created the world, we did this. Yeah, he's talking about what God did. It's not like when God created the world, we angels rejoiced."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4931.32,"end":4933.72,"speaker":"Fr Andrew Stephen Damick","text":"No, it's, it's, it's this common action."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4934.2,"end":4938.44,"speaker":"Fr Stephen De Young","text":"Yes. It's when God created the world, we separated light from darkness."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4939.56,"end":4941.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4942.28,"end":4946.76,"speaker":"Fr Stephen De Young","text":"So that's how this idea of a second person in the one God is conveyed."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4947.88,"end":4948.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4950.88,"end":4964.8,"speaker":"Fr Stephen De Young","text":"Again, this isn't full blown trinitarian doctrine. Right. But this is. Again, the book of Jubilees is meditating and commenting on things that we see in Genesis and Exodus."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4966.24,"end":4966.64,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4966.64,"end":4970,"speaker":"Fr Stephen De Young","text":"And. And presenting them here in commentary form."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4970.56,"end":4970.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4970.88,"end":4980.42,"speaker":"Fr Stephen De Young","text":"And so there are all these places, again, you can go back to that series we did where we see this second figure in Genesis and Exodus."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4980.5,"end":4980.9,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":4980.98,"end":5013.13,"speaker":"Fr Stephen De Young","text":"Who he is now referring to. And Moses receives this as this vision. So going into a little more detail then, on the sort of internal structure, it's structured around, as we mentioned now, the Anakic calendar, and I mentioned a couple minutes ago, this idea of sort of quote unquote concentric cycles. Right. So if you want to start with the smallest cycle, there's a weekly cycle. Yeah, right. With the Sabbath."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5014.09,"end":5014.65,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5014.97,"end":5042.96,"speaker":"Fr Stephen De Young","text":"And the Sabbath is on that one day, when it's observed on that one day a week is an entering into God's rest, which, as we've talked about it, isn't God taking a break, it's God being enthroned over his creation. So it's an entering into the kingdom, the rule, the dominion of God. Right. Which is an eternal thing, but that's entered into by humans on that one day. And then they go back into the world and they do their work and then it comes around again."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5043.2,"end":5043.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5043.56,"end":5045.12,"speaker":"Fr Stephen De Young","text":"So there's this weekly cycle."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5045.6,"end":5060.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And one thing I'll add to that is that if you read through the book, and I encourage people to read it. Like, really, this is one of the easiest ones to read. You know, it's not going to lead you off into like wild, crazy, speculative directions."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5060.32,"end":5063.76,"speaker":"Fr Stephen De Young","text":"There's not the kind of symbolism and stuff that you get in some of the others especially."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5064.48,"end":5077.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but like, one of the things you'll notice as you read it is the word weak is used a lot. And you know, it means generally when week is used in the text, it just means any kind of seven. So, like."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5077.24,"end":5077.6,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5077.68,"end":5086.28,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes they'll say he fulfilled his weakness, which means usually in that case, seven years. But yeah, so week just means seven."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5086.76,"end":5088.36,"speaker":"Fr Stephen De Young","text":"Because there are also Sabbath years."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5088.76,"end":5089.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5089.96,"end":5090.92,"speaker":"Fr Stephen De Young","text":"You go off and forget."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5091.08,"end":5095.88,"speaker":"Fr Andrew Stephen Damick","text":"So there's this seven structure that's built into the text that you see referenced over and over and over again."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5096.28,"end":5105.8,"speaker":"Fr Stephen De Young","text":"Right. Every seventh year, people were to not go and work their fields and leave them to the poor to go and work."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5106.54,"end":5106.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5107.82,"end":5110.54,"speaker":"Fr Stephen De Young","text":"Now we know Israel never did that, but they were supposed to."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5110.94,"end":5111.34,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5112.3,"end":5228.99,"speaker":"Fr Stephen De Young","text":"So there was the weekly cycle of seven days. There was to be this yearly cycle of seven years. There was also then every seven sevens. So after 49 years, after seven Sabbath years, there was to be a jubilee year whence book of jubilees comes from. And in that 50th year, not only was it a Sabbath, but all debts were canceled, all land was supposed to revert to the families God had given it to in the Torah, etc. Etc. Etc. Just like the Sabbath years were never actually practiced, the jubilee year was never actually practiced. We find out in the book of Jeremiah that's part of the reason for the exile. But that's how it was to be. This is how the, the, these are the cycles that the, the life of the people were to follow. And then, of course, within each year, you have the cycle of feasts. Right, the cycle of the feasts at this point. Right. There are some that come after the Torah. Right. So we don't have Purim, we don't have Hanukkah. Right. But the ones in the Torah you have on this yearly annual cycle, and each of those represents, again, a unique way of entering into particular eternal realities pertaining to and related to God. Now, in communicating this, in communicating this, as you read through the book of jubilees, you'll see what look like sort of crazy anachronisms. Yeah, right. So you'll see like Noah celebrating Pentecost."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5229.63,"end":5230.11,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5230.59,"end":5235.39,"speaker":"Fr Stephen De Young","text":"And you're like, Noah is celebrating the giving of the Torah at Mount Sinai."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5236.51,"end":5238.98,"speaker":"Fr Andrew Stephen Damick","text":"Right? What? Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5239.46,"end":5253.42,"speaker":"Fr Stephen De Young","text":"Or you'll see the patriarchs, right. Celebrating Passover and you're like, Abraham, wait, yeah, Egypt."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5253.42,"end":5253.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5257.38,"end":5265.98,"speaker":"Fr Stephen De Young","text":"And that will seem odd, yes, for obvious reasons. But first of all, you got to remember the text of the book of Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5266.86,"end":5269.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Genesis itself does this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5270.46,"end":5296.15,"speaker":"Fr Stephen De Young","text":"Right? So like, Noah's getting on the ark, he has to go get all the animals. He gets a certain number of the clean animals and a certain number of the unclean animals. You're like, wait, where did we find out about clean and unclean animals? That's in Leviticus. Right. So Genesis itself does this. And why is it doing this? Right. I mean, it seems non. Nonsensical to us. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5298.47,"end":5298.87,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5301.51,"end":5390.51,"speaker":"Fr Stephen De Young","text":"Part of that is because even if you've been listening to this show for a long time, you may be thinking of, well, so for example, the Passover or Pentecost is later people participating in, you know, the exodus from Egypt or participating in the giving of the Torah at Sinai. People who live maybe hundreds, thousands of years later. Right. Participating in that same event. Right. But that's. That's slightly off, right? That's slightly off. So those earthly events are places where eternal realities sort of broke into the human experience of time. And so the later people celebrating Passover are not just participating in the earthly material event of Israel leaving Egypt, but they're participating in the eternal reality of God setting his people free from bondage, ultimately to sin, to death, to the powers of evil. Right. They're really entering into that by way of entering into the place that that eternal reality broke into time. And that being the case."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5391.07,"end":5391.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5393.15,"end":5409.88,"speaker":"Fr Stephen De Young","text":"Noah, for example, when Noah receives a covenant from God, he is, in a sense, participating in that same eternal reality that will later break into human experience when the Torah is given at Mount Sinai."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5410.6,"end":5411.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5412.84,"end":5415.24,"speaker":"Fr Stephen De Young","text":"Right. So that's number one."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5415.48,"end":5438.11,"speaker":"Fr Andrew Stephen Damick","text":"Well, just. And just as not to belabor this point, but just to kind of connect it to one we've made over and over again. Just as when, you know, Adam and Eve hear the. The feet of God in the Garden of Eden, they are participating in the incarnation, which from a chronological point of view is not going to happen for thousands of years."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5439.07,"end":5447.31,"speaker":"Fr Stephen De Young","text":"Right. You know, isn't going to break into human experience for. Yeah, yeah, thousands. We'll just say thousands of years."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5447.55,"end":5450.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I'm just gonna throw out a big."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5450.2,"end":5455.24,"speaker":"Fr Stephen De Young","text":"Number so we don't have, you know, tedious emails."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5456.68,"end":5461,"speaker":"Fr Andrew Stephen Damick","text":"Billions and billions, seconds and seconds of years."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5461.32,"end":5475.56,"speaker":"Fr Stephen De Young","text":"Yeah. So, yes, there's a. There's a conspiracy group now that says that the. The Earth's only like. I think it's like 2500 years old."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5476.55,"end":5478.19,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Oh, yeah. Yeah, yeah, I've heard of this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5478.19,"end":5553.9,"speaker":"Fr Stephen De Young","text":"Yeah, the Tartarian people. Yeah. So there you go, right? Young earth creationists, you wacky liberals, if you're old Earth. So, but that's. So that's sort of number one. Number two, though is. And this is important too, in terms of how the book of Jubilees sees this. Remember, it sees what it's saying. These are things being revealed to Moses, right? So this is a view of what the Torah is and what's going on in the Torah. We tend to. And this is partially a problem with Torah being translated as law by way of nomos and lex that we've talked about before. Yeah, we won't belabor that again. But we think of it as well, this is God giving rules, right? This is God giving commandments. And if we disobey him, he gets upset and does bad things to us. And if we obey him, that he's happy and he does nice things for us."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5556.95,"end":5557.19,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5560.31,"end":5567.11,"speaker":"Fr Stephen De Young","text":"What that speaks to is a certain relationship between the commandments and created reality. That is wrong."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5567.67,"end":5569.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5570.07,"end":5626.01,"speaker":"Fr Stephen De Young","text":"So I can make rules, right. That are just based on my own personal likes and dislikes that are somewhat arbitrary. Right. Like, you know, if you're gonna, if you're gonna drink a drink in my house, you have to put a coaster under it, right? Now, I have a reason for that, Right. I don't. Maybe I don't want, you know, rings left on my furniture, or maybe it's just because this is Louisiana and I don't want to puddle all over my floor from the condensation on your drink. But whatever, right. For whatever reason I make that. Right. Like, if you don't do that, if you're over at my house and you don't put a coaster under your drink, and I don't see like nothing bad is going to happen to you. Right. That is just based on my own personal preferences."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5626.25,"end":5626.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5626.73,"end":5629.53,"speaker":"Fr Stephen De Young","text":"And sometimes we think that God's commandments are that way too."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5630.09,"end":5633.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're more like the laws of nature."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5634.59,"end":5634.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5634.83,"end":5636.11,"speaker":"Fr Andrew Stephen Damick","text":"Kind of. Kind of laws."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5636.11,"end":5646.91,"speaker":"Fr Stephen De Young","text":"Right. And so the, the way the book of Jubilees sees the Torah and the commandments of the Torah and everything in the Torah is that these things are built into the creation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5648.75,"end":5649.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5649.15,"end":5715.63,"speaker":"Fr Stephen De Young","text":"And so a prototype case of this is the first chapter and first couple verses of the second chapter of Genesis, right? Where the creation of the world, the creation of the heavens of the earth, the creation of the universe, of everything is described in terms of a seven day week, in terms of the Sabbath, in terms of what humans are going to do of this cycle going forward, that. That cycle of seven days, the Sabbath is baked into it is that structure for time is baked into the structure of the universe, the structure of creation. And so when God gives the commandment about resting on the seventh day. Right. It's not that, you know, every day is really the same, but God is telling you to do this certain thing on this certain day. It's no. God is revealing to you this part of the structure of the universe and time."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5716.19,"end":5735.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And also for all those, there's a handful of people out there who probably do not listen to this show, but nonetheless, there are people out there who say things like morality can be revised. This is why morality cannot be revised. That sin is sin, period."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5735.71,"end":5736.03,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5736.03,"end":5740.72,"speaker":"Fr Andrew Stephen Damick","text":"There's. Because it's about the nature of the universe. Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5741.12,"end":5752.56,"speaker":"Fr Stephen De Young","text":"Maybe you think we're in a multiverse and you could go to another universe where something you want to do is morally good. That isn't here. But. Right. Like you go live in the Terran Empire and murder is good."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5754.56,"end":5760,"speaker":"Fr Andrew Stephen Damick","text":"But in our universe and everybody has Van Dyke. Van Dykes. Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5760.8,"end":5763.52,"speaker":"Fr Stephen De Young","text":"In this universe, killing people is bad."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5764.4,"end":5764.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5765.04,"end":5766.84,"speaker":"Fr Stephen De Young","text":"Always has been, always will be."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5767.07,"end":5769.51,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5769.51,"end":5781.07,"speaker":"Fr Stephen De Young","text":"So this, these things are. And God is just revealing them and he's revealing them to humanity so that humanity as God's creation can flourish and live within God's creation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5781.31,"end":5781.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5782.83,"end":5798.12,"speaker":"Fr Stephen De Young","text":"By knowing about these things. Right. So again, this is revelation of what really is not commands given over a morally neutral field."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5798.6,"end":5799,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5801.4,"end":5861.39,"speaker":"Fr Stephen De Young","text":"Where you know, like, or you know, all your parents. Horrible rules when you're a teenager that you decide you don't have to follow as soon as you leave hope. Right. And then you turn 30 and it's like, wow, all of a sudden my parents are really smart and give good advice. Right. If they were giving good advice, it was good advice all along. So, yeah, so. So it's a question of these things being built into. Into creation. That's how Jubilees sees it. And so you have most of the content of the Torah, both in terms of feasts and in terms of particular quote unquote regulations, particular commandments concerning all kinds of things just sort of inserted into the narrative of Genesis as you go through it in the book of Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5862.83,"end":5863.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5864.03,"end":5889.71,"speaker":"Fr Stephen De Young","text":"Not in random places where they're inserted is relevant, but they're sort of back inserted into Genesis. And you're like, well, this is from Exodus, or this is from Leviticus, or this is from Numbers, or this is from Deuteronomy. Right. But the idea is that it's hardwired. It's built into the world. Right. And Moses has it revealed to them that, oh, here's where you could see it. You could see that it's built into the world."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5891.31,"end":5891.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5893.79,"end":5897.95,"speaker":"Fr Stephen De Young","text":"So that said, we now move to the second part of the second half."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5898.11,"end":5898.83,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5898.91,"end":5900.51,"speaker":"Fr Stephen De Young","text":"Or the second half of the second half."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5900.51,"end":5935.85,"speaker":"Fr Andrew Stephen Damick","text":"The lightning round. No. Yes. Yeah. This is the part where we talk about. Yeah, yeah. This is the part where we talk about the many places that the book of Jubilees is either. I think there's sort of three categories. There's traditions that Jubilees represents that are also referred to in the New Testament. Right. That aren't in the Old Testament. There's possibly references to the book of Jubilees directly. And then there's even more directly quotes from or things that are very close."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5935.85,"end":5941.05,"speaker":"Fr Stephen De Young","text":"To being quotes from language lifted from, if not quotes lifted from Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5941.05,"end":5961.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So there's things that Jubilees knows or says or however you want to put it, that the New Testament repeats, but that are not in the Old Testament and several of them are in the sermon that St Stephen gives as he's about to be stoned."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5962.29,"end":5963.81,"speaker":"Fr Stephen De Young","text":"There are a couple of places a."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5963.81,"end":5965.81,"speaker":"Fr Andrew Stephen Damick","text":"Saint important to both you and me."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5966.13,"end":5989.65,"speaker":"Fr Stephen De Young","text":"Yeah. There are a couple of places in the New Testament where you find sort of little clusters of references to these traditions and Jubilees, which is part of what I think justifies identifying them as traditions and Jubilees. Right. The fact that certain speakers and authors. Right. Make a bunch of references that seem to refer to things in Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5991.04,"end":5991.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5993.12,"end":5998.96,"speaker":"Fr Stephen De Young","text":"Even in some cases, in some relatively short texts. And then there are other places where you just find scattered references."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":5999.12,"end":6011.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And a number of them are like, I don't know, I don't want to call them unimportant details, but not super important details. Things that are not really. You wouldn't base doctrine on or anything."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6011.84,"end":6013.76,"speaker":"Fr Stephen De Young","text":"Like that if they weren't there. You wouldn't notice."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6014.56,"end":6030.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this is the kind of stuff that, frankly, until I was looking at this list, you know, when we were briefing the other day, I didn't really think too much about it myself. Like, oh, that's wait, that's not in the Old Testament stuff like, where was Jacob buried?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6031.69,"end":6133.51,"speaker":"Fr Stephen De Young","text":"Well, yeah, yeah. The details of it. So to frame this, and I really want to frame this with St. Stephen's speech, because this is one of the always like to take shots at biblical scholarship. So you would be hard pressed today to find a lot of people outside of maybe conservative evangelical scholars. You would be hard Pressed to find a lot of people who think that the words. The words, not the concepts or stuff, but the actual words of St. Stephen's sermon in Acts 7 have any direct connection to the person of St. Stephen, the historical person. Right. The best you would probably get is, well, you know, St. Luke is clearly in a lot of cases, summarizing, reconstructing. St. Luke wasn't there. So he's kind of reconstructing a sermon for. From St. Stephen based on certain things. Right. Maybe he talked to St. Paul who was there. Right. And St. Paul said, well, he talked about XYZ and St. Luke has reconstructed it. That's the best you'd get. The other end is just, oh, it's made up. Right. It has no connection to anything. Right. Frankly, most scholars now don't think. They like to contrast St. Paul's sermons and Acts with his epistles, the ones they accept are from him."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6133.83,"end":6134.43,"speaker":"Fr Andrew Stephen Damick","text":"Amazing."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6134.43,"end":6154.63,"speaker":"Fr Stephen De Young","text":"Right. So, but as we're going to see, we're going to talk about, just right off the bat, four places, four places in St. Stephen's Sermon in Acts 7 that reference traditions in the book of Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6157.76,"end":6158.08,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6158.08,"end":6164.48,"speaker":"Fr Stephen De Young","text":"And we're not going to have any other quotes from the book of Acts in our list of references."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6165.2,"end":6166.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's just this one spot."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6167.2,"end":6210.8,"speaker":"Fr Stephen De Young","text":"Right. Meaning Saint Luke or whatever you want to call the author. Right. If he's making this one up for St. Stephen and inserting this. Decided that St. Stephen would quote, would reference the book of Jubilees a bunch of times and that St. Peter, St. Paul, all the other St. Philip, all the other people whose speeches he recounts at the Book of Acts, would not at all. Right. What is the. More. Let's just Occam's razor. Right. As to why this one would be different in that regard than all the other ones."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6210.96,"end":6216.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That maybe St. Stephen was thinking about the book of Jubilees a lot or knew it very well."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6217.04,"end":6217.52,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6217.52,"end":6220.08,"speaker":"Fr Andrew Stephen Damick","text":"Or, you know, so it comes up."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6220.16,"end":6247.63,"speaker":"Fr Stephen De Young","text":"You know, who was a student of Galileo. Well, see, St. Paul, it is. It is. Sermons in Acts doesn't reference the book of Jubilees, but does in his Epistles. Right. So it seems to be just the most obvious explanation for this kind of thing that you find when you look at the text closely is this bears some connection to the historical St. Stephen and what he actually said that makes it different."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6248.19,"end":6250.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because different preachers have different emphases than."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6250.91,"end":6252.59,"speaker":"Fr Stephen De Young","text":"The other things being recounted."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6252.83,"end":6253.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6254.35,"end":6278.71,"speaker":"Fr Stephen De Young","text":"So that said. Yes. So one of these is in Acts 17, verses 15 and 16, where he references the burial of Jacob and Joseph and the patriarchs at Shechem, which is not actually recorded in Genesis or the Torah later, but is mentioned in Jubilees 46, verse 9."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6278.87,"end":6307.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's. You might think, okay, well, how. Why is that an important detail? Well, it's not super important. Like, there's no doctrine to base on this. Right. But remember, they're all in Egypt at that point, so the idea that they would get. All. Get taken back to be, you know, buried in some other place is an extraordinary action. You know, they didn't just stick them wherever they. The nearby cemetery or whatever. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6309.06,"end":6315.1,"speaker":"Fr Stephen De Young","text":"And St. Stephen's sermon in Acts 7, he's running through sort of the early history of Israel. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6315.1,"end":6315.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6315.5,"end":6348.4,"speaker":"Fr Stephen De Young","text":"So he's sort of running through the material that the book of Jubilees runs through. Right. And so what we see is that as he runs through those stories and runs through that material, he just throws in these details that are also in the book of Jubilees. Right. And doesn't. He doesn't pause and say, well, now, wait, guys, okay, this is just a tradition. This isn't actually in the Bible. But. Right. Like, he References Moses being 40 years old when he killed the Egyptian."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6349.76,"end":6350.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6350.12,"end":6372.79,"speaker":"Fr Stephen De Young","text":"In Acts 7:23, which is in Jubilees 47:10 through 12, he references Moses having spent 40 years in Midian in Acts 7:30, which is in Jubilees 48:1. And then probably the biggest one. And I say the biggest one because this not only is mentioned by St. Stephen, but this shows up two other places in the New Testament."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6372.87,"end":6373.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6374.23,"end":6379.38,"speaker":"Fr Stephen De Young","text":"Is St. Stephen's reference in Acts 7:53 to the law having been given by angels?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6380.33,"end":6392.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's explicit there. It's explicit in Jubilees. There is, I think, that there was some reference to God coming at Sinai with all of his holy ones or something like that, but it's not quite the same thing. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6392.81,"end":6400.01,"speaker":"Fr Stephen De Young","text":"Deuteronomy 32. And that's sort of. Yeah, that's a notoriously hard to translate passage. But anyway."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6400.01,"end":6416.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. It's not explicit that the law was given through angels in the Old Testament, although it is explicit in the New Testament and it's explicit in the book of Jubilees. And this is one big detail that gets. That's wrong in the Cecil B. DeMille."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6416.46,"end":6428.02,"speaker":"Fr Stephen De Young","text":"Movie, because not only does St. Stephen mention it in Acts 7:53, St. Paul mentions this in Galatians 3:19, and it's mentioned in Hebrews 2. 2."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6428.18,"end":6429.3,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6429.78,"end":6442.61,"speaker":"Fr Stephen De Young","text":"So this is repeated. And a Jewish friend of mine, when he looked at St. Paul saying, it got really mad about this, believe it or not."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6443.81,"end":6444.29,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6444.45,"end":6497.92,"speaker":"Fr Stephen De Young","text":"And said, oh, see, this is the New Testament trying to marginalize the Torah. What, by saying it was just given by angels and not by God. And finally, I had to say, dude, that's just the book of Jubilees, man. That just. Could you please? And he was kind of like, oh, oh, okay. So, but I mean, that's. It's not just that. That's not a detail mentioned in the Torah. Right. In. In. In the Old Testament. It's that. Right. That there. There are people who would even, you know, be offended by that idea. Right. Because they don't know where that tradition is from. Right. That's a tradition that's foreign to the Old Testament, but that is recorded in Jubilees, at least. Again, we can't say that comes from Jubilees because Jubilees probably received it from somewhere."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6498.16,"end":6499.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6500.32,"end":6525.36,"speaker":"Fr Stephen De Young","text":"Another little sort of mini nexus of references is in Second Peter, which is a pretty short text. Right. But we find three. Well, two references in a quote, frankly, in Second Peter. So Second Peter and Second Peter two, verse five refers to Noah, the preacher."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6525.36,"end":6531.2,"speaker":"Fr Andrew Stephen Damick","text":"Of righteousness, which again, read Genesis, everybody. To whom does Noah preach in Genesis?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6531.68,"end":6532.4,"speaker":"Fr Stephen De Young","text":"Nobody."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6532.72,"end":6534.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not. It's not there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6534.52,"end":6538.18,"speaker":"Fr Stephen De Young","text":"But he was righteous, but there's no. Nothing about him preaching."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6538.42,"end":6542.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. But if you go to Jubilee, St Peter says he was a preacher of righteousness."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6542.98,"end":6550.42,"speaker":"Fr Stephen De Young","text":"Right. Preacher of righteousness. If you go to Jubilees 7, verses 20 through 39, you not only hear about Noah preaching, but it's got one."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6550.42,"end":6552.94,"speaker":"Fr Andrew Stephen Damick","text":"Of his sermons there you go, like."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6552.94,"end":6563.94,"speaker":"Fr Stephen De Young","text":"Printed there, that he preached to people. Right. And then when 2 Peter 3, 13 talks about the restoration of creation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6565.54,"end":6565.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6565.7,"end":6590.98,"speaker":"Fr Stephen De Young","text":"The restoration of the created world, he uses language. Even if you don't want to say this as a quote, he uses language that's pretty clearly drawn from at least the same. Well, yeah, it's very reminiscent. Yeah. That if it's not quoted, if it's not a direct reference, it's definitely drawn from the same. Well as the book of Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6590.98,"end":6629.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So like in 2 Peter 3, 13, he says, but according to his promise, we are waiting for new heavens and a new earth in which righteousness dwells. Okay, that should be very familiar to everybody. So here's the passage from Jubilees, chapter 1, verse 29. This is not the whole verse, but from the day of creation until the day of the new creation, when the heaven and earth and all of their creatures shall be renewed according to the powers of heaven and according to the whole nature of earth until the sanctuary of the Lord is created in Jerusalem. Jerusalem upon Mount Zion. So probably not a quote, but definitely kind of a very similar thought. Although St. Peter says in a much briefer."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6629.85,"end":6633.05,"speaker":"Fr Stephen De Young","text":"Briefer pulling language of the new heavens and the new earth."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6633.13,"end":6634.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6635.13,"end":6671.97,"speaker":"Fr Stephen De Young","text":"And the dwelling of God. And then second Peter three, eight, folks may be familiar with St. Peter pointing out that one day is like a thousand years. He's not the first person to say that. That's in Jubilees 4, verse 30. And Jubilees may also not be the first person to say that, but that's the first place where we find it in Jewish literature. And again, when we see a little nexus like this in Second Peter of multiple things, seems to make a pretty good case that the author was familiar with the book of Jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6672.84,"end":6673.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6673.08,"end":6675.32,"speaker":"Fr Stephen De Young","text":"And was kind of drawing on that language."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6675.64,"end":6683.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Any one of them, you might say, well, it's kind of a coincidence, but like multiple close similarities like that in."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6683.04,"end":6684.36,"speaker":"Fr Stephen De Young","text":"A very short letter."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6685,"end":6686.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6689,"end":6707.05,"speaker":"Fr Stephen De Young","text":"So there are a couple of places where Christ seems to, I would say essentially quote. But at least draw on the language of. Or use the language of this first one, especially to me, I think is a quote, I would argue is a quote."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6707.05,"end":6750.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in. In Luke, chapter 1149, the Lord says, therefore also the wisdom of God said, which that's him. Therefore, also the wisdom of God said, I will send them prophets and apostles, some of whom they will kill and persecute. Again, very familiar for those who know the New Testament. And then Jubilees, verse 1, chapter 1, verse 12. So this is. This is right at the beginning of the book. And I shall send to them witnesses, so that I might witness to them, but they will not hear, and they will even kill the witnesses. And they will persecute those who search out the law, and they will neglect everything and begin to do evil in my sight. So again, a longer, longer in Jubilees, almost quote."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6751.29,"end":6757.13,"speaker":"Fr Stephen De Young","text":"Well, yeah, when I say that's a quote, you have to remember a bunch of things, right. Like St. Luke's gospel is written in Greek."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6757.69,"end":6758.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6758.33,"end":6761.37,"speaker":"Fr Stephen De Young","text":"And the translation of Jubilees we just read is from Ge'. Ez."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6761.77,"end":6765.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. And these are both into English. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6765.49,"end":6782.2,"speaker":"Fr Stephen De Young","text":"Right. It's also important to note, though, that, right, Christ says that in Luke 11:49, quoting the Wisdom of God. Right, the wisdom of God said this. Right. In Jubilees. It's the angel of the presence who says that. Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6784.12,"end":6826.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So another one, this is from John 14, verse 26. But the helper, the Holy Spirit, whom the Father will send in my name. He will teach you all things and bring to your remembrance all that I have said to you. Again, very familiar. And then Jubilees, chapter 32, verses 25, and then 26A, like 1H26, but you write down everything just as you have seen and read it. And Jacob said, oh, Lord, how will I remember everything that I read and saw? And he said to him, I will cause you to remember everything. So this is a very similar thought with a lot of the same words. You know, this is after."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6829.01,"end":6833.89,"speaker":"Fr Stephen De Young","text":"Jacob's vision at Bethel of the ladder to heaven."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6834.46,"end":6834.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6834.78,"end":6842.94,"speaker":"Fr Stephen De Young","text":"Or the cigarette, as we've talked about. So this is this encounter between him and God, that kind of an artificial mountain. Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6843.42,"end":6843.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6843.86,"end":6865.92,"speaker":"Fr Stephen De Young","text":"At the mountain. Right, yeah. And then St. Paul, interestingly, in second Corinthians 6, he's got. He gives, as St. Paul is wont to do. He'll give sort of a whole pile of scripture quotes, quotes from several different places, all in a row."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6866.48,"end":6866.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6867.44,"end":6885.04,"speaker":"Fr Stephen De Young","text":"Sort of a katana of quotations from different places. And at the end of his group of scripture quotes, there's a quote that really seems to be coming from the book of jubilees."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6886.24,"end":6910.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So 2 Corinthians 6, 18, he says, and I will be a father to you, and you shall be sons and daughters to me, says the Lord Almighty in Jubilees, chapter 1, verse 24. And their souls will cleave to me and to all my commandments, and they will do my commandments, and I shall be a father to them, and they will be sons to me."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6912.61,"end":6913.09,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6913.09,"end":6914.85,"speaker":"Fr Andrew Stephen Damick","text":"So again, very similar language."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6915.33,"end":6917.97,"speaker":"Fr Stephen De Young","text":"Right. And if you look in your English Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6919.1,"end":6919.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6919.82,"end":6981.53,"speaker":"Fr Stephen De Young","text":"Because your English Bible realizes that this is a list of scripture quotes. Right. So they'll have the references for the series of quotes. When they get to verse 18, they will reference that to 2nd Samuel, I think, 2 Samuel 7, to the covenant with David, where God says to David, I will be a father to you, and you will be a son to me in the singular. Just as sons, not sons and daughters says, I'll be a father, you will be a son to me. Talking about him being the king. Right. The king is the son of God. Right. Because they're trying to. They could tell St. Paul is quoting something here. Everything else is scripture. So they try to find something close. Right. But in Jubilees, it's in the plural. And like, the way St. Paul uses it, it's talking about everyone who keeps the commandments of God."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6982.97,"end":6983.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6983.41,"end":6985.37,"speaker":"Fr Stephen De Young","text":"Not talking about the king. And it's in the plural."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6985.93,"end":6989.45,"speaker":"Fr Andrew Stephen Damick","text":"Yep. So it's rather closer to Jubilees than."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":6989.45,"end":7030.31,"speaker":"Fr Stephen De Young","text":"So, yes. It seems more like he's quoting Jubilees just from certain points of view regarding the Bible. That would be highly problematic for him to quote that in a list of Scripture quotations. Not from mine, mind you, but from a lot of people's. Here's why it wouldn't be problematic. Just cards on the table. Here's why I don't think it's problematic. I don't think that is any more problematic for St. Paul than St. Stephen narrating through Genesis and adding these other things that aren't in Genesis. He doesn't feel the need to stop and say, okay, wait, this bit isn't in the Bible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7031.55,"end":7033.51,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7033.51,"end":7048.75,"speaker":"Fr Stephen De Young","text":"Because he has received the Scriptures within a greater body of tradition. The Scriptures have been handed down to him, so has a means of interpreting and applying and understanding them. And that's all of a piece. It's the same Thinging's true for St. Paul."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7049.15,"end":7049.99,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7049.99,"end":7093.95,"speaker":"Fr Stephen De Young","text":"So he doesn't feel the need to distinguish between what comes out of the text of Scripture and what is a traditional interpretation of it. So then there's a bunch of places where St. Paul just draws on language that we also find in the book of jubilees. So in 2nd Thessalonians 2 and verse 3, this is where he's talking about the man of lawlessness. Right. The coming Antichrist. We talked about this in our Antichrist episode, but one of the titles he uses to refer to the man of lawlessness, besides man of lawlessness, is the son of perdition. And in Jubilees 10, verse 3, the sons of perdition. That's a title that's given to the giants."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7095.55,"end":7100.03,"speaker":"Fr Andrew Stephen Damick","text":"Oh, by the way, there's giants, everybody. There's giants. Yeah, by the way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7100.99,"end":7101.87,"speaker":"Fr Stephen De Young","text":"Yeah, we'll get to."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7101.87,"end":7103.31,"speaker":"Fr Andrew Stephen Damick","text":"But more on that later."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7103.63,"end":7116.76,"speaker":"Fr Stephen De Young","text":"Yeah, there are giants in the book of Jubilees. Get excited. So in Galatians 2, verse 15, St. Paul makes the comment, we are not gentile sinners."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7117.48,"end":7117.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7117.8,"end":7130.28,"speaker":"Fr Stephen De Young","text":"That phrase, which seems kind of odd from St. Paul. Right. And that we don't find elsewhere in the New Testament, but you do find that in Jubilees 23, verses 23 and 24."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7131.08,"end":7133.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7134.04,"end":7135.72,"speaker":"Fr Stephen De Young","text":"One of the most telling ones."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7136.04,"end":7136.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7137.56,"end":7184.85,"speaker":"Fr Stephen De Young","text":"This was one that gives people fits and has spawned so many lousy journal articles. I mean, so many journal articles. A lot of them in jets, a lot of them in the Journal of the Evangelical Theological Society, is that in Galatians 3:17, St. Paul says that there were 430 years from Abraham to Moses. Why is that a problem? You might say, well, you go and add up the years in Genesis and Exodus, it's not 430 years from Abraham to Moses. In fact, if you go by Genesis and Exodus, The Israelites spent 430 years in Egypt."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7187.02,"end":7187.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7187.26,"end":7190.54,"speaker":"Fr Stephen De Young","text":"Abraham, of course, was, you know, century before that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7192.22,"end":7192.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7193.26,"end":7234.95,"speaker":"Fr Stephen De Young","text":"So, you know, nobody's going to say, oh, St. Paul made an oopsie. Right. Well, actually, that's not true. Most Old Testament scholars say St. Paul made an oopsie. Most biblical scholars just say, oh, St. Paul got that wrong. That's an error in the Bible. But obviously for certain people, as I mentioned, the Evangelical Theological Society, certain folks, their approach to the Bible won't let that sit. So they have to find a way to make that work. Up to and including. I've even read articles about this where they say St. Paul was right and Genesis and Exodus are wrong."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7235.35,"end":7235.83,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7237.19,"end":7242.82,"speaker":"Fr Stephen De Young","text":"Amazing that the text of Genesis and Exodus got corrupted somehow and St. Paul is correcting it yet."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7243.46,"end":7243.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7243.86,"end":7245.86,"speaker":"Fr Stephen De Young","text":"But it turns out, under the inspiration of the Holy Spirit."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7247.14,"end":7271.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It turns out that this number matches a passage in Jubilees, Jubilees 15:4. Now, this might be something where he's literally referencing Jubilees. He got it from Jubilees. But it may also be simply that, as we said, Jubilees represents. When it quotes the Scriptures, it seems to represent a separate Hebrew manuscript tradition than any other we know about."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7271.82,"end":7273.1,"speaker":"Fr Stephen De Young","text":"Yeah, that could be, too."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7273.42,"end":7275.34,"speaker":"Fr Andrew Stephen Damick","text":"So it could be that. It could be that. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7275.34,"end":7284.62,"speaker":"Fr Stephen De Young","text":"Yeah. But Galatians 3:17 seems to directly contradict Exodus 12:40. Right. But matches Jubilees 15, verse 4."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7285.98,"end":7287.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7290.54,"end":7294.38,"speaker":"Fr Stephen De Young","text":"I. First of all, all this dating stuff just makes my eyes roll back in my head."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7294.86,"end":7295.42,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7296.26,"end":7313.86,"speaker":"Fr Stephen De Young","text":"Boring. But also. Right. We've talked before on the show a bunch of times about numbers and numbers being preserved in texts in languages that don't have numerals. Right. St. Paul is referencing a tradition about the amount of time."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7314.9,"end":7315.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7315.46,"end":7321.7,"speaker":"Fr Stephen De Young","text":"And there were probably, as Father Andrew alluded to, there are probably Hebrew texts and Greek texts with all different numbers."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7322.22,"end":7332.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, we know this independently of all this. Like, if you compare the Old Greek to the Hebrew texts that we have, various numbers don't match."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7332.38,"end":7333.54,"speaker":"Fr Stephen De Young","text":"Numbers are all over the place."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7333.54,"end":7335.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, they don't. They don't match."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7335.9,"end":7420.56,"speaker":"Fr Stephen De Young","text":"Yeah. So. And then there's a couple of places where there's language used in the Book of Revelation that matches very closely with language used in Jubilees. One of those is in Revelation 1:6 and Revelation 5:10. God talks about making the church a kingdom and priests yes. Which is uncommon. Right. What you find in the Old Testament is a kingdom of priests, and that when it makes its way into Greek, is often read as a royal priesthood. Right. You can see how kingdom of priests, royal priesthood. Right. Same idea. But that's of not and. Right. Whereas Jubilees 16:18 uses the and conjunction. And then in Revelation 4, 5, 11, 19 and 16:18, I'm Jack Van Impiang it up again. It refers to the angels of the voices and of the thunder and of the lightnings. And these angels are referenced in Jubilees 2, verse 2."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7420.96,"end":7421.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7422,"end":7456.08,"speaker":"Fr Stephen De Young","text":"And not directly referenced in any of the canonical scriptures. So. Yeah. Revelation in general. We're going to see this someday when we talk about the Book of Enoch is a repository for a lot of Second Temple Jewish apocalyptic literature themes and that kind of thing, even from outside the Old Testament scriptures. And then just a couple of notes to finish out this half of this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7456.08,"end":7456.4,"speaker":"Fr Andrew Stephen Damick","text":"Half."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7458.32,"end":7474.72,"speaker":"Fr Stephen De Young","text":"Of the show. A couple of liturgical things. The There's a prayer that Noah says in Jubilees after the Flood."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7475.6,"end":7478.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we'll read the whole thing a."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7478.2,"end":7502.06,"speaker":"Fr Stephen De Young","text":"Little bit later, but later on. Yeah. We're going to come back to this. But that's a prayer about protection from demonic spirits for himself and his descendants. And it begins with oh, God of spirits and of all flesh, which if you've been to a memorial service in an Orthodox church, you may notice the central prayer of our memorial for the departed begins the same way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7502.46,"end":7503.02,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7503.66,"end":7523.27,"speaker":"Fr Stephen De Young","text":"And we also have in Jubilees 16, verse 30, our earliest known reference to crowning to the couple being crowned in terms of a wedding service. Pretty cool as a traditional practice at weddings."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7524.23,"end":7533.75,"speaker":"Fr Andrew Stephen Damick","text":"Nice. All right. Well, the lightning round is over, so we're going to go ahead and wrap up the second half. And we'll be right back with the third and final half of the Lord of Spirits."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7534.23,"end":7633.21,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls. On the next morning part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio. You've probably heard of St. Raphael Howawini, St. Alexander Horovitzky, liturgical translator Isabel Hapgood, and other righteous men and women who made their mark on the early development of Orthodoxy in America. But what about the notorious itinerant Bulgarian monk? Or Father Raphael Morgan, the first black Orthodox priest in America? Or Vera Johnston, who served the Orthodox Church without renouncing her Theosophist roots? Their stories and many Others, some edifying, some appalling, all entertaining. Make up the lost histories, histories of the early decades of Orthodox Christianity in the continental United States. Lost Histories, the Good, the Bad and the Strange in Early American Orthodoxy by Matthew Namie, out now@store.ancient faith.com Again, that is store.ancient faith.com. we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7633.85,"end":7638.01,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back. It's a good book, by the way, that was just advertised."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7638.09,"end":7643.72,"speaker":"Fr Stephen De Young","text":"And I have, I have a grievance. Oh, with Nae me's Nami's books. The subtitle."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7644.52,"end":7645.8,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7645.8,"end":7647.88,"speaker":"Fr Stephen De Young","text":"He references the Good, the Bad and the Ugly there."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7648.6,"end":7649.08,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7649.56,"end":7659.72,"speaker":"Fr Stephen De Young","text":"I'm willing to bet Lee Van Cleef is not even in that book. Charles Bronson maybe. Yul Brenner maybe. No, Lee Van Cleef."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7659.8,"end":7661.96,"speaker":"Fr Andrew Stephen Damick","text":"Yul Brenner was an orthodox Christian, by the way."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7662.28,"end":7663.4,"speaker":"Fr Stephen De Young","text":"So was Charles Bronson."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7664.12,"end":7666.2,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's right. He was Ukrainian. Is he."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7666.6,"end":7667.7,"speaker":"Fr Stephen De Young","text":"That's why they might be in the book."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7668.25,"end":7681.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah. If you, I just, just add a little extra on my YouTube channel, you can actually see me interview Matthew about the book and he tells some of."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7681.69,"end":7683.61,"speaker":"Fr Stephen De Young","text":"The Here comes the shameless self promotion."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7683.61,"end":7687.33,"speaker":"Fr Andrew Stephen Damick","text":"That are in it. Yeah, exactly. Hey, I'm the Stan Lee of click."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7687.33,"end":7692.57,"speaker":"Fr Stephen De Young","text":"Like and subscribe everybody and hit that bell. Get notifications when he drops a new video."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7696.26,"end":7715.3,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, we're talking about the Book of Jubilees. And now we're going to talk about in more detail some of the contents directly. Not just quotes that are found in other things or references, whatever, but actually some of the direct contents of what you can find in the Book of Jubilees. So this is sort of a preview and again, I recommend everybody read it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7715.46,"end":7718.26,"speaker":"Fr Stephen De Young","text":"Surprised nobody is called in about all these shocking revelations."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7718.34,"end":7720.31,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know. Well."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7720.71,"end":7722.47,"speaker":"Fr Stephen De Young","text":"Or to argue with me about something."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7724.15,"end":7726.31,"speaker":"Fr Andrew Stephen Damick","text":"They're all just listening in rapt attention."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7726.55,"end":7737.35,"speaker":"Fr Stephen De Young","text":"So no, they're all going to go talk smack on social media because they know I'm not there. Cowards call in and fight me anyway. He does. He does read it all."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7737.51,"end":7751.8,"speaker":"Fr Andrew Stephen Damick","text":"That's right. He's wandering around looking for someone to debate. Yeah. Yes. So, okay, so it's a vision given to Moses. It begins with the creation. Big shock."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7751.8,"end":7753.92,"speaker":"Fr Stephen De Young","text":"Yes. Because it's going through Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7754.56,"end":7755.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7755.2,"end":7780.27,"speaker":"Fr Stephen De Young","text":"Yeah. So what we're going to go through in this third half, and unlike the third half of Thomas Aquinas is summa. This is actually going to be us. It would have been a funny joke that three people would have gotten if, like, you and I had left for the third half and someone had just tried to do the third half on their own. From our notes, anyway."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7781.31,"end":7783.35,"speaker":"Fr Andrew Stephen Damick","text":"A little too subtle for most people, I think."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7783.35,"end":7803.59,"speaker":"Fr Stephen De Young","text":"Yes. Too subtle for the Western mind. So we're going to be really going through in this third half. We're obviously not going to be able to. Because. Come on, people, you've heard whole Council of God, like, if I tried to go through the book of Jubilees at detail, we'd be here for weeks, right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7803.59,"end":7807.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is some highlights. Not even all possible highlights."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7808.26,"end":7841.06,"speaker":"Fr Stephen De Young","text":"Things that are interesting to me, supplemented by things that are interesting to Father Andrew. That's exactly what I get here from the book of Jubilees. Exactly. So within the creation account. Right. Within that story, in the story of paradise, of the Garden of Eden. Just some interesting details. Interesting to me, as we've talked about before, Jubilees, like everything else. Oh, by the way, everything else except."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7841.06,"end":7853.1,"speaker":"Fr Andrew Stephen Damick","text":"Milton, I should say. We've gotten a reaction on YouTube about the fact that no one's called. One person says, actually, I think this is from a priest. He says, I'm too shocked to react."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7853.66,"end":7854.94,"speaker":"Fr Stephen De Young","text":"So that's possible."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7855.91,"end":7856.47,"speaker":"Fr Andrew Stephen Damick","text":"There it is."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7856.71,"end":7858.71,"speaker":"Fr Stephen De Young","text":"People are just in abject horror."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7859.27,"end":7862.95,"speaker":"Fr Andrew Stephen Damick","text":"That's right. So."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7865.11,"end":7896.19,"speaker":"Fr Stephen De Young","text":"Like everything else except Milton, the book of Jubilees does not have angels being created and. Or falling before the creation of the world. In Jubilees, they are created on the first day. And as we talked about before, the first day and the fourth day are the most common in second temperate literature and the Church Fathers. Sometimes you also get the second day, interestingly. But usually the first day or the fourth day."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7896.51,"end":7904.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, first day is obvious because it's, you know, the formation of light and stars and, you know, this kind of stuff."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7905.23,"end":7906.27,"speaker":"Fr Stephen De Young","text":"Well, light start."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7906.27,"end":7908.19,"speaker":"Fr Andrew Stephen Damick","text":"Light, yeah, light, Light. Sorry, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7908.19,"end":7933.77,"speaker":"Fr Stephen De Young","text":"That for the fourth day is the stars start. So that's good. You know, those days are connected and everything. There are some interesting details. When. When woman is created. She wasn't named Eve yet immediately after the story of her creation. From Genesis, it gives the commandments regarding a woman's purification after childbirth."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7937.85,"end":7938.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7938.25,"end":7940.49,"speaker":"Fr Stephen De Young","text":"So this is one of those inserts we were talking about."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7941.11,"end":7943.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which there's no babies yet."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7943.59,"end":7947.19,"speaker":"Fr Stephen De Young","text":"Yeah, Right, right. We're nowhere near Cain being born."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7947.83,"end":7948.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7948.19,"end":7990.06,"speaker":"Fr Stephen De Young","text":"We're nowhere near her getting pregnant, let alone giving birth. But this is brought in. These commandments are brought in and put here so, as I mentioned, this is a good test case. I mentioned it's not accidental where the author puts these things. This is part of how he communicates. And what he's doing this to communicate is in part his interpretation, which we've also given before on this show, of what's going on with the creation of woman, specifically with what it means when God says it is not good for man to be alone. Right. Our very modern psychological, individualist interpretation of this is, oh, Adam was lonely. He didn't have anyone to talk to."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7990.3,"end":7990.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7990.62,"end":7994.15,"speaker":"Fr Stephen De Young","text":"He named all the animals, but animals can't talk."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7995.03,"end":7995.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":7995.39,"end":8007.19,"speaker":"Fr Stephen De Young","text":"Well, we're going to find out that's not true either, but. Right. But even thinking about just in the biblical text all by itself, Right. He was with God."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8008.47,"end":8011.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8011.51,"end":8016.07,"speaker":"Fr Stephen De Young","text":"God is there, the angels there. Why would he be lonely?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8016.71,"end":8017.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8017.83,"end":8019.35,"speaker":"Fr Stephen De Young","text":"This is not a psychological thing."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8019.55,"end":8024.03,"speaker":"Fr Andrew Stephen Damick","text":"I say, are you going to say God wasn't enough for him? I mean, come on."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8024.03,"end":8034.59,"speaker":"Fr Stephen De Young","text":"Right. He's. It's not good that he's alone. Is referring to the fact that all of the plants and animals that God created were reproducing after their kind."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8035.15,"end":8036.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8036.35,"end":8083.81,"speaker":"Fr Stephen De Young","text":"The zebras were making more zebras. The elephants were making more elephants. The oak trees were making more oak trees. Adam couldn't make more Adamses. You couldn't make more humans. This is why woman is created, so that together they can make more humans. And so talking about childbirth right after that is a way of conveying that emphasis and that interpretation. There's another interesting detail that's given in that same context, and that's that Adam, according to Jubilees, was in the land where he was created for 40 days before he was brought to Eden."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8084.45,"end":8097.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, in Genesis it does say that God created them and then put him in the garden. So, like there's this chronological order works, but you get this other detail of he was 40 days outside of Eden and then he's brought in."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8098.05,"end":8114.3,"speaker":"Fr Stephen De Young","text":"And what's that about? Well, we talked about back on the Lent episode Most recently, that 40 days represents a period of purification and preparation. Right. So he was being purified and prepared after his creation to enter into Eden. To enter into the presence of God."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8115.58,"end":8117.74,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8118.22,"end":8122.14,"speaker":"Fr Stephen De Young","text":"And this has deliberate, like, priestly overtones."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8123.26,"end":8125.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8128.38,"end":8133.46,"speaker":"Fr Stephen De Young","text":"And Right. Is related to the idea of Eden as temple."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8134.18,"end":8134.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8137.86,"end":8151.78,"speaker":"Fr Stephen De Young","text":"And it also gives chronologically, says that man and woman were in paradise for seven years before the expulsion from paradise."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8151.86,"end":8154.02,"speaker":"Fr Andrew Stephen Damick","text":"A number of perfection, you know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8154.02,"end":8161.07,"speaker":"Fr Stephen De Young","text":"Right. It's one Sabbath of years. Right. One Sabbath year, these cycles."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8161.07,"end":8161.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8161.43,"end":8192.11,"speaker":"Fr Stephen De Young","text":"So that's like the first seven years they're in paradise when it's going through the expulsion from paradise and the curses that are placed on them. It says regarding the serpent and only the serpent. God says that he will be angry with him forever or his wrath will be on him forever."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8192.59,"end":8193.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8193.63,"end":8195.07,"speaker":"Fr Stephen De Young","text":"Not man or woman."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8196.03,"end":8197.87,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8200.75,"end":8213.08,"speaker":"Fr Stephen De Young","text":"Immediately after he's expelled from Paradise, Adam offers a sacrifice. And the sacrifice he offers is a morning incense offering."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8214.36,"end":8216.12,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Celebrating Orthros."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8216.6,"end":8249.25,"speaker":"Fr Stephen De Young","text":"It lists the type of incense that he burns. Right. And of course, this is again, the first commandment in Exodus about the worship of God is the offering of incense at morning and evening. Right. So this is pushed backward. Adam starts this as soon as he's out of paradise. Right. This cycle of worship starts this daily cycle of worship. It's also mentioned there that when they're expelled from paradise, all the animals lose their ability to talk. Before that, apparently, they could all talk."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8249.49,"end":8258.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They've ruined Narnia. And it's interesting, you know, Adam offering incense, I mean, that's a very sort of priestly. Priestly thing to do, you know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8258.69,"end":8261.41,"speaker":"Fr Stephen De Young","text":"Right, yeah. Well, he's the man. That's his job."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8261.65,"end":8263.33,"speaker":"Fr Andrew Stephen Damick","text":"He's Right, exactly."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8265.94,"end":8305.98,"speaker":"Fr Stephen De Young","text":"So, yeah. And so the whole thing with animals not talking, this isn't supposed to be a Disney thing or whatever. Dr. Dolittle has lost his powers. That's a way of representing the fact that after the expulsion from paradise, man is sort of alienated from the rest of the creation. So that being able to converse with a cow is like an image of. Right. Man is connected. Right. To the rest of creation. There's this cooperation. Right. Whereas after the expulsion, now animals become dangerous to humanity."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8306.3,"end":8306.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8308.06,"end":8328.36,"speaker":"Fr Stephen De Young","text":"There's this separation and alienation and breaking of relationship with creation. On the. At the time of the creation of the angels, on the first day, the angels get assignments."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8329,"end":8329.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8329.48,"end":8331.56,"speaker":"Fr Stephen De Young","text":"Which angels get assigned to all kinds of stuff."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8331.88,"end":8380.61,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which. Which there's, you know, in the Bible there are kind of references to this. It's just sort of assumed. And often you get it like in lists in the Psalms where David or whoever's writing the psalm talking to the angels and then. And then, by the way, starts mentioning elements of creation that, you know, like in the same list as. As though they're all kind of one group, you know, and you get stuff like that. But in. In Jubilees, it's made explicit. So when they're created, God makes them and then sets them over different things. So I'm going to read that passage because I Think it's just really interesting. And this. This then connects us back. We. We mentioned earlier those references in the Book of Revelation. Angels of the voices and the thunder of the lightnings."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8380.61,"end":8380.89,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8381.61,"end":8439.36,"speaker":"Fr Andrew Stephen Damick","text":"So this is where that comes from. This is Jubilees2.2. For on the first day, he created the heavens which are above, and the earth and the waters and all of the spirits which minister before him. The angels of the presence and the angels of sanctification and the angels of the spirit of fire and the angels of the spirit of the winds and the angels of the spirit of the clouds and darkness and. And snow and hail and frost, and the angels of resoundings and thunder and lightning. There's that thing that's referenced in Revelation. And the angels of the spirits of cold and heat and winter and springtime and harvest and summer, and of all. And all of the spirits of his creatures which are in heaven and on earth. So it's notable, among other things, that there are angels in charge of each of the four seasons and, as I have said, occasional public speaking engagements, if I ever get to meet."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8440.72,"end":8445.2,"speaker":"Fr Stephen De Young","text":"Are the angels in charge of the hotel or of that landscaping service?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8446.88,"end":8455.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, some of both. Who is the patron angel of landscapers? Call in."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8457.52,"end":8459.28,"speaker":"Fr Stephen De Young","text":"No racist answers, please."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8459.71,"end":8493.72,"speaker":"Fr Andrew Stephen Damick","text":"No, yeah, no, no, come on. Yeah, yeah, we do have a caller, actually, but we'll see what this caller has to say. But, yeah, so there's a. There's. You know, I. I would. If I ever get a chance to speak to the angel of Autumn, I would say, look, number one, I love your work. You're the. Don't tell the other ones, but you're the best seasonal angel. And number two, the question I have is, is, you know, pumpkin spice lattes. Is that your idea, or is it some kind of twisting of the original deposit of goodness of autumn? So, yeah, let's find out what our caller says about this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8493.72,"end":8495.4,"speaker":"Fr Stephen De Young","text":"Well, wait, I can answer that second question."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8495.48,"end":8496.28,"speaker":"Fr Andrew Stephen Damick","text":"Oh, can you?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8496.84,"end":8520.72,"speaker":"Fr Stephen De Young","text":"Yes. I think pumpkin spice is the evidence that that angel is fallen. Like, when we get to the Book of Enoch, we'll find out, like, each of the watchers communicated this secret, terrible knowledge to the women they seduced. And somewhere there is a white woman who was seduced and given the terrible secret of pumpkin spice. Wow."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8521.28,"end":8535.08,"speaker":"Fr Andrew Stephen Damick","text":"See, this may be the thing that finally gets you canceled, Father Steve. All right, well, we do have a caller. So we have Gregory calling from Florida, I believe. So, Gregory, welcome to Lord of Spears."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8535.08,"end":8538.81,"speaker":"Gregory","text":"Podcast, and thank you for bringing me on."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8539.13,"end":8541.37,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, Proverbial Florida man."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8542.49,"end":8542.93,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8542.93,"end":8545.85,"speaker":"Gregory","text":"Well, no, I'm A transplant. I'm in the military, so I got put here."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8546.25,"end":8547.53,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh. Oh, well."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8547.53,"end":8565.59,"speaker":"Gregory","text":"So in. In regard to the angel of Autumn, I would have to say, firstly, that why does he have favorites? Because he definitely doesn't visit here. And secondly, the whole pumpkin spice thing, that's got to be that, like, ancient wisdom from before the flood that people are trying to rediscover, discover through technology, because, like, you can't make that without a machine, you know?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8567.11,"end":8572.59,"speaker":"Fr Stephen De Young","text":"There you are. See, he's on my side. I'm not taking a side here."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8572.59,"end":8573.19,"speaker":"Fr Andrew Stephen Damick","text":"I'm just asking."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8573.19,"end":8576.87,"speaker":"Fr Stephen De Young","text":"You controls the pumpkin spice, controls the white women. That's all it is. Wow."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8577.99,"end":8578.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8578.31,"end":8579.03,"speaker":"Gregory","text":"It has a point."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8580.87,"end":8582.67,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so, Gregory, what."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8582.67,"end":8583.59,"speaker":"Gregory","text":"So when it comes to."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8583.59,"end":8584.39,"speaker":"Fr Andrew Stephen Damick","text":"What is your question?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8584.47,"end":8632.23,"speaker":"Gregory","text":"When it comes to time and the experience of time of ours being kind of based on ourselves, you know, we base our experience on ourselves. And I'm wondering. So far I've gotten the understanding that God is outside of that, but I'm still really kind of shaky and unsure about, like, saints and the departed and angels and demons specifically, and, like, let's say, other worshiping groups. This is kind of a broadening. It may be too much. But you look like people like the new whole Norse pagan movement, right? Like, when they participate in rituals that sort of reenact times that are long since passed. Is it just not working? Is it. Are they doing something similar? Is this a valid question?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8634.31,"end":8766.16,"speaker":"Fr Andrew Stephen Damick","text":"All questions are valid or validly asked anyway. Yeah. I mean, well, ritual works, right? It's. I mean, some, of course, are kind of lame and made up, right? But if they're done in seriousness, and especially if there is. Especially if there's some kind of spirit that wants to be involved, there is a thing happening, you know, so if. If a Norse neo pagan wants to sacrifice to Thor and then eat that food, there's no reason a demon won't show up and want to be part of that, you know, because demons desire us to drag us down into their darkness. And, you know, the worshiper may understand himself as participating in something related to Norse paganism, but the point is not. Is he, like, participating in Ragnarok, you know, Although I hate to imagine what that sacrifice would look like. But, you know, that's not the point. The point is, you know, what does it mean to participate in these realities, right? So for a Christian to participate in the Eucharist, we receive the benefits of Christ's death and resurrection, right? That's what it means to participate in the Eucharist, you know, for. For A pagan to participate in demonic stuff. It's about communion with those demons. Whatever the narrative packaging that goes in that, that, that's put into, that's put in. Right. So I mean that, that is the reality. And certainly, you know, spiritual beings function in a trans. Temporal way. You know, they don't experience time and space the way that we do. We don't know exactly what it's like because we don't even know what it's like to be a flying mammal so much, much less a demon, you know, or an angel. So that's what I think about that. I don't know. Father Stephen, what do you have to say to Not Florida man?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8766.48,"end":8852.31,"speaker":"Fr Stephen De Young","text":"Yeah, so I mean. Yeah, in keeping with what Father Andrew said, we have to keep in mind that most modern pagans are trying to participate in these spiritual realities in like the most soy way possible. And I mean that somewhat literally because a lot of them are vegans, you know, like they're not going to sacrifice a horse and drink its blood. Okay. You want to be a Norse pagan. That's step one. Okay. If you can't do that, if you can't kill a horse, you're right out. Sorry, ladies. Yeah, that's not pumpkin splice horse blood. It's just straight up horse blood. So I mean, there we have to distinguish that kind of larping from like those black metal musicians in Scandinavia who are like legit burning down churches and you know, killing each other and you know, participating in actual ritual sacrifice of things. Right. That's not to say that the larping and stuff is harmless. Right. As Father Andrew said, you know, even the kind of dumbest and lamest things like that, there's some demon willing to try to take advantage of that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8852.31,"end":8852.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8854.95,"end":8925.92,"speaker":"Fr Stephen De Young","text":"Even though it's not as clearly demonic as some of those other examples. But yeah, it's. Yeah, at most. Right. They're kind of building a community with those demonic spirits and those demonic spirits are shaping them. The more intense, I mean, just like we would say with Christianity, right. The more intensely you actually follow the Christian way of life, the more you're going to be transformed by it. Right. The same thing's true on the other side. Right. There's difference between someone who identifies as a pagan and someone who's deeply participating in actual pagan rites. And you can see that in the behavior of people. Right. And the way in which they are transformed by those. By those things. But the things that they're participating in, they're participating in these spirits, these demonic spirits and their qualities or attributes are shaping them. But obviously those demonic spirits are alienated from eternal realities."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8927.76,"end":8928.16,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8928.88,"end":8957.06,"speaker":"Fr Stephen De Young","text":"That's why they can't grant any kind of eternal life because they don't really have it. They're disconnected because the only truly eternal reality is God. Right. And they're alienated from him. And so that's why going down that road just brings destruction. You don't become an eternal evil, you just find destruction."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8957.87,"end":8958.11,"speaker":"Announcer","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":8960.59,"end":9110.72,"speaker":"Fr Stephen De Young","text":"There's not sort of equal parity. And in terms of the experience of time, I mean, we'll do more episodes on this in the future. We need to do one where we talk about the way our experience of time is related to memory because that is deeply our, our memories. So there have been studies recently, for example, we tend to think, and I have even tended to think in the past, that, you know, time seems to go faster and faster as you get older. You're probably not as old as me, but maybe you've already experienced that a little bit. And I always kind of thought that was because, well, when you're five years old, like one year is 20% of your life. And when you're 50 years old, one year is 2% of your life. And so it just seems quicker, Right? That was my thought. But studies have actually shown that St. Augustine was right in books 10 and 11 of the Confessions. And our whole conception of time is experience of time is deeply tied to our memory. And that the reason time seems to go so much more slowly when we're young is that we're constantly having new experiences. And the fact that we're constantly having new experiences means we're constantly forming new memories. Memories. Whereas by the time you're an old man like me, your life has kind of fallen into this consistent cycle of the same things over and over again every day. Right. And so you're not forming these new memories at the same rate because the experiences are not as new. Right. And so the things kind of blur together and that causes time to seem to move more quickly. And then if you actually deliberately go out of your way, this is part of the studies, like if you just said, I'm going to take a two week vacation every day, I'm going to do something I've never done before or go somewhere I've never gone before, that two weeks would seem really long to you, even looking back on it later because of all the new memories that you form. But so anyway, at some point in the future we'll do an episode about our experience of time where we talk about that link with memory. Maybe explore what Saint Augustine says about it. I was gonna say Saint Augustine's. I appreciate your way of working that out is actually still in philosophy, is still basically what everybody uses."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9111.84,"end":9112.64,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9115.12,"end":9136.15,"speaker":"Gregory","text":"That's exciting. Again, the new experience notion of. I've kind of been touching into that with my newborn son, but I've not really formulated that. That notion all the way yet. And as far as the whole Norse pagan thing goes, I really don't often run into them. But in the military, you do see a fair enough amount because they all want to have beards and they don't let us have beards. Unless you're a Norse pagan. But I guess the."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9136.71,"end":9138.63,"speaker":"Fr Stephen De Young","text":"I'm a Sikh, I swear, was the."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9139.51,"end":9160.22,"speaker":"Gregory","text":"The idea of sacrificing a horse versus a pumpkin spice latte and calling it blood is like sort of like us calling, like something. A pleasing aroma before the Lord in the Old Testament versus, like strange incense for Lord, like, to them, to these demons. It's like a pumpkin spice latte, really my flavor. I prefer, you know, human blood or something like that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9161.9,"end":9167.82,"speaker":"Fr Stephen De Young","text":"Well, yeah, yeah. It's a question of, you know, how far and how fast you're going down the same road."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9168.54,"end":9168.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9168.86,"end":9177.16,"speaker":"Fr Stephen De Young","text":"It's the same road, but there are people who are kind of dabbling and tiptoeing and there are people who are just running in that direction."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9178.2,"end":9178.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9180.28,"end":9181.96,"speaker":"Gregory","text":"Thank you so much for taking my call."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9182.2,"end":9188.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, thanks for calling, Gregory. So we actually do. Now suddenly we're getting people calling. So I guess people are inspired here."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9188.68,"end":9190.76,"speaker":"Fr Stephen De Young","text":"Are they angry white women based on my comments?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9191,"end":9192.36,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I don't know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9192.36,"end":9194.36,"speaker":"Fr Stephen De Young","text":"Calling from a Starbucks inside a Target?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9194.68,"end":9208.28,"speaker":"Fr Andrew Stephen Damick","text":"Well, we'll find out, but our. Our next caller is Maureen. So, Maureen, welcome to the Lord of Spirits podcast. Are you here to ream Father Stephen out? Marine, are you there?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9210.04,"end":9211.8,"speaker":"Fr Stephen De Young","text":"Speak to us, Maureen. Who did this to you?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9214.76,"end":9216.4,"speaker":"Maureen","text":"Yeah, because I was."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9216.4,"end":9217.16,"speaker":"Fr Stephen De Young","text":"Oh, there we go."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9218.28,"end":9220.44,"speaker":"Maureen","text":"Oh, you. You can hear me now. Oh, good."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9220.44,"end":9222.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, yes, welcome."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9223.96,"end":9345.3,"speaker":"Maureen","text":"I. I missed a little bit of the last few minutes because I was in the process of making the connection here, and I'm on my phone and listening through my phone too, while you were talking about the pattern of the different Judaisms. And I heard this before, but it suddenly dawned on me that the many threads or. Or rivers or whatever in the society then we sort of have the same pattern today in our modern society in a number of different ways. And I thought about my. I thought about my cultural enlightenment paradigm of looking at the world and pseudo scientific. There must be A right answer. And it dawned on me, and this may need correction, is there maybe not a right answer because we're talking about things above our pay grade, I guess you'd say. And maybe it's theologuma or whatever you call it, or something along the Western mystics like Julian of Norwich or St John of the Cross, where it inspires us to lift our hearts to God and be open to new insight without being sure that it's absolutely correct or whatever, or foreign. I'm sorry, this is very foggy, but my thoughts are foggy. I'm trying to sort them out."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9345.94,"end":9431.79,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so, so one of the things that you said that I, hopefully I understand this correctly, you talked about, you know, patterns of behavior that are. In the ancient world that seem to be repeating even now. Right. That. That human society still kind of works in a lot of the same ways. And I mean, I, I definitely think that that's true. Certainly there's big differences. There's a huge difference, for instance, between the ancient world dominated by paganism and the modern world deeply influenced by Christianity everywhere. But nonetheless, people are still people. We're still sinners. We still commit the same kinds of sins, basically. And so even though they get expressed in different ways within different cultures, I mean, definitely humans are humans. Right. And, and also above us or beneath us or beside us, whatever, you also have spiritual beings who are influencing us. Right. And they, they're still around. It's the same, you know, the same bunch influence us in one way or another. So, yeah, there definitely are patterns that one can see kind of repeating throughout history individually in humans and then in humans as groups as well. I mean, that's, that's the, the bit that I would respond to of what you said. Does that. Is that helpful at all?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9432.67,"end":9483.06,"speaker":"Maureen","text":"Well, it is in a way. It's helping me articulate what I'm trying to say. But I've got the, the training in the Enlightenment paradigm that says there must be a right answer and follow the science and all that stuff, which is actually scientism, not real science, but in order to grasp all the, the wonderful. I, I love this stuff. It's really cool. I do wonder if we aren't looking for answers, we're just looking for some spiritual insight that might mean something to us without necessarily having the full facts because we're mere human beings and we can't know that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9486.74,"end":9487.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9487.14,"end":9488.66,"speaker":"Fr Stephen De Young","text":"So, yeah, let me."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9488.66,"end":9489.86,"speaker":"Fr Andrew Stephen Damick","text":"Go ahead, Father. Yeah, go ahead."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9489.94,"end":9495.38,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah, I think I get what you're getting. We have a tendency as modern people."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9498.18,"end":9498.58,"speaker":"Fr Andrew Stephen Damick","text":"To."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9500.82,"end":9827.93,"speaker":"Fr Stephen De Young","text":"Want to know things in kind of an external way, right? We've talked before the show that there are multiple ways of knowing and modernity kind of only has one. It wants to turn everything into a science, right? Mathematics based science is the only way to really know things. And people even approach religion that way, right? Sometimes people who inquire into the Orthodox Church, who I talk to approach things in that way. They're sort of like, well, I'm interested in the Orthodox Church, but I don't know about topics X, Y, Z, A, B, C. Right? And they sort of want me to kind of argue them into believing what the Orthodox Church teaches is the right answer about xyz, abc. And then if I give arguments and explanations that satisfy them, then they'll say, oh, okay, I'll join the church. And then I'll tell them to wait a year. And they won't get why, right? They'll be like, no, I'm ready. I decided, right? And you can't really know very much, at least very much that's worth anything that way in that external way, because you don't get any wisdom that way. You can't explain this to anyone under 25. Sorry, guys, I know some of you are very mature, but when I was under 25, right, I thought I knew everything from reading books, right? And therefore I knew everything. And I was smarter than other people and, you know, things they didn't know. And I realized at a certain point that pretty much everyone older than me actually knew more than I did, but they knew it in a way that I didn't have access to because I hadn't lived much yet. The way that we come to know God, not know about God, you know, you can, you can read books that will say things about God, some of which will be more true than others, but none of which will actually let you know God any more than reading a thousand magazines articles about a celebrity will cause you to actually know the celebrity. You'll just know a bunch of things about them that are more or less true. The way you come to know God is by living with God, right? So the way we come to understand and to know spiritual things is not by reading about them or learning them or having them demonstrated or proven to us, but by living them. And that means entering into a way of life, the kind of cycles and patterns that we've been talking about tonight in the book of Jubilees, structuring our life around God, right? And around these cycles, all of which bring us into his presence, bring us into contact with him over and over again and shape our lives. And as we do that, and as we do that, over time, we start to understand these things. And even. Even in the case of, like, xyz abc, you can talk to folks in my parish, I'm sure in most other Orthodox parishes in the United States who came into the Orthodox Church from outside, right? You'll find plenty of people who. I didn't get that whole Mary thing and da, da, da, da, da, Right. And. And maybe they wanted somebody to argue them about it. They wanted to read 20 books about it, whatever, when they were coming into the church. But what they'll actually tell you is after two years, three years, four years, five years of being Orthodox, it just clicked one day. I just got. Just made sense, right? People don't believe things. People don't hold on to ideas or have ideas or produce ideas because they're true. If that happened, no one would ever be wrong about anything. Ideas become believable because they become useful in explaining our experience and in structuring our lives. So if you're living a very modern, very worldly, different way of life, then there are tons of things that the Orthodox Church has to teach you that you will never understand from outside. You can only understand them once you become a part of them. Because being part of the community and its way of life and those rhythms and those cycles will shape you until they just. They make sense because you kind of lived. So I think, yeah, we need to get away from what we've been taught in terms of enlightened modernity about, you know, I understand, therefore I can believe. I understand, therefore I can be faithful. Right? And get Back to. Here's St. Augustine. I'm saying all these nice things about St. Augustine. All of a sudden what St. Augustine actually said, which is, I am faithful so that I will understand."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9833.05,"end":9836.41,"speaker":"Fr Andrew Stephen Damick","text":"Well, Marine, I hope that that helps a little bit."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9838.13,"end":9848.61,"speaker":"Maureen","text":"A little bit. I hope that my floundering around and your excellent insights will be a benefit to others besides me and my foggy brain."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9849.09,"end":9852.37,"speaker":"Fr Andrew Stephen Damick","text":"May it be blessed. May it be blessed. Thank you very much for calling."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9852.77,"end":9854.05,"speaker":"Maureen","text":"Christ is risen."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9854.29,"end":9869.88,"speaker":"Fr Andrew Stephen Damick","text":"He truly is risen. All right. Pumpkin spice. You know, you didn't even say where people should send their hate mail. I'm kind of surprised, Father."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9870.04,"end":9873.4,"speaker":"Fr Stephen De Young","text":"Oh, yeah, that's fatherandrewantfaith.com."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9873.48,"end":9874.52,"speaker":"Fr Andrew Stephen Damick","text":"That'S right. Thank you."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9875.24,"end":9881.56,"speaker":"Fr Stephen De Young","text":"I had them sending you something else, by the way. It's coming up whole Council of God here. In a couple of months, you'll get some."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9881.56,"end":9892.44,"speaker":"Fr Andrew Stephen Damick","text":"Oh, great. I look forward to it. Right, okay, so angels in charge of various things. What else we got in terms of fun details from the scroll, please."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9892.95,"end":9899.11,"speaker":"Fr Stephen De Young","text":"We get, we get an explicit almost screed about the calendar when it talks about actual Enoch."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9899.83,"end":9900.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9902.47,"end":9981.26,"speaker":"Fr Stephen De Young","text":"We've talked about before on the show. Enoch, of course, is the seventh from Adam, as we're reminded by St. Jude. Not coincidentally, the seventh figure in the Sumerian kings list creates the calendar. Not coincidentally, Enoch is said to have lived 365 years. So there is this deep association in the text of Genesis itself, when you understand it in the ancient Near Eastern context with the cat, with a calendar, a solar calendar. But here at Jubilees, that's made explicit about the 364 day Enoch calendar. Expressly the 364 day calendar and the dangers of not following the 364 day calendar that was revealed through Enoch to the world. And again, this is a revelation, right? So book of Jubilees sees that calendar as being the actual structure of a year, right? As God created a year which is being revealed to us through Enoch, but is built into, built into creation. And then once we get a little closer to Noah, we get Mastema."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9981.42,"end":9985.66,"speaker":"Fr Andrew Stephen Damick","text":"All right. I mean. Oh yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9985.98,"end":9988.14,"speaker":"Fr Stephen De Young","text":"Not everybody's favorite devil figure."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9989.66,"end":9994.7,"speaker":"Fr Andrew Stephen Damick","text":"He's a really interesting devil figure. I mean, I'm not a devil figures, but. Yeah, yeah, out of all of them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9994.7,"end":9995.31,"speaker":"Fr Stephen De Young","text":"He is one of them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":9995.46,"end":10007.7,"speaker":"Fr Andrew Stephen Damick","text":"Them. Right, yeah. And what's, I mean, what's, what's, what's crazy about this devil figure is that he's human, basically."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10008.02,"end":10008.58,"speaker":"Fr Stephen De Young","text":"Sort of."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10008.58,"end":10009.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, sort of."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10009.54,"end":10010.26,"speaker":"Fr Stephen De Young","text":"He's a giant."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10010.58,"end":10071.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, he's a giant. Yeah, yeah, yeah, he's a giant. You know, in, in Jubilees, right? The way that the flood goes is the flood comes because of the giants. I mean, this is, this is, this is in Genesis 2 as well. But, but it's really explicit in Jubilees that the flood comes to wipe out the giants and then they're dead, but their spirits are all there, right? And, and immediately they begin to attack Noah and his sons. And Noah basically says to God, I thought you sent the flood to deal with this problem. And here they are still attacking us, but they're just disembodied spirits. And, and God, I'm, you know, I'm paraphrasing a little bit here. God basically says, you know, you're right, I'm going to go ahead and send them all into the abyss so they'll leave you alone. And so then one of these spirits steps forward and this is Mastema. And he says, hold on, hold on a second, Lord."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10071.58,"end":10072.46,"speaker":"Fr Stephen De Young","text":"Let's make a deal."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10072.62,"end":10088.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Let's make a deal. You can, you can send, go ahead, send most of them down to the abyss, but how about 10% of my bo boys and I get to hang out here and we promise we're going to afflict only the wicked. Only the wicked."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10088.32,"end":10090.84,"speaker":"Fr Stephen De Young","text":"You don't like the wicked? We don't like the wicked, you know?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10091.16,"end":10107.25,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly. And, and, and God essentially says, okay, you have a deal, but when the time comes, you have to go down to the abyss with the rest. Right? So this is this bargain that Mastema makes. Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10107.57,"end":10115.09,"speaker":"Fr Stephen De Young","text":"And now, now Mastema is making this deal. From the demons perspective, this is because they're haters, right? They just hate humans."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10115.25,"end":10115.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10116.93,"end":10123.49,"speaker":"Fr Stephen De Young","text":"But the reason God agrees to the deal is that he is going to use them afflicting the wicked to bring the wicked to repentance."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10124.37,"end":10124.69,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10124.69,"end":10128.05,"speaker":"Fr Stephen De Young","text":"So this is because God actually loves the wicked, Right?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10128.05,"end":10156.81,"speaker":"Fr Andrew Stephen Damick","text":"This is that theme of the left hand of God. God using demonic activity to bring about his purposes, namely repentance and holiness and salvation of mankind. You know, so, so yeah, this is, this is interesting because like in Jubilees, it's presented in a literal way that angels mate with humans. I mean, go, go see our giants episode from way back in 2020 for the whole nine yards about all this stuff."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10156.81,"end":10158.01,"speaker":"Fr Stephen De Young","text":"A whole sordid affair."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10158.47,"end":10191.72,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. But in Jubilees is presented in literal fashion that, that fallen angels mate with humans and they produce giants. And so, you know, the fallen angels that do this are chained up down in Tartarus. This parallels the whole Titan story from Greek mythology, chained up down in Tartarus. And so then the presence of evil spirits on the earth is dead giants, right? So the fallen angels are down there where they can't hurt anybody, but it's dead giants that are. The presence of, of that are the."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10191.72,"end":10194.32,"speaker":"Fr Stephen De Young","text":"Demons, those spirits roaming around, possessing people and stuff."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10194.56,"end":10195.68,"speaker":"Fr Andrew Stephen Damick","text":"Right? They're the demons."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10195.84,"end":10197.28,"speaker":"Fr Stephen De Young","text":"And the New Testament and."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10197.36,"end":10211.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So, and, and we should just emphasize here that we're telling you that this is what these texts present. We're not saying that this is Christian dogma, right? I'm not aware of any kind of."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10211.29,"end":10212.97,"speaker":"Fr Stephen De Young","text":"It hasn't been dogmatized anywhere."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10213.29,"end":10214.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10214.49,"end":10235.85,"speaker":"Fr Stephen De Young","text":"Now it is the presupposition of the New Testament, right? It's the presupposition of the Synoptic Gospels, I should say. Right. The Synoptic Gospels in various ways presuppose this. You get the demons expressly asking Jesus not to cast them into the abyss asking, are you here to trouble us before the time?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10236.99,"end":10239.79,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which. That's not a reference to anything in the Old Testament."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10239.87,"end":10251.15,"speaker":"Fr Stephen De Young","text":"Right. Referring to this bargain. Right. So this is. And of course, this is the. The Archie Wright book, the Origin of Evil spirits."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10251.95,"end":10252.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10254.51,"end":10255.95,"speaker":"Fr Stephen De Young","text":"That I think is still in print."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10256.43,"end":10258.43,"speaker":"Fr Andrew Stephen Damick","text":"So. Yeah. So. So from the point of view."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10258.59,"end":10259.71,"speaker":"Fr Stephen De Young","text":"Dissertation on this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10260.27,"end":10261.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10261.31,"end":10262.91,"speaker":"Fr Stephen De Young","text":"Vis a vis the Synoptic Gospels."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10263.77,"end":10278.69,"speaker":"Fr Andrew Stephen Damick","text":"So from the point of view of Jubilees, then, this is not only the origin of evil spirits, of demons on earth now, but also that sort of the main devil figure is. One of these is a dead giant."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10278.69,"end":10288.09,"speaker":"Fr Stephen De Young","text":"Yeah, right. Yeah. We're gonna see mastema. So I'm pretty sure we've mentioned this before, but there's a whole bunch of these devil figures."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10288.81,"end":10292.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We should do. I think we should do an episode on devils at some point."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10292.83,"end":10338.68,"speaker":"Fr Stephen De Young","text":"So you've got. You've got a Zazel, you've got the devil, you've got Satan, the Satan. Right. Who shows up in Job. You've got Mastema, you've got Belial. Right. So there's. There's a bunch of these. Right. And we've got all these names. No source that you can find in Second Temple Judaism or early Christianity thinks that all of these are separate beings. They've usually got like one or two of them and sort of all the devil figures of the Bible are collapsed into one or two of them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10339.24,"end":10339.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10339.64,"end":10350.85,"speaker":"Fr Stephen De Young","text":"Right. So Second Enoch, Right. Azazel is very clearly a Zazel. Like Day of atonement is Azel, but he's also the serpent from the Garden of Eden."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10352.45,"end":10352.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10352.77,"end":10364.05,"speaker":"Fr Stephen De Young","text":"So they just kind of collapse. All the devil figures that do Azazel, Jubilees collapses most of them into mastema. Yeah, we're gonna."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10364.05,"end":10366.77,"speaker":"Fr Andrew Stephen Damick","text":"We're gonna see how Massimus shows up several more times here."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10366.77,"end":10371.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. He gets up to shenanigans throughout the rest of the book of Jubilee."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10371.69,"end":10384.27,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So, yeah, there's all kinds of fun stuff related to the flood here. So right after the flood, the wicked humans have been wiped out. Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10384.27,"end":10388.43,"speaker":"Fr Stephen De Young","text":"But the giants. Yeah. And the rest of the humans for that matter."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10388.43,"end":10396.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And yet Noah then makes this sacrifice and it says for the land."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10396.43,"end":10413.53,"speaker":"Fr Stephen De Young","text":"He atones for the land. Yeah, atonement for the land. And this fits in again with what we've talked about in terms of what atonement is. You can go back to those episodes where atonement on the day of atonement is made for inanimate objects. Spaces and objects in the world are atoned for."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10413.93,"end":10416.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Cleaned up. Cleaned up. Purified."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10416.77,"end":10431.28,"speaker":"Fr Stephen De Young","text":"Right? Yeah. This is about removing. So the giants and all those humans who are doing all those wicked, evil things are gone now? Sort of. He's offering these sacrifices to sort of purify the land from, like, the residue or the taint of their sin and their wickedness."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10431.68,"end":10508.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right. So we. We promised the prayer of Noah against the demons. So this is right before Mastema shows up and says, I'd like to, you know, let's make a deal. This is when Mastaba and all the. And all. And 100% of the dead giants are messing with him and his sons. This is what. This is what Noah says to God. God, God of the spirits which are in all flesh, who has acted mercifully with me and saved me and my sons from the water of the flood and did not let me perish as you did the children of perdition. Because great was your grace upon me and great was your mercy upon my soul. Let your grace be lifted up upon my sons and do not let the evil spirits rule over them, lest they destroy them from the earth. But bless me and my sons and let us grow and increase and fill the earth. And you know that which your watchers, the fathers of these spirits, did in my days. And also these spirits who are alive, shut them up and take them to the place of judgment and do not let them cause corruption among the sons of your servant, O my God, because they are cruel and were created to destroy, let them not rule over the spirits of the living, because you alone know their judgment and do not let them have power over the children of the righteous henceforth and forever. So that's Noah's exorcism prayer, basically. Prayer of protection against demons."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10508.79,"end":10510.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10511.62,"end":10530.5,"speaker":"Fr Andrew Stephen Damick","text":"And as we mentioned, right. That God of spirits involved flesh was at the beginning of this, in which we pray in the memorial. The memorial is not just sort of borrowing that phrase, the association of praying for the departed, and especially at a funeral, with exorcism, with warding off demons. That's totally a thing."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10531.38,"end":10531.86,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10532.74,"end":10533.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10534.26,"end":10534.66,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10534.66,"end":10535.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10536.11,"end":10538.43,"speaker":"Fr Stephen De Young","text":"There's toll house people out there getting super excited."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10541.47,"end":10544.91,"speaker":"Fr Andrew Stephen Damick","text":"The same kind of excitement is with giants, though it's a lot less joyful."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10545.31,"end":10565.31,"speaker":"Fr Stephen De Young","text":"But notice, right. Notice also what these spirits are about. They're about destroying humanity. They're about destroying humanity. That's a view of jubilees. That's a view, frankly, of the scriptures about these demonic spirits, even the ones that are worshiped gods by the nations."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10566.35,"end":10566.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10566.91,"end":10588.99,"speaker":"Fr Stephen De Young","text":"These aren't quote, unquote, competing religions, right? That value the same thing. You know, this is, you know, spirits that want to destroy humanity. And so converting someone from paganism to Christianity is saving them. That's why we use that word."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10589.74,"end":10590.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10591.1,"end":10594.06,"speaker":"Fr Stephen De Young","text":"It's not saving them from God being angry at them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10594.62,"end":10595.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10595.1,"end":10600.38,"speaker":"Fr Stephen De Young","text":"God loves them. It's saving them from the demons who have control of them and want to destroy them."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10601.18,"end":10603.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Setting them free from slavery."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10604.22,"end":10614.76,"speaker":"Fr Stephen De Young","text":"Yes. As we mentioned, it's also Noah who starts the Feast of Weeks, who starts celebrating Pentecost, but that's at the giving of the covenant with him."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10616.03,"end":10616.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10616.23,"end":10624.83,"speaker":"Fr Stephen De Young","text":"So the covenant with Noah is sort of this pre. Participation in. Right. The eternal reality of the covenant with Moses."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10625.15,"end":10625.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10625.47,"end":10655.6,"speaker":"Fr Stephen De Young","text":"As Jubilees presents, also fleshes out the figure of Canaan, like Ham's descendant. Interestingly, it spells Canaan. Not the way it's spelled in Genesis with two A's. It spells it C, A, I, N, A N. Roughly, meaning it's like Cain is in Cain and Abel."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10658.08,"end":10659.36,"speaker":"Fr Andrew Stephen Damick","text":"Canaan is the new Cain."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10659.76,"end":10681.01,"speaker":"Fr Stephen De Young","text":"Yeah. So and then he's deliberately recast as another Cain Right after the Flood. Right. So Cain touches off in his genealogy this whole descent to the giants, the Nephilim and the Flood. Right. And then. Well, wait, there's giants after the flood. There's all this other stuff that goes down in the Torah, in the Book of Joshua."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10681.33,"end":10681.73,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10682.13,"end":10701.07,"speaker":"Fr Stephen De Young","text":"Even leading up to the Tower of Babel. Well, Canaan is the new Cain in the sense that he's the one who does this. And in Jubilees, he does it in a very literal way. Canaan is taught how to read. And he goes and he discovers these inscriptions made in stone in certain mountains."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10701.55,"end":10701.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10701.87,"end":10762.32,"speaker":"Fr Stephen De Young","text":"And this is probably a reference by Jubilees to the kind of mountain carving that the Persian Empire did, since this is a post exilic text. But he finds all of this stuff written in stone on these mountains from before the flood. Right. It's written in stone. That's how it survived the flood. Right. On the mountains. And it's all the stuff the Watchers taught humanity. So he rediscovers it. Canaan rediscovers it. He goes and builds a city, and he builds his city. He has a descendant named Ur, which is kind of on the nose, since Ur is the Sumerian word for city and was, of course, the name of the city of Ur that Abraham came from. But Ur goes and builds the city of Ur. That's in Jubilees. And that whole narrative then culminates in the Tower of Babel and the Tower of Babel in Shinar, according to Jubilees is between Asher and Babylon."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10763.6,"end":10764,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10764,"end":10765.44,"speaker":"Fr Stephen De Young","text":"Which again is an anachronism."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10766.16,"end":10766.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10766.56,"end":10851.74,"speaker":"Fr Stephen De Young","text":"But it's a. Between the capital of the Assyrians and the capital of the Babylonians. Right. The great enemies of Israel later. Right. So the idea is this whole Mesopotamian tradition, Babylon, Asher, Uruk, right, All of this is all being sort of balled together here as coming from Kanan, who's the new Cain, and recreates this situation of giants, of the claim to have these antediluvian secrets. All of that. Right. Gets bundled into this figure of Canaan, also with Noah and his sons. The world gets apportioned by God to Noah and his sons. So from the perspective of this, it's not just like, right, we get in. In Deuteronomy chapter two, we get that, right? Okay. Israel is going to have this piece of land and Edom is going to have this piece of land, like the descendants of Abraham. But Jubilees pulls this back to Noah and says, no, God gives, like Europe and Asia, really, to Japheth's children and Africa to Ham's children and the Middle east essentially to Shem's children."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10852.78,"end":10853.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10853.18,"end":10892.27,"speaker":"Fr Stephen De Young","text":"So all of them are sort of given these land allotments by God. Israel is called eventually to this very special role in terms of the nations, but the rest of the nations are to follow. This is the first place where you get what becomes prominent in Jewish tradition later, including rabbinic Jewish tradition, the idea of the Noahide laws, where again, in Jubilees, the commandments we've talked about, the ones that apply not just to Jewish people, but also to gentiles from like Leviticus and. And other places, those get extracted and pushed back here to Noah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10893.15,"end":10893.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10894.67,"end":10906.19,"speaker":"Fr Stephen De Young","text":"So those are commandments that are part of the covenant with Noah that are given to all of his sons, whereas the Torah then is later given to. To Israel in particular."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10906.91,"end":10908.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10908.27,"end":10932.91,"speaker":"Fr Stephen De Young","text":"Right. And so the rest of the nations are responsible to follow those. Those laws, but that's where they get associated with Noah, at least in our first extant text, is here in. In Jubilees. The Tower of Babel gets blown down by a great wind in Jubilees 10, verse 26."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10933.23,"end":10940.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which, I mean, there's not a lot of Tower of Babel stuff in Jubilees. It kind of just tells the story very briefly. But it does have."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10940.68,"end":10947.72,"speaker":"Fr Stephen De Young","text":"You wouldn't think that to listen to Ricky Rohan and all his nonsense."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10951.56,"end":10952.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's not a lot, if that."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10952.8,"end":10953.64,"speaker":"Fr Stephen De Young","text":"Is his real name."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":10953.88,"end":11011.8,"speaker":"Fr Andrew Stephen Damick","text":"There's not a lot in terms of text and Jubilees about the tower, but it does have this cool detail of it being blown over by a great wind, which is again, not in Genesis, but but is echoed in Acts with the coming of the Holy Spirit with this great wind. And liturgically, Pentecost is the undoing of Babel. Right. So there's this. This Pentecostal character going on here. And so in sense of a great wind coming to blow over the tower of Babel, it's sort of a, you know, a. Both now and not yet on some level of the coming of the Holy Spirit at Pentecost. You know, it's God who descends and brings this and expressed here as a great win. So it's just kind of a fun detail that's just sort of mentioned there very briefly. But it is. It is there. So let's do more Mastema stuff."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11012.92,"end":11017.4,"speaker":"Fr Stephen De Young","text":"Yeah. So Mastema shows up again in the story of Abraham."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11018.06,"end":11019.42,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11021.02,"end":11027.5,"speaker":"Fr Stephen De Young","text":"He shows up at the time Abraham's father, Terah is born."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11027.9,"end":11036.38,"speaker":"Fr Andrew Stephen Damick","text":"Yes. He sends, and I love this in the text, a devastation of crows. Like, how many crows do you have to have to have a devastation of crows?"}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11036.38,"end":11037.1,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11037.26,"end":11039.18,"speaker":"Fr Andrew Stephen Damick","text":"And they come and they just have two or three."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11039.18,"end":11040.98,"speaker":"Fr Stephen De Young","text":"It's an attempted murder, but there you go."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11040.98,"end":11062.28,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But, yeah, they come and they. The reason why they're called a devastation is because when the farmers are planting all their seeds, the crows come, eat the seeds and snatch them away. And so this brings a famine. Right. So number one, fun parallel with the parable of the sower, Right. You know, the enemy birds come and."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11062.28,"end":11064.92,"speaker":"Fr Stephen De Young","text":"Take away the seed. That's the devil coming and taking away the."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11064.92,"end":11128.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. Exactly. But then there's all these cool details about the youth of Abraham. Well, he's still Abram at this point. So, yeah, it becomes clear early on that Abram realizes that he's surrounded by idolaters and is totally against that. And he goes out and he drives away the crows. And not only does he drive away the crows from around, you know, his family, but he, like, people kind of ask him to come and do the same for them. And so he gets known as this sort of crow exorcist. And there's this. This growing. This growing theme of Abram being against idolatry and being anti idolatry. And even at one point going to his dad and saying, you know, shouldn't we only be worshiping Yahweh? And his dad saying, well, they'll talk badly about me, you know, if I'm not an idolater, or whatever. And then there's this really fascinating bit where. Where Abram is shown Hebrew, but of course, no one knows Hebrew by this point. Which Jubilees says is the language of creation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11129.12,"end":11129.6,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11130.72,"end":11171.81,"speaker":"Fr Andrew Stephen Damick","text":"And I mean, there's some. I don't think it's in Jubilees, but there's some traditions about Hebrew being the language that everyone speaks before Babel. Yeah, yeah. As to be the original. The original language, you know, And. And then. So what happens is that. Right. That God shows him how to read Hebrew and he's able to gain, you know, knowledge of God from. From doing this. So there's this whole arc of Abram being the guy who's going to bring. He's anti idolatry, and so he's going to sort of lead the way out of idolatry. Is. Is this cool theme that's in the Abraham stuff there. And. And Massimus shows up a lot as."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11171.81,"end":11172.29,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11172.77,"end":11174.29,"speaker":"Fr Andrew Stephen Damick","text":"As kind of his adversary."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11174.53,"end":11187.17,"speaker":"Fr Stephen De Young","text":"Nemesis. Yeah, he. Yeah. Mastema shows up again. So before the whole episode of the sacrifice of Isaac, Mastema shows up at a scene very reminiscent of the beginning of the Book of Job."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11188.45,"end":11188.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11189.73,"end":11246.72,"speaker":"Fr Stephen De Young","text":"Where Mastema shows up before God and says, hey, consider your servant Abraham. He really loves that Isaac kid. I bet you if you, you know, did something to that Isaac kid, he'd turn on you. And so this scene is added to explain why God told Abraham to go sacrifice. Isaac was like, sort of like with Job to prove a point to, in this case, Mastema. So Mastema here is sort of cast as the Satan from Job. And. Yeah. So Mastima is kind of lurking around and he's filling. If you compare this to other Second Temple literature that we haven't talked about in detail on the show yet, usually this role bothering Abraham is Azazel. So there's a sense in which Mastema and Azazel are here getting kind of smushed, even though the name Azazel doesn't occur if you're familiar with some of the other literature."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11247.28,"end":11298.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So another detail that I just thought was kind of cool, not just because it mentions Mastema, but I don't know. I liked this. So when Jacob is born in book of Jubilees, Abraham is still alive, even though that's his. His grandson. And he actually then goes to bless his grandson. And this is in Jubilees, chapter 19. He says, and may the spirit of Mastema not rule over you or over your seed in order to remove you from following the Lord, who is your God henceforth and forever. And may the Lord God be for you and for the people a father Always. And may you be a firstborn son. Go, my son, in peace. So it functions in a little ways as a kind of prophecy of Jacob becoming the firstborn, even though he's not the firstborn."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11299.71,"end":11305.55,"speaker":"Fr Stephen De Young","text":"You know, here as well, it presents that as. See, by presenting Abraham is blessing him, that makes it a little more legitimate seeming."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11305.87,"end":11306.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11306.67,"end":11308.75,"speaker":"Fr Stephen De Young","text":"Than him getting the birthright through trickery."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11309.47,"end":11309.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11309.95,"end":11312.03,"speaker":"Fr Stephen De Young","text":"Which is what's in the actual book of Genesis."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11312.51,"end":11316.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11316.67,"end":11412.74,"speaker":"Fr Stephen De Young","text":"When Abraham eventually dies, he gives sort of a mini testament. It's pretty short, but you get sort of his last words. And the important theme there, because we see this in a lot of Anakin literature, is that in the future there is going to be some super wicked generation that's going to precede the coming of the Messiah and the deliverance. Right. Of the people the same way. And that's paralleled with the generation of Noah's day that was wiped out. Right. They're going to be wicked like that. Right. Right before. Right before the coming of the Messiah and the end of things and the final judgment. God's going to intervene at that point. And that's just a running theme in Anakic literature. And we see that crop up a lot, especially in the Synoptic Gospels. But other places in the New Testament, right, when Christ talks about, how long will I tolerate this wicked and perverse generation? That idea of the wicked and perverse generation comes from Enoch literature like this. He's referencing this as like that generation that's like the generation of Noah. Or when he talks about the days of the Son of Man being like the days of Noah, when people are being married and given in marriage and then judgment came upon them suddenly. Right. That whole comparison, that whole set of ideas we see all through Anakin literature, but also here in Jubilees, in sort of Abraham's dying words."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11413.38,"end":11537.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So there's one other bit about Mastema that I wanted to mention because again, this is a fun kind of retconning, I don't know, of a very familiar story from the scripture. And this is actually not Genesis. This is Exodus, the beginning of Exodus, as we said, you know, Jubilees presents the history kind of up to Moses on Sinai. So you're going to have some Exodus stuff there too. So Massimo gets involved in Exodus early on, Massima tries to kill Moses. And because. Because, you know, Moses is going to lead his people out of Egypt. And so Massimo is trying to prevent that from happening. And. And God has said to bind Mastema to prevent that from happening, to prevent him from killing Moses so that the Exodus can happen. Right. What's interesting then also is, you know, when the showdown begins with Pharaoh, it actually says that Mastema is loosed. And the reason why he's loosed again is basically to allow him to participate with Pharaoh and the Egyptians in pursuing Israel. So there's this. This idea that demonic power is what is pursuing Israel. Right. So it's not just Pharaoh and, you know, the Egyptians, it's. Well, in this case, as it says in. In Exodus, the gods of Egypt. So Mastema is depicted as essentially as one of the gods of Egypt in this case, or the God of Egypt, really. And then. And then when it comes time for the firstborn to be killed at the Passover itself, it says that the powers of Mastema are released to kill the firstborn. And so the image that we would often describe as the angel of Death is associated with this figure of Mastema. So he's participating in kind of all this demonic sort of activity that's related to the Exodus. So a really interesting angle. Really, really interesting angle."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11537.75,"end":11574.42,"speaker":"Fr Stephen De Young","text":"Right? Yeah. And you can see the pattern there too, of God sort of having him on a leash. Right. He can't actually act against God's will, but God occasionally setting him loose. Why? As a judgment. Right. To judge the wicked. God removes that restraint at times. Yeah. And there's a couple of other little details that are kind of interesting. We talked last time in the Testament of Levi about how sort of priesthood was projected back onto the figure of Levi. Right. The person."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11574.9,"end":11575.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11576.5,"end":11606.47,"speaker":"Fr Stephen De Young","text":"And that's here in the book of Jubilees. Also, Levi, because of his zeal in defending the honor of his sister and killing all the men of Shechem, receives priesthood as a reward. And also there's some interesting things with, you know, in. In the text of Genesis, of course, Esau is like. Ends up being the good guy in the story, if you actually read it. Sorry, Cal."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11606.47,"end":11606.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11609.23,"end":11681.13,"speaker":"Fr Stephen De Young","text":"But at Esau and. And Jacob reconcile and everything, and everything's fine. And the are even fine in Deuteronomy 2 and everything. And it's only later when Edom rebels against Judah at the time that Judah is going into exile, that's where everything goes wrong in terms of Edom. That's when God says, Edom he has hated. And so that gets sort of pushed back from the perspective of the author back into Genesis, where after Esau kind of has made peace with and forgiven Jacob, Esau's sons, his descendants, his sons and grandsons are really ticked about it, decide, you know, Esau's a wuss for doing that. And so they go and start attacking Jacob and Jacob's family. And that's a way of sort of projecting that, like, yeah, Esau was okay, but his descendants were a problem. Right. But that gets kind of retrojected back into. Yeah, into Genesis itself."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11681.37,"end":11682.77,"speaker":"Fr Andrew Stephen Damick","text":"Earlier generations. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11682.77,"end":11684.09,"speaker":"Fr Stephen De Young","text":"In that way. Yeah."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":11684.33,"end":12072.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, well, that wraps up our kind of bonus round. I don't know of some interesting details in the Book of Jubilees that both of us wanted to talk about. I wanted to just talk here at the end a little bit about apocrypha in general. I know we've done that a lot, but particularly in terms of this book, because it would be tempting to read this and say, oh, this is the real story of Genesis and early Exodus, you know, and then some people might hear this, say, wait a minute, am I supposed to believe all this? That that's what really happened? You know, and especially the stuff that might trip people up is like, the origins of evil spirits and all this kind of stuff. And I know that, particularly like this show, we talk a lot about. We talk about a lot of kinds of details and things that. That are probably new to a lot of people. And so there can be a feeling of, let me get hold of all of this knowledge, you know, and. And some people really embrace that idea, and some people like, oh, this is all very dangerous, you know, that kind of thing. And I think that that. And this kind of connects a little bit with what. What, Father, you were saying to our second caller to Maureen. It can get us into that area of treating these things like they're pieces of data, you know, that you need to get right or needs to be rejected or whatever it might be. But I think that we have to remember what it is that apocrypha are. Right. So these are texts that are not read out loud in church as scripture. Again, there is the exception of the Ethiopian tradition, but I'd be willing to guess that the vast majority of our listeners are not from that tradition. And so this is not a canonical text for most of them. This is an apocryphal text. And that texts like this are useful to read at home or, you know, useful to talk about on podcasts, meaning that they're not to be taken in the same way with the same kind of authority as scripture. It's something less, something lower. Right. And we have to sift them according to the larger tradition of the church. Some of the sifting will be things we'll say, well, you know, that's just not consistent with the rest of the tradition of the church. We're just going to leave that alone. Others will be things we can say, well, that's an interesting take on that. You know, that's nice. Other things will provide us with very deep kinds of insight and context for the scriptures and for the tradition of the church. Like a great example being that prayer that's used against the demons by Noah, then we use in praying for our departed, because the idea is we don't want them to be attacked by dark spirits, you know, in the passage from this life into the next, you know, keep away. Right? So I think that the thing we have to remember, and this is a theme throughout all of the stuff we've done on this podcast now for almost four years. Man, it's hard to believe it's been almost four years. This is episode 92, everyone, by the way, is that the point of all of this is not to create a big stack of weird things to believe or teach or whatever. That's not the point at all. The point is to find in this the ways that we can become more faithful. Right. In the ways that we can become saints, the ways that we can become holy ones. Right. And for me, what Jubilees does is because it kind of attempts to pull back the veil in a way that's a little bit more explicit than the canonical Scriptures, pull back the veil on the unseen world of the spiritual realities behind things. I think that it helps to give us a better habits of mind when it comes to understanding what is in the Scriptures and to understanding what is in these more sort of central positions in Christian tradition. Right. That it gives us habits of thought. It gives us. I don't know, I think the word taste might be a good one. It gives us a taste, and not just in terms of like, meaning a sample, but taste in the sense of. My tastes are formed in such a way that I can recognize and understand things that maybe were not as recognizable or understandable to me before, because we get a stronger feeling for what the world of ancient people was like, what the ancient near east was like, and what their spiritual neighborhood was like. Right. And I. I think that Jubilees is a great text for a lot of those things all together because it's very clearly apocryphal. It's not scripture. Right. But it's also very clearly engaging with Scripture. That's its real purpose is it's engaging with what's in the Scripture. It's giving us the author's thoughts and understandings. And collections of traditions regarding what is in the scripture. And so it helps to train us. I think that's probably the greatest value in this text is it trains us of how to approach the Christian tradition in a way that's going to be, God willing, more salvific for us and also for those with whom we interact, that we become more saintly people. That's really the whole. The whole point of it, to draw closer to Christ, to become more like Christ, to become, as the Lord says in the Gospel of Luke, equal to the angels. And I think this text is great for all of that. So, Father Stephen, your final thoughts on this."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12075.38,"end":12356.21,"speaker":"Fr Stephen De Young","text":"So Aristotle was right that we are what we repeatedly do. We tend to look at the way we structure our lives and time and the calendar as kind of indifferent, as kind of unimportant, right? When we think about what we do or even what we repeatedly do, we don't tend to think of it in those terms, in terms of cycles and patterns in the calendar and the way we organize our days and our weeks and our months and our years. We tend to think about it just in terms of actions like good deeds, bad deeds, good things we do, bad things we do. I'm a good person because I do good things. That person's a bad person because they do bad things. But what Aristotle is actually talking about and what Jubilees is so focused on is exactly that kind of structuring. There was a period of my life in junior high where I basically lived from New Comic Day to New Comic Day. And Frederick Wordham was right. It turned me into a juvenile delinquent, somewhat literally. But, you know, there have been other periods of my life where I lived paycheck to paycheck. I lived summer to summer. If you're in school or teaching school, birthday to birthday, take your pick, right? Take your pick. And all of those things will shape you. They'll. They'll shape how you see yourself, how you understand who you are, how you relate to a community, if you're even part of one, right? Because part of what constitutes a community, part of what makes a community a community, not in the sense of this is when you can accurately apply that label, but in the sense of what actually causes a group of human persons to function together as a community, is that you have a shared rhythm of life that you share in these patterns of life together. That's part of what binds you together and makes you actually a community, is that you're all being shaped together and drawn together by following this. So if you Pick something that's just your own. You're not good. It's not going to draw you together into any kind of community at all. But whatever it is, it will shape you, it will change you. It will change how you see the world, how you experience life in the world, how you experience other people, how you experience your own interiority, how you think of and experience God. All of those things will be shaped. All of those things will be shaped. And this is why, at the core, what Christianity is, is a way of life. And that way of life is made up of these patterns of life. Of a weekly cycle that culminates in the celebration of Christ's resurrection on Sunday, a yearly cycle that culminates in the celebration of Pascha, Christ's resurrection on a particular Sunday. Right. Of the cycle of the rest of the feasts of cycles, both weekly and yearly, of fasting and a feasting. And by the way, by the way, the feasting is more important. I'm just going to blow some Orthodox people's heads off. I don't care. The feasting we're doing right now to celebrate Christ's resurrection after Pascha is more important than the fasting we did during Lent. You want my evidence? What separated Orthodox Christians from Gnostics, from Manicheans, from Ankhratites, from almost all the heretics of the ancient world was not fasting. They all fasted. They more fast. They all fasted to a greater extreme than Christians did. What separated the Christians from all of them is that the Christians feast. The Christians have times of the year where they enjoy and exult in, and receive joy from, and give thanks to God for all the good things of his creation."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12359.24,"end":12359.48,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12360.36,"end":12368.36,"speaker":"Fr Stephen De Young","text":"They actually got married and had children. They didn't all practice celibacy, the actual Christians."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12368.76,"end":12369.16,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12371.08,"end":12456.93,"speaker":"Fr Stephen De Young","text":"So we need to remember that. I think we need to keep that in perspective. But there are times of feasting and times of fasting. And it's not that the fasting is unimportant, just the feasting is kind of more important, giving thanks to God for His creation and his world. But those cycles, they change us in a good way. They mold us. They help us, as we were saying earlier, come to know God, not just know things about him, not just be able to win arguments about his attributes on the Internet, but actually know him and be known by him and be transformed by that. To be drawn together into community that's practicing those same cycles so that we have not just other people who we go to the same venue with once a week or so. But actual brothers and sisters, actual friends, actual people who we share our lives with. That's how it happens. It happens through these simple things of how do I structure my week around most of the time, two fast days, a couple days where I go to church, five or so days where I work."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12457.89,"end":12458.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12459.25,"end":12513.68,"speaker":"Fr Stephen De Young","text":"Time I spend with my family, time I spend on other things in this regular cycle, week after week, we have to leave the mountain after liturgy, right? But we come back to it. We come back into the presence of God. We have the leave taking of Pascha, but then the next year we come back to it over and over and over again. And the eternal realities of God become more and more part of our life every cycle, every time around the bend, all building to that day when we leave this life and all of those eternal realities, Lord willing, become our eternal realities. Become the realities in which we live our eternal life. Those are my thoughts."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12516.25,"end":12545.58,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Amen. Well, that's our show for tonight, everybody. Thank you very much for listening for joining us. If you didn't call us live, didn't listen to us live, we'd still like to hear from you. You can email us@lordofspiritsnaturefaith.com you can message us at our Facebook page. You can also leave us a voicemail@speakpipe.com LordOfSpirits and if you have any basic questions about Orthodox Christianity or you need help by finding a parish, head over to orthodoxintro.org and join us for our."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12545.58,"end":12555.86,"speaker":"Fr Stephen De Young","text":"Live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. If you want to make a podcast like this, you can learn how to on skillshare, who doesn't sponsor us, but I'd love to take their money."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12556.5,"end":12568.91,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, join our discussion group, please rate and review this podcast to help share it with other people and also please recommend it directly to your friends and family that are going to benefit from it."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12569.39,"end":12582.83,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. And if you need a lawyer, call the Eagle team. I don't even know the legal Eagle guy's real name. You could go to his channel and figure out how to do that, but I'll take his money too."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12583.87,"end":12588.59,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night and may God bless you all. Christ is risen. He truly is risen."}
{"episode_id":"LOS - #093 - 2024-05-30 - The Book of Jubilees","start":12589.23,"end":12626.45,"speaker":"Announcer","text":"You've been listening to the Lord, Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
