{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":0.48,"end":65.11,"speaker":"Voice Of Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":67.27,"end":145.12,"speaker":"Fr Andrew Stephen Damick","text":"Good evening. Welcome back to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you are listening to us live, you can call in at 855-AF-RADIO. That's 855-237-2346. Matus Kachrudi will be taking your calls tonight and we're going to get to those in the second part of our show tonight. We're on part three of our four part series on the Christology of the Old Testament and we're talking tonight about what son of man means. Now that phrase son of man appears over a hundred times in the Old Testament. Most of them are in the book of the prophet Ezekiel. It shows up again dozens of times in the gospels and then gets used elsewhere in the New Testament. What does it mean? Does this refer to Jesus? Does it refer to him every time? So stick with us tonight, sons of Adam and daughters of Eve, though we're not going to the far land of spare, um, where eternal summer reigns around the bright city of war drove, but rather beginning with a quick trip into the New Testament, at least for a moment, which is probably a little surprising for this podcast. So, Father Stephen, why is it important that we look at this phrase son of man?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":146.32,"end":147.84,"speaker":"Fr Stephen De Young","text":"Does everybody see what he did there?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":149.44,"end":150.16,"speaker":"Fr Andrew Stephen Damick","text":"They'll get there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":150.16,"end":155.12,"speaker":"Fr Stephen De Young","text":"I just make sure. Okay, okay. They may not be expecting the references from you. I don't know."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":155.36,"end":157.36,"speaker":"Fr Andrew Stephen Damick","text":"I've. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":158.64,"end":195.97,"speaker":"Fr Stephen De Young","text":"So, yeah, so I guess we should say it's important. If I just said, well, I Mean, it's not that important. Everybody would just turn off the. The show. So. Yeah, we don't say that. Well, no, the. As we're going to see, there's a couple reasons why Son of Man is important. The one we're going to start with because, yes, we're in some ways reversing our usual approach, is that Son of Man, that title is the primary term in all four Gospels that that Christ uses to refer to himself."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":197.01,"end":197.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":197.89,"end":230.48,"speaker":"Fr Stephen De Young","text":"So there's lots of titles for Christ in the Old and New Testament. Right. Son of God, Messiah. Right. All of these things. Some of the ones we've talked about already, the Word of God, the angel of the Lord that we've been talking about in the Old Testament, there's bunches and bunches and bunches of them. The Lord, but this is the one that Christ applies to himself when he speaks. And there are not a whole ton of things that go across all four gospels with complete consistency."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":230.8,"end":231.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":232.24,"end":268.1,"speaker":"Fr Stephen De Young","text":"Very, very few. And even most of the things that do go across all four gospels are not identical. Right. They're similar. Like there are a handful of stories that are in all four gospels, but even in those cases, often the details are different. Right. Different details are brought out by different authors. Right. But this is true and completely true of the portrayal of Christ in all four Gospels. In all four of the Gospels, the primary thing he calls himself is the Son of Man."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":268.42,"end":269.46,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":272.26,"end":305.81,"speaker":"Fr Stephen De Young","text":"And while that's true, you mentioned it's used in some other places in the New Testament, but not that many, actually, other than Christ referring to himself as the Son of Man in the Gospels. And a bunch of times where the New Testament quotes the Old Testament and the Old Testament quote contains that phrase. So other than those two things, it only actually shows up once, and that is in Acts of the apostles 7, verse 56."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":306.77,"end":307.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":307.09,"end":318.37,"speaker":"Fr Stephen De Young","text":"And this is at the end of the story of St Stephen as he's being. Or as he's about to be stoned to death."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":318.61,"end":334.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this should be very familiar to everyone who's read Acts 7 or knows anything about St. Stephen, it reads, and he said, behold, I see the heavens opened and the Son of Man standing at the right hand of God."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":336.26,"end":348.26,"speaker":"Fr Stephen De Young","text":"Right. And so one of the things we see not just there, but also in St. Stephen's final words, even though that's a rabbit hole, we're not going to go down."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":348.58,"end":350.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Some other time perhaps."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":350.58,"end":363.16,"speaker":"Fr Stephen De Young","text":"Yeah. In terms of textual variants and that kind of thing, I know there are people who are now disappointed. They're like No, I love that nerdy, that nerdy, nerdy text criticism stuff. But not today."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":366.68,"end":367.88,"speaker":"Fr Andrew Stephen Damick","text":"Some other time, everybody."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":367.88,"end":403.63,"speaker":"Fr Stephen De Young","text":"What we see going on there is with those final words of St Stephen is that deliberately he's using phrases and speaking in a way that Christ spoke. Because the idea is that St. Stephen is speaking the way Christ spoke because he's dying the way Christ died. Right. So his martyrdom is sort of the, as the proto martyr, he set up there not only as the first Christian martyr, but establishing that sort of the core of what it means to be a Christian martyr is to die the way Christ died."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":404.03,"end":404.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":406.51,"end":457.13,"speaker":"Fr Stephen De Young","text":"So that's the only other place. And again, he uses it there because literarily St. Luke is wanting us to connect his speech to Christ's speech. And this is, that phrase is so characteristic of Christ that him using it does that. And then it's Old Testament quotes and that's it. In the New Testament you get close to it just to stop somebody from trying to actually us in Revelation 1. And we're going to talk about that passage later. But that is not actually the title. And we'll talk about that in a minute. And by a minute I mean like when we say let us complete our prayer to the lord and there's 45 minutes left in liturgy."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":457.13,"end":458.41,"speaker":"Fr Andrew Stephen Damick","text":"A nice fat minute."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":458.49,"end":460.81,"speaker":"Fr Stephen De Young","text":"Yes, that kind of a liturgical minute."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":461.21,"end":464.97,"speaker":"Fr Andrew Stephen Damick","text":"Right, the in a minute that you, that I give my kids."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":465.37,"end":468.81,"speaker":"Fr Stephen De Young","text":"Yeah, the one day is like a thousand years minute."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":468.81,"end":470.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":471.87,"end":501.95,"speaker":"Fr Stephen De Young","text":"Right. So then all of those Old Testament quotes obviously are coming out of the Old Testament by definition. But also when Christ applies it to himself, he's drawing on this existing concept of the Son of Man that pre existed, that is reflected in the Old Testament. And so it's not just sort of an affectation. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":501.95,"end":506.67,"speaker":"Fr Andrew Stephen Damick","text":"By it's a reference. It's a reference that people are gonna recognize."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":507.15,"end":517.47,"speaker":"Fr Stephen De Young","text":"And I say it's not just an affectation because friend of the show, Bart Ehrman is he. If I, if I keep calling him that, maybe he'll come on. Who knows?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":517.47,"end":522.83,"speaker":"Fr Andrew Stephen Damick","text":"That would be good. We'll finally have a guest."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":523.39,"end":551.47,"speaker":"Fr Stephen De Young","text":"He, he treats it as an affectation. He says this is just Jesus sort of affected way of referring to himself in the third person for some reason, which A, makes no sense, you know, and B, even if it were true. Right. You still have to wonder, well, okay, why did he pick that particular affectation that was sort of loaded with Old Testament freight?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":552.53,"end":552.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":553.01,"end":564.41,"speaker":"Fr Stephen De Young","text":"Like it doesn't really get him out of the problem. He's trying to get out Of. So now we have to follow our more usual pattern and go back to the Old Testament."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":564.41,"end":565.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":566.61,"end":570.85,"speaker":"Fr Stephen De Young","text":"And go back to sort of the original languages."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":571.57,"end":574.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So Hebrew and Greek, everybody."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":575.17,"end":599.26,"speaker":"Fr Stephen De Young","text":"Yeah. And so there. There are two ways that son of man occurs if you want to be woodenly literal. Right. So there are cases where that could literally be translated son of a man. There are cases that could be literally translated son of Adam."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":600.46,"end":603.58,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Humanity. Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":604.14,"end":606.7,"speaker":"Fr Stephen De Young","text":"Hence your Lewising activities earlier on."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":608.25,"end":616.09,"speaker":"Fr Andrew Stephen Damick","text":"I got to get my one reference in for the night. It's all that nice. Now I'm reaching out to the wholesome, homeschooling audience out there. Hey, everybody."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":616.81,"end":618.53,"speaker":"Fr Stephen De Young","text":"Wholesome content. So that's."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":618.53,"end":618.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":620.89,"end":675.59,"speaker":"Fr Stephen De Young","text":"And the reason for that is that in both Hebrew and in Greek, there are two different words that are translated man, One of which sort of means a man, as in a male person. Right, right. And one of which refers to man, like humanity or mankind. Right. More that idea. Right, right. In Hebrew, the word for sort of a man is a male human, is ish, and the word for humanity is adama. And you can see the name Adam right there. Yep. That means we're like human. Right. And then in Greek, it's anir is sort of a man, and anthropos is more human. Right. Talking about humanity as such."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":677.83,"end":681.51,"speaker":"Fr Andrew Stephen Damick","text":"Anir is a word that is very dear and close to my heart."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":681.99,"end":683.67,"speaker":"Fr Stephen De Young","text":"Yeah. And so now."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":685.43,"end":688.39,"speaker":"Fr Andrew Stephen Damick","text":"I gotta get another reference in real early on for everybody. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":689.19,"end":696.08,"speaker":"Fr Stephen De Young","text":"I know people are still hung up on that multiple words for love thing."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":696.56,"end":697.36,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":697.76,"end":716.64,"speaker":"Fr Stephen De Young","text":"Made a lot of people. I agree with that. Like I always do when I bring it up. So we're kind of. I'm glad you gave. To the Lewis fans, because once again, we have to also take away. Because synonyms are a thing. They're a thing that exist in the world, and they exist in Hebrew and Greek, too."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":717.14,"end":718.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":718.5,"end":737.14,"speaker":"Fr Stephen De Young","text":"So you may say. Well, wait, look, you just said those two words have different shades of meaning. Right. Well, those two words can have different shades of meaning, or an author could kind of use them interchangeably. So we have to figure out what the Old Testament does. Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":737.14,"end":754.55,"speaker":"Fr Andrew Stephen Damick","text":"And I think it's also important to just to point out that just because you have an individual word, you have to have it embedded in whatever phrase that it might be being used in to, you know, hone in on the actual meaning of that usage, you know?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":755.03,"end":755.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":755.59,"end":761.59,"speaker":"Fr Andrew Stephen Damick","text":"You can't just take every word in the phrase and just throw them together literally and say, that's what that means."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":762.07,"end":763.51,"speaker":"Fr Stephen De Young","text":"Right. Butterfly. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":763.51,"end":765.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah, exactly. Breakfast."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":765.19,"end":809.14,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Words in and of themselves, Lexem's words do not have meaning. Words gain meaning by usage, context. Right. So we have to look at how they're used. And so what we find in the Hebrew and in the Greek of the Old Testament is that you have examples of effectively a phrase like ben ish. Right. Son of aman and ben Adamah, son of man, like mankind. And you find in the Greek places that are eosaneer. Right. Son of aman and eos anthropos, son of mankind. But here's the thing, they don't match up."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":810.18,"end":833.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The Greek translators don't consistently translate Ben ish as ben adama as wios anthropos. It's not one to one correspondence between them, which basically means that when the Greek translators were reading them, they understood those two phrases to basically be interchangeable synonyms."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":834.01,"end":839.13,"speaker":"Fr Stephen De Young","text":"Right. They understood them to be synonyms in Hebrew and then they used them as synonyms in Greek."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":839.45,"end":840.41,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":840.41,"end":895.56,"speaker":"Fr Stephen De Young","text":"Right. So it's hard to get around that. Right. Again, if you're going to argue it's not enough to just say, well, these are two different words and that they are sometimes used with different meanings, you have to show that in a particular case, in a particular phrase, a particular author is using them as technical terms. Right? Right. So St. Paul, for example, has some words he uses that way as technical terms. He has other times where he just uses synonyms interchangeably. Right. And that's true for all of us. If we took all of our writing. Right. There would be times when we use specific words with a very technical meaning. And there are times when we're just using words casually and using two different words to mean the same thing in the same conversation or the same writing, where, for example, it's good English form not to just repeat the same exact word over and over and over again."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":895.88,"end":896.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":896.6,"end":929.47,"speaker":"Fr Stephen De Young","text":"That's why they made you buy a thesaurus in school. Right. So that you wouldn't have to do that. Right. So these two, these two phrases don't get too stuck. Right. On which of the two occurs at a particular place. Right, Right. Because all of these are being used in this sort of interchangeable way in both languages, as we can see from the translation activity into Greek, which I."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":929.47,"end":945.32,"speaker":"Fr Andrew Stephen Damick","text":"Mean, which I would conclude from that, that the English translation of kind of all of them as son of man is pretty warranted. But, but you still. Of course, and we'll get into this. Right. You still have to look at the context to understand exactly how son of man is Being used in a particular case."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":945.88,"end":947.28,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":947.28,"end":955.08,"speaker":"Fr Andrew Stephen Damick","text":"Which is true in the original languages, too. So, like, you can't just say, well, that's a bad translation, because it's not, you know, coming up with multiple different translations in English."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":955.4,"end":975.54,"speaker":"Fr Stephen De Young","text":"Right. And the likely reason, I think, why they were seen as being synonymous, even though it's two different words, is people forget. So we have these names, Adam and Eve, in our head. Right. Those two folks in Genesis. And those aren't their original names."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":976.42,"end":976.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":977.3,"end":981.06,"speaker":"Fr Stephen De Young","text":"The original names were Ish and Isha, man and woman."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":982.02,"end":983.22,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":983.94,"end":995.34,"speaker":"Fr Stephen De Young","text":"And so Ish and Adama, if you're interpreting them as a name, they were both the name of the same person in Genesis."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":995.82,"end":996.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":996.54,"end":1019.9,"speaker":"Fr Stephen De Young","text":"In different parts of the story. Right, right. So. So, yeah, so that, to me, is the most likely explanation for why they just saw this as conveying the same thing. So then you know what's going on with this phrase then? And so first we have to look at the. As we've broken down phrases in the past, we look at the son of part. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1022.1,"end":1022.5,"speaker":"Fr Andrew Stephen Damick","text":"And there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1022.82,"end":1061.36,"speaker":"Fr Stephen De Young","text":"This is a general sort of Semitic idiom. It's not even confined to Hebrew. It's almost all early Semitic languages have some variation of this. So you get it in Hebrew and Aramaic and even Ugaritic, and that is son of blank. And then it will be either a. A quality or a person. Right. So a famous one of these in the New Testament is Barnabas or Bar Nabos. Right. Bar being the Aramaic first son of. Right. And Nabas meaning encouragement."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1062,"end":1064.32,"speaker":"Fr Andrew Stephen Damick","text":"So shout out to Father Barnabas Powell."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1064.56,"end":1068.24,"speaker":"Fr Stephen De Young","text":"Yes. And Barabbas, who is Bar Abbas."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1068.24,"end":1070.8,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, son of the Father. Right. Isn't it?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1070.8,"end":1078.35,"speaker":"Fr Stephen De Young","text":"Yeah. That would roughly mean son of his father. Yeah, yeah, yeah. Which, yeah, kind of applies to everyone, but whatever."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1079.71,"end":1081.39,"speaker":"Fr Andrew Stephen Damick","text":"He's just an everyman figure."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1081.47,"end":1104.91,"speaker":"Fr Stephen De Young","text":"Yes, yes. So someone's called the Son of Encouragement, or Judas Iscariot is called the Son of perdition. Right. The Son of Hell, the Son of damnation. Right. And Christ in St. John's Gospel tells the Pharisees of the Teacher of the Law, when they say that they're the sons of Abraham, he says, no, you're sons of your father, the devil."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1105.23,"end":1107.63,"speaker":"Fr Andrew Stephen Damick","text":"Right. And because they do his works is what."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1107.79,"end":1125.23,"speaker":"Fr Stephen De Young","text":"Right, right. And so we've talked before about this. This idea is that the Son is the image of the Father. Right. He images the Father. So he does. He does the things that the Father does. We're going to come back to this later with Christ."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1125.71,"end":1135.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, exactly. I mean, just. Just as a spoiler you know, for instance, when, when the Lord says, I must be about my father's business, that's him talking about this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1136.12,"end":1146.04,"speaker":"Fr Stephen De Young","text":"Exactly. Yeah. Right. So if someone is the son of encouragement, that means they have this quality, right? Of being an encourager, right? They do encouraging, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1146.28,"end":1148.96,"speaker":"Fr Andrew Stephen Damick","text":"This is what they do, who they are, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1148.96,"end":1224.32,"speaker":"Fr Stephen De Young","text":"If you're the son of damnation, like Judas Iscariot, you can figure out what that means about you. And Christ says, you know, the sons of the father of the devil, because, right? He. He's a liar and he's a murderer from the beginning, right? He's saying, so you possess these qualities, right? You enact these qualities of this person that makes you their son, right? So that means son of man, son of Adam, right? Means that this is someone who has a quality that Adam possessed, right? And so there, there may be some folks out there trying to run ahead on this, right? They say, oh, possess a quality Adam possessed, right? And they've got St. Augustine rattling around in the back of their brain and they're thinking about sin, right? Right. I think about, yeah, Adam did bad stuff and now we all do bad stuff, right? That's how we're. That's how we're sons of Adam, right. They got their whole original sin on, right? And no, that's not what we're talking about, Right. That ain't in the Old Testament."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1224.64,"end":1225.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1226,"end":1237.52,"speaker":"Fr Stephen De Young","text":"So it's worth reiterating. I know we've said this before, but it's worth reiterating. Adam as a figure in the Old Testament is the source of mortality. He is how death comes to the human race."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1237.92,"end":1243.06,"speaker":"Fr Andrew Stephen Damick","text":"Right? If you're looking for the father of sin, you want to look at Cain that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1243.06,"end":1265.58,"speaker":"Fr Stephen De Young","text":"You want to look at Cain, right? And, and failing to disambiguate that. Right. Failing to separate Those two, as St. Augustine did, causes all kinds of theological problems down the road and makes a lot of the New Testament very hard to interpret correctly. And you end up with things like Calvinism. But anyway."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1268.06,"end":1269.82,"speaker":"Fr Andrew Stephen Damick","text":"So sorry. Not sorry."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1270.14,"end":1270.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1272.39,"end":1272.63,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1274.79,"end":1320.56,"speaker":"Fr Stephen De Young","text":"We'Re talking about then if, if mortality, then is the quality that exemplifies Adam, that someone who is a son of Adam, that's talking about someone as being a, like a mortal human, right? It's talking about humanity, a human being qua. Mortality, weakness, fragility. Right? And it's used this way. So this is used, this phrase is used often in the Old Testament to address people like people in the Old Testament. Individuals, right? Persons who aren't Christ. Right, right. And used in context where it's sort of reminding them of their fragility."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1321.04,"end":1334.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The most colorful one, probably job 25 six, where it refers to man, who is a maggot and the son of man, who is a worm. That's not about Jesus."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1335.08,"end":1335.48,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1335.56,"end":1336.52,"speaker":"Fr Andrew Stephen Damick","text":"That's talking about."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1337.4,"end":1338.56,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1338.56,"end":1345.72,"speaker":"Fr Andrew Stephen Damick","text":"So. So, yeah, to answer the question we posed at the beginning, is it always about Jesus? No, the phrase does not always refer to Jesus."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1345.72,"end":1347.64,"speaker":"Fr Stephen De Young","text":"Right. It always refers to a human."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1348.28,"end":1363.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, exactly. And. And in, at least in this sense, it's almost sort of a synonym for the way in English that we use the word mortal as a noun, you know, for us mortals. Right. It's emphasizing us as. As being mortal, as having death."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1363.91,"end":1384.63,"speaker":"Fr Stephen De Young","text":"Right. And when you read that Job quote, it's very easy to just look at it as like an insult. Right. Calling somebody a maggot and a worm. Right. Unless it's Dennis Rodman. Right. Is like not great. Right, right. The point is, what are maggots and worms associated with."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1386.61,"end":1387.89,"speaker":"Fr Andrew Stephen Damick","text":"Eating dead bodies? Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1387.89,"end":1462.48,"speaker":"Fr Stephen De Young","text":"Right. Death and decay. Right. So even that choice, it's not just yucky things. Right. It's aimed at that mortality. It's aimed at that death. Right. That humanity is sort of imbued with this mortality that makes us weak and fragile and frail. And there's other places if you want to look later when this is recorded and you can see. Slow it down. If you really want to look up some more. Some other Examples are Psalm 84, Psalm 144, or 143:3, Psalm 146:3 and Isaiah 51:12, or other places with similar things in addition to those sort of spotty uses of the term. Right. In various places to refer to various people vis a vis human mortality and human weakness. When you look at. If you do the good old concordance method of biblical research, just look for all the places it occurs. Right. In the Old Testament, the phrase son of man, you will find that there's this huge concentration of them, this sort of nexus of them in Ezekiel."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1462.96,"end":1469.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like 93 instances are in Ezekiel out of, I think 120 in the old Testament."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1470.29,"end":1475.57,"speaker":"Fr Stephen De Young","text":"Yeah. And that is being that title there is being applied to Ezekiel."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1476.29,"end":1477.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1477.17,"end":1477.73,"speaker":"Fr Stephen De Young","text":"Ezekiel."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1478.69,"end":1480.29,"speaker":"Fr Andrew Stephen Damick","text":"Oh, son of man. Etc."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1480.61,"end":1562.73,"speaker":"Fr Stephen De Young","text":"Right. So it's the Son of man, son of Adam. Right. Over and over and over again. Well, why does this all of a sudden become so concentrated around the figure of Ezekiel in particular? Well, of the sort of major writing prophets, Ezekiel is the one who is living in exile in Babylon. Right. He's the one who's outside Jerusalem, the temple's been destroyed, right there. There he's with the refugees and the exiles. And for us, right, moving to another country, right, Even if you were sort of a refugee is a long way from being dead. In fact, you probably became a refugee so you wouldn't be dead, right? That was the alternative, right? But we have to keep in mind, right, sort of the sweep of Old Testament theology, right? So starting way back with Genesis 3 and with Adam, right? When Adam is exiled from paradise, when he's cut off from the tree of life, when he's put out of God's presence, that is death, right? The day you eat of it, you will surely die. That's spiritual death. That's the real death, right? And then physical death follows after that as a result, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1562.73,"end":1632.71,"speaker":"Fr Andrew Stephen Damick","text":"And I think the other thing that probably hinders the association of exile from homeland with death for us as modern people is that with so many modern technological conveniences, being pushed out of your homeland is not necessarily the worst thing in the world, right? Like you're going to be probably okay. Whereas for pre modern people, that's where your whole network of survival is. Like, people did not just tend to just get up and move, you know. And one of the ways that actually that's kind of illustrated in the English language is that the word that, the modern English word that we have, that is wretch, W R E T C H. Now we use it to mean, you know, someone who's in a terrible state, right? But the original meaning of that word. Well, I shouldn't say original. An earlier meaning of that word was exile. It meant someone who was exiled. And so there was that sense of this is. And so then later, then we, you know, began to use it to mean this is how you feel when you're in exile. You know, you're away from the source of your life, your. Your family, your homeland, you know, everything that defines who you are, you know, you're outside of all of that, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1632.71,"end":1697.81,"speaker":"Fr Stephen De Young","text":"And in this case in particular, the Temple, right? The place where God is, right, you are now. You are now far off. And you see this reflected in the Torah. There's this ambiguity where we usually just chalk them all up as death penalties. But the language applied to most of the death penalties in the Torah is this person is to be cut off from among the people. And that could refer to death or it could refer to being cast out into exile. And that doesn't need to be clarified in the Torah because those two are seen as being Pretty much the same thing. Yeah. Right. So we don't need to disambiguate that. Right. And so. And this is. This is the picture, as we talked about back when we talked about the geography of the underworld, this is sort of the picture people had of. In their head of Sheol, that you're. You're living this kind of shadowy, wandering existence. Right. You know, or in Hades, until sort of your memory fades and you sort of fade off into oblivion. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1697.81,"end":1717.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, you know, even that. That. That idea of the wandering spirits, right, which are, you know, dead giants, but the wandering spirits, they've been exiled from their proper bodies, their disembodied spirits, and so they're wandering over the earth. This is supposed to be a very miserable cond. Condition. You know, they're cut off from life."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1717.99,"end":1737.35,"speaker":"Fr Stephen De Young","text":"Right. And so in a very real way, Ezekiel is going, not just in that one passage where he prophesies to the bones. And that's the language that's used, prophesied to the dead bones. Right. He is a prophet to sort of the undead. Right. To the. To the dead in Sheol. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1737.51,"end":1742.08,"speaker":"Fr Andrew Stephen Damick","text":"Wow. That's gonna be a T shirt. That's gonna be a T shirt. Ezekiel, prophet to the undead."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1743.92,"end":1765.12,"speaker":"Fr Stephen De Young","text":"So that's what's going on in Ezekiel in the paradigm. So that it's not a coincidence that this phrase also shows up, for example, in Daniel 8, 17, another prophet who is living in exile, he's referred to as the Son of man, because it's a reminder of this mortality and this fragility, this state that they're in."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1765.76,"end":1789.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I just want to read that real quick. I mean, this is a vision that he's having. It says, so he came near where I stood, and when he came, I was frightened and fell on my face. But he said to me, understand, O Son of man, that the vision is for the time of the end. So there's even that sense of the end of the world coming along with that, you know, and he's calling him son of man in the context of that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1790.26,"end":1832.69,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, yeah, that's where sort of this is going. But now we have to turn to sort of the paradigmatic use of the term son of man in Daniel. That's going to become paradigmatic for a whole lot else down the road and is going to be the basis for most of what we're going to be discussing for the rest of the evening in terms of this term. And that's. We're going once again back to Daniel, chapter seven, which we've already gone. We've gone to this. Well, a couple of times, but we're coming through with another trajectory here."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1832.69,"end":1858.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Another pass. Yeah. So we Talked about Daniel 7 when we did our episode on the Ascension earlier this year. And we talked about it not too many weeks ago when we talked about the four beasts that arise up out of the earth in the first few verses of that chapter when we did our episode on Leviathan and Behemoth. So. Yes. Welcome back to Daniel chapter seven, everybody. Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1858.88,"end":1891.75,"speaker":"Fr Stephen De Young","text":"Right. And so this, even though the figure here is referred to as one, like a son of man. Right. This figure becomes known after Daniel 7. So within second temple Judaism, within early Christianity in the first century, when Christ is applying this term to himself critically as the Son of Man, the definite article, as it were. Right. Sort of. Right. Capital S, capital M. Right. As opposed to, you know, these other. These other references."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1892.23,"end":1905.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So if, if, you know, if you're walking around the time of Jesus in Judea and you talk about the Son of Man, pretty much everyone who knows anything about the Old Testament scriptures is going to be thinking about this passage."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1905.31,"end":1906.8,"speaker":"Fr Stephen De Young","text":"From Daniel, Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1906.8,"end":1907.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1907.32,"end":1924.52,"speaker":"Fr Stephen De Young","text":"That's where their brain's going to go when they hear that term. So we're going to. Because we just talked about it recently and you can go back and listen to it. We're not going to spend a lot of time on verses one through eight of chapter seven that talk about the four beasts, because we. We just did that not too long ago."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1924.68,"end":1925.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1925.56,"end":1988.71,"speaker":"Fr Stephen De Young","text":"And people love. Love beasts. I know, but we talked about how these are. These are, again, not just sort of visual representations of Earth empires, but these are the spiritual beings, the demonic forces that are animating those empires. Right, right. That succession of empires that culminates with the fourth beast, who's sort of the super beast, who's Rome. And then after we've had those described and that. That sort of final beast is. Has the horn, that's blasphem, etc, etc. And then we get to verse nine and this is where we're gonna pick up on our focus. And as Father Andrew mentioned, we talked about this in terms of the Ascension, but now we're going to be going through it specifically in terms of the two figures who we see here involved in heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":1989.35,"end":2045.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I just want to read this passage real quick, just so everyone can have it in their heads as we go. So I'm just going to really quickly read. This is Daniel chapter seven. I'm going to read verses nine through 12 as I looked, thrones were placed, and the Ancient of Days took his seat. His clothing was white as snow, and the hair of his head like pure wool. His throne was fiery flames. Its wheels were burning fire. A stream of fire issued and came out from before him. A thousand thousands served him, and. And 10,000 times 10,000 stood before him. The court sat in judgment and the books were opened. I looked then, because of the sound of the great words that the horn was speaking. And as I looked, the beast was killed and its body destroyed and given over to be burned with fire. As for the rest of the beasts, their dominion was taken away, but their lives were prolonged for a season and a time. So that's the first part we're going."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2045.2,"end":2071.25,"speaker":"Fr Stephen De Young","text":"To be looking at now, right? Yeah. And so the figure we have here is the Ancient of Days. Right, Right. And he's described, he's named as that. And it's sort of expected that we all know who this is. Right. Even though this is not a title that's used for Yahweh, the God of Israel in the other parts of the."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2071.25,"end":2074.54,"speaker":"Fr Andrew Stephen Damick","text":"Old Testament, it's unique to this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2075.1,"end":2095.82,"speaker":"Fr Stephen De Young","text":"It's not one of his sort of regular titles. Right. The Ancient of Days. Right. And Ancient of Days here is basically a phrase. We've sort of so categorized it in our head that we miss it. Right. Ancient of Day, having many days or having many years was an idiom for being really old."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2096.38,"end":2096.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2097.5,"end":2140.15,"speaker":"Fr Stephen De Young","text":"So the idea is that here, Yahweh, the God of Israel, is being depicted as this elderly man. Right. This very, very old man. And that goes with the. His clothing being white as snow and the hair of his head being like pure wool. Right. It's white. Okay, so now we're gonna freak people out. But don't, don't get to it. Unless you listen to the Ascension episode, then you know where we're going with this. But yes, people are gonna get. Right. So in this description, Yahweh, the God of Israel, is being described with descriptive terms that were normally used for the God El in Canaanite mythology."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2141.03,"end":2142.87,"speaker":"Fr Andrew Stephen Damick","text":"Right. The father of baal."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2143.75,"end":2176.43,"speaker":"Fr Stephen De Young","text":"Yeah, Press hold. We'll come back to it. We'll explain. Don't freak out. Right. He's being described in those terms. They are not saying he is El. The name L does not appear here. Right. It's just descriptors are being used. Right. That would connect it to that in the. The ears of the hearers originally. Notice also. And this, this becomes. One of the key things about this passage is that thrones, plural, are set up, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2176.75,"end":2177.31,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2178.27,"end":2222.64,"speaker":"Fr Stephen De Young","text":"And the God of Israel takes his seat and his throne is described as being fiery flames. Right? That's an angelic descriptor. Right. The cherubim, the seraphim, on whom he's enthroned. And we get the description of wheels, because this is a throne chariot, as we've talked about before. Right, right. This is the meerkava, Right, the throne chariot. And the court sits in judgment. So this is the divine council, Right. This is Yahweh, the God of Israel, and the angelic beings, right, with whom he has chosen to share his. His rule. And they're now going to deal with these beasts, Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2223.28,"end":2226.4,"speaker":"Fr Andrew Stephen Damick","text":"So they're. They're being. They're being called in front of the court, basically."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2226.8,"end":2236.96,"speaker":"Fr Stephen De Young","text":"Right. And so it says that the. The. Now, again, when we say court, I know there's some of you who are thinking courtroom."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2237.68,"end":2238.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, this is a royal court."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2238.96,"end":2240.56,"speaker":"Fr Stephen De Young","text":"It's a trap. Royal court."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2240.88,"end":2241.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2242.88,"end":2265.44,"speaker":"Fr Stephen De Young","text":"They didn't have courtrooms. They didn't have that kind of. Right. This is the royal court. Right. Where judgment takes place and the books are opened is the way it's translated. This is another rabbit hole we're not going down today. At some point in the future, we will do an episode on the heavenly books. I know there's."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2265.68,"end":2266.4,"speaker":"Fr Andrew Stephen Damick","text":"In the Bible."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2266.4,"end":2267.2,"speaker":"Fr Stephen De Young","text":"No, now."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2268.48,"end":2271.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, books in the Bible. Not the books of the Bible."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2271.92,"end":2307.85,"speaker":"Fr Stephen De Young","text":"The short version is. And this is something that's not just an Old Testament thing like the Book of Life and the heavenly books and these kind of things and shows up again in the New Testament. But this is an ancient near east thing. And the idea, a very general sense, again, we'll talk about this more in the future, is that there are tablets or scrolls or books in heaven in which sort of angelic or divine scribes write down everything that happens on earth. The words that are spoken by people, the things people do."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2308.57,"end":2309.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2309.46,"end":2311.98,"speaker":"Fr Stephen De Young","text":"These are all. These are all noted."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2312.54,"end":2318.14,"speaker":"Fr Andrew Stephen Damick","text":"So this is the evidence, basically, then being pulled out against the beasts."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2318.54,"end":2338.36,"speaker":"Fr Stephen De Young","text":"Right? And so that final beast, right, the super beast, right, Gets. Gets killed and given over to be burned. Right. And then the other beasts, the lesser beasts, have their dominion taken away, but they're not imprisoned or thrown into the fire."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2338.84,"end":2340.8,"speaker":"Fr Andrew Stephen Damick","text":"They're still around, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2340.8,"end":2364.2,"speaker":"Fr Stephen De Young","text":"They're still around. They just don't have their authority anymore. Okay? So that authority, that dominion that they had, right, as angelic beings who are governing the nations, is taken away from them. And now in verses 13 and 14, we're going to see that authority that they had seized over the nations. These demonic beings is going to be given to someone else."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2364.65,"end":2392.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay. Verses 13 and 14. I saw in the night visions. And behold, with the clouds of heaven, there came one, like a Son of Man. And he came to the Ancient of Days and was presented before him. And to him was given dominion and glory and a kingdom that all peoples, nations and languages should serve him. His dominion is an everlasting dominion which shall not pass away, and his kingdom, one that shall not be destroyed."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2395.77,"end":2414.73,"speaker":"Fr Stephen De Young","text":"So we see now this second figure, right, this second person, right, who is described as being one, like a son of man. So this is. He looked like a man, he's a human. Right. But even though he looks human."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2417.3,"end":2417.46,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2417.46,"end":2432.74,"speaker":"Fr Stephen De Young","text":"Why would you say he just looks so human? Why wouldn't he say then I saw a man or that I saw the Son of Man? Right. Because he arrives, he comes up in front of the Ancient of Days, riding on the clouds of heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2433.14,"end":2439.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, you know, as we've seen before, this is co opting BAAL language, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2439.3,"end":2509.97,"speaker":"Fr Stephen De Young","text":"This is BAAL language, who was the son of El, right, in Canaanite mythology. Right. And so what we've got here is sort of a remix, a correction of. And we talked about this more in the Ascension episode, the enthronement of BAAL in the Bale cycle, right? Where after BAAL has totally won like all of his battles and stuff, total winner, then he gets. Right. Enthroned by his, by his father. Right, right. So but what's interesting here in this case, right, so continuities and discontinuities, right? So on one hand we're taking. So it's like, okay, no, that, that, that Bail story, that Ellen Bail story is pro devil propaganda, right? So we're going to correct the record. And part of that correction here, one of the discontinuities in the. Is that that BAAL language that's applied to the Son of Man here is applied to Yahweh in the rest of the Old Testament."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2511.81,"end":2518.85,"speaker":"Fr Andrew Stephen Damick","text":"So this is an indication that this one who is like a son of man is Yahweh."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2519.33,"end":2529.09,"speaker":"Fr Stephen De Young","text":"Right. And probably the most famous place for our, at least our orthodox listeners for that is going to be Psalm 104 or 103. 3:4, because we read it at vespers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2530.09,"end":2531.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2533.21,"end":2535.65,"speaker":"Fr Stephen De Young","text":"That talks about Yahweh riding on the."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2535.65,"end":2539.77,"speaker":"Fr Andrew Stephen Damick","text":"Clouds of heaven, makes the clouds his chariot, rides on the wings of the wind."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2540.49,"end":2580.82,"speaker":"Fr Stephen De Young","text":"Yeah, right. And then Isaiah 19, verse 1 does the same thing and there are more examples. But so this, this Baal language has already been co opted to Yahweh. Right. So part of the correction that's taking place here is that both the divine father figure and the divine son figure are both Yahweh, the God of Israel. Right. But the divine Son is both divine and human."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2581.86,"end":2583.78,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2583.86,"end":2592.22,"speaker":"Fr Stephen De Young","text":"Right. Because he has, he's the Son of Adam, but also is doing what Yahweh does."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2592.22,"end":2592.98,"speaker":"Fr Andrew Stephen Damick","text":"Yahweh things."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2592.98,"end":2630.52,"speaker":"Fr Stephen De Young","text":"Yeah, Right. And so the correction here is that BAAL did not go and win a totally win a whole bunch of victories and kick everybody's rear and then get enthroned by his father El after he over successfully had his revolution and overthrew the most high God, rather Yahweh, a human. Yahweh is enthroned by his Father, who is Yahweh. Yeah. Right. So we have two figures, two persons."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2630.68,"end":2632.96,"speaker":"Fr Andrew Stephen Damick","text":"Who are both God, who are both."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2632.96,"end":2638.8,"speaker":"Fr Stephen De Young","text":"Yahweh, the God of Israel. Right. Not just divine in a general sense. Right. Not two gods."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2639.44,"end":2640.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. One God."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2640.88,"end":2651.2,"speaker":"Fr Stephen De Young","text":"They're both Yahweh, the God of Israel. Right. One a father, one a son. And the Son is also human. That's in Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2652.48,"end":2652.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2654.56,"end":2692.57,"speaker":"Fr Stephen De Young","text":"You're going to say that sounds like Christianity and you're Right, Right. And so what happens when he's enthroned? Well, verse 14, again, Tim is given dominion and glory and a kingdom. Right. That dominion and glory and kingdom that was taken away from those demonic powers is given to him. Right, Right. So all power, all authority in heaven and on earth has been given to him here. Could put it that way here in Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2692.65,"end":2693.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2696.17,"end":2704.97,"speaker":"Fr Stephen De Young","text":"And notice the language here too, that, that in Daniel, all peoples, nations and languages should serve him."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2705.29,"end":2705.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2705.73,"end":2707.05,"speaker":"Fr Stephen De Young","text":"Why throw in languages?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2707.45,"end":2731.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's a reversal of, of the Tower of Babel. Not just, you know, to say, okay, everybody, everybody's going to serve him. But you know, if you think about what happens at Babel, this is the beginning of human beings being dominated by, you know, fallen. The fallen dominions. So these are those people understood in specifically Babel terms being handed over to the Son of Man."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2732.74,"end":2766.47,"speaker":"Fr Stephen De Young","text":"Right, right. And, and his dominion then is an everlasting dominion that doesn't pass away. His kingdom is not destroyed. It's permanent. There's not going to be another successor, there's not going to be anybody else. And his kingdom shall have no end. Sorry, dispensationalists and premillennialists in general Daniel7, man, what can I say? So we do need to briefly address something that is popular in some orthodox circles."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2766.79,"end":2770.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, this is the part where some people might get a little unhappy with it."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2770.47,"end":2788.6,"speaker":"Fr Stephen De Young","text":"Oh, we're going to make people mad all night tonight. We got the CS Lewis fans mad at us again. Now we're going to get these folks mad at us. That's okay. I'm not on social media, so I won't even know I have to take it all. Yes, you're the scapegoat for the show."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2789.96,"end":2791.88,"speaker":"Fr Andrew Stephen Damick","text":"I'm the one sent out to Azazel."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2794.52,"end":2822.14,"speaker":"Fr Stephen De Young","text":"And this is that there are folks who, for a variety of reasons, want to identify these two figures in Daniel 7 not as God the Father and God the Son. Right. Not as the Father and Son within the Holy Trinity, but they want to identify the Ancient of Days as Christ's divine nature and the Son of Man is his human nature."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2823.1,"end":2828.3,"speaker":"Fr Andrew Stephen Damick","text":"Which, I mean, when you put it that way, it sounds like a vaguely Nestorian scene."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2828.78,"end":2833.02,"speaker":"Fr Stephen De Young","text":"It is kind. Now, they're not. None of these people we're talking about are Nestorians."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2833.02,"end":2834.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not trying to go there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2834.7,"end":2837.42,"speaker":"Fr Stephen De Young","text":"They're not trying to do that. They have no intent to do that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2838.06,"end":2851.9,"speaker":"Fr Andrew Stephen Damick","text":"But it's problematic because it is clear that there's two persons in Daniel 7. One is enthroning the other. The one who comes on the clouds comes to the Ancient of Days."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2852.99,"end":2853.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2853.23,"end":2855.71,"speaker":"Fr Andrew Stephen Damick","text":"It's very clear that there are two different figures here."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2855.95,"end":2875.15,"speaker":"Fr Stephen De Young","text":"Right. And if. And you know, if this is some kind of depiction of the Incarnation, that that would mean, well, you have this divine person, Christ, who pre exists and then this human person gets joined to him somehow. Right. Which again, that's kind of what Nestorianism is. Right. They don't push it this far."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2875.39,"end":2875.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2875.71,"end":2945.12,"speaker":"Fr Stephen De Young","text":"But if you push it at all, that's where you end up. Right. That's why this is problematic. So, yeah, it doesn't work for a bunch of sense. And also, the Son of Man here isn't just a human. Right. He's riding on the clouds. He's a human divine figure. Right, Right. So you have a divine figure and a human divine figure, not a divine figure and a human figure. Right. So it doesn't. The text doesn't really work that way either. So sometimes where folks will go, the folks who have this idea, the way they'll get there or the way they'll back up that understanding is to go to Revelation Chapter one. It's Revelation singular, folks just say the Apocalypse. Yes. Or the Apocalypse. Not the Apocalypses. The apocalypse singular, chapter one, verses 12 through 15, in which there's A description of Christ, of the heavenly resurrected Christ who St. John sees."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":2945.84,"end":3005.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. There's a single figure here. And so St. John says this. Then I turned to see the voice that was speaking to me, and on turning, I saw seven golden lampstands. And in the midst of the lamp stands one like a son of man, clothed with a long robe and with a golden sash around his chest. The hairs of his head were white like white wool like snow. His eyes were like a flame of fire. His feet were like burnished bronze refined in a furnace. And his voice was like the roar of many waters. So there you've got that description of him with the really white hair like wool. Right. So you get the descriptive language of the Ancient of Days figure from Daniel 7 now is being applied to Christ. Right. So that kind of explains why people would read. Would try to read Daniel 7 in that way. But I mean, what is going on here? Why the Ancient of Days physical description, why is that now being applied to Christ?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3006.04,"end":3036.76,"speaker":"Fr Stephen De Young","text":"Right, right. And so they want to interpret it as if sort of the two figures merge together. Right. Sort of the Incarnation, which, again, kind of historianism, if you push on it. And I don't think that's what St. John is saying here, Right, No. So the place where we go to understand what St. John is doing here. Right? Because Revelation is easily the most difficult part of St. John's writings. Easily the most difficult part of it to understand."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3037.36,"end":3038.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, sure. Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3038.64,"end":3040.16,"speaker":"Fr Stephen De Young","text":"By. By a fair margin."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3040.4,"end":3047.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think most people would agree with that. Like, that is. That would. That might be the most uncontroversial thing we'll say this evening."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3047.48,"end":3167.49,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And pretty much all the church fathers agree on that. That's why a lot of them had issues with the book in general. Right. Like maybe we don't want people to read this, you know, because, hey, what could go wrong? It's not like people could start cults or something. But so what we want to do is this is the way what we have here within this apocalyptic literature, within this vision, we have this sort of poetic description of Christ. Right? Of the risen Christ. So if we want to get this in another format, an easier to understand format, something more like prose and less like poetry, Right. We go to St. John's other writings and say, for example, in St. John's Gospel, how does he see Christ? Right, right. For lack of a better term, what is his Christology? Right. How does he talk about Christ in his Gospel? And then how might that be reflected in this description? Right. And what we see over and over again in St. John's Gospel in particular. Right. Is this idea of Christ as son of the Father in the sense we were talking about before, in the sense that he is imaging the Father. Right. So he's going to say he does the only the works of his Father. He does only what the Father does. He says only what the Father says. Right. Only those things that the Father gives him. He's going to say to his disciples, if you have seen me, you have seen the Father. Right. So that's image at a very literal level. Yeah, right, right. That, that he is The Express, as St. Paul is going to say. He's the express image. Right. Of the Father. Right. Christ, who is seen as the express image of the Father who is unseen. So if we read St. John's Gospel first and that's how we have the idea of Christ, then if he's going to see the risen heavenly Christ, who's he going to look like?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3168.53,"end":3169.65,"speaker":"Fr Andrew Stephen Damick","text":"His Father."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3170.29,"end":3171.65,"speaker":"Fr Stephen De Young","text":"Right, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3171.65,"end":3175.41,"speaker":"Fr Andrew Stephen Damick","text":"And we have a description of the father from Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3176.04,"end":3177.64,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3178.36,"end":3206.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so then here's the part that'll this is where the rubber meets the road for some people. What about icons of this scene from Daniel 7? When you know where it's. So if we're saying that the one we posted. Yeah, right. Just like that one. The one we posted online where you know, if we're saying that this is the Father and the Son. I thought there was a rule that you're not allowed to make icons of God the Father. What's up with that?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3206.7,"end":3221.38,"speaker":"Fr Stephen De Young","text":"Yo, they're, they're kinda is. Right, right. So there is a basic thing. And Father Stephen Bigham. Not me. Another Father Stephen. Right. He spells not."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3221.38,"end":3221.98,"speaker":"Fr Andrew Stephen Damick","text":"Not me."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3222.38,"end":3222.7,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3222.7,"end":3223.1,"speaker":"Fr Andrew Stephen Damick","text":"He's."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3223.1,"end":3225.62,"speaker":"Fr Stephen De Young","text":"He spells it wrong. He spells it with a V. With."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3225.62,"end":3225.98,"speaker":"Fr Andrew Stephen Damick","text":"A V."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3228.86,"end":3246.98,"speaker":"Fr Stephen De Young","text":"Father Stephen Bigham wrote a book, lovely man, called Where? Hey, I'm about to promo his book. He could take a little ribbon. Wrote a book called the Image of God the Father in Orthodox Theology and Iconography that was published by St. Vlad's Seminary Press."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3247.14,"end":3247.7,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3248.02,"end":3249.46,"speaker":"Fr Stephen De Young","text":"St. Vladimir's sorry."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3249.46,"end":3250.34,"speaker":"Fr Andrew Stephen Damick","text":"Still. Still available."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3252.5,"end":3289.59,"speaker":"Fr Stephen De Young","text":"And he sets out this issue very plainly in the book. And that issue is. It is very clear that it is verboten in the Orthodox Church to make icons of God the Father. It is also true that if you travel at all and go to centuries old churches, the Orthodox Church in Russia, on Mount Athos and other places, you find icons of God the Father. There are miracle working icons that depict God the Father."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3290.15,"end":3299.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, when I was on Mount Athos four years ago. I saw them just about everywhere. Like they were really, really common."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3300.23,"end":3300.71,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3301.35,"end":3333.24,"speaker":"Fr Andrew Stephen Damick","text":"And they weren't all even depicting this scene necessarily. I mean, some of them you get what we call the paternity icon, where it's Christ as a young man seated in the lap of the ancient of days, his father. Others you get them side by side on thrones, side by side, you know, Christ as a mature man, bearded, and then you know, the white haired God, the Father next to him. But, but yeah, I mean, super common, super, super common."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3333.72,"end":3340.85,"speaker":"Fr Stephen De Young","text":"Right. And both of these things are just true. Yeah, that's reality."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3341.01,"end":3425.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although. Although, you know, to the best of our knowledge. So don't at us bros. Actually, you know, go ahead, go ahead, send us the email. Yeah, at me. There you go. Yeah, exactly. I am the one sent to Azazel. But the only like explicit canon against this that we are aware of was from the Moscow Council of 1667. It has an explicit canon that says you may not make icons of the Father. Clearly when they put out a canon like this, that means that it's happening. Yeah. You don't make a rule against something that's not. You try not to make a rule against something that's not a problem. But it seems that generally within the tradition, it's more often that there's commentaries on iconographic canons that draw this as a conclusion. Right. That you're not supposed to make icons of God the Father. And yet here it is. And so, I mean, and this is the reason then why some people try to reconcile these two things. Like you're not supposed to make icons of the God of the Father. And boy, that looks like God the Father up there. Oh, that must be. Oh, Christ is the ancient of days. And sometimes you even see icons where you see the cruciform halo above this ancient of days."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3425.93,"end":3427.37,"speaker":"Fr Stephen De Young","text":"Or the words ancient of days."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3427.93,"end":3428.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3428.97,"end":3431.13,"speaker":"Fr Stephen De Young","text":"With the cruciform thing. Right. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3431.77,"end":3436.01,"speaker":"Fr Andrew Stephen Damick","text":"Which doesn't really line up with what you see in Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3436.25,"end":3453.02,"speaker":"Fr Stephen De Young","text":"Right. Well, and beyond that, beyond that, right. People will say, oh, well, that's the ancient of days. That's the pre incarnate Christ kind of idea. Right. Enabled in order to get around and say that's why that icon's. Okay, here's the problem that makes the icon uncanonical."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3453.74,"end":3454.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3454.54,"end":3475.08,"speaker":"Fr Stephen De Young","text":"Because there is an ecumenical canon from the Quintessex Council that says that Christ is only to be depicted as he appeared in the incarnation. In iconography, he's not to be depicted as a lamb. He is not to be Depicted as. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3475.08,"end":3476.36,"speaker":"Fr Andrew Stephen Damick","text":"As an old man."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3476.84,"end":3487,"speaker":"Fr Stephen De Young","text":"Right. So depicting the pre incarnate Christ or claiming to is a violation of an ecumenical canon, whereas technically God the Father isn't."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3488.36,"end":3488.76,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3489,"end":3490.2,"speaker":"Fr Stephen De Young","text":"So that's actually worse."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3490.84,"end":3516.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Of an ecumenical canon. Yeah. So I mean, now by saying all this, we're not trying to put our flagpole in the ground and stake out a position on whether you should or should not or could or could not. We're just saying this is kind of the way that it is. This is what we see. There's these rules against it, but then we see lots of them as well in many venerable churches painted by master and sometimes sainted iconographers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3516.19,"end":3523.03,"speaker":"Fr Stephen De Young","text":"Yes. And God has worked miracles through some of those icons. Right, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3523.11,"end":3531.5,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, we're not saying the rules are bad, but you know, God is not bound by the rules, even his own rules."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3531.74,"end":3572.22,"speaker":"Fr Stephen De Young","text":"Right. That's where this comes together. God is not bound by his rules. And this applies at a lot of places. So we talk all the time about there's canonical order in the Church. The Holy Spirit is a spirit of order, not of chaos. And there is good order in the church. And so when the church says all kinds of things, Right. Like baptism is necessary for salvation. Right. People will say, well, what about, what about, what about all the cases where there's somebody. Does that mean they go to hell?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3573.02,"end":3573.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3573.58,"end":3584.27,"speaker":"Fr Stephen De Young","text":"Right. And it's like, no, God is not limited by his rules. Right. Yet God has given us these rules, so you need to get baptized."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3584.67,"end":3587.47,"speaker":"Fr Andrew Stephen Damick","text":"Right. The norms. They're the norms."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3587.47,"end":3614.63,"speaker":"Fr Stephen De Young","text":"That's what we're saying. Right, that's what we're saying. So we follow what God says and then God does what he will. Right. That goes beyond our expectations and beyond our, our understanding. Right. But we follow what he told us to do. Right. These are restrictions on us, not on Him. Right. So God could take imperfect, even non canonical icons and work through them if he so chooses."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3615.19,"end":3615.99,"speaker":"Fr Andrew Stephen Damick","text":"And he does."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3616.23,"end":3630.39,"speaker":"Fr Stephen De Young","text":"Right. And that doesn't void the rule either. Right, Right. That doesn't make the rule irrelevant either. Right. It just means God can do what he wants because he's God. I'm not. So I follow."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3630.47,"end":3631.35,"speaker":"Fr Andrew Stephen Damick","text":"Thank God for that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3632.15,"end":3632.63,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3634.79,"end":3636.47,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I like you, but I wouldn't."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3636.47,"end":3670.66,"speaker":"Fr Stephen De Young","text":"No, I would be painful and terrible. Yeah. I'd be way more in the Zeus camp than the. Yeah. So there's a little more here in Daniel 7, because after, I mean, that's the vision really. But then from verse 15 to the end, is Daniel then sort of having a conversation with his angelic. Guide about what he just saw. So there's a little more interpretation of that vision that comes out here in these, these last verses."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3670.66,"end":3699.59,"speaker":"Fr Andrew Stephen Damick","text":"The angelic guide gives us interpretations saying these four beasts are, you know, it says four kings who shall arise out of the earth. But remember everybody, this is not just about particular emperors or kings. These are the demonic forces that back those empires. And then it says in verse 18, but the saints, the holy ones of the Most High, shall receive the kingdom and possess the kingdom forever. Forever and ever. Sharing of the kingdom with the saints."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3699.91,"end":3713.27,"speaker":"Fr Stephen De Young","text":"And that arise out of the earth is important because we see the word earth and we think the ground, the soil. Right. And it can refer to that. But Haaretz is also used to refer to the underworld."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3714.47,"end":3718.71,"speaker":"Fr Andrew Stephen Damick","text":"And also a newspaper in modern day Israel."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3718.79,"end":3722.23,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. Now they mean it in the sense of earth or the world."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3722.56,"end":3723.36,"speaker":"Fr Andrew Stephen Damick","text":"The world, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3724.24,"end":3729.36,"speaker":"Fr Stephen De Young","text":"Not the underworld, hell, the newspaper. But."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3731.12,"end":3731.76,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3733.92,"end":3752.49,"speaker":"Fr Stephen De Young","text":"But yes, it is used in these ancient to refer to the underworld. Right. When the serpent is cast down to the earth, it's. He's being cast down. The devil's being cast down to the underworld. Right. That's it here. So when we hear about these kings, these beasts arising up out of the earth, that's what we're intended to see. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3752.49,"end":3752.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3752.81,"end":3759.69,"speaker":"Fr Stephen De Young","text":"These are demonic spirits that we're talking about. Right. Not just the humans who they've enslaved to do their bidding."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3759.93,"end":3760.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3760.37,"end":3769.53,"speaker":"Fr Stephen De Young","text":"Right. And then. Right. And here it's the, the holy ones of the Most High who received the kingdom. And then we get a little more in verses 19 through 28."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3770.25,"end":3770.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3770.73,"end":3771.77,"speaker":"Fr Stephen De Young","text":"In that interaction."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3772.17,"end":3798.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I'm not going to read all those 10 verses, but there's a war that happens between, between these demonic forces and the holy ones of God, the angels, saints. Because remember everybody, angels are the original saints. And then that's what the rest of this section is about, is that. And then there's a judgment given and the kingdom is received. Anyways."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3801.55,"end":3813.09,"speaker":"Fr Stephen De Young","text":"This isn't just talking about these foreign nations are, are persecuting Israel. Right. Which by the way, doesn't exist at this point in time. They're a bunch of exiles."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3813.25,"end":3813.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3813.81,"end":3843.68,"speaker":"Fr Stephen De Young","text":"From Judah, from one tribe. One and a half really. But anyway, so the, and, and you know, the, the beasts. Right. The first one is Babylon. Right. And Babylon wasn't persecuting Israel. Right. Babylon was sent by God to take Israel into exile to chasten them for."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3843.68,"end":3845.88,"speaker":"Fr Andrew Stephen Damick","text":"Their sins as judgment. Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3845.88,"end":3853.56,"speaker":"Fr Stephen De Young","text":"As God's judgment. So that's not just, oh, evil persecutor Right. And the Persians, Cyrus let them go home."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3854.36,"end":3854.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3855.24,"end":3900.72,"speaker":"Fr Stephen De Young","text":"Right. So, right. Cyrus isn't an evil demonic beast. This isn't talking about the humans involved. This is talking about what elsewhere in Daniel. Right. The Prince of Persia, the prince of Greece, who the archangels Gabriel and Michael battle against. Right, right. And do battle with. These are the, the, the demonic forces behind those empires who are in conflict with the holy ones of God. Right. And so that judgment we read about from the ancient of days resolves that conflict. Right. The Son of Man is victorious over those demonic forces. Right, Right. And then here, when it's described, the kingdom is received by the people of the holy ones of God."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3900.72,"end":3928.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's interesting. Where is that phrase? I'm trying to see where this is anyway? Yeah, it is. Oh, yeah, yeah. In verse 27, given to the people of the saints or the people of the holy ones of the Most High, which is interesting. It's not just a repetition of the phrase earlier that it's going to be given to the saints or the holy ones of the Most High. It's the people of them. So you have the sense now that these are human beings. They're not just the angels."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3929.61,"end":3935.53,"speaker":"Fr Stephen De Young","text":"Right. And so this victory that's won by the Son of Man spoilers by Christ."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3935.85,"end":3936.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3937.64,"end":3979.36,"speaker":"Fr Stephen De Young","text":"He receives the kingdom. The holy ones receive the kingdom. The holy ones are victorious, and Christ's people receive the kingdom. And Christ's people are victorious. Right. In this, in this spiritual war. And so this understanding of what's going on in Daniel 7, this is where St. Paul gets the idea that he tells to the Corinthians that we're going to judge angels someday. And this is where St. John gets the idea that in Christ's kingdom, the martyrs are reigning with Christ Right. Over this world as part of the council. Right. That they have received this kingdom also."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3979.76,"end":3983.84,"speaker":"Fr Andrew Stephen Damick","text":"So are you saying that the apostles aren't just making this stuff up in the New Testament?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3984.8,"end":3985.2,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":3988.08,"end":4002.4,"speaker":"Fr Andrew Stephen Damick","text":"I had to get at least one of those monosyllabic answers for this episode. Right. All right. Well, that wraps up the first half of our episode of the Lord of Spirits tonight. And we're going to take a brief break and we'll be right back."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4002.88,"end":4019.16,"speaker":"Voice Of Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4028.2,"end":4073.04,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer. Are you an Orthodox Christian looking for a reliable first place to send your interested friends? Do you need help finding an Orthodox church near you? My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook. I serve in the Greek Orthodox Archdiocese of America. And I'm Fr. Andrew Stephen Damick, Chief Content Officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox Intro team."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4073.44,"end":4075.08,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4075.08,"end":4077.08,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4077.08,"end":4079.44,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4079.6,"end":4085.36,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4085.36,"end":4089.52,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos of the Internet, a place to get."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4089.52,"end":4109.79,"speaker":"Fr Andrew Stephen Damick","text":"Help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient Faith Ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4118.59,"end":4134.75,"speaker":"Voice Of Steve","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4136.91,"end":4145.15,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the second half of Lord of Spirits. I think we should check out that orthodoxintro.org Father Stephen, what do you think?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4145.79,"end":4150.67,"speaker":"Fr Stephen De Young","text":"It sounds like a good website, but the guy promoting it there seemed a little untrustworthy, so I don't know."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4151.07,"end":4154.19,"speaker":"Fr Andrew Stephen Damick","text":"It's true. Well, there's a few other people involved."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4154.19,"end":4159.8,"speaker":"Fr Stephen De Young","text":"Yeah, I'm sure he's not there like reading it to you or anything, so hopefully just go and."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4159.96,"end":4204.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So. All right. Well, welcome back. And so we just covered a whole section from Daniel 7 where we talked about the Son of Man and what happens in there. And now we're going to kind of, I don't know, pan out a little bit, you know, take a higher level look at some of this stuff and see what's going on in this with this title of Son of Man, especially now as it gets received in the literature of the Second Temple period. Right. So Daniel 7, it's not just some chapter in the Old Testament, actually gets really focused on a lot."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4204.88,"end":4221.46,"speaker":"Fr Stephen De Young","text":"Right, right. Daniel, Daniel 7. This story we just went through in some detail becomes the locus classicus for a whole discussion within Second Temple Judaism, so Second Temple Judaism, remember, forms after the return from exile."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4221.94,"end":4222.34,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4222.34,"end":4252.03,"speaker":"Fr Stephen De Young","text":"And so Daniel is one of, if not the right latest sort of prophetic book that's written in the, in the Old Testament. Now I'm defining prophetic really strictly there, Right. We have other historical books, Ezra, Nehemiah, right. In the, in the larger canon, first and Second Maccabees, that kind of prophets."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4252.19,"end":4253.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4253.19,"end":4303.55,"speaker":"Fr Stephen De Young","text":"But in terms of a writing prophet, right, this is one of the last. Right. And so it represents for the Second Temple period, Right. Sort of the visions of Daniel and this kind of thing represent sort of the state of the art, of their expectations of God's deliverance in the future. Right. So again, this is a rabbit trail. We won't totally go down. Maybe we'll just do a Daniel episode at some point. But Daniel actually predicted pretty much exactly when Christ was going to be born, like to the year. And that's why. And they understood it that way at the time. That's why you get all these phony messiahs showing up in the first century BC and the first century ad. Right, because they were doing the math from Daniel and being like, it's around time, you know, they didn't just have."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4303.55,"end":4306.79,"speaker":"Fr Andrew Stephen Damick","text":"A herald camping around at that time, predicting the end of the world."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4306.87,"end":4425.75,"speaker":"Fr Stephen De Young","text":"No, no, they're actually reading it. They said this is sort of embedded here. Right? Now we can say, to be fair to old Harold, who at least had the decency to admit that he was wrong and retire from prognosticating, he did to his credit, right? You'd be charitable and say, well, he thought, hey, if Daniel did it, maybe St. John did too, and we could do this with Revelation. But the answer is no. So, but in particular, Daniel 7, the discussion here is that you see here very clearly what becomes referred to in these Jewish sources as two powers in heaven, right? You see these two figures who are both Yahweh, the God of Israel, in some sense, right. And it's not going to be clear to them in exactly what sense we're going to talk about. There are a whole bunch of different views and ideas of what's going on here within Second Temple Judaism. But there it's clear that something's going on here, right? And then. So the reason I say this is the locus classicus is that then the discussion branches out from here. So it starts here where it's sort of clear that there are these two figures. And then they go back and start reading some of the passages we've been talking about the last Couple of shows, right? And say, oh, well, yeah, here there's this angel of the Lord figure, you know, here there's this word of the Lord figure, right? And. Or word of God figure. And some more stuff we're going to talk about next time. But. But it branches out sort of from this Daniel 7 passage, right? To go into these other passages and say, well, this must be that same second figure that's a second power in heaven, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4425.75,"end":4438.71,"speaker":"Fr Andrew Stephen Damick","text":"Because. Because it's so clear in the Daniel 7 passage that this is a divine figure. Divine also Yahweh. Yeah, Divine human figure is also Yahweh. Yeah, yeah, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4439.03,"end":4463.52,"speaker":"Fr Stephen De Young","text":"And so to clarify the terminology, okay, right. When we say second power in heaven, right. The word that's being used in Greek is not dynamis, which we. Sometimes that's where dynamite gets its name. But that can mean power or strength, right? And that's why we yell it before the loud verse of the Trisagian."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4463.92,"end":4470.72,"speaker":"Fr Andrew Stephen Damick","text":"That's right. In Greek and Antiochian tradition, sorry, Russians, you guys don't get to do that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4473.44,"end":4495.4,"speaker":"Fr Stephen De Young","text":"And so this is not that word. This is the word exousia, right? And you probably heard usia in there, right? Which is usually translated as being or essence. And you probably heard X in there, like out of. And you're thinking, wow, I could do something here. But it's like butterfly, don't go crazy."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4495.48,"end":4498.28,"speaker":"Fr Andrew Stephen Damick","text":"Doesn't mean butter fly, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4498.6,"end":4510.69,"speaker":"Fr Stephen De Young","text":"You can kind of do something with this, but it's not worth the time and effort. Right? Here's what the word means. It's power in the sense of freedom to act. Yeah, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4511.73,"end":4517.29,"speaker":"Fr Andrew Stephen Damick","text":"And as I say, and this word also gets translated sometimes as authority, but."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4517.29,"end":4613.07,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, it is. The word in all authority, in heaven and on earth has been given to me. Right? Right. It means freedom to act. And another invariable future episode, we'll talk about what the will is. Because the ancient understanding of words like nature and will and free will and these kind of things is very different than our modern understanding, right? So when I say freedom to act or free will for exousia in this case, people are probably thinking, well, wait a minute, like nobody else can choose. But that's not what it's talking about. The idea is that, right. In a monotheistic understanding, right. Or a henotheistic understanding, or however you want to look at it, you would have a most high God who is sort of utterly free to act, right? And then all subsidiary created beings, by virtue of being created. Right. Would be in some sense limited or Restricted by their created status and therefore not completely free. Right. So we have. We have agency as humans. Right. We're able to do things. Right. But agency is restricted by structures. Right. By created reality. So I can't fly. I can will myself to fly."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4614.03,"end":4614.43,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4614.51,"end":4619.47,"speaker":"Fr Stephen De Young","text":"Right. I could fly downward at terminal velocity, but that's about it. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4619.47,"end":4623.47,"speaker":"Fr Andrew Stephen Damick","text":"They say flying is throwing yourself at the earth and missing."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4623.63,"end":4668.87,"speaker":"Fr Stephen De Young","text":"Yeah. I would hit. Right. I would hit. If I would try that. Right. So there's all kinds of things, right. That. That restrict that. That freedom to act based on. Right. Being created. Right. And so the angels, Right. While we call them heavenly powers. Right. The powers of heaven. Right. And they may be freer than we are in certain senses are not utterly free. They're created beings. Right. And so they are likewise restricted. So the idea of a second power in heaven is that there's a second person, right. Who. Like God. Right. Like the most High God is able to act freely."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4669.43,"end":4669.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4670.23,"end":4679.11,"speaker":"Fr Stephen De Young","text":"That does not necessarily imply. This is another thing that we'll talk about in that eventual free will episode. That does not imply that they could be at odds with each other."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4679.99,"end":4683.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Two wills doesn't mean. Or two freedoms."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4683.51,"end":4684.71,"speaker":"Fr Stephen De Young","text":"It's not two wills. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4684.79,"end":4688.48,"speaker":"Fr Andrew Stephen Damick","text":"Excuse me, sorry. Two free agents."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4689.52,"end":4692.12,"speaker":"Fr Stephen De Young","text":"I'm sorry, more heresy from Father Andrew."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4692.12,"end":4693.28,"speaker":"Fr Andrew Stephen Damick","text":"No, But. But it is true."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4693.6,"end":4694.4,"speaker":"Fr Stephen De Young","text":"At 6 execut."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4695.28,"end":4701.92,"speaker":"Fr Andrew Stephen Damick","text":"So I was gonna say, but. But it is true. Two wills does not necessarily imply opposition. We're talking Christology, Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4701.92,"end":4703.56,"speaker":"Fr Stephen De Young","text":"Yes. Right. So just to say."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4703.56,"end":4704.96,"speaker":"Fr Andrew Stephen Damick","text":"Okay, that's what I was trying to say."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4704.96,"end":4705.88,"speaker":"Fr Stephen De Young","text":"There we go. Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4705.88,"end":4708.2,"speaker":"Fr Andrew Stephen Damick","text":"A little off topic, but nonetheless true."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4708.2,"end":4744.14,"speaker":"Fr Stephen De Young","text":"Right, Right. Like. Right. That doesn't. The fact that. That if we say both the Father, the Son and the Holy Spirit for that matter, are free. Free. That doesn't mean that they ever are at odds. Right, Right. That is. That is not required for freedom. But again, we'll get into that in a later episode. But that's the idea is that there's this second figure who is free in the way God is free. Right. And so then with. Within that. Right. You get the question of. Right. Who is this son of man? Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4745.42,"end":4747.02,"speaker":"Fr Andrew Stephen Damick","text":"What exactly does that mean?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4747.34,"end":4770.22,"speaker":"Fr Stephen De Young","text":"Who is this second figure? Right. Who. Who we see in these various. In Daniel 7 and then in these various other places throughout the Old Testament. Right. Who is it? And I've kind of grouped. This is just me trying to group things. I've grouped these and there's a lot of different ones and variations, but these are the three main categories."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4770.92,"end":4771.32,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4773.64,"end":4792.92,"speaker":"Fr Stephen De Young","text":"And so the. The first category is. You Find Second Temple Jewish literature that takes the position that the Son of Man is a divinized human. Right. So this is a human person who has been divinized in some sense."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4793.32,"end":4796.68,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So like an example would be adoption."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4797.38,"end":4843.92,"speaker":"Fr Stephen De Young","text":"Right. So one way that could work is adoption. He's sort of the adopted Son of God and then is glorified. Right. Other. Other folks hold that this is a, a human who lived at some point, who was glorified upon their death and is now going to return. Right. So the Son of Man is going to return from heaven after having been glorified. And there's a whole bunch of candidates for that in different Second Temple Jewish literature. So you get Adam, you get Enoch, you get David, you get Elijah, you get Moses, you get Abraham. Right. Sort of all the people you might think might be the one who comes back, Elijah. We even see in the New Testament people ask if Christ is Elijah and if St. John the Forerunner is Elijah. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4844,"end":4863.05,"speaker":"Fr Andrew Stephen Damick","text":"And I think it might be worth just at this point to say that as you said, this stuff is around in Second Temple Jewish literature, and it kind of gives us a clue as to what the proper way for Christians to understand this literature is. Is that just because it's around in this literature doesn't mean we believe it."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4863.69,"end":4864.09,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4864.33,"end":4872.09,"speaker":"Fr Andrew Stephen Damick","text":"You know, this is the stuff that's in, you know, in, in the air. It's. It's being written down. It exists within these, these traditions."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4872.33,"end":4875.77,"speaker":"Fr Stephen De Young","text":"Right. The key is that everyone thinks there's this second figure."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4876.17,"end":4876.89,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4876.97,"end":4885.31,"speaker":"Fr Stephen De Young","text":"Everybody's at least a Binatarian, but they're very confused about who the second figure is because he had. He hasn't revealed himself yet. Yet."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4885.79,"end":4886.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4886.19,"end":4891.31,"speaker":"Fr Stephen De Young","text":"He's still a mystery that's been hidden from the ages and is unknown even to the angels. Anyway."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4891.79,"end":4892.83,"speaker":"Fr Andrew Stephen Damick","text":"I heard that somewhere."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4892.83,"end":4893.79,"speaker":"Fr Stephen De Young","text":"Quite a phrase."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4895.55,"end":4896.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4897.15,"end":4961.74,"speaker":"Fr Stephen De Young","text":"So. So there's that idea that this is someone who started out as a human and then was divinized. Right. So then there's another. A second category where they think that this is a. Some sort of created being or some second Yahweh second being that came into existence. Right. So this would include like the idea of the archangel, Metatron. Right. Or views that say that it's St. Michael the Archangel. And this would also include things like we talked about Philo of Alexandria, who thought that the Logos was sort of this being created out of God's own essence. Right. Which was a kind of idea. So that would later be found in semi arianism in the 4th century. So that's sort of A second category. Right. Is this is a second subsidiary, separate being. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4961.74,"end":4966.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Lesser divine being that gets created by Yahweh."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4966.24,"end":4984.08,"speaker":"Fr Stephen De Young","text":"Right. But a divine being nonetheless. Right, right. Doesn't start as a human. Right, Right, right. And then that being is sort of humanized in some way. Right. Rather than a human who gets divinized, this is some kind of divine being who gets humanized. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4984.08,"end":4984.64,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":4986.8,"end":5002.41,"speaker":"Fr Stephen De Young","text":"And then the third category is that this is an eternal second hypostasis of Yahweh. That Yahweh has always existed in at least two hypostasis."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5002.97,"end":5006.09,"speaker":"Fr Andrew Stephen Damick","text":"And for those playing at home, this is what we believe."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5006.25,"end":5006.73,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5006.81,"end":5008.41,"speaker":"Fr Andrew Stephen Damick","text":"This is the one category."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5008.49,"end":5034.78,"speaker":"Fr Stephen De Young","text":"Right. This is the one that turns out to be true. Right. And then that figure. So Yahweh himself, this particular hypostasis of Yahweh is humanized at some point in the future. Right, Right. Generally as the Messiah. And this is what turns out to be. Right. But this is present in Second Temple literature of people reading this and getting this out of it before it happens. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5034.78,"end":5036.94,"speaker":"Fr Andrew Stephen Damick","text":"And even before the New Testament."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5037.18,"end":5042.54,"speaker":"Fr Stephen De Young","text":"Right, right, right. And before, before the New Testament, before Jesus is born. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5043.08,"end":5045.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, before the before times."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5045.56,"end":5085.41,"speaker":"Fr Stephen De Young","text":"Right, right. So this is before that revelation happens. Right. There are folks who get it. Right. Or at least the broad strokes. Right. So there's this one thread. Right. Sorry, there's a whole bunch of threads that you find coming through Second Temple Judaism. And one of those threads becomes Orthodox Christianity. Right. And what then sets, if we're going to talk about Christianity or Christianities, if we want to be, you know, 19th century Germans about it."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5087.57,"end":5089.09,"speaker":"Fr Andrew Stephen Damick","text":"I've never wanted to be that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5089.49,"end":5089.97,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5090.37,"end":5091.41,"speaker":"Fr Andrew Stephen Damick","text":"Weirdly, I don't know."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5092.53,"end":5140.14,"speaker":"Fr Stephen De Young","text":"But you're just a big Beethoven fan, like to cosplay as a 19th century German. Then what, what separates those. Right. If you're going to say, okay, so there's all these threads of Second Temple Judaism in different parts of the world and with different ideas and these different groups. Right. Which ones are the sort of Christian ones? Right. If you want to talk that way. Right, yeah. We're going to end up saying one of those is Orthodox Christianity and the other ones are Christian heresies. Right. Then what separates out the Christian ones is that the Christian ones are the ones who identify Jesus of Nazareth, who identify Jesus Christ as that figure."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5140.86,"end":5141.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5141.42,"end":5151.42,"speaker":"Fr Stephen De Young","text":"Right. So within that you have the orthodox Christianity that we just talked about. Right. But you also have groups who stick with the adoption idea and just apply it to Jesus."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5152.55,"end":5171.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. So what you. I mean, this is the origin of A lot of early Christological heresies. And if you're looking for those dots to be connected, Father Stephen was thinking about writing a book about this, but he discovered he didn't have to."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5171.67,"end":5174.23,"speaker":"Fr Stephen De Young","text":"Yes, because someone else already did."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5174.47,"end":5183.97,"speaker":"Fr Andrew Stephen Damick","text":"Someone else already did. So the scholar Andrei Orlov, who is, you know, one of the foremost Orthodox scholars in the world, especially focusing on Slavonic studies."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5184.45,"end":5187.17,"speaker":"Fr Stephen De Young","text":"Yeah, Slavonic Pseudepigrapha. He is the man."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5187.33,"end":5209.69,"speaker":"Fr Andrew Stephen Damick","text":"He's the man, yeah. So he has a book called the Glory of the Invisible, Two Powers in Heaven, Traditions and Early Christology. So it's all there. Andrey Orlov, O R L O V and this book came out a couple of years ago, but I think it just recently came out in paperback. Pretty affordable. So go check it out."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5210.17,"end":5221.45,"speaker":"Fr Stephen De Young","text":"And remember, you know, we're using the term Orthodoxy and heresy here. Remember what heresy originally meant. Right. Or maybe I need to tell some folks what heresy originally meant."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5221.77,"end":5223.61,"speaker":"Fr Andrew Stephen Damick","text":"What did it originally mean, Father Stephen?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5223.93,"end":5257.35,"speaker":"Fr Stephen De Young","text":"So, well, you sometimes get these folks who wanted, again, do this etymology thing on it and say, well, it's related to the verb to choose. So these are people who choose what they believe, right? Not really. It doesn't fit nicely with, with folks anti Protestant propaganda. But in reality, the word heresy was not even a pejorative originally. It wasn't a slur. It just meant a. A faction or a sect or a school or a group within a larger group. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5257.35,"end":5258.55,"speaker":"Fr Andrew Stephen Damick","text":"Originally, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5258.63,"end":5277.57,"speaker":"Fr Stephen De Young","text":"So, for example, when you read Josephus, Josephus talks about Jewish heresies, right? And he talks about the Sadducees and the Therapeutae and the Essenes, and he talks about the Pharisees, he says. Talks about the heresy of the Pharisees. And he was a Pharisee."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5278.77,"end":5280.29,"speaker":"Fr Andrew Stephen Damick","text":"It really rhymes nicely too."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5280.29,"end":5369.51,"speaker":"Fr Stephen De Young","text":"I know, but he was one. Right, so he was not calling himself a heretic in the modern sense. Right, right. He was just talking about, this is a sect. Right. So you have. And then you have these other sects. Right, right. So you get some of these people who are like, who still have some of that 19th century German in them, who want to say, like, you can't talk about Orthodoxy in the first century. There's just all these different groups. It's like, well, yeah, you can. Because there's a group that became known as the Orthodox Church and they were already there, right, believing those things. And so that's who we're talking about. And then there are other groups who believe other things. Right. They're heterodox. Or we can call Them heresies. So. Right. And so you could see how, with those categories, Right. You could see how you get adoption Christologies. You could see how you get arianism and semi arianism from the people who believe that this is a creative being who's humanized and just identify that as Jesus of Nazareth. Right. So that's where it comes from. So we're now going to look at one particular Second Temple Jewish source and how it conceives of this second power. Because this particular source is going to be hugely influential not only within Second Temple Judaism, not only within the pages of the New Testament, but among the early church fathers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5370.3,"end":5387.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, boys and girls, this is the moment where we start talking about First Enoch. I shouldn't say start. This is the moment where we really focus in on what it is and how it fits into all this. Because we've talked about it a bunch of times, you know, but now we're going to talk about Enoch as a."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5387.5,"end":5394.78,"speaker":"Fr Stephen De Young","text":"Book and we're going to have a little excursus here before we get into the text on the Son of Man in first Enoch."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5394.86,"end":5398.5,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Because some sense of what to do with this stuff."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5398.66,"end":5411.86,"speaker":"Fr Stephen De Young","text":"Yeah. And we get a lot of questions about this. Right. When Religion of the Apostles came out, one of the first questions we got. I don't remember if it was on Facebook or an email was asking if I was saying that First Enoch was canonical."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5412.9,"end":5416.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Well, if you belong to the Ethiopian Church, yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5416.26,"end":5417.38,"speaker":"Fr Stephen De Young","text":"Otherwise, no."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5417.38,"end":5417.7,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5417.7,"end":5418.06,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5418.06,"end":5418.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5420.02,"end":5428.84,"speaker":"Fr Stephen De Young","text":"But yeah, so I think it's worth. We get a lot of questions about it. You know, we do quote it in our intro."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5430.04,"end":5431.4,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, voice of Steve."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5432.2,"end":5451.18,"speaker":"Fr Stephen De Young","text":"We're gonna. We're gonna give here sort of some context for that, sort of. Why? How is it important? Why is it important? What kind of authority does it have? What kind of authority does it not have in being non canonical? And we're gonna try to do that as quickly as possible, which, you know, this is us. So."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5451.66,"end":5460.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Believe it or not, everybody, this show is originally supposed to be only 45 minutes to an hour long. Yeah, I don't think we've ever succeeded in doing that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5460.02,"end":5461.02,"speaker":"Fr Stephen De Young","text":"No, not even close."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5461.5,"end":5462.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5462.54,"end":5464.22,"speaker":"Fr Stephen De Young","text":"So, okay. Strap yourselves in, folks."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5464.22,"end":5465.1,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, yeah, okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5465.1,"end":5465.26,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5465.26,"end":5465.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5465.58,"end":5466.7,"speaker":"Fr Stephen De Young","text":"Hope you brought snacks."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5468.38,"end":5498.22,"speaker":"Fr Andrew Stephen Damick","text":"The first place to start, I mean, this is one of the first places I always start is when I'm looking at some weird ancient texts. I always look. When did. When was it written? How did it arise? Well, you know, First Enoch actually has lots of parts that seem to have arisen at various times. But the general range seems to be that the oldest stuff is from somewhere around 300 to 200 BC and the newest stuff is from somewhere around 100 BC."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5498.78,"end":5499.18,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5499.66,"end":5500.94,"speaker":"Fr Andrew Stephen Damick","text":"That's the range."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5501.1,"end":5518.83,"speaker":"Fr Stephen De Young","text":"Yeah. We call it the Book of Enoch or First Enoch. But there are several sub books. Right, right. That have been sort of tacked together into this one big book. And even within that there are sub books into which pre existing books have been incorporated."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5519.79,"end":5520.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5520.43,"end":5524.27,"speaker":"Fr Stephen De Young","text":"So yeah, it's sort of Russian nesting dolls of an ancient text. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5524.91,"end":5532.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So First Enoch is the Matroshka or Matro. I don't know how to pronounce that. Of the B.C."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5532.55,"end":5534.87,"speaker":"Fr Stephen De Young","text":"World, alienating even more of our audience."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5535.42,"end":5538.54,"speaker":"Fr Andrew Stephen Damick","text":"I know I can't pronounce all the things."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5538.94,"end":5590.75,"speaker":"Fr Stephen De Young","text":"Yeah. So this composite text comes to be in use and being read all over the Judaisms. Right. The different forms of Judaism within the first century. Right. So we have to. Again, we've talked about this before, but remember, there's not just Judaism. Right. We tend to have in our heads as modern Western people the idea that Judaism in Christ's time in the first century AD was basically Palestinian Judaism and Palestinian Judaism was Pharisaism and Phariseeism is modern Rabbinic Judaism. And they're just all the same."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5591.18,"end":5591.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5591.74,"end":5592.54,"speaker":"Fr Stephen De Young","text":"And literally."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5593.02,"end":5593.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5593.46,"end":5596.22,"speaker":"Fr Stephen De Young","text":"None of those things are true. That is fractally wrong."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5596.46,"end":5596.94,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5596.94,"end":5598.06,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5598.94,"end":5600.86,"speaker":"Fr Andrew Stephen Damick","text":"People just marked a bingo square."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5600.86,"end":5647.36,"speaker":"Fr Stephen De Young","text":"Yes. Right. So. So all of those things are not true. Right. So even the Pharisees, from which. Right. The Pharisaic Judaism, which is part of Palestinian Judaism, from which Rabbinic Judaism came, is not identical to Rabbinic Judaism. Right, right. And we're going to talk more about that in a little while, in the third half, I think so. But part of that and the part that's relevant to this when we're talking about first Enoch and how it's being read and used in these different communities, is that these groups, all of these diverse groups in these diverse places had diverse views of what texts held what authority. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5647.36,"end":5647.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5648.28,"end":5743,"speaker":"Fr Stephen De Young","text":"And some of the most well known ones, probably the two most well known ones, would be the Pharisees of the Sadducees who show up in the New Testament. Right. You may know in your Intro to New Testament course, they tell you right off the bat, right. The Pharisees accepted basically, in broad strokes, what later became the Rabbinic Jewish canon. They weren't totally sure about Esther and they had been Sirach and there's some other differences, but roughly, the Sadducees sort of only accepted the Torah Right, right. And didn't accept anything else as being truly authoritative. Probably the next one in terms of that people have heard of would be Qumran, where the Dead Sea Scrolls were found. Right. In Qumran, you can go and look up a list of we found all these scrolls. Right. And there's a huge chunk of the scrolls that are books of the Old Testament and other Second Temple Jewish literature. Right. And we get an idea. We count up how many copies we found. Right. Because all of these texts from Qumran, Qumran was going to get wiped out. They took and they hid these texts in these caves in sealed jars. Right. That's how they were preserved. So these are the texts that were precious to them that they wanted preserved. And we get an idea of how important a text was by how many copies we have. Right. So there are a couple of Old Testament texts that we have zero copies of there. So we can conclude from that, well, they must not have been that important to that particular Jewish community. There's other texts where we have like tons and tons of copies that they saved."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5743.4,"end":5752.34,"speaker":"Fr Andrew Stephen Damick","text":"So we don't have an actual sort of Qumran canon. We just have their library, what they've been keeping around."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5752.82,"end":5767.54,"speaker":"Fr Stephen De Young","text":"Right. And if they have 28 copies of something and only one or two copies of some other things, then we could probably conclude that that thing they had 28 copies of was more important to them than the one that they only had one or two. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5767.78,"end":5768.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5769.38,"end":5782.84,"speaker":"Fr Stephen De Young","text":"So number one in terms of number of copies is the book of Genesis. Right. Might kind of expect that. Number two is the Book of Enoch. Number three is the book of Jubilees. Number four is Exodus."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5782.92,"end":5783.8,"speaker":"Fr Andrew Stephen Damick","text":"Just. Wow."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5783.96,"end":5813.01,"speaker":"Fr Stephen De Young","text":"For the record. Yeah. So Enoch is not only there, it's very important. And what some folks listening may know, because our listeners are nerds like us, a lot of them, is that the whole reason the Qumran community separated and went out into the desert was they were devoted to using the Enochic calendar, which is found in the Book of Enoch. Because the Pharisees were a bunch of liberals."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5814.69,"end":5815.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5815.41,"end":5817.25,"speaker":"Fr Stephen De Young","text":"Because they had altered the calendar."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5817.41,"end":5821.81,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So these are first century Jewish Old Calendarists, so to speak."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5821.97,"end":5844.84,"speaker":"Fr Stephen De Young","text":"Absolutely. Qumran Old Calendarists made the Dead Sea Scrolls. So obviously the Book of Edict is hugely important to them. Right. Obviously. Ethiopian Judaism. The reason Ethiopia, the Ethiopian church has first Enoch in their Old Testament is that they took over the canon of the Ethiopian Jews who preceded them."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5845.32,"end":5846.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which was."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5846.04,"end":5865.2,"speaker":"Fr Stephen De Young","text":"Which included. Yeah. Which included Jubilees at first Enoch. And so first things all over the place. Right. And even the Pharisees. Right. Even beyond just what they think is sort of canon or not. And really using the term canon at this point within Judaism is anachronistic."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5865.52,"end":5869.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You just got. These are the texts that are being used, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5869.4,"end":5902.76,"speaker":"Fr Stephen De Young","text":"That are being read, that people see as authoritative. It's much more subtle than that. But even somebody like. Let's look at St. Paul, right. Who's a Pharisee among Pharisees. And according to his own account, Right. He references texts that are outside of the Pharisaic canon all the time. In his Epistles, he talks about the rock following Israel in the wilderness. He talks about Jannes and Jambres, whose names aren't in Exodus, but they are in Second Temple Jewish texts. And he doesn't, like, distinguish. He doesn't do the thing that a lot of modern preachers do where they're like, well, this is in the Bible now. This is just a tradition."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5902.76,"end":5903.12,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5903.61,"end":5904.89,"speaker":"Fr Stephen De Young","text":"Right. He never does that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5904.89,"end":5906.73,"speaker":"Fr Andrew Stephen Damick","text":"He just mentions it. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5906.73,"end":5937.87,"speaker":"Fr Stephen De Young","text":"He just talks about it like it's all of a piece. Right. And. Right. And. And so it's not that he was a bad Pharisee, it's just that's not how canon function then. So within that. Right. Even though. Again. Right. Whether something is canonical is an objective thing, there's literally not a question as to whether something is canonical and stuff for a group. Right. It is. Either it either has authority with that group or it doesn't."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5938.67,"end":5939.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":5939.47,"end":6040.91,"speaker":"Fr Stephen De Young","text":"I mean, I guess you could make an argument that this other text should. Right. Exercise authority. But that's a stretch, right, to say that that's really a canonical disagreement. Right. It either does or it doesn't. Right. So even though the communities, as far as we could tell, that all of the New Testament authors came from, which are pretty much all Judea, Galilee, maybe Antioch. Right. None of those communities were per se. Seeing Enoch on the same level as, say, the Torah, unlike Qumran. Right. The New Testament is loaded with allusions and references to First Enoch. Right. So there's a whole bunch of these little things. You know, you can find books cataloging them. There's, you know, one of the examples right off the bat, St. Matthew's gospel and the Book of Revelation are full of references to the Book of enoch. So are first and second Peter. But in St. Matthew's Gospel, in the Book of Revelation, where this eschatological, this lake of fire at the end, the devil and his angels are thrown into. You could go all through everybody except Ethiopia's Old Testament, and you're not going to find any references to a lake of fire and the devil being thrown into it. You do find it in one Enoch. Right. So at the very least, first Enoch records traditions, records Jewish traditions that were viewed as authoritative by New Testament writers. And the pinnacle of that is St. Jude in his little epistle quoting the Book of Enoch."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6041.23,"end":6081.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so in Jude, well, we say chapter one, but there's only one chapter, so Jude verses 14 and 15. It was also about these that Enoch the seventh from Adam prophesied saying, behold, the Lord comes with ten thousands of his holy ones to execute judgment on all and to convict all the ungodly of all their deeds of ungodliness and that they have committed in such an ungodly way, and of all the harsh things that ungodly sinners have spoken against him. And that's a quote from Enoch. Right. He's just quoting from there. He's saying this is what Enoch the seventh from Adam prophesied."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6082.49,"end":6116.26,"speaker":"Fr Stephen De Young","text":"Right, right. And so that seems pretty clear now, again, that doesn't add first edict to the Old Testament. No, Right, no, but it's quoted as something. I mean, you know, St. Paul quotes Menander. Right. He's not saying Menander's Greek comedies are part of the Old Testament. Right. But it's viewed as being authoritative by St. Jude and by his original hearers, such that this quote would mean something to them. Right. So it has some kind of relative authority. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6116.58,"end":6117.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6117.46,"end":6160.1,"speaker":"Fr Stephen De Young","text":"And we've mentioned before on the show that in the east, very clearly, and I think even in the early west, but in the east, very clearly, there are three categories, not two of canonicity. Canon is not like an on, off switch. It's not binary. It's not zero or one, canonical or garbage. Right, right. But that there are books that are read in the church which are what we would call canonical properly. Right. And then you have books that are to be read at home. Right. They're not read in the church, but they're this other category where they're helpful and useful. Right. And then there's this third category of books not to be read. That's the heretical stuff."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6160.18,"end":6161.14,"speaker":"Fr Andrew Stephen Damick","text":"That's the garbage."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6161.46,"end":6179.58,"speaker":"Fr Stephen De Young","text":"Right, right. And so we find a question when we start reading the Fathers as to whether first Enoch is in the first category or the second category. Right. Because there are churches like in Ethiopia, where it was being read. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6179.58,"end":6180.14,"speaker":"Fr Andrew Stephen Damick","text":"In church."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6180.3,"end":6195.3,"speaker":"Fr Stephen De Young","text":"Right. And there are a lot of churches, in fact, more churches where it's not being read, but people are reading it in the home and people are citing it and quoting it. Right. And using it as St. Jude did, with this kind of relative authority. Which would be category 2 books read at home. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6195.3,"end":6195.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6197.13,"end":6211.05,"speaker":"Fr Stephen De Young","text":"So for example, we'll try to run through these relatively quickly. Right, yeah. So the Epistle of Barnabas, for example, which is usually found in collections of the Apostolic Fathers, quotes first Enoch as scripture. It uses as it is written."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6211.37,"end":6213.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's the scripture language."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6214.01,"end":6218.69,"speaker":"Fr Stephen De Young","text":"Right. And that's literally like the written part is the scripture. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6218.69,"end":6220.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6222.74,"end":6255.52,"speaker":"Fr Stephen De Young","text":"So it's cited by Saint Justin Martyr or Saint Justin the philosopher, Athenagoras, St. Irenaeus. Right. Cited. Reference it. Clement of Alexandria quotes it in parallel with Daniel. So he says Enoch and Daniel tell us this. Right. So he's paralleling it with the Book of Daniel, Tertullian in his pre Montanism days. Right. And Origen in his. Well, he was already heretical days."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6257.68,"end":6259.6,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, not sorry. Originists."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6261.68,"end":6349.59,"speaker":"Fr Stephen De Young","text":"Both treated it as canonical. Right. In fact, Origen at one point says that the church accepts only the first Book of Enoch. So he says the first, first Enoch is canonical and the other ones aren't. Right. Was his opinion. And given he's not a saint. So this is just a relative opinion. And in the third century, Anatolius used it to say here's what ancient Judaism believed. Right. Like Judaism before Christ came believed. And then he just says we can tell that this is what they believe because this is what's in the Book of Enoch. Right. So he's sort of using it as a, as a, an intellectual history source. Right. As we call it in modern times when you get later. Right. So Even somebody like St. Augustine and St. Augustine, if you know anything about St. Augustine in First Enoch, what you probably know is that St. Augustine is the first really major figure to really make a point of rejecting the idea that the sons of God in Genesis 6 are angelic beings. Right, Right. He's the first major father. And yes, an ecumenical council called him a church father. Deal with it. He's the first one to really reject that and really argue against it directly. Right. Not just propose another explanation, but attack that idea."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6349.59,"end":6349.95,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6350.51,"end":6367.78,"speaker":"Fr Stephen De Young","text":"So you might say, oh well, he must have like just hated the Book of Enoch. He must have just thought the Book of Enoch was heretical trash. Right. Except no. When you actually look up St. Augustine in the City of God talking about the Book of Enoch."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6367.94,"end":6396.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's this little. I mean, there's a whole long passage we could quote here. But I'm just going to try to quote the Key bits. He says, we cannot deny that Enoch the seventh from Adam left some divine writings. For this is asserted by the apostle Jude in his canonical epistle. But it is not without reason that these writings have no place in that canon of Scripture which was preserved in the temple of the Hebrew people by the diligence of successive priests. And he goes on to basically say."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6396.54,"end":6396.82,"speaker":"Fr Stephen De Young","text":"That."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6399.3,"end":6413.38,"speaker":"Fr Andrew Stephen Damick","text":"It'S kind of under suspicion because if you know, Enoch be from being before the flood, how could these writings have possibly survived? So it's like, yes, something must have survived, but we can't really be sure exactly what it was. That's sort of where he lands on this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6413.38,"end":6424.72,"speaker":"Fr Stephen De Young","text":"Right. So St. Augustine says within the Book of Enoch there's stuff that's legitimately from the historical Enoch, which is kind of the opposite of how his view is generally characterized. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6425.04,"end":6425.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6425.48,"end":6454.22,"speaker":"Fr Stephen De Young","text":"But that it's so old, and when you look at it since a composite book, it's clearly been edited. Right. So he's saying we can't know what in here is from Enoch and what in here comes from later. And so, you know, and Father Andrew actually asked this when we were talking about it earlier. Yes. You do find people like Tertullian writes about how Noah took a copy of the Book of Enoch on the ark and that's how it survived the flood. That's how far some of these folks go."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6454.7,"end":6455.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6455.38,"end":6455.98,"speaker":"Fr Stephen De Young","text":"I mean, there's."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6456.86,"end":6476.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's all kinds of fun, like legends and stuff about how various things from before the flood show up after the flood. And like, one of the explanations, for instance, how there's giants after the flood is that OG King of Bashan was an antediluvian giant who stowed away on the ark. Which I just kind of love that story. I don't believe it, but I kind of love that story."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6477.13,"end":6481.45,"speaker":"Fr Stephen De Young","text":"Like Tubal Cain in the movie with Russell Crowe. But anyway, spoilers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6482.57,"end":6483.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6484.01,"end":6526.14,"speaker":"Fr Stephen De Young","text":"So. So even St. Augustine, who clearly wants to reject the teachings of major sections of the Book of Enoch, still has to give some kind of deference to some things about the Book of Enoch. He just sets up a situation where he could keep what he likes and get rid of what he doesn't. Right. So then going past St. Augustine, so St. Augustine is beginning of the fifth century. He's writing Cassiodorus in the sixth century, treats first Enoch as the authoritative interpretation of first and second Peter and Jude. When he's doing his commentary on the general epistles, he's like, well, look, we read this stuff in 1st Enoch that's how you understand what's going on in these New Testament epistles."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6526.79,"end":6529.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, because there's some fun weird stuff in those epistles."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6529.91,"end":6563.53,"speaker":"Fr Stephen De Young","text":"Yeah. And so then if we want to come to the two figures we're going to talk about now, if you want to come to where does the Orthodox Church end up on the Book of Enoch, Right. We're going to go a few more centuries into the future here. Where, where does the Orthodox Church sort of end up on it? Right, this is what we've got. So George Sinkellos, right, who served Saint Terrasios, Patriarch of Constantinople. So this is at the end of the eighth and beginning of the ninth century."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6564.01,"end":6567.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And Singelos is not his last name, that's his job."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6567.93,"end":6568.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6568.49,"end":6576.37,"speaker":"Fr Andrew Stephen Damick","text":"He's basically like a private live in secretary and servant, you know, that's what a single is for a bishop. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6576.37,"end":6665.51,"speaker":"Fr Stephen De Young","text":"Right. And so he begins work on this text that is going to eventually be published by the next figure we're going to talk about St. Nikephoros. But so he starts to work on this text, the Chronographicon Syntomo, which is sort of shout out to Richard Rowland and Jonathan Peugeot, is sort of a universal history, right? The history of the world from Adam until his day, sort of idea, Right. And history, again, not in the modern positivist 19th century German sense of like, here's what really happened, but the story, the story of the world, right? The overarching story. And when he's talking about the early history, starting at Adam, he uses first Enoch as his historical source for what happened. Right. And so then St. Nikephoros of Constantinople, who becomes the patriarch of Constantinople after Saint Terrazios was deceased at the beginning of the 9th century, publishes the chronography. And he adds to the end of it, he appends what he calls his canon lists. And this is not, I mean, this is the 9th century, right. People had a pretty good idea of what was in their church's Bible and what wasn't, what was being read and what wasn't."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6666.22,"end":6666.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6666.7,"end":6676.3,"speaker":"Fr Stephen De Young","text":"But the important thing here is that Saint Nikophoros has these three categories, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6676.54,"end":6680.74,"speaker":"Fr Andrew Stephen Damick","text":"The red in church, read at home and not read categories, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6680.74,"end":6714.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, right. Well, in this case it's a little different, right? Because he's got. He lists books that everybody agrees on, right? Meaning not talking about debates, books everybody agrees on, meaning these are the books that all the churches I know of use, right. Then you have books where there's disagreements, meaning some churches use these and some don't. Okay, right, right. And then you've got what he calls Apocrypha, which would be those books in that second category."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6714.5,"end":6715.46,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I see. Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6715.46,"end":6773.88,"speaker":"Fr Stephen De Young","text":"The books to be read at home. Right. That nobody's reading in their church that he knows of. Right. In terms of his circle as patriarch of Constantinople, but that are worthy of being read. Okay. So there's a lot of interesting stuff in there if you go and look it up. Like, for example, he has the Book of Revelation still in the 9th century as a book that some churches use and some don't, for example, and he's also got either with the Book of Revelation, like the Acts of Paul and stuff. So there's some interesting stuff. There's. But in that Apocrypha category, right, that books to be read in the home. And what, here's what makes clear what he means by that category when you go to what he calls the Apocrypha of the New Testament, right. He includes, for example, the apostolic, what we would call the Apostolic Fathers, the writings of St. Clement, the epistles of St. Ignatius Barnabas, shepherd of Hermas."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6773.88,"end":6774.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6774.53,"end":6799.57,"speaker":"Fr Stephen De Young","text":"That, that kind of stuff that we put the Apostolic Fathers, he calls New Testament apocrypha. Right. So it's pretty clear when he talks about that in the New Testament. Right. He's talking about, right. These books. When he lists the Old Testament apocrypha, not coincidentally, it's a bunch of Second Temple Jewish literature, and it's pretty much the exact texts that we find preserved at orthodox monastic communities."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6800.62,"end":6801.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6801.34,"end":6833.78,"speaker":"Fr Stephen De Young","text":"So he's got the Testament of the twelve Patriarchs, and our manuscripts of that come from Mount Athos. Right, right. He's got Joseph and Asenath. Our manuscripts of that come from Marsaba. Right. So these are from orthodox monastic settlements. So this is not coincidence. Right. This is. This is reflecting the understanding of the church of which of these Second Temple texts were worth reading and worth preserving. Right. And we see that they were. It's not just in the 8th and the 9th century because they were preserved to the present day in those monasteries, those Orthodox monasteries."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6833.78,"end":6836.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, in there, in that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6836.94,"end":6838.42,"speaker":"Fr Stephen De Young","text":"Category is first Enoch."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6838.5,"end":6871.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And I was going to say, I mean, this is. This is the 9th century, which means that Orthodox Christians have been copying these texts for a thousand years, just about, almost by this point. Right. You know, almost, you know, 900 years or so. So, you know, not only are they sort of being read, I mean, it's not like they, you know, they were published in the, you know, first or second century B.C. and then someone just happened to keep copies of these books around because books from that period don't last that. That long."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6872.03,"end":6872.39,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6872.39,"end":6874.99,"speaker":"Fr Andrew Stephen Damick","text":"That means they're being copied over and over again, over and over again."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6875.39,"end":6881.68,"speaker":"Fr Stephen De Young","text":"Right. And these texts, these are pre Christian Jewish texts. Rabbinic Judaism did not preserve them."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6882.16,"end":6885.2,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which we'll go over in a second. Yeah, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6885.68,"end":6897.84,"speaker":"Fr Stephen De Young","text":"It was Christian. It was Christians who preserved them, and specifically Orthodox Christians who preserved this subset of them. Not all of them, but this subset that they thought were helpful and important to read."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6898,"end":6935.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the conclusion then, to everything we've just said, to be very Pauline about it. Therefore. Therefore the application then, is that we use all of this, what we just talked about, as a reflection of where Second Temple Judaism was when Christ came, and also then to reflect its ongoing use of the text within Christianity. So that's what we're saying. We're not saying this needs to be added to anybody's Bible if it's not already in your Bible. We're not saying that every single word of it must be believed in a literal way. That's not."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6935.33,"end":6936.37,"speaker":"Fr Stephen De Young","text":"Or in any way."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6936.77,"end":6939.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Right. Not. Not at all."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6939.97,"end":6980.5,"speaker":"Fr Stephen De Young","text":"We're just saying First Edict is a text that the Orthodox Church has historically thought outside of Ethiopia was helpful to read. Right. That there were things in it worth reading. Right. And that help us understand parts of the New Testament in particular and that show us what the beliefs of first Enoch in particular shows us what people were thinking by at least 100 BC. So when we get to the first century, this is what they're thinking when they think about who the Son of Man is. And so now we have a couple longish quotes that we'll close this half on from first Enoch on this topic."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6980.5,"end":6983.3,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Believe it or not, this was about the whole Son of Man thing."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6983.46,"end":6983.94,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":6984.5,"end":7084.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes. All right. So this is from 1st Enoch, chapter 46, verses 1 through 4. And there I saw the one to whom belongs the time before time. And his head was white like wool. With him was another being whose countenance had the appearance of a man, and his face was full of graciousness, like one of the holy angels. I asked the angel who went with me concerning that Son of Man, and who he was and whence he was, and why he went with the one to whom belongs the time before time. He answered and said to me, this is the Son of Man who has righteousness, with whom dwells righteousness, and who reveals all the treasures of that which is hidden, because the Lord of the spirits has chosen him, and whose Lot has the preeminence before the Lord of spirits in uprightness forever. This son of man whom you have seen shall raise up the king and the mighty from their seats and the strong from their thrones, and shall loosen the reins of the strong and break the teeth of the sinners. And I just have to point out to everybody, as you did to me when we were doing prep for this, raising up the king and the mighty from their seats and the strong from their thrones. Yes. That is indeed referenced in the Magnificat. In Luke, when the Virgin Mary is singing, my soul magnifies the Lord. Go look it up and you'll read it. Just. You'll hear it. You'll see it right there. She's basically quoting. Because this is from a long time before that. She's basically quoting from Enoch there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7085.48,"end":7086.84,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yep."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7087.4,"end":7095.4,"speaker":"Fr Andrew Stephen Damick","text":"And, and, and, and who are these mighty and these strong that are being tossed off of their thrones? It's the demonic dominions who had been governing the world."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7095.72,"end":7097.33,"speaker":"Fr Stephen De Young","text":"Right. And they were judged in Daniel 7."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7097.8,"end":7114.28,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. Judged in Daniel 7. So she's referencing the Enochian interpretation of Daniel 7 in the Magnificat, which is just so cool. So I have to be a little wowed for a moment about that. So."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7114.28,"end":7124.2,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. And so now the other quote that we have is at least part of it will sound very familiar. Maybe."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7124.52,"end":7124.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7124.8,"end":7126.32,"speaker":"Fr Stephen De Young","text":"Although it's a slightly different translation."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7126.32,"end":7241.72,"speaker":"Fr Andrew Stephen Damick","text":"A little different translation. Yeah. Okay. So this is from 1st Enoch, chapter 48. This is verses 2 through 10. And at that hour, that son of man was named in the presence of the Lord of the spirits. And his name before the one to whom belongs the time. Before time. Yes. Before the sun and the signs were created, before the stars of the heaven were made, his name was named before the Lord of the spirits. He shall be a staff to the righteous, whereon to stay themselves and not fall. And he shall be the light of the Gentiles and the hope of those who are troubled of heart. All who dwell on earth shall fall down and worship before him, and will praise and bless and celebrate with song the Lord of the spirits. For this reason has he been chosen and hidden before him, before the creation of the world and forevermore the wisdom of the Lord of the spirits has revealed him to the holy and righteous. For he has preserved the lot of the righteous because they have hated and despised this world of unrighteousness and have hated all its works and ways. In the name of the Lord of the spirits. For in his name they are saved and according to his good pleasure has it been in regard to their life in these days, downcast in countenance shall the kings of the earth have become. And the strong who possess the land because of the works of their hands. And for on the day of their anguish and affliction, they shall not be able to save themselves. And I will give them over into the hands of my elect as straw in the fire, so shall they burn before the face of the holy, as lead in the water shall they sink before the face of the righteous. And no trace of them shall any more be found. And on the day of their affliction, there shall be rest on the earth. And before them they shall fall and not rise again. There shall be no one to take them with his hands and raise them. For they have denied the Lord of the spirits and his Messiah. The name of the Lord of the spirits be blessed."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7243.8,"end":7259.14,"speaker":"Fr Stephen De Young","text":"So here the Son of Man has existed before the creation of the world, before the creation of the angels, before the creation of everything. He has existed. He will exist forevermore. And he is going to come as the Messiah. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7261.14,"end":7273.14,"speaker":"Fr Andrew Stephen Damick","text":"And all these things about him enacting judgment. And all those who had denied the Lord being they shall fall and not rise again. There's no hope of redemption for these demonic powers."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7274.82,"end":7282.1,"speaker":"Fr Stephen De Young","text":"As one early Christian writer said, the Jews cannot accept this writing because it is too Christian."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7282.74,"end":7291.28,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Yeah. Yeah, yeah. That's. Yeah. I can't say I delivered as well as the Voice of Steve does, but."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7292.56,"end":7294.48,"speaker":"Fr Stephen De Young","text":"You gave more of the context, so."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7294.96,"end":7295.52,"speaker":"Fr Andrew Stephen Damick","text":"Indeed."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7295.76,"end":7296.16,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7297.12,"end":7307.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So. All right. Well, that's the end of the second half of our episode for tonight. This has been a long one. We're gonna take one more break and we'll be right back."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7307.92,"end":7352.18,"speaker":"Voice Of Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. St. Ignatius, first century bishop of Antioch, called the God Bearer, is one of the earliest witnesses to the truth of Christ and the nature of the Christian life. Tradition tells us that as a small child, Ignatius was singled out by Jesus himself as an example of the childlike faith all Christians must possess in bearing God."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7352.34,"end":7352.7,"speaker":"Fr Stephen De Young","text":"Fr."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7352.7,"end":7368.63,"speaker":"Voice Of Steve","text":"Andrew Damick recounts the life of this great pastor, martyr and saint and interprets for the modern reader five major themes in the pastoral letters. He martyrdom, salvation in Christ, the Bishop, the unity of the church and the Eucharist."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7368.79,"end":7381.87,"speaker":"Fr Andrew Stephen Damick","text":"For Ignatius, martyrdom is really the fullness of Christian life in a sense, which that can be challenging for us because, number one, he doesn't seem to have any reticence at all about going to martyrdom. Like, there's no sense of, well, this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7381.87,"end":7384.51,"speaker":"Fr Stephen De Young","text":"Is what I have to do. You know, I wish I didn't have to."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7384.51,"end":7388.79,"speaker":"Fr Andrew Stephen Damick","text":"But this is God's will for me. He is going to it joyfully, gladly."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7389.28,"end":7415.48,"speaker":"Voice Of Steve","text":"To find this book and others like it. You can go to store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-A radio."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7417.64,"end":7426.04,"speaker":"Fr Andrew Stephen Damick","text":"All right, welcome back, everyone. It's the third half of the show. This has been a big one, but it's a really big topic. We're talking about the Son of Man."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7427.08,"end":7438.12,"speaker":"Fr Stephen De Young","text":"So we should say since we played that commercial, that despite what you might intuit from the recording quality in the commercial, the book is printed with modern printing methods."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7438.6,"end":7447.25,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's true. Yes. I think I did. We mentioned this before I did that interview. I mean, this has been a few years now over the phone."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7447.41,"end":7452.85,"speaker":"Fr Stephen De Young","text":"So that's why it's by phone. You mean a tin can with a string attached to it?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7452.85,"end":7493.76,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, exactly. That reached all the way to Indiana. So. Yes. Okay. So we spent the first half talking about Son of Man in the Old Testament particularly. And then in the second half we talked about how it was received in Second Temple Judaism. And then especially we looked at some passages from Enoch. And now we're going to get to how it appears in the New Testament and even look at how it gets looked at in the Talmud. Right. We don't do that very often. We're not usually super interested in what we usually disregard."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7493.76,"end":7494.8,"speaker":"Fr Stephen De Young","text":"Rabbinic Judaism."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7494.8,"end":7516.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. For good reason. Yeah. Okay. So, all right. Son of man, as we said at the beginning, it's the most common self identifier that Jesus uses. It appears in all four of the Gospels. And just to give you quick counts, 29 times in Matthew, 14 times in Mark, 26 times in Luke, and 13 times in John."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7517.44,"end":7525.13,"speaker":"Fr Stephen De Young","text":"Yes. And interestingly in the Synoptics, that maps out to about how many chapters are in."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7526.09,"end":7527.53,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7527.53,"end":7533.37,"speaker":"Fr Stephen De Young","text":"Not exact, but close almost. But that just means it's sort of an even dispersal, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7533.45,"end":7537.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because the apostles didn't put chapter numbers in there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7537.17,"end":7652.07,"speaker":"Fr Stephen De Young","text":"Yeah. Right. And so Christ calls himself this folks might be tempted to say, well, we could just take all this Son of Man stuff we've been talking about, right. From the Old Testament, from Second Temple Judaism. We could just import all of that every time Christ uses those terms. And I mean, no one could stop you. But if you try to do it publicly with someone who disagrees with you, they're going to disagree with you. Because like everything else in the Bible, because journal articles have to be written and dissertations have to be written, everybody argues about them. Right. When is Christ using it in the sense of referring to this figure from Daniel 7 and Second Temple Jewish literature? And when is he just using it in some other way? And people go back and forth. We talked about friend of the show Bart Ehrman and his kind of wonky view of that. But so there's a lot of references that are debated, you could say are ambiguous. Right. But there are some that are just sort of very, very obviously like referring to the Daniel 7 figure. Right. And some examples. I'm just going to list these off. We're not going to read them, but you can later in the recording, check them out. Matthew 13, 41, 24, 30, 25, verse 31, Luke 21, verse 27. These are referring to like, for example, the Son of Man coming on the clouds of heaven to judge the earth. Right? So I mean, they're, they're really obvious, Right. Or coming, coming with angels. Right. With, with sickles. Right. You know, this kind of thing. So there's, there's no doubt there that when, when Christ is talking about the Son of Man there. Now the potential argument, ambiguity there is. You could have someone like friend of the show Bart Ehrman, who will."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7653.78,"end":7653.9,"speaker":"Fr Andrew Stephen Damick","text":"Look."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7653.9,"end":7673.14,"speaker":"Fr Stephen De Young","text":"At that and, and say, well, yeah, but see, look, he's talking about him in the third person. He's not identifying himself as that Daniel seven figure. Right. And so to get all of that in one spot unambiguously. Okay, Right. We now turn to mark 14, verses 61 through 64."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7673.46,"end":7673.9,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7673.9,"end":7676.58,"speaker":"Fr Stephen De Young","text":"Which is when Christ is on trial before the high priest."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7676.9,"end":7735.36,"speaker":"Fr Andrew Stephen Damick","text":"Right. Okay, so this is how it reads. But he remained silent and gave no answer to anything. Again, the high priest was questioning him. Are you the Christ, the Son of the blessed? And Jesus said, I am He. And you will see the Son of Man seated at the right hand of power and coming with the clouds of heaven. And the high priest, tearing his garments, said, what need do we still have of witnesses? You have heard this blasphemy. What does it look like to you? And they all judged him to be deserving of death. So, yeah, it's. It's. I mean, okay, so the significance of what's happening here is they're debating as to whether or not he's a blasphemer. And then Jesus says this. I'm. He says, I'm the Christ. And then. Which it doesn't necessarily. Is not necessarily a blasphemous thing to say. And then he says, you will see the Son of Man seated at the right hand of power and coming with the clouds of heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7735.36,"end":7735.46,"speaker":"Fr Stephen De Young","text":"And."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7735.77,"end":7758.73,"speaker":"Fr Andrew Stephen Damick","text":"And the high priest immediately tears his garments and says, we don't need any more witnesses or evidence. You've heard him blaspheme yourself. In other words, he's claiming to be this divine figure. He's claiming to be God. He's claiming to be the Son of Man. And it says they all judged him to be deserving of death. Everyone there agrees that he has just claimed to be the divine figure, the Son of man, Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7758.73,"end":7783.52,"speaker":"Fr Stephen De Young","text":"Because claiming to be the Messiah was not blasphemy. It would get you killed by the Romans, but it was not considered blasphemy necessarily to claim to be the Messiah by the Jewish people, by the Pharisees. The high priest remembers a Sadducee, so he's even more loosey goosey on stuff. So from his perspective, this is clear blasphemy. You're claiming to be this second power."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7783.52,"end":7784.08,"speaker":"Fr Andrew Stephen Damick","text":"Second power."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7784.08,"end":7819.01,"speaker":"Fr Stephen De Young","text":"It happened, right? You're claiming to be this divine figure. And the same element is in Christ's trial before the high priest in St. Matthew's Gospel, in Matthew 26, verses 62 through 66. We won't read it here, but St. Matthew's description of it, he adds more details. It's elaborated a little bit in terms of what everybody says, right? And the interesting part from this perspective, in terms of what we're talking about tonight, is that he adds, where."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7820.85,"end":7821.21,"speaker":"Fr Andrew Stephen Damick","text":"St."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7821.21,"end":7904.5,"speaker":"Fr Stephen De Young","text":"Mark has a simple future, you will see the Son of Man, right, Seated at the right hand of power and coming with the clouds of heaven. St. Matthew adds the phrase aparti, right? Which roughly means from now on, from this moment on, you will see the Son of Man seated at the throne. Right? And what's interesting about that is in terms of our previous discussion of the Ascension, right, that this is. St. Matthew wants to make it clear because remember, this is chapter 26 great commissions in chapter 28, right? The ascensions in chapter 28. So he wants to tie this in very clearly, right? This Daniel 7 imagery to Christ's ascension and enthronement that he's going to describe at the end of his Gospel. Right. So Christ is about to go to the final battle, win his final victory, thence to ascend on the clouds of heaven and be enthroned with all authority in heaven and on earth given to him. Right. So St. Matthew makes it, if anything, even less ambiguous what Christ is claiming. Right. So that sort of, it's. I mean, people try, but it's really special pleading. Right. I mean, they always have the default of, well, Jesus didn't really say that. Right. Which, you know, don't even talk to that person."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7904.5,"end":7904.9,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7906.82,"end":7911.06,"speaker":"Fr Stephen De Young","text":"But there's really no getting around what the text is saying. Right. The text is using this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7911.06,"end":7911.62,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7911.94,"end":7925.63,"speaker":"Fr Stephen De Young","text":"So if this is so clear in Second Temple Judaism. Right. If this is sort of universal and Second Temple Judaism and people just have different views of it. Right. But they all have it. Where does it go?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7926.19,"end":7926.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7926.83,"end":7927.23,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7927.23,"end":7936.67,"speaker":"Fr Andrew Stephen Damick","text":"Why is it that early Jews, you know, from this period, why don't they all just flock into Christianity or become all heretical Christians or, you know."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7937.07,"end":7937.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7937.63,"end":7938.59,"speaker":"Fr Andrew Stephen Damick","text":"What's going on?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7938.67,"end":7942.43,"speaker":"Fr Stephen De Young","text":"Why don't they just all sort out into those groups? Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7942.43,"end":7942.83,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7945.28,"end":7950.16,"speaker":"Fr Stephen De Young","text":"I should say Daniel Boyarin, I was about to say famously said, I guess famously said in the circles I."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7950.16,"end":7953.84,"speaker":"Fr Andrew Stephen Damick","text":"Run in all five of you. Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7955.68,"end":7984.98,"speaker":"Fr Stephen De Young","text":"That Rabbinic Judaism never really got away from the idea of a. A of God being humanized or divinized or that humanized God being divinized, of God becoming humanity becoming God. They could ever really get rid of that because it's too core to what's going on in the Hebrew scriptures. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7985.38,"end":7990.66,"speaker":"Fr Andrew Stephen Damick","text":"And we should point out that Daniel Boyarin is himself an Orthodox Jew. Jewish scholar."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":7990.82,"end":8007.25,"speaker":"Fr Stephen De Young","text":"Yes. We'll mention him again here in a little bit. But so they never really do get. And you find things all the way along. Right. That hearken back to this. But what we're about to talk about now is the fact that they made a really good effort to purge it all out."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8008.21,"end":8008.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8008.61,"end":8010.37,"speaker":"Fr Stephen De Young","text":"Like. And it was deliberate."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8010.61,"end":8012.93,"speaker":"Fr Andrew Stephen Damick","text":"Right. Two powers gets reduced to one power."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8013.57,"end":8048.01,"speaker":"Fr Stephen De Young","text":"Right. And that is explicitly happens in the second century. So in the second century, that's when Christians are expelled from the synagogue. Right. Meaning that the. What would become Rabbinic Judaism says you Christians are something else. Right. You're not a sect within Judaism, you're now something else. And when the Christians are expelled, the whole view, the whole idea that there are two powers in heaven is labeled a heresy in the modern sense."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8048.56,"end":8048.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8049.2,"end":8067.36,"speaker":"Fr Stephen De Young","text":"This is a borderline, a dividing line. Right. If you Believe in this. You're going to be expelled from the synagogue and treated as a Christian. Right. Regardless of what version of it you hold. Right, Right. Because, you know, rabbinic Jews didn't want Aryans around either. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8069.04,"end":8069.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8070.32,"end":8073.76,"speaker":"Fr Stephen De Young","text":"They weren't that picky. They're just anybody who believes any of this is gone. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8073.76,"end":8074.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8075.83,"end":8106.36,"speaker":"Fr Stephen De Young","text":"And so that also meant rejecting not just the literature, the Second Temple Jewish literature that they stopped preserving and rejected and narrowed down their canon. Right. To. These are the only. These are the only texts, and only these versions of these texts and only in Hebrew. Right. All of that happens in the second century. But they decide that letting that literature proliferate in the first place was a mistake."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8107.08,"end":8117.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, There's. There was a problem with the writing of it is sort of the idea. Yeah. So they, I mean, they, they. There's this. I mean, it's weird. There's this moratorium on writing."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8117.88,"end":8118.24,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8118.24,"end":8129.12,"speaker":"Fr Andrew Stephen Damick","text":"Like, don't, don't write any of this stuff down. The idea is like, well, it must have been because all this stuff was being written down and that's what gave rise to all of this multiplicity, and that's what gave rise to Christianity. And this was a big mistake."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8129.99,"end":8150.63,"speaker":"Fr Stephen De Young","text":"Right. And so from this point in the second century until like fifth, sixth century, when the Talmud starts being written, the Tractates. The Talmud start being written and collected, there's no writing. Things aren't written down. Everything is taught orally and by memorization in the rabbinical schools."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8150.79,"end":8154.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's piles of Christian texts being written during this period."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8154.63,"end":8227.47,"speaker":"Fr Stephen De Young","text":"Right. Christians keep writing stuff. We've got all kinds of Christian apocrypha and stuff. But not. You don't have any Jewish writings at all. Just the copying of that narrow canon, the precise copy. This is when the whole precise, super precise copying comes in. Right. Where it's only this version of this text precisely preserved. That's the only thing you're allowed to write. And so this is a mistake a lot of people make. And this is part of where this idea that rabbinic Judaism goes back farther than it does comes from, is that when this stuff gets written down eventually in the tractates of the Talmud. Right. They're claiming, and in some cases are probably correct, but. Right. But they say they're writing. We're writing down the opinions of rabbis from the first century, the second century, the third century. But this has been handed down orally to that point and is being recorded selectively. So for centuries, it's not everything those rabbis ever said that gets preserved. Right. It's certain things. And we won't go down the Gamaliel rabbit trail someday we will."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8227.47,"end":8228.11,"speaker":"Fr Andrew Stephen Damick","text":"That would be fun."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8228.83,"end":8242.86,"speaker":"Fr Stephen De Young","text":"But so once we get to these tractates that form the Talmud. The Talmud is made up of a whole bunch of what are called tractates, a whole bunch of separate collections of sayings of rabbis on different topics."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8243.18,"end":8243.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8243.58,"end":8261.1,"speaker":"Fr Stephen De Young","text":"And the Mishnah is a chunk of it. Right. There's different parts of it. It's a very complex thing. It's not like the closest approximation would be like, if you go and get that sort of standard Philip Schaff Church fathers collection."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8261.66,"end":8262.22,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8262.38,"end":8312.92,"speaker":"Fr Stephen De Young","text":"Right. That would be the closest Christian comparison. Right. It's just a collection of oral teachings of ancient rabbis. Right. And they disagree with each other. It's on all kinds of different topics. It's not. I mean, it wasn't written as a unit. Right. So it's just all kind of put together there and it's selective and you don't always know why, what choices were made. But so there are two places that. There are lots of places that are responses to Christianity. Right. Because one of the reasons why it's finally written down is that the whole not writing things down thing wasn't working. Right. They needed. You need to enshrine things in writing as a literary monument like we've talked about before."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8313.16,"end":8313.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8313.52,"end":8327.67,"speaker":"Fr Stephen De Young","text":"At some point. And so it's written down. And a lot of it is written down expressly over against Christianity. The rabbinic Jewish community in the Talmud is defining itself over against the Christian church."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8327.91,"end":8332.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because by this point, I mean, we're talking fifth, sixth century."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8332.71,"end":8333.27,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8333.59,"end":8337.03,"speaker":"Fr Andrew Stephen Damick","text":"By this point, Christianity is now the official religion of the empire."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8337.43,"end":8337.83,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8338.15,"end":8338.67,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8338.67,"end":8373.67,"speaker":"Fr Stephen De Young","text":"Right. And so it's over against Christian. And Christianity has now grown to this immense size and has laid claim to these ancient Jewish texts. Right. And so they're defining themselves over against Christianity very consciously. And this isn't just my interpretation. This is. Anybody until mudic studies will tell you that this is true. There's. There's so much stuff that's just directly, I mean, cheap shots, more cheap shots at Christians than I take at Calvinists. Right. Are in this. Right. So it's just very clearly."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8374.12,"end":8374.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8374.52,"end":8383.88,"speaker":"Fr Stephen De Young","text":"There's something going on here. Right. So. But there are two places in two different tractates that directly address this whole issue of two powers in heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8384.04,"end":8384.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8384.84,"end":8404.99,"speaker":"Fr Stephen De Young","text":"Right. Because we have to, we have to reckon with this. Not just because, hey, we still want to make clear that this is. This is verboten in Rabbinic Judaism in the synagogue, but also because part of what's preserved in this oral tradition is the fact that some of these ancient rabbis in the first century believed this."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8405.55,"end":8406.03,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8406.03,"end":8411.07,"speaker":"Fr Stephen De Young","text":"And so now we want to use them as authoritative on other topics, but we've got to deal with that problem."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8411.47,"end":8412.71,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8412.71,"end":8428.51,"speaker":"Fr Stephen De Young","text":"So that's part of this too. So one of the two places, the first one we're going to talk about, because I'm definitely not getting into the whole issue of when different tractates of the Talmud were written, because that's a whole rabbit warren. Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8428.59,"end":8430.55,"speaker":"Fr Andrew Stephen Damick","text":"There will not be a future episode on that."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8430.55,"end":8458.97,"speaker":"Fr Stephen De Young","text":"No, no, there will not, because I'm not a Talmudic scholar, so I'm not qualified. But. So the first word we're going to talk about is tractate Hagiga, and this story about this fellow Aher. Aher means backwards. This is what they call him. He is like their proto in rabbinic Judaism. He's sort of the prototypical heretic, the way Arius is sort of the prototypical Christian heretic."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8459.44,"end":8470.8,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the name itself, my understanding is that this nickname meaning backwards, means that he sort of turned into a heretic. That's the backwards sense. He's gone away."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8470.8,"end":8471.52,"speaker":"Fr Stephen De Young","text":"Turned away."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8472.56,"end":8473.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8473.36,"end":8520.04,"speaker":"Fr Stephen De Young","text":"The opposite of repentance, turning towards. He turned away, he apostatized. Right. And the fellow's actual name was Elisha Benavuya. And so this describe. There are lots of stories about Ahur. He gets like every heresy of the book ascribed to him at some point in Jewish literature. But this interrected Hagiga, he has this vision, right. He's. He's doing his sort of Merkava prayers, right. Where he's hoping to have this heavenly ascent. And at the end of this heavenly ascent, he's sort of in the heavens and he sees the archangel Metatron and he sees him sitting down."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8521.48,"end":8522.28,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8522.44,"end":8523.08,"speaker":"Fr Stephen De Young","text":"In heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8523.56,"end":8528.28,"speaker":"Fr Andrew Stephen Damick","text":"You know, someone sitting in heaven is in a position of authority."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8528.36,"end":8529.96,"speaker":"Fr Stephen De Young","text":"Right. You sit to preside."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8530.52,"end":8531,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8531.4,"end":8545.05,"speaker":"Fr Stephen De Young","text":"This is reversed. The ancient church, when the homilist was going to preach in the church, he sat down and the people stood, were standing up, which is. We do the opposite now."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8545.13,"end":8553.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, I know, yeah. Those are the standard postures in the ancient world, pretty much. For whoever is teaching or presiding sits and everybody else stands."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8554.01,"end":8563.37,"speaker":"Fr Stephen De Young","text":"But this is why we still have the bishop's throne. Right. He is the one who sits and presides. Right. That's why he has a chair, a seat, as sort of the mark of his authority."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8563.61,"end":8564.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8565.13,"end":8574.17,"speaker":"Fr Stephen De Young","text":"So he sees the archangel Minotaur there, and so he concludes, oh, look, this is the second power in heaven, right? Because he's sitting, he's presiding."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8574.57,"end":8577.53,"speaker":"Fr Andrew Stephen Damick","text":"I've read Daniel 7. This must be what's going on."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8577.53,"end":8582.09,"speaker":"Fr Stephen De Young","text":"Right? So Traxatecha wants to make clear that, as usual, Aher was wrong."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8582.65,"end":8583.05,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8584.01,"end":8609.54,"speaker":"Fr Stephen De Young","text":"So in this story, the archangel Metatron gets in trouble. They're like, what are you doing sitting in front of the humans? Right. So he gets drug off and whipped. Well, I guess they do that in heaven with angels who mess up, but he gets off easy because Aher gets sent back to Earth and is cursed to live the rest of his life with no hope of salvation."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8610.5,"end":8610.98,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8611.14,"end":8621.5,"speaker":"Fr Stephen De Young","text":"Like, as a wanderer upon the earth. So all that is to attempt to communicate to you that this two power in heaven stuff is really bad. Don't do it. It. Yeah, right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8621.66,"end":8622.7,"speaker":"Fr Andrew Stephen Damick","text":"You could be damned."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8622.78,"end":8630.14,"speaker":"Fr Stephen De Young","text":"This is your brain. This is your brain on two powers in heaven. Any questions? Don't do it, kids. That's a deep."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8630.38,"end":8631.5,"speaker":"Fr Andrew Stephen Damick","text":"A deep cut there."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8632.38,"end":8638.22,"speaker":"Fr Stephen De Young","text":"So the second place in the. In the Talmud is in Tractate Sanhedrin."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8638.54,"end":8639.1,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8639.26,"end":8664.63,"speaker":"Fr Stephen De Young","text":"And this one deals with Rabbi Akiva, who is the most prominent rabbi of the early second century, is quoted on all manner of issues all through the Talmud is seen as a sort of a super rabbinical authority. Not only is he seen as really authoritative, but he ended his life. He supported the Bar Kokva rebellion that ended in 135ad."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8664.87,"end":8667.59,"speaker":"Fr Andrew Stephen Damick","text":"So he's a hero. He's a hero. He's a martyr."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8667.91,"end":8675.5,"speaker":"Fr Stephen De Young","text":"One of those fakes. And then the. The Romans killed him. Should I say how? We're deep in the show."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8675.66,"end":8677.02,"speaker":"Fr Andrew Stephen Damick","text":"They removed his skin."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8677.1,"end":8731.65,"speaker":"Fr Stephen De Young","text":"Yes, they removed his skin with an instrument like a metal potato peeler. You can figure out how that went because the Romans were creative. So he's viewed as this martyr on top of everything else, which sort of gives super extra authority to his. To his stuff. But it was also remembered in the oral tradition that he had actually believed in the two powers and have, as most people did in the late first and early second century within Judaism. So what's cited here in Tractate Sanhedrin? It's in. I believe we didn't write this in the notes, but I believe it's 28B. He says, well, the two thrones. He's talking about the thrones in Daniel 7 when he says two thrones. Says the two thrones. One is for God, one is for Yahweh, the God of Israel. Right. And one is for David. Meaning one is for the Messiah. Right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8731.81,"end":8732.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8732.17,"end":8765.82,"speaker":"Fr Stephen De Young","text":"And so that would be a Typical two powers in heaven view. Which is probably what Rabbi Akiva actually believed. Right. There's two thrones in heaven, one for God, one for the Messiah. Right. But he gets corrected in Tractate Sanhedrin that no, no one is for justice and one is for mercy. Meaning God sort of manifests himself. The one God manifests himself as a young man when he's going to issue justice, like when he appears as a man of war against the Egyptians in Exodus. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8765.82,"end":8767.26,"speaker":"Fr Andrew Stephen Damick","text":"Did you say God is a man of war?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8767.34,"end":8775.7,"speaker":"Fr Stephen De Young","text":"I did, yeah. Actually Moses did. But anyway, yeah. And then actually, I think that was Miriam."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8775.7,"end":8779.51,"speaker":"Fr Andrew Stephen Damick","text":"Miriam who's leading the song. But Moses wrote it, so, yeah, there you go."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8780.63,"end":8785.91,"speaker":"Fr Stephen De Young","text":"So the one for justice, one for mercy, he appears as an old man when he's going to give mercy."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8786.39,"end":8792.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is like. It's like modalism, Patrick, basically. Right? Yeah. Right."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8792.63,"end":8805.83,"speaker":"Fr Stephen De Young","text":"So the answer of tracks eight, Hijiga, is, well, it's sort of Arianism. But there's no archangel becomes human and you're not supposed to worship him. That's bad, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8806.23,"end":8806.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8806.71,"end":8836.14,"speaker":"Fr Stephen De Young","text":"And with Tractate said hetero, with Rabbi Akiva in the story, Akiva accepts this correction. So sort of their answer to the Akiva problem is, well, yeah, he believed that for a while, but he got corrected and he ended his life. He had it figured out. Right. He was confused for a minute, but he was okay. But what's communicated is. No, this is. This is just. These aren't two separate. These aren't two powers in heaven. These aren't two persons. This is just sort of modalism. The one God appears in different ways, right?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8836.14,"end":8836.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8836.74,"end":8865.77,"speaker":"Fr Stephen De Young","text":"When. When he appears. So, and, and not just the Talmud in general, but these quotes, like later in Tractate Sanhedrin, Jesus is accused of burning his food in public. They just make these random accusations in places against Jesus of Nazareth. Right. But this one is. So this is clearly. Even this bit about Akiva is clearly this context of anti Christianity. Right, yeah."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8865.77,"end":8877.25,"speaker":"Fr Andrew Stephen Damick","text":"And we should say that the claim that Jesus, quote, burned his food in public is not saying he's a bad cook, it's saying that he offered sacrifices somewhere other than in the temple."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8877.33,"end":8931.66,"speaker":"Fr Stephen De Young","text":"Right. Illicitly illicit sacrifice. Yeah. Right. And so there's some debate as to whether that's referring to the Eucharist and in an anti Christian context, saying that the Eucharist is illicit or if it's just sort of a general accusation. I mean, they also accuse Christ of like, sorcery and all kinds of things at the Talmud. So it could just be saying he was offering pagan sacrifices or sacrifices outside the temple. Right. It's hard to tell exactly what. What it means. But so sort of, in conclusion, if you want to read more about it. Right. We're gonna. We're gonna save ourselves some emails and give you some reading recommendations. So there's lots of actual literature about the stuff we've been talking about tonight, but the stuff I'm about to mention is stuff from Jewish authors."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8932.06,"end":8932.62,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":8932.86,"end":9077.68,"speaker":"Fr Stephen De Young","text":"Not that I think Jewish authors are more authoritative than Christian authors, but Jewish authors don't have a dog in this hunt. Right, Right. You quote a Christian author to somebody, they can say, well, yeah, he's a Christian. He's reading that stuff back into the sources. Right, Right. But if somebody's Jewish, especially an Orthodox Jew, they have no reason to try to read Christianity back into ancient Judaism. They want to do the opposite. They have the opposite. Right. So it's sort of, you know, for the lawyers out there, it's an admission against interest. Right. So that gives it extra weight as evidence. And so some books from Jewish authors on this, sort of the classic on this is Alan Sagal's Two Powers in Heaven. Daniel Boyarin has written a ton about this. We already mentioned him, but he has a book called Borderlines, which is about the separation between Judaism and Christianity in the second century from an Orthodox Jewish perspective, which is fascinating because he sort of makes St. Justin martyr the bad guy. From our perspective, he's the good guy, but he's the bad guy from. From Daniel Berard's perspective. But he acknowledges these things we've been talking about nonetheless. And he also has an article called Gospel of the Memra that's dealing with some of the stuff we talked about last time, actually, with the word of God in John 1. And then Benjamin Sommer has a book called Bodies of God. He teaches at Jewish Theological Seminary here in the United States that talks about this stuff. And Israel Yuval has a bunch of work on this. He's a professor of Ancient Judaism at Hebrew University in Jerusalem. Definitely Jewish, but He has a YouTube video you can go watch. For all you kids who don't like to read paper books anymore, he has a YouTube video called Did Rabbinic Judaism Emerge out of Christianity? Spoiler. His answer as a Jewish person is yes. So that's awesome. Stuff from Jewish sources talking about this and confirming that this is what happened in terms of the separation of Judaism and Christianity and what was going on with the Son of Man and the Second power in Heaven."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9078.24,"end":9437.46,"speaker":"Fr Andrew Stephen Damick","text":"Wow. All right, well, to wrap it up tonight. You know, the thing that really struck me in this conversation as we were talking about this phrase son of man, that of course, as we said, Jesus applies to himself more than any other kind of language, is that, you know, a lot of times when people talk about. And this has been kind of a theme of all of these episodes about Christ in the Old Testament. But a lot of times when people talk about Christ in the Old Testament, they talk about it in terms of prophecies that predict him, right? And, you know, we're in December now and we're thinking about Christmas. And so a lot of times people talk about this. Oh, there's these prophecies about Christ in the Old Testament. And it's true. I mean, it's not an incorrect thing to say there are prophecies about Christ in the Old Testament. But the thing that especially struck me with this particular language, son of man, and especially as we looked at it from Daniel chapter seven, is it's not so much a prediction in this case, you know, a prophecy about Christ. But these are. This is Christ present, right? So when the prophet Daniel sees this vision, he's not receiving a description of something that's going to happen in the future. He's actually. He is there. He's present to see the ascension and enthronement of the Son of man, right? He becomes present there through the vision. God brings him there. And, you know, you saw in those passages that we read from Enoch how God is referred to as the one who has the time before time, which I just thought was a really fascinating and interesting phrase. He is the one who can, who is the master of time and the one who is outside of time. And so bringing Daniel to be present at what would be for Daniel is in the future, bringing him present to be there is absolutely possible. You know, again, Daniel is not receiving a piece of information. He's actually present because God has brought him there, right? And we see some of that same kind of stuff in Enoch where, you know, Enoch is given this tour of heaven by an angel. And he sees things that from his point of view, and indeed in some cases from our point of view, are in the future, right? And so one of the things that these visions do, I believe, is to, in a beautiful way, kind of collapse our sense of Christ's presence in the Old Testament and his presence in the New Testament as showing that it's the one Christ who simply is present in all of these scenes, right? All of these visions, all of these experiences that people are having that they are meeting Christ, they are seeing him enthroned. In this particular case, they are seeing him execute judgment upon the dark powers. They are seeing him give the kingdom to his saints. That is all happening, right? And of course, like with Daniel, he's going to participate. Like he's going to participate in that stuff twice again from our point of view. Once when he's seeing it in this vision, and then again when he is one of the saints to whom the kingdom is given by that Christ whom he sees coming on the clouds of heaven and being enthroned next to his Father, the ancient of days, Right? And so that's what really strikes me about this, is that we see Christ very, very clearly, right? We've been kind of building up, you know, in some ways in these episodes, the angel of the Lord, the word of the Lord, and now really the Son of Man, very, very clearly. And the other thing that really I'm really struck with especially is that this image in particular is really taken into the New Testament and into the church and so forth. And the previous two, of course. Absolutely. As well. The angel of the Lord, the Word of the Lord, when we looked at John chapter one, right, with word of the Lord, but this one in particular, there's something about seeing Christ in Daniel's vision that is really compelling and really powerful. And again, this also shows very, very clearly the unity between not just the Old and New Testaments, okay, But the Old and New Testaments, the traditions as witness to in some of these Second Temple Jewish sources, and then in the church as well. Like when we celebrate, for instance, the Ascension, when we are present at these things through our ritual participation, we are there. We are there when all authority is given to him, we are there. When he's giving the kingdom to his saints, we are there as well. So we are having the same experience that Daniel has when he sees Christ being enthroned there in Daniel, chapter seven. It's just. It's just astonishing. And, and I know I say that a lot on this show is, you know, I'm just sort of blown away. But. But I think that's what. Meditating on the Scriptures and what, how Christ reveals himself in the Scriptures, what that truly does. So it's, it's just. It's just so, so beautiful. And not just kind of in an aesthetic way, but. But it's a beauty that really cuts directly into the human soul. So, Father."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9439.94,"end":9448.82,"speaker":"Fr Stephen De Young","text":"So as you mentioned, we are coming up on the Nativity, we're coming up on Christmas. It's almost like we planned this series to lead up to it."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9449.38,"end":9450.1,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9450.42,"end":9620.86,"speaker":"Fr Stephen De Young","text":"One might think. And I think because of that, the view that we get of Christ and the material we talked about today is sort of especially important to us as modern people who have inherited a very sentimentalized, precious moment's view of Christ in general and Christmas in particular. We're sort of like Ricky Bobby and we really like the baby Jesus because he's meek and mild and cute and wouldn't hurt a fly. And we have our manger scene and we listen to linus recite Luke 2 and it's all very sentimental and nice and pleasant, right? But what we miss out is what this feast is actually about, right? Which is about the Incarnation. And to have the Incarnation, we have to understand quite simply that Jesus is God. We all say that, that's true, but it doesn't tend to be how we think of Him. It doesn't tend to be the image of him that we have in our heads, which is very human and almost cuddly. It's not that Christ isn't human. He is, but he's not a human. He's not just a human person like us, who happens to be nicer and gentler and kinder and more loving than us, right? He is all of those things, but that's not all he is. He isn't Mr. Rogers, which is who I just described. Christ is the God who created the universe. Christ was there in the time before time with His Father right through him. And for Him, His Father created everything that exists, including us. And when he comes in the Incarnation, when he's born in a cave, he's coming. He's invading the creation that's fallen prey to the demonic forces to start the battles that are going to lead to this great victory and his enthronement with all authority in heaven, on earth, from whence he will come to judge the living and the dead. That's who Jesus is. That's who shows up as a tiny infant in a cave. And until we reckon with that and learn to stand in awe before that and not try to reduce it to one thing or the other, something we can hang our hat on, something we can control in our mind, something we can manipulate, something we can be comfortable with until we just stand in awe and worship before for it, then we haven't understood the Incarnation and we don't understand what Christmas is actually about."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9625.74,"end":9651.44,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much, Father, and thank all of you for listening. That is our show for tonight. If you didn't get a chance to call in during our live broadcast. We'd love to hear from you, either via email@lordofspiritsancientfaith.com or you can. You can message us at our Lord of Spirits Podcast Facebook page. We do read everything. At least I read everything. But we can't respond to everything. And we do save some of what you send for possible use in future episodes."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9651.92,"end":9657.12,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7:00pm Eastern, 4:00pm Pacific."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9657.84,"end":9668.17,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook like our page, join our discussion group. Leave reviews and ratings everywhere, but most importantly, share. Share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9668.57,"end":9684.49,"speaker":"Fr Stephen De Young","text":"I just got horrible news. The world's only Popeyes Chicken Buffet in Lafayette, Louisiana is being closed right to your lawmakers. This aggression will not stand, man. And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9684.81,"end":9687.45,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless you all."}
{"episode_id":"LOS - #033 - 2021-12-09 - Who is this Son of Man -","start":9699.22,"end":9736.19,"speaker":"Voice Of Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation chapter 5, verses 11 through 12."}
