{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":0.64,"end":65.28,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host. This live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":68,"end":164.84,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back everyone to the Lord of Spirits podcast. I am Father Andrew Stephen Damick in the borough of Emmaus in the Commonwealth of Pennsylvania. And with me is my co host, Father Stephen DeYoung in Lafayette, Louisiana. And if you're listening to us live, you can call in at 855-AF-RADIO. That's 855-223-72346. And we're going to get to your calls in the second part of today's show. So last time we talked about sacrifice in the ancient world, why it was done, what was sacrificed, how it was done and what it accomplished. And we touched only very briefly on how that applied to ancient Israel. Well, this second episode in this three part series is all about ancient Israel. And we're going to look at what we in the modern world would call the religious life and what it looked like for ancient Israelites, what it accomplished, how it differed from the surrounding paganism, and also how it was oriented toward the whole world. So let's go back in time again as best as we can and see what the Holy Scriptures tell us about prayer and worship, both before the giving of the Torah and after it. And we should add as a caveat here at the outset that we are largely going to be talking about what was normative for ancient Israel, not all the stuff that anyone in Israel did. So when you see Israelites drifting off into BAAL worship, for instance, that was not the norm. So Father Stephen, what was the norm? Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":164.84,"end":191.21,"speaker":"Fr Stephen De Young","text":"And we're not talking about Norm Peterson or Norm MacDonald or even the late great Norm Crosby, but what we're really talking about is, in terms of the norm, is what the Torah said Israel was to do, what God told Israel in terms of how he wanted to be worshiped in particular."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":192.01,"end":192.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":193.45,"end":233.58,"speaker":"Fr Stephen De Young","text":"And this is an important caveat to make because one of the frankly worst arguments that our atheist friends like to make against the Old Testament in particular and Christianity in general is they will come and say, well, the Old Testament says that Israel were ancient, Israel was monotheistic and believed in Unitarian monotheism. But when we do archaeology, we find all this pagan stuff. So, see, it's all a lie. Wow."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":233.58,"end":235.26,"speaker":"Fr Andrew Stephen Damick","text":"Everything in that sentence is wrong."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":235.5,"end":237.14,"speaker":"Fr Stephen De Young","text":"Yes, yes, yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":237.14,"end":237.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":237.66,"end":240.14,"speaker":"Fr Stephen De Young","text":"This is another thing that is fractally wrong."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":240.22,"end":243.3,"speaker":"Fr Andrew Stephen Damick","text":"Right? Fractally wrong."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":243.3,"end":244.5,"speaker":"Fr Stephen De Young","text":"Everything is just as wrong as the."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":244.5,"end":255.57,"speaker":"Fr Andrew Stephen Damick","text":"Whole thing that should be on. We should get a T shirt that says fractally. I mean, I'm sure there are people right now making T shirts for us, but one of them folks should be. Should say fractally wrong."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":255.89,"end":288.22,"speaker":"Fr Stephen De Young","text":"Yes. So we. We've done a lot of debunking of the whole monotheism bit, but if you've actually read the Old Testament and some of the people who make this bad argument have and are deliberately misrepresenting it for the sake of rhetorical points, because they know even most Christians haven't read most of the Old Testament, or they haven't read it either."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":288.7,"end":289.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":289.18,"end":303.66,"speaker":"Fr Stephen De Young","text":"They've just picked up this argument from somewhere that if you actually read the Old Testament, you see that. That the Old Testament after the Torah is the story of how Israel didn't follow the Torah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":303.98,"end":316.28,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. There's all kinds of moments where God sends a prophet to Israel and you did it again. You wandered off into idolatry, culminating in the exile."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":316.44,"end":316.84,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":317,"end":318.04,"speaker":"Fr Andrew Stephen Damick","text":"Like, that's right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":318.2,"end":340.28,"speaker":"Fr Stephen De Young","text":"It's disobedience and then exile. That's what it says happened. So the reason we know, for example, that from Solomon on they were worshiping Shemesh and Shemesh, Zedekah, the sun God in particular, in the temple in Jerusalem alongside Yahweh, the God of Israel, is because the Bible tells us they were."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":341.02,"end":341.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":341.74,"end":349.18,"speaker":"Fr Stephen De Young","text":"The reason we know about the golden calves at Bethel and Dan is not because we found them in an archeological dig. It's because the Bible tells us they were there."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":349.42,"end":349.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":349.9,"end":362.86,"speaker":"Fr Stephen De Young","text":"As the official state religion of the Northern kingdom. So if you believe that what the Bible is telling us in the Old Testament is true, then when we go and dig in Israel, we should expect to find a bunch of pagan stuff."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":363.18,"end":363.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":363.9,"end":381.1,"speaker":"Fr Stephen De Young","text":"Right. That's what they say is gonna Be. So what we're about to describe in sort of talking about the religious experience of an ancient Israelite is we're presupposing that this is a one of the faithful Israelites."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":381.1,"end":383.06,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, yes, exactly."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":383.22,"end":400.11,"speaker":"Fr Stephen De Young","text":"Who were in the minority, but did exist. Right. There's the 10,000 in the northern Kingdom who never bowed their knee to baal. Right. There's some presumably larger group in, in Judah, the same thing. So we're talking about those folks."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":400.59,"end":400.99,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":401.39,"end":404.35,"speaker":"Fr Stephen De Young","text":"And what their religious experience consisted of."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":404.43,"end":448.78,"speaker":"Fr Andrew Stephen Damick","text":"Right. And, and, and perhaps another. I mean, you've already mentioned this, but another point to kind of underline is that this is not the stuff that they came up with, largely speaking. Right. This is stuff that we have direct commandments from God. This is what you should do, you know, celebrate this feast in this way, offer this sacrifice in this way. Like the book of Leviticus in particular is like a liturgical book pretty much, you know, explaining how to do worship in ancient Israel and when to do it and all that kind of stuff. And that's largely what we're talking about, is these, these are the commandments from God. This is what you're supposed to do."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":449.1,"end":497.75,"speaker":"Fr Stephen De Young","text":"Right. And like everything in the Old Testament, this isn't material that fell out of the sky, but it's speaking into an existing cultural situation. So a lot of what we're going to be trying to bring out tonight is just like with, you know, the flood story in Genesis is in many ways similar to the other flood stories you find in the ancient Near East. But then there are important differences. Right, right. Where it's correcting things. And we've seen that with other stories as well in past episodes. It's the same thing with the commandments regarding worship. This is within the context of the sacrificial worship we talked about last time. Right. That was. Was universal. But then there are certain particular qualifications and changes made in terms of how Israel is to do it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":498.15,"end":499.43,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":499.43,"end":506.22,"speaker":"Fr Stephen De Young","text":"So it's not a question of just take what your neighboring nations do and do it for Yahweh instead."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":507.26,"end":640.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think another thing we should also mention, because we got a question about this from someone in our Lord of Spirits group who thought that what we were doing in this series of episodes was in the first one we're going to talk about pagan worship, and the second one we're going to talk about ancient Israel. And then the third one is going to be about atonement, by the way. And he was saying, wait, are you guys trying to say that ancient Israelite worship was derived from paganism, and then Christianity is derived from ancient Israelite worship. And the answer to that is no, that's not what we're saying at all. Yes, we're dealing with it in this specific order. But as you said, sacrifice was happening. It was happening all over the world. We see Cain and Abel offering sacrifices, and they sure didn't derive that from some kind of surrounding paganism. They are, you know, at least as far as the Bible depicts them, they're some of the only people in the world at that point. So, so it's not a question of derivation. So when we talk about distinctions and stuff, it's as you said, it's not that Israel says, okay, let's take this pagan worship and we're going to just make some tweaks here to make it appropriate for Yahweh. That's, that's not what's going on. So everybody is offer sacrifices and then Yahweh comes in and says, this is what I want you to do in the sacrifices that you're offering to me. So I think that's another important point, is we're not making a kind of chronological argument that paganism is the earliest form of religion and then Jewish monotheism comes along. That's not. I mean, there are scholars who say that stuff, but that's not consistent with what the scripture actually shows. So if you believe that the scripture is true, then you're not going to take that tack. And it's not like you have to pit the scripture against all scholarship because it's not a universal thing that all scholars say either. I mean, this is going to be a massive rabbit trail we could go down. But I think that's an important point too, is we're not saying that ancient Israelite worship is derived from pagan worship, that they'd start out as pagans and they become something else."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":640.13,"end":645.12,"speaker":"Fr Stephen De Young","text":"Right. But it's also not completely antithetical. Right. What's going on?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":645.12,"end":647.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. God doesn't come and say radically different."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":647.84,"end":655.12,"speaker":"Fr Stephen De Young","text":"Everybody else is offering incense and sacrifices. I want you to come for a period of music followed by some Torah exegesis."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":655.44,"end":657.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":658.56,"end":671.13,"speaker":"Fr Stephen De Young","text":"He doesn't say that to the ancient Israelites. Right. He could have. Yeah, right. But. But he doesn't. And so we have to take seriously both the continuity and the discontinuity."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":671.37,"end":676.01,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly, exactly. So now we've done 11 minutes of caveats."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":676.49,"end":679.61,"speaker":"Fr Stephen De Young","text":"Yes. Qualified disclaimers."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":680.01,"end":694.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. The big warning label service. Yeah, exactly. Click here if you agree to, as my father says, the Most frequently told lie in the world is I have read and accepted terms of services and conditions."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":697.03,"end":701.51,"speaker":"Fr Stephen De Young","text":"Yeah. Someday we're going to find out we've all put ourselves in indentured servitude without knowing it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":701.75,"end":742.16,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. All right, so, okay, now that we've said all that, I mean, let's begin. And you know, we're going to be talking about both before and after the Torah. I mean, let's talk a little bit about before the Torah. So before, you know, the Exodus, before Moses brings the people out of Israel, you already, you know, the giving of the law does not happen until after the Exodus occurs. And so, and yet the people of Israel go to Pharaoh and say, we want to go offer sacrifice to our God. And yet there's no Leviticus yet there's, you know, but they're offering sacrifices. It's an existing thing that they're doing."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":742.24,"end":753.76,"speaker":"Fr Stephen De Young","text":"Right, right. And you see that in, of course, in the patriarchal narratives in Job, Abraham, Isaac and Jacob build altars and sacrifice to God in various places."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":754.23,"end":754.79,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":756.07,"end":770.47,"speaker":"Fr Stephen De Young","text":"And one interesting note is that if you actually track through Abraham, Isaac and Jacob in the places where they built altars and sacrificed, you'll find that there's one in the territory of each tribe. So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":771.35,"end":771.91,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":773.67,"end":782.76,"speaker":"Fr Stephen De Young","text":"There was an early pre Torah layer where tribes sort of had their own historic shrines related to their forefathers."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":783.56,"end":784.36,"speaker":"Fr Andrew Stephen Damick","text":"Interesting."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":785.4,"end":820.36,"speaker":"Fr Stephen De Young","text":"But so yes, there's this, this earliest layer where it is essentially the, the father of the family who is the one active in, in worship. And that's not just the father. Again, we have to think not nuclear families. Right. This is, you know, extended families. So you're talking about the father of the family may be the granddad or the great granddad, if he's, if he's still alive. Right. Who's the head of the whole clan. And he's the one who would go. We see this with Joe back offering sacrifices for his wife and for his children."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":820.52,"end":820.92,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":820.92,"end":851.27,"speaker":"Fr Stephen De Young","text":"Right. It was, it was the father in the family who offered sacrifices for his family. And, and the worship that was involved, that then passes on to the elders of the clans and tribes. Once those smaller clan units form sort of larger tribal units, there are elders who are basically those people for all the different clans that make up the tribe."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":851.51,"end":859.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's basically the father figure for each of those tribes. Right, right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":859.6,"end":870.56,"speaker":"Fr Stephen De Young","text":"Who is, who is in charge of that? And so when you get to. And most of what we're going to be talking about tonight is going to be in this post Torah period."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":870.96,"end":872.88,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. I mean, we have the most."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":872.88,"end":873.2,"speaker":"Fr Stephen De Young","text":"Period."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":873.2,"end":875.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We have the most detail about that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":875.36,"end":910.41,"speaker":"Fr Stephen De Young","text":"Right, right. Yeah. We're simply told, for example, Jacob sacrificed at the altar at Bethel. Like, we're not told what, we're not told how many or how or any of that. It's in the Torah where we get these instructions from God. But so again, we have to cure ourselves. There's this perpetual danger of. That has really plagued a lot of Western theology, in particular of assuming that the local Jewish community is what Judaism has always been, even back into ancient Israel."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":911.01,"end":911.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":912.13,"end":925.97,"speaker":"Fr Stephen De Young","text":"So we probably know better if we think about it for a few minutes. But ancient Israelites were not like going to the synagogue on Saturday to hear a sermon from the local rabbi."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":926.61,"end":927.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":927.41,"end":929.41,"speaker":"Fr Stephen De Young","text":"That just wasn't happening."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":929.97,"end":1000.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think part of the reason, I mean, not only that this religion has changed so much over time, but also our understanding of what religion is has changed a lot over time, you know, And I mean, it becomes a pastoral issue too. Like even in our time, you know, what is the task of a husband and father? According to Christian tradition, he is the one who's supposed to be leading his family in prayer. And when we who are husbands and fathers are not doing that, we're actually falling down on the thing that we're appointed to do by God above all else. And I think part of the reason why that happens is so much now is because even for people who are devout Christians is because of this concept that religion is a thing that you go do somewhere else. It's not a natural expression of the family life, you know, but we're looking now at this kind of earliest layer. I know layer is the right word, but this, this earliest stage where there isn't a thing called religion."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1000.97,"end":1001.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1001.29,"end":1018.09,"speaker":"Fr Andrew Stephen Damick","text":"There's simply the things that you do in your family and then that expands to be the things that the tribe does, the same things, and then you get the nation. But it's still not regarded as, oh, we have this religion, you know, it's not, it's not a religion."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1018.22,"end":1033.02,"speaker":"Fr Stephen De Young","text":"There's no, not only is there no concept of a religion, right. That's a 17th century innovation, but there's no concept of religion as opposed to other things like religion versus politics versus."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1033.5,"end":1034.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1034.58,"end":1089.59,"speaker":"Fr Stephen De Young","text":"You know, capitalism versus. Right, yeah. So there's. There, there is simply no concept. So what we're really talking about is a way of living your life in your family and in your community, in your clan, in your tribe, in your. Your nation. Right. It's a collective and public way of living life. It Involves at the smallest level, your family. So this isn't purely an internal thing, the way we think about religion in the modern world, where it's about what you believe in your heart or what you think in your head. This is a public way of living and of worshiping your God and interacting with your God and with your community and with your family and with others in general."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1090.15,"end":1098.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, yeah, it's notable that at no point that I can recall in the Old Testament did anyone ever say, how did you feel about worship today? Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1099.57,"end":1101.01,"speaker":"Fr Stephen De Young","text":"Did you get anything out of it?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1101.49,"end":1105.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that was a great sacrifice today, Aaron."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1106.37,"end":1115.49,"speaker":"Fr Stephen De Young","text":"Yeah, they might have said. They might have. They might have said where you fed, but they were talking about how much you ate at the feast after the sacrifice. They were literally talking about whether you were fed."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1115.73,"end":1119.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the Levites were really on today, weren't they? Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1120.13,"end":1120.85,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1121.33,"end":1121.73,"speaker":"Fr Andrew Stephen Damick","text":"Well."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1121.89,"end":1180.66,"speaker":"Fr Stephen De Young","text":"And. Well, yeah, it's a little bit of a rabbit trail, but, but you see, some of the earliest sins you see attributed to clergy like, like Eli and his sons in the Old Testament are basically gluttony, that they're growing fat off the sacrifices. Yeah, right. That, that. It's about indulgence. But so to, to talk about the way of life of people at that time, we have to, we have to sort of. It's very different from, from any way of life that we live as modern people, at least in, in first world industrialized, technologically advanced countries. So the, the, the. We're living under late capitalism. They're in a primarily agrarian economy. So most people are farmers living on ancestral land that they were granted in the Torah and working that land in order to feed their families and survive."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1181.38,"end":1181.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1182.66,"end":1208.54,"speaker":"Fr Stephen De Young","text":"And then once, once Israel is settled in the land, you have the beginning of towns and cities. And so that brings in the elements of mercantile economy and artisanal economy. Artisanal economy being making things. Right. So you have people making furniture and making things and the mercantile economy of people taking resources and the things that people make from one place to another place."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1209.02,"end":1210.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. Trading them around. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1211.58,"end":1249.97,"speaker":"Fr Stephen De Young","text":"Moving them around. But so that's, that's sort of the, the economic background. And so one of the reasons why you don't have this separation of religion or your interactions with your God from everything else is that the structures that we have now in our modern society that allow us to compartmentalize, quote, unquote, religion and compartmentalize God and our interactions with him ritually and otherwise weren't there."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1250.61,"end":1251.49,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1251.89,"end":1259.18,"speaker":"Fr Stephen De Young","text":"So if the crops are bad one year, one or more of your children is probably going to die of starvation in front of you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1259.5,"end":1395.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's this insulation that we now have because, frankly, because of our technological advancement. Right. Like, I mean, literally, what do I do for a living as I sit in front of this microphone? Among other things. I don't. I mean, we do have a garden in the back, but you know what we can decide, you know, we're not going to do a garden this year and it's. No one in our house is going to starve as a result. Right. And I think that this lack of dependence on divine help is one of the reasons that we have this concept of religion as a kind of boutique piece of life. Right. Or just like, yes, yes, you should have some religion even at best. Right. That when your life depends upon things that are totally outside of your control or significantly outside of your control, then you're much more likely to be calling upon your God. Right. And it's interesting to note that even, like in the pagan world, how much the association of the gods was with things that were necessities of life and survival. Right. You know, you've got gods of agriculture and of warfare and of, you know, all of that kind of stuff. And the modern world has become so convenient that we feel like we don't. It's not that we really disprove the existence of God. It's that we just don't. We just don't feel we don't need him. You know, we don't. We don't need him. Right. Or like, let's add a little blessing. Oh, we're about to do this thing. Okay. God, won't you bless it. But we all know it depends on us because we got this right? And this is a radically different world that we're talking about. This is a world where if you go off into the wilderness, there is no one in charge out there. If you get beat up by robbers, there are no police to call. If you go out into the woods and you encounter something, there is no search and rescue from the local government that's going to come take care of you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1395.92,"end":1410.8,"speaker":"Fr Stephen De Young","text":"There was no, like Israelite police state or state in general. They were not practicing some kind of Ur fascism or something in. Yeah, in ancient Israel where they were, you know, the state was there to hold your hand and take care of things and make sure you were fed."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1411.44,"end":1423.4,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, you are on your own. And it's you and you and your neighbors and your God. That's. That's. Life hangs on that. Yeah, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1423.4,"end":1454.77,"speaker":"Fr Stephen De Young","text":"And so this is, this is an everyday thing. Right. You're, you're constantly aware of your dependence on God, your direct dependence on Him. And so it's not a coincidence then that the, the most basic level of the Israelite calendar, that the first layer of the Israelite calendar is based on the agrarian calendar."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1455.09,"end":1455.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1455.57,"end":1490.5,"speaker":"Fr Stephen De Young","text":"And we're going to talk later on tonight about the, the at least a little bit in brief about the feasts on that calendar. But they're related to the harvest primarily because you're living in an agrarian world. Right. And so the harvest, planting, seed time and harvest, these things are plate. Are events of religious significance. Yeah, right. And, and form the basis of, of the community, between the human community and God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1491.14,"end":1528.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So, so how, okay, so if we've got this world in which sacrifices are being offered in the home and in the, the neighborhood, essentially. Right. But then eventually we get to that Israel has this kind of priestly tribe, the tribe of Levi. Right. How does that happen? Why is it that then they become the ones who are offering sacrifice on behalf of everyone else rather than just being, you know, that this is something that dad does. Right. Why is it that gets separated out?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1529.2,"end":1530.72,"speaker":"Fr Stephen De Young","text":"Because the elders were bad."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1532.01,"end":1535.53,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1539.53,"end":1557.45,"speaker":"Fr Stephen De Young","text":"They were, they were very bad. So we won't go into it because this, this is an episode in and of itself in terms of priesthood being removed from Moses and given to Aaron. We're going to touch on a lot of things this episode that will someday get blown up into whole independent episodes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1558,"end":1559.04,"speaker":"Fr Andrew Stephen Damick","text":"And that is our deal."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1559.44,"end":1580,"speaker":"Fr Stephen De Young","text":"Yeah, but the priesthood being taken away from Moses and high priesthood being given to Aaron. But there's this second episode where the priesthood gets taken away from the presbyters, from the elders of the people. And that happens in the episode of the Golden Calf."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1580.56,"end":1581.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1581.6,"end":1686.3,"speaker":"Fr Stephen De Young","text":"Where the, the presbyters, the elders of the people, join with Aaron in sacrificing to the Golden Calf while Moses is on the mountain. When Moses comes down to settle things up and take care of the situation, it's the Levites, the tribe of Levi, who comes to stand with him. And so because of that, the priesthood was taken away from the presbyters, from the elders and given to the Levites as a separate class. And the part that we're really going to only touch on in brief, but maybe more in a future episode is that that just like priest and king from Moses and Aaron gets reunited in Christ, we see very clearly in, in the New Testament that eldership, the presbyterate and priesthood get reunited in the church when this, when this judgment is taken care of. But that will have to wait. Wait for another, for another time. But. So that means there's now a particular priesthood. And we talked about a little bit when we were talking about God's body, about the, the importance of God says there's only going to be one place. Right. Which is here's a big point of discontinuity from paganism, where in the various pagan systems you created a body for your God, an idol of a particular place. You localized. Every God was localized to a bunch of different places and sort of had these different instantiations in these different places. Whereas Yahweh, the God of Israel, says, I'm going to put my name in this one place."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1686.94,"end":1687.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1687.3,"end":1691.51,"speaker":"Fr Stephen De Young","text":"My body is going to be this one place in the, in the temple."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1692.07,"end":1698.27,"speaker":"Fr Andrew Stephen Damick","text":"So to, to worship him, you have to go there, right? Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1698.27,"end":1698.51,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1698.51,"end":1700.95,"speaker":"Fr Andrew Stephen Damick","text":"You can't offer sacrifice in your backyard anymore."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1701.27,"end":1722.97,"speaker":"Fr Stephen De Young","text":"Right. So this means for your average Israelite who lives probably weeks journey from Jerusalem if he's a faithful Israelite, this is one of the lures of, of paganism and of the, the sort of false religion of the Northern Kingdom under Jeroboam with the golden calves, you didn't have to go as far."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1723.53,"end":1726.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Well, there's one of these just down the street."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1726.25,"end":1737.61,"speaker":"Fr Stephen De Young","text":"There's, there's a high place right outside of town. Yeah, right. But to, to be faithful, you would have to make, make this journey. And so that means you weren't doing it every Saturday."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1738.57,"end":1739.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's just too much."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1739.97,"end":1741.85,"speaker":"Fr Stephen De Young","text":"It would take you weeks, weeks to get there."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1743.05,"end":1744.01,"speaker":"Fr Andrew Stephen Damick","text":"You gotta live."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1744.33,"end":1829.76,"speaker":"Fr Stephen De Young","text":"You literally, functionally could not. And so for the average Israelite, this becomes usually a single annual pilgrimage. If they were, well to do or if they were involved in the mercantile trade. So they're moving around more that they might be in Jerusalem for more of the major feasts, but for the average person, this would be. You would make a pilgrimage once a year for Pascha, for Passover to Jerusalem, and that would be the main time. And so there's even instructions in the book of Deuteronomy saying to do this, accepting that this is going to be the reality, and saying that therefore a person should save up their tithe. So the tithe, the first fruits, all the things that you would have offered to God, because you can't get to the temple to do it, you're supposed to save it all up for the time of the Passover for Pascha. And then when you make the journey, you take all that money and it says to buy wine or other strong drink, meaning fermented drink. Sorry. To our Baptist friends and food and to eat and to drink them before the Lord. And that. Yeah, before the Lord."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1829.84,"end":1830.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1830.4,"end":1835.52,"speaker":"Fr Stephen De Young","text":"Doesn't mean in front of him. It means. It means with him, in his presence. So with him."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1836.08,"end":1838.88,"speaker":"Fr Andrew Stephen Damick","text":"Right, with him, the meal. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1838.88,"end":1854.58,"speaker":"Fr Stephen De Young","text":"Right. And so this is. This is sacrificial language. Right. And it's talking about having this communal meal once a year, because realistically, that's when you could do it. And you saved up the tithe. You saved up everything for that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1855.06,"end":1882.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, if you're saving it all up. So. So Pasca Passover is in the spring. Right. But you've got these other tides that are coming at other times of year. First fruits, etc. Etc. You probably can't. It's not going to necessarily keep all that time. Right. So what do you do? You. You sell some of it. So that you sell it and say the money. Yeah. You got the money set aside. Right. And bring that with you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1883.61,"end":1909.62,"speaker":"Fr Stephen De Young","text":"Probably the most famous biblical example of someone doing exactly that is Christ and the apostles going to Jerusalem for the Passover and renting a room and buying food and wine and other strong drink and literally eating and drinking it with the Lord. Because Christ was sitting there at the table."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1909.78,"end":1915.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, He's. He's actually sitting there. God is. God is at the table. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1915.3,"end":1957.82,"speaker":"Fr Stephen De Young","text":"So the Mystical Supper. Right. Or the Last Supper is. Is the fulfillment of this in a very literal sense. Right, right. This is the place. That's the place and time where it most really and truly happened. But that was. That was. So the. The religious experience of the average Israelite really was about faithfulness. This is why faithfulness is so important with Abraham. Right. Abraham in Genesis doesn't have a temple, he doesn't have priests. He doesn't have any of this stuff. Right. But it's about how he lived each day, how he conducted himself with his wife and his children and his servants."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1958.33,"end":1958.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1958.61,"end":1983.61,"speaker":"Fr Stephen De Young","text":"How he conducted business, how he interacted with the people he encountered as he sojourned in different places. And so it was the same thing for the average Israelite. Being faithful to God was not about believing certain things in his head or feeling certain things in his heart or holding to certain doctrines. It was about every day, what he did from when he woke up to when he went to sleep, most of which was farm work."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":1984.53,"end":2024.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it should probably be mentioned that we're not talking about only being sort of ethical. Right. Being a good person. Although Obviously, that's included. Right. You're expected to behave ethically, but rather that all is done with prayers. That all is done with, like, for instance, the tithes are literally taking your livelihood and giving it to God. Right. That it's not a system of doctrine and morals, although certainly those things are included. It's, as you said, it is a whole way of life."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2025.08,"end":2043.47,"speaker":"Fr Stephen De Young","text":"Right. Well, we have this, what, probably the biggest difference between the religion of the Torah and every other religion in world history, I'll go that far, is that ethics is religious in the Torah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2044.43,"end":2044.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2045.07,"end":2067.71,"speaker":"Fr Stephen De Young","text":"There is no system of ethics attached to Greco Roman paganism. Right, Right. Yeah, but because. Right. The closest thing you get in, in paganism is the idea of religiously is the idea that there are certain ways you have to act when you're in a temple or towards a temple or towards an idol, towards a God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2068.06,"end":2068.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2069.66,"end":2088.06,"speaker":"Fr Stephen De Young","text":"But what happens in the Torah is we find out that humanity is made in the image of God. So every human you meet every day is the image of God, is God's body in that sense. And so how you treat them and act to them, that is a religious act. You're doing it to God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2088.54,"end":2094.7,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. It is an act of piety. Yeah. Right, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2094.7,"end":2095.9,"speaker":"Fr Stephen De Young","text":"You're venerating them."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2096.77,"end":2165.63,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. So, you know, a little bit related to that. Before we go to break, we received a question from Evan, who sent this to us. And this is connected somewhat with our previous episode where we talked about incense, but this actually does integrate into this episode because we were talking about the, as we would think of it, religious life of the average faithful Israelite. Right. So Evan has a question about the use of incense in the home. So this is what he says with incense being something that is offered to God and with the sacerdotal priests and bishops being the ones that offer the sacrifice of the Eucharist and offering incense in the services of the church. How are we to understand the practice of using incense at home during family or personal prayers? Does it have the same kind of propitiatory and or expiatory effect there when used by lay people as it does during the services of the church by the priest? Or is it different, perhaps even to the extent of just being a pleasant smell for us when we pray in that context? So what do you think, Father?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2166.67,"end":2169.95,"speaker":"Fr Stephen De Young","text":"Right. Well, there's. There's continuity and discontinuity."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2170.27,"end":2171.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2173.31,"end":2177.15,"speaker":"Fr Stephen De Young","text":"So you do find for the average ancient Israelite."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2177.5,"end":2177.94,"speaker":"Fr Andrew Stephen Damick","text":"Right. We'll."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2177.94,"end":2228.74,"speaker":"Fr Stephen De Young","text":"We'll stay where we are. Right. Historically. And this is a Massive flash forward from last time, by the way. We're only talking about the second millennium B.C. now, and some of it's the first millennium B.C. this is recent times, but we find, you know, incense boats, ways of offering incense in the home, but not altars of incense. Right. So there is a distinction between what's going on when incense is offered on the altar in the tabernacle or the temple and when incense is offered with prayers at home. Although incense is offered with prayers at home Right. Now, this isn't a complete discontinuity. It's not two different things. Right. So it's not just, this is my Febreze plugin."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2229.05,"end":2229.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2230.33,"end":2232.25,"speaker":"Fr Stephen De Young","text":"As opposed to an act of worship."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2232.57,"end":2243.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I, some sometimes I hear people say, oh, I like the smell when I pray at home. Like, well, that's good. But it's not the reason that we offer incense when we pray at home."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2243.69,"end":2277.62,"speaker":"Fr Stephen De Young","text":"Right, right. And so it is, in a sense, those things you do at home, like when you have an icon corner and you offer incense there when you pray, it's a way of participating in the worship of the church when you're not there in the church. Right. And so there's a connection. Now, it wasn't feasibly possible at that time for somebody to go and get a coal from the altar of incense and take it home with them. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2277.7,"end":2278.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2279.22,"end":2284.12,"speaker":"Fr Stephen De Young","text":"It's a week's journey. And don't ask your priest for that now because."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2284.12,"end":2286.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, please, can I."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2286.72,"end":2312.29,"speaker":"Fr Stephen De Young","text":"What are your used charcoals? But, but the, the idea is is the same. Right. So it's different enough that it's one is not a substitute for the other. Right, Right. One is more full, more rich. Right. But it is a sort of lesser degree of participation. Right. In the reality."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2312.85,"end":2319.41,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. All right. All right. Well, we're going to go ahead and take our first break and we will be right back."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2320.37,"end":2336.7,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-22-346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2341.98,"end":2343.9,"speaker":"Fr Stephen De Young","text":"Are you struggling in your walk with Christ?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2344.22,"end":2346.1,"speaker":"Fr Andrew Stephen Damick","text":"Do you want to rediscover your reason."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2346.1,"end":2353.14,"speaker":"Fr Stephen De Young","text":"For living, the person you were created to be renewing you, a priest, a psychologist and a plan gives you the."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2353.14,"end":2354.98,"speaker":"Steve","text":"Keys to unlock areas of your life."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2354.98,"end":2362.59,"speaker":"Fr Stephen De Young","text":"That hold you back from fully experiencing the renewal and transformation God has in mind for you. Co authored by a priest and a."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2362.59,"end":2365.75,"speaker":"Steve","text":"Psychologist, Father Nicholas and Dr. Roxanne Lowe."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2365.75,"end":2368.47,"speaker":"Fr Stephen De Young","text":"Renewing youg combines principles of spiritual growth."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2368.79,"end":2374.87,"speaker":"Steve","text":"With psychological tools to help you become your best self, fully connected with God's purpose for you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2374.95,"end":2382.63,"speaker":"Fr Stephen De Young","text":"To purchase this book, please go to store.ancientfaith.com that's store.ancientfaith.com."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2387.36,"end":2460.77,"speaker":"Steve","text":"Hi, this is Father Evan Armitas, priest at St. Spirit on Greek Orthodox Church in Loveland, Colorado, and the host of the Ancient Faith Radio Sunday Night Call In Show Orthodoxy Live. I am pleased to announce today the release of my first book for Ancient Faith Publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of Orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of life that has become normal for many even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice. Prayer, Fasting and almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless. We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AFRA."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2464.52,"end":2528.38,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second half of the show. We're ready to take your call. So you just heard the voice of Steve. Feel free to give us a ring, 855 AF radio. All right. We were just talking about incense. So that actually leads very nicely into the next part of our discussion. So, you know, it's not like, again, it's not like religion as we think of it now, where we tend to think of religion as something that happens. You know, for most of us, it happens on Sunday morning. There's religion down there at the church and then we come home. And I remember, you know, even when I was pastoring, I did have this didn't happen very often, but I did have people like, well, what do you do during the week, Father? And it's like, well, actually, you know, we have services during the week. We do come to the church and pray and, and offer incense, among other things. Right. So was it the same in ancient Israel? Were they doing services every single day at the tabernacle and then later the temple?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2529.18,"end":2537.18,"speaker":"Fr Stephen De Young","text":"Yeah, I mostly play Assassin's Creed during the week. But it's good that I'm glad you're there."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2537.26,"end":2538.54,"speaker":"Fr Andrew Stephen Damick","text":"Nothing else to do."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2538.7,"end":2540.46,"speaker":"Fr Stephen De Young","text":"You're there praying for me. I'm glad."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2542.38,"end":2554.09,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man, you just ruined a lot of Pastors Day. Look, Father Stephen plays Assassin's Creed during the week, but you'll handle the prayer for me, won't you, Father? Yes, of course I will."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2554.49,"end":2569.53,"speaker":"Fr Stephen De Young","text":"Yeah. No, you could tell I was being facetious because I said it. So. Yeah. What we're going to talk about in this half of the several halves we have this evening."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2569.85,"end":2571.13,"speaker":"Fr Andrew Stephen Damick","text":"Yes, that's right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2571.53,"end":2686.2,"speaker":"Fr Stephen De Young","text":"Is we're talking about the different offerings going on at the tabernacle and then the, the later temple. And these different types of offerings also serve as building blocks. They're like Legos, right? Or the knockoff Duplo blocks that I used to get. No bitterness here at all. Anyway, they're sort of like Legos in the sense that they, you know, exist in their own right, and they're going on at the tabernacle and later temple in their own right. But then when we get to the feasts, right, they'll. They'll be sort of put together in different ways for sort of larger ritual celebrations. So as one example that we'll talk about more next time when we talk about atonement and the day of atonement in particular is, you know, sort of the first instruction for the day of atonement is that the high priest and his sons who are assisting him need to go and offer sin offerings for themselves. And it doesn't spell that out at the time because it's already told you what a sin offering is, so you just sort of plug that in there. So these not only are offerings that were done, but they're also building blocks for larger ritual realities for feasts and other celebrations. And so that, that starts with the, the very first commandment concerning worship. And let me. This is another brief digression, but let me go ahead and do it. When we're talking about, when we're talking about worship, it's important that we already mentioned this, that God gave particular commands, but worship is something we're offering to God, right? Which means we, we need to offer him what he wants, not what we want to give and what we want to offer."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2687,"end":2693.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and it's, and it's not, it's not a show we're putting on for the people who come, right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2695.24,"end":2761.86,"speaker":"Fr Stephen De Young","text":"So that, that runs against our idea of worship. We, we like to be. We want to express ourselves and our creativity and that kind of thing from a biblical perspective is really bad and dangerous. But, but if you even think about it for a minute, I mean, the Things that are offered in sacrifice are universally referred to as gifts. And we talked about how it's hospitality. Right? So, right. When you're giving hospitality, you're giving something to please the guest, not like what you like and you want to give to them. But the example I give a lot of the time is that if. If my anniversary or my wife's birthday rolls around and I get her a Makita cordless power drill, right. She's not going to be happy. That's not because it's a lousy drill. That's not because it's not a very useful tool or that there's something wrong with it. It's that that's not what she wanted. Right. My wife wanted a saber tooth tiger skull, not a Makita cordless power drill. Actual Christmas gift."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2761.94,"end":2766.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say this sounds too specific to just be made up on the spot."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2766.9,"end":2767.3,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2767.54,"end":2767.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2767.98,"end":2770.42,"speaker":"Fr Stephen De Young","text":"So, yeah, my wife once wanted."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2770.5,"end":2773.14,"speaker":"Fr Andrew Stephen Damick","text":"My wife once wanted a. A laminator."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2773.46,"end":2774.18,"speaker":"Fr Stephen De Young","text":"So there you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2774.34,"end":2775.38,"speaker":"Fr Andrew Stephen Damick","text":"That is what she received."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2776.18,"end":2787.15,"speaker":"Fr Stephen De Young","text":"Right. So that's the idea. So if what God wants, right, are these things, that's what we. We give to him and, and, and bring to him."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2787.39,"end":2787.95,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2789.15,"end":2807.47,"speaker":"Fr Stephen De Young","text":"So the first commandment he gives. So sort of the baseline, right. For what's going to happen to the tabernacle. And then the temple is given in Exodus, chapter 30. And, and that's basically that incense is to be offered on the altar of incense at morning and at evening."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2808.35,"end":2808.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2808.99,"end":2813.8,"speaker":"Fr Stephen De Young","text":"Every day. I don't know if you want to actually read that. Read those verses."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2813.8,"end":2873.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm going to read that. And then we actually have a call coming in that's directly related to this. So we'll just take the call in a second. So, okay, so this is Exodus, chapter 30, verses 7 through 9. Aaron shall burn on it sweet incense every morning when he tends the lamps, he shall burn incense on it. And when Aaron lights the lamps at twilight, he shall burn incense on it, a perpetual incense before the Lord. Throughout your generations, you shall not offer strange incense on it, or a burnt offering or a grain offering, nor shall you pour a drink offering on it. So it's reserved for incense only. And at particular times, it being the altar of incense. Yeah, yeah, right. And not the strange incense. So, like, there's a particular kind you're supposed to use. Right, right. So, all right, so we've got James from Washington, and he's calling specifically about incense. So, James, can you hear me? Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2874.29,"end":2876.21,"speaker":"Unregistered: James","text":"I can hear you. Thank you for having me on."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2876.61,"end":2879.09,"speaker":"Fr Andrew Stephen Damick","text":"Great. What's your question or comment, James?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2880.05,"end":2959.61,"speaker":"Unregistered: James","text":"So I actually originally started thinking about this in context of the last episode, talking about incense and how it was used as a purgatory type thing where you're cleaning out for demonic worship as well, of like one kind of demon that you're being worshipped and you use incense to cleanse the area. So I was wondering, why would that. What is it being cleansed from? Is it other demons that it's being cleansed from? And why would they not like that particular odor? In a sense, maybe they have like different factions of different kinds of smells that they might have. And then I was thinking about going back into the actual regulations in this particular passage in Exodus 30 about how God gave a very specific recipe for what kind of incense supposed to use and not use strange or foreign incense. And then when Moses or Aaron's sons used that strange fire, they were killed for it. And so there are like a very strict rules about that. But then I also notice in modern in usage, we have some people will use that same exact recipe for incense, and other people use other ones, like for other. For the magi, when they have particular incense for them or for the annunciation, they use different incenses for different time periods. So it's like, that's not strict anymore. So I was wondering if you could comment on that part."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2960.25,"end":2973.06,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's a great question, and I have no answer to any of that. But I'm pretty sure that Father Stephen has something that's really interesting, actually. I just don't know, Father, I'm sure you know something."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2973.22,"end":2980.5,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. I'm tempted to reinsert my Caius reference from last time, but I'll spare everyone because Father Andrew didn't get it anyway."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2981.06,"end":2982.26,"speaker":"Fr Andrew Stephen Damick","text":"I didn't. No."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":2982.58,"end":3067.67,"speaker":"Fr Stephen De Young","text":"So. But yeah, so it's not an issue of like, that particular smell drives them away, drives demons away, like garlic with vampires or something. It's. Yeah. So there's sort of. There's sort of two pieces here. So the first piece is the purgative element. Has to do with the fact that. And we'll get into this a little more in just a minute, but we have a very trans. We talked about this a little last time. We have a very transactional view of sin. Right. Sin is breaking a rule, committing a crime. And that's been sort of invested in us through our American Puritan religious culture. But in actuality, sin we talked about as this power or force that's active in the world. And that's how St. Paul talks about. He talks about sin not sins most of the time. And that leaves a residue. The way it's talked about in the, the Torah and the rest of the Old Testament is very much more like a disease. And now that we've all been quarantined for a year, we all have a much better idea of this. Right. It's, it's not just the idea. It's not just the disease or a person with the disease that we have to worry about. It's things that have been touched by the person with the disease."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3067.75,"end":3068.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3068.23,"end":3072.87,"speaker":"Fr Stephen De Young","text":"Coming into the place afterwards, the air that's been breathed out by the person with the disease."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3073.35,"end":3073.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3073.67,"end":3111.05,"speaker":"Fr Stephen De Young","text":"That, that things become tainted or infected by sin. The material creation becomes affected and tainted by sin. And so that the purgative element of sacrifice, that expiation element, is cleansing and removing and purifying from that taint. So it's not just driving the demons out, but removing the residue that they've left and the residue of our sins. So this is when people ask me why I need to come every year and, and bless their house after theophany, I say, well, I don't. As long as you don't sin in it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3111.61,"end":3115.49,"speaker":"Fr Andrew Stephen Damick","text":"Right. I also tell people that, yeah, we."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3115.49,"end":3159.46,"speaker":"Fr Stephen De Young","text":"Don'T need to bless and rededicate it. As long as you don't commit any sins there, you don't let sin into your house. And so that's, that's the same kind of thing with incense. That's why we sense the sanctuary at the beginning or right before the beginning of all of our services. It's cleansing and rededicating the physical space. And that's something that we as modern Americans don't have, this ontological understanding of sin as sort of stuff, as sort of grime, a sort of literal filth. That's why there's such a connection between sin and uncleanness in the Torah in the Old Testament. So you're kind of cleaning the air in terms of the."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3159.78,"end":3172.26,"speaker":"Unregistered: James","text":"I'm sorry, when you're worshiping demons within sense, does that sense that you're actually like, putting soot out there? Like you're, you're deliberately contaminating the area with sin? And that's like in the court, in the reverse of that, then."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3173.62,"end":3187.11,"speaker":"Fr Stephen De Young","text":"Yeah, it would, in some cases, they'd use it to conjure certain spirits. But even, even pagans had an idea that there were spirits they wanted to interact with and spirits they didn't want to interact with."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3187.26,"end":3225.07,"speaker":"Fr Andrew Stephen Damick","text":"With. Yeah. And I imagine that offering incense to a particular spirit is part of, like, it's not just like, like you were asking about the sort of recipe, James. But I can't imagine. I don't know. Correct me off this if I'm wrong about this, Father, but I can't imagine that particular recipes kind of drive away certain kinds of spirits. Like you said, garlic. Right. With vampires. But rather that it's a question of participation and offering this as a sacrifice to the spirit that you're offering it to. Right. And not then to the other ones around. Am I getting that right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3225.47,"end":3236.35,"speaker":"Unregistered: James","text":"Like a heraldry kind of thing where I'm doing this because this is related to you, this is your pattern. And so I'm using that same pattern to put an address on the prayer in a sense."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3236.51,"end":3244.83,"speaker":"Fr Stephen De Young","text":"Right. And the pagan gods and other spirits were involved in these constant conflicts with each other. So you're driving away the enemies of the God that you want to."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3245.82,"end":3245.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3245.98,"end":3396.91,"speaker":"Fr Stephen De Young","text":"The, the, the antithetical enemy spirits of the God that you're wanting to be there and interact with. Yeah. In terms of the, the recipe and us not having a recipe per se, this is one of the major things that happened. We're going to talk about this a lot more last time, our last time next time. I'm apparently time traveling now, but we're talking about this a lot, a lot more next time when we talk about atonement. But part of what happens in Christ's atonement is that the entire material world becomes cleansed. And so you no longer have material objects and things and animals and trees and plants and places that are necessarily unclean by nature anymore. And so you'll find in the Torah things being very limited in terms of material. Right. What material things can and can't be made out of. And of course all the food laws and all of this is a product of that, is that we have to view ancient Israel or the camp in the wilderness. And then ancient Israel, when they were functioning the way they were supposed to be, as sort of this island, the set apart island of holiness in this world consumed with darkness. Right. And so yeah, there's, there's a. So there are these particular things that are made clean and holy and sacred and everything else. And any deviation from that is still part of that corruption. And there's this major transition and we're going to talk about this with Christ's atonement and then the coming of the Holy Spirit and how this island comes to then expand and encompass the creation. But that's why there is no now particular recipe for incense that is more or less clean, but incent if you get orthodox incense, when the incense is being rolled in, the incense is being made. There are prayers that are said and. And blessings that are asked for. So it's sort of parallel to foods. Right now we receive all foods with prayer and Thanksgiving. Right. As opposed to only certain foods being clean and certain other foods being unclean. It's the same thing with incense, essentially."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3398.03,"end":3398.75,"speaker":"Unregistered: James","text":"That makes sense."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3400.59,"end":3408.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. In incense sense, as it were. Sorry. All right, well, does that answer your question then, James?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3409.38,"end":3419.86,"speaker":"Unregistered: James","text":"It absolutely does. And I am slightly disappointed. There's no, you know, pumpkin spice. Factions of demons versus the other spice."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3420.02,"end":3421.9,"speaker":"Fr Stephen De Young","text":"Yeah, this is super cool."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3421.9,"end":3424.18,"speaker":"Unregistered: James","text":"This is really fantastic. I really appreciate the answer there."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3424.9,"end":3425.54,"speaker":"Fr Andrew Stephen Damick","text":"Excellent."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3426.98,"end":3432.66,"speaker":"Fr Stephen De Young","text":"Pumpkin spice summons white girls and drives me away, for the record."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3436.64,"end":3448.72,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you for calling in, James. Nice to hear from you. All right, so we talked about incense offerings. There's a bunch of other offerings that we would talk about in this particular segment. So let's get rolling here. So what's the next one, Father?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3448.8,"end":3450.24,"speaker":"Fr Stephen De Young","text":"In this of our many halves."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3450.64,"end":3461.04,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Yeah. And some people ask, like, how can you have a third half? It's like, because this is one and a half shows, and this particular episode is gonna have four halves. Because this is a double show."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3461.49,"end":3463.09,"speaker":"Fr Stephen De Young","text":"Two shows for the price of one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3463.33,"end":3464.05,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3464.05,"end":3499.23,"speaker":"Fr Stephen De Young","text":"Cheap is free right there. So the next time, we're talking about sin offerings. Right, Right. And these are sacrifices, obviously, that are sacrificed on the altar of burnt offering, not on the altar of incense. And these importantly, sin offerings. If you read Leviticus closely, I know it's hard, and I know no one wants to do it, but it's worthwhile. It pays off if you actually do it. Leviticus is very clear that it's not always animals."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3500.35,"end":3501.23,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3501.23,"end":3502.19,"speaker":"Fr Stephen De Young","text":"It's always some food."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3502.43,"end":3509.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's always food. Sometimes it's cakes. Right. Sometimes it's alcoholic beverages. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3510.99,"end":3511.71,"speaker":"Fr Stephen De Young","text":"And oil."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3513.06,"end":3513.3,"speaker":"Fr Andrew Stephen Damick","text":"Oil."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3514.1,"end":3546.71,"speaker":"Fr Stephen De Young","text":"And sometimes. Then there's also meat from an animal that has been killed, because that's where you get meat. But in sin offerings, the killing, again, as we talked about last time, is not ritualized. You have to kill it so you can eat it. Right. You have to slaughter an animal to prepare it as meat. But the killing part is not ritualized. It's just about, again, food. And everything we said about. We've said about sacrifices already applies to this."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3547.19,"end":3548.15,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3548.71,"end":3567.35,"speaker":"Fr Stephen De Young","text":"But it's also not, again, talking about that transactional view of sin. It's not responsive. It's not like the priests were sort of sitting around the tabernacle going oh, we could have to do any sin offerings today. Oh, here comes Simeon, always lying. He's got a sheep with him. Suppose we're going to have to sacrifice it again. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3568,"end":3574.68,"speaker":"Fr Andrew Stephen Damick","text":"Like. Right. It's. Right. It's this ongoing thing. Sin offerings are being offered every day."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3574.68,"end":3576.56,"speaker":"Fr Stephen De Young","text":"Right, Right. Continuously."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3576.8,"end":3649.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because sin is in the world. And it's. It's a driving off of that effect, a cleansing of that effect. It's not one to one. It's not like paying a fine to God. Oh, you know, we sin, so got to make it. We're going to fix it. Right. This, This, I think, is such a critical point, because there's. There's a lot of bad theology out there. I'm just going to call it that. There's a lot of bad theology out there that, that thinks that's what sacrifice is. But sin offerings, it's interesting that they are specifically. The sin offerings are specifically. Not that. You know, it's. It's. It's. It's like. I don't know, you know, I mean, in some ways, it's like that offering of incense which is done to, you know, to purify and cleanse, whatever. And we don't say, okay, how sinful was I this morning? I'll put three pieces of incense in the sensor today. You know, like, oh, man, I had a big fight with my wife last night. You know, son, you got to put 10 pieces of incense on the sensor. It's not like that. It's not like that. There's not a, you know, it's not quantitative, it's not retributive. It's not any of that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3649.84,"end":3670.64,"speaker":"Fr Stephen De Young","text":"Right. And there's this bizarro world idea, and I call it that because you just can't get it from the Old Testament. But a lot of people have it in their heads that, you know, someone would steal something, and so they'd say, oh, no, I stole something. God's going to kill me, but if I kill this goat, he'll take that instead."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3671.69,"end":3672.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3672.33,"end":3675.61,"speaker":"Fr Stephen De Young","text":"So I'm gonna go down to the tabernacle of the temple and kill this goat."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3676.17,"end":3676.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3676.65,"end":3681.61,"speaker":"Fr Stephen De Young","text":"And then everything will be okay and I can go on my merry way. That's not it at all."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3682.41,"end":3686.09,"speaker":"Fr Andrew Stephen Damick","text":"Citation needed. There isn't one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3686.41,"end":3762.2,"speaker":"Fr Stephen De Young","text":"The sin offerings for all the thefts and all the lies and all the unfaithfulness and all the sins that are being committed are going on all the time at the tabernacle in the temple. And when I steal something, what I do to repent is I go and Pay back, make restitution, right? What I stole plus four times more, right. To the person I stole from, right. And then, right then I have repented. Right. And the combination of the sin offering that's going on at the tabernacle or temple that I'm nowhere near, I'm weeks away. And me repenting and making the restitution is what takes care of the situation and restores the situation. But the thing that I do is make the restitution, right, make it right. And that's how. That's how sins are dealt with in the Torah. There aren't like public beatings and floggings like in. In Hammurabi's code to punish you for what you did. There aren't. You aren't like maimed or disfigured, right? Like in Hammurami's code based on what you did."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3762.68,"end":3763.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3764.12,"end":3785.49,"speaker":"Fr Stephen De Young","text":"There are limits placed on vengeance. But see, even vengeance is a communal means of restoring justice. Right? It's a way of rebalancing the scales, even vengeance. And so the Torah limits vengeance to keep it from going out of control. But restitution is what's. Is what's called for."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3785.81,"end":3852.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's also another side to this which I think is also. Is really important to underline, which is why, okay, so why do you need to deal with sin? Right. It's not just like, I don't want to go to hell when I die or something like that. Like, there's actually something much. Although, you know, we should. Maybe we'll flesh that out in our episodes on Sacred Geography. I know people are waiting on those, but no, there is actually a reason to deal with sin, and that is that God's presence is potentially dangerous. And so you deal with sin so that God will remain present with you. And the reason why is because God's presence in the presence of sin burns that away. Right? If you retain sin and you enter into the presence of God, then that is harmful for you because God's holiness does that to things that are corrupted by sin."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3853.42,"end":3853.74,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3853.74,"end":3870.83,"speaker":"Fr Andrew Stephen Damick","text":"And of course, we see in the Old Testament a number of times where God withdraws his presence in response to great sin. Not because, like, I'm going to punish you by leaving, but rather I'm going to leave to give you a chance not to be annihilated by being in the presence of the holy God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3871.95,"end":3872.35,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3872.43,"end":3873.87,"speaker":"Fr Andrew Stephen Damick","text":"That's why it's necessary."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3874.19,"end":3927.94,"speaker":"Fr Stephen De Young","text":"And our caller, James, and I'm not picking on him. I'm not picking on you, James. But you notice when he brought up Aaron's sons, Nadab and Abihu. How? He just defaulted into expressing it. They broke the rules about incense and so they were killed. Yeah, Right. Which, which isn't actually what the story says in Leviticus. What the story says in Leviticus is that they came into God's presence unworthily and the fire of God's presence incinerated them. Yeah, that's very different. Right. That, that's very different. And so, yes, this is for God to live among his people, this holiness and purity needs to be maintained because otherwise God is going to break out and consume the camp or he's going to have to leave, which he does in the exile."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3929.22,"end":3940.9,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so we've got another kind of offering that's given. There's incense offerings, sin offerings. Next is peace offerings. Peace offerings. So what's that all about, Father?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3941.35,"end":3947.91,"speaker":"Fr Stephen De Young","text":"And I'm using the old King James nomenclature on these."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3949.11,"end":3952.47,"speaker":"Fr Andrew Stephen Damick","text":"That warms my dinosaur heart so much."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3954.15,"end":3955.75,"speaker":"Fr Stephen De Young","text":"Ye olde. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3957.83,"end":3961.43,"speaker":"Fr Andrew Stephen Damick","text":"With those S's that look like F's. Oh, those are the best. Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3962.95,"end":3981.92,"speaker":"Fr Stephen De Young","text":"So sin offerings are helping restore the, the relations within the community and the community's relationship to God. Right. And maintain it sort of on a regular basis. Right. Sort of this sin maintenance system. Peace offerings are when there's been a major rupture."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3982.56,"end":3986.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So you're going to make relationship. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":3986.04,"end":4014.52,"speaker":"Fr Stephen De Young","text":"And so. Yeah. And so this will happen in two situations. Number one, moments of great repentance. Right. Which. And often these two things are related. Right. Where the community realize, wow, we've really messed up or we've been messing up for a long time. Right. So we need to turn around and repent and make peace with God and reestablish this whole relationship sort of from scratch, like King Josiah's reforms."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4014.76,"end":4030.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. And sometimes they know that that's necessary because there's been a famine or plague. Right, right. This, this. Yeah. You're like, oh, this horrible thing is befalling all of us. We had better make it right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4030.24,"end":4037.44,"speaker":"Fr Stephen De Young","text":"Right. And it's not, it's not God gets angry and punishes them. It's. This is what it takes to get their attention."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4038.8,"end":4048.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right, Right. God permits this suffering on a mass scale precisely to, you know, get them to repent. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4048.24,"end":4052.78,"speaker":"Fr Stephen De Young","text":"To prevent something worse down the road if they continue down the road that they're going."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4054.54,"end":4056.62,"speaker":"Fr Andrew Stephen Damick","text":"So relevant for our present moment."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4058.7,"end":4088.27,"speaker":"Fr Stephen De Young","text":"And so these peace offerings are. Are similar to sin offerings. They'll often involve sort of more or more valuable animals. Right. Or more and more valid grain offering. Right. That more is involved to make a bigger show, not because, like, oh, well, this is more powerful. Well, if you do two bulls, then God will really listen to you instead of one bowl. Right, that's right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4088.99,"end":4091.43,"speaker":"Fr Andrew Stephen Damick","text":"Keep up those phrases. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4091.43,"end":4101.23,"speaker":"Fr Stephen De Young","text":"But it's to emphasize. Right. And display actual contrition. Right. So if we put this into our hospitality metaphor."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4101.71,"end":4102.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4102.99,"end":4114.76,"speaker":"Fr Stephen De Young","text":"There's a difference between me inviting somebody over who is my friend and I'm just maintaining and deepening that relationship, and something's come between me and someone else."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4115.08,"end":4115.44,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4115.44,"end":4132.65,"speaker":"Fr Stephen De Young","text":"I've done something that offended them or hurt them badly, and I'm inviting them to my home to try to make peace. Right. I'm. I'm going to be sort of more giving and more to. To try to truly express to them how sorry I am."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4132.8,"end":4133.04,"speaker":"Fr Andrew Stephen Damick","text":"Am."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4133.52,"end":4144.32,"speaker":"Fr Stephen De Young","text":"And the, The. The sincerity of the fact that I'm going to try to change and not do that again. Right. And those same kind of relational terms."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4144.72,"end":4146.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Yep, yep."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4146.64,"end":4155.52,"speaker":"Fr Stephen De Young","text":"So then to get through the sort of. The last few. These are relatively quick. There are thank offerings, which are volunteer."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4155.68,"end":4156.32,"speaker":"Fr Andrew Stephen Damick","text":"Sound like."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4156.32,"end":4171.82,"speaker":"Fr Stephen De Young","text":"Yeah, that's what it says on the tin. Yeah. So God gives us gifts, hopefully we're thankful for them, and so we offer thanks. In ancient Israel, a lot of times this was related to taking vows."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4172.3,"end":4186.7,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. Right. Lord, if you do this, then I will. If you do this for me, then I will offer a sacrifice in thanksgiving. God does the thing. Offer the sacrifice."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4187.38,"end":4233.51,"speaker":"Fr Stephen De Young","text":"Right, right. Don't be like the nine lepers who just went off into town. Yeah, right. And then grain offerings, which are usually attached to their type of thank offering, really, but they're related to the harvest generally. So it's the first fruits of the harvest. We'll talk about the feast of first fruits. And then drink offerings, which were just drink offerings, just means it's liquid, not that you drink it. That's. And those are sometimes done independently, like at the olive and grape harvest, where you just offer oil or wine. But usually it's done in the context of another sacrifice where the oil and the. Or the wine and. Or the wine are poured out on what it is that you are. That you are offering."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4233.91,"end":4252.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And so then question that I have about that is like, one of the things I think that oil and especially strong wine maybe have in common, other than being liquid, is that they're flammable. Is that. Is that. Is that an element of it, you know, that. That you poured out on the sacrifice to make it so it's easier to light."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4253.37,"end":4258.81,"speaker":"Fr Stephen De Young","text":"To make it easier to light? And that they'll light, right? It would be hard to sacrifice water, right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4258.89,"end":4259.33,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4259.33,"end":4260.97,"speaker":"Fr Stephen De Young","text":"Elijah pulled it off, but."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4262.97,"end":4265.52,"speaker":"Fr Andrew Stephen Damick","text":"He had helped."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4270.71,"end":4273.67,"speaker":"Fr Stephen De Young","text":"Should I do the Father Stephen ruins your Sunday School since I brought."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4273.67,"end":4276.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes, we might as well before we go to our next break. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4276.47,"end":4299.01,"speaker":"Fr Stephen De Young","text":"It's time for Father Stephen ruins your Sunday school Fire from Heaven, particularly the context of the BAAL cycle. And so BAAL is the what's at issue in the story of the prophet Elijah on Mount Carmel? Fire from heaven is a way of is the way that they described lightning. So it's actually say that lightning struck the altar of the sacrifice."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4299.25,"end":4304.85,"speaker":"Fr Andrew Stephen Damick","text":"It wasn't some fiery funnel of fire coming down in a big spiral. And it was not."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4304.93,"end":4326.46,"speaker":"Fr Stephen De Young","text":"It was not. We made an amateur video when I was in 8th grade of this episode where we took some GI Joe figures and wrapped them in toilet paper as robes and made a little altar with a plastic cow on it and then like zoomed in real tight and so sprayed some WD40 over a lighter like in front of the lens to incinerate everything. But that was not historically accurate."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4328.22,"end":4330.58,"speaker":"Fr Andrew Stephen Damick","text":"And we'll be releasing that on YouTube later this month."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4330.58,"end":4331.02,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4332.86,"end":4338.94,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, now that Father Stephen has ruined Sunday school for all of you, let's take our next break."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4339.98,"end":4372.21,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO. The Orthodox Christian tradition is filled with wisdom and guidance about the biblical path of salvation. Yet this guidance remains largely inaccessible to parents and often disconnected from the parenting."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4372.21,"end":4376.01,"speaker":"Fr Stephen De Young","text":"Challenges we face in our homes. Parenting Toward The Kingdom by Dr. Philip."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4376.01,"end":4378.57,"speaker":"Steve","text":"Mamalakis, Ph.D. will help you make the."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4378.57,"end":4382.33,"speaker":"Fr Stephen De Young","text":"Connections between the spiritual life as we understand it in the Orthodox church and."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4382.33,"end":4384.37,"speaker":"Steve","text":"The ongoing challenges of raising children."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4384.61,"end":4386.69,"speaker":"Fr Stephen De Young","text":"It takes the best child development research."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4386.77,"end":4390.33,"speaker":"Steve","text":"And connects it with the timeless truths of our Christian faith to offer you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4390.33,"end":4393.41,"speaker":"Fr Stephen De Young","text":"Real strategies for navigating the challenges of daily life."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4394.53,"end":4407.9,"speaker":"Unregistered: James","text":"I try and say, well, here's what parents is and then here are some strategies for how we actually parent. And then here's how we understand some of the important aspects of parenting."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4407.98,"end":4434.61,"speaker":"Steve","text":"You can find Parenting Toward the Kingdom and more@store.ancientfaith.com Again, that is store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237234, 6. That's 855-AF-RADIO."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4437.33,"end":4491.95,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, welcome to the third half of the show. We just kind of did a lightning fast pun, fully intended tour through the offerings sacrifices of ancient Israel. So. All right, well, let's talk about the ways that some of this is different from the surrounding paganism. Because as we said at the beginning, we're not claiming that Israelite worship is derived from paganism. Right. That this is just sort of one paganism that we have privileged as being the one true one. Right. But there are some really interesting and important discontinuities. Right. So let's talk about some of those. And I know that the one that we wanted to start with is what is referred to in this wonderful King Jamesy English as the shewbread. S H E W or showbread. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4492.51,"end":4494.35,"speaker":"Fr Stephen De Young","text":"It's pronounced Sho. Either way. I just."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4494.35,"end":4494.99,"speaker":"Fr Andrew Stephen Damick","text":"Either way."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4495.31,"end":4496.83,"speaker":"Fr Stephen De Young","text":"To warm your heart. Cockles."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4497.07,"end":4517.39,"speaker":"Fr Andrew Stephen Damick","text":"It really does warm my heart. I almost about to pull down my 1611 King James from the shelf up here and look at those wonderful S's. That look like F's. So. All right, so showbread. Either way, it's spelled showbread. Well, what is that? All right, what is showbread, Father Stephen?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4517.47,"end":4519.79,"speaker":"Fr Stephen De Young","text":"Well, thine excitement showeth forth."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4522.43,"end":4523.55,"speaker":"Fr Andrew Stephen Damick","text":"It came to pass."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4528.03,"end":4545.16,"speaker":"Fr Stephen De Young","text":"Yeah. So this is one of those sort of overlooked things. Yeah, maybe, maybe if when you were a kid, you made the little. The little model of the tabernacle, you know, you made the tiny little table for the showbread, but other than that, it gets passed over pretty quickly."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4545.48,"end":4588.69,"speaker":"Fr Andrew Stephen Damick","text":"So. Okay, I have to interrupt you there and say this. I never did that actually. But my great, great grandfather, who was a Baptist preacher up in New England, he was a pastor at a number of churches up there, but he had a thing that he would do and he made a model of the tabernacle and he would go around giving presentations on it. And there are pamphlets and stuff from when he did this. So I'm pretty sure based on what I've seen what he did, he was very detailed about this. So I'm sure he must have had a little showbread table. So even though I never did that, it is indeed in my blood. Just had to add that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4588.69,"end":4591.05,"speaker":"Fr Stephen De Young","text":"Did he make tiny bread to put on it?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4591.05,"end":4594.41,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. True. That would be so cool."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4594.73,"end":4605.85,"speaker":"Fr Stephen De Young","text":"I don't know. So. So this is another thing that does what it says on the tin. Right. This is a table, a literal table."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4606.09,"end":4606.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4606.97,"end":4627.01,"speaker":"Fr Stephen De Young","text":"With bread on it. It. And that bread was replaced every day and that bread was there to be eaten by the priests during their service in the tabernacle and then later in the temple. And so I think it gets passed over because people are like, oh, okay, so there's a place where they kept their sack lunch."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4627.01,"end":4630.33,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, Right. But priests got to eat too, guys."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4630.33,"end":4631.77,"speaker":"Fr Stephen De Young","text":"So, yeah, that was."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4631.77,"end":4639.66,"speaker":"Fr Andrew Stephen Damick","text":"No, but. Yeah, but it's actually. But it's. But it's obviously a. A ritualized thing, you know?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4639.66,"end":4739.83,"speaker":"Fr Stephen De Young","text":"Right, right. Because there's specific instructions about the replacement of the bread and the exact dimensions of the table and what it was to be made out of and how it was to be decorated. And so what this represents is basically an inversion we talked about in the past, how once a God had been localized in a. In a pagan temple, it was then cared for by the priests. So they would dress it. They would make sure it stayed standing up. If it tipped over because there was an earthquake, they would. And they would bring it food. Right, Right. So they were servants to. And slaves to essentially, and providing for this divine spirit that they were worshiping. So the fact that there is this table in the presence of Yahweh, the God of Israel, from which he feeds his priests. So rather than the priests feeding God, God is feeding the priests and providing for them is a direct sort of inversion of what was going on at the pagan temple. And probably the most famous place that people actually have read, because they probably haven't spent a lot of time in Exodus reading the. Not one, but two times that the exact dimensions of the table are given. They may remember the episode where David, while he's fleeing from Saul, needs food badly. Right. Warrior needs food badly. Thank you. I got that one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4740.07,"end":4743.81,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so Warrior is about to die."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4747.09,"end":4759.21,"speaker":"Fr Stephen De Young","text":"So he goes. He's running the gauntlet and he goes. He goes to where the priests are serving, and he eats some of the showbread. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4759.21,"end":4759.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4760.45,"end":4769.67,"speaker":"Fr Stephen De Young","text":"And probably more people than have actually read that original story in the Old Testament have read the place where Christ refers to it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4770.15,"end":4770.63,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4770.95,"end":4782.15,"speaker":"Fr Stephen De Young","text":"In the New Testament, in. In the Gospel, where Christ refers to it during an issue, one of the perennial issues between he and the Pharisees."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4782.63,"end":4783.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4783.35,"end":4784.31,"speaker":"Fr Stephen De Young","text":"About the Sabbath."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4784.71,"end":4795.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Where they're like. Like, how dare you do this on the Sabbath? And Jesus says, whoa, guys, you know, the Sabbath was made for men and not men for the Sabbath."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4795.64,"end":4797.64,"speaker":"Fr Stephen De Young","text":"Sabbath, Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4797.64,"end":4800.44,"speaker":"Fr Andrew Stephen Damick","text":"Don't you remember how David ate the showbread?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4800.6,"end":4807.96,"speaker":"Fr Stephen De Young","text":"Right. Because his. The particular issue at that point was that his. The disciples were. As they walked through a field plucking heads of grain."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4808.36,"end":4808.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4808.76,"end":4857.64,"speaker":"Fr Stephen De Young","text":"And eating them. And so the Pharisees Said, hey, that's harvesting. Right? Red card. Right. Low grade harvesting. So and so Christ talks about, haven't you read where David ate the show bread in the temple? Do you not know that the Sabbath was made for man, not man for the Sabbath? And it might maybe have struck us as odd is like, well, wait, what does one have to do with the other? Right, right. So like David ate some bread. Okay. They're eating grain. I kind of see that. And they're doing it on the Sabbath. So then he talks about the Sabbath. Right. But the reason Christ is referring to this is David's on the run from Saul. David is God's anointed and God provides food for him. The showbread is all about God feeding his people."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4858.12,"end":4858.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4858.76,"end":4877.29,"speaker":"Fr Stephen De Young","text":"And giving his people what they need. And so in the same way, the same principle Christ is saying is at work in the Sabbath. The Sabbath is a day of rest that's given as a gift. It's not given as an obligation. Yeah, right. It's not set up as a test."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4878.09,"end":4889.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes. And I mean, this just shows again how different Yahweh is from all of the petty gods of paganism in that he loves his people."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4890.33,"end":4890.97,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4890.97,"end":4901.29,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we see this with the man in the wilderness. Exactly the same God directly feeding the people. And then of course, you know, the feeding of the five. I mean, we could keep going on and on about this."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4901.89,"end":4917.97,"speaker":"Fr Stephen De Young","text":"Right. God gives, provides his people with food and he provides them with rest on the Sabbath. And not only for them, but for their fields, for their animals, for their servants. Yeah, right. He rides rest for the whole, for the whole creation. That's what connects those two things."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4918.13,"end":4968.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. All right. So the next one that we wanted to talk about, and this was one that really intrigued me because I had, I never paid attention to this. And that's the question of what exactly the vestments of the high priest are all about. So I know if our friend Father Timothy Honicke is listening and I know he is a fan of Lord of Spirits, his ears are perking up right now. Because if you ever go to Father Timothy's church, he has this vast collection of vestments. And I think a lot of them have been gifted to him. But I know he loves vestments and well, he should. He is the best dressed priest in the oca. Just putting that out there. Anyway, so this is about vestments, the high priest vestments. How does that compare? A contrast to paganism? What's that all about?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":4969.75,"end":5012.36,"speaker":"Fr Stephen De Young","text":"Yeah. So, and this is another thing that will probably eventually the Whole high priest and the high priesthood and how that relates to Christ of Hebrews. There will probably be a future episode, undoubtedly unto itself. But for our purposes here, this is another thing that a lot of people don't read through is the. Not one, but two times we're told in great detail about the vestments of the high priest and what they're to be made out of and all of the deals. And we're not going to go into super detail about that right now. But as a broad overview and a tease for that future episode, when you compare that to the ceremonial garments that were put on idols in pagan Canaanite temples, they're virtually identical."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5013.64,"end":5021.28,"speaker":"Fr Andrew Stephen Damick","text":"So the priest, the high priest is dressed like an idol, a Canaanite idol. Right. Is that what you're saying?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5021.28,"end":5022.36,"speaker":"Fr Stephen De Young","text":"Yes. Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5022.36,"end":5023.08,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5023.56,"end":5060.42,"speaker":"Fr Stephen De Young","text":"Yeah. Right. So up to it, including the diadem, the crown that's put on his head, that has on the front of it the name of God. It has Yahweh on it, on his. On his forehead. And this, this goes back to. And we're going to touch on this again in our fourth half. But this goes back to two. Right. We've talked about on the show before. Genesis one takes this form of the building of a temple. And then Adam is placed there too."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5060.5,"end":5060.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5061.63,"end":5067.39,"speaker":"Fr Stephen De Young","text":"Serve in that temple. And Adam is placed there as man is placed there as the image of God. Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5067.55,"end":5079.55,"speaker":"Fr Andrew Stephen Damick","text":"Which is the inversion of the pagan pattern where man builds a temple, man builds his own image of God instead. Here, man is the image of God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5079.55,"end":5086.43,"speaker":"Fr Stephen De Young","text":"Right. And so that the high priest wears a crown, but he's not a pagan priest king. He doesn't receive worship himself."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5087.48,"end":5092.92,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. The pagan God. Kings do get worshiped like this. The people are worshiping them. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5092.92,"end":5141.53,"speaker":"Fr Stephen De Young","text":"Because they are one of the bodies of that God. And so they are that God in some sense. But again, this is an inversion. The high priest images God through his service in the temple. He serves as an icon of God through his service, through his actions. Right. The image is this verbal idea. And so that service shows him as the image of God. And this, this. And again, we'll get into this more when we do the inevitable whole episode. But this whole theology surrounding the high priest as, as. As the image of Yahweh in the Old Testament, serving in the temple is what, for example, Your old friend, St. Ignatius of Antioch, who I still wish somebody would write a good book about."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5144.41,"end":5147.53,"speaker":"Fr Andrew Stephen Damick","text":"Maybe if you go to store.ancient faith.com you can find one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5150.01,"end":5175.3,"speaker":"Fr Stephen De Young","text":"That St. Ignatius of Antioch picks up on when he starts talking about the bishop in the church as the icon of Christ and his role in the gathered community. And so there's a continuity there, but this is a major discontinuity between. With it, with the priest kings of the pagan world and the dressing of idols."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5175.54,"end":5271.88,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this is really interesting to me, this is just now kind of occurring to me too is, you know, we made the point again that Israelite worship is not sort of derived from pagan worship and that there's important discontinuities which we're pointing out now. But notice everybody, the kinds of discontinuities, these are. These are discontinuities that say something specific about the character of pagan worship, especially of the demons that the pagans worship. Right. It's not. Oh well, we have our own version of this. Right. It says something about who Yahweh is and how he is not like any of the other ones. And if, if, if someone. Thing were being derived, if the one was being derived from the other, like if, if Israelite worship was being derived from paganism, you would expect it to be like a grander version. Right. Or just sort of a different version. Right. As. And that's the way that derivation generally goes. But these are direct negations about the very core identity questions of who's being worshiped. So, you know, it couldn't be derived from. Because there's this at the core. There's this. It's an utter negation of those things. Right. And as a Christian I would look at this and say actually it goes the other direction. That pagan worship represents a reduction. Distortion of this."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5273.01,"end":5273.81,"speaker":"Fr Stephen De Young","text":"Right. A corruption."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5273.81,"end":5276.05,"speaker":"Fr Andrew Stephen Damick","text":"A corruption of the corruption. Exactly."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5276.05,"end":5292.13,"speaker":"Fr Stephen De Young","text":"Right. In the same way that when we were talking about the 5ish falls of the angels. Right. The way that the succession myth in paganism, where there's some kind of divine rebellion of a divine son against his Father who kills him, whatever else, and overthrows him."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5292.69,"end":5293.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5293.01,"end":5296.53,"speaker":"Fr Stephen De Young","text":"Is. Is corrected to the fall of the devil."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5297.01,"end":5297.49,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5297.49,"end":5305.6,"speaker":"Fr Stephen De Young","text":"After his, after his attempted insurrection. It's the same kind of principle at play here, but very functionally in ritual worship."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5306,"end":5306.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5306.64,"end":5308.48,"speaker":"Fr Stephen De Young","text":"Enacted and participated in."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5308.56,"end":5333.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have to imagine if a pagan were present at this, a devout, if we could put it that way, pagan, he would be offended by what he was seeing. Right? He would have to be because this is insulting his gods in a very direct kind of way. Not by saying Yahweh is better, but. But by utterly saying Yahweh is unlike, totally unlike those gods."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5333.13,"end":5338.29,"speaker":"Fr Stephen De Young","text":"Right. And to offer that kind of pagan worship to Yahweh is therefore insulting to him."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5338.69,"end":5339.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5339.09,"end":5342.53,"speaker":"Fr Stephen De Young","text":"It is a dishonoring of him because of what it says about him."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5342.85,"end":5376.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You can't write. Exactly. It would be like going. You know, it'd be like. Like meeting. I don't know if you were to get an audience with the President of the United States or if you would get an audience with a corporation. Queen of England. Right. And, you know, a normal thing to do would be maybe to bring some kind of gift and you were to go and get a toy from the dollar store and offer that to them as a gift. That would be insulting and totally inappropriate because that's for kids, you know, so. Yeah, yeah, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5376.74,"end":5392.75,"speaker":"Fr Stephen De Young","text":"Cool stuff. So. And so then the, The. The last big discontinuity, and this is a major discontinuity is sort of what. What was done or in this case, really what wasn't done with the blood."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5393.39,"end":5399.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because there's. If you're offering an animal. Right. If you're offering an animal, there's. There's blood. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5399.15,"end":5402.83,"speaker":"Fr Stephen De Young","text":"Yeah. So. And we talked a little bit last time about some of the things."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5404.99,"end":5405.27,"speaker":"Fr Andrew Stephen Damick","text":"That."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5405.27,"end":5446.47,"speaker":"Fr Stephen De Young","text":"Was done with the blood. Everybody agreed there was power in the blood, right. Yeah. How they chose to use that power was different. So we talked about in paganism that often, for example, in Greco Roman shrines, there'd be a shrine to the God and there'd also be the grave of a hero and the blood would be poured into the grave here. The blood was seen to sort of feed. The shades of the dead would feed on it. Because that was sort of your netherworld afterlife in Hades was you existed as this shadow of your former self sort of slowly faded away as people forgot about you."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5446.71,"end":5456.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just like I think. I think I made the comparison to Tinkerbell, or at least in my head I did. You know, you have to believe in her. Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5456.55,"end":5459,"speaker":"Fr Stephen De Young","text":"Or, you know, Marty McFly's Polaroid. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5460.6,"end":5461,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5462.04,"end":5498.24,"speaker":"Fr Stephen De Young","text":"Right. They sort of cease. Cease to exist. So this was sort of feeding them, remembering them, and feeding them in other rituals. The blood would actually be consumed. And so that's why there are such strict rules against the consumption of blood in the Torah, in Leviticus, the holiness code in particular, and those continue. And we'll probably do an episode of this at some point. But that's one of the things that continues in the Book of acts, in chapter 15 that continues in the church is about the consumption of blood."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5498.72,"end":5499.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5499.44,"end":5525.37,"speaker":"Fr Stephen De Young","text":"But we'll get into that at some later point. So that. That's what was done with the Blood in pagan circles. So for most of the sacrifices, sacrifices in Israel, the ones that were being done correctly, at least the blood was collected just like it was collected in the pagan sacrifices. But then in most of them, it was poured out at the base of the altar."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5526.57,"end":5527.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Why would you do that?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5528.81,"end":5537.38,"speaker":"Fr Stephen De Young","text":"You're disposing of it. You're disposing of it by pouring it into the ground, you're returning to the life, to the ground from which it came. And you're disposing of it in a sacred place."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5538.1,"end":5538.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5538.74,"end":5554.66,"speaker":"Fr Stephen De Young","text":"Not just any old place. Not throwing it in the trash. Not. Right. So it seemed, because blood is life, it seemed to be in some sense sacred. And so it's. It's disposed of in a sacred place in a. In a sacred way."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5554.9,"end":5566.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And isn't it also used like the way incense is used in that it's under. Like it's sprinkled on people and on stuff and in places. Well, it's understood to purify and cleanse."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5567.11,"end":5588.79,"speaker":"Fr Stephen De Young","text":"In rarer cases. Yeah. Mostly it's disposed of in that way. And then there are particular cases. We're going to talk about the most major one next time when we talk about atonement, how it's used on the day of atonement, but at the giving of the covenant, it was sprinkled on the people. At the ordination of the high priest, it was put on his ear and his. And his thumb and his big toe."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5590.49,"end":5590.89,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5591.53,"end":5600.73,"speaker":"Fr Stephen De Young","text":"The High priest episode. We'll talk more about that. But it usually wasn't actually applied to people. But yes, in those other cases, the blood was seen as this cleansing and purifying agent."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5600.73,"end":5601.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5601.05,"end":5603.29,"speaker":"Fr Stephen De Young","text":"It was never offered to anybody."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5604.09,"end":5604.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5604.73,"end":5613.69,"speaker":"Fr Stephen De Young","text":"It's Israelite religion. It was never offered to anybody. It was never used to pay for anything. It was not blood for the Blood God. You got to go to Mesoamerica to get that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5615.78,"end":5616.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5616.58,"end":5622.58,"speaker":"Fr Stephen De Young","text":"It was either disposed of in the sacred way or used for the purpose of cleansing and purification."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5623.3,"end":5627.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not. You don't put it on the table and eat and drink it with your God."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5627.78,"end":5628.18,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5628.26,"end":5630.3,"speaker":"Fr Andrew Stephen Damick","text":"Unless you're a pagan or offer it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5630.3,"end":5631.38,"speaker":"Fr Stephen De Young","text":"To him in any other way."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5631.94,"end":5651.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right. A very important point. Okay. Well, having gone through those discontinuities, and there's lots of other things we could say. Of course, we're going to go ahead and go to our next break. And we'll be back with the fourth half of tonight's Lord of Spirits, Father Andrew Stephen Damick."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5651.23,"end":5666.23,"speaker":"Steve","text":"And father Stephen DeYoung will be back in a moment to Take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5672.32,"end":5705.19,"speaker":"Fr Stephen De Young","text":"So here's a question for you. What does it mean to think Orthodox? What are the unspoken and unexplored premises and presumptions underlying what Christians believe? Orthodox Christianity is based on preserving the mind of the early church, its Phronima. Dr. Jeanne Constantino brings her more than 40 years experience as a professor, Bible teacher and speaker to bear in explaining what the Orthodox phronema is, how it can be acquired and how that phronema."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5705.19,"end":5708.79,"speaker":"Fr Andrew Stephen Damick","text":"Is expressed in true Orthodox theology as."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5708.79,"end":5726.08,"speaker":"Fr Stephen De Young","text":"Practiced by those who are properly qualified by both training and a deep relationship with Christ. Thinking Orthodox now a available@store.ancient faith.com that's store.ancient faith.com."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5728.56,"end":5744.65,"speaker":"Steve","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5747.69,"end":5807.76,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, now it's the fourth and final half of Lord of Spirits because this is twice the show tonight, so we're doubling down. That's right, we are. So, okay. All right. Well, let's talk now about calendars a little bit. Right. There's, as we mentioned at the beginning, there's these two, these two calendars that exist. There's a calendar that's tied to the agricultural year and there's a calendar that's tied to Passover. So okay, so what is that all about? What's going on? This is the big stuff. Right? So like for us Orthodox Christians, Pascha, Pentecost, these, you know, Nativity, these are like, these are our major feasts. So we're going to be talking about some of those, these major feast now. So what's going on? Let's talk about the most important one first, the Passover cycle. Right. So what's happening in that?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5808.4,"end":5812.32,"speaker":"Fr Stephen De Young","text":"Right. So there's one thing Orthodox people love talking about. It's calendars."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5812.8,"end":5813.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5814.32,"end":5816.56,"speaker":"Fr Stephen De Young","text":"Never been any controversy about them either."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5817.52,"end":5820.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Totally, totally unified on that question."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5820.96,"end":5853.53,"speaker":"Fr Stephen De Young","text":"So, yeah, as we mentioned, the agrarian cycle sort of comes first and then the, the Passover cycle that we're about to talk about gets layered onto it later, of course, when Passover happens. Right? Yeah. Right. That's an actual event in the life of Israel that ends up helping constitute Israel. So that sort of comes second. So you have these two separate cycles. And so the Passover cycle, appropriately enough, begins on Pascha, on Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5855.29,"end":5855.69,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5857.61,"end":5885.1,"speaker":"Fr Stephen De Young","text":"This is of central importance, obviously, not only in the Old Testament, because in the Exodus, it is the formative event of Israel. It is what constitutes Israel, but it is the formative event in the New Testament in the sense that when Christ's sacrifice is being talked about, when his death is being taken. Talked about, it's identified the vast majority of the time with Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5885.42,"end":5886.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5886.62,"end":5901.66,"speaker":"Fr Stephen De Young","text":"Christ is the Lamb of God, not the goat of God. Which day of atonement is a goat. Right. So we, we think about Christ's sacrifice primarily in terms of atonement because we've grown up in the west. But that's not the way the scripture does it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5901.82,"end":5908.87,"speaker":"Fr Andrew Stephen Damick","text":"He's the lamb and not the bull of God either. Oh, please. No. Yes. Now that. For so many reasons."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5909.03,"end":5932.81,"speaker":"Fr Stephen De Young","text":"Yeah. Now that said, there are places. Right. And we're going to talk about those next time when we talk about atonement, the day of atonement. There are places, chiefly St. Matthew's gospel and the passion narrative in it. First, John, Hebrews are the big ones that are going to talk about Christ's sacrifice in terms of the day of atonement and atonement. So that is there in the New Testament of it. But that's the minority report. Right, right. That's right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5933.53,"end":5944.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's the Lamb of God. I mean, that's how he's introduced in, in John's Gospel. Especially when you. When you get St. John the Forerunner, behold the Lamb of God who takes away the sin of the world."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5944.65,"end":5962.97,"speaker":"Fr Stephen De Young","text":"Right, right. So it's important that, I mean, that, that tells us that the New Testament is telling us that if we want to get who Christ is and specifically what Christ does, if we want to get that right, we have to understand Pascha. We have to understand the Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5963.37,"end":5963.93,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5964.17,"end":5968.73,"speaker":"Fr Stephen De Young","text":"In the Old Testament, because that's what they're using to explain what he does to us."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":5969.13,"end":6008.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And one of the cool things I notice about that parallel is in both the Old and the New Testament, you actually get the instructions from God about how to celebrate this thing before the thing happens. Right. This is how you're going to celebrate the Passover. And now Passover occurs. And then with Christ, there's the mystical supper. Do this as my remembrance. Do this for as often as you eat this bread and drink this cup. And then he is sacrificed for the sin of the world."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6009.36,"end":6012.98,"speaker":"Fr Stephen De Young","text":"He says, this is my body broken for you? His body hadn't been broken yet."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6013.46,"end":6015.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6015.06,"end":6038.13,"speaker":"Fr Stephen De Young","text":"He was showing them how to participate in it ritually later. Right. And just as a side note for anybody who gets hung up on that word remembrance, as I imagine some of our friends do, the word anamnesis, the word remembrance there is the same word that's used in numbers 10, 10 in the Greek to refer to Sinoph."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6038.2,"end":6041.96,"speaker":"Fr Andrew Stephen Damick","text":"Offerings do this."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6042.68,"end":6056.84,"speaker":"Fr Stephen De Young","text":"Offered, are offered as a remembrance. Sin offerings are offered as a remembrance before the Lord. So what Christ is really saying there, if you take it in the context of the. The Septuagint, is he's saying, do this as my remembrance."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6057.48,"end":6059.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. This is the worship that I expect."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6059.72,"end":6063.4,"speaker":"Fr Stephen De Young","text":"This is taking the place of the sin offering. Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6063.81,"end":6066.93,"speaker":"Fr Andrew Stephen Damick","text":"He's transforming the whole deal at that moment."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6067.25,"end":6072.53,"speaker":"Fr Stephen De Young","text":"Right. The Eucharist is fulfilling the sin offering. It's not sin offerings. Just stop."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6074.05,"end":6078.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Mic drop, Sorry. So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6080.69,"end":6087.65,"speaker":"Fr Stephen De Young","text":"So in addition to that, right there is that. And of course, Christ dies at the Passover. He doesn't die on the day of atonement, he dies at the Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6087.89,"end":6091.81,"speaker":"Fr Andrew Stephen Damick","text":"Right. St. John makes that. St. John makes that super, super clear."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6092.51,"end":6128.43,"speaker":"Fr Stephen De Young","text":"Yeah, all four Gospels make that. But, yeah, right. John has the element of setting it up so that Christ dies as the lambs are dying. So the, the first important thing in terms of getting Passover right is there's no element of substitution, penal or otherwise, in the celebration of the Passover. What do I mean by that? This is another one of those things that's in people's heads is that we're killing this lamb so that God doesn't kill my kid."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6129.07,"end":6151.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Because at the Passover, the Angel of Death comes to Egypt and kills the firstborn son of every Egyptian household, including the son of Pharaoh. And so there's this idea then that people have of if we kill this lamb, then, then my. Then my son's not going to be killed."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6151.88,"end":6152.28,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6153.16,"end":6160,"speaker":"Fr Andrew Stephen Damick","text":"But if you look at the instructions on what to do with the lamb, it kind of doesn't actually work out."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6160,"end":6184.49,"speaker":"Fr Stephen De Young","text":"That way because not only are there no instructions on how to kill it, so again, the killing part isn't ritualized. It's about eating it. But they're not proportioned. One lamb per firstborn son. So if we think about it for a minute, right, if I don't have any kids, do I just not eat the Passover? Because, hey, you know, there's nobody to die."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6184.89,"end":6186.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or if you only have daughters."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6186.81,"end":6188.33,"speaker":"Fr Stephen De Young","text":"Yeah, if I only have daughters."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6188.57,"end":6188.97,"speaker":"Fr Andrew Stephen Damick","text":"Or."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6190.89,"end":6202.76,"speaker":"Fr Stephen De Young","text":"On the flip side, right, if, if great Granddad and granddad and dad and son are all firstborn sons and we all live in the same household. We don't do four lambs."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6204.12,"end":6204.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6204.68,"end":6224.36,"speaker":"Fr Stephen De Young","text":"We still just do one. Right, right. And the instructions explicitly say. Right. There's not supposed to be any leftovers because again, the instructions are all about how to eat it, not how to kill it. There's no leftovers. So if your family isn't big enough to eat the whole lamb, you're supposed to share one with another small family."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6225,"end":6226.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6226.12,"end":6229.72,"speaker":"Fr Stephen De Young","text":"It's not like half a lamb for each son. Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6229.72,"end":6230.6,"speaker":"Fr Andrew Stephen Damick","text":"So, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6230.99,"end":6235.47,"speaker":"Fr Stephen De Young","text":"The lambs are in no way apportioned according to children."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6236.11,"end":6242.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no correlation. It's an act of. Of worship, not an act of payment."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6244.11,"end":6283.09,"speaker":"Fr Stephen De Young","text":"Right, right. Not. Or. Or punishment or. Yeah, right, right. There's some impending death penalty. Right. And I mean, that wouldn't make sense in the first place. Right. Because the whole reason the 10th plague happens, the plague of the firstborn happens, is that Pharaoh went and murdered all the sons of Israel. Right. He had them thrown in the Nile. And God says, those were my children. Right. And so this 10th plague is balancing the scales of justice. Why would he kill more Israelite children?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6285.98,"end":6297.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So it. The point is to make. I mean, we're going to make this point a little bit more. But. But there is a distinction coming. Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6298.14,"end":6307.74,"speaker":"Fr Stephen De Young","text":"Trying to put wedge, some kind of substitution, especially penal substitution in there. That dog don't hunt. It just doesn't. It doesn't work with what the Bible says."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6307.98,"end":6309.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6309.79,"end":6313.71,"speaker":"Fr Stephen De Young","text":"So that's. That's the negative side, and then we get to the positive side."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6313.87,"end":6333.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So what exactly is God doing here? Yeah. And. And this is, you know, obviously, especially for this, this podcast in particular. We always kind of love it when God puts the smackdown on demons. Right. That's kind of the whole. That's our deal. So. Yeah. God says, I am judging the gods of Egypt."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6333.47,"end":6343.78,"speaker":"Fr Stephen De Young","text":"Right. Tonight I will judge all the gods of Egypt. So that's the first thing he says about what he's doing. Right. Nothing about, I need to kill some kids for some reason. It's."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6343.78,"end":6344.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6344.9,"end":6346.74,"speaker":"Fr Stephen De Young","text":"I'm judging the gods of Egypt."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6346.98,"end":6357.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or to. Yeah. Or to throw back to our earliest episodes. Not, I will judge all these imaginary beings that you guys worship for some reason, even though they don't exist."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6357.86,"end":6379.97,"speaker":"Fr Stephen De Young","text":"Right. I'm going to lay this back down on the Marvel Cinematic Universe. Right. Yeah. Yeah. I'm gonna beat up fictional character Captain America. Yeah. So this is. Yeah. This is war. This is war on the. Of the Egyptian gods. Okay. That's where it's directed. Remember, Pharaoh was one of the gods of Egypt."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6380.21,"end":6381.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6381.57,"end":6405.55,"speaker":"Fr Stephen De Young","text":"That's why he's part of this. So then the second piece, and this is, this is the clearest piece in terms of what's going on at Passover. I mean, the basic bottom line description of Passover. Right. What is Passover when it's at home, Right. Is that this is a bunch of slaves being set free from slavery. Right, Right. Which is."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6405.55,"end":6409.91,"speaker":"Fr Andrew Stephen Damick","text":"But slavery to whom? Right, yeah, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6410.47,"end":6415.11,"speaker":"Fr Stephen De Young","text":"Not slavery. Well, slavery to Pharaoh. But Pharaoh, remember, is one of the gods of Egypt."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6415.11,"end":6417.59,"speaker":"Fr Andrew Stephen Damick","text":"Is one of the gods. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6417.67,"end":6463.36,"speaker":"Fr Stephen De Young","text":"So these people are being set free from slavery to the God, to the gods of Egypt. And the fancy word for today is manumission, which I. Which I like because contains the idea of manumittance. And the mit in there is the same mit from remit. And so remission, which is a word we use liturgically to talk about sin. So the reality is that after Babel and we've talked about this, the whole world, there is no Israel at this point. So all the nations, the whole world is in slavery to these demonic powers. And the chains are sin. Sin is the power that binds them into that slavery."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6463.76,"end":6474.89,"speaker":"Fr Andrew Stephen Damick","text":"Right. So God is, is setting free anyone in this event who chooses to worship him in the Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6475.93,"end":6476.33,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6476.81,"end":6480.01,"speaker":"Fr Andrew Stephen Damick","text":"No matter who, no matter what their family tree is."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6480.33,"end":6485.17,"speaker":"Fr Stephen De Young","text":"Right. Because he says the other thing. God says it's always good to get it from the horse's mouth. Right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6485.17,"end":6485.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6485.69,"end":6493.32,"speaker":"Fr Stephen De Young","text":"What does God say he's doing at Passover? He says, I am going to make a distinction between Israel and Egypt."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6494.35,"end":6494.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6495.15,"end":6504.91,"speaker":"Fr Stephen De Young","text":"So before that he had sort of done that. Right. Because we read about the earlier plagues, like the darkness was over the land of Egypt, but not over the place where Israel lived."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6505.15,"end":6506.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Not over Goshen."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6506.91,"end":6563.55,"speaker":"Fr Stephen De Young","text":"Yeah, right. And the frogs were all the places except where Israel lived. Right. But that's a geographic thing. And people descended from Abraham and full blooded Egyptians were living as next door neighbors. Right, Right. We know this, the text says so, because remember, they. Those Egyptians give them gifts while they're leaving their neighbors. So this distinction is different. This distinction is who is going to be Israel and who is going to be an Egyptian. And those who are Egyptians are going to be those who are still enslaved to the gods of Egypt and Israel are going to be all those who are set free. So that night, if you took the blood of that lamb, again, it's about what you do with the blood. And you use that blood to mark your doorposts, to Mark you out as an Israelite. It doesn't matter if you're ethnically a full blooded Egyptian, an Asiatic Canaanite."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6565.47,"end":6565.79,"speaker":"Steve","text":"Full."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6565.79,"end":6582.68,"speaker":"Fr Stephen De Young","text":"Blooded, descended from Abraham himself, a Midianite like Moses wife. It doesn't matter that night, if you mark your doorpost, you're now an Israelite. And if you don't, it doesn't matter if you're a full blooded descendant of Abraham. If you don't mark your door, you're now an Egyptian."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6583.4,"end":6631.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I think it's important, you know, as this sort of freedom from slavery occurs and the creation now of this new nation of Israel, I mean there is, you like use the word manumission, you know, redemption. And that does include, you know, the way we tend to think about it is buying a slave and setting him free. But the important part of that is the setting them free because God isn't paying off the Egyptian gods. Here you go guys, we're going to give you this so I can have these people. Now. That's not what's going on. So there is a redemption going on, but the important part of it is being set free from slavery. It's not about any kind of payment being made because God does not pay. Demonstration. Right. That's not a thing."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6631.81,"end":6633.25,"speaker":"Fr Stephen De Young","text":"He doesn't owe them anything."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6633.49,"end":6637.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they don't have. Right. They don't have any rights. They don't have any rights."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6637.97,"end":6652.53,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So, so, and then going forward, right, so that night, participation in the Passover and, and circumcision that had come previously marked out who was an Israelite. And that stays true going forward."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6653.25,"end":6654.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6654.17,"end":6658.77,"speaker":"Fr Stephen De Young","text":"The person who is the Israelite is the person who is circumcised eats the Passover."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6659.57,"end":6659.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6660.05,"end":6685.35,"speaker":"Fr Stephen De Young","text":"And so that's what distinguishes, when you get into Leviticus and the holiness code, what distinguishes someone just living in Israel from an Israelite is that someone who is an Israelite eats the Passover. And if someone wants to eat the Passover, they have to be circumcised. Right, right. So it's circumcision and then participation in the ritual meal. Right. The rite of initiation, participates in ritual meal, makes you an Israel."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6686.22,"end":6686.54,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6686.62,"end":6689.02,"speaker":"Fr Stephen De Young","text":"And there may be some parallels to that in the church."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6690.06,"end":6704.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. And you know, and notably, I mean this is one of the things that is also parallel in paganism. Like what is it that makes you an Egyptian? It's that you make sacrifices to and participate in that worship of the Egyptian gods."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6704.54,"end":6709.58,"speaker":"Fr Stephen De Young","text":"It's ritual, it's ritually determined, not genetically determined because they didn't Have a concept of genetics."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6710.06,"end":6713.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. It's not about genealogy."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6713.51,"end":6727.83,"speaker":"Fr Stephen De Young","text":"Yeah. And one of my favorite examples of this that I don't think I've done on this show before, but I will now, is that Phineas, the grandson of Aaron, who was the high priest of Israel, was a. An African."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6729.51,"end":6736.71,"speaker":"Fr Andrew Stephen Damick","text":"Right. So he would have been Moses's great nephew. Right, right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6736.79,"end":6750.97,"speaker":"Fr Stephen De Young","text":"And we know this for sure. His mother was from Put, which it was Libya at the time. And his name, Pinhas in Egyptian, roughly, or Pinhasi, literally means Nubian or dark skinned one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6751.77,"end":6757.21,"speaker":"Fr Andrew Stephen Damick","text":"Right. So he was right up there in the leadership of Israel."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6757.21,"end":6772.89,"speaker":"Fr Stephen De Young","text":"He didn't look like Abraham. He was the high priest. He was one of the most celebrated high priests in Israelite history. So this, the ethnic idea of Israel did not exist. Exist in ancient Israel. It was ritually. Ritually determined."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6773.53,"end":6790.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay, so that's Passover Pascha, two words that mean the same thing, by the way, for everybody. But that's not the only major feast in this cycle. Right. There's also Pentecost seven weeks later."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6790.89,"end":6807.27,"speaker":"Fr Stephen De Young","text":"Right, right. And it's often referred to, you know, in our King James titles, again, the feast of weeks. Right. In the, in the Old Testament, which sometimes confuses people because it's clearly called Pentecost in the New Testament. And Pentecost, of course, comes from 50 days, right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6807.35,"end":6808.79,"speaker":"Fr Andrew Stephen Damick","text":"50. Yeah, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6809.99,"end":6823.13,"speaker":"Fr Stephen De Young","text":"But they don't realize that the feast of weeks is the same thing. It's called the feast of weeks because being on the 50th day, you've got 49 days in between that. Seven. Seven. So it's a week. A week of weeks."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6823.21,"end":6825.29,"speaker":"Fr Andrew Stephen Damick","text":"A week of weeks. Right, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6826.81,"end":6837.13,"speaker":"Fr Stephen De Young","text":"And so that makes it the feast of weeks. And that was the. The participation that begins with. And then is the future. Participate. Ritual participation in the giving of the covenant at Mount Sinai."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6837.53,"end":6838.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6839.45,"end":6871.74,"speaker":"Fr Stephen De Young","text":"And that also involved blood. Right. And the sprinkling of blood on the people when they, when they received the covenant. And so as it was celebrated later, people who were newly admitted, who had eaten the Passover for the first time, this is where they celebrated becoming party to the covenant with Israel. And this was for people who were long term Israelites and later Judeans, when they sort of reaffirmed and recommitted and rededicated themselves to the covenant."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6872.38,"end":6880.62,"speaker":"Fr Andrew Stephen Damick","text":"And an interesting detail, probably worth pointing out, since this is the Lord of Spirits podcast, is the giving of the Torah happens by means of angels."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6880.86,"end":6881.26,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6881.26,"end":6899.34,"speaker":"Fr Andrew Stephen Damick","text":"It says in scripture that angels are present. It's not like such a big disappointment in some Ways, for me, it's not like where you see Charlton Heston alone on the mountainside, you know, in the Ten Commandments, you know, one, thou shalt have no other."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6899.34,"end":6905.14,"speaker":"Fr Stephen De Young","text":"You know, like, wasn't it lightning? Don't they have lightning? Come down and write it. It's been a while since I watched the movie."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6905.22,"end":6905.86,"speaker":"Fr Andrew Stephen Damick","text":"Right, yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6905.86,"end":6908.5,"speaker":"Fr Stephen De Young","text":"And it wasn't lightning. It was Jesus with his finger."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6908.98,"end":6909.46,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6909.54,"end":6913.34,"speaker":"Fr Stephen De Young","text":"And that will be in a future episode. But. Right, right, but there's."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6913.34,"end":6918.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's. There's angels involved in the giving of the law. I mean, it says this in the New Testament."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6918.74,"end":6966.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. And so then this, this, this sprinkling with blood that we see for cleansing and purification and dedication. They gave you a temple. When the Old Testament talks about the new Covenant, that's to come in Jeremiah 31 and Ezekiel 36, 24 through 28, and Joel, chapter two. We won't read all those now, but it talks about being sprinkled with pure water. Sprinkling with water as this making of the new covenant and the coming of the Holy Spirit. And so, lo and behold, when we get to Pentecost in the Book of Acts, we see the reception of the Holy Spirit and baptism with water, and those two things brought and combined together."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":6967.19,"end":7023.91,"speaker":"Fr Andrew Stephen Damick","text":"How about that, huh? Okay. All right, so that's Pentecost. All right. There's also this other calendar, the calendar that has to do with. With the agricultural cycle. Right. And I think this is a good place for us to finish up here because this helps to emphasize, again, for us that religion is not this separate thing. It is simply the right way. You know, there is the right way of life. Right. And so nothing, I think. Well, I shouldn't say nothing, but an agricultural liturgical calendar really emphasizes this because it's these things that are necessary for survival now being suffused with a festal, liturgical, prayerful character."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7024.07,"end":7024.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7025.03,"end":7038.55,"speaker":"Fr Andrew Stephen Damick","text":"So, okay, so let's just talk about a few of those. The one we're not going to talk about this time is the Day of Atonement, also known as Yom Kippur, because. Tune in next time. That's what that's going to be all about."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7038.55,"end":7041.15,"speaker":"Fr Stephen De Young","text":"So we're just going to be all atonement all the time."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7041.15,"end":7043.07,"speaker":"Fr Andrew Stephen Damick","text":"All the time. Yeah. Put a pin in that."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7044.75,"end":7045.95,"speaker":"Fr Stephen De Young","text":"Goats all the way down."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7046.27,"end":7073.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Maybe that should be the title of the episode. All the way down the cliff. Yeah. Okay. All right. There's Rosh Hashanah. Rosh Hashanah. Rosh Hashanah, yeah. Now I suddenly remember. So when I was in college. I remember this now. Now, is this the day where they have the really serious fasting or is it Yom Kippur that has the big fasting?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7074.22,"end":7077.9,"speaker":"Fr Stephen De Young","text":"Most of the fasting now is Yom Kippur because they can't do the rest of it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7078.3,"end":7097.99,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Yeah. Because I remember when I was in college, so we're not going to talk about Yom Kippur, but this time when I was in college, I had a Jewish friend and she referred to Yom Kippur. I mean, this is what she called it as cranky Hungry Jew Day. And I was like, oh, that. That's interesting."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7099.75,"end":7102.79,"speaker":"Fr Stephen De Young","text":"Yom Kippur is marked by lots of praying and no breakfast."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7103.19,"end":7107.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. Okay. So Rosh Hashanah, what's that all about?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7107.51,"end":7132.48,"speaker":"Fr Stephen De Young","text":"Rosh Hashanah, which is on Tishri 1 on the calendar. That's the beginning of. Well, that's New Year. That's the beginning of this cycle, this agricultural cycle. So on the. On the Paschal calendar, right. Moses is told this month. Right. The month of Nissan, when Pasca falls, Nissan will be for you, the first of months. And then there's this other New Year's."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7133.28,"end":7134.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's because."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7134.72,"end":7143.21,"speaker":"Fr Stephen De Young","text":"Calendars. Yeah, yeah. So it begins then. And this is in early September, that this cycle. These are the cycle of sort of fixed, dated feasts."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7143.29,"end":7144.09,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7146.25,"end":7168.01,"speaker":"Fr Stephen De Young","text":"And so we talked about this. We won't go too, too much more into it now. You could refer back to the astrology episode. We talked about that in terms of Christ's birth and Noah's birthday and the coronation of David and all the things that happened on Tishri 1 and on that. That New Year's day. So we'll just footnote that back to that episode."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7168.49,"end":7168.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7169.21,"end":7189.81,"speaker":"Fr Stephen De Young","text":"So the next major one on the agricultural calendar is first fruits, which is again. But does what it says on the tin. Right. It's the beginning of the harvest. Right. But the reason why it's so important that you bring the first stuff, this is also related to."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7189.81,"end":7190.05,"speaker":"Fr Andrew Stephen Damick","text":"There's."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7190.05,"end":7192.66,"speaker":"Fr Stephen De Young","text":"There's also all the things related to the firstborn. Right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7192.66,"end":7193.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7193.14,"end":7213.34,"speaker":"Fr Stephen De Young","text":"Being holy, the male that opens the womb of animals and of people is holy and dedicated to the Lord. And there's sacrifices associated with that. Also the first fruits of the grain is because firstborn in the scriptures is not primarily about birth order. It's a status."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7214.14,"end":7220.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which is why Jacob and Esau. Jacob gets it and Esau loses it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7221.27,"end":7230.31,"speaker":"Fr Stephen De Young","text":"Right, right. It defaulted to birth order usually, but it's not always based on birth order. It's about being the heir. It's about having this status."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7230.63,"end":7234.63,"speaker":"Fr Andrew Stephen Damick","text":"Right. And the heir has this particular responsibility. Right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7235.19,"end":7237.75,"speaker":"Fr Stephen De Young","text":"Well, sort of. The heir inherits everything."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7238.39,"end":7238.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7238.95,"end":7252.04,"speaker":"Fr Stephen De Young","text":"And he's supposed to then share it out with his brethren. This, of course, did not always happen. There's an episode in the Gospels where someone comes to Christ and says, tell my brother to share the inheritance with me."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7252.28,"end":7252.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7253.08,"end":7255.4,"speaker":"Fr Stephen De Young","text":"I'm gonna go get the rabbi on your case. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7257,"end":7259.4,"speaker":"Fr Andrew Stephen Damick","text":"And they didn't have it run through probate."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7259.72,"end":7269.41,"speaker":"Fr Stephen De Young","text":"Yeah. Christ basically says, don't worry. Right. About that material stuff. Come follow me and be my disciple. Right, yeah, but."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7269.49,"end":7269.81,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7269.81,"end":7295.33,"speaker":"Fr Stephen De Young","text":"But they're supposed to share that. But this, this language. And we won't go into this now at some future date. This is critically important. Understanding what St. Paul's doing in Romans 9 and in Colossians when he talks about Christ as the firstborn and the heir, us as co heirs with Christ, we touched on this a little when we talked about sons of God. But that Christ is the firstborn, inherits everything, literally everything, the whole creation."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7295.85,"end":7296.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7296.09,"end":7313.61,"speaker":"Fr Stephen De Young","text":"And then he shares his rule and his reign and his priesthood and all of these things with us as his fellow heirs who become sons of God by grace. So by. By offering the first fruits and the firstborn and the first, you're effectively offering the whole thing."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7314.01,"end":7314.97,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7315.13,"end":7330.12,"speaker":"Fr Stephen De Young","text":"You're offering your whole life, your whole self. Right. A family's future was that heir who was going to receive everything and carry on the family into the future. So if that's offered a dedicated to God, you're dedicating everything you are, everything you have, to God in that action."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7330.68,"end":7380.63,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right. Yeah. Okay, so then the next feast is called the Feast of Booths or Tabernacles or. I know I get this wrong. Sukkot. Sukkot. Sukkot. Sukkot. And this is done at the end of the harvest. Right. So you've got the first fruits, and now this is at the end of the harvest. And it's called the Feast of Tabernacles or Booths, because during this period, Israel would go and live back in temp. In tents. Right. Or temporary housing of some kind. Yeah, exactly. In sort of remembrance of this. Of the time that they were nomadic peoples. Right. But it actually has this kind of greater purpose and meaning. Right. And so. So what. What is. Yeah, what. What's going on there? Exactly."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7381.26,"end":7390.18,"speaker":"Fr Stephen De Young","text":"Yeah. It wasn't a love shack for you to get together with your friends. The idea was over and over again."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7390.18,"end":7392.18,"speaker":"Fr Andrew Stephen Damick","text":"I got that one too, in the."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7392.18,"end":7412.72,"speaker":"Fr Stephen De Young","text":"Torah, especially in Deuteronomy, there's this constant warning from God. Right now you're dependent on me out in the desert for food and water and to take care of all these things. But once you get into the land and you settle down and you plant crops and you get into this rhythm, you're going to be tempted to forget."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7413.36,"end":7413.8,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7413.8,"end":7434.78,"speaker":"Fr Stephen De Young","text":"You know, forget about God. Forget about the fact that it's him who's providing for you, that it's him who's caring for you. Just forget about God in general. And so this was a one day, you're sort of reminder where at the time when they were feeling the most settled, when they reaped their harvest, that was the day that they unsettled themselves."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7435.41,"end":7445.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It would be like, it would be like, okay, everybody, we're gonna settle. We're gonna celebrate Thanksgiving by setting up tents in the backyard. Everybody. Yeah, right. Yeah, yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7446.05,"end":7499.5,"speaker":"Fr Stephen De Young","text":"And this was so that we'll be thankful for all the things that we're doing without. Yeah, yeah. So, and this is, this is of course a theme that gets picked up especially by St Peter in the New Testament, about us living as aliens and strangers in this world and not becoming too settled. But in the Old Testament, sort of the, the paradigmatic people who do this not just on that one day, but all the time, it's sort of an ancient asceticism that's referred to God praises them for doing this through Jeremiah. In Jeremiah, chapter 35 are the recovites, whose forebear. Yeah, whose forebear, Yonadav or Jonadab or Jehodadab, depending on what translation you read, taught them that they should never settle, that they should always live nomadically intense. And they should never drink alcohol."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7500.38,"end":7504.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's this ascetical way of life. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7504.54,"end":7510.14,"speaker":"Fr Stephen De Young","text":"And alcohol, it's not just that alcohol is bad, but if you think about it, in order to get alcohol, you have to let it ferment."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7511.02,"end":7511.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7511.58,"end":7547.59,"speaker":"Fr Stephen De Young","text":"So it's part of being settled again. And so they were to live in this unsettled way. And they did that all the way up until Jeremiah's day in the exile, they came from Sinai in the wilderness, and they just never settled to maintain, to try to maintain in their whole lives this sense of dependence on God and their praise for that. But then there's this other major ritual that was done at the feast of Tabernacles that is very important at Sukkot, and that's that 70 bulls were sacrificed to Yahweh."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7548.07,"end":7549.19,"speaker":"Fr Andrew Stephen Damick","text":"70, you say?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7549.51,"end":7552.39,"speaker":"Fr Stephen De Young","text":"Yes. Meats. Back on the Menu. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7554.39,"end":7557.15,"speaker":"Fr Andrew Stephen Damick","text":"So that one's for you, Eugene Strader."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7557.15,"end":7557.59,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7559.91,"end":7560.39,"speaker":"Fr Andrew Stephen Damick","text":"Beef."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7560.39,"end":7561.43,"speaker":"Fr Stephen De Young","text":"It's what's for dinner."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7561.67,"end":7562.55,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7563.67,"end":7564.11,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7564.11,"end":7567.51,"speaker":"Fr Andrew Stephen Damick","text":"70 bulls. 70 bulls. So where have we heard that number before?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7567.67,"end":7578.92,"speaker":"Fr Stephen De Young","text":"That number? Maybe that's the number of the sons of God. That's the number of the nations. And so Israel is offering these 70 bulls to Yahweh, one for each of the nations."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7579.4,"end":7579.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7580.68,"end":7589.64,"speaker":"Fr Stephen De Young","text":"So in doing this, the nation of Israel is acting as a priesthood for the world."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7590.68,"end":7591.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7591.96,"end":7674.84,"speaker":"Fr Stephen De Young","text":"So what we see in the holiness code and in other places that talk about culture, cleanness and uncleanness in the Torah are these sort of concentric circles around the presence of God. So the priests, who are the ones who are going to go most direct, well, the high priest especially, but then the whole priesthood, the Levites who are going to go into the presence of God, have to maintain this level of holiness and sanctity at all times. They have to wash more, wash their clothing more. They have to practice more ritual cleanliness and purity and holiness than the average Israel. Right, right. And then the average Israelite has these food laws, uncleanness and cleanness restrictions that they need to follow that the people who live in the other nations don't have to follow. And they're never called upon. The priests are never called upon to go and enforce their standards of holiness on the people, and the people of Israel are never called to go and enforce their standards of holiness on the Syrians or the Moabites or. Right. They were called to go to them and make them follow those rules. Right, right. Because that's. Now, if they were going to become Israelites, they had to begin to follow those rules and practice those things. Yeah, but if not, then they did not. Right. So there are these concentric circles, and those on the more inner circles served as priests for those in the more outer circles."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7674.91,"end":7675.39,"speaker":"Steve","text":"Circles."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7676.35,"end":7804.3,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah. I mean, it's fascinating because as modern people, we tend to think, again, of distinction as implying opposition. Right. So. Well, Israel. And it's interesting, often when Israel encounters ancient peoples, like, there's a sense that I think that some of the Romans have, you know, Israel is. Is weird. Right. They're holding themselves as different and separate. But. But the point is not to say this is that. That we're better than the nations or anything like that. It's that this thing that we're doing, these actions of purification, these standards that we're being held to are so that we may serve as the priests of the nations. And then within Israel, you've got the priesthood that is being held to another standard so that they may offer sacrifices on behalf of the whole nation. But yeah, I mean, like you said, there wasn't this expectation that everybody has to do this stuff. It's about preparation. It's about, you know, allowing them to have this function as. And it's interesting. I mean, there's all kinds of potential implications for how we could look at things now. Right. A good example, right. Orthodox Christians, we're expected to fast. There's all kinds of times that we're expected to fast, but we're not expected to preach the gospel of fasting. Right. We're not sent out into the nations, go into all the world and preach that you must fast on Wednesdays and Fridays and half the other days of the year. That's not the thing. That is the gospel to the nations. Now, when someone becomes part of the church and they become part of the royal priesthood, then they take these things on so that they can then serve in this priestly function as well."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7804.3,"end":7814.27,"speaker":"Fr Stephen De Young","text":"Right. And that's where that language comes from. Right. In Exodus, Israel's told, you're going to be a kingdom of priesthood. Priests. Priests for who? Right? Priests for the world."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7814.99,"end":7816.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's on those."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7816.99,"end":7840.97,"speaker":"Fr Stephen De Young","text":"And those priests had their own priests, Right. So there were Levites who were the priests for Israel, and then is the people of Israel were the priests for the world. Right. So there are these two phases and. And then St. Peter takes that same language about. That's translated royal priesthood from the Greek, usually same language. It applies it to the church, almost as if the church were Israel."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7841.61,"end":7842.41,"speaker":"Fr Andrew Stephen Damick","text":"How about that?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7843.69,"end":7860.17,"speaker":"Fr Stephen De Young","text":"And says the same thing. Which means. Which means it's not just that these are these rules, right. And these are these pastors. Sometimes even in the Orthodox Church, even with a good Orthodox understanding of salvation, we could fall into this idea that the goal is just about me saving myself."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7861.06,"end":7862.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7863.14,"end":7874.9,"speaker":"Fr Stephen De Young","text":"But that the reason we're keeping these disciplines and the reason we're drawing close to God is so that we can serve as priests. We. We offer the liturgy. We offer the sacrifice of the Eucharist for the life of the world and for its salvation."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7875.86,"end":7876.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7876.5,"end":7880.82,"speaker":"Fr Stephen De Young","text":"For the whole creation, which includes, but is not limited to all the people in it."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7882.1,"end":7909.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, I. I'm reminded of that. That fame, you know, that there's this quote from St. Seraphim of Sarof that often gets quoted as a kind of slogan, you know, acquire the Holy Spirit or acquire the spirit of peace, and thousands around you will be saved. And I think sometimes people Hear that? And they take it as like, oh, well, there's this wonderful secondary effect that other people around me are going to be saved if I just work on my own salvation."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7909.51,"end":7910.71,"speaker":"Fr Stephen De Young","text":"Collateral damage."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":7911.03,"end":8004.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right, right. And I mean, and there's like, there's a certain truth to that, but often it gets turned into this kind of quietism, right? That all I have to do, you know, just humble me a sinner, just a poor sinner, is work on my salvation. And that might have a nice effect on the people around me. But if you look at what St. Seraphim himself actually did, yes, he did spend those three years out there kneeling on a rock out in the wilderness, praying and really praying. But then after that, his life became this open door for the world, right? He became an offering for the world. He became a priest for the world. Right? It always goes like that. It's like at the end of the Divine Liturgy, there's the let us go forth in peace. To do what? Right to go to coffee hour, like, or to, you know, like to go to. You know. That's not. It's go forth having received this. Having received the Holy Spirit, we go forth now as priests of the world to bring the blessing of God into the world, to intercede on behalf of the world, you know, to help cleanse the world. Like, that's what we're being sent forth to do. It's not just, I got to make sure I get my ticket so that I can go to the good place when I die and not. Not the bad one. Right?"}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8005.52,"end":8010.4,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Or the other place where you just sit and watch the same VHS over and over again."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8014.72,"end":8349.57,"speaker":"Fr Andrew Stephen Damick","text":"I remember vhs. Yeah, yeah. All right, well, yeah, okay, so just some final thoughts then. There's so much more we could say. I think this might be the episode where we said the most times, but we can talk about that on a future episode. So there's so much more that we could say about all these offerings and feasts and sacrifices and so forth that we just discussed. But I think that for me, the big takeaway is the utter integration of worship and prayer into the human life. I remember one time I have somewhere in my collection of books a collection of texts from the Celtic Christian tradition. And part of that collection is occasional prayers. And, like, there's prayers for rowing your boat. There's prayers for washing your baby. Right? There's stuff like this, which it's funny, like, if you were to ask most people now, like, you know, do you need to pray while you row your boat? Be like, what you know? Or do I have to say a prayer while I'm washing my kid? It's hard enough to wash my kid who hates the bath anyway. Why do I need this stuff? Seems like non sequitur to us. And yet that stuff is even from the ancient world. It's just a little pre modern. There is this sense that God truly is everywhere present, filling all things. And also that the angels and the saints are present with us. And if that's really true, and if we believe what the scripture says, then we have to believe it's true. If we're Christians, we believe what the scripture says. So Christians believe this. If that's really true, then that means that our task is to, if I can use this term, to enchant the world. And I love the fact that enchant refers to singing. To enchant the world by constant prayer, by as often as I can, participating in the sacrifices of the church, by praying at home. I mean, I think probably every single person listening to this, even if you have a prayer rule, it probably needs some work. Including me. Including me. I am by no means excepted from that. And if we feel, as we so often do, that God is far away or that maybe none of this is really true or whatever. I mean, I'm just reminded of where the Lord says you have not, because you don't ask. You don't even ask. You know, of course you feel abandoned. You've abandoned your friends. God, who is your friend, the friend of mankind, the angels and the saints who are your friends, because they're the friends of God. We can bring them in. And ancient Israel has all of these things. I mean, it's enormously complicated. We only just scratch the surface of the complexity of all of this. I mean, like, read the book of Leviticus, people like that is a complicated book, but it has all these detailed instructions on how to do all these things. Ancient Israel has all these tools and so does the modern church, the church of right this moment. You know, it has these things. And it's not about heaping up lots of merit badges so you can, you know, become a heavenly Eagle Scout. Right? That's not, Although, you know, nothing against Eagle Scouts, that's not what it's about. It's about faithfulness and obedience to God in every single second and his giving of grace in all of that in order to show us forth truly as his imagers, as truly his, his sons. So that's, that's my main takeaway. I mean, there's a lot of things that I could say, but I, I love, I love this. And you know, it's funny to me, there are Christians who look at all this stuff and they say, well, that was the Old Testament, but in the New. Although I hope that no one says that now, having heard the things that we've said. But, but how can you say that, right? Like, look at what this does. Are we to believe now that God has taken all that away from us? Or maybe, maybe I'm being slightly sarcastic here, we should believe as the early church did and say that this has been fulfilled, transformed, filled to overflowing, given to us in all of its fullness. Now with the coming of Christ, who says, do this as my remembrance. So that's my takeaway, Father."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8351.25,"end":8378.64,"speaker":"Fr Stephen De Young","text":"Yeah, it may not be clear immediately how it's related, but Christ says that we're in the church, the salt of the earth. And if the salt loses its saltiness, you can't make it salty again if it goes stale. And he says that we're to be the light of the world. And he doesn't mean to leave a nightlight on inside the birdhouse in your soul."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8379.84,"end":8381,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I got that one."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8381,"end":8385.76,"speaker":"Fr Stephen De Young","text":"That's, that's directed, that's directed outward. Right."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8386.72,"end":8387.12,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8389.12,"end":8642.8,"speaker":"Fr Stephen De Young","text":"One of the big things we lose when our Christianity becomes materialist is we lose the priesthood and we lose sacrifice and we lose worship, because those aren't things anymore. Priesthood is maybe something Christ as the great high Priest is doing off in heaven, but sacrifice isn't really a thing we're doing. And what happens with materialist Christianity every time is it devolves into politics. If it's conservative materialist Christianity, it devolves into right wing politics. If it's liberal materialist Christianity, it devolves into liberal politics. But in both cases, you're using fundamentally material means to try to bring about or enforce some idea of justice or to create some kind of utopia on earth through purely physical means. Which means material means means force. It means force, either the form of direct force and violence or social force, the force of public shame and public will and public sentiment. Your enemies become the people who disagree with you. They're the enemy that has to be defeated and destroyed. And we're trying to do all this without God being involved, because we're doing it without priesthood and we're doing it without worship and we're doing it without sacrifice. And so the only thing we can possibly create is hell on earth. And so the answer to this is to realize once again who we are, people who are in the Church. And people who are outside the church, people who love Christ and people who hate Christ have the same enemy. It's not Christ. They have the same enemy. And it's the demonic powers who want to enslave and destroy us. And we are here as priests. We are the hope that has been placed in the world for those people outside the church. We are the ones who, as priests, are able to bring Christ to them and bring them to Christ. We're the ones who are called and empowered to connect with, reconnect them with God, to bring them into community of which Christ is a member so that they can come to know us and be communion with us and be in communion with Christ. That's what can transform the world. That's what can transform people. That's what can help us all defeat our common enemies. But if we give up, if we forsake, if we ignore, if we give up that role that God has given us and called us to, then just like Christ said about the salt and about the lamp that gets put under a bushel, there's no hope for the world. Those people aren't going to find that hope. The world is not going to be changed in any positive way. So the gifts that God has given us of knowledge, of understanding, of our own salvation, he's given to us as a deposit that he expects to bear fruit. He's planted something in us and he's going to want the harvest from that to be offered to him at some point in the future. And so I think when we come to understand Israel's worship and how it was directed outside of itself, it wasn't solipsistic. It wasn't just contained in Israel and just Israel concerned with their fellow Israelites. And we're going to find salvation. And to heck with those people outside. They're all evil and rotten sinners. That has to transform the way we view our own lives and our own worship and the purpose of all of this in the first place."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8646.48,"end":8672,"speaker":"Fr Andrew Stephen Damick","text":"Well, that is our show for tonight. Thank you very much everyone for listening. If you did not get a chance to call in during the live broadcast, we would love to hear from you, either via email@lordofspiritscientfaith.com or you can message us at our Lord of Spirits podcast Facebook page. We read everything, but can't respond. Everything. And we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8672.88,"end":8684.41,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Like our Facebook page and join our Facebook discussion group if you still do that sort of thing."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8684.97,"end":8697.13,"speaker":"Fr Andrew Stephen Damick","text":"Leave reviews and ratings, but most importantly, share this show with a friend whom you know is going to love it. And consider starting a Lord of Spirits discussion group at your parish. Hello everyone from St. Sava in Texas."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8697.93,"end":8705.61,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8706.09,"end":8708.59,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you always."}
{"episode_id":"LOS - #014 - 2021-02-25 - The Sacrifices of Righteousness","start":8716.99,"end":8754.28,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
