{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":0.56,"end":65.21,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, vision, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":65.45,"end":83.78,"speaker":"Fr Andrew Stephen Damick","text":"Hey, good evening. Giant killers, dragon slayers, asphyxiators of sphinxes. You're listening to the Lord of Spirits podcast and this is episode 118. I have spent hundreds of hours of my life talking to you on this podcast, Father Stephen DeYoung, when what do you have to say for yourself?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":84.02,"end":98.1,"speaker":"Fr Stephen De Young","text":"I think the benefits I've given to your life, even beyond, well beyond those granted to any listeners, anything they might have derived is incalculable. And you're welcome."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":98.26,"end":142.01,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so my co host, Father Steven DeYoung, the ENT who ran off the Entwives, is with me straight from the swamp in Lafayette, Louisiana. I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania, perched precariously atop the arcane tower of podcasting, hovering dozens, dozens of stor stories above a disused gateway to the underworld. Which is only slightly a joke, by the way. Everybody I've had people ask me, they're like, are you. Wait, what do you mean? Is that a joke? And beneath me, there once was a crematorium. This. This building was an actual funeral home where they incinerated human bodies down in the basement. So, I mean, that is pretty much a gateway to the underworld. And we are live, unlike those people. And if you are listening to us live, you can call us."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":142.25,"end":145.29,"speaker":"Fr Stephen De Young","text":"Some of them, some of them may be alone in the kingdom."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":145.29,"end":170.38,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, Experiencing the first resurrection. God willing, I hope, I hope you can call. Come on, man, let me get through the pattern at the beginning. You can call us at 855-237-2346, just like the voice of Steve just said. And Talk to us and we'll get to your calls beginning in the second half. And Mike, Raisin Brand again will be taking those calls."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":170.78,"end":173.9,"speaker":"Fr Stephen De Young","text":"Raisin Bran being the greatest of all wedding gifts."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":173.98,"end":176.42,"speaker":"Fr Andrew Stephen Damick","text":"Really? You're gonna have to break that up for me."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":176.42,"end":177.42,"speaker":"Fr Stephen De Young","text":"You don't know that story."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":178.14,"end":181.02,"speaker":"Fr Andrew Stephen Damick","text":"No, no. Tell us the story, Uncle Steve."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":181.26,"end":191.5,"speaker":"Fr Stephen De Young","text":"Okay, well, this is. This is. This is a. I'm just intrigued now. Oh, yeah, no. My last encounter with Father John Behr was just him ridiculing me about this."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":192.14,"end":192.62,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":192.7,"end":227.55,"speaker":"Fr Stephen De Young","text":"Like, in person. The last time I was with him in person, like, was just him attacking me over this. This grim reality that I'm about to reveal. So I'm getting married to my wife, right? So this is like 17 years ago now. And she felt as. As some brides to be feel that perhaps her groom to be. Is that participating fully or enough in the wedding planning process? In my defense, there were many areas in which my participation was not entirely welcomed."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":228.75,"end":230.27,"speaker":"Fr Andrew Stephen Damick","text":"I feel like I know that story."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":230.67,"end":231.23,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":232.35,"end":232.75,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":234.51,"end":246.99,"speaker":"Fr Stephen De Young","text":"So what task which was given to me was to help participate in the construction of our bridal registries. Like the. The store registries."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":247.07,"end":249.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, of course. Of course. His little scanning gun."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":250.32,"end":272.32,"speaker":"Fr Stephen De Young","text":"Yes. My. My then fiance said to me, you can select either to put together the registry for Crate and Barrel or Target. Now, I had never been to a Crate and Barrel. I mean, nor did we need any crates or barrels as far as Target Guy. Therefore, I said, target. I have been there before and it's."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":272.32,"end":274,"speaker":"Fr Andrew Stephen Damick","text":"Cheaper, so that should appeal to your."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":274,"end":293.26,"speaker":"Fr Stephen De Young","text":"Dutch the first time because they had very affordable prices. The one in San Bernardino, California, at least on Masters of the Universe. Figures. When I was a child. So I said, Target. So Target, helpfully, when you're putting together a bridal registry, they would. They would log into it and then they would hand you a scanning gun."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":293.58,"end":294.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":294.54,"end":388.49,"speaker":"Fr Stephen De Young","text":"So you could just walk through the store and by scanning things, put them on the registry. Right. So I thoughtfully went through the store, put some things on there I thought we might need. I tried to put a range of gifts right. For various price ranges. Right. So not be untoward. But you know, I have Dutch uncles, right. And so while doing this, and as I'm going through the Target, I thought to myself, self, I said, I enjoy myself a bowl of Raisin Bran in the morning. I eat it in a very weird way. But that's another story for another time. So I scanned a box of Raisin Bran, thereby putting a box of Raisin Bran on our wedding registry. At the time, my then fiance was still Living in California. And so she went to check to see if I had performed this task, which she had assigned to me, and discovered the Raisin Bran on the wedding registry. She found this absurd. She was working at the time as a nurse. She said to the doctor she was working with that day, my fiance, I send him to Target to put together a wedding registry, and he puts this box of Raisin Bran on there. The doctor looked at her and said, did he also put milk? She said, no. And the doctor said, well, that's ridiculous. Then. You can't eat Raisin Bran without milk. So she then just spent, I think, some time puzzling over the nature of the male members of the species. Human."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":388.81,"end":390.73,"speaker":"Fr Andrew Stephen Damick","text":"I mean, she didn't know you that well at that point."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":390.73,"end":437,"speaker":"Fr Stephen De Young","text":"And their thought patterns. Yeah, well, that's not true. I'm a complicated man, and no one understands me but my woman. But my woman does understand me. Yeah. So Father John Behr, around the time we were actually getting married, found out about this and seemed to take some kind of weird personal affront, huh? To the fact that I had put Raisin Bran on my wedding registry. Like, he was upset. Like, it was as if I had defiled something holy. And I'm like, I don't think, Father, that a Target wedding registry is sacrosanct. Right this way. That I should be berated for having sullied it with Raisin Bran, which is, after all, a fortifying and healthy food."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":439.16,"end":440.84,"speaker":"Fr Andrew Stephen Damick","text":"And good for you. In multiple ways."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":441,"end":454.6,"speaker":"Fr Stephen De Young","text":"In multiple ways. Yeah, Right. Frankly, raisin bread is the closest I come to eating fruit or vegetables. But, you see, you pour milk all over it. I'm Dutch. You gotta have the dairy."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":456.04,"end":456.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":456.4,"end":480.79,"speaker":"Fr Stephen De Young","text":"So he was very incensed about it. But the real denouement of this story is that on our wedding day, the time came at the reception in New Castle, Pennsylvania, of all places, to open our wedding gifts. And lo and behold, one of my uncles had bought me a box of Raisin Bran and then stuffed some cash inside it, because."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":480.87,"end":482.23,"speaker":"Fr Andrew Stephen Damick","text":"Happiest breakfast ever."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":482.63,"end":494.47,"speaker":"Fr Stephen De Young","text":"If no one else. My Uncle Jim has always understood my ways. So, yes, that is. That is the. I put Raisin Bran on my wedding registry. Wow."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":494.63,"end":497.27,"speaker":"Fr Andrew Stephen Damick","text":"And we didn't even have to do, like, a fundraiser to get that stuff."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":497.59,"end":502.07,"speaker":"Fr Stephen De Young","text":"No, you got that one's for free, kids. First one's free, then I hook you. I get you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":502.15,"end":517.76,"speaker":"Fr Andrew Stephen Damick","text":"I did have someone the other night, even though I haven't finished the intro here yet, but I did have someone the other night, live. Ask me in person. They're like, tell Us the whole thing about James Earl Jones and Father Steve. And I was like, look, I can't, that's. But I did tell them that you do have a justified grievance."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":517.84,"end":518.32,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":518.72,"end":519.76,"speaker":"Fr Andrew Stephen Damick","text":"Against that man."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":519.84,"end":526.48,"speaker":"Fr Stephen De Young","text":"And not only made worse by the fact that my years long plan to dance on his grave was completely foiled when he was cremated."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":527.12,"end":527.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":527.84,"end":541.4,"speaker":"Fr Stephen De Young","text":"He got the letter. Even in death, he tasks me. Okay, all right, tonight onto our actual topic for the night, which is back to orcas. I'm into salmon hats. I think we should just pivot to."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":541.4,"end":546.14,"speaker":"Fr Andrew Stephen Damick","text":"Brazen Bran and James Earl Jones. But maybe we should also talk about Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":546.14,"end":547.7,"speaker":"Fr Stephen De Young","text":"I was trying to introduce orcas with."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":547.7,"end":550.18,"speaker":"Fr Andrew Stephen Damick","text":"Salmon hats, but orcas with salmon hats."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":550.18,"end":554.34,"speaker":"Fr Stephen De Young","text":"That'S the real thing I learned today from you. It's on everyone's mind that we've thus."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":554.34,"end":568.94,"speaker":"Fr Andrew Stephen Damick","text":"Far ignored you kids there in the YouTube chats. Did you guys know that sometimes killer whales, more properly known as orcas, sometimes wear dead salmon hats? It's an actual thing. There's gonna be somebody in the past."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":568.94,"end":570.3,"speaker":"Fr Stephen De Young","text":"And they've started up again recently."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":570.91,"end":581.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a weird fashion. Just like mullets and mustaches are back. So are orca dead salmon hats. We are talking about Moses, specifically the authority of Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":581.91,"end":591.91,"speaker":"Fr Stephen De Young","text":"That was another beautiful segue right there, wasn't it? We are talking about Moses, who was not an orca, nor did he ever wear a salmon hat."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":591.91,"end":632.43,"speaker":"Fr Andrew Stephen Damick","text":"Just for you. Yeah. So how does the authority of Moses work exactly? Does he have authority over killer whales? What was the relationship of his authority to other leaders in Israel who governed the salmon and what happened to that authority when he died? So I thought I would start us off by asking this question. Why isn't the leadership authority of Israel like the way that they were organized? Why isn't that something that most American Christians have probably heard any sermons about or Sunday school lessons about? Why is this just kind of off the radar, even though it's. I mean, as we're going to see, it's very clearly spelled out in the Old Testament."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":632.83,"end":664.75,"speaker":"Fr Stephen De Young","text":"Yes. Well, I mean, this goes back to something we talked about in our episodes on the Torah where we talked about this artificial division that was made not only by Calvin, but famously by Calvin between these, you know, sort of. And it's an ad hoc distinction between these elements of the law, where there's civil law, ceremonial law, and moral law."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":665.31,"end":665.71,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":666.11,"end":750.06,"speaker":"Fr Stephen De Young","text":"And then civil and ceremonial are said to be sort of done away with now that Christ is here, or fulfilled, not abolished, but, you know, dust binned either way. And then the moral law, right. Well, that, that continues to be in effect right now. There's all kinds of problems with this that we talked about back then, right? One of the big ones is that it's an ad hoc distinction, right? In the sense that, like the Torah itself does not make such a distinction. And so you get a lot of arguments then about, well, is this moral, meaning it's still in effect, or is this ceremonial or civil right? Exhibit A of this completely non controversial example. One of the ways in which people who are more pro the acceptance of homosexual sexual activity within the church make is the way they try to get around sort of the clear condemnations of the Old Testament is they try to argue, well, this isn't talking about gay people, this is talking about cult prostitutes. So this is part of the ceremonial law, therefore don't worry about it anymore. Wow, this is very common. This is very common, very common argument, right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":750.06,"end":752.22,"speaker":"Fr Andrew Stephen Damick","text":"You better have long arms to make a reach like that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":752.3,"end":815.59,"speaker":"Fr Stephen De Young","text":"But that whole thing is facilitated by the idea that there is this division, right? Which is again completely ad hoc. And this is, this is a place where. So there was a fellow who was somewhat critical of our recent episodes critiquing dispensationalism. And especially when we said that on certain things there was a certain amount of cope going on among dispensationalists. Right? And his rejoinder was always, it's not cope. They have an answer. They make this distinction. Okay? Making these ad hoc distinctions is cope. It is definitionally cope. So when you show a Calvinist, right, See, this person was also very happy when we were picking on Calvinists. He just got upset when we were talking about dispensationalists. These, by the way, are some of my favorite comments on. On Lord of Spirits are the Father Stephen is normally right on until he criticized something I believe. And now he's totally off base and doesn't know what he's talking about."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":817.18,"end":817.9,"speaker":"Fr Andrew Stephen Damick","text":"Isn't that true?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":820.94,"end":825.66,"speaker":"Fr Stephen De Young","text":"When he criticizes everyone else, he's so sharp. Why is it he doesn't understand what I believe?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":827.18,"end":831.22,"speaker":"Fr Andrew Stephen Damick","text":"Well, the only reason why you would ever listen to a podcast or read."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":831.22,"end":833.98,"speaker":"Fr Stephen De Young","text":"A book is to have what you already believe confirmed."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":834.14,"end":834.82,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":834.82,"end":858.08,"speaker":"Fr Stephen De Young","text":"Is to figure out if they agree with what you already think. Yeah, but so when you show a Calvinist right, God wills that none should perish. And he says, well, that's not talking about, about his permissive will. That's not a decretive will. These are two different things. That's cope. Yeah, that's making a distinction that's not the text. To get around what the text clearly said."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":858.08,"end":861.96,"speaker":"Fr Andrew Stephen Damick","text":"I mean, with Calvinists, you can always tell because they use this phrase in such a way as."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":862.2,"end":899.71,"speaker":"Fr Stephen De Young","text":"Yeah, right. That's making these distinctions. Right. Yes. God creates everything and foreordains everything that happens, but in such a way that he's not the author of evil. That's cope. These distinctions are cope. Lots of people do them on lots of things. Okay. If they're not germane to. If they're not proper to the text you're referring to and what you're interpreting, if they're ad hoc, in other words, they are cope. And so the same thing is true dispensationalism. One of the examples for one of his comments was when we were talking about Joshua saying that all of the land promises had been fulfilled. Just crystal clear. Clear as day."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":900.69,"end":900.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":901.25,"end":906.93,"speaker":"Fr Stephen De Young","text":"It's like. Well, they distinguish between. They were fulfilled according to type, but not according to extent."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":907.97,"end":911.25,"speaker":"Fr Andrew Stephen Damick","text":"Wow. Wow."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":911.73,"end":925.49,"speaker":"Fr Stephen De Young","text":"This is an ad hoc distinction made nowhere in the text. But on top of that, I understand how typology works. Right. In fact, in that episode, we appealed to typology. The land was a type of the kingdom of heaven."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":926.03,"end":926.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":926.27,"end":934.43,"speaker":"Fr Stephen De Young","text":"Right. They want to have the land be a type of more land. Right. In the future."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":935.31,"end":936.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":936.67,"end":939.79,"speaker":"Fr Stephen De Young","text":"That doesn't make any sense. So that's. That's all."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":941.15,"end":941.71,"speaker":"Fr Andrew Stephen Damick","text":"That's all."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":942.35,"end":959.63,"speaker":"Fr Stephen De Young","text":"But so is this distinction between. Right. Because it's part of trying to argue your way around the fact that Christ says the law is not abolished. Right. But there's still parts of it that you want to say don't apply anymore."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":959.95,"end":981.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you can always tell when someone's pulling this or the much. I would say the much less learned, for lack of a better word way of doing is. Is when people say, oh, well, that was the Old Testament, you know, and they just sort of wave their hands at most. Wave their hands away at most of the Bible."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":981.91,"end":1010.35,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. Well, yeah, that's this cognitive dissonance of, is this not the Bible? Is this not scripture? Right. You can't both. Well, you can. That's why it's cognitive dissonance. Hold in your mind the idea that every word of it is still scripture, but on the other hand, chunks of it are completely irrelevant. Yeah, yeah, that's. That's a rough cognitive dissidents to hold to."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1010.59,"end":1011.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1011.03,"end":1022.83,"speaker":"Fr Stephen De Young","text":"Right. And so. But that. That, I think, honestly, is why no one addresses this. But that means essentially all the passages dealing with this become meaningless."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1023.63,"end":1026.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And therefore kind of unfamiliar to people."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1026.51,"end":1031.47,"speaker":"Fr Stephen De Young","text":"Yeah. They're just weird historical data. Oh, yeah. That's a thing that happened in ancient Israel, right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1031.47,"end":1033.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's how they did it then."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1033.55,"end":1045.78,"speaker":"Fr Stephen De Young","text":"Yeah. But it's got no ongoing relevance as scripture to how the church is formed, how the Christian life is formed, or anything remotely similar. That's a problem."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1047.7,"end":1050.02,"speaker":"Fr Andrew Stephen Damick","text":"Well, let's. Let's deproblematize it then."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1050.42,"end":1071.63,"speaker":"Fr Stephen De Young","text":"So we're. Yeah, so that's what. That's the problem we are here to address in this and the next episode. And part of this just to give a. Give us a rare shout out. Part of what we're gonna be dealing with tonight is inspired by a project I've been working on with my friend Doc Branson."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1072.19,"end":1073.55,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Oh."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1073.79,"end":1076.43,"speaker":"Fr Stephen De Young","text":"I will speak not more of this, but all right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1076.43,"end":1077.43,"speaker":"Fr Andrew Stephen Damick","text":"Just a big teaser."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1077.43,"end":1109,"speaker":"Fr Stephen De Young","text":"Just cryptic. Throw that out there. There are things afoot at the Circle K. So if we believe, as Christians ought, that scriptures, including the Christian Old Testament, are still relevant and are still scriptures. And some of the scriptures we're going to be talking about, the passages that we're going to be talking about in detail tonight, are read in the Orthodox Church, like at vespers, at feasts."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1109.72,"end":1111.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1111.96,"end":1184.08,"speaker":"Fr Stephen De Young","text":"So this is not just like Father Stephen has decided this is still relevant because he's anti Semitic and a Judaizer at the same time. This is. You know, the church proclaims its relevance quite regularly. But so if we operate that this is. This is still relevant. Okay. How. What kind of authority did Moses have and exercise in his life in Israel and what happened to it after Moses? Because you could also take the position, which is sort of the position that the people who divvy up the law that way, the Torah that way. Take that. Okay, Whatever. Right. That's how it worked for Moses. But Moses dead. So it's not super relevant. But as we will see this evening, it didn't just go away with Moses, but we were talking about Moses as we did in the episodes, talking about the history of Israel. I like to start by sort of reframing the life of Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1184.48,"end":1185.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1185.36,"end":1252.23,"speaker":"Fr Stephen De Young","text":"Because we need to get an idea of. Right. Moses as a person. Because a lot of the understanding of what authority he had and how he exercised it requires us to see him as a person who's living a life and doing things in the real world with other real people. Right. How he interacted with the Israelites. Right. What kind of authority? Because he's actually. This isn't just a theoretical authority in a systematic theology book. You know, in a footnote on Old Testament ordination or something. This is. Right. Something that actually took place. Right. And that has ongoing continued relevance. So Moses, our best sources say, lived 120 years and that means his life. And this is brought out in the Torah itself. His life can be neatly divided into three 40 year sort of chapters, almost like an episode of Lord of Spirits."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1254.55,"end":1258.71,"speaker":"Fr Andrew Stephen Damick","text":"I mean, each of these chapters does feel like it takes 40 years sometimes. I'll tell you what."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1259.91,"end":1286.14,"speaker":"Fr Stephen De Young","text":"And each one is preparatory to the one that comes next because as we've talked about in the show, the number 40, we're talking about 40 days, 40 years. 40 is this sort of preparatory number having to do with 42 being six sevens, which causes you then to expect the seventh seven. And so the first 40 years of Moses life is spent as a member of Pharaoh's court, minus maybe the first couple of months."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1286.54,"end":1289.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's growing up as an Egyptian born."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1292.38,"end":1308.55,"speaker":"Fr Stephen De Young","text":"But again, keep this in mind. At the time he leaves and goes to the desert of Midian, he's 40 already. So he is not just an adult, he's fully an adult, he's a mature adult."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1308.87,"end":1309.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1309.75,"end":1341.43,"speaker":"Fr Stephen De Young","text":"So there's a whole life he lives in Egypt and a whole education he receives there. And all of that, and all of that is then preparatory to the next chapter. The next chapter is he's in Midian, he meets his wife Zipporah, works for his father in law, Jethro, overseeing his herds and sheep there in the wilderness, has kids, he does that for another 40 years."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1342.39,"end":1349.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so he's 80 by the time most of the what we think of as the life of Moses happens."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1350.07,"end":1361.36,"speaker":"Fr Stephen De Young","text":"Yes. So 40 to 80, he has this whole life with, as part of an extended family, with his own family subunit within that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1361.92,"end":1362.32,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1362.8,"end":1365.12,"speaker":"Fr Stephen De Young","text":"Lives a whole second life."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1365.84,"end":1366.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1367.28,"end":1494.9,"speaker":"Fr Stephen De Young","text":"Also for 40 years, which means that's preparatory to the next thing. That's preparatory to him meeting God. So he spends 40 years learning all the ways of the world. Right. In the greatest, arguably the greatest superpower in the world at the time, depending on when you date, I'm going to argue about the date of the Exodus. Then spends another lifetime living as a nomad with other descendants of Abraham, living basically the way Abraham lived and Isaac and Jacob, a whole life. Then when he's 80, he meets God at Mount Sinai or at meets God on the mountain in the burning bush. And so all the things we think of, when we think of stuff Moses did, right. Like if you ask somebody, hey, list the stuff Moses did, right. They might mention growing up in Pharaoh's household briefly yeah, they're probably not going to talk about the 40 years of living as a nomadic shepherd or a nomadic herdsman. Right. And raising a family. They're going to skip to all the exciting stuff that happens in the last 40 years from 80 to 120. This third life he lives where, you know, everything happens. He confronts Pharaoh, calls down the plagues, culminating in the Passover, the crossing of the Red Sea, journeying to Mount Sinai, receiving the Torah at Mount Sinai, moving on from there. All of the issues with the Israelites. He deals everything that's this last 40 years, this last period. Right. And that's preparing him for the kingdom of heaven. That's why that's 40 years. But even. Even during that last 40 years. Right. All those things we think of all those things we list all the stuff we remember Charlton Heston doing or I guess is Prince of Egypt still a live thing for like Zoomers and Gen Alpha or is there some Moses mobile game or something?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1495.05,"end":1507.69,"speaker":"Fr Andrew Stephen Damick","text":"Something. I don't know. We. Someone did in the chat mention Prince of Egypt, hoping we were going to give a. Sorry. Prince of Egypt moment. I have to say, I kind of like the Prince of Egypt soundtrack. I thought it was. Had some moments."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1507.93,"end":1519.77,"speaker":"Fr Stephen De Young","text":"I don't remember the soundtrack really at all, other than other than them singing after singing the Song of the Sea. That's the only song I actually remember from it. But, you know, there was a sequel about jokes. There was."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1520.66,"end":1521.38,"speaker":"Fr Andrew Stephen Damick","text":"I didn't know that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1521.46,"end":1528.02,"speaker":"Fr Stephen De Young","text":"Joseph, like King of Dreams or Prince of Dreams, something like that. Oh, with Ben Affleck voicing Joseph."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1528.98,"end":1530.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1530.66,"end":1549.48,"speaker":"Fr Stephen De Young","text":"He's the only person to play Superman, Batman and Joseph from the Book of Genesis. Unless. Yeah, no, that's pretty. No, there's no chance. It's like there's half a chance Michael Keaton maybe was in a production of Joseph and the Technicolor Dreamcoat, but never played Superman."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1549.48,"end":1569.72,"speaker":"Fr Andrew Stephen Damick","text":"My favorite crossover of that kind is that Keanu Reeves played Hamlet up in Canada somewhere and, you know, would have walked in on Rosencrantz and Gilder and Stern and said, my excellent friends. So that was a cosmic typecasting, right? Exactly."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1570.12,"end":1570.6,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1570.84,"end":1583.26,"speaker":"Fr Andrew Stephen Damick","text":"And the question is whether that right. Will make it into the editing that Mike is going to do after this. Because now this is a big debate exactly how to edit Veloura Spirits podcast, but we'll never know. He might just edit out me saying this."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1584.3,"end":1587.26,"speaker":"Fr Stephen De Young","text":"He could. All my best jokes. Cutting room floor."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1587.66,"end":1588.22,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1588.38,"end":1642.03,"speaker":"Fr Stephen De Young","text":"I think people assume that I'll let them go out assuming it, but. So even in those last 40 years. If you take all those things from those movies or wherever else on the tweet talks or whatever the kids are into these days, they're watching about Moses. All those things we think about, those big things take place in. If you put them all together, I mean, they didn't all happen together, but take place in. Over the course of several weeks. There's not really 40 years worth of stuff there. So most of that 40 years that even that last 40 years, Moses was doing what? He was dealing with his wives and his children and his extended family and his herds. He was dealing with all the things of daily life in a big Bedouin camp in the middle of the desert."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1642.83,"end":1644.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just living life."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1645.15,"end":1646.91,"speaker":"Fr Stephen De Young","text":"Right. Collecting manna."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1647.31,"end":1651.43,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he's. And he's. He's the head of a tribe. He's the head of the tribe of Levi. Right, Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1651.43,"end":1683.41,"speaker":"Fr Stephen De Young","text":"So he's not just like. It's not like, oh, he's the king or whatever of Israel or he's the cult leader. Right. He's. He's part of a tribe. He's part of a clan within that tribe among the Levites. Right. And he's got all those duties and responsibilities. That's most of his life. And so when we talk about him exercising authority, the reason we bring this up is we're primarily not talking about those big things. We're not. When we say the authority given to Moses, we're not talking about, like, the ability to work signs and wonders. Okay. Because guess what? You don't have that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1684.29,"end":1684.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1685.65,"end":1693.21,"speaker":"Fr Stephen De Young","text":"There is no one listening to this who has that. Because if you had that, you wouldn't be listening to us. God would have other things he would have you doing. Not listening to this show."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1693.21,"end":1694.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You'd be out doing signs and wonders."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1695.25,"end":1707.25,"speaker":"Fr Stephen De Young","text":"You'd not be like, wow, Father Steven's Raisin Bran anecdote is hysterical. Right. You would be out prophesying. Okay. Or you would be deep in prayer somewhere. You would not have time for this chicanery."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1708.54,"end":1708.66,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1708.66,"end":1733.82,"speaker":"Fr Stephen De Young","text":"But that's not what we're talking about. We're talking about the authority he exercised day to day in his life. Interacting with the people of Israel, interacting with the members of his extended family, interacting with the members of his clan and of his tribe and of the Israelites in general, day to day. Moses is the guy with some kind of. And that's what we're going to work through here. Authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1735.07,"end":1735.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1735.47,"end":1755.79,"speaker":"Fr Stephen De Young","text":"And that means something in the sense that he was exercising it, he was using it, he was doing, wasn't Just a theoretical thing. It wasn't just like, oh, we've all got a picture of Moses in our tent, and we sing a song to Dear Leader every morning. Right. That's not it either."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1756.03,"end":1756.39,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1756.39,"end":1854.29,"speaker":"Fr Stephen De Young","text":"We know. Quite the opposite. They did not admire and look up to Moses among the Israelites. They kept threatening to kill him and go back to Egypt and stuff. Right. But it's about how he actually exercised authority. And the place where we tend to kind of think about this is in the context of, well, he. He was like a judge. Right. And we tend to think of that not in the sense of the judges in the Book of Judges, but in the sense of, like, he was hearing cases and sort of like court cases. Latin has done this to you people. Latin being buried deep in your. In your culture has caused you to think about everything as a dang court case, man. It's made us. Made lawyers of us all. That's not really most of what he was doing. Right. So I'm sure there was a little of that. Right. This guy stole my goat. No, I didn't. But most of what we mean in terms of him judging cases was more akin to him answering questions. More akin to him to making what we would call judgment calls. Yeah. Like, what is the right thing to do to this in this situation? How does this commandment apply to this situation? There's this weird situation that arises in real life that there isn't a commandment that literally, indirectly addresses. You could argue from this one commandment that you should do X. You could argue from this other one that you should do Y. What should I do? This is most of what Moses is doing. This is most of what Moses is doing."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1854.29,"end":1861.45,"speaker":"Fr Andrew Stephen Damick","text":"It's like being a parent, you know, especially once your kids get to a certain age. There's a whole lot of adjudication that goes on."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1862.09,"end":1870.49,"speaker":"Fr Stephen De Young","text":"Yes. So this is most of what he's doing. And if you're a parish priest, you do a lot of this as well, right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1871.37,"end":1871.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1872.73,"end":1881.25,"speaker":"Fr Stephen De Young","text":"If you want a perfect example of how this works in Scripture, good news, we've got one for you. And that is in Exodus, chapter 13."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":1882.21,"end":2012.67,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Okay, so starting with verse one, the Lord said to Moses, consecrate to me all the firstborn, whatever, is the first to open the womb among the people of Israel. Both of man and of beast is mine. Then Moses said to the people, remember this day in which you came out from Egypt out of the house of slavery. For by a strong hand, the Lord brought you out from this place. No leavened bread shall Be eaten. Today, in the month of Abib, you are going out. And when the Lord brings you into the land of the Canaanites, the Hittites, the Amorites, the Hivites and the Jebusites, which he swore to your fathers to give you a land flowing with milk and honey, you shall keep this service. In this month, seven days you shall eat unleavened bread. And on the seventh day, there shall be a feast of the Lord. Unleavened bread shall be eaten for seven days. No leavened bread shall be seen with you. And no leaven shall be seen with you in all your territory. You shall tell your son on that day it is because of what the Lord did for me when I came out of Egypt. And it shall be to you as a sign on your hand and as a memorial between your eyes that the law of the Lord may be in your mouth. For with a strong hand the Lord has brought you out of Egypt. You shall therefore keep this statute at its appointed time from year to year. When the Lord brings you into the land of the Canaanites as he swore to you and your fathers, and shall give it to you, you shall set apart to the Lord all that first opens the womb. All the firstborn of your animals that are males shall be the Lord's. Every firstborn of a donkey you shall redeem with a lamb. Or if you will not redeem it, you shall break its neck. Every firstborn of man among your sons you shall redeem. And when in time to come, your son asks you, what does this mean? You shall say to him, by a strong hand. For the Lord brought us out of Egypt from the house of slavery. For when Pharaoh stubbornly refused to let us go, the Lord killed all the firstborn in the land of Egypt. Both the firstborn of man and the firstborn of animals. Therefore, I sacrifice to the Lord all the males that first opened the womb. But all the firstborn of my sons I redeem. It shall be as a mark on your hand or frontlets between your eyes. For by a strong hand, the Lord brought us out of Egypt. Indeed. Indeed. So."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2014.94,"end":2040.54,"speaker":"Fr Stephen De Young","text":"Why read all that? And you may not have. You may have missed something at the very beginning. That's. That's very key here. So what did the Lord say to Moses? What the Lord said to Moses is verse two. It is one sentence. Consecrate to me all the firstborn, whatever is the first to open the womb among the people of Israel, both of man and of beast is mine. That's what God says to Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2041.02,"end":2042.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's the command."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2043.1,"end":2063.66,"speaker":"Fr Stephen De Young","text":"The rest of that, everything else Father Andrew read is what Moses said to Israel. Then. Now if we stop and think about this for a minute, as we may not be want to do with such a passage, we may just gloss over it. You may notice that what Moses said to Israel is not identical to what God said to him."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2064.06,"end":2071.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And he doesn't say, so this is what God said. And here, let me sell you some things that I think we should do."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2072.1,"end":2102.37,"speaker":"Fr Stephen De Young","text":"Here's my personal interpretation of that, for what it's worth. Yes, right. So they're not identical by a long shot. So what do we do with this? Right, because if you start to think at it, you start to push at this. I know there's some people from Protestant backgrounds who've been taught to read the Bible in a certain way, who, you know, some of you may not know why this is a big issue, but they're getting a little twitchy here."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2102.45,"end":2102.85,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2103.73,"end":2123.35,"speaker":"Fr Stephen De Young","text":"Because if God says something to Moses and then Moses says a whole lot more than that by that way of reading the Bible, it's a problem. So what's the solution? Now if. If you are a modern Old Testament scholar, God help you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2124.79,"end":2125.19,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2127.11,"end":2234.98,"speaker":"Fr Stephen De Young","text":"If you are a modern Old Testament scholar or a 19th century German in general, when you read this right, you say, aha. What God said to Moses is this one sentence. And then what Moses is presented as saying is this big long thing. Clearly this is the place where the editors who put this together from multiple sources let something slip. What did they let slip? Oh, well, they recorded verse two. Verse two doesn't say anything about not sacrificing the children. Dun, dun, dun. Right. Therefore from this we shall conclude that. That this is older. It has to be older because it's shorter process that everything shorter is older. And this means that the Israelites were sacrificing their children originally, and then later on when they edited this into the Torah, they wrote this big long thing that Moses said to try to cover that up by saying, oh no, no, no, no, not the babies. If you read this chapter and that thought occurs to you or you hear me say it and you think that sounds reasonable, either you've paid way too much for your education or you should seek help now. Because that doesn't make any sense. Right. The assumptions there are absurd. And what's amazing is a lot of these same scholars will say that the Phoenicians never sacrificed their infants. Yeah, right. Because that's just like Jewish and Christian propaganda. Yeah, I was gonna say beautiful. Not yeah. Beautiful Phoenician paganism."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2235.06,"end":2238.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Other ancient pagans record that they absolutely."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2238.06,"end":2245.62,"speaker":"Fr Stephen De Young","text":"Did that and then turn around and say, the Israelites did it and covered it up. Right. So this is just this bizarro level of suspicion."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2246.74,"end":2247.14,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2248.58,"end":2364.7,"speaker":"Fr Stephen De Young","text":"So there's that. If you are of a certain type of evangelical bent, then you might be tempted to say, oh, well, you know, verse two is just a summary. I mean, that's just basically a summary of all the stuff Moses said. They didn't want to say the whole thing twice in a row. Right. So really, what Moses says is exactly what God said to him. They just didn't want to be redundant and put the same thing twice in Exodus. Okay, that may sound feasible. There's a couple problems with it. Number one, clearly such a person has never read the book of Exodus. The last third of the book of Exodus is an exact repetition of the second third of the book of Exodus. Right. All the plans for the tabernacle and its furnishings are all laid out detail. And then it describes the making of them in the exact same detail. There are redundancies and stuff like that all through the Torah. Okay. They did not summarize something to prevent it from being redundant. There's not something that happens in the Torah. That's number one. Number two, when you do that, you just made up some, like, Bible head cannon. Because the Bible doesn't say that God said all those things to Moses. It says he said that one sentence to Moses, and then it says that Moses said all these things. So you're not really believing the Bible is true at that point. Right. You're hypothesizing some historical reality behind the Bible that you think is true. Which is exactly the problem with those liberals we were just talking about who are hypothesizing that there was child sacrifice in the background. Both of those are inventing something behind the text that fits your worldview better than the actual text does."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2365.5,"end":2365.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2366.78,"end":2413.18,"speaker":"Fr Stephen De Young","text":"If we look at the actual text, what do we see? We see God gives a commandment to Moses, and then Moses elaborates on that to the people. And if you look particularly at verse 13, which is where it says, every firstborn of a donkey, you shall redeem with a lamb, or if you will not redeem it, you shall break its neck. Every firstborn of man among your sons, you shall redeem. That's basically answering anticipated questions. What is this donkey thing about? Well, a donkey is an unclean animal. So if Moses comes to the people and says, here's what you're going to do you're going to sacrifice every firstborn male to God? Right. What are two questions that might immediately come up. Number one, what about unclean animals? Are we supposed to sacrifice those to God too? I thought we weren't supposed to sacrifice unclean animals like a donkey."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2413.98,"end":2414.34,"speaker":"Cody","text":"Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2414.34,"end":2499.41,"speaker":"Fr Stephen De Young","text":"So the answer is yes, you are not to sacrifice a donkey because it's an unclean animal. You either offer a lamb instead of the donkey as a sacrifice, or you just break the donkey's neck. Meaning you kill the donkey, but you don't sacrifice it. All right? And notice killing it and sacrificing it are not the same thing. And then the second question, very pertinent in the late Bronze Age is, do you mean we sacrifice our children? That seems like an absurd question to us. It was not an absurd question in the late Bronze Age. And Moses is answering that in advance. No, you do not sacrifice your actual children. Your actual children. You offer an animal instead. Right? And then later on in the Torah, it's going to designate exactly what animal based on your wealth, Right? You go and offer when you have a firstborn son. So what are we to do with this? Has not Moses added to what God said? Is Israel just required to obey that one sentence that God said to Moses, or are they obligated to to do what Moses told them to do? Is what Moses told them to do just a tradition of men?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2500.53,"end":2503.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go, Moses with your man made religion."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2503.17,"end":2505.01,"speaker":"Fr Stephen De Young","text":"That's just your interpretation, man."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2505.81,"end":2506.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2507.49,"end":2616.73,"speaker":"Fr Stephen De Young","text":"Maybe I interpret it differently. Maybe that's not what God meant. And as the Torah presents it here and everywhere else, the words of Moses, the words that Moses speaks to Israel, even if those are words like about the donkey or about the children that were not spoken, words that were not spoken to him by God are treated the exact same way, just as authoritative to the people hearing them. There is not a difference. There is no red letter Torah. Okay? Where. Where the words actually spoken directly by God are in red. Well, those we have to follow. And then the other stuff is Moses's opinions, not how it works, right? The words of Moses here, as he interprets and applies and directs and judges for the people, are the words of God by virtue of Moses having said them. This is the nature of the authority that Moses has. Because there's a necessity, not just of interpretation. What did God mean when he said, but of adjudication, meaning, not just, you know, speculating, here's my theory, here's my interpretation, but an actual ruling. This is what that means. Think back a second. Think back A second. And by back, I mean back from where we are in Exodus. Think about Genesis 3. What did the serpent say to Eve? Did God really say?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2617.69,"end":2618.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2620.5,"end":2707.3,"speaker":"Fr Stephen De Young","text":"Right. What should Adam have done? He should have made a ruling, sort of exercise the authority he had. The creation didn't do it. But so this is the authority that's given to Moses. And since Moses has that authority when he makes that adjudication, that adjudication is God's ruling. And as we're going to see, it's going to be explicit. Some of the other passages we look at, God says he's going to enforce it as if it was words that came directly out of the mouth of God, even though they came out of the mouth of Moses when he made the ruling. This is the type of authority we're talking about. This may be making certain people uncomfortable, I don't know. But that's what we're talking about. And that's what we see Moses doing. A lot of these adjudications or these rulings fall into the category of how to. Right. Like how do I, how do I keep this commandment? Right. What does that mean? Right. God's saying every firstborn male that opens the womb is holy to me. Okay, well, what does that mean I should do? Moses says, you go and you sacrifice it. If it's an unclean animal, you do this. If it's a human, you do this. Right. Like how do I keep this commandment? It's very practical."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2707.62,"end":2708.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2708.42,"end":2732.4,"speaker":"Fr Stephen De Young","text":"That's why I say this is Moses day to day life is exercising this kind of authority with the people. And part of the proof of this that Moses had this kind of authority is that as we mentioned, there's not a red letter Torah. Both the words of God and the words of Moses here that we just read are recorded in and as scripture."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2732.96,"end":2733.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":2733.4,"end":3019.47,"speaker":"Fr Stephen De Young","text":"This is all Torah on the same plane. Right. And the Torah. Right. Is referred to Christ himself in the gospels at different points will quote the Torah and say, God said to you this. He will also quote the Torah and say, Moses said this. And if you look up, as I know people rarely do, if you look up the places that Christ is quoting, it's not always God talking what he said God said, and it's not always Moses talking. What he said, says Moses said. Because the Torah is both God and Moses talking. There's not a distinction. That's part of the nature of the authority that Moses has as a prophet. And so this plays out. This is what plays out and then shapes the rest of the Hebrew Bible, the rest of the Christian Old Testament. So we've talked before about how, what we often call the historical books when we're talking about the genre divisions made in the Christian Old Testament. Actually the former prophets is the more original division, but also called by scholars the Deuteronomistic history. Why? Because the principles laid out in Deuteronomy by Moses, Deuteronomy is a sermon by Moses interpreting and applying the commandments already given in the Torah. That's why it's called the second Nomos, the second Torah and elaborating on them and in some cases reapplying things. So in Deuteronomy, they're about to enter the promised land. And so when Deuteronomy, in Deuteronomy, Moses says, here's how you just celebrate Passover. This causes a huge problem again for our modern Old Testament scholars, the poor benighted folks. Wait, it says in Leviticus you're supposed to celebrate Passover one way, and it says in Deuteronomy you're supposed to celebrate it in a different way. What do we do? Right. Leviticus is describing how you celebrate it when you're living in a camp in the desert. And Deuteronomy describes how you celebrate it when you're living in cities, because they were about to go live in cities. Same commandments regarding Passover, different application, just as authoritative in both cases from Moses, because there's a change in human situation. But that history is called the Deuteronomistic history because it is taking those, the perspective of those commandments and interpreting and applying those in terms of the history of Israel. It's interpreting the history of Israel according to those commandments, according to what God has said about Israel. And so, yes, there are varying views you can take of the history of Israel that's acknowledged within the text of Scripture. Right. If you've ever read first through fourth kingdoms, or first and second Samuel, specifically first and second Kings and or third and fourth kingdoms again and again. Says, as for all the other stuff this king did, this wicked king did, is it not written in the annals of the kings of Israel? Right. They had their propaganda mills pumping out their version of history. But once the Scripture is written, that is a ruling. That is a ruling. The prophet who wrote it. Right. That's the former prophets. The prophet who wrote it is making a ruling on the history of Israel. Right. An authoritative ruling. This is what happened and why. So it's not just an interpretation, it's a very concrete, applied thing. When you get to the latter Prophets, the people who we think of as the prophets. Isaiah, Jeremiah, ezekiel, Daniel, the 12. Right again. The prophets are taking the commandments, taking what God has said both before them in the Torah and what God says to them as prophets with the, with prophetic authority and applying it and ruling on what is going on in their time. Why is this happening? Why is that happening? Why is this army coming? Will this army defeat us? What do we need to do if we don't want this army to defeat us? And the prophets are making these rulings. And the wisdom literature of the Old Testament is essentially a whole bunch of case law. That's what the book of Proverbs actually is. It's a whole bunch of cases. Right. It's very easy. Back in the day when I did the Bible studies on the book of Proverbs, we started each one by having a game. You may have heard this if you've listened to the old Potato quality recordings."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3019.79,"end":3022.35,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I have not."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3023.71,"end":3075.26,"speaker":"Fr Stephen De Young","text":"We played a game at the beginning that was Shakespeare, Ben Franklin or Proverbs, where I would write a quote from Shakespeare, a quote from Ben Franklin and a quote from Proverbs in the King James Version. So it was similar English to Shakespeare to make it even more tricky on a whiteboard and have people try to guess which was which. And this is one of the reasons why people have trouble reading Proverbs because it tells you like super spiritually edifying stuff. Like he who makes noise early in the morning will offend his neighbors. Like, wow, thank you for the enlightenment. Right. Like this. I couldn't have figured that out on my own. Right. But how about this? What that is that statement, that is an adjudication, that is a ruling on what it means. Part of what it means to love your neighbor."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3076.78,"end":3077.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3077.9,"end":3087.9,"speaker":"Fr Stephen De Young","text":"You don't make a bunch of loud noise and wake them up early in the morning. You're considerate of them. Right. That's what part of what it means to treat others as. As you would want them to treat you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3087.9,"end":3088.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3088.18,"end":3141.23,"speaker":"Fr Stephen De Young","text":"Like this is an application. And that's what's really going on in Proverbs. Right. Proverbs is not just Poor Richard's Almanac, but more spiritual. It's actually conveying things from God's commandments and interpreting them and applying them in a very real way to very common, regular, real life situations. So the whole Hebrew Bible, the whole Old Testament, not just the Torah proper, is really an exercise of this kind of authority, which involves more words than God actually vocalized to the prophets who wrote it, then them exercising a kind of prophetic authority, the same kind as Moses. So how did it get from Moses to them?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3142.03,"end":3148.63,"speaker":"Fr Andrew Stephen Damick","text":"And on that cliffhanger. We're going to take our first break on this episode of the Lord of Spirits podcast."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3148.63,"end":3149.39,"speaker":"Fr Stephen De Young","text":"We'll be right back."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3149.8,"end":3165.96,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3170.84,"end":3228,"speaker":"Podcast Advertisement Voice","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality. But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world. In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by DeYoung's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology. By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancient faith.com Again, that is store.ancient faith.com we're back now with."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3228,"end":3243.05,"speaker":"Announcer","text":"The Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3244.17,"end":3269.43,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. Just want to remind you all that we have sold out all the rooms at the Antiochian Village for the Lord of Spirits conference, which is happening over the first weekend of October this year. But there are still a bunch of commuter tickets available and you can get a room somewhere else in the area. Ignore Father Steven's comments about camping out, whatever they may be. You can go to store camping out."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3269.43,"end":3276.55,"speaker":"Fr Stephen De Young","text":"I said sleep in your car. Go full goblin mode. Don't bathe. Get some wet wipes, maybe to wipe off the visible parts of your body."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3278.15,"end":3313.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Store.ancientfaith.com events you can get your tickets. And by the way, we are going to have a tournament playing the Royal Game of Ur, which we have mentioned before on this podcast. We get no kickbacks for this. We just thought it'd be fun. Everyone who wins at least one game in the tournament will get a prize and whoever wins all the way to the very end will get more prizes. I can't tell you what they will be but there will be prizes, so it should be fun. Do you have a copy of that game, Father?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3314.81,"end":3316.09,"speaker":"Fr Stephen De Young","text":"We have one in the parish."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3316.17,"end":3316.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, nice."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3316.97,"end":3321.61,"speaker":"Fr Stephen De Young","text":"It is a popular. There are impromptu tournaments held at coffee hours."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3321.85,"end":3335.05,"speaker":"Fr Andrew Stephen Damick","text":"Nice. I recently got a copy and my 8 year old loves it. He thinks it's the best thing ever. Actually, all my kids are into it. So, yeah, it is actually pretty fun game."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3335.05,"end":3338.73,"speaker":"Fr Stephen De Young","text":"In fact, it takes minutes to learn, but a lifetime to master."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3339.93,"end":3349.53,"speaker":"Fr Andrew Stephen Damick","text":"Nice, Nice. So, yeah, it'll be big fun. Only 32 people are going to get to play because that's going to be the bracket."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3350.73,"end":3356.01,"speaker":"Fr Stephen De Young","text":"I really think we should have chosen 144,000, but that may be beyond what we can have at the Village."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3356.41,"end":3366.27,"speaker":"Fr Andrew Stephen Damick","text":"If we sell 144,000 tickets to the Lord of Spirits conference, I think we could all retire. I'm pretty sure we would be doing very, very well."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3366.51,"end":3367.87,"speaker":"Fr Stephen De Young","text":"Just in it for the money, huh?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3367.87,"end":3368.79,"speaker":"Fr Andrew Stephen Damick","text":"Just. That's right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3368.79,"end":3371.31,"speaker":"Fr Stephen De Young","text":"Get that run."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3371.79,"end":3376.59,"speaker":"Fr Andrew Stephen Damick","text":"That's why I got into, you know, clerical life is for the. The big money, the flashy cars."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3376.59,"end":3378.51,"speaker":"Fr Stephen De Young","text":"Yes. Oh, yeah. Especially the Orthodox church."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3378.51,"end":3379.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3379.87,"end":3381.39,"speaker":"Fr Stephen De Young","text":"Yeah, that's the way to go."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3382.11,"end":3394.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So we actually do have a caller calling in and I don't. I'm not sure that this is particularly relevant to this particular episode, but it's. It sounds intriguing. So I don't know, let's just roll the dice."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3394.97,"end":3397.21,"speaker":"Fr Stephen De Young","text":"Maybe you could do it in your segues and make it relevant."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3400.81,"end":3408.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, my segues are about as relevant as Segways. So, yes, we have Cody calling from Atlanta. So, Cody, welcome to the Lord Spirits podcast."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3409.29,"end":3443.77,"speaker":"Cody","text":"Howdy, Pod Fathers. Thank you so much for what? Yalls. Yalls work. And I can make it relevant because it says in numbers 25, 6 that it happened in the sight of Moses. So it ties into Moses. Yeah. And so it's the episode where Phineas Spears, the Israelite man who brings the Midianite woman, and it almost hints that it's actually. Is it in the tent of meeting that they do. And I'm wondering if that's some type of Nephilim cult practice that he's doing."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3444.09,"end":3445.45,"speaker":"Fr Andrew Stephen Damick","text":"Well, thanks."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3446.41,"end":3447.37,"speaker":"Cody","text":"Because giants."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3447.93,"end":3449.37,"speaker":"Fr Stephen De Young","text":"No, but actually, yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3449.75,"end":3451.91,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. I want to hear this one."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3452.95,"end":3479.6,"speaker":"Fr Stephen De Young","text":"I actually, just. By the way, one of the 18,000 pieces of media out there for me is my Antiochian meds Bible study once a month. And I actually just covered that passage live at the, like two weeks ago at our parish life conference. Oh, it's on the YouTubes out there. But all I talk about is sex. I know for Pretty much that whole. I'm not joking for most of that Bible study."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3480.64,"end":3482.24,"speaker":"Fr Andrew Stephen Damick","text":"It's very uncomfortable for most people."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3482.24,"end":3497.12,"speaker":"Fr Stephen De Young","text":"And pornography. So take that as you will. There were certain passages when my sister was around and I was doing the Bible study in the Old Testament. There were certain passages in Ezekiel and stuff where my sister just did not attend that evening."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3498.24,"end":3500.32,"speaker":"Fr Andrew Stephen Damick","text":"I'm out. I can't listen to my brother talk about this."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3501.04,"end":3549.98,"speaker":"Fr Stephen De Young","text":"Right. I don't even want to hear him read it. But, yeah, so. So Phineas. And Phineas is rewarded for doing that. Like, by. His line becomes high priest. The high priestly line. So, yeah, what's going on there is these are not just, like foreign women. These aren't just big city women who came in and vamped them. Right. Like, this is. These are cultic prostitutes from the high place at BAAL Paor. And within the larger narrative frame, Balaam gets hired by Balak, who is the king of Moab, not to be confused with Balak, played by Clint Howard in the Corba Might maneuver."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3551.5,"end":3552.94,"speaker":"Fr Andrew Stephen Damick","text":"See, that's where I was going with this."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3553.18,"end":3556.06,"speaker":"Fr Stephen De Young","text":"Yeah, okay, I can see how you get those confused."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3558.3,"end":3559.74,"speaker":"Fr Andrew Stephen Damick","text":"That's such a weird episode."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3559.82,"end":3562.14,"speaker":"Fr Stephen De Young","text":"Tranya Tang, orange Juice."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3562.3,"end":3568.34,"speaker":"Fr Andrew Stephen Damick","text":"Such a bizarre episode. The little kid who talks with the voice of, like, a. Well, kind of a grown man. I don't. I don't know."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3568.34,"end":3570.94,"speaker":"Fr Stephen De Young","text":"It's Clint Howard. Yeah, that was his real voice."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3571.5,"end":3572.06,"speaker":"Fr Andrew Stephen Damick","text":"Is it really?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3572.06,"end":3719.5,"speaker":"Fr Stephen De Young","text":"Pretty sure that's how Clint Howard talked as a baby. So. But anyway, Balak, not that guy Balak, king of Moab had hired, hires Balaam, son of Beor, to come and curse Israel. We talked about this a little bit in our episode on prophets. Instead, he's forced to bless Israel. But what Balaam learns from that is, well, as long as Israel is sort of obedient to their God, their God will bless them. And there's nothing I could do to curse them. But he kind of. Once he figures that out, being kind of an evil fellow, he slides that wisdom over to Balak in sort of the worst possible way, which is if you can get them to offend against their God, their God will curse them. You won't need to hire me. And so Balak concocts this plot to get the men of Israel to go and visit the shrine of BAAL Paor, where they make sacrifices, they participate in sex with the temple prostitutes. And then what is represented in that story in numbers is sort of an escalation in that not only are they now leaving the Israelite camp and going to this high place, to participate in this sexual immorality, idolatrous worship, giant clan type of stuff. But this fellow who is named brings one of those women into the camp, and Moses and the people are there, like, repenting of this and horrified by this. You know, they're having the town meeting about this in front of the tenant meeting, and this guy parades past them with one of these women and goes in to have sexual relations with her in the camp. So now this defilement is being brought from the high place that is at least outside the camp, this pagan spot, this defiled spot, that defilement is being brought into the camp. And so Phineas, seized by zeal to protect that which is holy and sacred from defilement, goes in and runs both of them through with his spear while they are in flagrante delicto, as it were. So that's why I say no in the sense that this is not the nephilim ritual, but actually, yes in the sense that this is cultic prostitution activity that's being described, not just, oh, they're sleeping around with foreign ladies."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3720.46,"end":3723.42,"speaker":"Fr Andrew Stephen Damick","text":"Right. So does that answer your question, Cody?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3724.32,"end":3731.84,"speaker":"Cody","text":"Absolutely. Thank you so much for your time and for your clarifications, and hopefully I get to meet you both in October."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3732.08,"end":3734.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, come to the conference. It's going to be big."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3734.48,"end":3741.96,"speaker":"Cody","text":"I got to meet you, father, in the beginning of great Lent in Alabama. So I get to meet both of you in October."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3741.96,"end":3747.36,"speaker":"Fr Andrew Stephen Damick","text":"So excited about it in Huntsville. All right. Birmingham. Not Huntsville. Birmingham."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3748.16,"end":3749.36,"speaker":"Fr Stephen De Young","text":"I can't remember where I was."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3749.36,"end":3753.28,"speaker":"Fr Andrew Stephen Damick","text":"I was in Alabama. I know that. Anyway. All right, well, thanks for calling."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3753.63,"end":3756.75,"speaker":"Fr Stephen De Young","text":"So who knows? Even at the village in October, I may remain elusive."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3757.63,"end":3778.31,"speaker":"Fr Andrew Stephen Damick","text":"I know. Just like the sasquatch that you are. All right, so this is the second half of this episode of Lord of Spirits, and we're talking about the authority of Moses. What happens when, you know, the load gets a little heavy for Moses and he's got a. He needs a hand, you know, Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3778.31,"end":3778.83,"speaker":"Fr Stephen De Young","text":"It's too much."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3778.83,"end":3779.47,"speaker":"Fr Andrew Stephen Damick","text":"It's too much."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3780,"end":3807.21,"speaker":"Fr Stephen De Young","text":"Right. So in this half, the second half, as opposed to the third half, what we're going to be talking about is two different ways in which that authority or elements of that authority go from Moses to someone else. Right. Because as we mentioned way back at the beginning, you could search the dark recesses of your mind. No, push aside the Raisin Bran story."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3808.41,"end":3809.89,"speaker":"Fr Andrew Stephen Damick","text":"I'm still on the Raisin Bran story."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3809.89,"end":3815.77,"speaker":"Fr Stephen De Young","text":"An hour ago or so, we said that this authority didn't just stop with Moses."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3815.77,"end":3816.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3816.05,"end":3847.53,"speaker":"Fr Stephen De Young","text":"So this authority is also going to Go to other people. And that's going to happen in two different ways. The first one of those ways is what Father Andrew was alluding to. And so we're going to read this somewhat famous encounter between Moses and Jethro. I consider it somewhat famous, but part of that is because we read it a lot in the Orthodox Church. This particular passage at vespers services, I won't say related to who, because that might give away stuff from our next episode."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3850.17,"end":3970.62,"speaker":"Fr Andrew Stephen Damick","text":"No spoilers. No spoilers on stuff that's how many years old. No, we're not going to play that game. Okay? Exodus 18, starting with verse 13. The next day, Moses sat to judge the people. And the people stood around Moses from morning till evening. When Moses, father in law, saw all that he was doing for the people, he said, what is this that you are doing for the people? Why do you sit alone and all the people stand around you? From morning till evening, Moses said to his father in law, because the people come to me to inquire of God. When they have a dispute, they come to me, and I decide between one person and another, and I make them know the statutes of God and his laws. Moses, father in law, said to him, what you are doing is not good. You and the people with you will certainly wear yourselves out, for the thing is too heavy for you. You are not able to do it alone. Now obey my voice. I will give you advice, and God be with you. You shall represent the people before God and bring their cases to God. And you shall warn them about the statutes and the laws, and make them know the way in which they must walk and what they must do. Moreover, look for able men from all the people, men who fear God, who are trustworthy and hate a bribe, and place such men over the people as chiefs of thousands, of hundreds, of 50s and of tens, and let them judge the people at all times. Every great matter they shall bring to you, but any small matter they shall decide themselves, so it will be easier for you, and they will bear the burden with you. If you do this, God will direct you. You will be able to endure, and all this people also will go to their place in peace. So Moses listened to the voice of his father in law and did all that he had said. Moses chose able men out of all Israel and made them heads over the people. Chiefs of thousands of hundreds, of 50s and of tens, and they judged the people at all times. Any hard case they brought to Moses, but any small matter they decided themselves. Then Moses let his father in law depart, and he went Away to his own country."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3971.82,"end":3983.5,"speaker":"Fr Stephen De Young","text":"Right. So a couple things to notice here. What is the way in which this is described? So, again, I think people, even when they hear this passage, what they have in their brain is, like, court cases, right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3983.82,"end":3984.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3984.26,"end":3989.5,"speaker":"Fr Stephen De Young","text":"Like, Moses is Judge Wapner slash Judy Joe Brown slash."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3989.74,"end":3997.02,"speaker":"Fr Andrew Stephen Damick","text":"Wow. A lot of nostalgia just coming full throttle there, Right. Judge Wagner."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":3997.58,"end":4000.78,"speaker":"Fr Stephen De Young","text":"I stayed home from school as a kid and watched tv. I know the score."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4001.1,"end":4001.98,"speaker":"Fr Andrew Stephen Damick","text":"Still, kind of your deal."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4002.06,"end":4032.47,"speaker":"Fr Stephen De Young","text":"The bailiff. So the guy who had the real charity job was Doug Llewellyn. Like, he just introduced the thing. Like Douglas out there with his, like, very 70s hair, just like, hey, it's People's Court. Here's Judge Wapner. And Rusty. Like, he didn't actually do much of anything, but was considered the host of the show. Probably paid handsomely. Anyway, nice work if you can get it. So that's not what Moses is doing. Notice the people are all sort of just gathered around him."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4033.51,"end":4034.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4034.39,"end":4059.6,"speaker":"Fr Stephen De Young","text":"Because what he's mainly doing is answering questions. Right. He's answering questions in terms of these rulings. Right. And this is why Jethro says, right. You need to tell them how they should walk. Halakah in Hebrew. That's where this term comes from. May notice in the New Testament, St. Paul talks about the walking and the way you walk an awful lot. He uses those terms. That's because those are the Jewish terms, and they come from here. How you live."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4060,"end":4060.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4060.56,"end":4101.86,"speaker":"Fr Stephen De Young","text":"You tell the people how to live. He's not just deciding, you know, like, small claims cases. Right. And this all has to do with the laws, the commandments of God. Right. How they're applied, how they work. So that's what he's. That's what he's doing. And Jethro says, like, look, man, you can't do this all day, every day. You've got all these other things you're doing. Your husband, you're a father. Yeah, yeah. Right. You need to go and spend time with God in the tent of meeting, on and on and on. Right. You need to appoint people to help you with this. These people, these zakin, these elders who get appointed here, by the way, are in the Greek translation referred to as presbyters."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4102.58,"end":4103.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4103.3,"end":4105.3,"speaker":"Fr Stephen De Young","text":"Moses appoints a buzzer. Presbyters."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4106.1,"end":4106.5,"speaker":"Cody","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4106.82,"end":4132.99,"speaker":"Fr Stephen De Young","text":"These presbyters do not divvy up Moses's authority. You notice. Right. It's not. Just give the authority to them and let them take care of this so you can handle these other things. Right. They still have to bring all the difficult. Any significant issue still has to go to Moses, because Moses is still the one who has the authority to rule on those things. But among the questions that Moses is getting asked about the applications."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4134.11,"end":4134.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4134.51,"end":4144.43,"speaker":"Fr Stephen De Young","text":"Of these, of the commandments, there's a lot of easy ones. Right. There's a lot of ones he's probably getting asked by different people every other day, like the same question."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4144.83,"end":4148.17,"speaker":"Fr Andrew Stephen Damick","text":"I can't just direct them to the Frequently Asked questions document."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4148.17,"end":4169.25,"speaker":"Fr Stephen De Young","text":"Yes. He doesn't have a fact. And then there are difficult ones. And the difficult ones, Moses is the one who has the authority to deal with them. And he still. And he needs to be the one to deal with them. But those things where he's already ruled, those things that are kind of obvious, but sometimes people are a little obtuse, or maybe they're not obtuse, they're just trying to wiggle around something. Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4169.89,"end":4170.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4170.37,"end":4172.21,"speaker":"Fr Stephen De Young","text":"Does it have to be Moses who tells them no?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4172.54,"end":4172.78,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4172.78,"end":4200.09,"speaker":"Fr Stephen De Young","text":"It doesn't have to be Moses who. Right. Reiterates it all the time. And that's why these people are appointed. So some of the work is delegated. Right. And they're, they're. The authority of the presbyters is derived from the authority of Moses in the sense that they're there representing Moses. But it's still Moses's authority. His authority is not taken away from him or divvied up or split with them. Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4200.09,"end":4200.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4201.49,"end":4202.05,"speaker":"Fr Stephen De Young","text":"This is."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4202.05,"end":4202.37,"speaker":"Fr Andrew Stephen Damick","text":"They."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4202.53,"end":4226.69,"speaker":"Fr Stephen De Young","text":"They represent Moses. And anytime they're not sure how to represent Moses. Right. What would Moses say in response to this question? They have to take that back to Moses. That's the proof of it. Right. That it's really Moses. They don't have the authority to sort of rule unilaterally without the consent of Moses who has the authority. So the presbyters here."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4227.51,"end":4227.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4227.83,"end":4255.75,"speaker":"Fr Stephen De Young","text":"Are the elders, are essentially administrative officials. Right. Moses makes rulings on these cases. And then the presbyters who are out there, who are members of the clans and tribes who are out there living their own lives in these different parts of the larger Israelite community, they then teach and administer those rulings that Moses has made in the day to day life of those people."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4255.91,"end":4264.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They know the policies that he set and they go and carry it out. You know, they know the rules, they know what Moses expects."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4265.03,"end":4304.46,"speaker":"Fr Stephen De Young","text":"Right. But it's still Moses who has the authority to make decisions. It's not like, oh, now this group's gonna get together and vote. It's still Moses who is in charge. Okay. Now, so that's one type of. This is Moses exercising his Authority through presbyters who he's appointed to represent him. Right. But this involves another person in a way exercising that authority. But now there's sort. Now we get to the issue of, okay, well, Moses lived 120 years. That's a long time."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4305.1,"end":4305.46,"speaker":"Cody","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4305.46,"end":4340.81,"speaker":"Fr Stephen De Young","text":"As we were talking about, as we said. But he dies eventually. And as that was approaching, he knew he was going to die. And this is where the Torah makes it clear that while that kind of authority granted to Moses may have begun with Moses, it's not going to end with Moses. It's not. Okay. Now Moses has sort of rendered us this complete revelation of God in the Torah such that we will no longer need anyone. Like all the cases are covered. No one will ever need to ask a question again."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4341.05,"end":4342.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The Torah is self applying."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4343.05,"end":4347.05,"speaker":"Fr Stephen De Young","text":"Everything is totally clear. Right. Completely perspicuous."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4348.01,"end":4353.37,"speaker":"Fr Andrew Stephen Damick","text":"Perspicuous. Perspicacious. I think it's perspicacious."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4354.33,"end":4356.49,"speaker":"Fr Stephen De Young","text":"Let's fight. No perspective."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4357.29,"end":4358.17,"speaker":"Fr Andrew Stephen Damick","text":"Round one."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4361.01,"end":4374.01,"speaker":"Fr Stephen De Young","text":"Yeah, so, so, so that's not at all in view. Right. And the rest of scripture existing testifies to that. Not just the fact that there's a New Testament, but there's a rest of the Hebrew Bible. Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4374.01,"end":4374.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4374.69,"end":4375.73,"speaker":"Fr Stephen De Young","text":"So you're right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4375.73,"end":4384.05,"speaker":"Fr Andrew Stephen Damick","text":"By the way I looked it up. Perspicuous is, is the thing itself. Perspicacious is, is, you know, the person exercising that clarity."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4384.69,"end":4399.66,"speaker":"Fr Stephen De Young","text":"Finish him. Yes. You have to now stand there dazed while I wiggle, you rip out my spine or whatever. Yeah, yeah. No, and then nothing happens. You just stand there and I fail to do it correctly and then you fall over. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4401.9,"end":4402.3,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4403.66,"end":4439.98,"speaker":"Fr Stephen De Young","text":"So that's not the case, clearly. Right. And so that means someone else is going to continue to exercise that same authority in the same manner that Moses did among the Israelites. And so there is a successor. But it's not just a successor in the sense that just like I was the boss, I'm in charge now I'm retiring. Meet the new boss. Right. But this is an actual passing on of that authority. So the authority that Moses held."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4440.62,"end":4440.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4440.98,"end":4449.58,"speaker":"Fr Stephen De Young","text":"Is now also held by Joshua son of nun. Yes, I said Joshua son of nun, not Jesus son of Navi."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4450.3,"end":4458.3,"speaker":"Fr Andrew Stephen Damick","text":"How does. Yeah, since you mentioned that, I've seen Avatar. Where does that. Yes. Where does that come from? Where does that Jesus of Navi thing."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4458.78,"end":4466.62,"speaker":"Fr Stephen De Young","text":"That people shrine, Greek basically signal we're Orthodox. So we use the Greek Old Testament. See, look, I made the names unrecognizable."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4467.23,"end":4469.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How did the Greek Old Testament."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4469.23,"end":4472.91,"speaker":"Fr Stephen De Young","text":"It's silly, people. Yeah, it's silly. Especially if you're not even Greek."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4473.55,"end":4480.83,"speaker":"Fr Andrew Stephen Damick","text":"My favorite, though, is instead of using James, suddenly, I mean, it's all these wonderfully English names, and then suddenly it's Jacobos is one of the apostles."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4480.91,"end":4482.51,"speaker":"Fr Stephen De Young","text":"Peter, Jacobos and John."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4483.23,"end":4487.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, if you're going to Jacobus, you need to be saying Petros and Ioannis."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4487.75,"end":4488.07,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4488.07,"end":4488.39,"speaker":"Fr Andrew Stephen Damick","text":"As well."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4488.39,"end":4488.67,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4488.67,"end":4489.95,"speaker":"Fr Andrew Stephen Damick","text":"Like it doesn't make any sense."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4491.07,"end":4501.33,"speaker":"Fr Stephen De Young","text":"But. Yes, this is. These. Are these translations we get where everybody's got an English name. Like it's a feast of saints, Peter and Paul and everything. And then you get, you know, Elias and Alyssus."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4502.37,"end":4502.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4503.57,"end":4510.93,"speaker":"Fr Stephen De Young","text":"And Jesus, son of Navi, you know, and it's just like, you just use the English names."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4512.05,"end":4515.41,"speaker":"Fr Andrew Stephen Damick","text":"Okay. It's gonna be okay, everybody. All right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4515.81,"end":4517.01,"speaker":"Fr Stephen De Young","text":"So, yeah, speaking English."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4517.01,"end":4519.25,"speaker":"Fr Andrew Stephen Damick","text":"Joshua, the son of nun."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4519.65,"end":4520.77,"speaker":"Fr Stephen De Young","text":"Yes. None."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4521.97,"end":4523.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Numbers. So numbers."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4523.98,"end":4527.54,"speaker":"Fr Stephen De Young","text":"Insert corny joke of who's the only person in the Bible with no parents?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4528.5,"end":4529.3,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4530.02,"end":4531.14,"speaker":"Fr Stephen De Young","text":"Bible humor, people."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4531.78,"end":4586.91,"speaker":"Fr Andrew Stephen Damick","text":"Melchizedek, obviously. Numbers 27, starting verse 18. So the Lord said to Moses, take Joshua the son of nun, a man in whom is the spirit, and lay your hand on him. Make him stand before Eleazar the priest and all the congregation, and you shall commission him in their sight. You shall invest him from your authority that all the congregation of the people of Israel may obey. And he shall stand before Eleazar the priest, who shall inquire for him. By the judgment of the Urim before the Lord, at his word, they shall go out, and at his word, they shall come in, both he and all the people of Israel with him, the whole congregation. And Moses did as the Lord commanded him. He took Joshua and made him stand before Eleazar the priest and the whole congregation. And he laid his hands on him and commissioned him as the Lord directed through Moses. What's. What's the deal with the Urim being mentioned there? Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4587.39,"end":4595.87,"speaker":"Fr Stephen De Young","text":"Well, so as we've talked about before, the Urim and the Thummim late of Jackson, Missouri. No, that was a joke."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4596.51,"end":4597.31,"speaker":"Fr Andrew Stephen Damick","text":"It's okay."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4597.39,"end":4611.03,"speaker":"Fr Stephen De Young","text":"The Urim and the. And the. The. Oh, I just want to be clear before someone accuses me of being a crypto Mormon. I've been accused of weirder things recently online. Man, I wish I was getting a CIA paycheck for this."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4613.27,"end":4615.91,"speaker":"Fr Andrew Stephen Damick","text":"I think you have been accused of that. Where was it that I saw?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4615.91,"end":4617.63,"speaker":"Fr Stephen De Young","text":"Yes, I have been accused of that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4617.63,"end":4617.91,"speaker":"Fr Andrew Stephen Damick","text":"Reason."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4618.31,"end":4620.63,"speaker":"Fr Stephen De Young","text":"Yeah, I would love to get that money."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4620.79,"end":4626.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That your CIA. And also. And my favorite, George Soros, Also a Zionist."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4626.63,"end":4644.32,"speaker":"Fr Stephen De Young","text":"Yes, George Soros, living Koch brother. Any of You, I don't care any political stripe. You want to send me money, please put me on the dole. I will sell out right now. I don't care about politics that much. I'll have whatever political opinion you want."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4645.28,"end":4647.44,"speaker":"Fr Andrew Stephen Damick","text":"I will sell out right now. Father Steven."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4649.2,"end":4658.45,"speaker":"Fr Stephen De Young","text":"So that's why it just galls me to be accused of taking money from these people when I broke. So just because you're taking money from."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4658.45,"end":4660.41,"speaker":"Fr Andrew Stephen Damick","text":"Them doesn't mean you know how to spend it correctly."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4660.41,"end":4662.65,"speaker":"Fr Stephen De Young","text":"Well, that could be. I'm Dutch, though. I'm Dutch."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4663.13,"end":4666.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh, that's true. Remember, you wouldn't be spending it at all. Hardly."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4669.45,"end":4669.77,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4669.77,"end":4752.69,"speaker":"Fr Stephen De Young","text":"So the herb and the thummim, as we mentioned, were for sort of the super difficult cases where nobody could figure out what to do. You need a ruling. You can go to the priest, he can cast the urm and the thumbim and through some process that we don't entirely understand, that would give you your answer. Right. And some people may have, again, because we think about things in a very individualistic way in the modern world, may have thought, well, like Joe Bob, Israelite, right. Could just, you know, be like, man, I don't know what to do, and just go wandering over to the high priest and be like, hey, man, can you roll them bones? Tell me what I ought to do. Right. That's not how it worked. Yeah, right. So the idea here is that Joshua is going to be the one who's dealing with those very difficult cases. So if a case is so difficult that he can't make come to a ruling on it, he's the one who's going to go to the high priest to do that. Yeah, that's what that's about, that Joshua is now going to have that sort of final authority. And so, and God says, right, this language of at his going out and coming in, remember, has to do with going to war. And we may kind of underestimate what's going on here. This is not just God saying like, oh, he's the military leader now, he's the commander in chief."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4753.65,"end":4753.97,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4753.97,"end":4760.85,"speaker":"Fr Stephen De Young","text":"Because remember this whole business about going out and coming in, God is the one who led them to go out and come in."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4761.49,"end":4762.77,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4762.77,"end":4795.73,"speaker":"Fr Stephen De Young","text":"The whole issue with the human king is in. Is in First Samuel or first kingdoms. So this is effectively saying when Joshua makes a ruling on that, Right. That that is going to be God's ruling on that. Whether God is with them in battle or not or not will depend on whether they're obeying Joshua's order. So that is a very direct application, again, of this kind of authority. He is the one who has the authority to rule on it and his rulings on these things."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4796.37,"end":4796.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4796.69,"end":4804.21,"speaker":"Fr Stephen De Young","text":"If he rules something as a sin. Right. That it's just like if God himself spoke from a cloud and told them it was a sin."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4805.49,"end":4805.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4805.85,"end":4841.26,"speaker":"Fr Stephen De Young","text":"God will hold them accountable in the exact same way. That's why it says that all of Israel is to obey Joshua, what Joshua says. So Joshua is the one who's given. Given this authority, but it's not just Joshua. So that happens in near the end of the Book of Numbers, as Moses is drawing near to the end of his life, but even closer to the end of his life. In Deuteronomy, Moses talks about how this is going to be an ongoing thing in the life of Israel. They come and they settle in the land."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4842.06,"end":4891.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So in Deuteronomy 18, starting with verse 15, the Lord your God will raise up for you a prophet like me from among you, from your brothers. It is to him you shall listen, just as you desired of the Lord your God. At Horeb on the day of the assembly, when you said, let me not hear again the voice of the Lord my God, or see this great fire anymore, lest I die. And the Lord said to me, they are right in what they have spoken. I will raise up for them a prophet like you from among their brothers, and I will put my words in his mouth, and he shall speak to them all that I command him. And whoever will not listen to my words that he shall speak in my name, I myself will require it of him. It's interesting. He says, I will put my words in his mouth. Which, as we've seen, doesn't mean he's just going to repeat stuff I said before."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4892.66,"end":4898.98,"speaker":"Fr Stephen De Young","text":"Yes. That the words that come out of his mouth are God's words."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4899.92,"end":4900.4,"speaker":"Fr Andrew Stephen Damick","text":"Mm."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4901.28,"end":4931.61,"speaker":"Fr Stephen De Young","text":"Right. Because he is a prophet. Right. And you see this again and again. If you read the prophets closely, they will have a vision and then they will go and issue an address. And their address pronounced like woe upon Egypt and woe upon. Right. Is them speaking the vision. Well, how does that possibly work? Right. That's not just going from one sentence to two big paragraphs. That's going from seeing something to saying something."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4932.73,"end":4933.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4934.97,"end":4943.69,"speaker":"Fr Stephen De Young","text":"There are two different modes. Right. And so this isn't just the profits are, you know, voice recorders."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4944.09,"end":4944.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":4945.93,"end":5036.97,"speaker":"Fr Stephen De Young","text":"Because let's. Let's stop and think for a minute. Why would they be necessary in that case? Meaning. Sure, sure, sure. As God says here in Deuteronomy right, they're at the mountain. There's thunder, there's lightning. They're all scared to go near it. God says it's good. You were scared to go near it because you're a bunch of sinners. You would have gotten smote. It's death by holiness. Right. So you sent Moses, that was good. Right. But if it was just a question, right, of taking dictation and repeating it. We know God can write on tablets with his finger. He could toss them down the mountain. He could have an angel bring it down the mountain. Yeah, he could have an angel just bring his messages if he needs an intermediary. Why have a human prophet? Right. Because a human prophet is going to live among the people, work among them, share their life and be able to do precisely this, to take what God has revealed to him and apply it and make these rulings. That's why there is a human given this authority. The other view of prophets just doesn't make any sense. Why not use angels? Yeah. I mean, most of the prophets did not live super happy, luxurious lives. Right. Like most of the saints have it, but."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5037.21,"end":5037.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5038.09,"end":5228.88,"speaker":"Fr Stephen De Young","text":"But you know, if we, if we could have not put them through all that and just if it was just the message that was important, it was just the written text that was important, God could have delivered that plenty of other ways more efficiently. Right. There's that whole efficiency thing again. But the other thing we see there is this promise that there's going to be a prophet like Moses who's going to come in the future. Right. And so without entering into the debate, because I think people know where we stand on if this is referring to Muhammad or Joseph Smith, that would be a negatory. Or Ellen G. White for that matter. What, you know, let's, we'll just go. Right? None of them, Right. There is of course the argument like, well, is this talking about Jesus or is this talking about the succession of prophets in the history of Israel? The answer to that question is porque no los dos? The answer to that question is yes. Right. It does mean Jesus or the succession of prophets. Because of course that pattern established by the succession of prophets beginning with Moses is a pattern that is fulfilled, that is filled full by the person of Jesus Christ. But this means, this is also referring to the succession of prophets who are going to come in the life of the people of Israel, the people of Judah, right on down the line. And when we say a prophet like Moses, Right, like him, how? Let's just pause and ask that question. Right? Prophet like Moses How? Well, there are a couple of things that are used to differentiate Moses from other folks right within the Torah itself. One of those is seeing God. Moses spoke to God face to face. He saw him. And lo and behold, what do we see when we read the prophets? Say Isaiah. How does Isaiah's ministry begin? He sees God vision. Yeah, yeah. He sees God high and lifted up at the temple. How does Ezekiel's ministry begin? He sees God on his chariot throne. So that's one important piece. And we'll get into this a little more in the third half. And the other piece then is that like Moses, they have the authority to communicate God's words and apply them and make these rulings in the life of the people. And so we see up through Samuel, there's sort of a prophet for Israel, Samuel kind of being the last one. I say kind of because if you read Samuel closely, he lives in a whole town of prophets. So there's other prophets around in Israel."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5229.28,"end":5230.8,"speaker":"Fr Andrew Stephen Damick","text":"That's got to be a weird place, though."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5231.6,"end":5277.1,"speaker":"Fr Stephen De Young","text":"It is a weird place. It's a wild place. If you read first and second Samuel, I know Saul comes in there and starts thrashing around naked on the ground. So we talked about that a little in the prophecy episode. But yeah, yeah, there's still this singularity kind of to Samuel, and he's the last judge of Israel, meaning he's making these rulings for the whole nations are independently. So why does it go from that to there being a whole bunch? Because once you get into it later, like third, fourth kingdoms versus two kings, there will be prophets in the northern kingdom and different prophets in the southern kingdom. Goddess prophets all the way. This is a very simple answer. Israel got big."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5278.39,"end":5280.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, just. You need some more."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5281.51,"end":5285.11,"speaker":"Fr Stephen De Young","text":"They went from being a Bedouin camp in the desert to being two countries."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5285.51,"end":5290.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's the same reason that Jethro comes to Moses and says, look, man, you need some help."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5290.95,"end":5303.35,"speaker":"Fr Stephen De Young","text":"Right. And part of what they're doing. Right. Is they're living among the people and interacting with them in their daily life. Right. When they come and settle in the land and become two separate nations, there's not a way for one guy to do that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5305.04,"end":5305.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5306.24,"end":5310.4,"speaker":"Fr Stephen De Young","text":"Realistically. Right. And so you have multiple prophets."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5310.48,"end":5310.88,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5311.36,"end":5374.22,"speaker":"Fr Stephen De Young","text":"Who are. Who are doing this, but they each have that authority and they've received it by the laying on of hands. As we're going to talk about more. And notice nowhere here in anything we've read does God say, oh, by the way, this is going to stop. He doesn't say, like, well, okay, like, this is gonna go on until the Hebrew Bible is complete, wherever you think that is, depending on your Old Testament canon. And then after that, there won't be any more of these. There will be no one with that authority. This is just there until we get the Hebrew Bible. Or perspicuous. Yeah. By the way, there's gonna be a Volume two. There's gonna be a New Testament. Once that's done, then, you know, we're done with this. And there's definitely not. Definitely never says anywhere that, oh, by the way, after that second volume of the New Testament is written, there will still be guys called prophets, but, like, they'll just be guessing stuff about the future. They'll be wrong more than half the time, but they're basically the same thing, except these guys were right all the time and doing something completely different that's definitely not there."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5374.3,"end":5375.58,"speaker":"Fr Andrew Stephen Damick","text":"Stoning not required."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5375.74,"end":5383.1,"speaker":"Fr Stephen De Young","text":"Sorry. Charismatics. Oh, yes, yes. The fulfillment. In the case of prophecy, fulfillment means it got worse."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5383.84,"end":5385.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, almost."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5385.6,"end":5394.32,"speaker":"Fr Stephen De Young","text":"It's the only case in Christian theology where supposedly, you know, everything else gets better in the New Covenant, but prophecy kind of goes to see."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5394.32,"end":5397.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. When I pour out my spirit on all men, It'll only work."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5397.44,"end":5398.24,"speaker":"Fr Stephen De Young","text":"50. 50."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5398.72,"end":5399.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5399.08,"end":5409.77,"speaker":"Fr Stephen De Young","text":"At best, it'll be about a coin flip. So. Yeah, so that. That doesn't happen. That doesn't happen either, but. So then what happens? How. How does all this work?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5409.85,"end":5412.49,"speaker":"Fr Andrew Stephen Damick","text":"Another cliffhanger there, Father Steven."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5412.89,"end":5418.97,"speaker":"Fr Stephen De Young","text":"Yes. All right, well, what will happen? You must come back after these commercial breaks."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5419.05,"end":5421.21,"speaker":"Fr Andrew Stephen Damick","text":"All right, we'll be back in just a second."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5421.69,"end":5434.38,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5434.93,"end":5438.05,"speaker":"Podcast Advertisement Voice","text":"That's 855-AF-RADIO."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5450.45,"end":5503.27,"speaker":"Announcer","text":"Perhaps you are a seeker exploring the abundance of the Orthodox faith. Or maybe you're a young mother wanting to share the fullness of Orthodoxy with your children and family. Or perhaps you are single, trying to find shelter from unclean images or words. Or an empty nester wanting to fill your time with edifying thoughts, prayers, discussions, and content. Or maybe you feel alone and just want to find solace and comfort regardless of your own unique circumstances. Ancient Faith Radio is here to help with your Orthodox journey. Please consider partnering with us by becoming a monthly recurring donor so that we can continue our mission to spread the Orthodox faith and help serve the spiritual lives of the already faithful. Any consistent donation, large or small, will enable us to focus on our mission unabated, simply visit www.ancientfaith.com support and start your monthly donations today. All gifts are tax deductible and greatly appreciated."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5503.59,"end":5504.23,"speaker":"Podcast Advertisement Voice","text":"Thank you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5506.39,"end":5522.51,"speaker":"Announcer","text":"We're back now with the Lord of spirits, the Father Andrew, Stephen Damick, and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 8-55-AF-RADIO."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5523.07,"end":5535.31,"speaker":"Fr Andrew Stephen Damick","text":"You know, I mean, the voice of Steve keeps saying that, but I think people are really trying to go easy on Mike Raisinbrand again this evening because they're not hardly calling. I mean, we had Cody from Atlanta, but, man."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5535.79,"end":5537.95,"speaker":"Fr Stephen De Young","text":"Yeah. Of all the times not to call."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5538.4,"end":5542.24,"speaker":"Fr Andrew Stephen Damick","text":"I know. You even programmed in a little extra space for liberality."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5542.24,"end":5557.84,"speaker":"Fr Stephen De Young","text":"Maybe we can. Maybe we can take some calls. Father Andrew's like, no, I have to eat at Bob Evans at 5pm and then go to bed. No calls. No calls for you, Bob Evans."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5558.4,"end":5560.8,"speaker":"Fr Andrew Stephen Damick","text":"I. Sorry."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5560.8,"end":5563.32,"speaker":"Fr Stephen De Young","text":"Another wave of nostalgia just rolled over me."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5563.32,"end":5568.61,"speaker":"Fr Andrew Stephen Damick","text":"You know, I lived in Ohio on a couple of occasions, so there's a."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5568.61,"end":5573.69,"speaker":"Fr Stephen De Young","text":"Lot of Bob Evans. At least it wasn't the poor man's Ohio."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5573.69,"end":5583.97,"speaker":"Fr Andrew Stephen Damick","text":"So that's true. That's true. Yeah. I think, actually, one point. I think I drove by the original Bob Evans, which isn't that somewhere near Columbus, as I recall?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5584.13,"end":5585.65,"speaker":"Fr Stephen De Young","text":"Yeah, they got a farm out there."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5586.21,"end":5586.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5586.61,"end":5588.85,"speaker":"Fr Stephen De Young","text":"Where they, like, get the food, supposedly."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5589.33,"end":5589.89,"speaker":"Fr Andrew Stephen Damick","text":"Huh."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5590.13,"end":5598.87,"speaker":"Fr Stephen De Young","text":"I think they've got a lot of locations to really be getting all their food from that farm, but I don't know for sure. So that's where Bob himself. Allegedly. Allegedly. I don't know."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5599.11,"end":5605.59,"speaker":"Fr Andrew Stephen Damick","text":"Bob himself is enshrined, embalmed in some mausoleum. You can see him. It's just like. Just like Lenin. Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5605.83,"end":5608.55,"speaker":"Fr Stephen De Young","text":"The relics of relics of Bob Evans."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5609.67,"end":5615.51,"speaker":"Fr Andrew Stephen Damick","text":"Right. In the center of a massive mega Bob Evans restaurant. That's all true."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5615.75,"end":5622.39,"speaker":"Fr Stephen De Young","text":"I almost referred to him as Old Bob, but Old Bob, of course, is the second coolest droid in the black hole."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5623.03,"end":5629.61,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow, man. I'm so grateful that you're making all kinds of references that I do get this time."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5629.61,"end":5632.57,"speaker":"Fr Stephen De Young","text":"Yes. Maximilian is the coolest one, by the way, not Vincent."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5632.97,"end":5634.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, of course. Of course."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5634.81,"end":5635.45,"speaker":"Fr Stephen De Young","text":"Of course."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5635.61,"end":5642.69,"speaker":"Fr Andrew Stephen Damick","text":"So. Oh, it looks like someone is calling. It's happening. It's happening, I tell you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5642.69,"end":5644.89,"speaker":"Fr Stephen De Young","text":"I mean, I kind of just put them up to it, so."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5645.21,"end":5655.51,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah. So, all right. We're just gonna let this. This person in. Who knows who this is or what they're calling for, but I think it's Kirill from Boston. Is that right? Kirill?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5656.23,"end":5657.35,"speaker":"Cody","text":"Yeah, that's right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5657.67,"end":5659.75,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome to Lord of Spears podcast."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5660.15,"end":5688.63,"speaker":"Cody","text":"Thank you very much. It's exciting to call you. I have a question. So Father Stephen said that, you know, there is this seeing of God which is a part of, you know, being a prophet, having seen God and, well, saints who have this holy life, who have led this holy life, they have seen God. Do they have some kind of authority like that as well?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5689.19,"end":5691.43,"speaker":"Fr Andrew Stephen Damick","text":"I mean, like that. Absolutely. Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5691.75,"end":5692.23,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5692.71,"end":5697.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Okay. I think, you know, it's funny when that's the short."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5697.51,"end":5698.55,"speaker":"Fr Stephen De Young","text":"That's the short version."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5698.63,"end":5712.4,"speaker":"Fr Andrew Stephen Damick","text":"That's the short version. But I should also say that, you know, earlier today when we were doing our briefing, Father Stephen predicted that we would get callers who would be tracking with us. Because actually, and this is the big reveal, this is part one of two."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5713.6,"end":5743.31,"speaker":"Fr Stephen De Young","text":"So there will be another episode you are tracking with us. But, yeah, and that's. That specific case that you're mentioning is a big part of. I don't want to say the argument. I mean, it's an argument, I guess, technically in a formal sense. But what Saint Simeon the New Theologian has to say about authority in the church is deeply related to the point you just made or the connection you just made as a further tease. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5744.43,"end":5745.79,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, Kirill?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5746.03,"end":5747.31,"speaker":"Cody","text":"Yep. Thank you very much."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5747.87,"end":5749.31,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Thanks for calling."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5749.71,"end":5750.35,"speaker":"Cody","text":"Thank you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5750.83,"end":5751.39,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5752.11,"end":5755.79,"speaker":"Fr Stephen De Young","text":"That was easy. One of the presbyters could have handled it. Oh, wait, I have one. Never mind."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5756.27,"end":5769.65,"speaker":"Fr Andrew Stephen Damick","text":"Say, that's us, buddy. Okay, let's talk about some foreign words as we sometimes have been want to do on the Lord of Spirits podcast."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5769.73,"end":5771.97,"speaker":"Fr Stephen De Young","text":"Words, words, words."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5775.17,"end":5781.25,"speaker":"Fr Andrew Stephen Damick","text":"It's a good Shakespeare reference for everybody, for all the kids out there. So what is the matter that you are reading?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5782.93,"end":5789.33,"speaker":"Fr Stephen De Young","text":"Yeah, man. I have to say Mel Gibson's Hamlet. Best Hamlet. I don't care that he's canceled."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5789.33,"end":5790.13,"speaker":"Fr Andrew Stephen Damick","text":"You think so?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5790.73,"end":5792.73,"speaker":"Fr Stephen De Young","text":"Yes. Best movie, Hamlet. Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5793.53,"end":5793.89,"speaker":"Fr Andrew Stephen Damick","text":"I."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5793.89,"end":5796.45,"speaker":"Fr Stephen De Young","text":"For me, I have not seen every stage Hamlet, so I can't."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5796.45,"end":5836.3,"speaker":"Fr Andrew Stephen Damick","text":"Well, obviously. But I mean, for me, it's a toss up, really. There's a lot I like about Mel Gibson's version, for sure. I also, I mean, he's great as Hamlet, and frankly, Helena Bonham Carter is uncanny as Ophelia in that production. But there's a lot I like about the Kenneth Branagh one, too. Although it is the only movie that I have seen which included an intermission other than, like, you know, Monty Python and the Holy Grail, which is not really a real. But I mean, the Kenneth Branagh, like Spartacus. Yeah. Oh, did that include an intermission? I Never saw in the movie theater, so."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5836.3,"end":5837.34,"speaker":"Fr Stephen De Young","text":"As did Ben Hur."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5838.14,"end":5854.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. Well, I never. I mean, that's long before I was watching movies in the movie theater. But, yeah, Kenneth Bronx Hamlet had an actual intermission where you got up, you know, got some extra popcorn. It took two VHS tapes, et cetera, et cetera. How many? Betamax, though."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5855.5,"end":5855.9,"speaker":"Fr Stephen De Young","text":"Who?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5855.98,"end":5857.1,"speaker":"Fr Andrew Stephen Damick","text":"Or laser discs."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5857.1,"end":5860.46,"speaker":"Fr Stephen De Young","text":"I'm not from Central America. I don't know. Betamax."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5863.74,"end":5866.06,"speaker":"Fr Andrew Stephen Damick","text":"Laserdiscs. You had to flip them over halfway through."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5866.06,"end":5872.42,"speaker":"Fr Stephen De Young","text":"Did you ever have one of those video discs? That's the difference between a video disk and a laserdisc. Yes, we had video discs."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5872.42,"end":5872.74,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5872.74,"end":5926.71,"speaker":"Fr Stephen De Young","text":"This is what began my life of crime, actually, because my dad, being Dutch, had invested in this, which meant he was not going to buy a VHS player, Right. For quite some time. And so stopped when he. When they finally just completely stopped making them, that word got out. He did go and buy a VHS player and then went and rented every video disk he could find and had us kids copy them onto VHS tapes. Nice. Like, just straight bootlegging. And because they noticed, because you had to, like, to record it, you had to, like, pause the videotape and then, like, flip it over in the middle. Right, right, right. So to this day, I think my mom still has some of them. If you go to her house and watch a movie on VHS, like an old 80s movie, like, halfway through the movie, this weird multicolor wavy line goes through the screen. And that's why I had a roommate."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5926.71,"end":5950.61,"speaker":"Fr Andrew Stephen Damick","text":"I had a roommate that had a laserdisc player, and he must have had a good 10, 20 laserdiscs. And of course, if they get to the end and you don't flip it over because, like, say you fell asleep on the couch, it just starts over and just keeps. And so, like, you wake up at three in the morning and you're somewhere in the middle of Star wars, you know. Oh, man. Good times. Good times."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5950.61,"end":5972.87,"speaker":"Fr Stephen De Young","text":"Yeah. One of the more embarrassing things that happened to Kevin Smith, and there have been several, is that on the laserdisc of other than Dogma, he starts it out by saying, you know, DVDs suck laser discs forever. Or something similar. Probably more profane than that, but that aged like fine. Milk."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5976.55,"end":5978.91,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. Well, we promised the kids."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5978.91,"end":5980.07,"speaker":"Fr Stephen De Young","text":"Oh, do we have a topic?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5980.31,"end":5984.13,"speaker":"Fr Andrew Stephen Damick","text":"We do, yeah. Yeah. So why don't you throw out."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5984.13,"end":5990.53,"speaker":"Fr Stephen De Young","text":"Some people who listen for the rambling, are going to love this episode, and there's going to be a whole other segment of the audience who are going to hate this episode."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":5990.53,"end":6002.17,"speaker":"Fr Andrew Stephen Damick","text":"I know this is this is going to actually create the big civil war that I'm looking for over the editing style, because there's a bunch of people that hate the rambling, and there's a bunch of people that love the rambling."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6002.17,"end":6006.29,"speaker":"Fr Stephen De Young","text":"You know what you should do? You should do two edits. You should do, like, a contemporary and a traditional."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6007.09,"end":6014.3,"speaker":"Fr Andrew Stephen Damick","text":"There we go. That's right. One has the guitars and the. Anyway, so."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6014.3,"end":6015.3,"speaker":"Fr Stephen De Young","text":"Yeah, authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6015.62,"end":6016.34,"speaker":"Fr Andrew Stephen Damick","text":"Authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6016.98,"end":6072.43,"speaker":"Fr Stephen De Young","text":"We've been using that word. Yes. Respect it. We've been using that word. But maybe it does not mean what we think it means. So what are we actually talking about in terms of biblical words? So our Hebrew word for today is smikah. That word, in later Hebrew parlance is used just to refer to ordination, like the process of laying hands, laying on hands, and ordaining someone. But originally it was related to the authority itself that was imparted by that act. And it comes from the root semic, which means something like sturdy. It means something that could be leaned upon, that can support weight. So something like sturdy."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6072.67,"end":6082.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So is this where you get some of. This is the term synecdoche, like the government shall be upon his shoulders, like something that can be leaned on. The authority is related."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6082.43,"end":6083.39,"speaker":"Fr Stephen De Young","text":"Completely unrelated."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6084.03,"end":6085.15,"speaker":"Fr Andrew Stephen Damick","text":"Unrelated. Okay."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6085.95,"end":6087.95,"speaker":"Fr Stephen De Young","text":"Oh, not the word synecdoche. The word synecdoche."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6087.95,"end":6090.51,"speaker":"Fr Andrew Stephen Damick","text":"No, no. I'm not talking about the words being related. I'm talking about the concept."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6090.83,"end":6097.87,"speaker":"Fr Stephen De Young","text":"Oh, the concept. Yes, the concept. Yes. Shoulders, being able to support something. Yes. Right, right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6097.87,"end":6098.67,"speaker":"Fr Andrew Stephen Damick","text":"That's what I mean."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6098.83,"end":6106.91,"speaker":"Fr Stephen De Young","text":"And for the. For the younger men out there, sturdy is not an adjective to ever use to refer to your girlfriend or wife."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6109.55,"end":6109.95,"speaker":"Fr Andrew Stephen Damick","text":"Ever."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6110.11,"end":6116.59,"speaker":"Fr Stephen De Young","text":"In public. In private, the abuse that happens to you if you do, will be your own fault. You'll have no one to blame but yourself."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6116.89,"end":6119.69,"speaker":"Fr Andrew Stephen Damick","text":"And it won't be abuse. It'll be justice."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6120.09,"end":6120.57,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6122.89,"end":6123.17,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6123.17,"end":6142.09,"speaker":"Fr Stephen De Young","text":"So that's that. That's the core idea. Right. Is this kind of reliability, sturdiness, ability to support, to carry weight. Right. That kind of idea of authority. The Greek word we're talking about in this context is exousia."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6142.9,"end":6167.26,"speaker":"Fr Andrew Stephen Damick","text":"Exousia. Well, so I'm gonna. I'm gonna play. I'm gonna play the etymology jingle because so many people have missed it for a little while. I don't remember the last time I played it, so. So here we go, everybody. Etymology jingle. Yay. That little girl is now, like, five or six years old, so."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6167.26,"end":6170.51,"speaker":"Fr Stephen De Young","text":"Yes. Why are you trying to make me feel older?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6171.95,"end":6172.35,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6172.35,"end":6183.23,"speaker":"Fr Stephen De Young","text":"It's on one hand. On one hand, I just turned 50. On the other hand, I'm now joining AARP Discounts, here I come. Say you can join AARP, which is."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6183.79,"end":6190.43,"speaker":"Fr Andrew Stephen Damick","text":"You think it's an acronym, but it actually is the sound you make when you try to get a. Get out of bed in the morning."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6192.59,"end":6202.05,"speaker":"Fr Stephen De Young","text":"I don't have enough energy for an arp. I mean, I see where you were going with the bit, but that's way too. Way too energetic an exclamation for me."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6202.05,"end":6270.68,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, exousia. People look at that and they see USIA and they see X and they're like, oh, it means out of essence or something like that. It doesn't. It's not even related to that word, to usia. It's actually from the verb xsti, which means it is permitted or it's like the ability to do something also can mean privilege related to all of that sort of authority stuff. It can mean force or capacity, even competency. Freedom. It can mean freedom like the ability to do something, you know, mastery. Yeah. On and on. Delegated influence, even. All these things are. Are used in this way in the Bible from that verb ecstasy. So that's what. Where exousia comes from. It's a. A form of that. And so that's where you get, for instance, where it says that Jesus. It says in the New Testament that Jesus speaks with exousia, that he speaks with authority, unlike describes. Yeah. And then they ask also, you know, by. By what exousia do you do these things?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6271,"end":6272.84,"speaker":"Fr Stephen De Young","text":"And who gave you this exousia?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6273,"end":6274.24,"speaker":"Fr Andrew Stephen Damick","text":"Who gave you that? Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6274.24,"end":6275.56,"speaker":"Fr Stephen De Young","text":"From whom did you receive it?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6275.77,"end":6286.89,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Yeah. So that's. That's where this word comes from and, and what it means. Actually, the etymology lines up with what we're talking about. It's. You don't have to commit the etymological fallacy here."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6287.69,"end":6334.81,"speaker":"Fr Stephen De Young","text":"Yeah. And there is this connotation of freedom or liberty. Right. With. With exousia in that it means you have authority, meaning you are not under the authority of another. Right. You are the one who has authority. And that gives you a certain freedom to exercise that authority. Right. Authority comes with the right, indeed, the necessity to use that authority. Right. So this is when we talk about various Second Temple Jewish views that saw there being a second power in heaven, where we're talking about the beginnings of the understanding of the Holy Trinity, the word power. There is exousia."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6335.53,"end":6336.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6336.09,"end":6343.93,"speaker":"Fr Stephen De Young","text":"Meaning there is some. So you have God, right. Who created everything and everyone else."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6344.01,"end":6344.41,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6345.21,"end":6358.08,"speaker":"Fr Stephen De Young","text":"And you have. Right. All kinds of powers and principalities. Right. You have angels. Right. And. And the powers There are, by the way, are dinameion, it's a different word in Greek."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6358.56,"end":6359.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6359.92,"end":6383.26,"speaker":"Fr Stephen De Young","text":"They have power. Right. They are beings with power, but they are strictly operating under God's purview. Right. Even the demons can only act as God permits them. Right. They cannot just decide, well, I'm going to do this and I don't care if God lets me or not. Right. Like they can only do what God allows."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6383.41,"end":6385.01,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, they're on, on a leash."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6385.57,"end":6442.42,"speaker":"Fr Stephen De Young","text":"Yeah. And so the idea is there is this other person in the heavenly places besides God proper, or God the Father or how to. Who also operates with authority, with God's authority. That's the idea of the second power in heaven and then theories as to who that is. But that's the kind of authority. So it's, it's that, that freedom. And so you could kind of combine both of those ideas and, and by taking both of those ideas, you get kind of a picture of how this authority was viewed. This kind of reliability, sturdiness, ability to support the weight and make these rulings. Right. But then also the freedom to make those rulings. To make a ruling, you have to have a certain amount of freedom. If you were bound by something else, then you wouldn't be making the ruling."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6443.22,"end":6443.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6443.54,"end":6453.22,"speaker":"Fr Stephen De Young","text":"If Moses had to go by, if every single time he was asked a question, if Moses had to go and inquire directly of God, hey, how do I answer this question? Right. Then Moses would not have any authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6453.86,"end":6455.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he would just be looking stuff up."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6456.5,"end":6456.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6458.5,"end":6459.06,"speaker":"Fr Andrew Stephen Damick","text":"Literally."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6459.06,"end":6466.18,"speaker":"Fr Stephen De Young","text":"But no, God gives Moses the authority to make those rulings himself, which means he has to be free to rule."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6467.6,"end":6467.84,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6468.32,"end":6473.12,"speaker":"Fr Stephen De Young","text":"In various ways. Potentially in different ways, in different circumstances. For example."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6473.52,"end":6474,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6474.32,"end":6581.25,"speaker":"Fr Stephen De Young","text":"Different ways of celebrating Passover. Right. And so by the time you get into the second Temple period, that's kind of the understanding of this authority that was received by Moses, that was passed down by Moses even to that day. And so they had these elaborated chains of speakah, Right. Going back to Moses, Moses to Joshua, and then on down to particular rabbis, particular teachers who sat in Moses seat. Right. Who had received this ordination in the second Temple period. Now, slight spoilers, not really for next episode, but just historically, these chains, by the way, get wrecked by the Romans. So after the structure of the temple and stuff, ordination. I'm not an expert on contemporary Judaism, but for a variety of reasons, including this, the chains being broken, and including where and how ordinations were to be done, there is still something that is called rabbinic ordination now. But Judaism does not see that as the same thing as what happened in the past. That chain kind of authority kind of gets broken in the direct sense. But we'll have more to say about that next episode. And that includes. That's not just a, hey, this guy's a prophet too. Hey, this is this generation's prophet. But there's also a concrete historical laying on of hands, like a material thing that happened or that was at least seen to have happened in the second Temple period leading from Moses all the way down. We saw the start of that with Joshua in numbers and then it continued."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6581.81,"end":6582.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6582.37,"end":6589.73,"speaker":"Fr Stephen De Young","text":"So this was not just a matter of random guy popping up every generation or two, but."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6589.73,"end":6590.09,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6590.09,"end":6649.93,"speaker":"Fr Stephen De Young","text":"And God directly giving the same authority to each of them. This was historically mediated and handed down. And there are community. This is why there are communities of prophets in the Old Testament. They know each other. Prophets had disciples. Example, the book of Isaiah, according to the book of Isaiah was not written by Isaiah. It was written down by his disciples who collected his prophecies after his death. That's why when you get all these people talking about, oh, well, there's, you know, Deutero Isaiah, Tritto Isaiah, or you know, tertiary Isaiah. Right. There are these three different books that have all been compiled in the Book of Isaiah. I'm like, okay, cool, whatever. There were three collections of Isaiah's prophecies. They were all put together into one book at some point. Just like there were five books of psalms that were all put together into one book at some point."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6650.57,"end":6661.75,"speaker":"Fr Andrew Stephen Damick","text":"And bother me because the sense of how, how the text of these things relate to the authority of the prophet is not the way that we think of authorship and so forth."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6661.75,"end":6671.43,"speaker":"Fr Stephen De Young","text":"You put stylus to paper, Right? Like that, Stylus to papyrus, I guess. No, right. And then you're gonna run into real trouble in the New Testament because then like St. Paul didn't write anything."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6672.31,"end":6675.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. His co author often mentioned."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6675.91,"end":6694.82,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But you also have the case of Jeremiah and Baruch, his scribe. Right. So there were disciples who the prophets had. And there are also prophets where we see this succession happen. It's not just Moses and Joshua where we see it. Most famous one is Elijah and Elisha."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6695.3,"end":6697.18,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6697.18,"end":6752.3,"speaker":"Fr Stephen De Young","text":"Where again, like with Moses and Joshua, we have laid out in the text of Scripture this succession from one to the next. Right. So this succession is not just a theoretical thing that they came up with in second Temple Judaism. They're reading this out of the scriptures. They're seeing this happen with the prophets living in communities, having disciples, having. Right. And this is the way that prophethood was handed down. By the way, this is distinct from other forms of authority in ancient Israel and Judah. Right. If you stop and think about it for a second because how was the monarchy, the kingship, how was that handed down? Biological descent mostly. Father was supposed to be leave the Northern kingdom aside for a second. The assassinations and everything. Right. How was the high priesthood handed down? The priesthood in general."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6752.78,"end":6753.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6753.9,"end":6773.68,"speaker":"Fr Stephen De Young","text":"Family succession. Right. Your sons. Again, we'll leave out the Hasmoneans and the assassinations, but. But that was the way it was. It was not that case with prophets. It's not what Moses had sons, but neither his firstborn son Gershom nor any of his other sons succeeded him as the prophet Joshua did."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6773.68,"end":6774.24,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6776.16,"end":6791.68,"speaker":"Fr Stephen De Young","text":"So Isaiah had had children. We know several of the other prophets had children. We know a bunch of them had wives. They lived in communities of prophets and stuff. But it was not passed on from father to firstborn son like in those other cases. It is passed down through the laying out of hands to a successor."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6792.01,"end":6792.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's an ordination."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6793.69,"end":6822.18,"speaker":"Fr Stephen De Young","text":"Yeah. That is how this authority, this prophetic authority was handed down. So that being the case. Right. Someone might ask. Nobody called in and asked it unfortunately. But someone might ask and anticipating a question, well, wait a minute. So if this guy had hands laid him by the previous prophet, what if he's a real jerk? What if he's a bad guy?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6822.82,"end":6826.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What if he's wrong? What if he's abusive? What if he's right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6826.5,"end":6833.94,"speaker":"Fr Stephen De Young","text":"Yeah. How do we do? We just, you know, hey man, he's got the authority because he got the hands put on him. Whatever he says, you know. Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6834.02,"end":6863.64,"speaker":"Fr Andrew Stephen Damick","text":"I mean this is murder somebody. This is what a lot of, you know, either anti religious or you know, in many cases people have been burned by religion will say about religion like well, they think that just because this person's ordained or whatever that they're untouchable, they're unquestionable, that they're perfect or you know, that they can do whatever they want, all that kind of stuff. Right. This is what people say."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6864.12,"end":6871.19,"speaker":"Fr Stephen De Young","text":"Yeah. So there are such a thing as false prophets. Right. There are false prophets in, in the Bible, in the Old Testament."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6871.5,"end":6871.74,"speaker":"Cody","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6872.54,"end":6881.74,"speaker":"Fr Stephen De Young","text":"So how does that work? Well, we're going to go right back to Deuteronomy. We're going to pick up at the verse where we left off when talking about the prophet like Moses who is going to come in the future."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6881.82,"end":6919.47,"speaker":"Fr Andrew Stephen Damick","text":"This is Deuteronomy 18 again now picking up with verse 20. But the prophet who presumes to speak a word in my name that I have not commanded him to speak, or who speaks in the name of other gods, that same prophet shall die. And if you say in your heart, how may we know the word that the Lord has not spoken? When a prophet speaks in the name of the Lord, if the word does not come to pass or come true, that is a word that the Lord has not spoken. The prophet has spoken it presumptuously. You need not be afraid of him. I like how it ends there. You need not be afraid of him."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6920.83,"end":6930.44,"speaker":"Fr Stephen De Young","text":"Yeah, don't worry about it. I mean, a better translation that would actually be, do not respect him. But we don't want to be that strong in our verbiage."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6930.44,"end":6934.24,"speaker":"Fr Andrew Stephen Damick","text":"That's what fear generally referred to most of the time in the Bible."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6934.64,"end":6957.17,"speaker":"Fr Stephen De Young","text":"Tell him to buzz off. Right. And so let's take a look at how you don't tell a false prophet according to the Bible. Right. Some things that people might suggest if we weren't talking about these verses. Well, how about this? We take what the new guy who says he's a prophet says, and we compare it to what the previous prophets said."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6957.89,"end":6960.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is he just repeating what has come before?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6960.53,"end":6978.93,"speaker":"Fr Stephen De Young","text":"Right. We just go back to whatever scripture we have at the time, depending on where we are in history, and the words of the previous prophets, and see if he's contradicting anything. That doesn't work. Why does that not work? Well, because look at the kind of authority that Moses exercised as the prophet."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6980.3,"end":6980.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6980.54,"end":6987.9,"speaker":"Fr Stephen De Young","text":"Should the Israelites have heard what he said about the firstborn and said, well, hold on a minute there, Moses. You're adding to what God said to you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6989.1,"end":6994.22,"speaker":"Fr Andrew Stephen Damick","text":"If that was the case, then that's not authority. That's just exegesis at best."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":6994.46,"end":7048.43,"speaker":"Fr Stephen De Young","text":"That's being a parrot. So that doesn't work for that reason. If this person really has the authority, really has that kind of authority to make these kind of rulings, then they have the authority to go beyond what's been said before. Right. Or to say something different, at bare minimum, something different than what's said before based on a new or different situation. Right. That's being addressed. What's being addressed here is a false claim to authority. This is a person saying they have the prophetic authority, but they actually don't. That's the core of the problem. And so the way that is addressed has to do with what we've talked before about prophets giving signs when they make prophecies. These signs were there. We've talked about them in the past, mainly in a positive sense."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7048.91,"end":7049.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7050.03,"end":7099.28,"speaker":"Fr Stephen De Young","text":"So the prophet says, here's my prophecy. Here's. Here's what I'm saying. And to verify that this is a correct ruling, right? That this is something you should put your faith and trust in, that this is something that is binding on you, tomorrow this is going to happen. To use the actual example, the Messiah has been born. The angels say, shepherds, this will be a sign to you. Go. You'll find a baby in this manger, newborn baby sitting in an animal food trough. So there's this immediate sign that shows that the larger prophetic statement is true. We've talked about that in a positive sense. Now you can have confidence in the larger prophecy, but it also works the other way. It's also a way to test that prophet. According to Deuteronomy 18, 20, 22."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7099.68,"end":7112.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, if that test were applied to a lot of the prophets that one sees on YouTube or, or wherever these days. Be a lot of rocks being thrown, let me tell you. Especially these days, boy, there's some excitable people out there."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7114.03,"end":7178.16,"speaker":"Fr Stephen De Young","text":"Now, this may have spawned in your head. If you're tracking with us questions about Jesus, talking to people who ask him for a sign. Next episode we're going to talk about that. Yeah. And what's going on there? What's going on here? That's what it means. Speaks the day of the Lord. If the word does not come to pass or come true, that doesn't mean prophets primarily predicted the future. Right? Right. It means that a sign, they give you a sign and the sign turns out not to be true. So the prophet comes to you and says, nah, man, it's cool that you married that woman and her sister. The correct response according to Deuteronomy is not to say, well, wait a minute. Leviticus verse, da da da da da, says that's not allowed. That's not the correct way to address it. Sorry. Sola Scriptura, folks. According to the scriptura in Sola Scriptura, the way to address that is that he would give you some sign. And as a sign, tomorrow a daffodil will bloom in your yard. You wake up in the morning, no daffodil, right? You know, oh, I should not marry this woman and her sister. And by the way, I need to stone that guy to death."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7178.4,"end":7188.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And, and you know, he shouldn't say stuff like, you know, and behold, I give you a sign. There will be a duck somewhere in this world. Like, you know, it can't be something I like."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7188.68,"end":7199.52,"speaker":"Fr Stephen De Young","text":"How we're coming up with the most random, absurd example, right? You know, this will be a sign. There will be a long pause in the rain, not so long as to cause you to become bored."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7200.28,"end":7200.52,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7201.32,"end":7259.22,"speaker":"Fr Stephen De Young","text":"That's not very, very Monty Python with this whole thing, I think significant, literally the. But. So where do we see an example of this? Right? Where do we see an example of this in action? What's being talked about here in Deuteronomy? Well, we see that in the book of Jeremiah, because in the book of Jeremiah there is this sort of contest between Jeremiah, who is the actual prophet of God, who actually possesses this authority, and a whole bunch of other people who call themselves prophets of Yahweh, the God of Israel, in this case, specifically the God of Judah, because the northern kingdom is no more at this point and Judah is about to go into exile. But they are saying different things, different radically contradictory things. Jeremiah and these other folks are. So how are people to know which is the real one? So we're only going to read part of this. This is a long chapter Jeremiah, but we're in a salient portion."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7259.79,"end":7325.89,"speaker":"Fr Andrew Stephen Damick","text":"This is Jeremiah 23. You know, obviously this is the Hebrew numbering as we have talked before, Jeremiah. Hebrew Jeremiah and Greek Jeremiah are related but not identical texts. Jeremiah 23, 15, 18. Therefore, Thus says the Lord of hosts, concerning the prophets, behold, I will feed them with bitter food and give them poisoned water to drink. For from the prophets of Jerusalem ungodliness has gone out into all the land. Thus says the Lord of hosts, do not listen to the words of the prophets who prophesy to you, filling you with vain hopes. They speak visions of their own minds, not from the mouth of the Lord. They say continually to those who despise the word of the Lord, it shall be well with you. And to everyone who stubbornly follows his own heart, they say, no disaster shall come upon you. For who among them has stood in the counsel of the Lord to see and to hear his word? Or who has paid attention to his word and listened? So Divine council reference everybody."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7326.45,"end":7407.77,"speaker":"Fr Stephen De Young","text":"Yes. And so here we see, and we already alluded this, we already started to see this back in these all the way, way back in the second half of the program, that there are these two elements, these false prophets in Jeremiah may have had somebody lay hands on them. Yeah, right. And they may be able to, and I don't know if this resembles any current day situations, they may even be able to, through various feats of ledger domain, be able to trace that back to somebody who's incontestably a legitimate prophet. Right. But what makes them not a real prophet is that they don't have the spiritual experience, like standing in the divine council, being in God's presence. They do not have that. That's like the soul and the laying on of hands is the body. If you don't have both, it's dead. And so without that experience, right, they are false prophets. Notice the result. Notice what God condemns them for. It's not that like, and this is the way it's sometimes presented, it's sometimes presented that the problem was, well, Jeremiah is predicting the future and saying Jerusalem is going to fall to the Babylonians. Whereas these false prophets are claiming to predict the future and saying it's not."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7408.81,"end":7410.09,"speaker":"Fr Andrew Stephen Damick","text":"No, no, it's."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7410.09,"end":7411.61,"speaker":"Fr Stephen De Young","text":"And which one are we supposed to believe?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7412.17,"end":7416.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's what they're telling people to do or not do in this case."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7417.45,"end":7433.51,"speaker":"Fr Stephen De Young","text":"Because Jeremiah is saying, because of the wickedness of the people and laying out the specific wicked practices of the people, destruction is going to come upon Jerusalem unless you all repent. Now."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7434.15,"end":7445.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Whereas these false prophets are saying to those, as it says to those who despise the word of the Lord, in other words, to those who are unrepentant, everything is going to be fine, everything is good."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7445.06,"end":7527.99,"speaker":"Fr Stephen De Young","text":"And that is why, because of them, ungodliness has gone out into all the land. They don't think they need to repent of anything. Oh, everything's going to be fine. Everything's going to be fine is a problem. Not because it's not going to be fine, but because the only way it would be fine would be if they repent and they're being told not to, or that they don't need to, that there's nothing to repent of, everything's wonderful. And so what Jeremiah is doing is exercising the authority, like the authority Moses was given, right? He's looking at the situation in his day. He's looking at the practices. And this includes all kinds of practices. If you read the book of Jeremiah, this includes the business practices of people in the market where they're cheating people and swindling people and oppressing the poor. This includes sexual immorality. This includes, I mean, across the board, he is looking at those practices. He is looking at the commandments of God and the God whom he has seen and whom he has come to know and saying, here is what God says about what you're doing. And that ruling is God's ruling on it. Okay? What the false prophets are doing is something very different. What the False prophets are doing. That's why the word imagination comes up with these false prophets. They're trying to speak something into existence."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7528.15,"end":7531.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Kind of like, I don't know, word faith. Pentecostalism."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7532.07,"end":7537.91,"speaker":"Fr Stephen De Young","text":"Yes. That's a bit on the nose, but yeah, I mean, that's literally the."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7537.99,"end":7578.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we don't need to go into all that. But yeah, but yeah, so. Well, not totally relatedly, but somewhat relatedly, actually. Someone in the chat asked a very good question, a very kind of application question. So the grizzled poet, that's the username of this person in the chat says, so how do I speak to my cousin about this? Because she believes the Holy Spirit is guiding every random vision she has when praying, not even considering that it may be demonic suggestion. So, yeah, I mean, what about when someone thinks that, I don't know, maybe this cousin doesn't. Wouldn't call herself a prophet, but kind of seems to think she is on some level."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7579.22,"end":7582.98,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, without knowing this person, I don't know how hard to go in the paint."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7583.7,"end":7584.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, sure, yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7585.06,"end":7587.18,"speaker":"Fr Stephen De Young","text":"The blasphemy of the Holy Spirit will not be forgiven."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7587.18,"end":7587.42,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7587.42,"end":7589.22,"speaker":"Fr Stephen De Young","text":"There's going that hard. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7589.38,"end":7591.7,"speaker":"Fr Andrew Stephen Damick","text":"Don't tell this person to stone the cousin."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7592.1,"end":7598.26,"speaker":"Fr Stephen De Young","text":"You could ratchet it down a few steps to. There is a way that seems right to a man and its end is destruction."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7599.38,"end":7615.24,"speaker":"Fr Andrew Stephen Damick","text":"Well, even in the passage from Jeremiah. Right. It talks about to those who stubbornly follow their own heart. And of course, part of the question then is, well, where is this authority supposedly that this cousin has come from?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7615.88,"end":7645.08,"speaker":"Fr Stephen De Young","text":"Right. Well, and it's in yourself. Meaning the authority is not something outside of the person themselves. Yeah, that really is the ultimate issue. Right. Because I don't know this person. Maybe the Holy Spirit is communicating certain things to her. I'm not prepared from afar not knowing anything to say that nothing. That none of those experiences come from God. Right. Like, I don't know. But I wouldn't bet money that every single one of them does either."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7645.56,"end":7646.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, probably."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7646.84,"end":7669.04,"speaker":"Fr Stephen De Young","text":"And she's not just betting money. Like, that's a far more dire wager. Right. That she's making by putting her trust in her own understanding of these things. That's a very dangerous thing to do and not something that scripture ever tells you to do. There is no verse in Scripture that tells you to follow your heart."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7669.68,"end":7672.4,"speaker":"Fr Andrew Stephen Damick","text":"No, quite the opposite."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7672.48,"end":7675.04,"speaker":"Fr Stephen De Young","text":"Or lean on your own understanding or."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7675.04,"end":7678.32,"speaker":"Fr Andrew Stephen Damick","text":"Quite the opposite. Yeah, literally the opposite."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7678.56,"end":7687.51,"speaker":"Fr Stephen De Young","text":"Figure these things out for yourself. Just never happens in scripture. Not once."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7688.79,"end":7690.39,"speaker":"Fr Andrew Stephen Damick","text":"So. Good question."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7691.11,"end":7694.31,"speaker":"Fr Stephen De Young","text":"And now in concluding this episode, we're going to ask a couple of questions."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7694.47,"end":7695.03,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7695.91,"end":7696.87,"speaker":"Fr Stephen De Young","text":"Things to think about."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7697.91,"end":7701.27,"speaker":"Fr Andrew Stephen Damick","text":"Speaking of people who could be wrong about things. Could most."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7702.31,"end":7703.99,"speaker":"Fr Stephen De Young","text":"As you sit with bated breath."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7704.47,"end":7705.31,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7705.31,"end":7707.75,"speaker":"Fr Stephen De Young","text":"Awaiting our next episode in a fortnight."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7708.23,"end":7709.51,"speaker":"Fr Andrew Stephen Damick","text":"Indeed. Yes."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7709.51,"end":7711.55,"speaker":"Fr Stephen De Young","text":"Question one. Could Moses be wrong?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7711.79,"end":7716.83,"speaker":"Fr Andrew Stephen Damick","text":"Could he be wrong? I mean, we know he's a prophet. I mean, he's kind of the prophet."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7716.99,"end":7719.07,"speaker":"Fr Stephen De Young","text":"Was Mosaic infallibility a thing?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7721.71,"end":7724.83,"speaker":"Fr Andrew Stephen Damick","text":"Was Netscape infallibility a thing? I ask you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7725.15,"end":7726.43,"speaker":"Fr Stephen De Young","text":"No, it was not."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7726.75,"end":7731.15,"speaker":"Fr Andrew Stephen Damick","text":"Definitely. I was a links user back in the day, but."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7731.15,"end":7735.94,"speaker":"Fr Stephen De Young","text":"So if you ask the question, could Moses be wrong? First we have to clarify, could he be wrong about what?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7736.74,"end":7743.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, he could definitely sin. Yes. I mean, his wife did things wrong. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7743.62,"end":7745.54,"speaker":"Fr Stephen De Young","text":"Striking the rock. Right. You know."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7745.54,"end":7746.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that was wrong."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7746.46,"end":7767.25,"speaker":"Fr Stephen De Young","text":"He was capable of erring morally. He could certainly be wrong about, like, matters of science. As far as we could tell, he, like everyone else when he lived, thought the earth was flat, supported by pillars over water with a big dome over the top of it. Sorry, flat earthers. That turns out not to be correct. So, yeah, things like that."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7767.25,"end":7768.37,"speaker":"Fr Andrew Stephen Damick","text":"From a certain point of view."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7768.77,"end":7770.77,"speaker":"Fr Stephen De Young","text":"Right. He didn't understand electricity."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7770.77,"end":7771.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7771.09,"end":7808.94,"speaker":"Fr Stephen De Young","text":"There's, you know, he could be. He could be wrong about all kinds of things like that. But when Moses is exercising his God given authority in this way to say X is a sin or X is permissible, he definitionally could not be wrong because whether it was a sin or not depended on the ruling Moses made. That's the nature of the authority he had. And if you don't understand this, we're going to go into this a lot more in the New Testament in the next episode. These things we're talking about here at the end of this episode are all teasers, right?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7808.94,"end":7830.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because, I mean, just briefly, though, like, there are some things that are situationally sins for one person and not for another. Like a super obvious example would be if a woman is married, her husband can have relations with her and that is not a sin, but any other man cannot. It would be a sin even though the action is the same and the woman is the same."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7832.09,"end":7842.02,"speaker":"Fr Stephen De Young","text":"But even beyond that, if you don't understand this, you're not going to understand what St. Paul is doing when he talks about something like eating a particular piece of meat being a sin for one person and not for another person."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7842.17,"end":7842.41,"speaker":"Announcer","text":"Person."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7842.81,"end":7848.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's not about a kind of. Is that what is. What's the term? Deontological ethics?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7849.13,"end":7853.13,"speaker":"Fr Stephen De Young","text":"Yes, it's. It's what is just the nature of the thing. Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7853.13,"end":7855.45,"speaker":"Fr Andrew Stephen Damick","text":"Appropriate for appropriate for this person."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7856.01,"end":7857.93,"speaker":"Fr Stephen De Young","text":"That's not how it works in the scriptures."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7858.25,"end":7859.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7859.13,"end":7864.49,"speaker":"Fr Stephen De Young","text":"There's someone who has the authority to make that ruling. We'll talk about that more next time."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7864.89,"end":7865.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7865.85,"end":7870.1,"speaker":"Fr Stephen De Young","text":"Another thing to think about. Who could hold Moses accountable?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7870.74,"end":7873.14,"speaker":"Fr Andrew Stephen Damick","text":"Well, people attempted. Yeah."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7873.62,"end":7874.9,"speaker":"Fr Stephen De Young","text":"Miriam tried it."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7874.98,"end":7877.46,"speaker":"Fr Andrew Stephen Damick","text":"His sister tried it and she became a leper."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7880.26,"end":7882.02,"speaker":"Fr Stephen De Young","text":"Korah kind of tried it."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7882.02,"end":7885.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Sons of Korah. Who made you a priest over us?"}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7885.94,"end":7909.04,"speaker":"Fr Stephen De Young","text":"Yes. Why are Aaron made them holy? Are we not all holy? Are we not all priests? Was there any text answer? Obviously, no. But that held Moses accountable. God gave him the authority. And so only God could hold him accountable for how he used it. Yeah, I mean, people give him the authority. So the people couldn't hold him accountable."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7909.28,"end":7911.36,"speaker":"Fr Andrew Stephen Damick","text":"That's right. I mean, this is part of what it means."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7911.36,"end":7912.48,"speaker":"Fr Stephen De Young","text":"Give him the authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7914,"end":7924.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. As I say, this is part of what it means when we're told not to judge another man's servant. If you're not Moses, master, you can't judge him."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7925.2,"end":7925.56,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7925.56,"end":7926.88,"speaker":"Fr Andrew Stephen Damick","text":"He's not responsible to you."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7928.24,"end":7957.32,"speaker":"Fr Stephen De Young","text":"And so our final little teaser for the next episode is that in the second Temple period, this authority, the authority to declare something to be a sin and something not to be a sin. Right. To answer these questions, to interpret and apply this authoritative way that we've been talking about, the whole episode was referred to as the authority to bind and to loose. Till next time, listeners. Oh, no, we're good."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":7957.32,"end":8374.22,"speaker":"Fr Andrew Stephen Damick","text":"And under that bombshell. Yeah, I, I mean, you know, I started out by asking this question. Why is it that this seems to be so neglected, I think, for American Christians, that we don't think too much about this? Like, oh, that's just the way how they functioned back then. And I wanted to return to that because for multiple reasons, one is a point we have made many, many, many, many times over the almost five years of this podcast, which is that the Old Testament is not some kind of expired historical document. That's not how the New Testament writers treat it. It's not how the church father is treated. It's not how the whole tradition of the church treats it. It's. It's just not that way. But, but, you know, deeper than that, that kind of meta issue that we talk about a lot is that. And, and, you know, like, like I said, this is a two, two part series here, so we've got another one coming. But just to anticipate that a little bit, I think it's really important to understand that the ways that, that church life functions are not something that are Kind of arbitrarily decided or even, I don't know, maybe to arbitrarily is maybe not the right word, but it's not some man made thing. These authority structures are literally God made. God gave Moses this authority and God told him to pass it on. When Moses pointed, ordained Joshua, he did so at the word of the Lord. Right? It was not something that he made up. It was not man made religion. I mean, it's rampant of course in American Christianity for various kinds of reasons, maybe not so much in other parts of the world, but definitely in American Christianity. This idea that the way that the church functions, particularly with, with regards to the question of authority, but for a lot of other areas too, like how worship works, all these things that people will say, oh, that's man made. There's this kind of, you know, true religion underneath all that. And you don't need all that man made stuff. The problem is you can only say that it's man made if you're not really reading the Bible. Because we just went over this, we just covered it. It's, it's, it's really pretty clear that this is God himself who is behind these authority structures and functionings and so forth. It's God himself who has ordained these things. St. John Chrysostom @ one point very famously says that all. I might be, I'm sure I'm paraphrasing him a little bit here or maybe even a lot, I don't know that, that all evils are all sin or all error or something like that stems from ignorance of the Scriptures. And this is definitely one of those areas. It's definitely one of those areas. And maybe because this kind of crypto marcianism, this idea that the Old Testament is kind of done away with is so rampant that people don't realize they're doing that. But if you treat the Old Testament the way the apostles did, the way the church fathers did, then you'll see that actually this all goes way deep into, into that, that Moses being appointed by God and then Moses's authority being passed on by an act of Moses at the word of the Lord and with the action of the Lord. You know, it says about Joshua that he had the Holy Spirit on him already, that, that this is the basis for the way that the church functions. This is the basis for the way that God himself set up the relationship that he wants to have with humanity. This is not man made religion. This is God made religion. This is God made religion. And I know that people want to say that it Is man made because of the errors of those who are exercising that authority? Because they're fallible? I mean, as a clergyman myself, I know very clearly that I am fallible. I know I am. Yet nonetheless, it is these fallible people. I mean, Moses was definitely not a perfect guy. Read his life. God chose him nonetheless as this great, great prophet. So I think in a lot of ways we want mercy for ourselves, but we want to be merciless with others. We shouldn't do that. That doesn't mean that authority figures in the church are not to be held accountable. But as we just mentioned, they are held accountable by God. And we'll see how that gets exercised, particularly in the next episode. Because it's not like, well, you just have to sit around and just tough it out. You know, that there's not that you absolutize those positions or whatever. That's not what that means. There is a way that God has set up for church leaders to be accountable. But most of the people who are complaining about church leaders, and they might have good reason to complain, I'm not saying they don't, because once again, church leaders are sinners. Most of those people are not the ones to whom those leaders are accountable. There are those to whom they are accountable, and God himself has set up those, those means. So they are also set up for our salvation. That can be tough to hear sometimes, I think, but obedience really is a virtue. It really is. And if we only do what our church leaders say when we agree with them, then that's not obedience. It's not. You're actually just obeying yourself. And that's not obedience when you just do whatever you want. I mean, the way that the Bible describes a terrible anarchic situation is that everyone does what is right in his own eyes. It's all over the Book of Judges, right? So, yes, this is part one of two. And we'll get much deeper into a lot of these things and see how it works itself out as the story gets told in part two. Father Stephen parting shots."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8375.34,"end":8647.74,"speaker":"Fr Stephen De Young","text":"So sometimes I start these final thoughts by saying something shocking or bizarre sounding to get people's attention. I'm not going to do that tonight. Oh, liberalism is satanic. I don't mean liberalism like, you know, our 19th century German friends, liberal scholarship. I don't mean liberalism like political libs in the United States, as annoying as boomer libs are, or, you know, liberal parties in various other countries. I'm talking about classical liberalism. I'm talking about big L liberalism. I'm Talking about Renaissance humanism and Enlightenment rationalism straight from the devil. And because of that, a lot of y' all out there are wasting a lot of your time. All you out there on the we need to Save the west tour are wasting your time. Setting aside all my criticisms about whether there even is the west or, you know, whether that's even a thing, the present state of affairs in the United States and Western European countries is not some foreign thing coming in and destroying the greatness of the west or Western thought. It is the denouement. It is the flowering, the ultimate flowering of that tradition. And we got a lot of people, good people, people I like, people I'm friends with, people who are more famous than me and have more subscribers, who spent a lot of time working on this, seem to think if we could just roll back the clock 75 years or 100 years or 200 years, get back to that, then everything will be perfect. And you're Sisyphus, you're pushing the rock back up the hill and you're hoping this time tonight you'll get it to just the right equilibrium point where it won't roll right back down again. Even if you manage to push it up a little, it's just coming right back down. It's done because there's poison at the root of it. The poison at the root of it is the rejection of authority, which is as satanic as you get. It's as diabolical as you get the idea that if there's a God, he doesn't give any authority over me, to any other human, that I have authority over myself and my own life. As we said a little earlier in the episode, there's a way that seems right to a man, and its end is destruction. Our destruction is the devil's whole goal. And he's convinced us en masse, millions of people, that following the way that seems right to us, doing what seems right in our own eyes, reading and deciding everything for ourselves by our own lights, is the right thing to do, is freedom, is liberty, is precious. Don't you dare take away my rights to do what I want. This is just a lie. It's a lie from hell. The alternative is not to try to roll back the clock even further. I'm not saying, well, what we really need to do is go back to 1000 AD in the Byzantine Empire, because even if I thought that would solve the problem, it's not possible. That's not real world. But we need to come to the realization that part of what it's going to take to get through this life. Part of what it's going to take to find salvation is finding the institution and the people in this world to whom God has given authority to guide us, to direct us, to correct us when our way of understanding things is wrong. And then once we found those people, we submit ourselves to them and we obey them and not ourselves. We follow their wisdom and not our own. We follow the way of life laid out by that institution and, and not by ourselves and what seems right in our own eyes. There is no other way to live successfully as a human in God's creation. There is no other way to survive this life. There is no other way to make it to the kingdom of heaven than that. You are not the one person out there who will just get it, all right? You're not. I'm not. You're not that person. We need to follow the people to whom God has given the authority and come back next time. Because the end thrust I'm going to come back to this, the end thrust of what we're talking about next time. What's really going to be important about what we're going to talk about next time is that we're going to be talking about how you find that institution and those people who have that authority."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8649.18,"end":8678.43,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that's our show for tonight, everybody. Thanks for listening. If you didn't get through to us live, we'd still like to hear from you. You can email us at Lord of space spirits@ancientfaith.com you can message us at our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits if you have basic questions about Orthodox Christianity or you need help to find a parish in the 3D world, head over to OrthodoxIntro.org and join us for."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8678.43,"end":8689.04,"speaker":"Fr Stephen De Young","text":"Our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. Sooner or later or later your legs give way, you hit the ground. Save it for later. Don't run away and let me down."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8690.16,"end":8702.8,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page. You can join our big old discussion group and leave those ratings and those reviews so other people can connect to this podcast and share the show with a friend who is going to benefit from it."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8703.6,"end":8716.25,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancient faith.com support and help make sure we and lots of other AFR podcasters stay on the air. Sooner or later you'll hit the deck. You'll get found out. Save it for later. Don't run away and let me down. You let me down."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8716.81,"end":8718.97,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Good night. God bless you all."}
{"episode_id":"LOS - #119 - 2025-06-30 - Mosaic Succession","start":8720.01,"end":8757.22,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Fr. Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
