{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":0.96,"end":65.54,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free, free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Father Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":67.54,"end":173.87,"speaker":"Fr Andrew Stephen Damick","text":"Good evening, everyone. You are listening to the Lord of Spirits podcast as you heard the voice of Steve tell you just several times. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana. And I am Father Andrew Stephen Damick in Emmaus, Pennsylvania. And if you are listening to us live, you can call in at 8:55, AF radio. Again, that's 855-237-2346. And and Matushka Trudy, our engineer extraordinaire, will be taking your calls tonight, which we will get to in the second part of our show. So tonight we are talking about idolatry, the worship of false gods, especially as we see it described in the Bible. Now, we've addressed this many times on the podcast in other contexts, but tonight we're zeroing in on this question. Why? Because in context, it's a major part of what the Bible is responding to. And so it's part of how we can understand the gospel and what Christ's mission to us actually is. So where are we going to start? Well, first we're going to talk about that pesky question of whether the gods the pagans worship really even are a thing. Ask most modern people, including Christians, whether Zeus, Odin, Isis, etc are real, whether there really is any kind of spiritual being that pagans worship. And most are going to say no. These are made up stories to try to explain the existence of things like lightning and earthquakes. But how did ancient peoples actually see their gods? And more importantly to us Christians, how does the Bible understand these? And when will we ever discover the true nature of the blood feud? Father Stephen has with James Earl Jones. So, Father Stephen, is it actually true that all the gods of the nations are demons?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":176.01,"end":187.53,"speaker":"Fr Stephen De Young","text":"You know, a lot of people, they've been saying that our last episode, like, they really liked it. Yeah, like they. Some people were saying it was like the best episode we've done."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":187.69,"end":188.57,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":188.73,"end":198.17,"speaker":"Fr Stephen De Young","text":"I think it would be wise when we. When we start out tonight to let people know this one's not gonna be as good. I mean, it'll be solid, right? I mean, is it because I."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":198.17,"end":200.09,"speaker":"Fr Andrew Stephen Damick","text":"Cause I jinxed it with the James Earl Jones thing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":200.33,"end":204,"speaker":"Fr Stephen De Young","text":"No, it'll be right there in the pocket. But just know there's peaks and valleys, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":204,"end":204.56,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":204.56,"end":205.8,"speaker":"Fr Stephen De Young","text":"There's peaks and valleys."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":205.8,"end":207.44,"speaker":"Fr Andrew Stephen Damick","text":"Some have some low expectations to."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":207.44,"end":221.6,"speaker":"Fr Stephen De Young","text":"We. We can't get into this, like, recursive loop of always trying to one up ourselves. Like, that way lives madness. Right, so you think we should go ahead and do that? Well, when do we go live?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":222.16,"end":226.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Oh, oh, we're live now. Oh, that's right. Welcome, Lord."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":226.48,"end":235.14,"speaker":"Fr Stephen De Young","text":"Okay, okay. Yes, yeah. So all of the gods of the nations hold doctorates of ministry. Yes, that's what it says in the Bible."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":235.46,"end":238.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a clergy joke. That's a clergy joke, everybody."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":240.02,"end":242.98,"speaker":"Fr Stephen De Young","text":"Which is a subset of the dad joke."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":243.38,"end":244.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, that's true."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":246.42,"end":250.02,"speaker":"Fr Stephen De Young","text":"So we're gonna start there with where the Bible says that."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":250.66,"end":289.04,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah, it's exactly that. But yeah, yeah, right, right. The demons. Yeah. So Psalm 96 or 95, if you're looking the Greek numbering, verse 5, it simply says all the gods of the nations are demons. That's how it says it. If you're looking at a Greek, you know, translation from the Greek. But when it says in the Hebrew is usually something like all the gods of the nations are worthless. Although we're going to talk about some other translations of that. Right, so. Right, so what's going on there in the Hebrew and in the Greek?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":289.5,"end":344.39,"speaker":"Fr Stephen De Young","text":"Well, if you're reading the Douay Rheims, you've got the awesome. All the gods of the nations are devils. Yeah, that's right. 1. Upping it a little bit, but yeah, so it's very clear. In the Greek it's just demons. So there's a word there in Hebrew, and that word is roughly Eliel. And there's a bunch of things going on with how that word is used, not just here, but in a lot of places in the Old Testament where it's used in the same way. Strictly speaking, that word means like, worthless or useless or vain. And it's used in a Couple of different contexts. It's used as an adjective particularly to describe physicians, shepherds, and oracles, which, I mean."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":344.39,"end":353.97,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so physicians and oracles do tend to be kind of within a similar category in the ancient, ancient world. But like, shepherds, I mean, they're not."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":354.53,"end":361.09,"speaker":"Fr Stephen De Young","text":"Yeah, I guess it's authority figures, maybe. Authorities who aren't, who are kind of worthless. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":361.09,"end":368.53,"speaker":"Fr Andrew Stephen Damick","text":"But it's. Yeah, so it's kind of like quacks, frauds, garbage, you know? Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":369.41,"end":376.29,"speaker":"Fr Stephen De Young","text":"And so it's used as a noun often to refer to false gods in particular."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":377.33,"end":379.57,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so the worthless ones."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":380.05,"end":394.77,"speaker":"Fr Stephen De Young","text":"Right. And the reason why that tends to get applied to gods is that there's a little bit of a pun going on with the plural of gods is elim, and elil is close. Right, so you're elim are elil."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":397.17,"end":398.69,"speaker":"Fr Andrew Stephen Damick","text":"That's pretty funny in Hebrew."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":398.93,"end":418.29,"speaker":"Fr Stephen De Young","text":"Yes, yes. It flows better off the tongue than it just did for me, if your tongue is more used to Hebrew. And so this would be used Right. Wherever we're in a quote unquote, polytheistic context. So this would be used to describe, you know, the other guy's gods."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":418.61,"end":419.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":419.01,"end":419.29,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":419.29,"end":420.37,"speaker":"Fr Andrew Stephen Damick","text":"Your gods are garbage."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":420.77,"end":452.86,"speaker":"Fr Stephen De Young","text":"Yeah. So that trash talk before battle is not limited to, you know, your army's no good and your mother is a hamster and your father smells of elderberries. But also to your gods, there's an example of that. Probably the best example of that is Sennacherib in. In the Old Testament, where he shows up and says, you know, don't bother praying to your gods because all of the other cities we just destroyed, they prayed to their gods too. Right. And. And so your gods stink. Ours are awesome. And so just surrender. Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":453.1,"end":471.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you see this kind of thing with. With Pharaoh. Right. With. With the, you know, when. When the Hebrews come to him and. And say, you know, we want to go worship Yahweh, and he's like, the God of slaves. Hello. You know, there is, like, this is a. This is totally a thing in the ancient world making fun of other people's gods."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":471.33,"end":494.42,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. So especially if you're very confident in your own. That's. So the thing is, anybody who's listening to this and who has gone and looked at their local English Bible, that's not the orthodox study Bible, probably saw it saying something like, all the gods of the nations are idols."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":495.14,"end":495.54,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":497.86,"end":500.1,"speaker":"Fr Stephen De Young","text":"And you may be wondering, well, how'd they get that?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":501.14,"end":507.06,"speaker":"Fr Andrew Stephen Damick","text":"Right? Because it's not. Idols is not literally a translation of either the Hebrew or the Greek."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":507.46,"end":524.87,"speaker":"Fr Stephen De Young","text":"Right, right. And so the answer is you can't get there directly from the text. You have to insert another presupposition. Right. You have to assume that the idea of the gods being worthless means that they don't exist."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":526.07,"end":540.71,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there's the idea then that they're saying that all the gods and the nations are idols. It's basically saying that the center of their religion is really just this physical object in front of them that's in their temple or their shrine or whatever."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":542.47,"end":567.35,"speaker":"Fr Stephen De Young","text":"Right, right. But the problem with that assumption is, for example, that kind of makes hash of the rest of the ways the word is used. Right. So like you pay a doctor to cure something and he fails and you say you don't exist, you're just a rock. Yeah, right. That doesn't make a whole lot of sense. Right. Likewise, you hire a shepherd, he loses all your sheep. Yeah, that doesn't exist."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":567.43,"end":574.93,"speaker":"Fr Andrew Stephen Damick","text":"There's a lot of ways to be worthless that in fact most ways to be worthless do not involve not actually existing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":575.17,"end":587.41,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. Now it is true that a non existent physician would be pretty worthless, but that doesn't mean a worthless physician does not exist. By reversing the syllogism."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":587.89,"end":602.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And it's, it's so, it's fun. It's interesting to look at how this gets translated. And you know, someone actually wrote in and said that they want more of a, you know, Father Andrew's Etymology and Ancient English corner. So here it is."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":602.16,"end":605.36,"speaker":"Fr Stephen De Young","text":"We need theme music. Yeah, I know, like Diddy on the."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":605.36,"end":729.27,"speaker":"Fr Andrew Stephen Damick","text":"Zither or something in the background. Before this. Actually, actually it was a parishioner. It wasn't someone who wrote it, now that I remember, it was a parishioner here in Emmaus, actually. So, so, yeah, right. So I looked this up just to see, okay, how were, how was this line translated in Old English. Right. Just as a witness to how very early English Christians would have understood this particular word. And so there is a psalter called the Paris Psalter and it includes a whole bunch of. And actually, I don't know off the top of my head why it's called the Paris Psalter but has a bunch of Old English in it. But it does, probably because that's where the manuscript was found or something like that, because that's the way it goes. Like another major Old English manuscript is called the Vercelli Book, which again, that's not an Anglo Saxon name. But anyway, so the peristalter has translations of. I think it's most of the Psalms, and the translator rendered them into Anglo Saxon alliterative verse. And so. Which is great. It reads very beautifully. So anyways, this particular line goes like this. So in English, it's for all the gods. The nations are demons or are worthless. This is how it says in Old English. Sindon eala havnu goda, Hilda devil, which basically means sense or because all. And it uses the word havu, which is the, you know, the. The ancestor of a word, heathen. So all the heathen gods, and then it uses this word Hilda devil. So Deelville is the origin of our word devil. But it seems to be all the gods of the heathen are hill devils. So there's this notion that they're kind of like hillbilly demons or demons that hang around hills or mountains, that kind of thing. So there you go. Father Andrews, etymology and Ancient English Corner."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":729.67,"end":738.35,"speaker":"Fr Stephen De Young","text":"Play theme music Somewhere in Sweden, there's a former listener named Hilda Deofel who's deeply insulted. Deeply insulted."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":738.82,"end":747.22,"speaker":"Fr Andrew Stephen Damick","text":"Well, sorry, write in. Let us. Yeah, let us know your story. So, yeah, hill devils. Hill devils."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":748.18,"end":764.8,"speaker":"Fr Stephen De Young","text":"So that's probably the, you know, if we want to talk about a locus classicus of all the gods of the nations are demons. That's it. But there are a couple of other places that say the same thing. This isn't just one isolated verse in a psalm. Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":764.8,"end":765.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":766.08,"end":781.92,"speaker":"Fr Stephen De Young","text":"So First Corinthians 10, verse 20. St. Paul is talking about the pagan sacrifices going on in Corinth and why the Corinthian Christians should stay away from them. And he says what? The nations sacrifice, they sacrifice to demons and not to God."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":782.72,"end":783.48,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":783.48,"end":793.05,"speaker":"Fr Stephen De Young","text":"So he doesn't say they sacrifice to idols or to Nothing. Nothing to fictional characters. Right. But to. To demons."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":793.53,"end":821.38,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep, yep. Yeah. And so then there's another one. Deuteronomy 32, 17. This is interesting, especially if you look at the actual Hebrew word that's here, which is different from that word, worthless. Elim. This one says they sacrificed to demons, not to God, to gods they did not know. To new gods, new arrivals that your fathers did not fear. So what's the word for demons there in the Hebrew? There?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":821.86,"end":864.57,"speaker":"Fr Stephen De Young","text":"Yeah. So in the Hebrew there. Right, it's demons. Of course, in the Greek. But the Hebrew has this word, shedim, which we've commented before that Deuteronomy 32 is one of the really old and difficult to read parts of the Torah in terms of. There's been no sort of editing or updating of the language at all. And that particular word is actually a Babylonian Loan word, it looks like, because the word shedu in Babylonian refers to a sort of territorial spirit, a spirit that's in charge of an area."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":865.37,"end":871.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. The technical term in English is tutelary spirit. Tutelary, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":871.37,"end":877.04,"speaker":"Fr Stephen De Young","text":"Not to be confused with tudy from Facts of Life. Jim Fields has nothing to do with this."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":877.44,"end":886.88,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I was, I did not see that coming. That was good. So, well, you know, with these, with these references you make, I, I, I take the good and the bad."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":887.2,"end":889.04,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, there you have it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":889.28,"end":890.6,"speaker":"Fr Andrew Stephen Damick","text":"That was, that was pretty lame."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":890.6,"end":895.28,"speaker":"Fr Stephen De Young","text":"But anyway, so that was kind of bad. I know, but I'm sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":895.28,"end":895.92,"speaker":"Fr Andrew Stephen Damick","text":"I'm sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":896.4,"end":985.34,"speaker":"Fr Stephen De Young","text":"So, and we were talking about an area, right. Like a territory. In this case, we're talking about a, like a geographical feature. Right. Like a valley, a grove, a cave, a hill, a mountain. Not, not like, when we hear the word territory, we tend to think of like lines drawn on a map. So it's not so much like that as a place arrange, you know, a place naturally considered. Right, right. So, yeah, so those are, those are three sort of, if you want proof texts for the gods of the nations being demons. There's three of them. But we want to, we want to go a little deeper this. Because where we're heading tonight is building off of. We talked about this a little bit last time, sort of in passing as we went. But how exactly idolatry works and what it is and what it isn'. And so we have to start out by kind of defining who the beings are who stand behind the idolatry, who the gods are who are being worshipped with these idols. So we have to set the Wayback Machine and rotate back a little bit to some things we talked about way back in the long ago time at the beginning of the podcast, 100 or so hours ago."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":987.42,"end":1008.86,"speaker":"Fr Andrew Stephen Damick","text":"I think that's about true now, almost. This is episode 36. And we tend to go, I don't know, we might not be at 100 hours yet, but we're definitely over 75 or so. Yeah, yeah, yeah, yeah. So, I mean, we covered this, like in the very first, I think it might be the very first episode, actually. Back before we got you a really good Internet connection."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1008.86,"end":1015.82,"speaker":"Fr Stephen De Young","text":"Yeah, exactly. So probably half of this got lost into the ether as I was, like running through my house trying to reconnect to the Internet."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1017.3,"end":1018.26,"speaker":"Fr Andrew Stephen Damick","text":"Good times, good times."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1018.26,"end":1022.66,"speaker":"Fr Stephen De Young","text":"Frantically. Last exercise I got. So really, you know."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1024.98,"end":1040.02,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so monotheism, right? Yeah, that's the word that usually people throw out, like Christianity is monotheist. So that means, of course, these other Gods don't exist. Why do you keep saying these other gods exist? Apart from the fact that the Bible says that they exist."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1040.82,"end":1092.58,"speaker":"Fr Stephen De Young","text":"Right, right. And so as we said way back in the long ago time, the whole idea of monotheism is a bit naff. These categories. Well, monotheism in particular, I should say is a term that comes into being in the 17th century. So we have to keep reminding people of that. It didn't exist before that, and there's no reason why it shouldn't have existed before that because it's based on Greek Monos and theos both existed as Greek words. Right, right, sure. But the church fathers, for example, never call themselves monotheists. They do refer to the pagans as polytheists, but they don't call themselves monotheists ever. This is something."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1092.66,"end":1094.5,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting. Yeah, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1094.58,"end":1130.79,"speaker":"Fr Stephen De Young","text":"In the, in the 17th century this term is coined. And this is, you know, we're revving up to our German friends, right. This is post enlightenment. We like to do taxonomy. We like to group things in categories. Right. And then once we've got them grouped into categories, we construct our evolutionary flowchart. Right. Of which are better and which are worse. And the modern German ones are always the best ones, if you're asking them. But so monotheism gets created as this category as a way to sort of lump together Judaism and Christianity and Islam."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1131.03,"end":1131.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1131.59,"end":1145.15,"speaker":"Fr Stephen De Young","text":"And later on, Sikhism and a couple other things. Right. Get, get thrown in, thrown in the side and then that is over against then polytheism, which is the belief that."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1145.15,"end":1153.58,"speaker":"Fr Andrew Stephen Damick","text":"Many gods exist, exist and, and should be worshiped. I mean, that usually. Yeah, yeah, right, right, right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1153.58,"end":1159.58,"speaker":"Fr Stephen De Young","text":"And then within polytheism there are all of these distinctions that can be made. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1159.58,"end":1170.86,"speaker":"Fr Andrew Stephen Damick","text":"Like there's henotheism, which is kind of the idea that there's lots of gods out there that, that, that are worthy of worship. But this is the one we worship here. This is our local guy."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1171.02,"end":1172.62,"speaker":"Fr Stephen De Young","text":"And he's the boss."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1172.62,"end":1174.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1174.62,"end":1178.06,"speaker":"Fr Stephen De Young","text":"And he's the boss. But who's the boss can change, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1178.06,"end":1194.82,"speaker":"Fr Andrew Stephen Damick","text":"You know, if there's a conquest or. Yeah. And then that's how you, that's how you actually get then empires that worship fully polytheistically with lots of temples to lots of gods is essentially, it's a kind of conquest game, you know, where you start to group them together."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1195.62,"end":1212.58,"speaker":"Fr Stephen De Young","text":"Right, right. And yeah, we have, I think we commented this a little last time, but we have this idea in our head that there was some kind of Greek religion that all the Greeks had or Roman religion that all the Romans had. Yeah. Where they had this pantheon of gods that was like the Justice League and they all had these 12 members."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1213.78,"end":1275.62,"speaker":"Fr Andrew Stephen Damick","text":"Right. It was a collect a collection and, and, and not even collected the same everywhere. Like if you lived in a place like, like if you think of it more like these are my favorite restaurants, you know. Sure, we all have a McDonald's, you know, but, but I really love this local, you know, burger. This other burger place, you know, I don't know that's. It's maybe not the best analogies, but what it's come up, what I'm come up with right now. And you would go to a particular temple because the God there was associated with something that you wanted some kind of success in. And so you would go, I don't want to get too far ahead of ourselves here. But you would, you know, you would go essentially like, oh, you know, like, you know, like, I feel like Italian tonight. Or like, hey, I really need to defeat my enemies tonight. So let's go and worship at worship Aries, you know, or hey, I need a love potion. I want to seduce my neighbor's wife. So I'm going to go to the shrine to Aphrodite and offer her a sacrifice there, which there happens to be."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1275.62,"end":1282.7,"speaker":"Fr Stephen De Young","text":"One in town even that is very late in Roman though. That's sort of a function of what."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1282.7,"end":1283.74,"speaker":"Fr Andrew Stephen Damick","text":"Sort of topical approach."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1283.74,"end":1288.5,"speaker":"Fr Stephen De Young","text":"Yeah, well, because the Roman Empire becomes very cosmopolitan."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1288.82,"end":1289.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1290.5,"end":1296.18,"speaker":"Fr Stephen De Young","text":"So I mean, at the Ur layer, right. Each Greek city state is worshiping two, three gods."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1296.97,"end":1297.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1297.13,"end":1345.22,"speaker":"Fr Stephen De Young","text":"The ones that are local to them, they're local gods. And then as they make treaties and form alliances, right. You start getting crossover and that kind of thing where. And then once you get to Rome, Rome, very similar to the United States liked to sort of take and great value wise all the cultures they encountered. Right. And just kind of incorporate, incorporate like a watered down version of whatever. So we're gonna. Oh, Egyptian religion. This is interesting. Let's incorporate a watered down version into, you know, Roman religion. So. Yeah. So once you get to Rome. Yes, it's very cosmopolitan as St Paul notices when he's going into Athens. He sees all of the, you know."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1345.38,"end":1355.18,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which I mean, which is interesting. I mean it's a development even in Athens. I mean Athens, the name in Greek is Athena because Athena is their goddess traditionally."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1355.18,"end":1359.34,"speaker":"Fr Stephen De Young","text":"Right, right. Athena and Hephaestus are the originals for Athens."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1359.82,"end":1360.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1360.18,"end":1402.87,"speaker":"Fr Stephen De Young","text":"Everybody else shows up later, but yeah, so that's an example. All that we just went through is an example of the fact that these terms like polytheism and henotheism don't really capture any actual existing religion, Right. It's the problem with doing these kind of taxonomies in these categories, right. I mean, even just saying monotheism and then lumping together Judaism, Christianity and Islam, let alone Sikhism, Right. Like, there's a lot more differences there in a lot of ways, right. Then you're giving credit for."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1403.73,"end":1403.97,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1405.65,"end":1441.58,"speaker":"Fr Stephen De Young","text":"And so those categories are even less than useful, right. In the first place. Right? Like, they don't serve a very good purpose in the first place, but then they get kind of turned around and used as cudgels, Right? Like the whole Muslim apologetic against Christianity is you guys aren't really monotheists. And the best response to that, I think, is who cares? Right? Like, yes, you can construct a category, monotheism, and you can construct it in such a way that it doesn't apply to me. So what?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1442.3,"end":1442.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1444.3,"end":1452.94,"speaker":"Fr Stephen De Young","text":"Like that, that doesn't mean anything in reality, Right. That's just you constructing a label and then pointing out that your label doesn't apply to me."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1454.06,"end":1454.46,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1456.38,"end":1479.5,"speaker":"Fr Stephen De Young","text":"So I think we've even said in the past that probably the closest word for what you actually see in the scriptures, for example, would be what's commanded in the scriptures, I should say, not what Israel actually practices, but what is commanded to the scriptures would be something more like monolatry, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1479.5,"end":1499.95,"speaker":"Fr Andrew Stephen Damick","text":"Which literally just means worshiping one. But of course, you know, as you said, it's closest. It doesn't exactly totally encompass what it is God is telling the people of Israel to do within the context of what they believe about the spiritual world that they live in, Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1499.95,"end":1500.35,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1501.47,"end":1501.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1502.03,"end":1520.53,"speaker":"Fr Stephen De Young","text":"Because this isn't an issue of just like Yahweh is Israel's God, and so he wants them to just worship him and not the other ones, even though the other ones exist. It's an issue of Yahweh, the God of Israel is in a completely different category than all the other gods, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1520.53,"end":1532.05,"speaker":"Fr Andrew Stephen Damick","text":"Thus the, I don't know, gazillion times in Scripture when it says, you know, who among the gods is like unto thou, O Lord? Or, you know, like, there's so many comparisons like this. I mean, it's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1532.05,"end":1541.05,"speaker":"Fr Stephen De Young","text":"There is none beside me. There's none besides, meaning there's nobody on my level, right? Plenty beneath me, but there's none beside me, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1541.05,"end":1566.29,"speaker":"Fr Andrew Stephen Damick","text":"And even in the line where it says, you know, I am, I'm trying to remember where it is, but it says something like, I am God, and before me There is no other. And after me there will be no other. Doesn't mean that none existed and none will exist. It means that he's the only God who is truly God in the sense of being, you know, as this word means in the ancient world, a ruler, the true ruler."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1566.9,"end":1567.38,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1567.78,"end":1574.98,"speaker":"Fr Andrew Stephen Damick","text":"The rest are around, but they don't actually qualify to be what it is that Yahweh, the God of Israel, they're."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1574.98,"end":1581.14,"speaker":"Fr Stephen De Young","text":"Not in his category. They're in another category beneath him. Because they're spiritual beings created by him."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1581.14,"end":1582.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're created things."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1582.82,"end":1590.26,"speaker":"Fr Stephen De Young","text":"And that before me, there was no, after me is actually, it's in Isaiah. It's attacking the idea of the succession myth."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1590.66,"end":1591.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1592.64,"end":1604.52,"speaker":"Fr Stephen De Young","text":"Like, unlike Marduk, Marduk didn't claim to have always been the most high God. There's a story about how he became the most high God. And hypothetically, someone could come afterwards and overthrow Marduk and become the most high God."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1604.52,"end":1607.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Same thing with Zeus, you know. Yeah, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1607.92,"end":1621.5,"speaker":"Fr Stephen De Young","text":"There's a succession. So that was, that was the God of Israel pointing to yet another one of those differences between his category and theirs, which is there's, there's no turnover in his category because no one to do the turning over."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1621.82,"end":1629.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not a. It's just not a thing. He's. He's God. There's, there's no, you know, there's no contest."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1630.62,"end":1630.94,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1630.94,"end":1631.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1631.34,"end":1661.62,"speaker":"Fr Stephen De Young","text":"And so you see reflected both in scripture and outside of scripture, within paganism, this idea that the spiritual world is tiered. Right. That not all divine beings or spirits or gods, and scripture uses all those terms. They're not all on the same level, even if you're a pagan. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1662.34,"end":1662.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1662.74,"end":1670.9,"speaker":"Fr Stephen De Young","text":"So it's not that the pagans were like, super egalitarian about the spiritual world and Jews were just super hierarchical."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1672.33,"end":1714.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. There's even, you know, even, even before you get these worked out pantheons. Right. With a, with, you know, sort of a clearer hierarchy, there's still. Almost everybody has a sense of, okay, there are sort of big gods and little gods. You know, there's the God that we worship at the temple in the center of town, and then there's the God that's out at the, the tree, you know, that I, that I go to once in a while. Right. And, and, and they're understood to be on different levels. And you eventually get the sense that the way that it's described is as if they're sort of related. Like this lesser one is a son of the greater one or a Daughter."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1715.49,"end":1779.72,"speaker":"Fr Stephen De Young","text":"Right. So they know the difference between Poseidon and a Naiad. Right. And they know, Right. Oh, there's a spirit of this river. And they would say it's related in a way to Poseidon. Right. Who's out there? The ocean. Right. The sea. But they, they're not on a plane. And that, that genealogy element is what is typically used in, in all of these pagan stories. In order to connote this idea of tears and relations, we tend to take it very woodenly, literally. Right, right. And it's not that those pagan gods weren't running around fornicating. I mean, they are in all the stories at least. But it wasn't primarily about constructing a family tree. It was about the idea of conveying, hierarchy, of conveying, you know, this, this tier level. Because of course, a son or a daughter is less than in the ancient world, their father or mother, because they're derived from them."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1780.36,"end":1810.61,"speaker":"Fr Andrew Stephen Damick","text":"Right, Yeah. I mean, that's just a huge piece of what the culture is like. Which is the basis for when Jesus quotes Psalm 110, right. Where he says, you know, the Lord said to my Lord. How could David call him Lord if he is his son? Because everyone understands that sons are not the lords of their fathers. It always goes the other way. But of course, in Christ's case, he is the Lord of his father David, because he's God."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1811.89,"end":1822.73,"speaker":"Fr Stephen De Young","text":"Right, right. And you can see this in the pagan settings. You know, Ares, God of war, has kids like Eris, who's Strife, you know."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1822.73,"end":1823.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1823.33,"end":1826.61,"speaker":"Fr Stephen De Young","text":"Strife is sort of low level. Right. War."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1826.77,"end":1827.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1827.09,"end":1828.77,"speaker":"Fr Stephen De Young","text":"And then Phobos. It's fear."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1828.85,"end":1829.33,"speaker":"Fr Andrew Stephen Damick","text":"Fear."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1829.57,"end":1905.72,"speaker":"Fr Stephen De Young","text":"Right. It's sort of. All right. And so you can, you can see how this works in that sense. Right. So it's, it's not so much like. No, no, we've researched this, you know, lineage of, of demonic powers, but that it's this idea of derivation and subsidiarity. Right, right. To, to the more sort of powerful spirit. And so that kind of gets in different cultures, those, that idea of tiers or categories or types or qualities of these gods and divine beings sort of plays out in different ways. Right. We're given one model basically by the Scriptures and by the Israelite and Second Temple Jewish tradition. And then we're going to go through that in a second. And once we do, then when you compare that to the pagan schema, we'll see there's continuities and discontinuities, but that the core ideas are there and as we've seen over and over again, are sort of being corrected by the. The biblical model by the prophets."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1905.72,"end":1940.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And this feeds into one of the main themes of this podcast, which is that ancient peoples are largely all describing the same experience of the spiritual world, but they have different takes on it. Right. They have different ways of interpreting and understanding and telling the stories about it. And a lot of. As you said, a lot of what the Bible is doing is saying, no, no, this is the truth. Right. And because we're Christians, we believe what the Bible says about these spiritual beings and not the stories that are being told within. Within paganism."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1940.58,"end":1963.17,"speaker":"Fr Stephen De Young","text":"Right. That. That's the. The correct story. Right. The story that's the way to understand the spiritual world correctly. And so this is, again, a little bit of review, I think, but it's from some early episodes, so it's worth. It's worth doing. Again, as much as we tell people to go back and listen in order, it's getting mean at this point."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1964.13,"end":1965.73,"speaker":"Fr Andrew Stephen Damick","text":"It's worth it. Binge it, people."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1968.69,"end":1972.69,"speaker":"Fr Stephen De Young","text":"Are you getting kickbacks or something, Bandwidth Charleston?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1973.17,"end":1974.37,"speaker":"Fr Andrew Stephen Damick","text":"That's an idea. I don't know."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1975.41,"end":1995.97,"speaker":"Fr Stephen De Young","text":"So in sort of the Hebrew bottles we've talked about before, so you've got these. If we accept the devil himself. Right. And various devil figures we talked about before, you've got basically."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1995.97,"end":1997.05,"speaker":"Fr Andrew Stephen Damick","text":"Set those aside for a second."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":1997.44,"end":2000.96,"speaker":"Fr Stephen De Young","text":"Yeah. You got basically three categories of what could be called demons."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2001.76,"end":2010.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right. So, yeah, number one is. Is the one that, you know, everybody always gets the most excited about. Watchers."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2010.64,"end":2015.68,"speaker":"Fr Stephen De Young","text":"Yeah, Well, I don't know. We're gonna get to giants. People get excited when we talk about giants."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2015.68,"end":2016.8,"speaker":"Fr Andrew Stephen Damick","text":"It's true. But they're related."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2017.44,"end":2018.96,"speaker":"Fr Stephen De Young","text":"Yeah, they're related."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2020.88,"end":2031.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Indeed. Indeed. Right, yeah. The watchers. So this is the biblical model. The watchers are these spirits that get imprisoned in the abyss."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2031.63,"end":2038.11,"speaker":"Fr Stephen De Young","text":"Right. So this is. Watchers is the term that's used in First Enoch, in the Book of Enoch. It's also used in Daniel."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2038.51,"end":2038.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2039.79,"end":2057.01,"speaker":"Fr Stephen De Young","text":"And these are the angelic beings who get involved with Cain's line to teach them, you know, things like metallurgy, teach them secrets. Right. Secret knowledge that they don't have that they intend for them to use to destroy themselves."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2057.81,"end":2058.21,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2059.33,"end":2094,"speaker":"Fr Stephen De Young","text":"And so those rebellious angels, according to St. Jude's epistle second Peter, very clearly are imprisoned in the abyss, or Tartarus, if we're talking about Second Peter. Tartarus will show up again in a minute. But those are. The abyss is more the ancient Near Eastern language, where, like, the Apkallu and the Babylonian version of this story are in prison. But so they're. They're in prison. They're awaiting sort of the Day of Judgment."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2094.56,"end":2094.96,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2095.76,"end":2108.44,"speaker":"Fr Stephen De Young","text":"Then you've got. Right. That relationship that they have with Cain's line. And then going forward after the Flood produces the Nephilim. Produces the giants."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2108.84,"end":2112.36,"speaker":"Fr Andrew Stephen Damick","text":"Right, yes. Which are also called unclean spirits."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2112.68,"end":2114.08,"speaker":"Fr Stephen De Young","text":"Well, once they die. Yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2114.08,"end":2195,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, after that. Yeah, exactly. After they die. And. And the reason that they're called unclean spirits is if you look closely at especially Leviticus, then you'll see that things that are mixed together that ought not be. Which is a whole category, you know, a whole bunch of different stuff. Right. But things that are mixed together or touching together, that should not be kind of unholy. Hybrids are regarded as unclean. And the idea with these dead giants, these dead Nephilim, is that they are in some way a mixing together of the Watchers and humanity. And no, we're not saying it's a genetic DNA mixing. No, we're not saying that the Watchers have physical bodies that they can biologically reproduce with. Go back and listen to the giants. Episode. Episode. But. But nonetheless, they are called unclean spirits because there is in some way this sort of mixing, this hybridization going on between these evil spirits and human beings. And. And then these are the. The. The dead disembodied souls of these. These beings. So these. I mean, so these are humans, right? The unclean spirits are human spirits."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2195.24,"end":2198.44,"speaker":"Fr Stephen De Young","text":"Yeah, well, dead, demonized humans. Yeah, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2198.44,"end":2201.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right. Not just any human spirits. They're. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2201.36,"end":2208.28,"speaker":"Fr Stephen De Young","text":"They're that. That unclean mixture, like one of those new Reese's peanut butter cups with a potato chip in it. Like, why would you do that?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2208.28,"end":2209.24,"speaker":"Fr Andrew Stephen Damick","text":"Is that really a thing?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2209.48,"end":2209.96,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2210.12,"end":2214.76,"speaker":"Fr Andrew Stephen Damick","text":"I recently got the white chocolate ones, and I thought they were rather good and not too far off, but."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2215.08,"end":2216.92,"speaker":"Fr Stephen De Young","text":"Potato chip, that's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2217.26,"end":2217.82,"speaker":"Fr Andrew Stephen Damick","text":"That ain't right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2217.82,"end":2226.06,"speaker":"Fr Stephen De Young","text":"Potato chip. Yeah, yeah. Some of the Dead Sea Scrolls actually call them spirits of illegitimate birth. I don't think I could say the other word."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2226.22,"end":2226.86,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2226.86,"end":2229.66,"speaker":"Fr Stephen De Young","text":"For that. On the potato chip thing. But."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2229.66,"end":2229.98,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2231.1,"end":2236.54,"speaker":"Fr Stephen De Young","text":"Yeah, that. Henceforth, no. Right. And so that's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2236.54,"end":2240.06,"speaker":"Fr Andrew Stephen Damick","text":"You got Watcher in my humanity. You got humanity in my watch. Sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2241.58,"end":2279.71,"speaker":"Fr Stephen De Young","text":"As we. As we said before the go to place on that, these are the demons who we see being cast out in the Synoptic Gospels, for example, and in the Book of Acts. And a go to place on that. It's. The guy's doctoral dissertation is the Origin of Evil Spirits by Archie Wright. Not Cary Grant, but Archie Wright. And you could. You could read all he did all it has all the sources that that's, that's just what people in the first century B.C. in the first century A.D. thought demons were."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2280.51,"end":2280.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2281.31,"end":2292.75,"speaker":"Fr Stephen De Young","text":"It's pretty conclusive on that level. So that's another character. Now, most of those are also imprisoned in the abyss, but there are some that are still sort of roaming around the world."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2293.23,"end":2312.57,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah. Which if you read Jubilees, you get that story, right? How 90% get tossed. Yeah. With mask. 90% get tossed in the abyss. 10% are allowed to roam the world afflicting the wicked. And God lets them do it, basically to bring the wicked to repentance."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2312.89,"end":2313.21,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2313.21,"end":2314.49,"speaker":"Fr Andrew Stephen Damick","text":"That. That includes us."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2314.81,"end":2340.9,"speaker":"Fr Stephen De Young","text":"Right. And that's. And that idea is what St. Paul's talking about when he talks about excommunicating someone and handing them over to Satan for the destruction of their body and the salvation of their soul is. He's alluding to that idea, that concept of why the demons are out there. And so these are. These unclean spirits are bodiless, and these are the ones who are going, as we just mentioned, to go around possessing people."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2342.82,"end":2343.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2343.54,"end":2364.95,"speaker":"Fr Stephen De Young","text":"Both in the context of like, the demonic possessions we see in scripture and also the context of like oracles among the nations. And they also are going to then go into constructed bodies. Because we're heading towards idolatry here."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2365.03,"end":2369.83,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Yep, yep. Yeah, Go ahead."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2370.07,"end":2379.75,"speaker":"Fr Stephen De Young","text":"The third category in the biblical model are the gods of the nations proper. Right. So like the gods of Egypt who get judged at the Passover."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2380.56,"end":2380.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2381.36,"end":2426.17,"speaker":"Fr Stephen De Young","text":"Or the gods of the Romans, the gods of the Babylonians. You know, pick your nation. These are the angelic beings from the Tower of Babel story who are placed over the nations. The princes who Daniel talks about, the prince of Persia, the prince of Greece, the powers and principalities that St. Paul talks about, which he talks about being in the heavenly places. The angels who gather on the left in the divine council, according to St. Gregory the Great in the sixth century in his Borlia, these are those gods, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2426.25,"end":2434.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they're angels that God had put over the nations who fell by accepting worship for themselves."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2435.5,"end":2465.83,"speaker":"Fr Stephen De Young","text":"Right, right. And so you may have noticed right there with those last two groups that if you have one of the demons in that unclean spirit category in an idol, but that idol is of one of these gods of the nations that they're working in, sort of working in tandem. Right. Like they're working together. And you find exactly this in Second Temple Jewish sources."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2467.03,"end":2481.67,"speaker":"Fr Andrew Stephen Damick","text":"Right. So there's this idea that, that a pagan might be bowing down to a Statue of Zeus, and yet it's some dead Nephilim jumping in there and actually engaging with the pagan."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2482.23,"end":2501.41,"speaker":"Fr Stephen De Young","text":"Right, right. And this is the place where this comes up usually in second Temple Jewish writings and even in some early Christian writings is they're talking about. I was going to say hero worship, but technically, in the Greek and Roman context, that's a different thing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2502.69,"end":2503.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2503.73,"end":2505.65,"speaker":"Fr Stephen De Young","text":"Because there literally was hero worship."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2505.81,"end":2506.53,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2506.53,"end":2552.54,"speaker":"Fr Stephen De Young","text":"But, you know, someone goes and leaves an offering before a statue of some general who just died in a war. Right, right. And so the question arose, well, wait, like, is that really idolatry? Because we know that's. That's just some guy who just died and it's just sort of a nice gesture. Right, right. Or various forms of things that we would call like ancestor worship. Right. And you know, dad, Grandpa, Great grandpa wasn't necessarily a Nephilim, hopefully. Right. But what you find in those second Temple Jewish and early Christian sources is that when those kind of things happen, there's sort of a demon ready, one of the unclean spirits ready to sort of swoop in and get in between. Right. And sort of intercept."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2553.02,"end":2563.34,"speaker":"Fr Andrew Stephen Damick","text":"Right. We don't have to necessarily believe the story that the pagan is telling about what's happening because, you know, demons are liars and happy to deceive them."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2563.5,"end":2585.7,"speaker":"Fr Stephen De Young","text":"Right, right. And so, yeah, any chance they get, they're happy to dart in there and take advantage of it. But so those three categories, in broad strokes, just to use the Greek traditions as an example. Right. The pagan Greek traditions, because they're more familiar to most people, you find those same categories."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2586.34,"end":2618.26,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So this is interesting. This is one of these places like we keep talking about to say that people in the ancient world are largely all talking about the same things, just kind of in different ways. And often one of the ways that you see this playing out is they are all having experiences of these kind of categories of spirits. Roughly, they have different stories about how they got to be what they are and all that kind of stuff and how you should interact with them. But it's still basically the same kind of categories."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2619.06,"end":2624.34,"speaker":"Fr Stephen De Young","text":"But those stories connect and interact with each other also."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2624.74,"end":2625.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2625.14,"end":2658.4,"speaker":"Fr Stephen De Young","text":"Because they're living in the same physical world and the same spiritual world. Right. And so there are these intersections. Right. So for example, in. In the Greek stories, you have the Titans and Prometheus. Right. Who are these sort of ancient class of gods? Prometheus is an especially good example, but there's a few other Titans who do similar things and face a similar fate. They give knowledge to man that man is not supposed to have. Right, right. And they are punished by being imprisoned in Tartarus."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2658.72,"end":2676.54,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which is just a directly parallel and pretty much exactly the same story as what the Bible says about the watchers. You know, like Prometheus. For those of you who maybe it's a long time since you read Greek mythology, Prometheus is the one who gives fire to human beings and then he."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2676.54,"end":2678.34,"speaker":"Fr Stephen De Young","text":"Gets his liver pecked out by a vulture."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2678.58,"end":2685.3,"speaker":"Fr Andrew Stephen Damick","text":"Yes. I think every day. Because it grows back. Yes, lovely. Because he's changed to the side of a rock. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2685.94,"end":2710.12,"speaker":"Fr Stephen De Young","text":"Never let it be said that the Greek gods aren't creative in their punishments, but. Yeah. So imprisoned in Tartarus. And this isn't just Father Stephen and Father Andrew now saying, hey, look at these two ancient stories. Aren't they kind of similar? As I mentioned before, St. Peter talks about the angels who sinned in the time of Noah and got imprisoned in Tartarus."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2710.44,"end":2713.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's literally the word he uses is Tartarus in Greek."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2713.4,"end":2782.44,"speaker":"Fr Stephen De Young","text":"So he pulls these two stories together, he connects them. Right. This isn't some new model thing. This happens in the New Testament. So they have that category. They have. Obviously they believe in spirits that inhabit idols. They do the ritual. Right. For that to happen. They have oracles, the oracle at Delphi being the most famous one, who they believe is possessed by Apollo. Right. They have phenomena of demon possession. You know, Socrates says he's possessed of a demon. Kings and stuff have a demon or a genius once we get to the Roman period. And so this is a phenomena that they experience as well. These spirits are sort of a different category of spirits. Right. Than the Titans, for example. Right. And then the third category for them would be manifested mostly by the Olympians and then later by all the other gods. Right. Who they come worship, you know, who are the powers and principalities, the ones who are ruling over them now?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2782.6,"end":2787.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's Zeus and Hera and Athena and Apollo and, you know, all those guys."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2787.72,"end":2827.64,"speaker":"Fr Stephen De Young","text":"Yeah. If you go back to those older episodes, we quote from Plato where Plato literally tells the story about them having been allotted certain territories, just like in the Babel story. Right. From which they were going to rule over those areas and. And Athens got Hephaestus and Athena. That's theirs. Right. And Plato talks about how at first they ruled as sort of gentle shepherds, and then something happened, some sort of indeterminate point, and the sort of golden age of that ended. But so there's this same kind of. This same kind of structure."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2827.88,"end":2828.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2828.76,"end":2837.22,"speaker":"Fr Stephen De Young","text":"And Then within that structure you get sort of the Greek version of. Of gigantomachy, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2837.22,"end":2843.62,"speaker":"Fr Andrew Stephen Damick","text":"Which again, everybody, that's a wonderful term that means a war against giants. A war with giants. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2844.26,"end":2863.46,"speaker":"Fr Stephen De Young","text":"And there's several things here we're going to talk about a little more that we've brushed into here and there. But so the way this happens is that in the Greek story there's sort of this chthonic Gaia. Right? So Gaia is the earth Earth and."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2863.46,"end":2868.82,"speaker":"Fr Andrew Stephen Damick","text":"Chthonic is, you know, the underworld, Hades, you know. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2869.46,"end":2894.24,"speaker":"Fr Stephen De Young","text":"We've talked about how in Hebrew aretz can mean the earth or the land. It can also mean the underworld. The same is true with Gaia. There's sort of a chthonic version of her, right. Because you know, it's not just the earth, but all the holes and pits and caves and caverns. And so she's angry because the Titans were her kids, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2894.24,"end":2898.84,"speaker":"Fr Andrew Stephen Damick","text":"Which the Olympians threw them into Tartarus."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2899.32,"end":2909.56,"speaker":"Fr Stephen De Young","text":"Right. And so to get revenge, she first brings forth the giants. Right. And so there's this war against the giants."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2910.2,"end":2939.91,"speaker":"Fr Andrew Stephen Damick","text":"And I should point out here, everybody, if you actually look at the Greek mythological sources that talk about these giants, they do not make the consistent or even persistent claim that they are physically tall. The, the thing that's really seems to make be how they're actually described is that they're really fierce and aggressive and really tough. Tough warriors is. Is their deal, not that they're super big."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2940.55,"end":2940.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2941.27,"end":2943.49,"speaker":"Fr Andrew Stephen Damick","text":"So just a note."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2944.37,"end":2962.13,"speaker":"Fr Stephen De Young","text":"And as another note, the high altar of Pergamon, which was an altar, a victory altar to Zeus that in his letter to the church at pergamon In Revelation, St. John refers to as the throne of Satan."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2962.61,"end":2963.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2963.41,"end":2975.51,"speaker":"Fr Stephen De Young","text":"Which is now in a Berlin museum. The Brits didn't get that one in time has this gigantomachy, that's what's depicted."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2976.07,"end":2976.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2977.59,"end":2979.91,"speaker":"Fr Stephen De Young","text":"On the, on the side of it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2980.07,"end":2993.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean you can, you can Google, Google it up, people, and see. Or use your favorite search engine, Altavista maybe. And you can see pictures of pictures of it on the marbles and stuff that are associated with that."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":2994.32,"end":2999.92,"speaker":"Fr Stephen De Young","text":"Yeah. Use Publisher Clearinghouse's search engine. You get free sweepstakes entries every time you search."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3000.96,"end":3006.8,"speaker":"Fr Andrew Stephen Damick","text":"Is there anybody out there who still uses Archie and Gopher, Please write in. I'd love to hear from you ancient peoples."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3008.64,"end":3020,"speaker":"Fr Stephen De Young","text":"So wow. Deep, deep after the gigantomachy sort of doesn't work. She brings forth Typhon, who's the great beast who comes up out of the sea."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3020.3,"end":3022.78,"speaker":"Fr Andrew Stephen Damick","text":"I feel Like, I've heard that somewhere before, but more on that later."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3022.78,"end":3054.52,"speaker":"Fr Stephen De Young","text":"What beast out of the sea? Yeah, and Typhon is described as being this kind of weird hodgepodge of other creatures, and he's sort of the ultimate expression of the wrath of the Titans. Anyway, and so that beast is sort of defeated by the Olympians, which is sort of their ultimate establishment of order. He's this chaos monster out of the sea."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3054.92,"end":3064.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, like in Hesiod, Typhon is the son of Gaia and Tartarus. Like, wow, what a. What an unholy union that is."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3064.52,"end":3101.48,"speaker":"Fr Stephen De Young","text":"Yeah, that's worst. The underworld and hell got together and brought you this. So. But this Typhon imagery, as we alluded to, is what is getting picked up by Daniel in Revelation. Right. And what's happening there is that they're taking that story and inverting it. Right. Because from the perspective of the Greeks and the Romans, right, the Olympians are the good guys, and the Olympians are basically them."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3102.52,"end":3103.4,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3103.96,"end":3116.65,"speaker":"Fr Stephen De Young","text":"And so. No, they are. In their minds, we Romans. Right. We Greeks represent the triumph of order over chaos. Right, Yeah, I was gonna say."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3116.65,"end":3159.72,"speaker":"Fr Andrew Stephen Damick","text":"And you see the exact same thing in Norse mythology, right? So Odin, you know, the All Father. But, I mean, he wasn't always the All Father. Once again, you know, he defeats this great primeval giant, Ymir, with his brothers Vili and Vayner. And as I think I've mentioned on this podcast before, when they stab him in the toe, you know, a flood of blood comes out and largely drowns all the giants in the world. So there's like, there's this again. There's Gigantomachi, there's the destruction of monsters, to set up these gods as being the ones who are really in charge and are the good guys. You know, I mean, it's the same, really. It's the same story over and over again, just with a little bit of different details."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3160.84,"end":3172.6,"speaker":"Fr Stephen De Young","text":"Right, right. But so what Daniel is saying through his vision and its interpretation, what St. John is saying through his vision and its interpretation is, no, you guys are the monster."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3174.52,"end":3175.64,"speaker":"Fr Andrew Stephen Damick","text":"Are we the baddies?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3175.96,"end":3188.79,"speaker":"Fr Stephen De Young","text":"Yeah. You guys think you're the ones establishing order and justice, but you're the monsters. You're chaos, your destruction, you're worshiping it. You're following after it. You represent it in the world."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3189.75,"end":3190.11,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3190.11,"end":3202.15,"speaker":"Fr Stephen De Young","text":"And you're going to be defeated and you're going to be judged by the actual God who created the universe and will bring justice to the universe, unless you do something real quick."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3202.39,"end":3204.91,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3204.91,"end":3220.77,"speaker":"Fr Stephen De Young","text":"And you even see in Revelation. Again, you know, this would be multiple episodes at some point to go through any of the stuff in Revelation, but it's worth comparing the Harlot and the Beast to Gaia and Typhon."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3221.01,"end":3221.73,"speaker":"Fr Andrew Stephen Damick","text":"Oh, wow."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3222.61,"end":3226.61,"speaker":"Fr Stephen De Young","text":"And that relationship there, that's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3226.61,"end":3237.17,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that's fun. All right. Well, after that little cataloging of demons and such from the ancient world, we're going to take a short break and we'll be right back."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3239.74,"end":3255.9,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-ADIO."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3261.18,"end":3315.31,"speaker":"Fr Andrew Stephen Damick","text":"New from Ancient Faith Publishing. Arise, O God, the Gospel of Christ's Defeat of Demons, Sin and Death, written by Andrew Stephen Damick. This book is not a sales pitch. I hope that instead it will be an authentic, true proclamation of the gospel. How or whether you respond to it is important, but I'm not going to make a marketing appeal to you. At the end, knowing what the gospel is and being able to teach it to someone else does not require that you know everything in this book. But by the end of it, you should know what a gospel is, why there is a gospel at all, what the gospel is, and what the response to it requires. Arise, O God. The Gospel of Christ's Defeat of Demons, Sin, and Death, now available as an."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3315.31,"end":3319.35,"speaker":"Fr Stephen De Young","text":"Audiobook@Audible.Com we're back now with the Lord."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3319.35,"end":3333.91,"speaker":"Steve","text":"Of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3335.99,"end":3355.61,"speaker":"Fr Andrew Stephen Damick","text":"Welcome to the second half of the podcast. We're talking idolatry, we're talking demons, gods, all that awful stuff. Before we get into the next part of what we're going to be discussing, we actually have a couple of callers that we want to talk to, and the first one is Matt. So, Matt, are you there on the line?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3357.05,"end":3358.33,"speaker":"Audience Member","text":"I am. Can you hear me?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3358.65,"end":3363.05,"speaker":"Fr Andrew Stephen Damick","text":"I can hear you. Welcome, Matt, to the Lord of Spirits podcast. What is on your mind?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3364.49,"end":3402.74,"speaker":"Audience Member","text":"Okay, so sacrifice has been discussed quite a bit on the show and the nature of it. And one of the main messages is that sacrifice is at its core like a meal that you share with your God. And it's like a hospitality thing to improve relations. And so with that understanding, is it sinful at this point in history? Post crucifixion, resurrection with the presence of the eucharist for a Christian to still sacrifice food to Yahweh."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3405.7,"end":3471.04,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, you put it just ambiguously enough at the end there that it's like, well, it depends on what you mean, right? So. And we'll talk about why that's true. So, I mean, the Eucharist is a sacrifice of food to Yahweh, right? Because it's bread and wine that we're sharing with God. So. And this is commanded by Christ, right, When he said, do this as my remembrance. Right? But I think maybe underneath your question is sort of the issue of is it okay to sacrifice other foods, like, you know, barbecue, which. Which, if you're. If you're. Where I'm from, that is pulled pork with basically vinegar on it. So, you know, or whatever else it might be. And there's a good answer to that. And I'm gonna. I think I know what he's gonna say, but I'm gonna punt it over to Father Stephen to hear what he has to say about that."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3471.99,"end":3484.79,"speaker":"Fr Stephen De Young","text":"Yeah. So the. The key is, right, that the Torah makes clear you're not allowed to sacrifice whatever you want, whenever you want, wherever you want, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3484.79,"end":3485.91,"speaker":"Audience Member","text":"Oh, it does. Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3486.39,"end":3574.12,"speaker":"Fr Stephen De Young","text":"So it's not just a question of. Of hospitality, but it's. It's. I mean, we're talking about hospitality as an overarching category in the ancient world, right? And so obviously, different cultures had different rules for sacrifice. Like they could sacrifice people, right? But the Torah was very strict about that, right? You read the instructions that it's, you know, this. Many of this type of animal on this day in this one place, you know, buy this officiant, right? You know, or the Passover, one lamb per household, unless your household's small, then you could share with another small household, etc. Etc. Right? But there's very. There's very strict rules, and that's. That's a general thing about worship all the way through the Torah. And sacrifice, obviously, is the central act of worship, right. Nadab and Abihu decided to innovate with their offering of incense, and it didn't go so well for them. So I think the same broad principle would apply today, right, that when Christ says, as Father Andrew said, do this as my remembrance, right. We have this tradition of worship we've received. Trying to sort of riff off of that or innovate from. That would. Would be a bad thing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3574.36,"end":3656.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. The other thing I would add, by the way, and. And this was one of the things that I learned, which was really fascinating to me. If you listen to Our episode that we did about Abraham, I think we titled it From Ur of the Chaldees or something like that. We talk about the incident where Abraham is called by God to offer up Isaac on the mountain, and before he can do that, of course, God stops him and a ram is given as the sacrifice instead. And one of the things that Father Stephen pointed out was that this was interpreted by Second Temple Judaism and by. Well, not by Second Temple Judaism so much. Maybe. I don't know, maybe correct me in this, but certainly by the early church as an indication that animal sacrifice was being provided by God until such time as the one who is sort of the true and final Isaac. That is to say, Christ comes and is sacrificed. So it would be. It would be a kind of a judaizing thing, you know, in other words, acting like the Messiah has not come if we were to offer up, you know, other kinds of things on the altar other than what he has commanded us within the new covenant. Did I get that right, Father Stephen, about."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3656.23,"end":3666.32,"speaker":"Fr Stephen De Young","text":"Yeah, that. Yeah, yeah. Because. Yeah. There was an early connection of the Messiah to Isaac, particularly in terms of the suffering servant in Isaiah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3666.56,"end":3666.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3666.96,"end":3677.04,"speaker":"Fr Stephen De Young","text":"That led to that broader interpretation that. That the. The sacrificial rituals of the old covenant were sort of for that purpose for that time. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3677.68,"end":3707.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And that Christ is the final fulfillment of all of that. And so therefore, I mean, he's off. He's given us himself to offer on his altar. Why would you offer something else? Yeah. You know, and there's even, like, cannons against things like offering milk and honey, which, you know, if someone makes a rule against it, that means that someone was doing that. So, you know, there are even comments saying, you know, don't do this other thing as well. So does that make sense, Matt? Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3707.87,"end":3710.67,"speaker":"Audience Member","text":"Yeah. I'm curious. Do you recall where those cannons are?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3711.47,"end":3714.99,"speaker":"Fr Andrew Stephen Damick","text":"It's in one of the Ecumenical Councils, but I can't remember off the top of my head."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3715.29,"end":3717.45,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3717.69,"end":3719.29,"speaker":"Audience Member","text":"Very good answer. Thank you very much."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3719.45,"end":3724.65,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, thank you very much for calling, Matt. Okay, we've got Bill calling. Bill, are you there?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3725.69,"end":3727.29,"speaker":"Audience Member","text":"I am here. Can you hear me, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3727.53,"end":3730.17,"speaker":"Fr Andrew Stephen Damick","text":"We can hear you, Bill. Welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3731.13,"end":3732.81,"speaker":"Audience Member","text":"Thank you very much. It's good to be here."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3733.61,"end":3734.33,"speaker":"Fr Andrew Stephen Damick","text":"So what's up?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3736.65,"end":3790.59,"speaker":"Audience Member","text":"My question has to do with what modern Pentecostals call Glossolalia, and if that has any relation to, like, the ancient gods of the nations. So a bit of backstory. I was raised Pentecostal. I was taught that gloss lalia was a sign of the Holy Spirit speaking through you. And I was deeply disturbed when I found out that other religions had the same manifestation as. Well, my understanding is that it's referenced in Greco Roman religious literature, modern African and Indian and, sorry, Indonesian religion, maybe Indian, I don't actually know. Mormonism. I do know, though, and I do. I don't know what to make of this phenomenon. So the question is there an idea or practice in the ancient world of spiritual babbling or speaking a divine language as a kind of worshiping or secret knowledge or communion with their gods? And if so, what's going on there?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":3790.99,"end":4036.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I mean, the short answer is yes, you know, ecstatic utterances definitely go with ancient paganism. So I actually want to. I thought this is a really interesting subject for me. So not to sell my book too much, but I wrote a book called Orthodoxy and Heterodoxy. And there's a whole chapter on Pentecostalism. And one of the things that I discovered as I was researching it, because I didn't know this until I started researching it, is that the first Pentecostals, late 19th century actually, their understanding of the gift of tongues was like what you actually see at Pentecost in the Book of Acts, which is to say they were being given the miraculous ability to speak foreign languages. Right. Or, I mean, you could also interpret what happens in Acts as being like the Star Trek universal translator. You know, the apostles speak and everyone simply hears his own language, which is the language that's actually used there in Acts. But in any event, like early Pentecostals, like, they said they were speaking Swedish or Chinese. Those are actual examples. And so they. This is related. I'll get to why. So they sent out missionaries all over the world ready to. Because they believed they were given this gift to do this one final great evangelism before the end of the world was going to come. And so they sent out missionaries. But of course, it didn't take long for the missionaries to realize, hey, wait a minute, I'm not actually speaking Swedish or Chinese, where if I am, these people don't seem to understand me. And they came back and within the space of a decade, the theology of what, speaking in tongues was shifted within Pentecostalism from being that which generally is called xenoglossia, which is, you know, the gift of foreign languages, to glossolalia, this sort of ecstatic utterance. Right. So the reason why this is relevant to what you asked is because you ask, like, what's going on there? And. And people often ask, like, is there Something demonic in Pentecostal tongue speaking. Right. Is that one of the questions maybe on your mind? Yes. Yeah, yeah. So. So here's my take on it, and this is my take. This is not the ruling of an ecumenical council or even what I was taught in seminary. I don't even remember it being addressed when I was in seminary. My take is this, is that there's a number of possibilities. One is that it's a purely psychological phenomenon. People can enter into states of altered consciousness and begin to speak ecstatic utterances. Like, this is a thing. And you can actually even track it scientifically. Right. With empirical instruments. And they can actually see that the brain starts working in a different way. Right. So I think that that's one possibility. Another possibility is in some. And I'm saying. I'm not saying that it could. It's one of these. It could be any or all of them, depending on who and where and when you're talking about. Right. Another possibility is. Is utter fraud, just totally fraud, people making it up. Another possibility is that it's. It's people that are, you know, honestly deceived. And maybe they're deceived by having the psychological experience, and maybe they're deceived by actually interacting with. With demonic beings. So I think that all of those are possibilities. One of the things that tells me that it's not proper for orthodox Christians, aside from the fact that you simply don't really see it in orthodox Christianity, although I've heard about some possibilities in certain corners of church history. But is, is that in many cases within Pentecostal tongue speaking, you've got people teaching other people how to practice it. I don't know if you had that experience as a Pentecostal yourself. Like, just make some sounds, you know, and you'll, you'll. Eventually it'll kind of unleash, unleash."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4036.46,"end":4040.06,"speaker":"Audience Member","text":"You know, they tried, it didn't really happen."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4040.54,"end":4120.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. And sometimes they'll try to, you know, instigate it in other people, like make them start. And then the other thing. And this is, this is the thing that's interesting for me as a kind of amateur, you know, linguist, and I. And I emphasize the word amateur is. I've noticed that tongue speakers seem to use, largely speaking, the phonemes, that is to say, the sounds of language, like the vowels and the consonants together. Right. The phone. Phonemes that are native to the language that they already speak. So largely, tongue speakers are not making sounds that are foreign to them, which, if you've ever tried to learn Another language. You know that usually that other language has sounds that you're not used to making. Right. Like, my favorite is the Arabic vowel ayin. There is nothing in English like that vowel. And it's one that trips up a lot of people, you know, And I'm sure I just said it wrong. Right. But I've noticed that tongue speakers tend to speak in tongues with the phonemes they already know, which suggests to me that there is at least a strong psychological element to what's going on there. I don't know as much about this from the ancient world. I do know that glossolalia does exist in pagan religions. And so I don't know, Father Stephen, if you know about that in a way that I don't. It's just something. I know that it existed and sometimes was associated with oracles and stuff."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4122.2,"end":4124.4,"speaker":"Fr Stephen De Young","text":"Yeah. I gotta actually you a little bit because."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4124.4,"end":4125.24,"speaker":"Fr Andrew Stephen Damick","text":"Okay, go for it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4125.8,"end":4128.28,"speaker":"Fr Stephen De Young","text":"You kind of just went full materialist. Do you realize that?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4128.28,"end":4128.84,"speaker":"Fr Andrew Stephen Damick","text":"Did I?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4129.96,"end":4135.24,"speaker":"Fr Stephen De Young","text":"Like, if they hook you up to a brain meter and detect something, that means there's nothing spiritual about it?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4135.32,"end":4136.6,"speaker":"Fr Andrew Stephen Damick","text":"No, that's not what I meant."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4136.6,"end":4137.24,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4137.48,"end":4146.44,"speaker":"Fr Andrew Stephen Damick","text":"That's not what I meant. No, no, no, no, no, no. I'm saying that it is something that can be observed. Right. There is. There are things to observe when you hook people up."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4147.08,"end":4147.52,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4147.52,"end":4147.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4149.29,"end":4150.09,"speaker":"Fr Stephen De Young","text":"Just say it is all."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4150.41,"end":4153.53,"speaker":"Fr Andrew Stephen Damick","text":"No, thank you for the opportunity to clarify."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4153.69,"end":4202.78,"speaker":"Fr Stephen De Young","text":"Yeah. So I don't have a reputation for being nice. I think most of the time there's a demonic element to it, but that takes different forms. That doesn't mean. I think people are 99% of the time. Demonic possession. Demonically possessed. Right. I don't think Pentecostals are all demonically possessed. Right. Because there's other ways demons could be involved. Right. In temptation and in other things. Right. Aside from just straight up possessing people. And I think the really dangerous part as you know this, the ecstatic experience. The production of the ecstatic experience by techniques is a common place in ancient magic and ritual."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4203.27,"end":4203.67,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4204.79,"end":4226.95,"speaker":"Fr Stephen De Young","text":"And ecstatic utterances are one of the earmarks of that. Right. And so anything that puts you into an altered state of consciousness, it doesn't have to be psychedelics, for example. Right. Oh, what the heck. I could say whatever I want, I guess."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4227.91,"end":4228.79,"speaker":"Fr Andrew Stephen Damick","text":"Wow, here we go."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4228.95,"end":4244.17,"speaker":"Fr Stephen De Young","text":"People who have seen spent time in evangelicalism know, for example, that if you keep people on their feet for a certain amount of time and you have them sing repetitive prayer choruses, praise choruses of a certain length, you could produce an ecstatic experience. Everyone will Walk out of their swearing, they felt the Holy Spirit."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4244.81,"end":4245.13,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4245.13,"end":4247.45,"speaker":"Fr Stephen De Young","text":"And the people who organize those things know that."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4248.01,"end":4262.57,"speaker":"Fr Andrew Stephen Damick","text":"I mean, I was gonna say I used to be, you know, I used to do big concerts and that kind of thing. And that kind of technique is absolutely involved in the kinds of experiences that people have, you know, at rock concerts, at plays, at whatever."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4262.81,"end":4471.29,"speaker":"Fr Stephen De Young","text":"Right, right. And you can have them at sporting events. Right? You can have them. But. But again, regardless of how you engineer it, whether it's with pharmaceuticals or whether it's through those kind of techniques, you're putting someone into an altered state of consciousness, which thereby makes them spiritually vulnerable. Makes them vulnerable to spiritual deception. It makes them vulnerable in various ways. There's also the whole issue, and this is really what we're going to be talking about for most of the rest of the show. Anything spiritual in which you are told to apply a technique, you should run from, like fire, right? That's where you're told, here's this technique. Follow this technique and it will produce this result. That's not Christianity. Right. That is. That is another kind of religious experience. So the reason I said 99%, right, is that there's always this 1% of weird things. Like, if you've read enough of the Bible, you know, there's these weird things, like where Saul goes to the city of prophets and rips off all his clothes and flops around on the ground prophesying. Right. Or Ezekiel running around naked or. Right. So there's these weird cases, right? So I'm not going to say that there hasn't been some case in the history of the church where a Christian received a vision from God and that was accompanied by some kind of ecstatic utterance. Right? That's why I have to leave that 1% open. But even if we accept that that happened in that 0.01% or whatever it is of cases, that's the fringe in the extreme, not the norm, right? Like, we don't read about that happening to Saul. And so we say, hey, when I go to church, when I go to liturgy this week, I'm going to strip off all my clothes and roll around on the floor. Right. Please don't. You know, we don't do that because we accept. Well, this is this weird kind of extreme thing. Right? And that alone. Right. That alone, I think, is enough to say to the Pentecostal practice, right. Where they've taken that which would be, at best, this kind of extreme or fringe or rare spiritual, Exceptional spiritual occurrence and tried to make it the norm. Some of them even teach. If you haven't done it, you're not saved. Right. Where. I mean, that's as norm as you can get. They're taking something out of the fringe. Hi, Jonathan Pigeon. And moving it to the center. Right. And you're not going to have a good time when you do that. So, yeah, that's what I have to say about that. It's. It's dangerous for that reason. And, and is not. Is not something, not something to be pursued. There are plenty of things that we have to pursue in our Christian life and work toward, and I don't see how that could take precedence over the giving of alms, prayer, fasting, worship, you know, prayer with our families. Right. Pursuing a kind of esoteric experience seems to be. To be a waste of time, better spent elsewhere, repenting at all. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4472.25,"end":4473.53,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense to you, Bill?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4475.7,"end":4476.18,"speaker":"Fr Stephen De Young","text":"It does."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4476.98,"end":4521.67,"speaker":"Audience Member","text":"If I might ask real quickly, my priest is also a former Pentecostal who did this before and now thinks that it was more of a hypnotic experience, which just seems. It might be true, but it just seems too much of a materialist explanation. And I've been really looking for an orthodox understanding of this that doesn't lean too heavily into pure materialism. So are there any good resources, aside from Orthodoxy and heterodoxy, which I now obviously have to check out, that goes over the spiritual understanding of this, both contemporary, but also like in ancient religions, in the ancient world? Priority on the first. But the second's also really interesting."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4523.67,"end":4595.19,"speaker":"Fr Andrew Stephen Damick","text":"I'm not aware of any book that does what you're describing. The only other text that I'm aware of that deals with tongue speaking and Pentecostalism in general in any kind of focused way. Now, maybe there's a scholarly thing I haven't read, I don't know, but is. So Father Seraphim Rose has a book called Orthodoxy and the Religion of the Future, which came out in the 1970s, or at least that's when he wrote it. And he very, very, very much all out says this is a demonic spirit, it's demonic possession. So he gives a very. I regard it as a kind of extreme reading. You know, I. I would agree with Father Stephen that I don't think it's a matter of being possessed by like a devil, you know, necessarily. Right. I mean, maybe in some cases that is what's going on. But. But Father Seraphim takes a very, very strong tack against it. But at the time also, you know, frankly, the movement was quite different in his period than it is now. You know, it's really mainstreamed in a lot of ways, you know, so. Yeah, I don't know. Father, do you know of anything that really deals with this in, like, Mike, Bill is describing?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4596.15,"end":4605.51,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, not, not off the top of my head. If I, if I find something good, I'll pass it along to Father Andrew and he can post it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4605.91,"end":4606.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4606.39,"end":4607.67,"speaker":"Fr Stephen De Young","text":"Somewhere on the interwebs."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4607.99,"end":4608.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4608.63,"end":4610.23,"speaker":"Fr Stephen De Young","text":"On his tweet talks or whatever."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4611.27,"end":4639.78,"speaker":"Fr Andrew Stephen Damick","text":"I quit Twitter. I'm a Twitter quitter. All right, well, I hope that that's helpful to you, Bill. Thank you very much for calling this evening. All right, well, rolling right along now, we're going to talk about idolatry and how it actually works. Like what exactly is going on with idolatry? And to start with that, we're going to talk about things that are not actually idolatry, but get called it. Right, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4640.1,"end":4645.86,"speaker":"Fr Stephen De Young","text":"Right. Yeah. Idols. How do they work? And, yeah, first we have to do some ground clearing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4646.26,"end":4646.7,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4646.7,"end":4688.43,"speaker":"Fr Stephen De Young","text":"Because we have a bunch of ideas in our heads. We briefly mentioned this last time, but we have these ideas in our head. A lot of them come from, frankly, as we're going to see, a lot of them come from other discussions. They come from, for example, intra Protestant issues where people are wanting to categorize things as idolatry so that they can then condemn them as idolatry, even if they're not sort of idolatry proper. So you get kind of some weird definitions. Like all of a sudden everybody's a Pelagian, you know, now all of a sudden everything's an idol. Who could I be talking about anyway?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4690.19,"end":4694.09,"speaker":"Fr Andrew Stephen Damick","text":"So these idle accusations of idolatry. Sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4694.89,"end":4695.37,"speaker":"Fr Stephen De Young","text":"Wow."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4695.93,"end":4698.57,"speaker":"Fr Andrew Stephen Damick","text":"I know it's getting towards my."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4698.73,"end":4755.87,"speaker":"Fr Stephen De Young","text":"I'd like to apologize to our more sensitive listeners for that comment. So one of the. And we mentioned this last time, but one of the sort of classic bad definitions is that you worship a picture of a thing instead of the thing. Right, Right. And really you only get this argument from even very modern iconoclasm. Right. Not iconoclasm proper in the 8th and 9th centuries, but like modern Protestant iconoclasm usually, which is the idea that, well, if you have an icon, if you have an image of Jesus, if you have a picture of Jesus and you venerate that, you kiss it, you reverence it, you bow to it, you're bowing to the picture instead of to Jesus."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4756.43,"end":4761.79,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. The picture gets between you and him kind of thing. Right, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4761.79,"end":4778.27,"speaker":"Fr Stephen De Young","text":"Which as I've probably, I'm sure I've commented on this show at some point before, that's like seeing a guy pick up the picture of his wife from his desk and kiss it and saying he's having an affair with a coated two ply piece of Bristol paper. He loves that picture, not his wife. I saw him making out with it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4778.51,"end":4778.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4778.87,"end":4802.44,"speaker":"Fr Stephen De Young","text":"You think that person was a loon. Right. You think that person was an absolute loon. Right. Everybody would instantly know. Somebody picks up, kisses a picture of his wife and kids, it's because he loves his wife and kids, not the picture. Right, right. By the way, the original iconoclast, what they were arguing about was whether icons should be venerated the same way you venerate the cross in the Gospel book."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4803.16,"end":4803.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4804.68,"end":4821.7,"speaker":"Fr Stephen De Young","text":"Right. So they were talking about what category of holy things icons were in. They were not talking about this kind of silliness that they thought people were worshiping pictures instead of what they were a picture of."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4823.21,"end":4838.01,"speaker":"Fr Andrew Stephen Damick","text":"And I don't think any religious person, no matter how actually idolatrous they may be, I don't think that any religious person even says, oh, this picture is my God. Yeah, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4838.01,"end":4844.97,"speaker":"Fr Stephen De Young","text":"Like the pagan gods. If the pagan gods thought you were worshiping the idol instead of them, you'd think they'd be upset."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4845.69,"end":4848.01,"speaker":"Fr Andrew Stephen Damick","text":"Right. Hey, I'm right over here."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4848.57,"end":4878.78,"speaker":"Fr Stephen De Young","text":"Right. So that's not how this works. That's not how any of this works. So you then also get, I mean, related, we should say, as an addendum to that, you also just get making a picture of God, having a picture of God at all. So, you know, any movie where there's an actor portraying Jesus is automatically idolatry. Right, right. Or just having an image sometimes even across in a worship space."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4880.06,"end":4880.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4880.26,"end":4881.98,"speaker":"Fr Stephen De Young","text":"That's automatically idolatry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4882.14,"end":4886.22,"speaker":"Fr Andrew Stephen Damick","text":"Yep. And these are real positions that people actually have too."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4886.22,"end":4917.35,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah, right. But clearly, if you take that into the ancient world. Right. There were images of the tabernacle, but that was not idolatrous worship. Right. Like, definitionally, that was opposed to the idolatrous worship of. Of the nations. Right, Yep. So a more common, and rightfully so, since it's at least a little more sophisticated, is the idea that idolatry is about people worshiping hunks of wood or stone."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":4918.15,"end":5031.23,"speaker":"Fr Andrew Stephen Damick","text":"Right. And this seems to have some basis in stuff that actually is in the Bible. A certain reading of stuff that's in the Bible. Yeah, yeah, yeah, yeah, yeah. So like, okay, well, we have a passage, and this is one of the passages I think that gets used for this. And I'm just going to read it real Quick. This is from Isaiah 44. This is verses 9 through 17. All who fashion idols are nothing. And the things they delight in do not profit. Their witnesses neither see nor know that they may be put to shame. Who fashions a God or casts an idol, that is profitable, profitable for nothing. Behold, all his companions shall be put to shame. And the craftsmen are only human. Let them assemble. Let them stand forth. They shall be terrified. They shall be put to shame together. The ironsmith takes a cutting tool and works it over the coals. He fashions it with hammers and works it with his strong arm. He becomes hungry and his strength fails. He drinks no water and is faint. The carpenter stretches a line. He marks it out with a pencil. He shapes it with planes and marks it with a compass. He shapes it into the figure of a man with the beauty of a man. To dwell in a house, he cuts down cedars, or he chooses a cypress tree or an oak and lets it grow strong among the trees of the forest. He plants a cedar and then rain nourishes it. Then it becomes fuel for a man. He takes a part of it and warms himself. He kindles a fire and bakes bread. Also. He makes a God and worships it. He makes it an idol and falls down before it. Half of it he burns in the fire. Over the half he eats meat. He roasts it and is satisfied also. He warms himself and says, aha, I am warm. I have seen the fire. And the rest of it he makes into a God his idol and falls down to it and worships it. He prays to it and says, deliver me, for you are my God. So the one reading of this is, you know, this guy made this thing, and that's his God, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5032.35,"end":5034.99,"speaker":"Fr Stephen De Young","text":"Worshiping this piece of wood or metal piece of wood."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5034.99,"end":5044.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's what the Bible is talking about here. But that's not actually what this is all about. What. What is going on in this passage, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5044.99,"end":5075.93,"speaker":"Fr Stephen De Young","text":"Right? Not if. Not if we read it carefully. Right. And. Right. So we start out with talking about these witnesses, right? So these witnesses show up and they tell you about this God, right? They tell you about BAAL and all his escapades and about, you know, how he. He went and defeated Yam and he defeated Lotan and totally won. Went into the underworld. Fahdeth, totally won again."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5076.33,"end":5076.65,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5076.65,"end":5138.4,"speaker":"Fr Stephen De Young","text":"And then, you know, built tells you the whole story, right? Now, the people who tell you these stories weren't there, didn't see it happen. Right, right. Don't actually know anything about it. But they're repeating the story. And so this guy says, oh, great, this is. I'm gonna. I'm gonna worship BAAL now. So he goes, and either he gets metal, right? And he is a craftsman, you know, gets the tools, you know, hammers the metal, works the metal, working over the coals, right. Or the carpenter goes, and he cuts down a mighty tree and he, you know, cuts the wood and goes, and he makes himself a fire and makes himself some food and he warms himself and takes care of himself while he works on it. And finally, you know, he's got this idol now and says that this God is going to deliver him. Now notice how much time Isaiah spends describing this whole process, right? Felling all of these trees and the different kinds of trees."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5138.72,"end":5144.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, the hero of this passage, so to speak, is the craftsman, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5144.56,"end":5194.86,"speaker":"Fr Stephen De Young","text":"It's describing the craftsman's deeds. Right. So he's heard about all these great deeds of baal, which, you know, by the way, nobody was there. We don't have any actual eyewitness testimony. But, you know, be that as it may. But then he goes and does all these things, all these very impressive things, and he takes care of himself while he's doing it and provides for himself. Right. He plants this tree, the rain nourishes it and it grows and he cuts it and all of these things. And now he's got this little statue. And this little statue is going to do what for him? Right, Right. He is way more powerful than this statue because the statue couldn't cut down the tree. The statue couldn't make the tree grow. The statue couldn't, you know, make bread for him. The statue did nothing for him. He did everything for the statue. Right. But now he thinks somehow the statue is going to save him or help him or."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5195.42,"end":5216.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. And the point, you know, being also that if this God that he's worshiping is so great with this statue, then why is it that he has to do all this work in order to make this even possible? You know, like, he's clearly more powerful than the God because he can do all these things. You know, the God can't even. Like, if his statue falls over, he can't even pick it up."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5217.86,"end":5220.1,"speaker":"Fr Stephen De Young","text":"Right. As Isaiah says in another place. You know."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5220.42,"end":5220.86,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5220.86,"end":5230.58,"speaker":"Fr Stephen De Young","text":"Jeremiah. It's Jeremiah who says, you know, you have to then put fasteners down because if it tips over, it can't stand itself back up, but it's going to give you victory in battle. Sure thing. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5231.14,"end":5233.15,"speaker":"Fr Andrew Stephen Damick","text":"Wink, wink, nudge, nudge. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5234.98,"end":5277.39,"speaker":"Fr Stephen De Young","text":"So this is about the weakness and powerlessness of the God. Right. Is the criticism that's taking place here. It's not implying that he's actually worshiping the piece of wood. Right. He knows it's a piece of wood, he cut it. Right. He's using that piece of wood to worship this God. And it's that God that's a worthless one. Right. As we talked about at the beginning. So, yeah, there's. We could sum up a bunch of these. Right. A bunch of these sort of bad definitions under the category of just, you know, physical objects being used in religious ways."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5277.87,"end":5338.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think this to me is one of the unspoken doctrines of at least major parts of Protestantism is holiness does not reside in physical objects. That's the way I summarize in my head. And I think that's what it is. And so if someone makes a claim that they do, well, that's idolatry, you know, and so it could be that you're using the object in a particular religious way, that you're making a pilgrimage to the object, that you're, you know, you know, giving honor to the object, you know, whatever it might be. Right. It's all kind of grouped together in this sense of like, you know, no, don't do woo woo stuff with these holy looking things because that's idolatry. Right. So that's another kind of category of that. But I mean, there's a lot. It's clear from the Bible that physical objects can have holiness associated with them and religious things are done with them. I mean, like this happens a bunch of times both in the Old and New Testaments."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5339,"end":5343.72,"speaker":"Fr Stephen De Young","text":"Yeah. And in some Puritan extremes you even get that the sacraments are somehow idolatry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5344.12,"end":5344.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5344.48,"end":5371.83,"speaker":"Fr Stephen De Young","text":"Wow. Because they're material things. Right. If you treat them as anything other than just, you know, a kind of analogy. Right. Or something. Right. If you have any, if you have any view of any reality to the sacraments or what they do that is leaning into idolatry for some of the extreme end of that, that point of view, which again makes no sense in terms of the actual idolatry actually existing idolatry in the ancient world."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5372.87,"end":5374.27,"speaker":"Fr Andrew Stephen Damick","text":"We're going to get to that in just a second."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5374.27,"end":5390.47,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So the last sort of view is sort of a less a view of less a definition of idolatry and more a way in which idolatry is talked about, which is a kind of analogical way."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5391.18,"end":5391.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5391.74,"end":5413.38,"speaker":"Fr Stephen De Young","text":"Or at least sophisticated folks would acknowledge that it's an analogy to ancient idolatry. They wouldn't try and say this is what ancient idolatry was, but they would say this is a modern form of idolatry related by analogy. And that's. That it's sort of material goods. The good things of the material world. The good things of the world, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5413.38,"end":5415.98,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So stuff you care about, stuff you focus on."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5416.97,"end":5432.97,"speaker":"Fr Stephen De Young","text":"Yeah. The stuff you like. Yeah, yeah, that's, that's your, your, your idol. So, you know, as I said earlier to you today, if you have your Belle Biv DeVoe poster right on your wall, Michael Bivens is your idol. Right. And."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5434.89,"end":5446.32,"speaker":"Fr Andrew Stephen Damick","text":"You know, you know, for my graduating class at, at the prom, which I did not go to, I sort of attended a party that protested the promotion because that's the kind of 17 year old I was."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5446.4,"end":5447.2,"speaker":"Fr Stephen De Young","text":"That checks out."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5447.6,"end":5456.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's so hard to say goodbye to. Yesterday was the theme for our class. So you might be."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5457.92,"end":5458.72,"speaker":"Fr Stephen De Young","text":"Well, I guess that's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5459.6,"end":5461.2,"speaker":"Fr Andrew Stephen Damick","text":"I'm not a Bell DeVoe fan."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5461.6,"end":5464.24,"speaker":"Fr Stephen De Young","text":"It's better than having the theme be poison, I guess."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5464.4,"end":5464.8,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5465.6,"end":5494.36,"speaker":"Fr Stephen De Young","text":"Allow me to be the first person in AFR history to say over their airwaves, you can't trust a big button. A smile. Anyway, so this, this is just the. Yeah, that. So, so anything you like, any of the goods of this world that you like, that you care about, that are important to you, even if they haven't been on American Idol, then you know that is, that is in some way idolatry. Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5494.36,"end":5494.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5495.28,"end":5551.84,"speaker":"Fr Stephen De Young","text":"And this is not totally wrong. There is a sense in which this is correct. And we're going to come back to that at the very end of the third half tonight. But the casual way it's bandied about is showing a bunch of people with Play DOH Brain. And that's not Play DOH Brain, like the stuff you ate when you were three, even though you weren't supposed to. Not me, but Plato, the philosopher, and there's this idea from Plato that distinction implies opposition. Right. So if you have more than one thing right, they're automatically to some degree opposed to each other. So if God is the ultimate good, anything you like other than God, anything you care about, anything you invest in other than God, is somehow taking away from your love and care and investment in God."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5552.08,"end":5570.64,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I mean, and this is, this is the basis also for one of the objections about, like asking, you know, the help of saints, like, why do you need to spend time in that? Just ask God, you know. You know, you don't need to take away from, you know, your request. It's interesting how it plays out in almost exactly the same way."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5571.6,"end":5579.47,"speaker":"Fr Stephen De Young","text":"Right, right. And, yeah, that's just. That's just Plato brain, man. He was wrong about that. More than one thing could be good."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5579.87,"end":5581.39,"speaker":"Fr Andrew Stephen Damick","text":"Plato derangement syndrome."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5581.39,"end":5590.99,"speaker":"Fr Stephen De Young","text":"Yeah. More than one thing could be good, and more than one thing could be bad. But you have to have. You have to have good things that are proper. In a proper order."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5591.39,"end":5601.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. In the right way. Okay, so. So how does idolatry actually then work? Like, what is the technique? Because it is a technique. Right, right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5601.51,"end":5637.54,"speaker":"Fr Stephen De Young","text":"Yeah. It's a practice. Yeah, yeah. It's something you do. You. Idolatry. You do it idolatry. No. So we've talked before, a little bit of review, catch up again. Right. Of the idea that an idol is, strictly speaking, a body for a God or a body for a spirit. And that's true in a couple of senses. Right. So the most sort of, pardon the pun, would, in sense is that you have the spirit that is inside it. Right. Sort of indwelling it as a body."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5637.78,"end":5638.58,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5638.98,"end":5668.52,"speaker":"Fr Stephen De Young","text":"We've talked about the. The ritual for the opening of the nostrils that allows the spirit to go into the. So it is dwelling within it like Robotech, Ghost in the machine. So. But it's also, and more importantly true in the broader sense of body that we've talked about on this show that sees a body as a nexus of powers and potentialities."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5668.76,"end":5672.12,"speaker":"Fr Andrew Stephen Damick","text":"So it is like Robotech, sort of."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5672.12,"end":5672.4,"speaker":"Fr Stephen De Young","text":"Which."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5672.4,"end":5674.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I was gonna say, I'm trying to get you to acknowledge."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5675,"end":5676.92,"speaker":"Fr Stephen De Young","text":"Which Macross season are we talking about?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5677.4,"end":5678.96,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, no, you've lost me now."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5678.96,"end":5681.72,"speaker":"Fr Stephen De Young","text":"I think it's more like the motorcycles than the planes, anyway."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5685.27,"end":5685.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5685.91,"end":5708.23,"speaker":"Fr Stephen De Young","text":"Although the Zentrati are kind of giants. Oh, this may require an episode. Anyway, so that means that what we're doing. Well, not what we're doing, hopefully, but what someone is doing when they make an idol is they're creating a hypostasis. They're creating a localization for the God in question."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5708.55,"end":5713.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that the worshiper can interact with a God and the God can interact with the worshiper through this thing."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5715.56,"end":5734.92,"speaker":"Fr Stephen De Young","text":"Right. And so for. We talked before, we were talking about hypostasis and how that works and that there is a pagan conception of it, that one of the core disjuncts between the God of Israel and the pagan gods is that the pagan gods can have, hypothetically, an infinite number of hypostasis."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5735.08,"end":5737.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just keep making idols because you can make them."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5737.88,"end":5778.18,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Whereas the difference is that Yahweh, the God of Israel has eternally existed in three hypostasis, and that's it. And you can't make them and you can't. Right, but so you're making this body, this localization of the God, and that's why you get not just sort of an identification of, for example, Artemis of the Ephesians. Right, But Artemis of the Ephesians has a particular idol, a particular image that looks very different than the Artemis you'd find in the Peloponnese."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5779.86,"end":5782.26,"speaker":"Fr Andrew Stephen Damick","text":"Right, Very different, yeah. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5784.66,"end":5812.19,"speaker":"Fr Stephen De Young","text":"So it's actually a sort of unique and local sort of form of the God where a particular people, whether that be a family, a clan, a tribe, a city. Right. Whatever social unit can then sort of. It's an access point for them to that spirit. Right. Where they can, can go and ritually then share hospitality, communion, commune with that spirit."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5812.59,"end":5918.12,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And so, you know, if you're thinking now, listener, about the golden calf incident where Moses is up on Sinai and, you know, wow, he seems to be gone for a long time. I guess he's gone, you know, and then Aaron leads the people in worshiping, making, and then worshiping the golden calf. This is an attempt to worship Yahweh, their true God, by means of this image. Right. Because notice when it's presented in front of everybody, Aaron says, here's the God that brought you up out of Egypt. You know, he's not saying this golden calf brought you up out of Egypt, but essentially let's use this golden calf in an idolatrous way in an attempt to interact with Yahweh, our God. Right. So it's trying to worship their God, the only God worthy of worship by idolatrous means. That's. That's what's going on there. And that's why he says, you know, here's. Here's the God that brought you up out of Egypt. But it's, you know, if you take a close look at all of the things that God does tell them to do in terms of worshiping him, there is no point at which any object ever, anywhere in the tabernacle or the temple, not even the Ark of the Covenant, is described as being a body of Yahweh. In other words, there is no idol that God commands them to make and use. Right. Although there is a really interesting note about the Ark of the Covenant, Father, that you brought up when we were briefing about this earlier today. So, I mean, why don't you tell everybody about that?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5918.44,"end":5932.85,"speaker":"Fr Stephen De Young","text":"Yeah, I mean, this is something that especially stands out. So some People seem to think that the Ark of the Covenant was like. Like God lived inside of it. Like it was a box that God lived in."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5933.17,"end":5933.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5934.05,"end":5936.81,"speaker":"Fr Stephen De Young","text":"And no, no, I mean, how many."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5936.81,"end":5940.29,"speaker":"Fr Andrew Stephen Damick","text":"Times does he say he does not dwell in stuff made by hands."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5940.45,"end":5941.81,"speaker":"Fr Stephen De Young","text":"Yeah. Let alone a box."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5941.89,"end":5942.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5942.33,"end":5958.45,"speaker":"Fr Stephen De Young","text":"Carried around on poles. So. And yeah, I won't go down that rabbit trail now. Self discipline. But I do see Indiana Jones in."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5958.45,"end":5959.69,"speaker":"Fr Andrew Stephen Damick","text":"My head right now though, so."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5959.69,"end":5961.09,"speaker":"Fr Stephen De Young","text":"Oh, that's not where I was going at all."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5961.09,"end":5962.53,"speaker":"Fr Andrew Stephen Damick","text":"It's beautiful. Sorry, sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5962.53,"end":5968.69,"speaker":"Fr Stephen De Young","text":"Yeah, I don't think that was supposed to be God. I don't know who that was about. I don't have demons that looked like."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5968.69,"end":5976.45,"speaker":"Fr Andrew Stephen Damick","text":"Came out of there. Yeah, I think it was supposed to be like the angel of Death or something like that in that film. Yeah, that film scared the snot out of me when I was a little kid."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5977.33,"end":5981.17,"speaker":"Fr Stephen De Young","text":"Boy, nothing like seeing Nazis face melt."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5981.41,"end":5982.05,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":5983.17,"end":6068.42,"speaker":"Fr Stephen De Young","text":"Yeah. I mean if Indiana Jones wasn't punching Nazis, he was melting their faces anyway. So where we were going with this though is that the Ark of the Covenant is not sort of this one off item that didn't exist anywhere else in the world. There were similar. It's similar to a kind of bark, a kind of ceremonial boat, ritual boat that was either carried or sent on an actual boat down the Nile in Egypt. And the key difference though is that those you may remember, the Ark has the two caravim with their wings extended over the center. The barks would usually have two goddesses, usually Isis and Nephthys, who were winged. Sometimes they were just depicted as in bird form, but sometimes they were sort of humanoid women with. With wings extended across the middle. But then the, the idol of the God or the image, if it was used on a tomb or that kind of thing. The image of the dead pharaoh, who of course was a God. Right. The image of the God would be between the wings. Right. And in the case of the Ark of the Covenant, there's nothing there."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6068.98,"end":6076.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's a very similar shape. You have the winged spirits on either end, but in the middle. Nothing. No idol."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6076.14,"end":6085.55,"speaker":"Fr Stephen De Young","text":"Yeah, no idol. So the Ark of the Covenant was a constant pointer that there was nothing. Right. Actually an idol there."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6085.87,"end":6092.51,"speaker":"Fr Andrew Stephen Damick","text":"And wasn't it. I can't remember who it was. Was it Antiochus Epiphanes when he invaded the temple and."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6092.75,"end":6098.67,"speaker":"Fr Stephen De Young","text":"Oh, you're thinking of Pompey."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6098.91,"end":6109.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. He invades the temple and you know, shoves his way into the holy of holies and then there's no idol there and he's like, what's going on? What's this all about?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6110.05,"end":6111.89,"speaker":"Fr Stephen De Young","text":"Yeah, there's nothing there. Yeah. And he's."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6111.89,"end":6112.21,"speaker":"Fr Andrew Stephen Damick","text":"He."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6112.29,"end":6116.29,"speaker":"Fr Stephen De Young","text":"He told the Romans. And that started this huge fascination with Judaism."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6116.37,"end":6116.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6117.09,"end":6129.81,"speaker":"Fr Stephen De Young","text":"Among upper class Romans because they. They decided that the Jews must worship their God, Solomon, only with their minds. That made it seem very sophisticated and strange."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6130.05,"end":6133.25,"speaker":"Fr Andrew Stephen Damick","text":"So philosophical, those. That Judaism. Yeah, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6134.61,"end":6143.02,"speaker":"Fr Stephen De Young","text":"So, yeah. And a lot of Those people were St. Paul's first Gentile converts later. So that all worked out. Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6143.02,"end":6143.74,"speaker":"Fr Andrew Stephen Damick","text":"That worked out."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6146.06,"end":6193.37,"speaker":"Fr Stephen De Young","text":"Didn't work out so well for Pompey long term. But anyway, that's another story. So idols then are. Are something that's used to localize the God. Meaning it's a sort of. It's a sort of spiritual technology used for purposes of worship. Right. So what kind of forms then do idols take? Well, obviously, like statuary is really obvious. Right, right. That's probably your typical idol. That's what people think of when they think of idols. But also very common, probably maybe even more common in the ancient world were sacred trees and poles. Asherah's being the most famous pole biblically. Probably."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6193.93,"end":6202.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Usually within some kind of grove. Some kind of grove or like a. Sometimes like a little walled garden or grove."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6203.05,"end":6205.69,"speaker":"Fr Stephen De Young","text":"Yeah. You would segment off a sacred space around it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6206.57,"end":6207.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6207.93,"end":6270.91,"speaker":"Fr Stephen De Young","text":"And we made a discovery during our pre show briefing. Oh, yes, this is amazing, because I was drinking some of the bold and refreshing Sunny Delight and we discovered that it is entirely possible that Sonny D may be an idol. Because on the side of the bottle, as I perused it, was the legend of Sonny D. Talking about how in the summer of 1963, two men stood in Florida in an orange grove, perhaps a sacred orange grove, and there they took a vow, an oath, to make the boldest, most refreshing citrus drink that the world had ever seen. And that's what produced Sunny D. So it is entirely possible that Sunny D is an idol. I don't know for what God. You figure it out. But just a tidbit."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6270.91,"end":6272.75,"speaker":"Fr Andrew Stephen Damick","text":"You could verify that with a blood orange."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6273.07,"end":6351.44,"speaker":"Fr Stephen De Young","text":"Yeah. You can verify that on the side of any current bottle of Sunny Delight. And since it's cold and flu season. Get your vitamin C, kids. So in addition to the sacred trees and poles, citrus and otherwise, another very, very common form of idol or image in the ancient world that we don't often think of is amulets or sort of. It's an amulet if you're wearing it around your neck. Right. Or around your hand, but small insets on the insides or outsides of buildings. Sort of medallion, incense, insets, carved are incredibly common. Right. Throughout the ancient world. One of the most common ones in the Greek and Roman worlds was to have a Medusa head, an image of a Medusa head, which may seem weird, like to walk around with that around your neck. Right. Or if you're a Jew in Galilee, to put that on the outside of your synagogue, as many of the Galilean synagogues did, they had multiple Medusa heads facing in different directions. But the idea here was."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6351.68,"end":6352.96,"speaker":"Fr Andrew Stephen Damick","text":"And that was bad, by the way."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6354.8,"end":6403.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. That was not a good thing that they did that on those synagogues. Now, note that they had them on the outside, not the inside. But still, it was Galilee of the Gentiles for a reason. But so in the story of Medusa, Medusa is this priestess who is super beautiful and a little bit vain, and so gets. Gets cursed by the gods because they do that. And so she becomes the Medusa, so no one now can look at her. Right. Without getting turned to stone and dying. So one of the common things in ritual as a whole, and we won't go too deep into this, but is that you. You reenact or you depict something in order to ward it off?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6404.3,"end":6404.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6405.42,"end":6436.55,"speaker":"Fr Stephen De Young","text":"Right. This is a real rabbit trail, so I'm not going down it, but this is actually how Aristotle's Poetics works and makes sense in terms of his understanding of Greek tragedy. But so Medusa is sort of this image of someone who had something really bad happen to her. Right. She got cursed. Right. So the image of Medusa was seen to ward off, like, ill fate. Right. And curses that other people might direct at you."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6437.11,"end":6437.67,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6438.07,"end":6455.22,"speaker":"Fr Stephen De Young","text":"So you sort of depict a curse to ward off a curse was sort of the general idea. But there were amulets and that kind of thing, depicting all kinds of things for these various reasons that were used in these sort of idolatrous ways as sort of an access point to spiritual powers."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6455.46,"end":6584.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So the thing that this kind of reminded me of, like having Medusa heads on the outside of buildings to, like, ward off evil. The thing it reminded me of actually was gargoyles. And so I. I looked up, I was like, okay, what is the deal with gargoyles? And it seems that originally gargoyles, even on the outside, and. And the words, we're used to them being like, on Gothic cathedrals. Right. But actually gargoyle heads, particularly heads, were also depicted on the outside of other kinds of buildings, too. It was not just churches. So here's. Here's what I discovered originally, most gargoyles were just the head and the neck of a dragon. And later on you get, you know, the kind of bat, like, you know, human bat, Werebat. There you go. A werebat sort of looking thing. But eventually, initially, it's just heads and necks of dragons. And this seems to come from a 7th century or so Legend about Saint Romanos of Rouen in France, that he defeated a dragon that was terrorizing the people by making use of a cross to defeat it. And so they dragged the body back and they were going to burn the whole thing, which they did. But the head and the neck, because it had been sort of so galvanized by the fire of the dragon, did not burn. And so Saint Romanos hung up the neck and the head on the outside of the church, essentially as a kind of a warning to other demons. Like, you know, if you come around here, this is what's going to happen to you. And so there is. I mean, it is kind of weirdly parallel, but it's more like, you know, putting the heads of your enemies on spikes outside the gate kind of thing, than this sense of that this face is going to itself sort of ward off evil, you know, But. But there is a certain kind of curious parallel to that. No, we do not have any gargoyles on the outside of our church here in Emmaus, just FYI."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6585.22,"end":6586.9,"speaker":"Fr Stephen De Young","text":"But if someone wants to donate one."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6588.74,"end":6590.14,"speaker":"Fr Andrew Stephen Damick","text":"I'll submit it to the parish council."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6590.14,"end":6592.58,"speaker":"Fr Stephen De Young","text":"And we'll see what the bishop thinks."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6593.22,"end":6594.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, exactly."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6596.34,"end":6603.1,"speaker":"Fr Stephen De Young","text":"Yeah. So those being sort of the types of idols, then where do you find said idols?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6603.1,"end":6603.7,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6604.42,"end":6668.22,"speaker":"Fr Stephen De Young","text":"And of course, there's some obvious ones. Right, so you've got temples. That's a big. Right, yeah. At the center point of a temple, as we've talked about before, you have the image of the God, but then you also will find them in shrines. And what separates a shrine from a temple is generally that shrines are at some natural feature. A cave, a grove, a spring. Right. A valley, a cleft in the rock. Right. Some kind of place that's associated with spiritual activity, where there's been some kind of spiritual encounter in the past, as we've talked about before. And then that will be a place where a shrine is built, because it's seen as sort of being a natural access point. And then that will usually have images brought into it. And then probably the most important one, but the one we think about the least, is that at the center of every home, for example of the first century ad, you had a hearth. Right. And at that hearth, that hearth, especially in Roman religion, was the most important part of the home. Right, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6668.22,"end":6668.98,"speaker":"Fr Andrew Stephen Damick","text":"Right in the middle."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6669.86,"end":6694.39,"speaker":"Fr Stephen De Young","text":"And that would be the place where you had what are sometimes called in, in the Bible, the household gods. Right. You would have the, the small idols or images of the gods of the family, the clan, the ancestors, the place where you lived, the place where you used to live your trade guild. Right. All sort of collected there. Right. Who are sort of your gods. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6694.39,"end":6715.31,"speaker":"Fr Andrew Stephen Damick","text":"And it's, and it's important to mention, like what is a hearth. Right. I mean, that's, that's the place where all the food gets prepared. That's the place you gather around for warmth. Like it really is a major, major place in your home. And probably there's eating going on right there as well because, you know, the food is hot off the hearth and you eat it right there."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6715.55,"end":6721.96,"speaker":"Fr Stephen De Young","text":"Right. There's a reason why Isaiah talked about kindling a fire for warm fire, making food, and then there's also idols."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6722.68,"end":6724.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because this all happens in one spot."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6724.76,"end":6780.68,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And this is the gathering place for the family. This is where family interactions with each other, prayer, all that kind of thing is going to happen. Right. So the origin of what we would now call an icon corner or a prayer corner in an orthodox house is with the purification of this. Right. The removal of the idols from this family gathering place and the replacing of them with the icon of Christ. Right. First and foremost. And then later also of the saints. Right. Who are not, as we've talked about many times, not just sub ins for, for other pagan gods, but are the saints of glory who have actually replaced those fallen pagan gods."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6780.76,"end":6783.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Defeated them. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6784.6,"end":6830.47,"speaker":"Fr Stephen De Young","text":"Right. And so I'm going to suggest. Right. That it's interesting to note in 2nd Corinthians 4, verse 6, St. Paul talks about seeing the face of Jesus Christ. He speaks in a way that suggests that the Christians in Corinth have seen the face of Jesus Christ. Right. And when I say he conveys that they've seen it, he's using a reference to the glory of God in the face of Jesus Christ as a way of not materializing, but making the idea that the power of God is made real for them in the face of Jesus Christ. Right. That's the place where they see it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6831.27,"end":6831.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6832.23,"end":6841.99,"speaker":"Fr Stephen De Young","text":"And so if they haven't ever actually seen the face of Jesus Christ in Corinth, his argument doesn't work so well."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6842.95,"end":6845.27,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because Jesus never went to Corinth."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6845.99,"end":6884.56,"speaker":"Fr Stephen De Young","text":"Right. Anywhere near. So that implies to me that we've already got something like iconography, iconographic tradition starting now, if you want to say they weren't replacing those getting rid of those idols and replacing it with an icon of Christ in their home, that's fine. If you want to say, hey, they were putting up icons of Christ in their synagogue, I won't argue with you about that. That's a fine alternative. I think less likely that the local synagogue would be putting up icons of Christ than that Christians would have them in their homes. But. Okay. But it is a strong argument that something's happening there, I think."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6885.36,"end":6903.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, we've just kind of gone through the hardware and the location, so to speak, of idolatry. And when we get back after our break, in just a moment in the third half, we're going to be talking about what exactly does idolatry do to you? So we will be right back after this break."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6904.48,"end":6920.71,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6929.67,"end":6939.15,"speaker":"Fr Andrew Stephen Damick","text":"Are you curious about the Orthodox Christian faith? Do you have questions about Orthodox Christianity that you can't trust strangers in Internet forums to answer?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6939.31,"end":6941.83,"speaker":"Fr Stephen De Young","text":"Are you an Orthodox Christian looking for."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6941.83,"end":6961.56,"speaker":"Fr Andrew Stephen Damick","text":"A reliable first place to send your interested friends? Do you need help finding an Orthodox church near you? My name is Father Paul Hodge. I serve in the Antiochian Orthodox Christian Archdiocese of North America. My name is Father Joseph Lucas. I serve in the Orthodox Church in America. My name is Father Anthony Cook."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6961.64,"end":6965.08,"speaker":"Audience Member","text":"I serve in the Greek Orthodox Archdiocese of America."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6965.24,"end":6974.6,"speaker":"Fr Andrew Stephen Damick","text":"And I'm Fr. Andrew Stephen Damick, chief content officer of Ancient Faith Ministries and a priest of the Antiochian Archdiocese. And we're the Orthodox Intro team."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6974.84,"end":6976.56,"speaker":"Fr Stephen De Young","text":"If you're looking for a first stop."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6976.56,"end":6978.56,"speaker":"Fr Andrew Stephen Damick","text":"Online to get an introduction to the."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6978.56,"end":6980.92,"speaker":"Fr Stephen De Young","text":"Orthodox faith, a place to get answers."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6981.08,"end":6986.91,"speaker":"Fr Andrew Stephen Damick","text":"To questions from qualified Orthodox Christian clergy, a place to send your friends and."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6986.91,"end":6990.11,"speaker":"Fr Stephen De Young","text":"Not just toss them into the chaos of the Internet."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":6990.27,"end":7011.31,"speaker":"Fr Andrew Stephen Damick","text":"A place to get help finding an Orthodox parish and get plugged into an actual Orthodox community. Then point your web browser@ orthodoxyintro.org Orthodoxintro.org is a free service of Ancient Faith Ministries and made possible by our donors. It's an Orthodox on ramp to the Christian Life. Again, that's orthodoxintro.org."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7020.2,"end":7036.04,"speaker":"Steve","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7038.13,"end":7041.89,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of the Lord of Spirits podcast."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7042.21,"end":7045.97,"speaker":"Fr Stephen De Young","text":"So I like that commercial. It's got a good beat."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7046.13,"end":7047.05,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. Thank you."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7047.05,"end":7068.9,"speaker":"Fr Stephen De Young","text":"I don't know if you could dance to it, but I feel there was a missed opportunity when you guys all introduced yourselves that you didn't say after that. And by our powers combined, we are orthodoxintro.org I feel like that was that. That was a strike. You should not have let passed. You should have. You should have swung. You should have swung."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7069.3,"end":7087.86,"speaker":"Fr Andrew Stephen Damick","text":"Well, yeah. Thank you for that note. All right, well, before we get to exactly what idolatry does for you, so to speak, or to you, really, we do have a caller and Sal is calling in. So, Sal, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7088.82,"end":7090.74,"speaker":"Audience Member","text":"Thank you. Fathers, can you hear me?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7091.3,"end":7093.22,"speaker":"Fr Andrew Stephen Damick","text":"We hear you. What's on your mind?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7094.18,"end":7154.09,"speaker":"Audience Member","text":"I was reading in the Life of Saint Macarius, the spirit bearer and other desert fathers that when they go out to the desert, it seems to be that the demons don't follow them there. But, like, that's kind of the demon hangout. And they mentioned a lot of times like, hey, we got to get this Macarius out or whoever, they're making a paradise of our desert. And then you read in the Gospel where God says when you. For Christ says when you banish a demon, they go into dry and deserted places. And you combine that thought with the idea of sending a goat out to the desert for Azazel. And then you combine that idea with the idea of, like, Taos, New Mexico, having these weird, like, spiritual, dark vibes to it in the American Southwest and all that type of stuff. And there seems to be a connection with the demonic and the actual physical desert. And am I reading too much into that, or is that something that. Yeah, that's kind of where they kill."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7155.45,"end":7180.16,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that is definitely a thing. You know, you get that in the Bible and there's that idea that they're described as wandering spirits. And usually that's the place where you encounter them. I mean, if I recall correctly, when Jesus is tempted, he goes into a wilderness place and he's confronted by. By the devil. Father, what do you have to say about this?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7181.6,"end":7281.14,"speaker":"Fr Stephen De Young","text":"Well, to quote Val Kilmer's greatest film role, you don't want to go to the desert. So anybody who gets that reference, I'll have to figure out some kind of prize to give them. Immediate family members are disqualified. So, yeah, the wilderness. Right. For Israel we've talked about paradise remembers this walled garden that God has put in order, right, and filled with life. Right. And so the contrast with that, the opposite of that is the desert, right, is the wilderness, which is not put in order and is full of death. Right? There's decaying animals, dead people. Right. Scavengers feeding on carrion. Right? So it is, in a sense, the outside of Eden. That's why you get, as you point out in St. Macarios, this kind of contrast. He, by going there, right, he sort of brings God with him the way Adam and Eve were supposed to bring God with them out of. Out of paradise, into the world. And by doing that, he's turning the wilderness into a paradise. He's setting it in order, filling it with spiritual life. And the demons don't like that. Right. Sort of happening in real time. Now, we shouldn't take that in a materialist sense, right? Like, don't go to Arizona. Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7283.14,"end":7286.9,"speaker":"Fr Andrew Stephen Damick","text":"But I believe he singled out New Mexico earlier, actually."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7287.7,"end":7333.01,"speaker":"Fr Stephen De Young","text":"Yeah, but I mean, Breaking Bad, Better Call Saul, come on. Good television. Anyway. Yeah, so we should take into that kind of material. But it's sort of, if a garden, right, an ordered tended garden that's full of life and beauty, if that's our idea of where God lives, then you could pretty quickly see how the wilderness, the desert is going to be the antithesis of that. Right. Sort of a wasteland is the opposite of that. But the response to that is not to just never go there. The response is to try to go there and bring God there as the desert fathers did."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7336.46,"end":7343.1,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense? Sal? Hello?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7345.5,"end":7346.46,"speaker":"Fr Stephen De Young","text":"Speak to a Sal."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7347.02,"end":7348.38,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I think we lost him."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7348.46,"end":7349.58,"speaker":"Fr Stephen De Young","text":"Who did this to you?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7351.98,"end":7358.54,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, hopefully that makes some sense. I was, like, looking at my instruments, like, did I just lose everybody? But then I heard your voice and it was okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7359.9,"end":7364.13,"speaker":"Fr Stephen De Young","text":"Okay, well, that's the most romantic thing you've ever said to me."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7365.81,"end":7385.17,"speaker":"Fr Andrew Stephen Damick","text":"I'll take that in the Shakespearean sense of a romance, like the Tempest and that kind of thing. All right, well, hopefully that was helpful to Sal, so we're going to take one more caller. We have Father Elijah calling. So. Father Elijah, are you there?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7385.89,"end":7386.69,"speaker":"Audience Member","text":"I am here."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7387.65,"end":7388.13,"speaker":"Steve","text":"Welcome."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7388.69,"end":7393.83,"speaker":"Fr Andrew Stephen Damick","text":"He isn't always Sobey. Welcome to the Lord of Spirits podcast, Father. What's on your mind?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7395.19,"end":7397.99,"speaker":"Audience Member","text":"Well, I was fascinating. I was just listening with my family."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7407.11,"end":7408.71,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I think we lost Father."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7413.43,"end":7416.47,"speaker":"Fr Stephen De Young","text":"Finally. Technical difficulties that aren't mine."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7416.71,"end":7417.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there you go."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7417.63,"end":7417.99,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7419.93,"end":7438.09,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, I'm going to try again. So, Father Elijah, you're there. We lost you for a second. Okay, well, so if we can get him back, you know, Matushka. Trudy, just let us know if he comes back. I'll just ask one more time. Father Elijah, are you there?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7438.81,"end":7439.93,"speaker":"Audience Member","text":"We lost you for a second."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7440.57,"end":7442.81,"speaker":"Fr Andrew Stephen Damick","text":"Oh. Are you there, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7445.05,"end":7445.85,"speaker":"Audience Member","text":"My name is Frank."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7446.69,"end":7457.25,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Well, all right. We're going to move on here until we get things worked out over there with the call board."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7457.41,"end":7458.61,"speaker":"Fr Stephen De Young","text":"That could have been the Pope."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7459.57,"end":7462.37,"speaker":"Fr Andrew Stephen Damick","text":"Really? You think the Pope would call and say, hi, my name is Frank?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7462.53,"end":7465.09,"speaker":"Fr Stephen De Young","text":"I don't know. He's low key."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7465.49,"end":7467.33,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. It didn't sound Argentinian."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7467.33,"end":7471.81,"speaker":"Fr Stephen De Young","text":"Comes off as humble. I don't know. I'd have a lot to say to him."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7474.04,"end":7518.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true. We could just set aside the rest of the episode to have a conversation with the Pope. All right, well, so, okay, idolatry, we've talked about, you know, what you need to. What. What someone, you know, what they. They used for idolatry and where you located and all that kind of thing. So, so, you know, we. We talked about setting them up, taking care of that. You know, we've talked about a lot of this stuff before, you know, the opening of the nostril ceremony and of course, putting food in front of it, this kind of stuff. So what's the point? You know, does it actually have some kind of effect on the worshipers? Right. That's what we're talking about here in the third half. So. So, so what's going on with that, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7518.76,"end":7520.2,"speaker":"Fr Stephen De Young","text":"Yeah, the answer is yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7520.44,"end":7526.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes, I can't say goodnight. And that'd be funny at this point because it's already been two hours."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7526.32,"end":7580.92,"speaker":"Fr Stephen De Young","text":"So this is your brain on idolatry. This is sort of laid out to us, right? So the Old Testament isn't against idolatry just because God decided he didn't like it. Right. And so we put it out on the rules. Like, none of that in this house. Right. Get out of this house. If those are the clothes you're going to wear, get out of this house. If you don't cut that hair. Right. It's not like that kind of rule. It's because idolatry does something to humans when they do it. Right? Because all worship has a transformative effect on the worshiper. Right? Right. So that's kind of telegraphed in Psalm 115 in the Hebrew 114, if you're reading the Greek verses three through eight."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7582.6,"end":7611.17,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so what that says, starting with verse three, our God is in the heavens. He does all that he pleases. Their idols are silver and gold, the work of human hands. They have mouths but do not speak, eyes but do not see, they have ears but do not hear, noses but do not smell, they have hands but do not feel, feet but do not walk, and they do not make a sound in their throat. Those who make them become like them, so do all who trust in them."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7613.33,"end":7717.53,"speaker":"Fr Stephen De Young","text":"Right. And so the contrast here is with that second part of verse three, right. Our God, who is in the heavens, he does all that he pleases. He does whatever he wants. He's all powerful. Right. And these. These gods who are being worshiped by means of idols don't really do much of anything. Right. They have things done to them. Right. They're created, they're cared for. Things happen to them, but they don't do anything. Right. And then the same thing is going to happen to those who follow them. So we have to do a little bit of our step back and quick review here. We've talked before about how language, art and music and ritual are ways that we as humans engage with the world. And things that shape our human consciousness shape the world around us in terms of how we experience it. Right. And so idolatry is a form of ritual, but that includes, obviously, art and crafting the idol can include music in the worship, language and the worship. Right. And so participating in idolatry, using idolatry as your mode of worship and your mode of interacting with the spiritual world is going to shape beyond just that act. It's not just a side, but it's going to shape how you view other people, how you view the world around you and objects in it, how you view the divine, your view of God or the gods."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7718.09,"end":7718.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7718.81,"end":7722.09,"speaker":"Fr Stephen De Young","text":"And how you relate to and interact with all of these things."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7722.25,"end":7731.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How you treat everybody. So. Yeah. Okay, so apparently we have Father Elijah back, so. Father Elijah, are you there?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7733.05,"end":7734.33,"speaker":"Audience Member","text":"I'm here. Are you here?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7734.73,"end":7738.09,"speaker":"Fr Andrew Stephen Damick","text":"I'm here. Okay."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7738.41,"end":7739.61,"speaker":"Fr Stephen De Young","text":"I'm all the way over here."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7740.1,"end":7743.22,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes. We're all in different places or where is there."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7743.3,"end":7745.66,"speaker":"Fr Stephen De Young","text":"No. Yes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7745.66,"end":7746.34,"speaker":"Fr Andrew Stephen Damick","text":"I was just."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7747.78,"end":7847.86,"speaker":"Audience Member","text":"I was very fascinated by the talk about the ancient role that the hearths played in homes and that that would be kind of the, you know, the gathering of the household idols. And that was also kind of the social and spatial center of the home. And in a lot of modern architecture, our living rooms are kind of the center of the home. Often a living room is now merging with the kitchen, and often in the middle of all of it will be a really wonderful place with outlets to plug in a television. And I'm an Orthodox priest now, but I grew Up a Protestant. And I know in the Protestant language of idolatry, we love to materialize our idolatry and we love to talk about worshiping the television, worshipping technology. And I was wondering, in the Pajobian, you know, Jonathan Pageau talks about how sometimes worship and attention go together. I'm just wondering, you know, in your thoughts of this interaction of the center of the home, historically being a place where idols would be. Now we have technology. How do we just, you know, pull apart, you know, attention to things that maybe grab our desire and our attention and those that are spiritually maleficent and seeking to, you know, more classical, maybe old gods versus new gods, the classic paganism, classic idolatries versus maybe these new spin of idol, new spin on idols and attention. Does that make any sense? I'm sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7848.18,"end":7853.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I think so. In fact, I mean, in some ways, I think you're sort of setting up for the conclusion of this podcast."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7854.5,"end":7855.3,"speaker":"Audience Member","text":"I'm sorry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7855.46,"end":7997.33,"speaker":"Fr Andrew Stephen Damick","text":"No, no, no, it's good. But I mean, I can't speak for the way that Jonathan Pageau would address this. Not that you were asking that in particular, but you mentioned him. I mean, I will just say this. Well, one, it's interesting, actually. I think that more and more family gathered around a television set is not hardly even a thing. More and more, it's people's gathered each separately around his. His or her own device. You know, we've all got the WI FI password, right? So. So there, there's. I think there is some truth to that. The other thing I'll say though is that attention is definitely an element in worship, but. So it's a necessary condition, but it's not sufficient, right? So just paying attention to something does not mean that you're worshiping it, right? Or idolizing it, you know, but definitely there is. Like, I think you are onto something, in my opinion that what you pay your attention to, and I have always loved that expression that attention in English is something we pay, right? Like, it's like you're, you know, like you have a finite amount of it. You can't pay attention to everything all the time. You know, that, that what you pay your attention to does transform you. You know, like, it's, you know, one of the classic pieces of pastoral advice to someone who has trouble battling lustful thoughts is, you know, control your eyes, dude. Right? You know, I'm sure you've experienced that in the priesthood, right? Like, control your eyes. What are you looking at? What are you listening to? You know, that kind of thing. So so there is some truth to that. And I think that the way that idolatry works is. It. It really. It. It's. It's. It's that par excellence. Right. Like, you're really going into communion with a thing that you are engaging in idolatrous worship of, you know, like. Like, it's one thing to, you know, contemplate an image of some false God. It's another thing to actually put food in front of it and then eat some of that food, you know?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":7997.33,"end":8029.05,"speaker":"Audience Member","text":"Yeah, that's. That's very helpful, because in my before. In the before years, when I was in your before times missionary, my before times, when I was a Protestant missionary, I lived amongst a lot of people in Southeast Asia that literally would sacrifice food and chickens to idols. And, you know, growing up Protestant, there was a lot of this talk of attention, and I was like, you know, it doesn't seem that when I'm paying too much attention to my phone or to the TV that I'm doing what they're doing. There might be an overlap, but there is a distinction. So."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8029.05,"end":8045.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. I mean, you saw real idolatry. Like, that's the real deal, what you saw. You know, putting food in front of images and then eating parts of it. That is pretty much the key movement in idolatrous worship. Father Stephen, do you have anything you wanted to add, or. I'm actually."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8045.28,"end":8048,"speaker":"Fr Stephen De Young","text":"Or I'm not gonna. I'm actually. You."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8048.24,"end":8049.12,"speaker":"Fr Andrew Stephen Damick","text":"Oh, thank God."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8049.2,"end":8063.44,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, I don't know if it's idolatry per se, but any opportunity I get to kind of talk badly about our current cultural media landscape, I'll take, you know, and."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8063.68,"end":8066.64,"speaker":"Fr Andrew Stephen Damick","text":"And as we talk on a podcast."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8066.96,"end":8099.98,"speaker":"Fr Stephen De Young","text":"Yeah. Guy Debord said, you know, decades ago that everything that used to be directly experienced is now presented to us in the form of spectacle. Right. And you see that every day when you see people in front of some big event, watching it through their phone. I think in a lot of ways, the state we're in now is worse than the ancient pagans. The ancient pagans were communing with demons, but at least the whole family was commuting with the same ones."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8103.26,"end":8106.06,"speaker":"Fr Andrew Stephen Damick","text":"Whereas it's not an endorsement either way, by the way."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8106.06,"end":8240.8,"speaker":"Fr Stephen De Young","text":"Yeah. Whereas now, you know. You know, and 50 years ago, it was the isolated. Not to go back to last episode, but the isolated nuclear family, all at least staring at one tv. Now everybody has their own screen. And so each one is having this stream of images, because that's how we receive information now is almost purely through images fed into them separately on a separate stream, and each one of them is being formed by it separately and thereby being alienated from each other and from everyone else. And so this is. Is sort of profound, profoundly anti communal technology. Right. This is. This is not just breaking down the family, but every kind of social bond that there is so that the only thing any individual is connected to anything through is through that conduit of, you know, their feedback. Yeah. So I just want to be Debbie Downer and once again tell everybody to quit social media. Yeah. And. And we've told ourselves this fiction that all this stuff is making our life better, and we all know it isn't. None of us are happier because of it. None of us feel more connected to people because of it. We're just. We're just fooling ourselves. So there's. There's going to be a crisis point at some point, barring, you know, some catastrophe that destroys the Internet and sets us all free. I don't know which way it's going to go. But, yeah, we've. We've lost the hearth. And I think a key part, we've talked about this on the show before, a key part of trying to rebuild and come together again as families and extended family in this community has to be rebuilding the hearth. And a real practical way to start with that is the prayer corner, the icon corner."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8240.8,"end":8318.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm a big fan of almost anything. I mean, it's interesting, you know, like, I. Well, I'll just back up. I'm a big fan of almost anything that gathers together the family and focuses on a thing like it's really, really worth it to do family dinner every night, if possible. If it's not possible in a given night, you're gonna do it tomorrow night. You know, I'm a big fan of, you know, parents reading to the whole collection of kids all at once. Even the one that can't stop wiggling. You know, I think these are just such critical, critical things that in former generations were taken much more for granted. And now the, you know, the atomization of even the people living in the same house now has really accelerated. It looked at, you know, at the beginning of the pandemic, it almost looked like there was maybe some reversal of that. Right. But I don't know. I don't think it lasted maybe a hot minute, but. But yeah, I think what Father Stevens said is right. That we've kind of lost the hearth. Yeah, yeah, yeah. Does that make sense, Father?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8319.85,"end":8388.12,"speaker":"Audience Member","text":"No, it makes absolute sense. It was when we first moved here to Northern California, and we bought our house. There was actually a big, blank, unpainted square where the TV used to be from the previous owners. And we intentionally actually set that up as our hearth icon corner to replace technology with. And so we have a facing east one that we usually pray towards, but we also have that, like a symbolic hearth icon corner where the TV previously was with the previous owner. So I really appreciate all that you've mentioned. Thank you so much. And just if I could say one brief thing, over a decade over overseas in Southeast Asia, so much of what you've. This podcast has talked about, the territorial spirits and all these different things. Even this very episode is alive and well, especially in Thailand and Southeast Asia. And it's. It's shocking how much similarities there are to what you and Father Stephen were just talking about and what's actively going on in Southeast Asia. So just amazing. So thank you so much."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8388.52,"end":8408.2,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. And I'll add, you know, it's. It's growing here in America, people engaging in these. And I think some of them, in some cases, I think it's because people are seeking out some kind of hearth. Right. They're getting it wrong, but I think that's. That's part of what's going on, so. Well, thank you very much for calling in tonight, Father."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8408.44,"end":8409.43,"speaker":"Audience Member","text":"Thank you so much, Father."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8410.3,"end":8444.86,"speaker":"Fr Andrew Stephen Damick","text":"All right, so we were just talking about how ritual shapes who you are, especially through the elements of it, often, including language, art, and music, shapes the way that you think about God and other people and how you interact with them, how you see them and so forth. So, I mean, how does idolatry and what it does in that regard, how does that contrast with Christianity, which is the hope is that it's doing something to you as well, but functioning in a different way and having a different result."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8445.82,"end":8446.78,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8447.02,"end":8447.42,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8449.42,"end":8607.65,"speaker":"Fr Stephen De Young","text":"Without going too far down a rabbit trail, one of the problems in understanding what Christian ethics is is that we've inherited this thing where we divvy up the Torah somewhat arbitrarily. Right. But in the Torah, there's no distinction between, here are the rituals by which you worship your God, here is the way you treat each other, here is the way you govern your community and order your community. Right. These are all part and parcel of the same thing. And so what we normally think of as Christian ethics actually has a ritual dimension. Right. We've talked about this on the show before. So when we see the scene of the Last Judgment, and we're about to start the Triodeon. But when we see the scene of the Last judgment in Matthew 25 in the parable of the sheep and the goats, right? We're told about what makes the sheep, sheep and the goats, goats. The basis of their judgment is not what they believed, the results of a theology test or anything else. It's what they offered to Christ. And it's what they offered to Christ through the least, the lowest of humanity, right? The poorest, the most needy, the least able to repay, that they were the vehicle through which people made offerings to Christ or failed to make offerings to Christ. And so this gets back to what we were talking about a little last time. The idea that humans being made in the image of God, makes them icons of God, right? That they are iconography and how this is the opposite of idolatry, right? That they are sort of conduits to God, to Christ. So when you offer a cup of cold water to a little one, right? You are offering it to Christ, right? It is an offering to Christ in these sacrificial sense, right? Hospitality offered to other humans is hospitality offered to Christ. And so this is why we have, as one of our two paradigmatic commandments, love your neighbor as yourself, right? Because. And that's why it is linked. That's why Christ says, it is like it, right? It is. It is parallel to it, love the Lord your God, right? Love Yahweh your God. Why? Because those two are the same thing, right? You love God and you love him through his image, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8607.65,"end":8615.81,"speaker":"Fr Andrew Stephen Damick","text":"Which is why it says also, if a man says he loves God and hates his brother, he's a liar, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8616.13,"end":8693.39,"speaker":"Fr Stephen De Young","text":"You can't not do both, right? So idolatry, then if we're correct that it's an inversion, if it's the opposite of iconography, right? Idolatry is a means of worship that is directed at controlling spiritual forces. And sort of the most gross form of this, of course, is ancient magic, right? But all ancient ritual centered around idolatry had this same element, right? That the idol, as this access point, is the place where you could stick your lever to move deity, right? This is the spot where I could put it. And I can pull and I can bend divine forces to my will. I could bend spiritual forces to my will. So if I do it and I don't get the result I want, well, maybe I did the ritual wrong, right? Maybe the priest messed up. So we kill him and try again with another priest. Maybe there were some Christians around who didn't participate. So we kill them and try again with another pagan ritual, right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8693.39,"end":8693.79,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8694.11,"end":8736.01,"speaker":"Fr Stephen De Young","text":"But there was some problem that caused the gods to not accept the offering and not do what we wanted. Or maybe we need to offer more. It was very common in the ancient world to just straight out offer bribes to God to make offers to them. We even see that in scripture, the story of Jephthah. Not the part with his. Well, it does include his daughter, but when he makes the vow, Right. He's kind of offering God, hey, if you give me victory, then whoever runs that, and it is whoever in the text, whoever runs out to see me, I'll sacrifice to you in Judges. Right. Sort of offering, trying to make a deal. Right?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8736.01,"end":8736.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8736.33,"end":8743.45,"speaker":"Fr Stephen De Young","text":"With a human sacrifice and this kind of instrument. Mentality is the opposite of love."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8744.73,"end":8756.9,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. Because love sets free, love functions in freedom. Love is not about trying to control anybody. I mean, that's not what love does. It doesn't control."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8758.5,"end":8764.34,"speaker":"Fr Stephen De Young","text":"Right. If you're trying to manipulate God and get him to do what you want, that's not the same as loving him."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8765.46,"end":8767.06,"speaker":"Fr Andrew Stephen Damick","text":"Humility. It's not. Yeah."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8767.46,"end":8770.18,"speaker":"Fr Stephen De Young","text":"And that's the difference between prayer and magic."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8770.58,"end":8771.14,"speaker":"Fr Andrew Stephen Damick","text":"That's right."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8771.46,"end":8802.47,"speaker":"Fr Stephen De Young","text":"And we've talked about before how sometimes people try to use prayer as magic. Right. Well, if I just pray hard enough and get enough people to pray and pray the right prayer. Right. Then God will do what I want. That's not prayer now, that's magic. Right. That's ritual. Magic is where you're heading with that. Right. But so if that's how you view God or the gods, if that's how you view the divine, if that's how you view the spiritual realm. Right. How is that going to bleed over into how you view other people and how you view things in the world?"}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8802.87,"end":8833.43,"speaker":"Fr Andrew Stephen Damick","text":"Right. And also, if you read the actual stories of these gods, this is the way they act. So, like, these are the exemplars, you know, as I think, you know, we've pointed out in this podcast before, you know, if your society worships Zeus, what does it do to your society when your most high God is a serial rapist? You know, that's the ultimate in, you know, being in your society is this kind of being."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8833.99,"end":8989.75,"speaker":"Fr Stephen De Young","text":"And your queen of the gods is just vengeful and jealous and constantly sort of hysterical and enraged. Pun not intended. Right, right, right. This then shapes how these people who participate in these rituals and it's reaffirmed and their consciousness reshaped every time they do these rituals. Right. The person who goes and casts a love spell is not only trying to manipulate spiritual forces, they're trying to manipulate another human, right. Into giving them what they want. Right. And so this is an idolatry, at its core represents an approach to the spiritual world and even the material world, because those are going to bleed over into each other based on instrumentality, based on seizing control of the levers, right. Taking control of fate by one means or another, right. Through an exercise of power and expertise and technique, I am going to become the master of my own destiny. This is where we can now wrap around again to talk about the way in which material goods, things like money, can be talked about in terms of idolatry. We talked earlier about how at the beginning of the second half, that can sometimes be done in sort of a hackneyed way, right? Where it's just like, oh, well, if you think about anything other than God, you should be thinking about God, right? That sort of platonic idea. But the goods of this world, the good things of this world can be viewed in this sort of instrumental way. So an example from scripture is when Christ tells the parable of the rich fool, right? He has this big harvest, so he builds more barns, he fills them up, he says, ah, now I have all this food, I can now take my leisure, I can retire, I can enjoy good things for the rest of my life. He thinks because of his wealth and success, he now has command of his life. Right. And he's then called a fool because he's going to die that night. Right? Right. And so his money, his wealth, his planning, all of that did not allow him to seize control of the forces of the universe, did not allow him to seize control of his fate. And so for him, that wealth and planning and success were idolatry. Right. He was participating in idolatry because he was using them as the lever."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":8990.31,"end":8999.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And like all idolatry, it just proves that the lever is garbage, that it doesn't actually do what it claims to be able to do."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9000,"end":9003.2,"speaker":"Fr Stephen De Young","text":"Right. It's less powerful than the person who's trusting in it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9003.52,"end":9048.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting. I mean, you think about even now, like, this has happened maybe not enough, but it's happened a number of times in recent years that we see people who are ridiculously wealthy and powerful, that they lose it all and they end up in jail or dead or, you know, whatever it might be. Thus proving, again, the parable of the rich fool that just because you have all the whatever in the world does not mean that you're going to get the results that you want. You know, you have. I mean, how many times does it say In Scripture that the people who are in places of power are there because God has allowed them to be, that the people who have things have them because God has given them to them. You know, it's. It's emphasized over and over again."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9049.49,"end":9069.97,"speaker":"Fr Stephen De Young","text":"Right. And so over and over again in liturgy. Right. In Christian worship, because it's about love. It's about offering ourselves and everything we have and everything we are to God and also offering all that to our neighbor. Right. Who is in need. That's the opposite of trying to take control of God or take control of our neighbor."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9070.37,"end":9110.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, it's notable in ancient pagan culture that social stratification was considered absolutely the norm, and that if you were above another person, it was completely correct and right and normal and natural for you to. To step on that other person and make use of them because you were in the position that you were in because the gods had put you there. And it was normal that you should treat other people as less than you and in many cases, as not even being people. I mean, that's the way that the whole ethics of the ancient world worked was based on this web of manipulation and control and people stepping on each other's faces."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9112.03,"end":9152.19,"speaker":"Fr Stephen De Young","text":"Right, Right. And we could approach it, you know, to use the language Isaiah used. Right. What is it that you're counting on to save you, to deliver you when everything goes wrong? Are you planning on. Well, I've got a lot of money saved up, so the chips are down. I'm prepared. I've got my money. I've got my bitcoin. I've got my gold buried in the backyard. Right. I'm going to be fine because of that. Right. Or some relationship we have. I've got the right friends, you know, I've got. I've got this taken care of, got that taken care of. You know, I've. Where is it that you're looking for your salvation when that happens? Right. If it's some kind of instrumentality, then that's idolatry."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9153.24,"end":9542.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. You know, something occurred to me when we were talking about all this earlier, which is that, you know, this sense of trying to offer bribes in order to get what you want. I mean, it's. You know, when. When Christ is in the wilderness and the devil comes to tempt him. It's almost like the devil is trying to treat Christ in an idolatrous way. You know, like, I'll do this for you if you will only do this. You know, give. You know, like he's trying to bribe him to to get what it is that, that he wants. I mean, it's not that the analogy doesn't completely hold, but I mean, but again, it's that theme of instrumentality and manipulation and control, which is, you know, what the pagan gods demonstrate. It's what they expected. And it's absolutely the opposite of what God demonstrates and what he expects and what he, you know, he came and offered himself, right? That destroys all the bribes, you know, that act of total selflessness and self giving. So. All right, well, to wrap up our conversation this evening, the big thought that I had, especially here towards the end is that so much in the modern world as we now experience it is designed to make us believe in magic. It's ironic because, you know, supposedly we're modern, enlightened, rational people who don't believe in magic, but how much that we're being offered constantly is about if you do this thing, then you will get these results, right? And it's utterly addictive, whether it's our health or our financial situation or our technology, you know, some kind of book that tells you how to fix relationships or whatever it might be, right? We're being trained to engage with the world in magical means, magical ways all the time. You know, that's not to say that we. That there is not a certain kind of instrumentality that is normal, right? Like, you know, if I need to make myself breakfast, I pull out the ingredients and I, you know, I make breakfast, right? I should expect the results. But at the same time, as a Christian, I have to surround this stuff with prayer and with gratitude to God for even giving me the ability to do those things. Right? But again, it's so tough when we have so many buttons literally in our lives not to think of other people and even to think of God himself as a kind of button. If I just press this button, I should get this. If I just do this for this other person, I should get that. But that's not the way that God shows us how to be this past Sunday in our tradition anyways. The gospel that we read was the gospel of the Canaanite woman who comes and approaches Christ when he's up in the region of Tyre and Sidon and asks him to heal her daughter who's possessed by a demon of all things. And she asks and she asks, and the Lord Jesus initially ignores her and then eventually says things that could be taken as insulting towards her, right? But she keeps going. And she says, even when he says, you know, I was not. It's not right to give the food of the children give it to dogs, you know, basically calling her a dog. And she persists and says, yes, but even the crumbs that fall from the master's table, the dogs, you know, might ask for those, right? So she approaches him with this humility. She doesn't offer him a bribe. She doesn't try to manipulate him. She just makes this request and she accepts even what seems like insults from him. She accepts the bad treatment of his disciples, who tell him to send her away like she's bugging us, Lord, send her off, you know, And. And his response to her is, great is your faith, great is your faith. He said to her, right? And this is what faith in the Christian sense really is. This is what faithfulness in the Christian sense is to draw near to God and to ask for his mercy and to show gratitude and humility and to receive whatever it is that he offers, whatever it is he's going to give, to realize that that's the thing that we actually need for our salvation, right? Not to come in saying, look, this is what I expect, Lord, and you better do it. Don't you know how much I did for you? That kind of thing. Which, again, that's magical thinking, that's manipulative thinking. And so I think we need to be mindful in our modern period of how much we're being trained to be manipulative and to have these kinds of instrumentalized expectations of God and of other people. And, you know, like Father Elijah called earlier and made mention of attention, where we put our attention, I think so many times we just can't be bothered. And so we don't put our attention where it really should be. We'll pay attention to God long enough to get what we want, and then when we get what we want, you know, we look at something else, right? So I think a lot of the cure for this is to reorient our attention towards what is highest, towards what is noblest, towards what is good and beautiful and holy, and to practice gratitude for all that we receive, and receive it as from the Lord, because He has sent it to us for our salvation. It's not easy. It's one of the great struggles of the modern age. But I think this is the way of salvation for those of us who live in this particular set of surroundings. Father STEPHEN."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9545.36,"end":9919.16,"speaker":"Fr Stephen De Young","text":"So one of the most difficult things, one of the most terrible in the original sense things about our life in this world at this time is that we have a future. We don't usually think about it that way, but the Future is a thing that kind of always torments us, whether we want to admit it or not. In fact, a lot of people will say that they're sort of tormented by their past. But most of the times when people are tormented by their past, it's actually more that they're haunted by some possible future that existed in the past, but now doesn't and can't. We look toward the future and we see a lot of negative possible futures, things that we don't want to happen, that we don't want to transpire, roads that we don't want to travel, and ways that we don't want to live, and we want to ward those off. And we can imagine futures where we want to live, that we want to be true, that we want to come to fruition, and we want to find ways to sort of guarantee those, to make those permanent and secure in our minds. And that's what draws us. That's what drew ancient people to idolatry. That's what draws us to various forms of idolatry. We want to find the lever, we want to find the button, the place where we can apply the pressure, the procedure we can follow the ritual we can do that will make sure that those good futures we want happen and those bad futures that we don't want don't, so that we won't have to look back at our past anymore as. And see those possible good futures that died and those negative futures that became our reality. The problem is they don't exist. The problem is that we have a future because we're finite and we don't know what's going to come in the next moment and the moment after that and the moments after that. On the other hand, Christ has given us a hope. And I use the article there on purpose. It isn't just that Christ has given us hope in a general sense, like the last thing out of Pandora's jar, where, oh, things will get better. Oh, tomorrow's another day, right? Tomorrow may be a worse day. Things may get worse and not better in any given person's life, let's be honest. But he's given us a hope, a particular hope. And it's a particular hope because it's true. It's not a possible future. It is the future. He's described it to us, he's outlined it to us. Christ is bringing it about in the world as we speak. It will happen. And rather than giving us a vote, right, rather than us getting to choose what our part in that is going to be, what our lot in life is going to be what we want our personal future to be. Christ has given us that as a promise and told us that. Therefore, we don't need to worry. We don't need to spend our time worrying about what we will eat and what we will wear. We don't need to spend our time worrying about those negative futures or imagining those positive futures. He has the future in his hand, but more than that, he's told us how to participate in it. He's told us how to do our peace in bringing that future about. He's given us the tools to transform ourselves and our lives, to transform our families, to form and transform our communities, to transform our world ultimately, which is what that future is going to ultimately mean. And rather than trying to cast a vision for ourselves, make a mission statement, try and create some future that we find to our liking for whatever reason, usually based on our base desires and passions. We can instead spend our time and our effort working toward the future that is real. And when we do that, that's when we find the freedom from that worry. That's where we find the freedom from worry about the future, the freedom from being haunted by the past and what could have been or we think should have been or might have been. And that's where we come to day by day, regardless of our external circumstances. Whether we're locked down in our houses, whether we're getting a promotion at a job, whether we're paying off the mortgage on our house, whether we're losing our house because we can't pay the mortgage. That's where we experience the future that is in Christ. The love and joy and peace of the Holy Spirit, regardless of those circumstances. So every one of us has something very concrete that we can do over and over again in every moment of every day. We can pray. We can show love to the person who's sitting across from us or standing next to us or near us. We could just listen to them. We could just smile at them. We could just pay them a compliment. We have all kinds of work to rebuild the alienation we were talking about tonight, to rebuild all of the broken relationships we were talking about tonight. And as we do that, the future comes more and more into focus, becomes more and more real. Because that's what St. Paul told us in Hebrews, that our faithfulness to what God has called us to do is the substance of the things that we hope for. It's what makes them substantial and real."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9920.84,"end":9946.06,"speaker":"Fr Andrew Stephen Damick","text":"Well, thank you very much, Father. And that is our show for tonight. Thank you everyone very much for listening. If you didn't get a chance to call in during the live broadcast, we'd still love to hear from you, either via email@lordofspiritsancientfaith.com or you can message us at the Lord of Spirits Podcast Facebook page. I read everything. Father Stephen skims some things, but we can't respond to everything, that's for sure. We do Save some of what you send for possible use in future episodes."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9947.02,"end":9955.35,"speaker":"Fr Stephen De Young","text":"And join us for our live broadcasts on the second adventure four Thursdays of the month at 7pm Eastern, 4pm Pacific. Except for next time when it will be Memorex."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9955.67,"end":9966.31,"speaker":"Fr Andrew Stephen Damick","text":"That's true. If you're on Facebook like our page, join our discussion group. Leave reviews and ratings everywhere, but most importantly, share this show with a friend whom you know is going to love it."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9967.19,"end":9973.59,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to asianfaith.comsupport and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9974.23,"end":9977.12,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much, Good night and may God bless you all."}
{"episode_id":"LOS - #037 - 2022-02-10 - The Gods of the Nations","start":9992.56,"end":10029.77,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported prestige presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
