{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":0.4,"end":65.06,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests, Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":69.7,"end":238.09,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back to the Lord of Spirits podcast. I'm Fr. Andrew Stephen Damick and with me is my co host Fr. Stephen DeYoung. And if you are listening to us live, you can call in at 855-AF-RADIO. That's 855-2372-2346 and we will get to your calls in the second part of today's show. Now this is a very content heavy show. I think they're all going to be that way probably and we want to balance that with your calls. So don't feel bad if you don't get through this time. Just you know, reconnect, try next time and God willing, we'll get to talk to you. So last time we introduced this brand new program by talking about divine plurality in the scriptures. That is the idea that, that there are multiple kinds of divine beings for whom the Bible uses the word gods, angels, demons, and even dead humans. And we also were clear that there's no one among these gods who is like Yahweh, the God of Gods and Lord of Lords, the Father, Son and Holy Spirit. And then we got to talking a bit about angels and demons. But there is so very much more to discuss on this and of course we'll probably be talking about angels and demonstrations pretty much as long as this program is around. So we wanted to continue today our conversation on these divine beings by beginning with the Divine Council. The Divine Council. And that's an image that is given in scripture and of course also depicted in the writings of the church fathers, in Orthodox iconography, in Orthodox church architecture and in the Liturgical texts of the church. And so to get us into this, I just want you to picture this, the icon of All Saints. Right. So if you don't know what that looks like, you can actually go to our Facebook page, the Lord of Spirits podcast Facebook page, and you'll see that today we shared some images of the All Saints icon. Also icons of the synaxis. That's the gathering of the archangels. And, you know, if you look at that icon, you'll see there's Christ in the center, and he's typically enthroned. Sometimes he's enthroned on angelic beings, and then he's surrounded by his angels and his saints. So that's the image that I want you to keep in your mind, especially as we talk about the divine council. So, you know, Father Stephen, we've got our Bibles open. It's almost like now, this isn't your Bible study podcast. The whole Council of God, which I super recommend everybody, but I do think you probably will generally want to bring your Bible to listen to this show. I've got two Bibles next to me, and hopefully that's enough. But, yeah, Father Stephen, why don't you lead us into this discussion about the divine council? And we're going to begin with the whole Holy Scripture."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":239.53,"end":438.68,"speaker":"Fr Stephen De Young","text":"Absolutely. So what we're talking about when we talk about the divine council is the fact that God, in this case Yahweh, the God of Israel, our God, is God Most High. You may be familiar with that phrase from the early parts of Genesis, but that phrase, the Most High, you may have noticed, is also what demons call God. For example, in the exorcism stories in the Gospels, they refer to Christ as Son of the Most High. And this is because of a relationship that was understood by pretty much everyone in the ancient world that there was not. Sort of. We talked last time about how monotheism wasn't a category in the ancient world that people used. So no one thought that there was this one God who they worshiped, who stood all by himself in the heavens. And that's not the picture we're given by the scriptures, but in what we find in the ancient culture surrounding Israel is they had what we've mostly been taught, if we've studied mythology in the modern world as a quote unquote pantheon, that there's sort of this group of gods who are in charge of things. But that's not really how it worked in the ancient world. Right, right, right. The way it worked in the ancient world is that individual Cities and places and regions and nations had a God, a spirit whom they worshiped and who they saw as sort of their patron in the heavens. And then when you have larger units develop, like Sumeria or Assyria or Akad or Syria, the Phoenicians, etc. All of those gods get put together into sort of a group. And generally, whichever city or region had ascendancy, their God is seen as sort of the king of the gods. And it's not just a question of there being one God who's sort of on top at any given time, but uniformly in all of these cultures, there is a Divine Father who is seen as the Most High God, and then a divine Son who is actually the primary God who receives worship, who is the one who presides in the council of the gods. So you have El and BAAL with the Canaanites, you have Ea and Marduk with the Babylonians. You have Kronos and Zeus with the Greeks. And the key difference here in the conception when we get to Israel, is that they see Yahweh as filling sort of both of those roles. There is a Yahweh the Divine Father and a Yahweh the Son. And this isn't something that Christians come up with. This is something that's in the Torah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":439.16,"end":493.77,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. And they're both. And they're both Most High God, which I think it's really important to emphasize that title for a second because. Not that we want to dive back into what we talked about too much in our previous episode. I think there's going to be a lot of overlap between all of our episodes. But you don't say Most High God if there aren't other divine beings. Right. And yet that title, the Most High, is used over and over again in scripture. So clearly there is this sense that he is God over other divine beings. And like you said that in the case of ancient Israel, that the Most High God is both the Father and the Son. I mean, in most of those other stories. Right. The Son is overthrowing his father, typically. Right. Isn't that right? Or often. Yeah, yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":494.41,"end":502.49,"speaker":"Fr Stephen De Young","text":"Or the Son is overthrowing a previous Most High God, at least. There's what's called the succession myth. The succession story."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":502.89,"end":503.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":503.69,"end":515.93,"speaker":"Fr Stephen De Young","text":"Where there's this. There's this transition. And when we get to talking about the Devil, we'll talk about how the way he's presented in scripture is sort of mirroring those stories, but pointing out that those. That story actually had a different result."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":516.41,"end":518.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He fails."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":518.89,"end":621.92,"speaker":"Fr Stephen De Young","text":"Right. The propaganda that the Baal worshipers and the Marduk worshipers, etc. Etc. The Zeus worshipers would have you. Would have you believe. But. But it. It's important also here to recognize along with the difference that there is Yahweh the Father and Yahweh the Son and that. That there is no succession, those being two key differences. The rest of that picture, the picture that there is this council, this divine council over which Yahweh presides, is very much in continuity between Israel and the surrounding nations. So the language that was used particularly by the Canaanites, the Canaanites referred to sort of the council of gods as the sons of El, because El was their. Their most high God. And so that sons of L. That sons of God language is taken over directly into the Old Testament to refer to angelic beings, huh. Who are not gods in and of themselves, but are members of this council through whom God's will is expressed. In the same way that a king on earth has, you know, viceroys and regents and advisors and other people around him through whom he administers his kingdom. Yahweh, the God of Israel, is depicted as having these angelic beings through whom he administers his kingdom, which is, of course, all of creation."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":622.32,"end":669.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's interesting that they're called sons of God. Right. And I think, you know, like, that shouldn't be hard for us to grasp because you mentioned earthly kingdoms. I mean, your average earthly king tends to put his sons and his brothers and, you know, it's members of the family he puts in charge of elements of the government. And, you know, for human beings, that's not always necessarily a good idea. Just because you're a member of the royal family doesn't mean you're good at it. But, you know, we're not talking about human family here. We're talking about God and his son, our Lord Jesus Christ, and then these ranks of angels that are referred to as sons of God. Right. And that title appears in a number of places in the scripture, doesn't it? Sons of God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":670.58,"end":679.06,"speaker":"Fr Stephen De Young","text":"Yes. I mean, sons of God, famously, at Genesis 6, which is a whole separate discussion that we'll have here in coming weeks."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":679.46,"end":683.14,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, hold on to your hats for that one, everybody."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":683.78,"end":724.55,"speaker":"Fr Stephen De Young","text":"Yeah, but all through the Psalms, it's used every. And this is one of the reasons why in the New Testament why the Greek word monogenes. I know people are used to that being translated only begotten. But I have bad news for you. That's not what it means. The begottenness of Christ is reflected in, for example, Proverbs. There are biblical texts from which the fathers derived that idea. It was not just from the word mono yis. Mono yis really just sort of means unique. So it's saying Christ is the unique."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":725.59,"end":726.39,"speaker":"Fr Andrew Stephen Damick","text":"One of a kind."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":726.79,"end":767.36,"speaker":"Fr Stephen De Young","text":"Right. To distinguish his sonship. Right. His sonship is different because he's begotten from the Father. His sonship is different from anyone else who gets the title son, son of God, including, Of course, believers. St. Paul at the beginning of. Of Romans 8, for example, talks about us becoming sons of God. And sometimes that gets occluded by our modern translations that want to be more gender neutral. And they say children of God. And so you lose the sons of God language. And so you sort of lose St. Paul's point that it's not just a family metaphor, but it's referring to this role of sons of God in the divine council."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":767.6,"end":781.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, doesn't even Christ use that term in Luke? Or am I misremembering that where he talks about becoming sons of the resurrection? Maybe I'm misremembering. Exactly."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":781.54,"end":786.3,"speaker":"Fr Stephen De Young","text":"Yes. I don't think he uses the term sons of God there, but I may be misremembering too."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":787.74,"end":789.66,"speaker":"Fr Andrew Stephen Damick","text":"I'm going to look this up while we're talking here."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":789.66,"end":790.58,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":790.58,"end":823.48,"speaker":"Fr Andrew Stephen Damick","text":"No, so Luke 20:36. Now, I'm not looking at the Greek, but at least in the new King James, it says they are equal to the angels and are sons of God being sons of the resurrect. Yeah. Okay. Well, there you go. So that language is actually used by Christ himself. At least I'm looking at this translation. I can grab my Greek. Let me get up here for a break just to make sure I'm looking at the. I don't want to mislead anybody here, but yeah, this is a really important phrase that appears at a lot of times in the Bible."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":825.32,"end":845.1,"speaker":"Fr Stephen De Young","text":"Yeah. And this idea is so central that it's part of how we understand the place, quote, unquote. Right. Because of course, the place where God is, is not a physical place, as if he's, you know, somewhere and not other places. But."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":845.1,"end":845.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":845.5,"end":865.22,"speaker":"Fr Stephen De Young","text":"The. The place where God dwells, the place where he is, is described in terms of his being surrounded by the angelic beings in the council. And this is part of why, as you mentioned in iconography, you see Christ enthroned upon angelic beings. Right. We talk about God sitting upon the cherubim."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":866.42,"end":866.82,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":867.3,"end":913.74,"speaker":"Fr Stephen De Young","text":"We're going to talk about, probably later on in the show, some Angels whose names reflect the fact that they're parts of God's throne. But beyond that, the place where God dwells is referred to as the mountain of assembly. It's harmoid in Hebrew. And that's, you know, this is again, something that's, that's held in common with pretty much every other culture in the ancient world who believed that gods lived in sort of a combination of two places. Number one, because there was so much desert in the ancient near east, the place where God dwells must be sort of luxurious and verdant. So it must be some kind of garden."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":914.45,"end":914.77,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":914.85,"end":925.01,"speaker":"Fr Stephen De Young","text":"And then. And then it must be some place where mortals fear to tread. Right. And don't go. And so it's on a mountain."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":926.05,"end":926.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":926.69,"end":929.41,"speaker":"Fr Stephen De Young","text":"And so you get the specific assembly idea."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":929.65,"end":970.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And of course, for, I mean, like, I'm thinking about the mythology that I remember reading when I was a kid, and the one that comes to mind, of course, is Mount Olympus. You know, and I remember seeing those movies from the 1960s. Right. I loved all those Greek mythology movies where you've got, you know, the camera pans up the mountain and goes through some clouds and there's Zeus and Hera. You know, you're usually like next to some kind of fountain or something like that. And. But then they're all surrounded by all these gods. Right. So there's this, this common notion that all ancient peoples have of the most high God is up on a mountain somewhere and he's surrounded by all of these other divine beings. Right. And. And that's in the Bible too."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":971.8,"end":1024.93,"speaker":"Fr Stephen De Young","text":"Yeah, that's. And that's as one of our callers last week brought up for baal, that was mountain Zaphon, the mountain of the north. And that then becomes not one, but several mountains over the course of the scriptures. I mean, the famous obvious examples are Mount Sinai and Mount Zion become the place where God dwells, become the mountain of God. And then, of course, when you get to the New Testament, Mount Tabor at the event of the transfiguration. And what we see in all those cases is not just, oh, well, this is the place where God is temporarily, but there are specific mentions in all of those cases of this angelic council surrounding him at those places. Right. The law comes through angels, according to St. Paul."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1025.4,"end":1102.41,"speaker":"Fr Andrew Stephen Damick","text":"Right. On Sinai, the law comes through angels. Yeah. It's interesting, you know, like, I think about, you know, so much of this, like, to look at these things in scripture closely is rewriting the images in my mind that I grew up with. So, I mean, I Grew up Evangelical Protestant. I grew up reading the Bible, but also, like, I wonder sometimes how much people's sense of. For instance, what happens in Exodus is formed by Charlton Heston. Right. You know that movie, the Ten Commandments? I think about that scene where Moses receives the Ten Commandments, where he receives the law. And he's on this mountain by himself, he's all alone. And then, you know, these letters appear on the side of the mountain. You know, they're being burned to the side of the mountain as God gives each one of the Ten Commandments. And then they kind of burn out of the mountain. And he's got these two tablets and then he takes them down and. And it's funny, like that was the image in my head of Moses receiving the law from God. But that's not what the Bible actually depicts. It actually talks about angels being involved, that he's surrounded by the heavenly hosts, that Moses goes to meet God and there is the divine council surrounding him. Right?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1102.57,"end":1157.86,"speaker":"Fr Stephen De Young","text":"Yeah. If we follow all of the data that's in the whole of the Scriptures, what happens is Moses, after his 40 days of purification, ascends the mountain, comes into the garden of God at the top of the mountain, enters into the tent in which God dwells with the divine council, where he's surrounded by the angelic beings there, speaks to him face to face. Right. He gives the covenant with. On the tablets written with his own hands. Right. Which is. Which is then delivered to him. And then he descends and he creates the tabernacle. This is according to St. Paul's Epistle to the Hebrews. He creates the tabernacle as a replica of the place he went and what he saw when he was on top of the mountain."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1158.18,"end":1221.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right. It's interesting, you know, when you read the Bible as a whole, then some of these pictures become clearer. Whereas if you just pick out maybe the main narrative, then some of it is kind of sometimes is left out and you only get it from other parts. Right. Like that reference to the law being received through angels is not. I don't think it's there in Exodus, is it? It doesn't say that explicitly there. Exodus, no, but clearly first century Jews believed this, you know, so it's. It's this tradition that's, that's included in and witnessed to in other parts of Scripture. But it's hard, you know, sometimes it's hard to connect the dots. You don't know. Like, I'm sure I read that line about the law being received through angels when I was a kid. And didn't think, oh, wait, I need to rewrite my picture of what happens on Sinai with Moses is not like with Charlton Heston. You know, as much as I love the movie, it's a great movie."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1222.93,"end":1234.05,"speaker":"Fr Stephen De Young","text":"And St. Paul in Galatians, when he's talking about that fact, goes so far as to make the point that the person who Moses was speaking to face to face was Christ."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1234.61,"end":1236.53,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1238.21,"end":1288.48,"speaker":"Fr Stephen De Young","text":"That, that's, that's the, the Yahweh who he saw is, is the God, the Son, who was incarnate in these latter days. And that's, that's key to. I don't want to go into that now, but that's key to the argument St. Paul is making in Galatians in not repudiating the Torah, he's ultimately arguing the Torah came from the same Christ who now has fulfilled it. But so, yeah, so the picture part of it is that, that in the ancient near east, as I said, these, these ideas were so common and so well known that reading the text of Exodus, you know, for centuries, the hearers of the text, because they weren't actually reading it themselves, but the hearers of the text understood this whole picture from the text."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1288.88,"end":1290.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1290.16,"end":1293.68,"speaker":"Fr Stephen De Young","text":"Because they knew where gods live and how that works and."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1294.24,"end":1327.18,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right. They didn't, they didn't need all those details written in there. So. Well, we've got about eight minutes until we're going to go to break. So let's try to look at some specific Bible passages that just, you know, give a little bit of the evidence of what we're talking about. So we won't think, oh, they're just making this stuff up. You know, let's actually dig in a little bit to that before we go to break here in just about eight minutes. So I see you have in notes, you've got Psalm 82, which probably you're going to be hearing about Psalm 82 a lot in this show. So what's going on there?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1328.3,"end":1332.02,"speaker":"Fr Stephen De Young","text":"Let me do one text first and I don't. And then I'll get to Psalm 82."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1332.02,"end":1332.94,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Yeah, sure."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1332.94,"end":1466.2,"speaker":"Fr Stephen De Young","text":"And this, this one I don't want to go into too super deep because we'll get into it more again when we talk about the devil in particular. But in Isaiah, Isaiah 14, 13, and sort of the accusation against the, the being who we know as the devil, God says to him, you said in your heart, I will ascend to heaven above the stars of God, I will set my throne on high. I will sit on the mount of assembly. In the remote parts of Zaphone, again, Mount Zaphone, because he's the devil's here, being connected to baal. But there's that language of his rebellion being, attempting to sit on the throne in the assembly to sort of overthrow God as king and, and take his place in his rule over creation and, and the beings whom he has created. So that Psalm, Psalm 82 that we talked about last time, the that that begins with God, has taken his place in the council of the gods. In the midst of the gods, he holds judgment. So there is this place, right, For God who presides, and then he. He judges those other gods. And in verses six and seven, it's, it's. I said you are God's sons of the Most High. All of you, nevertheless, like men, you shall die and fall like any prince. So see that language of sons of the Most High, you see them being called gods. And based on the way Christ quotes this in St. John's Gospel, he is identifying himself as the God of Psalm 82, verse 1. He says that these gods who are condemned here are the ones to whom the word of God came. Right? Logos. The u is in St. John's gospel does not refer to the Bible."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1466.44,"end":1469.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, that's him. He's the word of God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1470.04,"end":1472.04,"speaker":"Fr Stephen De Young","text":"He is the Word made flesh. Right?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1472.84,"end":1473.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1473.56,"end":1518.25,"speaker":"Fr Stephen De Young","text":"So he is that one, that divine son who presides over the council and renders judgment. I think we also talked briefly about Psalm 89, verses 5 through 7 last time, but just read that again quickly. Let the heavens praise your wonders, O Yahweh, your faithfulness in the assembly of the holy ones. For who in the skies can be compared to Yahweh? Who among the sons of God is like Yahweh, a God greatly to be feared in the council of the holy ones and awesome above all who are around him. So you very clearly have that idea of him being surrounded by this council."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1518.81,"end":1599.39,"speaker":"Fr Andrew Stephen Damick","text":"Right. And I think it's important especially there to see that comparative language like who is like you. Right. Because we got a little bit of pushback, just a little bit of pushback on social media from a couple people kind of suggesting, based on our last episode, like, are you guys polytheists? Really? Should you be talking about gods in the plural and so forth? But the thing is that the scripture not only uses this language of God being the most High God, which means there are other gods, but also this language of other gods, but also makes this comparative point. Who is like Yahweh? Well, answer no one. No one is like him. So just because we use the word God to refer both to the Father, Son and Holy Spirit, and even to demons or to angels or to departed human beings, doesn't mean that we mean that they're the same kind of being. The point is that he's incomparable. Nothing compares to the one true God. Right. So I think I just wanted to kind of underline that point again, you know, this notion that, you know, that there are no other gods who are like the one true God. He's God in a way that they're not, but we still use the word God to refer to all of them. So. Yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1599.39,"end":1605.67,"speaker":"Fr Stephen De Young","text":"And the same way that we say, you know, Christ is man, but he's not just a man because we say that."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1606.23,"end":1609.19,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right, right, exactly."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1611.19,"end":1616.87,"speaker":"Fr Stephen De Young","text":"So we could say Christ is man with a capital M, the same way we capitalize the G in God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1617.27,"end":1627.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's the man. Not to be a little too. He's the man. You know, but I mean, you know, like Psalm 1. Right. Blessed is the. The man who is the man who walks not in the council of the ungodly. Well, he's the one."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1629.76,"end":1770.66,"speaker":"Fr Stephen De Young","text":"So I won't read the text of these, but people can. Look in Job, chapter 1, 612 and Job 2, verses 1 through 6, which both describe this probably familiar to people. Heavenly scene of the council sort of being convened. And the Satan. Satan is not a name in Job. It's an office that someone holds the enemy, the adversary. But so he then comes into the council. And the one that I want to read on, and this will probably bring us to the end of our first half, once we talk about it a little, is this is probably the most controversial example too, in terms of weird Old Testament texts that people don't like talking about. And that's at least for tonight. 1 Kings 22, verses 19 through 23, which is third kingdoms, if you're using like the orthodox study Bible or something else based on the Greek text. And so what's happening here is, is Ahab has finally kind of reached his limit of wickedness, and so now is going to be subject to judgment. And so Yahweh, the God of Israel, has decided, now's the time, right? I'm going to put an end to Ahab. And so we now have this scene unfolds, and Micaiah the prophet is now describing this scene. So starting in verse 19. And Micaiah said, therefore hear the word of Yahweh. I saw Yahweh sitting on his throne. And all the host of heaven standing beside him on his right hand and on his left. And Yahweh said, who will entice Ahab that he may go up and fall at Raymouth Gilead? And one said one thing and another said another. Then a spirit came forward and stood before Yahweh, saying, I will entice him. And Yahweh said to him, by what means? And he said, I will go out and will be a lying spirit in the mouth of all his prophets. And he said, you are to entice him and you shall succeed. Go out and do so. Now. Therefore, behold, Yahweh has put a lying spirit in the mouth of all these your prophets. Yahweh has declared disaster for you."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1770.9,"end":1790.98,"speaker":"Fr Andrew Stephen Damick","text":"Wow. So, yeah, that's interesting. Like, okay, that God basically says, I'm going to take Ahab down. You know, do I have any volunteers? Right, right. The scripture basically says that these different spirits step forward and say, well, I've got an idea. I've got an idea. And then one says, I'll do this. And God picks that one."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1792.02,"end":1816.43,"speaker":"Fr Stephen De Young","text":"Yeah. And God sends that spirit to go. And basically to go into all of the prophets who Ahab listens to, which aren't the good ones. It'd be the prophets of BAAL at this point. And tell him that, yeah, if he goes into battle, he's going to win. It's going to be a route, it's going to be an incredible victory, when in fact, he's going to be defeated and killed."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1816.83,"end":1818.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1818.19,"end":1842.67,"speaker":"Fr Stephen De Young","text":"And so this. This bothers many people because it sure sounds like God has this evil, lying spirit working for him who he sends to go trick Ahab. So the first thing I would point out is notice, though, that after this scene unfolds, God sends his own prophet to Ahab to warn him."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1843.31,"end":1844.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1844.43,"end":1857.95,"speaker":"Fr Stephen De Young","text":"That's what Micaiah is doing. Micaiah basically comes to Ahab and says, look, this is what's happening. Yahweh, the God of Israel, has sent a spirit to all those prophets you're listening to. They're lying to you. If you go into battle, you're gonna die."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1858.67,"end":1859.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1859.99,"end":1862.59,"speaker":"Fr Stephen De Young","text":"And so Ahab has to choose who to believe."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1862.99,"end":1876.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You have to look at the whole picture, the. The whole story all at once. You can't just pick a moment in it and say, well, I don't like what God is doing right here, you know? Yeah, yeah, I'm sorry. Go ahead."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1876.85,"end":1882.53,"speaker":"Fr Stephen De Young","text":"Well, I was going to ask if you wanted to read this from St. Gregory the Dialogist. Comments on this?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1882.85,"end":1983.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah. So I thought this would be a good way to end up this segment with a quote from one of the Holy Fathers talking specifically about this passage that we that we just read. So this is what St. Gregory the deologist also called Gregory the Great in the Western tradition. This is what he says. And this is from his text called the Moralia in Job, chapter two. What is the throne of the Lord? Unless we understand it as the angelic powers, he is enthroned on high in their minds, and thus he controls everything below. What is the host of heaven? Unless it means the many ministering angels? Then why does it say that the host of heaven stands on his right hand and on his left? Since God exists in everything and is also outside everything, he is not limited by right and left hands. But the right hand of God is the elect part of the angels, and the left hand of God means the fallen part of the angels. Not just the good serve God by the help they give us, but the wicked also serve him by the trials they inflict on us. Not just the ones who lift up anyone who turns back from sin, but also the wicked who push down anyone who refuses to turn back. So the angelic host stands on the right hand and on the left hand of God, the will of the elect spirits harmonizes with the divine mercy. And the minds of the fallen ones, when they serve their own evil ends, obey the judgment of God's stern decrees. So we're going to talk a little bit more about what he says about evil spirits serving him in the third part of our show today. But why don't we go ahead and go to a break and we'll be back and we will start taking your calls in the second part of the Lord of Spirits."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":1984.6,"end":2002.28,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2007.4,"end":2060.52,"speaker":"Fr Evan Armatas","text":"Hi, this is Father Evan Armitas, priest at St. Spyridon Greek Orthodox Church in Loveland, Colorado, and and the host of the Ancient Faith Radio Sunday Night Call in show Orthodoxy Live. I am pleased to announce today the release of my first book for ancient faith publishing titled Toolkit for Spiritual A Practical Guide to Prayer, Fasting and Almsgiving. It seeks to provide a guide to the three basic and primary disciplines of orthodox spirituality. Through these disciplines, Christ opened for us a path that frees us from the disordered way of Life has become normal for many, even though their hearts and minds tell them otherwise. Please join me in exploring the three legged stool of Orthodox spiritual practice, Prayer, fasting and almsgiving. Books now available@store.ancientfaith.com and the title once again is Toolkit for Spiritual Growth. I look forward to sharing it with you. God bless."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2064.68,"end":2080.85,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2084.13,"end":2294.46,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. This is the second part of our show and it's where we begin to take your calls. So you can call us at 855-AF-RADIO. That's 855-237-2346. You can also send questions to the chat room, but we would especially love to hear your voices. And just to kind of wrap up from the first part of the show, I just wanted to remind you of those images that we talked about at the beginning, the icon of all saints, the icon of the synaxis, of the bodiless powers of the archangels. And you can look at our Facebook page, the Lord of Spirits Facebook page, and you can see lots and lots of images of that. The other thing I wanted to mention is an element from church architecture, and that is something called the Synthronon. Now, in most Orthodox churches now, the Synthronon is actually very sort of reduced in its form, but you'll see behind the altar table in the eastern part of the church, in what is that area called the apse, you'll see a throne there in many churches, if there's space for it. And that is the bishop's throne. And then sometimes you'll see chairs next to it. Well, again, if you look at our Facebook page, you'll see we posted pictures from ancient churches of what is called the Synthronon. And you'll see that it almost looks like a miniature colosseum. Right? So there's kind of one throne in the middle and then these rows of like bleachers almost next to it. And so what's going on there? That's actually the fuller ancient form of the sine throne on. And that is the place where the bishop sits at certain parts of the Divine liturgy, not the whole thing. And his presbyters sit next to him again at certain parts of the divine Liturgy in the hierarchical divine liturgy of the church. And that image is exactly an image of what we've been talking about, the divine Council. So the bishop is the icon of Christ and then he's surrounded by his presbyters. You can see both just the general sense of the divine council, but also the idea that this is Christ with the apostles next to him, ready to render judgment at the parousia, at his second manifestation. So those are just some images to have in your mind. But anyways, we want to get to some of your calls and we promise, by the way, that on this show that no question, no question is too weird. And I don't know how many of you are old enough to remember the TV show Frasier from the 1990s, but I've always wanted to have a call in show where I said I'm listening. So we are listening and we're going to get to your calls in just a second. And we want to talk now about specific angelic beings. So we're going to get now into some details of the angelic beings. So Father, again, let's bring us in. We're going to talk about St. Dionysius the Areopagite. A lot of people think about him when you're talking about ranks of angels and the types of angels. But of course, you know, the name, the various kinds of angels, the ranks of angels are all described in scripture. They're described in the anaphora of the Divine Liturgy. Right. I think both Chrysostom's liturgy and Basil's, if I'm remembering correctly. I don't know if I'm misremembering there, but you hear about principalities, powers, dominions, thrones, et cetera, et cetera. Right. So lots of different kinds of angels. And one of the questions we've gotten sometimes is are these like different species? Like, why do some angels look like wheels with wings and eyes on them and others look like human beings with wings? You know, so, so what, what's, what's going on there? Like, why do angels look so different in various icons?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2295.74,"end":2321.75,"speaker":"Fr Stephen De Young","text":"Right. Well, that's, yeah, that, that species issue is important in terms of myth busting a little is that tends to be how we look at it. You know, we look at it like sort of like, you know, fantasy races. Right. Like there's dwarves and elves and gnomes and. Right. And so we've got these different types of angels or angelic species that look different ways. But of course, angels don't reproduce."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2322.71,"end":2323.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2323.11,"end":2328.87,"speaker":"Fr Stephen De Young","text":"These angelic beings, or at least they're not supposed to. Genesis 6 again, but we'll get to that. Another."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2328.95,"end":2330.31,"speaker":"Fr Andrew Stephen Damick","text":"That'll be another episode."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2332.21,"end":2410.88,"speaker":"Fr Stephen De Young","text":"But yeah, but they, you know, they don't, they don't reproduce. So there are, there's like a species that has a certain appearance. Right. Based on that. And so angelic beings are really sort of cosmic intelligences. And the descriptions we generally see of them are more human beings struggling to describe what they're seeing. You know, and so you get wheels with eyes and sometimes sort of crazy sounding things. But these, these different ranks of angels that we talk about are exactly that. They're, they're ranks, these titles are really jobs. And part of the problem with how we talk about them is that because we don't want to say the word gods, right. As we talked about last time, we end up calling them angels or angelic beings so that we don't, you know, trigger anybody. But angel is actually one of those jobs, right? The word angel means messenger, so that's one of the jobs. Not all of these ranks obviously have that job. So even calling them angels is technically inaccurate, right?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2410.88,"end":2418.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It would be like saying the whole army is made up of privates, you know, corporals or whatever. Sergeants. Right?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2418.74,"end":2419.18,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2419.18,"end":2438.74,"speaker":"Fr Andrew Stephen Damick","text":"You know, yeah, yeah. So, okay, so before we get into some specific ranks of them, we want to take one of your calls. And we have Ashley calling from Minnesota. And Ashley is calling. She says that she used to be a polytheist who was told to worship Yahweh. So Ashley, are you there?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2440.67,"end":2444.35,"speaker":"Ashley","text":"Yeah, so long time listener, first time caller. Ha ha ha."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2445.95,"end":2447.95,"speaker":"Fr Andrew Stephen Damick","text":"We've been listening for two weeks. Good job."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2451.47,"end":2490.81,"speaker":"Ashley","text":"Well, if you've heard the first episode. Right, so. But it's not just me, so I've heard this story a few times. So I'm going to give you the experience of a friend of mine. But I, I've heard this story several times. A friend of mine, very smart, incredibly intelligent person, quite literally worshiped Zeus and the Greek gods and in his devotionals one day was told, basically you've been a good and faithful servant, but now you need to serve the God we serve. And I've heard this story from other ex pagans and I'm curious on what you guys think is going on there."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2492.42,"end":2513.46,"speaker":"Fr Andrew Stephen Damick","text":"So let me get this straight, that you're basically saying that your friend. So this is a story that was told to you, but from multiple people that worship pagan gods, was told by someone in a spiritual experience that they need to worship the God that those gods serve, Is that what you're saying?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2515.06,"end":2519.1,"speaker":"Ashley","text":"Yes, yes. I had a similar experience with. Mine's not nearly as cool sounding."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2519.89,"end":2531.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh, okay. Yeah. So what's going on there Father Stephen, I mean, I have some thoughts, but Father Stephen, I don't. You know, I want to hear what you have to say about this first."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2533.09,"end":2582.57,"speaker":"Fr Stephen De Young","text":"Sure. Well, as, as we read in that quote from St. Gregory, even the, what we would call the demonic powers serve the true God despite themselves. Right? And this is why, you know, even though it may brush past us, we're told that ultimately every knee will bow and every tongue will confess that Jesus Christ is Lord, you know, both in heaven and on earth and under the earth, meaning the underworld, right? Sheol, Hades. And we see, for example, during Christ's ministry, whenever Christ actually approaches someone who's demon possessed, the demon is sort of compelled by his presence to confess his identity."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2583.53,"end":2583.89,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2583.89,"end":2695.17,"speaker":"Fr Stephen De Young","text":"Sort of against his, against his will, you know, because they know exactly, exactly who Christ is. And so we're going to end up talking about the Tower of Babel again in a future episode. But originally, when, when these powers and principalities were assigned by God to administer places and nations and cities and peoples, they were assigned as angels and it was to lead those people to, to God Most High, to right, Yahweh, the God of. The God of Israel. And despite the fact that they've been worshiped as an ends in themselves, that, that many of them have become fallen and become the powers and principalities that St. Paul says we're at war with. In Acts 17, when St. Paul is talking to them in Athens about the unknown God, about the most high God who's now calling them back to him through the gospel, he tells them that he was never that far off. Right. That it was still possible for them despite the intervening issues of paganism, to, to find their way back to God, to reach out and, and touch him. In Romans, St. Paul says that that the truth of this is, is written in the stars. He meant that literally that like the Magi coming to Christ's birth, that this, this had been there for these, these pagans still to see. He doesn't say that it's impossible. And so from my perspective, what you're talking about is just a modern actual occurrence of what St. Paul was saying was possible."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2696.29,"end":2783.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, and you know, the thing that I would, I was gonna say the thing that I would add also is that number one, it's, it's certainly possible that these demonic spirits that people are interacting with can be, you know, will serve the one true God if it's his will for him to, for them to do that. But also that you know, that one of the non rebellious spirits, you know, one of the Unfallen gods, so to speak. Right. The angelic powers, you know, breaking through into that person's experience and saying, you know, come on, it's time to worship the. The only God now. The. The only God worthy of worship. Right. So, you know, it's. It's hard to tell, right? Like, we're not, you know, Father Stephen and I are not demonologists. We're not exorcists, except in our task as priests. We're not, you know, we don't have, like, expertise in specific experience with angels and spirits and so forth. But nevertheless, you know, when you're talking about demonic spirits, they're not going to be dealing with someone in a straightforward way. I mean, these are big liars, Right. They're extremely deceitful. And so they're going to present themselves to people in all kinds of different ways. And so there's just so many possibilities, right, in a particular instance. But does that make sense to you, Ashley, what we're saying?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2785.19,"end":2790.55,"speaker":"Ashley","text":"Absolutely. It's very interesting. And again, absolutely love the show. Hope it keeps going for a long time."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2791.12,"end":2797.04,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much for calling, Ashley. Good to hear from you. Okay, so let's talk now. I'm sorry."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2797.04,"end":2807.44,"speaker":"Fr Stephen De Young","text":"Go ahead, Father. I was just going to say, you know, the Triparian of the Nativity says that those who worship the stars were taught by a star to adore the Son of righteousness."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2807.76,"end":2809.6,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep, exactly."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2809.68,"end":2810.32,"speaker":"Fr Stephen De Young","text":"Exactly."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2810.88,"end":2862.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So let's start talking about some of these very specific ranks. Right? So, you know, seraphim, thrones, dominions, etc. We've got a big list here, and I'd like to actually cover all of them. There's nine ranks, traditionally, right? Nine ranks of angels. And then a number of them are kind of grouped together like there's pairs. I'm seeing a couple of pairs here in this list. So let's start talking about. So, yeah, let's start. So we've got seraphim and cherubim are up at the top, and those are the ones that typically are depicted in really, you know, kind of weird shapes, among other. I mean, there's various that are. But seraphim and cherubim are kinds of angels that maybe people have heard those terms, more likely. And they're depicted often as, like, animals, aren't they? They usually look like animals."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2864.14,"end":2870.82,"speaker":"Fr Stephen De Young","text":"Well, maybe not in our modern art, but cherubs in particular are usually fat babies with little wings."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2870.82,"end":2871.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2872.62,"end":2874.3,"speaker":"Fr Stephen De Young","text":"In your Renaissance."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2874.3,"end":2877.5,"speaker":"Fr Andrew Stephen Damick","text":"No fat babies with wings on this podcast."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2880.71,"end":2928.54,"speaker":"Fr Stephen De Young","text":"Little harp playing. But in fact, Kiruv, which is where we Get. Keruvim is the plural. Keruv literally means a living creature. And so when you see, like, the living creatures in Revelation, those are. Those are Keruvim, but in particular, what they look like. If you've seen. We could probably post pictures of this after the show online. But if you've, if you've ever seen, probably the most famous ones are at the gates of Nineveh, which are now in the British Museum. It looks sort of like a Babylonian sphinx. It's got sort of wings and a lion body and the head of a man with sort of the ringlet beard."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2929.5,"end":2930.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2931.9,"end":2935.31,"speaker":"Fr Stephen De Young","text":"In Babylonian depictions, those are caravan."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2935.87,"end":2948.67,"speaker":"Fr Andrew Stephen Damick","text":"Now. Okay, so now I'm thinking, what about, like, griffins? Are griffins essentially just another kind of expression of the same being? Am I getting ahead of myself here?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2949.39,"end":2959.27,"speaker":"Fr Stephen De Young","text":"Well, yeah, well, well, no. In some cases, they, They're. They're sort of a, A later evolution of it because griffins fulfilled some of that same role. They're generally associated with royalty."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2959.9,"end":2961.26,"speaker":"Fr Andrew Stephen Damick","text":"Okay, right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2961.26,"end":2969.02,"speaker":"Fr Stephen De Young","text":"The role of, of the caravan was that they were throne guardians, that they, they protected the thrones of kings and gods."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2969.9,"end":2970.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2970.22,"end":2975.66,"speaker":"Fr Stephen De Young","text":"And of course, in the ancient near east, those were kind of the same thing most of the time, in their belief, at least."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2975.66,"end":2977.66,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":2977.66,"end":3018.91,"speaker":"Fr Stephen De Young","text":"And so we, we read about, of course, all through the Old Testament, God is described as being enthroned on. On the Caravim, seated upon the Caravim. And of course, there were the gigantic caravim in the temple. There are the Caravim on the Ark of the Covenant. That was in the Tabernacle. There are also Caravim woven into the. As tapestries in the tabernacle. And then there were giant caravim in the most holy place in the temple that were representing there the throne of God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3019.71,"end":3031.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, I mean, whether these have been statues or relief or icons. Statues. So we're talking great big statues in giant statues after."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3032.11,"end":3056.79,"speaker":"Fr Stephen De Young","text":"Yeah, in the ones that were in the temple in Jerusalem after Titus destroyed the temple in 70 A.D. or A.D. 70. Sorry. They were, they were taken to Antioch because after Jerusalem was destroyed, Antioch had the largest Jewish population in the world. And they were put on display in the Jewish quarter of Antioch as sort of a warning against uprisings there."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3057.75,"end":3059.75,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that must have been demoralizing."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3060.39,"end":3061.59,"speaker":"Fr Stephen De Young","text":"Yeah, that was sort of the."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3061.59,"end":3062.39,"speaker":"Fr Andrew Stephen Damick","text":"That was the idea."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3063.43,"end":3121.13,"speaker":"Fr Stephen De Young","text":"Yeah. Display of, Display of power there. But so those, those were representational of the throne of God being there and that the, The. The Ark of the Covenant and then the altar were the footstool of, of God's throne. So those, those were, were thrown guardians. And we talk about Christ being seated upon the caravan for that reason. The, the seraphim, which are often, when these are listed in order of rank, are often ranked higher. They're often seen as sort of surrounding the throne of God, but they had a similar role. They were also throne guardians. But rather than the Babylonian tradition that the Caravim are related to and that imagery, they're related to Egyptian imagery. The seraph is the Egyptian word for a serpent."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3122.01,"end":3171.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In fact, I mean, I'm, I'm, I'm not a linguist, but I'm just going to throw out a guess here and say that seraph and serpent are cognates. Just looking at the two words, that strongly suggests. Yeah, yeah, yeah, I'll have to go look that one up. So, but I mean, just to, just to pause here for a second. So we're talking about imagery, imagery from Egyptian tradition, from the Babylonian tradition. I mean, is, is the Bible. I mean, because these are in the Bible, is it being syncretistic? Are they incorporating, you know, Egyptian paganism and, and Babylonian paganism? I mean, my, my answer to that obviously would be no, it's not syncretistic. They're just. What's happening is, is that Israel and these other cultures are looking at the same reality and the way that it's being depicted is being, being borrowed, perhaps. Does that make. Am I right on this?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3172.85,"end":3177.09,"speaker":"Fr Stephen De Young","text":"Well, right. That the syncretism assumes it's not true."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3177.81,"end":3182.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. It's not true. So you're taking some pagan stuff, that."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3182.17,"end":3205.61,"speaker":"Fr Stephen De Young","text":"You'Re taking concepts, you know, that somebody is writing these things down and is just sort of grabbing concepts from the local culture and making something up. Right. If we believe these beings actually exist. Right. Then they would be encountered by all kinds of ancient people. And if ancient people are actually encountering them, we should expect the descriptions to be somewhat the same or similar."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3205.69,"end":3207.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3208.01,"end":3211.85,"speaker":"Fr Stephen De Young","text":"So, yeah, it makes perfect sense if this is true."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3212.57,"end":3219.69,"speaker":"Fr Andrew Stephen Damick","text":"Right, yeah. Okay. So. So let's move on. Let's move on to the next rank here, which is."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3219.77,"end":3221.47,"speaker":"Fr Stephen De Young","text":"Well, let me throw. Let me say one more thing."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3221.47,"end":3223.59,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, go ahead, go ahead. Yeah, yeah, yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3223.59,"end":3246.07,"speaker":"Fr Stephen De Young","text":"Because. Because this, this serpent connection, a lot of people don't understand. This has obvious implications for what's going on when we talk about the devil again and we talk about Genesis 3. But also, you may have noticed if you're familiar with King Tut's tomb, you know, and the sort of the gold burial mask he Has. You'll see the cobra."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3246.81,"end":3247.37,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3248.09,"end":3274.42,"speaker":"Fr Stephen De Young","text":"Sort of perched there. That's the. That's the seraph who's protecting the king and the pharaoh himself. That sort of pharaoh headgear we all have in our heads. Brenner in the Ten Commandments. Right. Is supposed to look like a cobra's hood. Yeah, that's what it's supposed to look. It's supposed to be presenting the pharaoh as one of these divine beings."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3274.66,"end":3280.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yep, yep. Okay. All right. Can we talk about."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3280.94,"end":3281.7,"speaker":"Fr Stephen De Young","text":"Now we can move on."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3281.7,"end":3303.79,"speaker":"Fr Andrew Stephen Damick","text":"And wheels. All right, let's move on. Yeah, yeah, yeah, yeah. I want to get through these ranks because it's just interesting to talk about each one of them. So we've got thrones and sometimes presented as wheels. And that's an image from Ezekiel in particular. Right. You've got the. The sort of chariot. Throne of God. You know, that sense of the wheel. Is it the wheel in the sky? I always think of that Journey song."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3303.79,"end":3308.39,"speaker":"Fr Stephen De Young","text":"Yes. The wheel of the sky that keeps on turning. Yeah, right. That's right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3308.71,"end":3310.39,"speaker":"Fr Andrew Stephen Damick","text":"Journey is singing about Ezekiel."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3312.15,"end":3334.51,"speaker":"Fr Stephen De Young","text":"And they're also called thrones in other places. And you say, well, what's the connection between a throne and a wheel? And this is what is made very clear to Ezekiel, is sort of the clearest place where this is described. The throne of God is known as the. The merkabah in Hebrew, which. Which is based on the word for chariot."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3334.75,"end":3335.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3335.39,"end":3345.71,"speaker":"Fr Stephen De Young","text":"God's throne is a chariot because it's mobile. And Ezekiel describes this. It moves in all directions. This is important for Ezekiel because he's in exile in Babylon."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3346.03,"end":3346.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3346.43,"end":3348.03,"speaker":"Fr Stephen De Young","text":"And the temple's been destroyed."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3348.51,"end":3366.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So. So. So this. In icons, we sometimes see. If, you know, correct me if I'm getting this wrong, you sometimes see around the feet of Jesus. Right. These circles, these red circles, typically, and they have wings and eyes. Is that what we're talking about here?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3367.33,"end":3367.81,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3368.37,"end":3368.89,"speaker":"Fr Andrew Stephen Damick","text":"Got it."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3368.89,"end":3369.21,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3369.21,"end":3370.85,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep, yep. Okay."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3370.85,"end":3408.77,"speaker":"Fr Stephen De Young","text":"And so this is the rank sort of. You've got the seraphim who are sort of around God enthroned. You have the. The kerouvim on whom he is enthroned. And then you have the thrones or the wheels who are sort of beneath the throne and responsible in some way. Mobility is the image. Right. That we're given. That's why the wheels have eyes. It's sort of about God's omnipresence and omniscience, not just of him, not just of God himself, but of his, because it's part of the throne, His Reign and his kingdom being omniscient and omnipresent."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3408.93,"end":3478.46,"speaker":"Fr Andrew Stephen Damick","text":"Right, okay, so the next rank then that we've all heard of, I hope, is Dominions, which is kind of a curious name, but I mean, if you think about dominion, it's about, you know, there's a sense of rulership there. Right. But it's not just that. Like, there's something a little bit more specific than that. So. So yeah, in. In our. In our notes, which I will. I mean, everyone could probably tell that Father Stephen compiled most of these notes for us, which is. Thank you. He says that Dominions. Dominions are angels in charge of judging and of restraining other spiritual powers. Right. So. So you think about in. In human government, we have a justice system, right, where you've got not only, you know, for instance, the police who are there to restrain evildoers, ideally, but you also have judges who render judgment on. On those who have done, you know, committed crimes. So is this analogous to that? I mean, obviously we're talking about spiritual realities that are not exactly the same as human justice, but there's got to be a, you know, a similarity here. Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3480.22,"end":3513.01,"speaker":"Fr Stephen De Young","text":"Right. Because we have, as we've mentioned, you know, St. Gregory mentioned, you've got those on the left hand and those on the right hand. You have elect angels. St. Paul uses that phrase. And you have angels that we would describe as. As fallen. And so the task, the role of some of those elect angels is to restrain and combat and ultimately to judge those fallen spirits and to sort of supervise and limit their actions within. Within God's creation."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3513.41,"end":3513.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3513.89,"end":3517.76,"speaker":"Fr Stephen De Young","text":"To prevent them from bringing about utter wickedness and utter destruction."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3518.72,"end":3519.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3520,"end":3521.28,"speaker":"Martin","text":"If they have their dreasures."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3521.68,"end":3539.44,"speaker":"Fr Andrew Stephen Damick","text":"All right, so why don't you tell us about the next rank that we're looking at? This one is probably the one that interests me the most in a lot of ways. I mean, they're all. They're all fascinating stuff, is I hope everybody. I hope your minds are just being blown left and right. You're gonna have to re. Listen to this on the podcast. But yeah. Anyway, the next one is, to me, one of the most interesting."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3540.4,"end":3611.42,"speaker":"Fr Stephen De Young","text":"Right. So the. It's usually translated in English as virtues, because this is one of those cases where we have sort of Greek words, several Greek words that mean very similar things. The word is very similar to powers, but powers is something else that we're going to talk about in a minute. So virtues is usually used for this, even though the word virtue in English doesn't really correspond to what they do. But These are spirits who God has assigned. Remember, the role of this council is God is the king of his creation and so he administers his kingdom through these other spirits and the, the virtues, spirits that are called virtues in English are those who preside over the different, what we would call material elements of creation. So the sun, the moon, the stars, the four winds. And we see these referred to in scripture, you know, that the, the, the angels of the four winds. Prophetically, this is not just imagery. This is the idea that all of these things are, are administered and supervised and God's reign over them is through these, through these angelic spirits."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3611.5,"end":3731.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so they're mo. They're like moving around the, the heavenly bodies. They're moving around the, the winds and the waves. And you know that it's what brings life to what seems like inanimate stuff. Right. Yet it nonetheless has this motion to it and it affects us and this association of divine beings with these elements of creation. So here's the reason why it's interesting to me. There's two reasons, several reasons really, but I'll give you the main two. So one, of course, is that this is part of, and we're going to talk about this a lot in the next episode, but this is part of paganism, so that people begin to worship beings who are associated with these elements of creation. But also the thing that really fascinates me is that this is a kind of, to use a Tolkienian term, a sub creative rank of angels. Right. They're there, there to express God's creativity in this creation and to, you know, beautify it and so forth. And of course, you know, I mentioned Tolkien and he depicts this very, very memorably and beautifully in the Silmarillion, which is kind of like his sort of fictional Old Testament kind of text, with these beings called the Valar, who are angelic beings who help participate in creation and rule over it and are associated with particular elements. You know, there's, you know, certain associated with the ocean, another with the skies and so on and so forth. So, so yeah, I'm fascinated by this particular rank of angels and it's really, really interesting to me. So the next one on the list is powers and Principalities. And probably remember that when St. Paul talks about. For we wrestle not against flesh and blood, but against. And usually people remember the line powers and principalities. So who are the powers and the principalities? Exactly. Another really interesting rank of angels here."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3731.81,"end":3734.93,"speaker":"Fr Stephen De Young","text":"Yeah, One last brief little note on the virtues and then I'll."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3734.93,"end":3735.57,"speaker":"Fr Andrew Stephen Damick","text":"Oh yeah, sure."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3736.29,"end":3764.63,"speaker":"Fr Stephen De Young","text":"To Give you an idea of how fully elaborated that was at the time that the New Testament was written on Rosh Hashanah, the new year, there was the ceremonial blowing of trumpets, and there was actually a prayer that was said before the trumpets were ceremonially and ritually blown to begin the new year. A prayer that was said to the angels of the trumpet blast."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3765.91,"end":3773.59,"speaker":"Fr Andrew Stephen Damick","text":"How interesting. So, like, they're saying that there was angels specifically associated with the sound coming out of the trumpets."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3774.47,"end":3829.47,"speaker":"Fr Stephen De Young","text":"Right. Not with the physical trumpet, but with the sound of the trumpet to bear that sound into heaven. So this. This. So this is how it sort of fully elaborated into the whole created order, the whole ritual order. This angelic involvement was at that time. But so the powers and principalities that St. Paul groups together. Right. As those with whom we're at war. We'll talk about how we ended up at war in the future. But the powers of principalities are angelic beings who were assigned to preside over nations and regions and peoples. And when they were assigned, they were assigned to shepherd and guide, though that shepherding language becomes very important in."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3829.63,"end":3840.31,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. So these are the regional. The regional gods that we. That you talked a lot about a bit when we were talking to Ashley earlier. Right, right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3841.67,"end":3843.87,"speaker":"Fr Stephen De Young","text":"And things happened."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3843.87,"end":3844.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3844.39,"end":3859.15,"speaker":"Fr Stephen De Young","text":"But that was their original task. And so they're. Again, they're this interface with the created order, but rather than being assigned to the material creation, they're assigned to these what we would call political units. But."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3859.15,"end":3859.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3859.75,"end":3862.79,"speaker":"Fr Stephen De Young","text":"Tribes and nations and peoples and families. Yeah, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3863.51,"end":3869.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Okay, before we move to the next one, do you have anything else to say about powers and principalities? I don't want to overlap again."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3870.08,"end":3871.12,"speaker":"Fr Stephen De Young","text":"No, that's okay."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3871.36,"end":3872.56,"speaker":"Fr Andrew Stephen Damick","text":"All right, so. Okay, good."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3872.56,"end":3873.68,"speaker":"Fr Stephen De Young","text":"So the next. Add something."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3874.08,"end":3902.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, of course. Right, yeah. So we've also got archangels. So now, again, this is a rank that a lot of people are familiar with. And typically there's seven archangels who are in Christian tradition. Now, if you look at the canonical scriptures of the Orthodox Church, there's only three mentioned by name. Am I right? So there's Michael, Gabriel, and Raphael. Are there any others that are actually."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3902.41,"end":3905.05,"speaker":"Fr Stephen De Young","text":"Named three and a half?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3905.69,"end":3907.13,"speaker":"Fr Andrew Stephen Damick","text":"No. Three and a half."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3908.25,"end":3911.53,"speaker":"Fr Stephen De Young","text":"It depends on how you count. How you count four, Ezra."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3912.17,"end":3914.93,"speaker":"Fr Andrew Stephen Damick","text":"Oh, right. Yeah. Is it canonical or not? Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3914.93,"end":3932.02,"speaker":"Fr Stephen De Young","text":"If you're. Yeah. If you're from the Slavic tradition, then there's kind of four, because you have Uriel. And if you're not, then technically you only have three. Although the entire Orthodox tradition embraces Uriel as one of the seven."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3932.02,"end":3961.17,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Right. And even so, even though they're not all named in canonical scripture, whether you've got three or four or three and a half, the others are named in the rest of Orthodox tradition and exist in Jewish traditions. Right, that preceding. That preceding. Exactly, exactly. And so the seven archangels are like. My sense is it means it's not just that there's only seven. Right. There's not only seven."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3961.41,"end":3965.09,"speaker":"Fr Stephen De Young","text":"Right. This is one of the areas where this gets a little confusing."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":3965.49,"end":4015.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's like many archangels on the one hand, so chiefs of angels, but then there are these specific seven that kind of stand directly at the throne of God. And in some of the icons of the. The synaxis of the. The archangels, you'll see only seven. Right. Although other icons, you'll see lots and lots of them. And then sometimes you get a kind of a hybrid of those two images where you've got seven that are right next to the throne and then there's many more around it. Right. But we don't, you know, we. We have names for those seven, and they vary a little bit between different Christian traditions. I was just reading about this the other day, you know, so like in the Coptic Church, the names vary a little bit from, for instance, the ones that we're used to and the sort of the Byzantine Orthodox tradition. Right. So, yeah. What else did we want to say about the archangels in particular?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4016.78,"end":4024.54,"speaker":"Fr Stephen De Young","text":"Well, yeah, to try and help disambiguate this, because I'm sure it's confusing because we've been sort of working out from the throne of God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4025.1,"end":4027.54,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Concentric circles, so to speak."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4027.54,"end":4044.51,"speaker":"Fr Stephen De Young","text":"We're working out, and all of a sudden we're like, well, there's these seven archangels who stand before the throne of God. We sort of jumped back from creation back up to the throne. And that's because. And I know this is going to sound crazy at first, but the seven archangels are not from the rank of archangels."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4047.47,"end":4059.75,"speaker":"Fr Andrew Stephen Damick","text":"All right. So, yes, so sometimes. Yeah, so that's the problem is that we've got terminology that overlaps or that gets reused. Right. And I think, yeah, there's a rank of arch."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4059.75,"end":4085.85,"speaker":"Fr Stephen De Young","text":"There's a rank of archangels, and there are, as the liturgy says, thousands of them. Right, right. Within that rank, the seven archangels. The word archangel is like arch priest. Yeah, right. It means chief or first or. Right. And so the seven archangels are called archangels in light of that, they're actually higher ranked."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4086.25,"end":4088.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, those seven."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4088.1,"end":4089.86,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4090.26,"end":4094.26,"speaker":"Fr Andrew Stephen Damick","text":"So wait, are there Are there, are there therefore 10 ranks of angels? Is that what we're saying?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4094.66,"end":4098.74,"speaker":"Fr Stephen De Young","text":"Well, no, because those seven are not a rank unto themselves."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4099.3,"end":4100.06,"speaker":"Fr Andrew Stephen Damick","text":"Oh, gotcha."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4100.06,"end":4162.55,"speaker":"Fr Stephen De Young","text":"Right. Those seven are sort of special. Okay, so for example, St. Michael, who's one of them, right. Probably he had St. Gabriel, the most well known ones, but St. Michael, who's one of them, in terms of his role, because we talked about these ranks are roles, right. He has several of these roles. He's the chief of the dominions in the sense that of being in charge of judging. Right. He's the one who cast down the Satan. Right. He's. He's the one in charge of judging the, the rebellious spiritual powers. He also, however, was the angel assigned as sort of the heavenly patron of the nation of Israel, which is the role of a principality. Right. So the seven archangels are sort of their own thing and each of them fulfills more than one of these roles. Whereas the rank of archangels are the step up, the eighth rank. The step up from just angels."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4162.87,"end":4222.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. So we've got one more rank to talk about and then we have a recorded message that we received and we'll talk about that rank and then recorded message. And then after that we're going to go to break and go to the third half of our show. That's a joke for all of you car talk listeners out there. So, yeah, so the final rank is the one that's just called angels. And that means just plain angels. Yeah, just plain old angels. And that means messenger. And that's the job. Right. Their job is to come and deliver messages and to speak on God's behalf to his creation. Although again, just to complicate things, we see one of the seven archangels, Gabriel, fulfilling that role. But there's a number of unnamed angels in scripture as well who do the same thing. Like who's the. I don't know, maybe you can tell me. Is the angel who appears in the Holy Sepulcher and speaks to the myrrhbearers, is he named or. I mean, he's not named in the, in the Gospels, but is there a tradition as to him being named?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4223.48,"end":4226.75,"speaker":"Fr Stephen De Young","text":"No, these are, these are angels from the class of angels."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4226.99,"end":4227.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4227.79,"end":4234.11,"speaker":"Fr Stephen De Young","text":"Bringing a message. And the angel who comes and lets St. Peter out of. Out of jail."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4235.71,"end":4236.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4236.35,"end":4244.19,"speaker":"Fr Stephen De Young","text":"Right, so. And these are beings who carry. Yeah. Messages from the throne to, to the creation."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4244.35,"end":4259.77,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. All right, well, we have a recorded message that we received from Cadman, which is actually related to all this stuff. He left it. He recorded this message earlier this week. So Bobby is our engineer tonight. Bobby, why don't you go ahead and play that message for us."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4260.25,"end":4262.13,"speaker":"Fr Evan Armatas","text":"How much does the hierarchy of angels."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4262.13,"end":4266.01,"speaker":"Fr Stephen De Young","text":"Inform us of hierarchies on Earth, such as those in our governments and in."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4266.01,"end":4267.05,"speaker":"Fr Evan Armatas","text":"The clergy of the Church?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4267.53,"end":4268.65,"speaker":"Fr Stephen De Young","text":"Are all of these related?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4268.81,"end":4271.77,"speaker":"Fr Evan Armatas","text":"And is creation as a whole hierarchical by nature?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4272.17,"end":4273.45,"speaker":"Fr Stephen De Young","text":"Where does this stem from?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4275.29,"end":4409.23,"speaker":"Fr Andrew Stephen Damick","text":"That's a great question. And it helps to underline one of the points I think, that we want to really make, which is that these various ranks of angels are ranks and not differences. Species of angel, even though they, for instance, appear to us in visual form as different. Right. Wildly different shapes, for instance. Right. But so St. Denis the Areopagite, in his text, there's one called the celestial hierarchies and then one called the ecclesiastical hierarchies. And so he relates it directly to the. The hierarchy of the Church. You know, he compares these celestial hierarchies to the hierarchy of the Church, which is one of the ways that we know that we're not talking about different species. Right. So an example that I know that, you know, you, Father Stephen, have used a number of times, for instance, is that the bishop is a different rank than the priest, but he's not a different species. We're both human beings. But he is of a higher rank, for sure, and he has a different role than the priest. And so you've got within the Church, you have these various ecclesiastical ranks. And also you mentioned Cadman about the government on Earth. And for sure that human governments, what we think of as political governments, do have this. It's not a direct analogy, but it is somewhat analogous to these hierarchies. I think that hierarchy is written into creation itself. Right. Some things are higher, some things are on other levels. And that doesn't mean that we look at the king or the president as being God's chosen anointed prophet on earth, although there have been a handful of cases in human history where that was true. King David, for instance, prophet anointed by God, so on and so forth. But nonetheless, there is still that hierarchy in both civil government and church government that connects with the angelic hierarchy. Father Stephen, did you want to add anything to that or. Correct. I'm always ready for a correction. Well, actually."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4411.47,"end":4415.47,"speaker":"Fr Stephen De Young","text":"I haven't had to do that. That was great because I've just been."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4415.47,"end":4417.39,"speaker":"Fr Andrew Stephen Damick","text":"Sticking to the notes really closely."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4418.75,"end":4518.75,"speaker":"Fr Stephen De Young","text":"But no, a couple of points. One thing that's very important in terms of Saint Dionysius, because he does parallel those things. And in addition to there being this hierarchy and not different species. It's important that for him that the higher ranks receive proportionately greater participation in the grace of God in conformity with their role in their rank. Right. They participate in the grace of God and able to perform those functions. And he holds that to be true both in the ecclesiastical hierarchies and in the, and in the celestial hierarchies. And that'll. That's important. When we're eventually here, we're going to talk. Not tonight, but eventually here we're going to talk about theosis and that will become sort of important. The other thing is, in terms of human governments, the ideal human government, as far as scripture lays it out, is the Davidic kingship. Right. Because that, of course is, you know, Christ is the Messiah, he's the Davidic king. But quite literally in this, since we're talking about the divine council, the Davidic king with his mother enthroned, his queen at his right hand, with the prophet of God on his left hand and surrounded by his royal court, is in the Old Testament, the icon of the divine council of God enthroned in the heavens. And that is not just a status, but it's also a calling. Right. It's David's calling then, to establish God's justice on earth."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4518.99,"end":4520.11,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4520.11,"end":4535.71,"speaker":"Fr Stephen De Young","text":"To, to, to accurately be an image and icon of the, the rule of God on earth. And then of course, Christ being the son of David and the Son of God, collapses those two and makes them one."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4536.27,"end":4536.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4537.55,"end":4584.08,"speaker":"Fr Stephen De Young","text":"So the heavenly council is now the Davidic king with his mother enthroned, his queen at his right hand, with his prophet on his left hand and surrounded by, by his heavenly council. So there is a direct relationship there. And so all government, whether it's civil government or whether it's ecclesiastical government. Right. The bishop is also the icon of Christ. And that's both a status and a calling for him to accurately. Right. Reflect Christ in his administration of the church. And for the Byzantine emperor, that was to establish justice. So that, that continues even up till today, though with our modern democracies, it becomes very difficult to see."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4584.4,"end":4591.2,"speaker":"Fr Andrew Stephen Damick","text":"It does. All right. Well, with that, we're going to go ahead and go to break and then we'll be back with the third half of our show."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4591.76,"end":4610.97,"speaker":"Announcer","text":"Right after that, Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855 AF radio."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4615.53,"end":4618.49,"speaker":"Announcer","text":"Here is mother Alexandra of blessed memory."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4618.73,"end":4647.03,"speaker":"Mother Alexandra","text":"It seemed to me that in this modern life of ours, where everything has become so frightfully materialistic, there is a very great need of transfiguration, of a change of our attitude, of our of thinking, our way of behaving, our way of holding ourselves. Everything needs a new Christianization. We must become more aware of the Christ within us."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4647.67,"end":4702.93,"speaker":"Announcer","text":"First published in 1981 and long out of print, the Holy Angels by Mother Alexandra has yet to be surpassed as a comprehensive and comprehensible account of the nature of the angels and their role in our salvation. In layperson's terms, Mother Alexandra presents the essence of everything the church has to teach us about the angels, beginning with the Old Testament, continuing through the New Testament, and concluding with the tradition of the Church as expressed in her theology, hymnography and iconography. For those who long to become better acquainted with these holy servants of God and to understand their role in our lives, this book is a great place to start. Available now@store.ancientfaith.com Again, that is store.ancientfaith.com we're."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4702.93,"end":4718.7,"speaker":"Announcer","text":"Back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4721.82,"end":4745.59,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back for the third half of Lord of Spirits. Again, we want to hear from you and we're going to take a couple more calls. But and we're going to talk now in this part about demons in particular. But Father Stephen was noting in during our break that he wanted something else that he wanted to drop in here before we dive into the dark, dark world of demons. So, Father Stephen, what you got?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4747.35,"end":4786.4,"speaker":"Fr Stephen De Young","text":"So I I just wanted to add one more note because we've been talking about I've talked about the similarities we've talked about both last week and this week, sort of the similarities between what we find in in Israelite religion and other cultures and then some of the distinctions. And this this species issue is actually one of the important distinctions because, of course, what you find in all these other cultures is that the God, their gods are genetically related to each other. Right. You have male and female spirits who mate and produce children."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4786.96,"end":4787.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4788.48,"end":4856.73,"speaker":"Fr Stephen De Young","text":"And so the fact that that angelic beings in the Israelite tradition do not have gender is and do not reproduce is really a key and major difference here. In fact, all of the ancient Near Eastern languages all kind of are offshoots of Acadian, but in particular, Ugaritic Aramaic, Hebrew, all branch off around the 11th or 10th century BC from Old Canaanite. And every single one of those languages has a word for goddess except Hebrew. The Hebrew language literally does not have a word for goddess. When they refer to Asherah or Artemis or some other God that's depicted as female, they just use the masculine form of, you know, Elohim, the masculine form of the word. Because they don't have a goddess word."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4856.97,"end":4989.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, as if to say they're actually all kind of. I mean, if we have to use a gender term, neuter, you know, they're all. They don't, they don't reproduce. Right. They're not doing that. Yeah, that's really fascinating to draw that distinction. So. All right, well, we're going to talk now in the final segment of our show about demons. And we're not going to get too deep into the particular kinds of demons or names of demons, partly because we're kind of getting to the point. We're running out of time. But we did want to talk in general about demons. Right. And I mean, don't, don't worry, listeners, we're going to come back to a lot of this stuff over and over again and deal with it over and over, and hopefully not in a repetitive way, but rather getting into more details and so forth so you can have a better understanding. So what are demons? Okay, so let's start off with that question. Demons are exactly the same kind of being that we've just been talking about, right? They are angelic beings. They are, you know, these, these same kinds of beings. They're, they are gods, they are divine beings, they are spirits. That's what they are. But the distinction, the single distinction that is the most important here is that they are in rebellion. They are in rebellion that they have turned against the God of gods, they've turned against the Lord of Lords, they've turned against the Lord of spirits, and they don't desire to serve him, even though they sometimes do kind of against their will. Or as it says in scripture, man meant it for evil, but God for good. I mean, the same can be true of demonic beings as well, right? That they mean something for evil and God uses it for good. So let's talk about that a bit. They're in rebellion. Did this, I mean, did this big demonic rebellion happen sometime before the creation of everything? And so that's why there's demons on the scene when Adam and Eve are walking around in the garden? What's going on there?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4990.68,"end":4993.16,"speaker":"Fr Stephen De Young","text":"Yeah, the short answer to that Is no."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4993.64,"end":4994.04,"speaker":"Announcer","text":"Right?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4995.72,"end":4996.2,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4997.32,"end":4998.88,"speaker":"Fr Stephen De Young","text":"The long answer will."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":4998.88,"end":5014.2,"speaker":"Fr Andrew Stephen Damick","text":"How many times will we blow people's minds on this episode? It's not the image you probably have in your mind of some big division of. Between angels and demons before the creation of the world is not in the Bible. It's not in."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5014.2,"end":5021.28,"speaker":"Fr Stephen De Young","text":"Or the Bible. It's not in the Church Fathers. It comes from a fellow named John."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5021.36,"end":5033.2,"speaker":"Fr Andrew Stephen Damick","text":"Milton, whom I studied as an. When I majored in English in college. You know, he's a Puritan. He's a Protestant. Yeah. Paradise Lost."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5034.79,"end":5048.95,"speaker":"Fr Stephen De Young","text":"And so he very dramatically and compellingly composed this narrative of this pre. Literally prehistoric."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5048.95,"end":5049.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5049.35,"end":5129.43,"speaker":"Fr Stephen De Young","text":"Pre. Pre creation of the world sort of battle in heaven, where not coincidentally, because he's a Puritan, he thought, oh, well, the devil wanted to be a king, because that's what all bad people do, is want to be kings. If you're a Puritan, especially an English Puritan, that's. But that. That is. That is nowhere. And probably the simplest quote to disprove that is. Is St. Andrew of Caesarea, in talking about Revelation chapter 12, which is where you people usually go when they try to push back on me about this is Revelation chapter 12. In St. Andrew's Commentary on it, he says all of the fathers have taught. So he's in the 6th century. So all of the fathers up to that point, according to him, as he summarizes, taught that after the creation of the world, the devil fell through envy. So that's. That's about as straightforward and clear as you can get that there was not this for him. For St. Andrew, the problem with Revelation 12 is that Revelation 12 depicts this fall of. Of the dragon after the birth of Christ."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5130.63,"end":5131.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5131.91,"end":5159.66,"speaker":"Fr Stephen De Young","text":"And so that's the problem he's trying to resolve. So he's saying, well, the devil fell in Genesis 3 according to all the fathers. But Revelation 12 seems to say that he fell during the ministry of Christ. And so that's the problem he's trying to resolve there. He doesn't have an inkling that there's anyone claiming this happened before creation. In fact, many of the fathers, in their discussions of the creation days have the angels being created on one of the creation days."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5159.98,"end":5160.7,"speaker":"Fr Andrew Stephen Damick","text":"Oh, interesting."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5160.7,"end":5170.71,"speaker":"Fr Stephen De Young","text":"Generally, either the. The first or fourth. So that's. So that kind of makes that whole thing completely impossible."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5171.27,"end":5175.03,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5176.47,"end":5188.47,"speaker":"Fr Stephen De Young","text":"And what we mean, sometimes people will say, well, demons are fallen angels. But of course, as we said, angel is a job description and a rank. Right. Not a species, really."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5188.71,"end":5189.11,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5189.59,"end":5220.97,"speaker":"Fr Stephen De Young","text":"And so what's more accurate is to say that these are beings who are created to fulfill one of these nine roles we just discussed and who did not fulfill it. They rebelled by refusing to fulfill that role as they were created and called to do it. And so they fell in much the same sense that human beings fall. Man was created by God to perform a specific function and role, to be a certain thing and fail."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5221.87,"end":5366.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's a kind of cosmic shirking, which it's interesting to think about. We're going to talk about demons and temptation and all that kind of thing, but it's interesting to think about the kinds of temptations to sin that we tend to have. I can't tell you how many times in hearing confessions, people and how many times I, in giving a confession, have mentioned failing to pray regularly, for instance, or failing to love my neighbor, failing to love my wife and children. You know, like, it's. It's really is this. It's this failure to do the thing that I was made to do, the thing that I was given to do. Right. And so that's a. That's a, you know, a demonic act, frankly. And we participate with them when we. When we engage in that kind of shirking of what it is that we're supposed to be doing. So, yeah, just to underline this, you know, that there's. Not only is there the. The lack of a sort of a prehistoric fall of the angelic beings, but there's. It's not even just one. Right. There's. And, you know, I know we're going to talk about this in more detail in the future. Yeah, yeah, yeah. I mean, we have a bunch of stuff in our notes that we're just not gonna be able to get to tonight, unfortunately. But that's okay because we're gonna keep coming back every couple weeks, you know, but. But you know, that, you know, demons are real and they're here and they are these, you know, to use the language. We were interviewed by Jonathan Pageau yesterday and it just appeared on his channel today. Vast cosmic intelligences. Wasn't that the phrase that you used for these? I think so, yeah. And so, you know, imagine a vast cosmic intelligence not doing the task that God gave it to. What kind of damage is going to be done when it turns away from that? That's frightening. I mean, you know, or. But I mean, we can even bring it down to our level, right? A father in a family, when he doesn't do his job, look at the damage that does to the people in his family. Right? So it scales, you know, it scales up. It scales Down. And you know, so here's, you know, we're going to talk about multiple falls a lot in detail in the future, I think. So we're going to have to probably save that because it's really, really. We could go on and on about it, but there is the sense of."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5367.89,"end":5373.57,"speaker":"Fr Stephen De Young","text":"I was gonna say there are at least five angelic falls."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5374.53,"end":5404.83,"speaker":"Fr Andrew Stephen Damick","text":"Yep. So that'll be a teaser for the future. Yeah, yeah, yeah. So, so, but, but okay, so here's the big question, and we don't have to get into the whole story here, but, but why, and we've maybe answered this a little bit already, why are demons still around? Why does God permit them? Why doesn't he just tell them, if I may put it so, to go to hell, you know, send them to the abyss? Why are they still here? I mean, we've somewhat answered this already, right. We're talking about God's right hand and God's left hand. Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5404.91,"end":5498.18,"speaker":"Fr Stephen De Young","text":"And St. Gregory, what he's expressing there is what he's received from the tradition that goes all the way back before the writing of the New Testament. One of the places where you really see this clearly is in the Book of Jubilees, which is canonical if you're Ethiopian, but otherwise not so much. But the Book of Jubilees, this is kind of dramatized where the, the demonic spirits. And we won't get it. Well, when the giants all get killed, their spirits come out and become demons. We'll just tease that there, that one out there. So, and so they, they, they sort of plead, they plead with God not to cast them all into the abyss. They don't actually repent. They just don't, don't want the punishment. And so 90% of them end up getting sent to the abyss in the Book of Jubilees. And, but 10 of them, God kind of makes a deal with them and says, okay, I'll allow you to remain as these sort of bodiless demonic spirits in the world, allow you to remain until the end of days, until the last day, and that he will use them to afflict the wicked, not as a punishment, but in order to drive them to repentance."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5499.21,"end":5499.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5499.45,"end":5524.73,"speaker":"Fr Stephen De Young","text":"And this is what St. Gregory is getting at with those evil spirits. That, that God sort of uses them now, they're malicious. They're just trying to harm people. But God uses them to bring people to repentance. And we see this idea even though the Book of Jubilees isn't in our canonical scriptures. This idea is clearly reflected in the Synoptic Gospels. When Christ is going to cast out one of these demons. And they say, have you come to trouble us before the times?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5525.53,"end":5526.17,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5526.81,"end":5528.25,"speaker":"Fr Stephen De Young","text":"About to be cast to the abyss."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5528.33,"end":5580.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the. The very famous swine gospel that we get three times a year. Right. Which, you know, it used to, I have to admit. So I'm going to make a little confession here. You know, as a priest preaching every Sunday, I was like, oh, man, the pigs again. You know, but that's how I used to feel. And then I realized what was really going on. I was like, oh, man, the pigs again. Let's talk demons. Let's talk the abyss, you know, and. And, boy, it's absolutely fascinating. Absolutely fascinating. And so demons are around and they are afflicting us, and they have their own agenda, but God has his agenda and he's making use of them for his agenda, which is to bring us to repentance. So I wanted to take a call that we've got. And this call comes from Martin, who is here in Pennsylvania, and I have a strong suspicion that I know him. So, Martin, are you there?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5582.44,"end":5586.36,"speaker":"Martin","text":"Yes, Father, I am here. And Father, bless God."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5586.36,"end":5592.36,"speaker":"Fr Andrew Stephen Damick","text":"Bless you. So, Martin, what's your. What's your question or comment for us this evening? Yeah."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5593.48,"end":5631.8,"speaker":"Martin","text":"Considering the reality of angels, demons, spirits, all these things, can either of you tell me about your take on paranormal experiences? I've had some myself, growing up as a kid, which is why I went on my mice they Think of, and then finally, thank God, found myself at the Orthodox church. But, yeah, just want to hear any kind of information that you may have on that kind of thing."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5633.41,"end":5744.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Well, so I'll respond first and say that as human beings, we encounter spirits all the time. Right. They're, they're, they're everywhere all the time. You know, good ones, evil ones. And a lot of what we're doing in the church is precisely navigating that. Right. So we're calling upon God's willing servants to assist us in our repentance, to assist us in the path of salvation, to protect us from evil. And we're engaging in prayer, and the priesthood especially is engaging in exorcistic acts to drive off those who would harm us. And, you know, it's not just. For instance, Father Stephen mentioned the exorcism, you know, like in a house. Right. But also there's exorcism that's done at the beginning of a baptism. But the truth is, is that kind of all the prayers of the church are exorcistic acts. You know, even the offering, for instance, of incense and is an exorcistic act. Right. Because it's an offering to God and it ascends in his sight and it is prayer. It is a sort of spiritual fumigation. Right. So I don't know, Father, you want to say more about that? You know, I made mention that you talked about exercising a house, but I think that may have been on our interview with Jonathan Pageau on the symbolic world. But we might as well talk about it now. So. So let's talk about our actual direct encounter with demons. I mean, what do we do? What's happening?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5745.77,"end":5923.45,"speaker":"Fr Stephen De Young","text":"Yeah, well, one of the things I mentioned there is that we've had the luxury, those of us who are old timers, of living most of our life in the tail end of Christendom. Right. Where the rule of Christ was something that in the west for centuries was enacted sort of in all of our societal structures, whether people actually believed it or not, whether people actually followed it morally or not. It was enacted. It was there in the structure. And so we didn't see the kind of spiritual phenomena in the west that you would see in Africa, in Southeast Asia, in, in other places of the world where the kind of things that we read about in the Scriptures and in the Gospels and in Acts are still going on on a very active basis. Exorcism is a very live ministry in parts of Africa and Southeast Asia and South America. And we haven't seen as much of it here. But as Christendom here is crumbling, it's. It's starting to happen more. And people are deliberately opening themselves up to the spiritual world, but they're doing it in ways that aren't based in Christ and His kingdom and his rule. And therefore they're doing it in ways that aren't under his protection. And this is everything from Ouija boards to Kundalini yoga techniques to psychedelic drugs to dabbling in Hinduism and Buddhism, all of these things are, are ways that, that not just claim to, but legitimately open you up to the spiritual world, meaning to the world of spirits. But that's not something you want to do outside of Christ. Yeah, because the spirits you're opening yourself up to are not spirits that have your best interests at heart. They're spirits who are out to destroy you. This is their whole motivation as, as beings of chaos. There is no demonic hierarchy like the celestial hierarchy we were just talking about. Hierarchy and order are good things. The, the demons are beings of chaos and destruction. And that's what they're out to do to destroy God's creation. In general and human persons in particular. And so when you open yourself up to that, you're opening yourself up to that. And so, yeah, that's a very dangerous thing. And so, yes, people who go and start using Ouija boards, strange things are going to start happening in their house. And that's not weird, right? That's normal."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":5923.93,"end":6081.69,"speaker":"Fr Andrew Stephen Damick","text":"That's normal, yeah. And just to talk about, for instance, how what we might think of as kind of the ordinary church life. I mean, church life is not ordinary, right. But the ordinary church life and how it's actually engaging in this battle. I'll just give you one example from my own experience. A number of years ago, I became aware that someone that I knew had tried to take their own life. And when someone does that, of course, there's all kinds of things going on. Right. And it's just horrifyingly bad. And I had found. I found this out, literally, I think, an hour or two before I was going to celebrate the Divine Liturgy for the Feast of the Elevation of the Cross. And, you know, there was, like I said there was all kinds of complications and dark things going on surrounding this. This person in their life. And, you know, I found out right before we're going to do liturgy. And, you know, I didn't, like, serve the liturgy in any kind of unusual way. You know, I said what I was supposed to say, sang what I was supposed to sing, did what I was supposed to do. But I had this very strong sense the whole time of engaging in a kind of forceful battle, right. Like, it felt like pushing the whole time that we were celebrating the liturgy. And then. And then towards the end, there was this kind of feeling of relief or release. And, I mean, I still remember it very, very clearly. And I mean, it wasn't like I saw things or heard something weird or whatever, but there was just a strong sense of engaging in a kind of a wrestling match, you know, a struggle. And, you know, so this. This stuff is absolutely part of what it is that we do. And we don't have to live life in utter anxiety and fear because we're in Christ. We can call upon Christ, and we have his angels and his saints to assist us. You know, his divine counsel are present with us, and when we engage in prayer, we are present there with them. You know, we become part of that just temporarily here in this life, but God willing, as we remain in Christ permanently in the life of the age to come. So, I don't know. Does that answer your question, Martin?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6082.41,"end":6084.33,"speaker":"Martin","text":"Absolutely. Thank you so much, Father."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6084.81,"end":6106.39,"speaker":"Fr Andrew Stephen Damick","text":"Awesome. Awesome. Thank you very much for calling. Well, we have piles and piles of more stuff in our notes, but it's going to have to wait until, until a future episode. But don't worry, everybody, we are never going to run out of, of things to talk about on this, on this podcast. So, Father Steven, I don't know, did you have any final thoughts you wanted to give before we wrap up?"}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6109.27,"end":6177.89,"speaker":"Fr Stephen De Young","text":"I, I think just one last note in that last call and that's that I, I think probably a lot of people who are interested in this podcast, this, this show and these topics are wanting to open themselves and their lives more to the spiritual world. But it obviously in a positive sense, not the negative sense we were just talking about, right? And the, the, the Orthodox Church gives us safe, constructive ways to do this, right? Through the, through the Jesus prayer, through spiritual disciplines of prayer and fasting, through the liturgies of the church. There are ways for us to do this that are healthy, good, that will draw us closer to Christ, that will make us more like Christ, that allow us to participate more in the grace of God. And I want to make sure that we also always keep focused on that. And even though people are fascinated by the negative side and the dark side and that kind of thing, thing, it's the positive side that we're really all about here."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6178.45,"end":6209.9,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Absolutely. Absolutely. Well, thank you very much everyone for listening and for calling in. That is our show for today. If you didn't get a chance to call in during the live broadcast, we would love to hear from you either via email@lordofspiritsancientfaith.com or you can message us at our Lord of Spirits Podcast Facebook page. We read everything, but can't respond to everything. But we do save what you send for possible use in future episodes."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6211.26,"end":6225.75,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcasts on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. And don't forget to like our Lord of Spirits Podcast Facebook page. While you're at it, leave a recommendation and then invite your friends."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6226.07,"end":6233.83,"speaker":"Fr Andrew Stephen Damick","text":"And if you leave a review on Apple Podcasts, Facebook or wherever you get your podcasts. And that raises the visibility of this show and gets more people connected."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6235.03,"end":6243.27,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6244.07,"end":6246.47,"speaker":"Fr Andrew Stephen Damick","text":"Thank you very much and may God bless you always."}
{"episode_id":"LOS - #003 - 2020-09-25 - Angels and Demons II - The Divine Council","start":6252,"end":6289.13,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Fr. Andrew Stephen Damick and Fr. Stephen DeYoung. A listener supported presentation of ancient faith. Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
