{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":0.24,"end":64.84,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him, and they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spiritual spirits, angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":65.16,"end":165.23,"speaker":"Fr Andrew Stephen Damick","text":"Hey, thanks Voice of Steve Good evening all you giant killers, dragon slayers and election deniers. You are listening to the Lord of Spirits podcast. My co host, the Very Rev and nearly double Dr. Stephen DeYoung is with me straight from the swamp in Lafayette, Louisiana. And I'm Father Anderstein Madamek in Emmaus, Pennsylvania, atop the Eldritch Tower of podcasting, perched above a gateway to the underworld. And we are live. And if you are listening to us live, you can call us at 855-237-2346 and you can talk to us. We're going to get your calls in the second half of the show and Matska Trudy the Tank Richter will be taking your calls. So this episode is sponsored once again by the Orthodox Studies Institute at St Constantine College, which exists to advance the study and application of Orthodox Christianity in faith faithfulness to holy tradition. By popular demand, OSI is bringing back our very own father Stephen DeYoung to teach a live course on the Book of Jubilees, taking a deep dive into one of the most important texts in Second Temple Judaism. Course begins on January 7, 2025, runs for four weeks. You can learn more and you can register@ orthodoxystudies.org Los and if you missed Father Stephen's previous course on the Book of Enoch, you can sign up for Jubilees and also get $25 off of Enoch by using that same link. So you can go to orthodoxstudies.org los to register and see all of OSI's course offerings. And by the way, underway right is my course on Tolkien with OSI and you can still register everybody, even if you weren't there to show up for the first course. First class. You can."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":165.63,"end":166.55,"speaker":"Fr Stephen De Young","text":"You're begging. You're begging."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":166.55,"end":172.91,"speaker":"Fr Andrew Stephen Damick","text":"Listen, I know. No, hey, I just. I advertised your thing for the last two paragraphs. Okay?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":173.87,"end":181.07,"speaker":"Fr Stephen De Young","text":"Right. I'm just saying this is like the Costco. Of course, you buy in bulk and you save."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":181.31,"end":214.35,"speaker":"Fr Andrew Stephen Damick","text":"That's true. That's right. Excelsior. So here in the United States of America, we've been talking about election for some time now. A lot. You wouldn't think that such an important theological issue would be on every single TV channel, newspaper and YouTube show, but here we are. So we figured we would weigh in on the most important election in our lifetimes. The most important election in the world. So that said, sometimes we give a. A parental advisory at the beginning of episode, but this time we're giving a Calvinist advisory."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":214.35,"end":216.43,"speaker":"Fr Stephen De Young","text":"So there's a trigger warning at least."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":216.43,"end":217.15,"speaker":"Fr Andrew Stephen Damick","text":"Trigger warning."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":217.81,"end":222.53,"speaker":"Fr Stephen De Young","text":"Sorry, Calvinists just in advance. Blanket. Exactly."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":223.65,"end":229.25,"speaker":"Fr Andrew Stephen Damick","text":"If you are sensitive about. If you have Calvinist sensitivity, just turn off your radio right now."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":230.29,"end":238.45,"speaker":"Fr Stephen De Young","text":"Although I think given the general tenor of Calvinists, part of the reason we could go so hard on them is that they can take it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":240.21,"end":242.53,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that is their whole kind of gestalt."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":242.77,"end":246.13,"speaker":"Fr Stephen De Young","text":"Yeah, being a Calvinist and a snowflake kind of doesn't work."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":248.29,"end":268.85,"speaker":"Fr Andrew Stephen Damick","text":"We have listeners, by the way, from Czech Republic and Serbia at least in addition to our. Oh, a Bavarian, an Alaskan, a North Carolinian, a Kansan, a Californian. I mean, the list goes on and on. South Carolinian, Wow. Apparently this guy from South Carolina claims that South Carolina is the poor man's North Carolina."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":270.61,"end":276.34,"speaker":"Fr Stephen De Young","text":"I mean, he said, oh, we've got."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":276.34,"end":300.07,"speaker":"Fr Andrew Stephen Damick","text":"An Australian as well. I mean, that's a lot of times on Hawaiian, of course, someone from the poor man's Ohio. Texas. Wow. Hey, everybody. Nice to see you all checking in there on the YouTube chat. Ooh, northern Virginia. That's not real Virginia, Sam. That's not real Virginia. I'm sorry. Anyway, so what are we talking about, Father Stephen?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":300.07,"end":309.67,"speaker":"Fr Stephen De Young","text":"We're talking about election, which is when God looks down at all of the evil people in the world and he chooses the lesser evils and puts them in charge every two to four years."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":312.71,"end":314.99,"speaker":"Fr Andrew Stephen Damick","text":"Of all the kinds of insects, you could choose."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":314.99,"end":316.71,"speaker":"Fr Stephen De Young","text":"Weevils. Weevils?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":316.71,"end":317.43,"speaker":"Fr Andrew Stephen Damick","text":"Why weevils?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":317.43,"end":319.91,"speaker":"Fr Stephen De Young","text":"I don't know. Well, they wobble, but they don't fall down."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":320.31,"end":320.79,"speaker":"Fr Andrew Stephen Damick","text":"Nice."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":321.11,"end":321.63,"speaker":"Fr Stephen De Young","text":"That's a."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":321.63,"end":328.98,"speaker":"Fr Andrew Stephen Damick","text":"That is a 70s 80s reference right there. I don't think they still sell those, do they? Not that I've checked."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":329.46,"end":337.86,"speaker":"Fr Stephen De Young","text":"Who knows? Someone's probably outlawed. They're probably covered in lead paint. Yeah, exactly. With, you know, spend our childhood chewing on them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":338.02,"end":338.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":338.58,"end":339.9,"speaker":"Fr Stephen De Young","text":"Throwing lawn darts at each other."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":339.9,"end":346.66,"speaker":"Fr Andrew Stephen Damick","text":"Exactly. A Las Vegas. Someone stuck in traffic in San Jose. Wow."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":347.3,"end":409.13,"speaker":"Fr Stephen De Young","text":"Most people in San Jose are currently stuck in traffic. Yeah. Like literally the majority of the city. Yeah. Is at this very moment stuck in traffic. Yeah. The entire team of the Sharks, I'm pretty sure. The excuse for their performance lately at least. Anyway. Yeah. We're talking about. About election and what it means and what it doesn't mean. And as you probably guessed from our trigger warning, we would be saying that although many of our Calvinist friends keep using that word, it does not mean what they think it means. And for those of you who thought we were going to be talking about the American presidential election, what's wrong with you? Why would you tune in to hear more about that? Like seriously."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":411.13,"end":412.25,"speaker":"Fr Andrew Stephen Damick","text":"Bunch of addicts."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":412.41,"end":415.69,"speaker":"Fr Stephen De Young","text":"Like after the last couple of weeks you want to hear more about that?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":415.93,"end":416.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":416.49,"end":423.21,"speaker":"Fr Stephen De Young","text":"Like, I hope all of you listening got the joke and knew that wasn't what we were actually talking about."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":424.57,"end":428.01,"speaker":"Fr Andrew Stephen Damick","text":"There's someone out there that's really angry right now because we just bait and switched them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":428.47,"end":446.63,"speaker":"Fr Stephen De Young","text":"Yes, I'm sure. I'm sure. But trust me, there are a couple of other places they could go to get information about that at the present time. 24, 24 hours straight if they want to, from myriad perspectives."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":446.79,"end":448.71,"speaker":"Fr Andrew Stephen Damick","text":"C Span after dark."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":450.47,"end":453.61,"speaker":"Fr Stephen De Young","text":"CC Span was great. Back when they did Book Notes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":454.8,"end":455.92,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I never saw that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":456.4,"end":464.8,"speaker":"Fr Stephen De Young","text":"Oh, Book Notes was like. So that's what they did on the weekends and Right. When Congress wasn't in session because they had nothing to broadcast."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":465.12,"end":465.68,"speaker":"Fr Andrew Stephen Damick","text":"Hmm."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":467.2,"end":531.79,"speaker":"Fr Stephen De Young","text":"So they had two things. In the morning they had this call in show where they didn't have the calls screened. So it was a lot of people calling in and cussing and sneaking out of the air and causing trouble. And then the rest of the day they had C Span book notes, which was like book events from all over the countries, mostly politics and Prose in Washington D.C. but lots of other hoity toity uppity bookstores, you know, and people going to do their presentations, you know, people with their books about World War II and you know, some listeners. Grandpa was one of the five people there who got up to challenge the guy who wrote the book during the Q and A time. That kind a book event. But it was majestic because they were doing C Span book notes on cable at a time in my life when, you know, say on a Saturday I had been up all night the night before, and, man, if you need something to help you go to sleep, that's the one."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":531.79,"end":532.23,"speaker":"Fr Andrew Stephen Damick","text":"Huh?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":532.23,"end":541.8,"speaker":"Fr Stephen De Young","text":"C Span book notes. Wow. Lull you right into it. Sort of perfect for that Sunday afternoon nap."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":541.8,"end":542.2,"speaker":"Announcer","text":"Boom."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":542.2,"end":551.08,"speaker":"Fr Stephen De Young","text":"Put you right out. So we're not talking about that kind of election. I talk about Congress either."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":552.28,"end":553,"speaker":"Fr Andrew Stephen Damick","text":"Oh, some."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":553.24,"end":554.04,"speaker":"Fr Stephen De Young","text":"We have the."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":554.28,"end":559.32,"speaker":"Fr Andrew Stephen Damick","text":"And I'm not kidding about this, the Philadelphia Council of Clergy is tuning in."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":559.88,"end":561.08,"speaker":"Fr Stephen De Young","text":"The entire council?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":561.32,"end":564.64,"speaker":"Fr Andrew Stephen Damick","text":"I don't know, I mean, it's a YouTube account."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":564.64,"end":569.92,"speaker":"Fr Stephen De Young","text":"It says Philadelphia Council of Clergy, not a representative. But they have convened to listen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":569.92,"end":573.6,"speaker":"Fr Andrew Stephen Damick","text":"I assume it's all of them. So hello, Philadelphia Council of Clergy."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":573.76,"end":592.72,"speaker":"Fr Stephen De Young","text":"If it's in Philly, they probably got some Westminster representation there. We probably got us some Calvinists. Yeah, this could go. Could go sideways. Okay, so in general, what are we talking about when we're talking about election?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":593.85,"end":594.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":594.25,"end":617.53,"speaker":"Fr Stephen De Young","text":"So usually the word elect, if it isn't translated as elect in English translations of the Bible is translated as chosen. Yeah, those are some kind of used as English synonyms in translation. And when we hear chosen in English. Right, like the chosen people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":618.01,"end":621.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It has to do with choice."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":621.23,"end":632.27,"speaker":"Fr Stephen De Young","text":"Chosen. These people are elect. Picked, yes. That's what we tend to think. We tend to think picked. That there were a group of options and one of them was selected."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":632.83,"end":633.23,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":633.71,"end":686.74,"speaker":"Fr Stephen De Young","text":"Elected, as it were, which is related, but not the same word as elected. And so this, of course, very much plays into where. And we'll be talking about this in more detail, obviously later, where our Calvinist friends and others before them and since probably have. Have taken the idea of that word, that when you hear that someone is chosen or elect in Scripture, that means God has. Has chosen them, generally chosen them, you know, from eternity for something. And it's going to end up to mostly be salvation."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":687.62,"end":688.42,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":689.14,"end":716.99,"speaker":"Fr Stephen De Young","text":"That they're chosen for. Again, we'll get into that more later. But the word. The actual words in Hebrew and Greek have a little more nuance to them on one hand, and on the other hand are a little more flexible. So it's worth noting that the words we're talking about in Hebrew and Greek are, in both cases are adjectives."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":719.31,"end":724.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it'll become clear as we talk why that's so important. Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":725,"end":739.08,"speaker":"Fr Stephen De Young","text":"They are not participles. So a participle for people who have graduated high school and forgotten their English classes, as most people other than Father Andrew do quite quickly."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":739.24,"end":745.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, this is what people think majoring in English is about is like grammar and stuff."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":745.68,"end":748.04,"speaker":"Fr Stephen De Young","text":"Yeah, it's not you're reading literature, but. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":750.51,"end":750.75,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":754.19,"end":797.27,"speaker":"Fr Stephen De Young","text":"I only know because studying foreign languages, a participle is a language. Thing is when you take a verb and you substantize it, meaning you take the verb to choose, for example, and you turn that into an adjectival phrase, like the one who was chosen. The one who was picked up. Yeah, right. The one who had this verb done to them. Right. So it's of key importance that in neither Hebrew nor in Greek are we talking about a verbal structure that is the one who had this action done to them by God or someone else."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":797.51,"end":808.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's like the word employee, right? That's the. You know, you've got employee, employee, the one who is employed."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":808.63,"end":834.35,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah. So this is an adjective which describes the person. In the case of Hebrew, we're talking about the word Bachir, not to be confused with Bashir, as in Julian Bashir. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":834.35,"end":834.71,"speaker":"William","text":"Or."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":836.47,"end":837.83,"speaker":"Fr Stephen De Young","text":"Bashar or."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":837.99,"end":840.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Bashir always wanted to be one of the chosen. But."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":843.43,"end":845.19,"speaker":"Fr Stephen De Young","text":"Well, he was genetically modified."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":845.75,"end":849.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, that's what I'm saying. He was built to be neurotic."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":852.63,"end":883.17,"speaker":"Fr Stephen De Young","text":"But so Bahir in Hebrew is used to mean something more like given a role or set apart for a purpose or assigned. Right. Or given an office. Right. So, but again, it's an adjective."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":884.95,"end":885.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":885.51,"end":913.15,"speaker":"Fr Stephen De Young","text":"So it is a word that's used to describe the person who is assigned an office or a role or a task. Right. Not just to indicate that they have been assigned that role or that task, but to describe the person who has been assigned that role or that task. We find basically the same thing in Greek. So there is a verb ek legomi."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":913.95,"end":919.39,"speaker":"Fr Andrew Stephen Damick","text":"Or eklegome, which, like, literally means call, you know, spoken out."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":919.79,"end":927.15,"speaker":"Fr Stephen De Young","text":"Yes, yeah, yeah. And so you could try and butterfly it and say called out or to call out."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":927.23,"end":927.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":928.99,"end":940.97,"speaker":"Fr Stephen De Young","text":"But that gets. There is an adjective form of it. So again, it is not that the participle form of that verb. It is an adjective for the same root, eclectos."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":941.21,"end":943.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is where we get our word eclectic."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":945.85,"end":1045.83,"speaker":"Fr Stephen De Young","text":"And that means. Can mean sort of roughly called out, but it's more like identified. Yeah, like identified from a group for a purpose. Right. We've tagged this guy. Okay. As I mentioned, both of these are adjectives. These account for the vast majority of uses of these words. Different words are used when you're talking about, like someone choosing to do something. Right. These aren't the same words. Now, that said, that said, I'm going to do a sorry, non Calvinist here. See, just to prove how even handed we Are. So there's a certain, there's a certain species of anti Calvinist out there of whom Latent Flowers is an example. And Leighton Flowers is a, is a Baptist. He's like the Texas Baptist association, their head of evangelism or something similar. And Late Flowers is also one of those dudes like Mitt Romney who kind of looks like a Sears catalog model from the early 80s. Like that particular kind of like handsome dude, like from that era."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1046.18,"end":1046.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1046.62,"end":1049.9,"speaker":"Fr Stephen De Young","text":"Everybody knows what I'm talking about. Like Mitt Romney, like Latent Flat, like."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1049.9,"end":1054.1,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Like, yeah, you know, like like on The Simpsons."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1054.1,"end":1054.78,"speaker":"Fr Stephen De Young","text":"I'm TV."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1054.78,"end":1055.94,"speaker":"Fr Andrew Stephen Damick","text":"Is Troy McClure."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1056.18,"end":1063.02,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. Like he, he would be in the catalog, like looking down at his watch, modeling the suit."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1063.02,"end":1064.98,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, exactly."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1069.7,"end":1096.26,"speaker":"Fr Stephen De Young","text":"But he has to his credit, picked up on the fact that this is an adjective, right. Not a participle. This is not talking about the recipient of some action from God or someone else, but it's talking about equality of the, of the person. But the example he has given to describe this is, it's like USDA choice meat."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1099.74,"end":1100.7,"speaker":"Fr Andrew Stephen Damick","text":"That is so choice."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1101.02,"end":1106.94,"speaker":"Fr Stephen De Young","text":"So someone who's chosen, they're just like really choice, right? They're just like really great."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1107.58,"end":1110.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, no, no."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1113.82,"end":1123.34,"speaker":"Fr Stephen De Young","text":"That is not what it means. I mean, good attempt to find another use for the word choose or choice other than the one Calvinists use. But that's the wrong one."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1123.79,"end":1125.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1127.79,"end":1135.47,"speaker":"Fr Stephen De Young","text":"So. But at least I said he was handsome. Right? So see that's. I mean, doesn't know what he's talking about on this point, but handsome."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1135.55,"end":1136.91,"speaker":"Fr Andrew Stephen Damick","text":"He's no William Shatner."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1138.19,"end":1196.22,"speaker":"Fr Stephen De Young","text":"Well, guys in his 90s, you know. Yeah. So what are some examples? Words obviously have meaning based on their usage. Right, Right. So we've already started setting forth a claim that this is talking about a particular quality of a person that causes them to be set aside for a purpose or to be given a particular role. What are some examples of these terms being used in the Hebrew Bible in the Christian Old Testament? So one of the, one of the obvious and most probably the first one people think of, right. When if you said to someone, if we were on Match Game with Gene Rayburn and I said chosen blank."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1196.78,"end":1199.02,"speaker":"Fr Andrew Stephen Damick","text":"Yes, the chosen people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1199.34,"end":1210.55,"speaker":"Fr Stephen De Young","text":"Right. And you're trying to match with like Phyllis Diller and Paul Lynd and Charles Nelson Riley. Right. Wow. A good option would be to pick people, right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1210.71,"end":1211.19,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1211.43,"end":1231.65,"speaker":"Fr Stephen De Young","text":"Chosen blank. Right. So Israel, right, in the Old Testament is God's chosen people. That's maybe where your brain first goes, Right? And that is obviously right the adjective is used. Yeah, Israel a lot."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1231.65,"end":1257.87,"speaker":"Fr Andrew Stephen Damick","text":"And, and people, people from that they get this idea of like saying that, you know, Israel is picked by God, you know, from all the other nations, you know, like, who do they think? Some people even say, you know, well, who do they think they are? You know, that sort of thing. Setting aside, of course, the big problem of what is Israel? But, but yeah, there's this idea of, of, you know, God looked at all the nations and said, ah, I like this one the best."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1257.95,"end":1284.27,"speaker":"Fr Stephen De Young","text":"Yes, I'm going to pick this one and I'm going to. I love them more than all the other ones and they're special. Right. Just because I chose. Right, right. This is, and side note to Calvinists, as we get going, see, I was about to say chose arbitrarily. If you say to Calvinists that God makes this choice arbitrarily in their system, they get really mad."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1285.73,"end":1287.73,"speaker":"Fr Andrew Stephen Damick","text":"But I mean, that's what they say."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1287.73,"end":1339.97,"speaker":"Fr Stephen De Young","text":"It's not arbitrarily. It's according to his good pleasure. It's according to his will. Guys, the word arbitrio in Latin means will. What? Arbitrary means chosen with reference to nothing but one's will. Okay. Arbitrary is exactly what you say it is. Like definitionally arbitrary. Derived from the Latin, arbitrio means just exactly what you say. So in the Calvinist system, God chooses arbitrarily, chooses according, with reference to nothing but his will, just willed and picked Israel. Right. Well, there's a problem with that. There's a problem with that. When you read Hebrew Bible, read the Old Testament closely, and that's that Israel is not one of the 70 nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1341.09,"end":1349.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You look at the list of the 70 nations that come of Noah's sons. Read through the list. Israel is not there. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1349.97,"end":1352.21,"speaker":"Fr Stephen De Young","text":"This is in Genesis 10, table of nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1352.37,"end":1353.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, just read it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1353.97,"end":1362.85,"speaker":"Fr Stephen De Young","text":"Israel is not one of the nations. Israel is something other than the nations. Right. Definitionally."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1363.65,"end":1365.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1365.9,"end":1375.54,"speaker":"Fr Stephen De Young","text":"The Latin word for the nations is gentiles. Right. And most of our English translations don't translate that in the New Testament. Sometimes they do in the Old Testament."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1375.54,"end":1376.94,"speaker":"Fr Andrew Stephen Damick","text":"Sometimes Gentiles. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1377.9,"end":1431.48,"speaker":"Fr Stephen De Young","text":"Translated as the nations. Right. So Israel isn't one of the nations. There's Israel and then there's the nations. Right. And so Israel is not one of the nations. God doesn't choose one of the nations. God creates Israel. Yeah. And he creates Israel. Sometime we're not going to argue about how much time, but sometime after the dispersing of the nations at Babel. And that's true whether you want to talk about God creating Israel from Abraham. Abraham is from Ur. Abraham is a person who belonged to one of the nations who is called out of that nation to become the father of Israel."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1431.64,"end":1435.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. God did not pick the nation that Abraham had been part of."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1435.8,"end":1440.04,"speaker":"Fr Stephen De Young","text":"Right. Yeah. And Abraham by himself is Sumeria."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1440.44,"end":1440.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1440.76,"end":1441.72,"speaker":"Fr Stephen De Young","text":"Not the Sumerians."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1442.2,"end":1443.32,"speaker":"Fr Andrew Stephen Damick","text":"Not the Sumerians."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1443.8,"end":1464.68,"speaker":"Fr Stephen De Young","text":"Yes. But Abraham. And he's called to leave Samaria. Right. So it's made pretty obvious that that's not what's going on. Or if you want to talk about. Right. Which would be sort of the nascent beginning of. Of Israel. Or if you want to talk about the Exodus, if you want to talk about Mount Sinai."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1465.24,"end":1472.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is what there's now this nation that's been formed by God that has this new identity."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1472.6,"end":1614.09,"speaker":"Fr Stephen De Young","text":"And that's what in the later in the prophets, in the Old Testament, they're going to refer to that event as the birth of Israel. Right. So if you want to look at that as the beginning of Israel, you've got this hodgepodge group that is, in our modern turns, terms, ethnically mixed. They didn't have that concept, but that is now made into the nation of Israel. They were not a people. God made them a people. Right. So Israel collectively is formed there at Mount Sinai by the giving of the Torah, and they are given a history. When Israel is formed, they are all Abraham's sons. It doesn't matter if that was literally true. They didn't know that DNA existed. Yeah. They didn't even have a concept of heredity, by the way. I mean, they were far from understanding DNA and that kind of thing. Right. Caleb is an elder of the tribe of Judah. It doesn't matter that he and his father were Kenizzites and therefore no relation to the person Judah. He's a member of the tribe of Judah. Judah is his father. Right. That's how this works. So they're given this history, they're given this common family when they are created. But Israel as a whole, therefore, is not picked, it's created. Right. And by the way, this is telegraphing where we're going later, what made someone an Israelite or not? What made someone part of that nation that God created or not? What made them one of the chosen or not was whether they participated in the Passover ritual."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1614.65,"end":1619.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Were they circumcised? Participated in the Passover, doing the things."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1619.69,"end":1621.93,"speaker":"Fr Stephen De Young","text":"The first generation, it was literally participating."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1621.93,"end":1623.85,"speaker":"Fr Andrew Stephen Damick","text":"In the Passover ritual. Yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1623.85,"end":1649.06,"speaker":"Fr Stephen De Young","text":"Right. Marking their doorpost. It was something they did. But we'll come back to that. Right. Now we're surveying the ways chosen is used the Old Testament. So in what sense then is Israel as a whole chosen? Right. They're not chosen as in picked. There are all these different nations and God picked this one because they get created."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1649.3,"end":1652.9,"speaker":"Fr Andrew Stephen Damick","text":"But there is something different about them with regards to the rest of the nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1653.14,"end":1789.41,"speaker":"Fr Stephen De Young","text":"Right. What is that adjective doing? That adjective that we translate as chosen. What is it doing? Okay, well, we can see that Israel is created and it is set aside and called to a particular purpose in relationship to the nations. So it has a unique role or a unique purpose. And we've talked about this before on the show, that, that ultimately what that role and that purpose is is priesthood. Right. They are to be a kingdom of priests, as they're told in the Torah. Priests for who? Right. A priest represents God to non priests and represents non priests to God. So the nation as a whole were to be priests to the nations, to the other nations. They were supposed to represent God to the other nations. They were supposed to represent the other nations to God. And on the peace of representing God to the nations, that meant they had to live their life in a different way than all the other nations. This is why there are most of the commandments given in the Torah are only given to the nation of Israel and not to everyone. They're not supposed to stop other people from eating pork. They're supposed to not eat pork like other people do. Right. They're called to a different way of life, to a higher way of life as a way of representing who the true God is to the other nations. Right. And then exhibit A of them representing the nations before God is at the feast of Tabernacles when they go and they offer the 70 bowls for the 70 nations. Right. They offer these sacrifices as sacrifices to God for those nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1789.65,"end":1808.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is pretty interesting as unique to Israel. Like which other of the nations are offering sacrifices for a different nation, especially to their own God. You know, like this is something that is uniquely Israel."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1808.86,"end":1823.35,"speaker":"Fr Stephen De Young","text":"Right. And is something given by God that demonstrates that he's different than those other gods. Right. The only reason another nation would have to sacrifice to Israel's God is because they wanted something from him."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1823.91,"end":1827.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1827.43,"end":1855.17,"speaker":"Fr Stephen De Young","text":"Otherwise he's not their God, He's Israel's God. Right. But the idea that sacrifice needs to be made for all those nations to this God means. Doesn't just imply. It means that he is the God of all of those nations as well. That's built into the. It's built into the system. Now our 19th century German friends rear their ugly heads."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1855.17,"end":1859.01,"speaker":"Fr Andrew Stephen Damick","text":"Once again, this is a whole lot of sorry so and so."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1859.97,"end":1862.13,"speaker":"Fr Stephen De Young","text":"There's a lot of sorry so and so's out there. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1865.25,"end":1866.69,"speaker":"Fr Andrew Stephen Damick","text":"Sorry. I don't know why that caught me."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1866.69,"end":1872.41,"speaker":"Fr Stephen De Young","text":"It's so funny because you may go out and pick up a commentary on Leviticus, an academic commentary on Leviticus."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1874.32,"end":1874.44,"speaker":"William","text":"You."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1874.44,"end":1902.16,"speaker":"Fr Stephen De Young","text":"May look up this Feast of Tabernacles thing. Odds are good that they're going to tell you or at least point out the going theory that. Oh actually, actually since ancient Israel was really, we all know, was really pagan, that they were offering bulls for. To the gods of those other nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1903.36,"end":1910.44,"speaker":"Fr Andrew Stephen Damick","text":"Right. Which kind of begs the question like, so they Google up all 70 nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1910.44,"end":1917.32,"speaker":"Fr Stephen De Young","text":"And their gods, they keep a running list. Do they have some kind of diptychs of who the current most high God was in each of the 70 nations?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1917.32,"end":1918.36,"speaker":"Fr Andrew Stephen Damick","text":"They check in with all of their."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1918.36,"end":1941.08,"speaker":"Fr Stephen De Young","text":"Ambassadors so they know who to sacrifice it to. So that dog don't hunt. That don't make no sense. Right in the first place. And this also has the very common problem with all of these theories of like oh, oops, look, the editors of Leviticus let slip that they were really pagans. Like they, once again, they just didn't notice something."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1942.12,"end":1942.6,"speaker":"Announcer","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1944.36,"end":1945,"speaker":"Fr Stephen De Young","text":"Like really?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1945.96,"end":1946.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1947,"end":1957.63,"speaker":"Fr Stephen De Young","text":"Like these, this priestly cast after the exile, they're rubbing their hands together like aha, we will convince them all that we were always monotheists. And they oops."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1957.95,"end":1963.63,"speaker":"Fr Andrew Stephen Damick","text":"These texts that have been being another thing hundreds of years, you know, with super care."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1964.51,"end":1965.95,"speaker":"Fr Stephen De Young","text":"Which they are copying."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1966.43,"end":1966.83,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1967.63,"end":1969.47,"speaker":"Fr Stephen De Young","text":"They themselves are copying."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1969.95,"end":1970.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1970.91,"end":1972.67,"speaker":"Fr Stephen De Young","text":"They're the only ones who can read."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1973.71,"end":1974.27,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1974.67,"end":1976.75,"speaker":"Fr Stephen De Young","text":"They just miss, miss this stuff."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1976.99,"end":1977.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1979.32,"end":1981.16,"speaker":"Fr Stephen De Young","text":"Right. Can't make this up folks."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1981.64,"end":1982.2,"speaker":"Fr Andrew Stephen Damick","text":"That's."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":1985.08,"end":2008.61,"speaker":"Fr Stephen De Young","text":"I just, I don't, I don't have that critical scholar bone, I guess. Right. Like actually I kind of can't. A couple of times I've tried to come up with something like that as parody and then found out somebody really published an article you can't satirize anymore. Yes. Yeah. Like because you, you make something up."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2008.61,"end":2014.21,"speaker":"Fr Andrew Stephen Damick","text":"And then that, you know, is a joke and then someone out there is doing it unironically."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2014.77,"end":2067.31,"speaker":"Fr Stephen De Young","text":"Yes. Yeah. So as David Hume said, there's no philosophy so absurd that some philosopher has not proposed it. Yeah. So where, where are some places? There's lots of places where this adjective is used to describe Israel. I would point to a few of. Isaiah is particularly thick with them if you're a 19th century German, particularly Deutero Isaiah, but like Isaiah 41, verse 8. Isaiah 44, verse 1, Isaiah 45, 4. Interestingly, in all three of those contacts, God is referring to Israel as his chosen, but in none of those three is he particularly happy with them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2068.91,"end":2070.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's not like I love these people best."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2071.71,"end":2077.63,"speaker":"Fr Stephen De Young","text":"Yeah, these people are kind of the worst, but they're mine. It's more. It's like."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2077.63,"end":2087.15,"speaker":"Fr Andrew Stephen Damick","text":"It's. It's like. It's like when. When Obi Wan says to Anakin, you were the chosen one. Oh, come on."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2087.15,"end":2089.11,"speaker":"Fr Stephen De Young","text":"I mean, can't I reference the worst."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2089.19,"end":2091.83,"speaker":"Fr Andrew Stephen Damick","text":"The very worst of the Star Wars?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2092.63,"end":2094.35,"speaker":"Fr Stephen De Young","text":"That is not the worst of the Star Wars."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2094.35,"end":2094.83,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2094.83,"end":2097.79,"speaker":"Fr Stephen De Young","text":"Okay. Actually, I think by a million miles that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2097.79,"end":2100.47,"speaker":"Fr Andrew Stephen Damick","text":"I think Attack of the Clones is probably the worst."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2100.55,"end":2110.07,"speaker":"Fr Stephen De Young","text":"That may be, like, the fifth best. Wow. Like, Phantom Menace, first of all, is the worst of the prequels."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2110.31,"end":2111.31,"speaker":"Fr Andrew Stephen Damick","text":"You think so, huh?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2111.31,"end":2112.67,"speaker":"Fr Stephen De Young","text":"By a country mile."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2112.67,"end":2115.47,"speaker":"Fr Andrew Stephen Damick","text":"I think Episode two is the worst of prequels, honestly."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2115.95,"end":2116.99,"speaker":"Fr Stephen De Young","text":"No, it's mid."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2119.07,"end":2122.43,"speaker":"Fr Andrew Stephen Damick","text":"It's wooden, but."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2122.51,"end":2126.03,"speaker":"Fr Stephen De Young","text":"Yeah, well, all of it is because George Lucas wasn't really directing anymore."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2126.19,"end":2128.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just phoning it in."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2128.15,"end":2132.03,"speaker":"Fr Stephen De Young","text":"Well, people. That. People don't remember that he didn't direct Empire Strikes Back in Return of the Jedi."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2132.03,"end":2134.59,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Direct the first one."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2134.59,"end":2150,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But now with Disney Star wars out, like, I know Episode three shines like the stars of heaven compared to Holy Cow Rise of Skywalker, you were the."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2150,"end":2154.68,"speaker":"Fr Andrew Stephen Damick","text":"Chosen one, but you. You have made me mad. And so therefore I will let you go into flames in lava."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2154.76,"end":2172.9,"speaker":"Fr Stephen De Young","text":"He pointed out the great truth that once you have the high ground, it's over. It's true in all forms of life. I repeat that line every time. One of my dogs will jump up onto the bed while the other dog is down below. It's like, it's over. She has the high ground."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2173.22,"end":2174.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2176.26,"end":2205.25,"speaker":"Fr Stephen De Young","text":"Speaking of high ground, chosen is also used to refer to Jerusalem. This adjective is used to refer to Jerusalem as the chosen city. Yep. That may be less familiar to people. I mean, like, if you put that on Match Game, maybe you'd match with Ruth. Buzzy. I don't know. It's a long shot. You get, like, one point."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2208.69,"end":2209.09,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2211.01,"end":2230.78,"speaker":"Fr Stephen De Young","text":"A couple good examples of that are in First Kings 11:32 and 14:21, or Third Kingdoms, if you're using the Orthodox study Bible. And the idea there is Jerusalem is chosen is the chosen city because the temple is there. And so God has placed his name there."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2231.26,"end":2231.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2231.9,"end":2234.54,"speaker":"Fr Stephen De Young","text":"Although that's where his presence is. That's where the spirit is."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2234.7,"end":2250.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. But I mean, remember, everybody, God did not, like, choose for the Temple to be there. He sort of was okay with it when they. When they built it. But ultimately he was about the tabernacle. But yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2252.7,"end":2255.42,"speaker":"Fr Stephen De Young","text":"In the broad sense of divine providence."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2256.14,"end":2257.5,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2259.9,"end":2290.66,"speaker":"Fr Stephen De Young","text":"But within the narrative, within the narrative of first and second Kings or third and fourth kingdoms, within that narrative, God does not command them to build a temple for him in Jerusalem. David gets the idea to do that. God tells David he can't. His son will. Solomon builds it. And then if you read the prayer, God sort of in his response to Solomon's prayer, acquiesces."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2291.3,"end":2291.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2291.94,"end":2292.66,"speaker":"Fr Stephen De Young","text":"To place it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2292.74,"end":2294.5,"speaker":"Fr Andrew Stephen Damick","text":"Well, okay, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2294.74,"end":2352.9,"speaker":"Fr Stephen De Young","text":"But this is not a case where out of all the cities, God picked this one and told them to put a temple there. That's not what happens. In fact, if. If you're going to make an argument for what, where God picked, it would probably be shiloh. Actually read 1st and 2nd Samuel closely. But anyway, yeah, so again, chosen is this adjective describing the place. Because this city has this special role of being the host to the temple of God. Now, it is also used for subgroups of people, meaning groups of people within Israel are referred to as chosen. So Israel as a whole is chosen. But then also there are subgroups at various points."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2353.31,"end":2354.59,"speaker":"Fr Andrew Stephen Damick","text":"The chosen among the chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2357.07,"end":2362.03,"speaker":"Fr Stephen De Young","text":"The what is. What is higher than USDA choice? Is prime higher than choice?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2363.55,"end":2364.43,"speaker":"Fr Andrew Stephen Damick","text":"I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2365.39,"end":2367.63,"speaker":"Fr Stephen De Young","text":"Come on, man. You don't know how to grade meat?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2367.95,"end":2382.35,"speaker":"Fr Andrew Stephen Damick","text":"Look, I buy my meat from a farm out in northwestern Pennsylvania. Like, there's no, like, stamps and primes and choices on it, you know? Yeah, Half a cow, half a pig, it fills up my freezer."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2382.35,"end":2385.15,"speaker":"Fr Stephen De Young","text":"You don't detest the agricultural errors of the Anabaptists?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2387.87,"end":2392.03,"speaker":"Fr Andrew Stephen Damick","text":"Actually, it's a big clan of Catholics that I buy from out there. In fact."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2393.87,"end":2398.83,"speaker":"Fr Stephen De Young","text":"That was me throwing another bone to. That was a deep cut reference for our Calvinist fans."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2398.99,"end":2399.39,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2401.39,"end":2402.75,"speaker":"Fr Stephen De Young","text":"See, I got something for them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2402.75,"end":2410.65,"speaker":"Fr Andrew Stephen Damick","text":"I buy my milk from Anabaptists. Yeah. Mennonites. Yeah. But I buy my. I buy my cows and pigs from Catholics. What can I say?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2411.37,"end":2416.89,"speaker":"Fr Stephen De Young","text":"Yes, well, every good Dutchman detests their errors. So we do, by the way, have."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2416.89,"end":2419.37,"speaker":"Fr Andrew Stephen Damick","text":"One person who's tuning in from the Netherlands."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2419.69,"end":2487.73,"speaker":"Fr Stephen De Young","text":"So I was to believe one of the chosen people. Yes. So, yeah. So one example of chosen being used for one of these subgroups of people is in Numbers, chapter one, verse 16. Everyone's favorite book, the Book of Numbers. But it refers to the elders of the people. Right? The 70 or 72 elders as the chosen. Right. These are those chosen to be the elders of the people. And then it says, who are the chiefs among the tribes? So these people were already tribal chiefs, like Roman reigns or solo sokoa, and yet they're then chosen to be elders, to be the elders of the people assisting Moses. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2488.69,"end":2489.09,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2492.69,"end":2495.25,"speaker":"Fr Stephen De Young","text":"How is chosen working there? Right, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2495.41,"end":2498.69,"speaker":"Fr Andrew Stephen Damick","text":"Clearly God didn't pick them. They were already kind of in a position."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2499.73,"end":2505.09,"speaker":"Fr Stephen De Young","text":"Well, Moses did. Right. It wasn't like, okay, I'm going to pick who's going to be in charge. I pick the people who are already in charge."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2505.41,"end":2508.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2508.94,"end":2540.91,"speaker":"Fr Stephen De Young","text":"That doesn't make a lot of sense. Right. So what this is saying is what chosen is doing there. What's the word again, translated as chosen? What it's doing there is. It's talking about those people who had been the chiefs within the tribes were made the elders of the people. They were given this role. They were put into this office. Right. This body, this governing body was constituted by the people who were the chiefs of the various tribes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2541.95,"end":2542.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2542.99,"end":2583.76,"speaker":"Fr Stephen De Young","text":"Right. So this is what's going to ultimately become the Sanhedrin. But this first batch, these are the people who are already chiefs of the tribes. They weren't sort of people elected, chosen at random. Moses didn't sort of look around the Simeonites and say, I like the cut of that guy's jib. You're on the council. Right. Like this was. They're already leaders. But by far the most common way that this term chosen is used to describe a group within Israel is to describe a military unit. This adjective is used to describe Israel's army."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2584.08,"end":2586.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Several places in the Old Testament, actually."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2586.4,"end":2599.81,"speaker":"Fr Stephen De Young","text":"Yes. You're given some number, sometimes a ludicrous number, like 180,000. In one case, 180,000 chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2599.89,"end":2601.01,"speaker":"Fr Andrew Stephen Damick","text":"They are the chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2601.49,"end":2633.62,"speaker":"Fr Stephen De Young","text":"Yes. You can see this in places like Judges 20:34, 1st Samuel 24:2, 1 Samuel 26:2, 2nd Samuel 6, 11 Kings 12:21. Here's the orthodox study Bible. You know, first kingdoms, second kingdoms, third kingdoms. Let me suggest that 180,000 chosen doesn't mean that, say, David went and picked 180,000 people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2634.1,"end":2635.54,"speaker":"Fr Andrew Stephen Damick","text":"I mean, he could have been a."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2635.54,"end":2641.18,"speaker":"Fr Stephen De Young","text":"Heck of a recruiter out of. Right. But recruiting isn't the same as picking either."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2641.18,"end":2642.3,"speaker":"Fr Andrew Stephen Damick","text":"I know. I'm just saying."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2642.54,"end":2645.66,"speaker":"Fr Stephen De Young","text":"Right. Like that's."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2645.66,"end":2646.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, that's."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2646.94,"end":2648.14,"speaker":"Fr Stephen De Young","text":"Write these names down."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2648.3,"end":2651.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That's a mustering. That's a mustering. It's not a picking."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2651.66,"end":2663.98,"speaker":"Fr Stephen De Young","text":"Right, right. And in fact, if you look at 2nd Samuel 6, verse 1, for example, 1 of those off the list. Right. It says that David gathered the chosen. Or no, this is Saul. Saul gathers the chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2664.06,"end":2666.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not that he chose the chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2666.71,"end":2669.59,"speaker":"Fr Stephen De Young","text":"Right. The verb is gather. Chosen as an adjective."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2670.23,"end":2670.63,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2671.99,"end":2725.22,"speaker":"Fr Stephen De Young","text":"So he takes all of those who have this quality of being the chosen, and he gathers them all up to take them to war. He musters them, right. He gathers them all up. So chosen here. Right. That verb that we translate, chosen, is referring to certain kinds of qualifications, Right. What is that? Well, there are no standing armies in the ancient world. In this period. Okay. In this period of antiquity, the army, your army is called up and it consists of the able bodied men at a certain age range. Right. Who you gather them all up to make war. That's your fighting force."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2725.3,"end":2727.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not professional soldiers."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2727.38,"end":2768.69,"speaker":"Fr Stephen De Young","text":"Yeah. There aren't. There are little bands of professional mercenaries who travel around. Like David forms one of those for a while when he goes to fight for the Philistines and stuff. But that's not your national army, is not those guys. Right. If you can afford to hire some of those guys, you set them up as commanders over, you know, the 12,000 farmers you've pledged to pull together between the ages of, you know, 18 and 35. Right. Who, who are your army? Right. So this is what the gathering is, gathering those people up. But what does it mean that those people are chosen? Well, it means they meet those qualifications."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2769.73,"end":2770.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2771.9,"end":2779.34,"speaker":"Fr Stephen De Young","text":"They're bakir because they meet, they're able bodied. Right. If they're not able bodied, they're not."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2780.06,"end":2781.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, they're a certain."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2781.1,"end":2821.77,"speaker":"Fr Stephen De Young","text":"Therefore it. Right. They are a. Yeah. So they are qualified to then have this role as a fighting man. Right. And so we're working our way down. You find a lot. This is not so much in the New Testament. The idea is in the New Testament, but the phrase is not in the New Testament. But what you find a lot in second Temple Jewish literature is that the term the elect one is used interchangeably with the term the anointed one, that is Messiah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2823.45,"end":2823.93,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2824.82,"end":2833.74,"speaker":"Fr Stephen De Young","text":"Right. And of course, anointed. What does the anointed mean in there? It means anointed to be king, anointed to be the Messiah, anointed purpose, or."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2833.74,"end":2834.42,"speaker":"Fr Andrew Stephen Damick","text":"To be a priest."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2835.3,"end":2862.85,"speaker":"Fr Stephen De Young","text":"And so here bakir is being set up as synonymous with that. Right. The one given this office. Right. This one who is singled out, who is identified, who is. Right. So it's clearly serving that purpose there. Right. It's not. Again, and especially as Christians, we would have to say God did not sort of look at all the people and choose one of Them to be the Messiah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2863.97,"end":2868.37,"speaker":"Fr Andrew Stephen Damick","text":"Right. Unless you're an adoptionist."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2869.09,"end":2874.93,"speaker":"Fr Stephen De Young","text":"An adoptionist or just Jewish and not a Christian. Right. Maybe that'll work. Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2874.93,"end":2875.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2877.42,"end":2883.5,"speaker":"Fr Stephen De Young","text":"But, yeah, that, that, that dog don't hunt."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2883.74,"end":2889.7,"speaker":"Fr Andrew Stephen Damick","text":"Sorry, adoptionist. That might be our first. Sorry, adoptionists in the whole podcast for four years. It doesn't come."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2889.7,"end":2921.24,"speaker":"Fr Stephen De Young","text":"I know someone who kind of is one, but kind of. So. Yeah. So there's a place where pretty clearly a Calvinist being a Christian of a type would have to say that elect means something different. But now we come to what, to me, kind of ruins the whole thing."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2922.28,"end":2930.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What does it mean when in the New Testament they talk about elect angels?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2931.69,"end":2938.97,"speaker":"Fr Stephen De Young","text":"Well, it's St. Paul who says it in the New Testament. Yes. I don't think they is his chosen pronoun, so pretty sure he's a he."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2938.97,"end":2940.73,"speaker":"Fr Andrew Stephen Damick","text":"Just the quality of his pronoun."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2940.73,"end":2942.25,"speaker":"Fr Stephen De Young","text":"You and your liberal sensibilities."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2945.29,"end":2952.73,"speaker":"Fr Andrew Stephen Damick","text":"It's the royal they, the apostolic we. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2952.73,"end":2961.41,"speaker":"Fr Stephen De Young","text":"First Timothy 5, verse 21. St. Paul refers to the elect angels, but that phrase, the elect angels is all over the place in Second Temple literature."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2961.73,"end":2963.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, see, there's. Are they for you?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2964.29,"end":2982.05,"speaker":"Fr Stephen De Young","text":"And yeah, but you said in the New Testament. Anyway, so in Second Temple literature, a lot of times when it's used, it's pretty clear how it's being used because the elect angels are referred to in kind of martial contexts."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2985.45,"end":2985.69,"speaker":"William","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":2987.77,"end":3001.53,"speaker":"Fr Stephen De Young","text":"Depictions of sort of the final cosmic battle between the Messiah and Belial. Right. It refers to the Messiah coming with the elect angels. Well, we saw how elect was used for, like a military unit. Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3002.01,"end":3002.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3002.41,"end":3033.91,"speaker":"Fr Stephen De Young","text":"So it'd be sort of the angels who have that role. Right. Or sometimes it's used to refer to, like, cherubim and seraphim who have this particular role or status. Right. But again, it's very clear that it has to sort of mean something like that. Right. Like, it can't mean, like the Calvinist version of what that word elect or chosen means."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3034.39,"end":3049.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because like within. Within Calvinism, it's about God picking certain people to be saved and then picking other people not to be saved."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3050.17,"end":3050.57,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3051.05,"end":3063.2,"speaker":"Fr Andrew Stephen Damick","text":"Now, now we should say that this is an inherited. At least part of it is an inherited right view. Calvin did not make the core before."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3063.35,"end":3065.19,"speaker":"Fr Stephen De Young","text":"Yeah. Before we dive into that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3065.35,"end":3066.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3066.23,"end":3071.67,"speaker":"Fr Stephen De Young","text":"Right. Because someone might have said. When we just said, well, wait, can you say that? Somebody might have said, well, why not?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3073.51,"end":3073.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3073.91,"end":3079.99,"speaker":"Fr Stephen De Young","text":"Right. There might be somebody out there who said, why not? We'll just say, yeah, God chose which angels would remain loyal and which ones would fall."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3080.79,"end":3081.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3081.19,"end":3082.87,"speaker":"Fr Stephen De Young","text":"But why is that a problem?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3083.27,"end":3084.63,"speaker":"Fr Andrew Stephen Damick","text":"Because there's."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3084.63,"end":3085.99,"speaker":"Fr Stephen De Young","text":"That's what we're going to get into now."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3086.23,"end":3088.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's no salvation for angels."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3088.39,"end":3135.1,"speaker":"Fr Stephen De Young","text":"Right. We're going to explain to you why that's a problem in terms of the Calvinist understanding of election. Yeah. So, yeah, we're getting into supra and influence relapserianism. So say what you want, Calvinist, you can't accuse me of not knowing what I'm talking about. So. Yes, his father Andrew said, before I cut him off, as I so often do, you do the. Oh, don't be a sad sack about it. So this is not. People think of Calvinism as predestinarianism, Right. Predestinarianism is actually a very small part of Calvinism."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3135.66,"end":3138.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's a big. Calvinism is a whole bunch of stuff."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3138.94,"end":3142.14,"speaker":"Fr Stephen De Young","text":"Is a whole system of thought and belief and piety."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3142.62,"end":3145.26,"speaker":"Fr Andrew Stephen Damick","text":"It's not just the soteriology, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3146.7,"end":3148.22,"speaker":"Fr Stephen De Young","text":"Let alone just the predecessor."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3148.22,"end":3150.62,"speaker":"Fr Andrew Stephen Damick","text":"Eucharistic theology has its own. Like there's all kinds of."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3151.58,"end":3157.98,"speaker":"Fr Stephen De Young","text":"This is why Reformed Baptists aren't really Reformed and aren't real Calvinists. See, here we go. I'm currying favor with some of the Calvinists."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3158.14,"end":3159.66,"speaker":"Fr Andrew Stephen Damick","text":"You have chosen some of them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3159.82,"end":3180.38,"speaker":"Fr Stephen De Young","text":"Yes, I've chosen some of the Calvinists to curry favor with while the elected Calvinists putting down some others. See, I mean, hey, if you give me Presbyterians versus Reformed Baptists, I gotta side with the Presbyterians. Right? You gotta baptize them babies anyway."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3181.34,"end":3183.74,"speaker":"Fr Andrew Stephen Damick","text":"They do better architecture as well."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3188.94,"end":3227.69,"speaker":"Fr Stephen De Young","text":"So. Yeah. So in terms of what John Calvin himself says about predestination and reprobation. Reprobation is the other side. Right. And you need to be clear. Calvin very clearly accepted both. The Calvinist tradition at large has accepted both. God chooses people to give eternal life and salvation. God chooses people according to them, to damn to eternal torment."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3227.93,"end":3229.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3229.76,"end":3246.36,"speaker":"Fr Stephen De Young","text":"That's. That's it. That's there. Now the Lutherans, right, the Lutherans, they're a little more dodgy, a little harder to nail down. They say God chooses people to save, but he doesn't choose people to. Damn right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3246.44,"end":3248.68,"speaker":"Fr Andrew Stephen Damick","text":"He just fails to choose them to save."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3248.92,"end":3258.52,"speaker":"Fr Stephen De Young","text":"You. You figure out how that works. Yeah, but that's a Lutheran thing. Those guys are like jello sometimes. You can't nail them to a wall."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3261.08,"end":3262.04,"speaker":"Fr Andrew Stephen Damick","text":"Can'T nail them down."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3262.28,"end":3273.88,"speaker":"Fr Stephen De Young","text":"But the Calvinist, Richard very clearly says both. Right? But that said, Calvin gets his view of predestinarianism from the Dominicans."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3275.56,"end":3276.2,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3277.08,"end":3407.68,"speaker":"Fr Stephen De Young","text":"He is not really an innovator on that. Particular front. Now, when you get to some of the secondary doctrines related to election and reprobation, like limited atonement and stuff, there, Calvin goes in a different direction, okay? But predestination, reprobation itself, he's getting from the Dominican tradition within Roman Catholicism to the point that if you go and read and I do not recommend doing this, you know, I give to the Presbyterians and now I take away. I don't recommend going and trying to read the Westminster Standards. It is so boring. It is like. It is English Scholasticism. It is like the most boring possible form of document, right? Like everything tedious and dry about scholasticism mixed with everything tedious and dry about English philosophy, like, in one place. But if for some reason for a class or something, you have to read the Westminster Standards, or if you just go and look up the statement in the Westminster Standards about reprobation, about people being chosen for eternal damnation, it is straight plagiarized from the Summa Theologica of Thomas Aquinas. Like, you would get kicked out of school if you turned in the Westminster Standards. They'd say you cheated off of old Thomas's paper. Now, it's important, though, right? As I said, once you get to the ancillary stuff that flows from that, Calvin goes. And the Calvinist tradition after him go in a different direction. So for Thomas and yes, I can't believe I'm the one who has to tell people this. Okay, you refer to him as Thomas Aquinas is not his last name."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3408.32,"end":3410.32,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, that's where he's Thomas."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3410.32,"end":3411.72,"speaker":"Fr Stephen De Young","text":"It means from Aquino."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3411.72,"end":3412.8,"speaker":"Fr Andrew Stephen Damick","text":"Aquino. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3412.8,"end":3431.77,"speaker":"Fr Stephen De Young","text":"Okay, I know. Like, if you're Lois Lane calling Clark Kent Smallville. Okay, that works. But people don't call me Lafayette. They don't call me Redlands, where I grew up. Okay, like, what's up Redlands? Right, yes, that. It's not a thing."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3432.01,"end":3433.93,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I feel like we should call you that now."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3433.93,"end":3435.29,"speaker":"Fr Stephen De Young","text":"You want me to just call you Guam?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3438.81,"end":3440.53,"speaker":"Fr Andrew Stephen Damick","text":"I did live there for five years old."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3440.53,"end":3473.05,"speaker":"Fr Stephen De Young","text":"Guam over there, so. Right, so you refer to him as Thomas anyway, that's why they're called Thomists. Yeah, Not a keenists. Sorry, end of that particular rant. And why is this me? Why aren't the Roman Catholics straightening people out on this? Falling down on your jobs? So what Thomas is doing. Part of what triggered this rant, by the way, dear listeners, is that Father Andrew referred to him as Aquinas in the notes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3473.54,"end":3475.78,"speaker":"Fr Andrew Stephen Damick","text":"I know, I know, I know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3476.5,"end":3478.1,"speaker":"Fr Stephen De Young","text":"I'm not safe in my own home."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3480.98,"end":3484.58,"speaker":"Fr Andrew Stephen Damick","text":"So it's always a good day when I can trigger you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3484.82,"end":3584.07,"speaker":"Fr Stephen De Young","text":"Yeah. So what Thomas is trying to do, and again, I'm no apologist for Thomism, but I try to be fair. So what Thomas is trying to do is he's trying to express a synergistic relationship between God's providence and free will. And so for Thomas, it is true, at least in the summa. Right. I am no scholar of Thomas Aquinas. Right. I studied him some with a Cistercian monk, so I know something. But far from everything. But Thomas is trying to express that everyone who comes to God, God has come to them. And everyone who rejects God, God has rejected them. But what Thomas doesn't do is he doesn't ascribe any kind of causal relationship between those two facts. Meaning he doesn't say, as Calvin and the Calvinist tradition Will and the Jansenists did, that God's accepting or rejecting someone caused them to accept or reject God. But he also doesn't say the opposite."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3585.67,"end":3586.07,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3586.23,"end":3659.72,"speaker":"Fr Stephen De Young","text":"He also doesn't say that someone accepting God caused God to accept them or someone rejecting God caused God to reject them, as if they were operating independently and could apply this causal thing to God. Right. So there is for Thomas an absolute correlation between those things. But. But no relationship of causation. You can decide for yourself how well that works. Doesn't really do it for me. I don't. I don't think it's a necessary distinction to make. I think the distinctions he's having to make are because he's gone down this sort of scholastic trail of making a bunch of other previous distinctions. Right. So he's, he's kind of trying to solve problems that he created for himself with his views on other topics. Yeah, ultimately. And, and he's. He's trying. Thomas is trying really hard in the summa to reconcile St. Augustine with the other church fathers. And by reconcile, I mean trying to make it so that they're all saying the same thing and there are places where they just manifoldly disagree."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3661.25,"end":3661.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3661.49,"end":3722.08,"speaker":"Fr Stephen De Young","text":"St. John Cashin, for example, just disagreed with St. Augustine about some things on this very topic. Right. But so Thomas is very much. His approach is always to try and reconcile everybody. No, no, they're all really getting at the same thing. Right. If you really understand them. Right. And so that again, creates a whole bunch of problems for himself that he wouldn't have if he'd just say, well, okay, some of these places where they disagree, St. Augustine didn't get it Right. Then you don't have to try and pile those knots. Yeah, but. So that Dominican view precedes John Calvin and the Calvinist tradition. There's other folks got shock. There's, there's a whole thing here. I'm not gonna later about that. You need to send an email to Dr. Cyril Jenkins about this. That's who you need to send. Ask him all about Gotcha."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3722.4,"end":3726.88,"speaker":"Fr Andrew Stephen Damick","text":"Wow, you told somebody to send email to someone besides me?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3726.96,"end":3732,"speaker":"Fr Stephen De Young","text":"Someone other than you. I don't think you know who Gotcha is. I think you think Gotcha is a department store."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3732.48,"end":3735.44,"speaker":"Fr Andrew Stephen Damick","text":"So I mean it sounds like a German person to me. So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3738.32,"end":3739.52,"speaker":"Fr Stephen De Young","text":"But yeah, go bother."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3739.97,"end":3743.65,"speaker":"Fr Andrew Stephen Damick","text":"We have a lot of names like that in this area that I live in. We have all these germans."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3744.93,"end":3760.45,"speaker":"Fr Stephen De Young","text":"Go bother Dr. Dr. Cyril Jenkins about this. Okay. He would love, I think, to type you a 2000 word email explaining, gosh, his relationship to predestinarianism. But I will pass over that in silence at this point."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3761.49,"end":3761.89,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3764.69,"end":3817.06,"speaker":"Fr Stephen De Young","text":"But I want to try to be fair to the Calvinists even as we're picking on them. But, but so Calvin makes this. The Dominican view is sort of a plank then in a more to again be fair to Calvin in some ways a more logically consistent system, right. Where Thomas is trying to hold a bunch of things in tension because he wants to reconcile everybody. Calvin feels free to just choose one of the two conflicting things. Right. To go one way instead of the other and not try to reconcile it. Just say one was right, the other was wrong on these topics. He basically says St. Augustine was right. A bunch of other topics. He says St. Augustine was wrong. But he's willing to just sort of pick a winner on any given topic."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3820.1,"end":3821.14,"speaker":"Fr Andrew Stephen Damick","text":"A winner is you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3822.62,"end":3912.1,"speaker":"Fr Stephen De Young","text":"But so keep in mind we're explaining what the problem is with elect angels. Where are we again? Yeah, yeah, reorient here. We're getting there. What's the problem with, with God just picking which angels are going to be faithful and which ones are going to fall. So within Calvinism, right, the structure of salvation is sort of very carefully articulated on the divine end. When we get into the second half, we're going to talk about on the human end, like the golden chain of redemption as they call it, and how a human is saved. That's on the human side, the divine side. We're talking about from a Calvinist perspective, God's plan of salvation. So this is in eternity, in eternity past, whatever that means or various ways as we've talked about before on the show. I think you can't really do any of this Calvinist stuff if you really remove the temporal element. But if you talk to Calvinists, they will insist there is no temporal element. They are talking about the logical order of God's decrees in his own mind."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3912.5,"end":3917.54,"speaker":"Fr Andrew Stephen Damick","text":"In the mind of God mapped out. They have the mind of God mapped out."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3918.02,"end":3995.08,"speaker":"Fr Stephen De Young","text":"Yes. There's some wobbly trinitarianism here too, in terms of the mind of God and who that one person is. But we will. We don't need to go into that now either. So. And the reason this is important, the reason this is important for the, for Calvinists, is that. Right. I mean, it may sound, if you're not a Calvinist, it may sound absurd to you, possibly rightly so, that any human thinks they know the logical order of God's decrees in his own mind. Right. Maybe rightly so. Right. But again, our Calvinist friends would say, well, God has in certain ways revealed this to us. Right. So that, that would be their counter argument and the core thing. So the core issue here is a Calvinist friends. Most of them, most of them do not want to make God the author of evil. They don't want to make God the cause of evil in the world."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":3995.4,"end":4002.36,"speaker":"Fr Andrew Stephen Damick","text":"Sure, yeah. I mean, that's. Although there are some that be like, yeah, God created evil."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4002.36,"end":4068.5,"speaker":"Fr Stephen De Young","text":"Yes. Who are amazingly consistent. And we'll just say, yes, every evil, horrific, nightmarish thing that has ever happened. God, before he created the world, declared that that would happen and made it happen. Right. Points for consistency, I guess, but most of them, right. And so when faced, and this is a little bit of a jab, I admit it, but they could take some jabs. The general Calvinist tactic, when someone points out the logical outcome of these kind of beliefs, like they say, well, that would make God the other, is to make a distinction. And so the real purpose of talking about the order of these decrees in the mind of God is to make certain distinctions. So one of those distinctions is between infra lapserianism and super lapsarianism. You may be thinking we're in rarefied."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4068.5,"end":4069.06,"speaker":"William","text":"Air here."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4071.46,"end":4138.21,"speaker":"Fr Stephen De Young","text":"But I was for a time in possession, I passed them on for historic preservation, literally, of a set of bulletins from Reverend Danhoff's church in, in Michigan, who was part of a split within the Dutch Reformed Church. They were his weekly bulletins from the 1920s. And the, the bulletins are like half in Dutch and half in English. Right. Actually more Dutch. Most of the English is like the Bible and the Dutch is like all the announcements of the community stuff. And, and each of them has sort of a theology note a little Theology note on the back for these Dutch farmers, right? To help them learn some things about the faith, right? The Dutch Reformed faith. One of them is about the difference between infra Lapserian and super Lapserianism."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4138.45,"end":4153.73,"speaker":"Fr Andrew Stephen Damick","text":"Amazing. I always get that mixed up. I have to go look it up every time. I know. I mean, these are just not words that I attend and I use some words, you know, but these are not words that I use on the radio."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4154.77,"end":4159.33,"speaker":"Fr Stephen De Young","text":"Well, okay, so lapsus, right? Laps, yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4159.33,"end":4162.01,"speaker":"Fr Andrew Stephen Damick","text":"That's the fall, is the fall of mankind."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4162.01,"end":4182.48,"speaker":"Fr Stephen De Young","text":"That's the Latin word for the fall, right? The fall of man. And so that's the lapsarian part, right. And so the question is, where in God's decrees is that decree of the fall in terms of vis a vis election, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4183.04,"end":4201.62,"speaker":"Fr Andrew Stephen Damick","text":"Is it that God, he decreed the fall because he was decreeing election or reprobation? Or did he decree the sin of man and then he decreed to save some? Because he did that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4202.02,"end":4292.54,"speaker":"Fr Stephen De Young","text":"Yeah, right. So, but you know, clear as mud, okay? It covers the ground. No, infra lapsarianism, which is the majority of Calvinists, right, right. Are infralaps Arian, they would say, right, that God decreed that humanity would fall into sin, right? Because they say God decrees everything that happens. So he decreed the fall. He decreed that Adam would sin in the garden, right? According to most Calvinists in for Lapserian. And then having decreed that that all of humanity would fall into sin, God then decreed that he would save some of them and decreed that the others would be left in their sins and go on to eternal damnation. Okay? That's the majority Calvinist view, the minority Calvinist view. These people are sometimes described as hyper Calvinists, though a lot of times hyper Calvinist is just a word that a Calvinist uses for someone more Calvinist than them or more blunt about their Calvinism than them or they just don't like. But superlapsarium is the idea that God decrees that he is going to reveal his glory."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4294.54,"end":4294.94,"speaker":"Fr Andrew Stephen Damick","text":"By."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4297.1,"end":4307.76,"speaker":"Fr Stephen De Young","text":"Giving some, creating some people and giving them eternal life and creating other people, giving them eternal punishment. That's like decree one."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4308,"end":4309.04,"speaker":"Fr Andrew Stephen Damick","text":"That's pretty glorious."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4309.52,"end":4353.57,"speaker":"Fr Stephen De Young","text":"And so then based on the fact that that's what he wants to do, he declares that humanity will fall into sin as a means of getting there. Okay, so in infra lapsarian, the more common view, right, the reason God is choosing to reprobate those people is their sin, which is the product of his decree. But still they're being reprobated because of their sin. For the super lapsarian view, the More hyper Calvinist view."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4355.82,"end":4356.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4357.18,"end":4374.86,"speaker":"Fr Stephen De Young","text":"They're being reprobated just to be reprobated for God to display his glory by subjecting people to eternal punishment. And then God causes them to sin in order to set them up for that punishment."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4377.66,"end":4381.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, either way."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4382.75,"end":4388.99,"speaker":"Fr Stephen De Young","text":"But you can see how infra lapsarianism, the more common view, is kind of a distinction and a dodge."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4389.71,"end":4390.71,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4390.71,"end":4394.51,"speaker":"Fr Stephen De Young","text":"Because the sin they're reprobated for is still the result of God's decree."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4395.07,"end":4403.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's just where in this Rube Goldberg is the first domino being pushed over."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4403.55,"end":4412.79,"speaker":"Fr Stephen De Young","text":"Okay, but so how does any of this apply to angels? Right. For whom there is no redemption?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4413.51,"end":4417.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It literally says, is it in Hebrews. It's not angels that he helps."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4417.51,"end":4417.99,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4418.39,"end":4418.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4418.83,"end":4429.03,"speaker":"Fr Stephen De Young","text":"Yes. Given everything in Hebrews vis a vis angels. Right. That the elect angels can't be talking about election in this sense."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4429.75,"end":4433.74,"speaker":"Fr Andrew Stephen Damick","text":"No, they're not being saved. There's no salvation for angels."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4433.98,"end":4434.38,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4435.1,"end":4435.5,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4437.66,"end":4481.29,"speaker":"Fr Stephen De Young","text":"Brief review here at the end of our first half. Okay. Elect isn't being used the way Calvinists use it to describe angels when it's used to describe angels. It's not being used the way Calvinists use it when it's being used to described. To describe Christ to describe the Messiah as the elect one. It's not being used when that way. When it's used to describe the elders of Israel or a military unit, it's not being used the way Calvinists use it when that word is used to describe Jerusalem as the chosen city, it's not being used that way when it's used to describe Israel as the chosen people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4485.8,"end":4486.04,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4490.92,"end":4508.72,"speaker":"Fr Stephen De Young","text":"It'S not impossible. Right. It's not impossible that all of a sudden someplace in the New Testament could come along and use these same words that are used in the Old Testament and in the Hebrew Bible in a completely different way. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4508.72,"end":4509.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4509.72,"end":4525.77,"speaker":"Fr Stephen De Young","text":"So maybe sometimes someone will come along in the New Testament, just start using these words. It'll be a complete break with the Old Testament usage of these words, start using words in a different way. And this could mean that's not impossible. It happens, right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4525.77,"end":4526.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4526.25,"end":4532.81,"speaker":"Fr Stephen De Young","text":"I mean, I can't think of any cases, but logically it is possible, I suppose."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4533.85,"end":4534.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4536.57,"end":4541.78,"speaker":"Fr Stephen De Young","text":"But how likely is it?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4542.66,"end":4551.06,"speaker":"Fr Andrew Stephen Damick","text":"And if you're going to go ahead and break with all the previous usage, you're going to have to have a reason for it within the text."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4551.38,"end":4601.71,"speaker":"Fr Stephen De Young","text":"And how are you going to signal that? How is that going to be signaled in the text to say, now, wait, I'm using these ideas totally differently than than they are in the Old Testament. And let's say the someone we're talking about is St. Paul. Let's say the place we're talking about is the Book of Romans. What if we read what St. Paul says about this in the Book of Romans and the way those words are used in the Old Testament work perfectly fine. In fact, work better to explain what St. Paul is saying. What then?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4602.91,"end":4619.31,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, what then? So yeah. Yeah. All right. Well, it's been a good beefy first half. We're gonna go ahead and go to our first break here on this episode about election on Laura Spirits podcast. So we'll be right back."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4619.76,"end":4635.84,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4640.48,"end":4756.31,"speaker":"Unregistered: Commercial Narrator 2","text":"The centuries after the Protestant Reformation brought about a radical reinterpretation of The Epistles of St. Paul, disconnected from any historical reality. But Paul operated during his entire life as a faithful Pharisee within the Roman Jewish world. In St. Paul the Pharisee, Jewish apostle to all nations, Father Stephen DeYoung surveys Paul's life and writings, interpreting them within the holy tradition of the Orthodox Church. This survey is followed by DeYoung's interpretive translation of St. Paul's epistles, which deliberately avoids overly familiar terminology. By using words and ideas grounded in 1st century Judaism, DeYoung hopes to unsettle commonly held notions and help the reader reassess St. Paul in his historical context. Available now at store.ancientfaith.com Again, that is store.ancientfaith.com you've probably heard of St. Raphael Halowini, St. Alexander Hodovitzky, liturgical translator Isabel Hapgood, and other righteous men and women who made their mark on the early development of Orthodoxy in America. But what about the notorious itinerant Bulgarian monk? Or Father Raphael Morgan, the first black Orthodox priest in America? Or Vera Johnston, who served the Orthodox Church without renouncing her Theosophist roots? Their stories and many others, some edifying, some appalling, all entertaining, make up the lost histories of the early decades of Orthodox Christianity in the continental United States. Lost histories the Good, the Bad and the Strange in Early American Orthodoxy by Matthew Namie, out now@store.ancient faith.com Again, that is store and ancient faith.com."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4759.83,"end":4775.91,"speaker":"Announcer","text":"We'Re back now with the Lord of Spirits with Father Andrew Stephen Damick and Father Stephen Deyoung if you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4776.95,"end":4785.58,"speaker":"Fr Andrew Stephen Damick","text":"And we're back. It's the second half of the, this episode of the Lord of Spirits. We're talking about election. So we're just gonna, you know, I have a question."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4785.58,"end":4787.66,"speaker":"Fr Stephen De Young","text":"That's the first time I've heard that commercial for my book."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4788.38,"end":4790.02,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4790.02,"end":4805.58,"speaker":"Fr Stephen De Young","text":"And they're talking about how I'm like interpreting things within the orthodox tradition. I thought I just engaged in rank speculation, no reliable citations and so. Huh. Go figure."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4805.98,"end":4823.04,"speaker":"Fr Andrew Stephen Damick","text":"I know. Yeah. So, you know, we'll just go ahead and start this half also with, sorry, Calvinists, we're talking about election. And in this half we're going to pull up a bunch of texts from Romans because let's."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4823.12,"end":4823.76,"speaker":"Fr Stephen De Young","text":"The Bible."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4824.16,"end":4833.53,"speaker":"Fr Andrew Stephen Damick","text":"That's right. There is no Calvinism without certain special texts from Romans. At least you know, the, the predestinarian stuff, which is whatever."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4833.53,"end":4848.97,"speaker":"Fr Stephen De Young","text":"Well, if, if you're going to make the case that there is in the New Testament some this completely different usage of these terms. Right. This is where you got to go. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4849.05,"end":4850.73,"speaker":"Fr Andrew Stephen Damick","text":"Like, yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4850.81,"end":4854.73,"speaker":"Fr Stephen De Young","text":"Because if they're not being used in a different way here, they're not being used in a different way."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4855.29,"end":4857.61,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yep, yep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4858.1,"end":4859.78,"speaker":"Fr Stephen De Young","text":"We have come to the locus classicus."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4860.1,"end":4865.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, exactly. So this, this half will be all exegesis all the time."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4866.02,"end":4873.38,"speaker":"Fr Stephen De Young","text":"Yeah. Wait, I thought I did eisegesis to support my work. False gospel. Oh, okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4873.62,"end":4878.5,"speaker":"Fr Andrew Stephen Damick","text":"Hypergesus just on there."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4878.58,"end":4884.58,"speaker":"Fr Stephen De Young","text":"Who people tell me I am online seems to be different than who I actually am."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4884.9,"end":4887.34,"speaker":"Fr Andrew Stephen Damick","text":"Who is the real father Stephen Dionne."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4887.34,"end":4890.18,"speaker":"Fr Stephen De Young","text":"Creating some cognitive dissonance. I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4891.3,"end":4899.06,"speaker":"Fr Andrew Stephen Damick","text":"Let's do an in depth like Terry Gross FRESH AIR style interview. Now. We'll just. Who is the real father Stephen Dionne?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4899.46,"end":4908.74,"speaker":"Fr Stephen De Young","text":"Just someday you'll read about me in a Matthew Nami book, my appalling story, and then you'll know the truth."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4914.35,"end":4919.27,"speaker":"Fr Andrew Stephen Damick","text":"I am going to get him to write that book. We will wait until you're dead. But I get him to write that book."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4919.27,"end":4919.87,"speaker":"Fr Stephen De Young","text":"Yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4921.39,"end":4923.23,"speaker":"Fr Andrew Stephen Damick","text":"Which statistically shouldn't be that long."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4924.43,"end":4927.63,"speaker":"Fr Stephen De Young","text":"Yeah. I mean, hey, yeah. Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4928.11,"end":4963.46,"speaker":"Fr Andrew Stephen Damick","text":"Romans, Romans, chapter eight, beginning with verse 28. So, yep, here we go. Here we go. 28, 30. And we know that for those who love God, all things work together for good. For those who are called according to his purpose, for those whom he foreknew, he also predestined to be conformed to the image of his son in order that he might be the firstborn among many brothers. And those whom he predestined, he also called. And those whom he called, he also justified. And those whom he justified, he also glorified. I mean, it says it right there that he predestined them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4964.42,"end":4995.47,"speaker":"Fr Stephen De Young","text":"Right, Case. Glory, good night, everybody. Right, so that verse 28 is important, right? We don't skip that. So we have this sort of chain of verbs, right? Predestined and then called, and then justified and then glorified. Right? This is the golden chain of redemption."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4995.95,"end":4996.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":4996.43,"end":5079.39,"speaker":"Fr Stephen De Young","text":"As it is sometimes called. And sorry. Sorry, guys, and apologies to Fleetwood Mac, but we're going to. We're going to break the chain. We. So where does it begin? Begins with, we know that for those who love God, all things work together for good. For those who are called according to his purpose. Okay, so we actually have the word called appear first. So you notice something right away in the golden chain in verse 30, those whom he predestined, he also called. Well, here in verse 28, we have those who are called, and then we talk about them being predestined. But the point here that St. Paul is making all things work together for good. Meaning coming out of the context, right? There are sufferings in this life. There's persecutions. There's all of these things that we suffer. But we know that all of these things are going to ultimately work together for our good. How do we know that? Right. How do we know that? Well, all of the verbs in verses 29 and 30 for new predestined, called, justified, glorified, are all past tense. They're all completed verbs."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5080.91,"end":5081.47,"speaker":"Fr Andrew Stephen Damick","text":"Okay?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5082.83,"end":5094.67,"speaker":"Fr Stephen De Young","text":"Meaning St. Paul is talking about people in the past. He's not saying this in the present tense. Everyone who he does this to, he will also do this to he will or future tense."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5094.83,"end":5095.23,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5098.59,"end":5104.75,"speaker":"Fr Stephen De Young","text":"These are all past tense, Right. So he's talking about actual people in the past."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5106.35,"end":5108.27,"speaker":"Fr Andrew Stephen Damick","text":"This is not just generally about."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5109.07,"end":5109.47,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5109.71,"end":5110.43,"speaker":"Fr Andrew Stephen Damick","text":"Anybody."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5111.15,"end":5130.01,"speaker":"Fr Stephen De Young","text":"Right. Those whom he knew before we could see that God did this. Right? Because he's offering this. That for is a. Because this is his evidence that you and I can trust that whatever is going on in our life right now, God is going to work it to good."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5130.89,"end":5131.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5131.37,"end":5132.49,"speaker":"Fr Stephen De Young","text":"How can we trust that?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5133.77,"end":5156.02,"speaker":"Fr Andrew Stephen Damick","text":"Right? And also, I think it's important to note here, and like in the second half of verse 29, where it says, in order that he might be the firstborn among many brothers, you know, those he foreknew, he also predestined to be conformed to the image of his Son in order that he might be the firstborn among many brothers. I mean, isn't this talking about the coming of the Messiah?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5156.42,"end":5177.15,"speaker":"Fr Stephen De Young","text":"Right. Yeah, yeah, right, Right. And so we're conformed to his image. We come as brothers, meaning we're adopted as sons of God. Right. So this, he's, he's. St. Paul is not saying, oh well, you could be confident everything's going to turn out okay because I'm going to lay out a theological principle for you here."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5177.63,"end":5178.67,"speaker":"Fr Andrew Stephen Damick","text":"No, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5179.15,"end":5184.51,"speaker":"Fr Stephen De Young","text":"That says that everything's going to work out okay. I'm going to repeat myself. Right. No, he's pointing to actual people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5185.55,"end":5186.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5186.43,"end":5276.34,"speaker":"Fr Stephen De Young","text":"Right. In the Old Testament, in the Hebrew Bible, right. We can see the course of their life. Right. That those who we knew before, back in the past. Right. Now the word here that's translated, predestined by the way, is pro arezo, which means. And it means to put things in order in advance. And the putting in order, the orizo part, that that Greek verb was most commonly used again as a military term for putting a military arraying a military in formation. Right. The idea is God puts things in an order in advance. He put things in order in advance so that, so that those people who he knew before could be conformed to the image of his son. Right. So that they could become like Christ. So that Christ could be the firstborn among many brothers. Right. Well, what does that mean? Well, think about it. For you or I define salvation. Right. Christ was incarnate a long, long time ago."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5277.78,"end":5278.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5278.34,"end":5363.51,"speaker":"Fr Stephen De Young","text":"Before I existed. Right. That hadn't happened. I couldn't be conformed to his image. Right. I couldn't receive the adoption as the Son of God. If Christ hadn't lived the life he lived, if he hadn't died on the cross, if he hadn't risen again. Right. All of those things God did before I existed from the way we experience time as humans, right. All of that had to be put in place in advance. All of that had to be arranged in advance. And not just that, right. Scriptures had to be handed down. The church had to continue to exist. All of these things had to happen. And we could go back before that. All the things that led up to the incarnation of Christ, everything recorded in the Old Testament, all the way back to the creation of the world, all that stuff had to happen to make it possible for me today to find salvation in Christ, to experience theosis, which is what St. Paul's talking about. And God put that all in order so that that could happen. St. Paul is saying because of that here's recent one. God did all that. Right. So just because you're suffering now, you don't have to worry that this is all going to be for not."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5364.71,"end":5371.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Yeah. He's not laying out like a theory, but saying, look at what happened."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5373.27,"end":5382.71,"speaker":"Fr Stephen De Young","text":"And then part two of that in verse 30, he says, and look at those people. Right. Everything that was all set up. And then he called those people."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5383.61,"end":5383.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5383.77,"end":5392.33,"speaker":"Fr Stephen De Young","text":"He called Abraham out of Ur. He called those people to put blood on their doorposts and become part of Israel."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5392.49,"end":5395.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it says he justified. He put them. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5396.09,"end":5400.49,"speaker":"Fr Stephen De Young","text":"The ones he justified. He said the call of the Gospel to us. Right. And then. Yes, he put them. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5400.97,"end":5401.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5402.57,"end":5417.06,"speaker":"Fr Stephen De Young","text":"And he ultimately glorified them. Right. By the way, those alsos there do not have any aspect of temporal succession."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5418.58,"end":5419.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5419.46,"end":5423.86,"speaker":"Fr Stephen De Young","text":"In Greek, these are not like steps, Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5426.34,"end":5426.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5426.74,"end":5428.82,"speaker":"Fr Stephen De Young","text":"Right. It's like all of these things are true."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5429.06,"end":5435.06,"speaker":"Fr Andrew Stephen Damick","text":"It's like saying that man is tall and also he has brown hair and also he has two limbs, you know?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5435.19,"end":5435.43,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5435.43,"end":5437.83,"speaker":"Fr Andrew Stephen Damick","text":"Two arms. Yeah, right. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5437.83,"end":5442.47,"speaker":"Fr Stephen De Young","text":"Right, yeah, yeah. So he's saying if God does one of these things, he does all of these things."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5443.27,"end":5443.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5444.07,"end":5460.63,"speaker":"Fr Stephen De Young","text":"And he already said all things work for good for those who are called, which is one of those things according to his purpose. So if you've received the gospel, right, then you can count on God to do all of the other things he's promised to do."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5461.52,"end":5461.92,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5463.04,"end":5511.06,"speaker":"Fr Stephen De Young","text":"And he's going to say in the rest of chapter eight that we didn't read. We're not reading everything. We're going to read enough, trust me. But we're not reading. He's going to say, this is where he talks about nothing being able to separate us from the love of God. Right. From God's side. And so he makes this, this huge argument that from God's side God keeps his promises to us. You do not have to worry about God not following through on his promises. Right. The promises he's made. Okay. But then as we get to the end of chapter eight, there is at this time for St. Paul, a big objection someone might offer. Well, wait a minute. Didn't God make all those promises to Abraham?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5512.9,"end":5513.3,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5515.23,"end":5522.83,"speaker":"Fr Stephen De Young","text":"Didn't he make all those promises to Israel? And a lot of the descendants of Abraham ain't doing so good."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5523.63,"end":5524.83,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5525.15,"end":5530.35,"speaker":"Fr Stephen De Young","text":"And a lot of the Israelites, they ain't doing so hot."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5531.47,"end":5531.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5531.95,"end":5548.54,"speaker":"Fr Stephen De Young","text":"Ten tribes of them are gone. Right. And St. Paul, you're coming here to us telling us Jesus is the Messiah. And looks like most of the Jewish people disagree with you to boot."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5549.18,"end":5549.58,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5550.86,"end":5565.18,"speaker":"Fr Stephen De Young","text":"So what's going on with that? And so as we get into what's now Chapter nine, remember, these chapter divisions aren't original, but as we get into what's now chapter nine, what St. Paul's doing here beginning in chapter nine, is he's answering that objection."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5565.82,"end":5570.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So, but before we dive into chapter nine, we do now actually have some people calling."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5571.24,"end":5571.8,"speaker":"Fr Stephen De Young","text":"Oh, okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5571.96,"end":5577.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it was. I don't know, it was blank for a while, then suddenly boom, boom, boom, boom. And I'm getting all these people in the chat saying I'm trying to call."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5577.56,"end":5578.76,"speaker":"Fr Stephen De Young","text":"It was destined to happen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5579.08,"end":5579.44,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5579.44,"end":5579.88,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5579.88,"end":5589.56,"speaker":"Fr Andrew Stephen Damick","text":"So our first caller tonight is Rosine. I hope I'm pronouncing that correctly. So, Rocine, are you there?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5591.08,"end":5592.2,"speaker":"Candice","text":"Yes. Hello, Father."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5592.92,"end":5597,"speaker":"Fr Andrew Stephen Damick","text":"Hello. And. And my understanding is that you are 11 years old, is that right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5598.24,"end":5600.24,"speaker":"Candice","text":"Yes, I'm Father Tim Curran's daughter."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5600.96,"end":5615.04,"speaker":"Fr Andrew Stephen Damick","text":"Oh, well, hello, Father Tim. I'm sure you're listening in with your daughter. That is a lovely Irish name you have there, Rocine. So what is your question? Your comment for us tonight?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5616.08,"end":5630.63,"speaker":"Candice","text":"I have a question on how people elect saints. When people elect saints, when people decide to glorify people as saints, does God automatically have to agree with them?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5632.15,"end":5748.93,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. So here's how I would explain is God, who makes people saints? Right. With their cooperation with him. So if they're faithful to him, and especially if it's in a really big way, that's how we usually recognize that someone's a saint. They're really truly faithful to God in a big way. And God then works with them to. To make them holy right, to make them like himself, to make them, as Christ says, equal to the angels. And so then after their. After their death, then the church will sometimes, if God permits it, recognize that this is what has happened. Right. And so then that recognition comes through a lot of different means. The biggest one is sort of looking at their life and seeing that their life really has this major kind of, you know, manifestation of. Of the holiness of God. Right. And so then all. Often there will be some kind of informal veneration of a person that happens. But ultimately, it takes a group of bishops in synod to make the decision to officially canonize or glorify someone as a saint. And it's a long process. And sometimes when they're going through the process, they discover, hey, this isn't a good idea. We're just going to not do it. You know, there have been people that they've been investigated for canonization that gets set aside because it was. They discovered it wasn't a good idea or there wasn't enough evidence of holiness or whatever. Right. And I will tell you, you may not know this, Rosine, but there have been some cases of some accidental canonizations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5751.57,"end":5751.83,"speaker":"Candice","text":"From."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5751.9,"end":5823.11,"speaker":"Fr Andrew Stephen Damick","text":"For instance, there were. I actually only just learned this recently. There were some cases in which names of people were canonized in the Russian Orthodox Church because there was testimony about them being treated badly by the Soviets or something like that. And then it was later discovered that those people were still alive, and they just sort of quietly dropped their names off the list, you know, so it is possible that mistakes can be made, but over time, this stuff gets sifted out. So it's not like bishops make a choice, you know, to canonize someone as a saint, and then God has to say, okay, I confirm, or I. You know, I don't. You know, it's really that God is the one doing the work with the person, the actual real change in their life. And then the church recognizes that as being the case. Human beings, including bishops, are not perfect. And so that means it is possible that they can make a mistake. And as I said, there's sometimes mistakes have been made, but over time, what happens is any mistakes get sifted out. You know, does that make sense?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5824.39,"end":5826.23,"speaker":"Candice","text":"Yes. Thank you very much."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5826.63,"end":5829.83,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. Thank you so much for calling. Nice to talk to you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5831.03,"end":5832.15,"speaker":"Candice","text":"Okay. Thank you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5832.66,"end":5835.22,"speaker":"Fr Andrew Stephen Damick","text":"Thank you. All right, we're going to take."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5835.94,"end":5839.46,"speaker":"Fr Stephen De Young","text":"I'm more of that one. I mean, she."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5839.46,"end":5840.42,"speaker":"Fr Andrew Stephen Damick","text":"You can be scary."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5840.9,"end":5850.58,"speaker":"Fr Stephen De Young","text":"She seemed domesticated, so. But it's those wild kids running around the street you got to really look out for. Yeah, she seemed. She seemed pretty."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5851.62,"end":5852.1,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5854.5,"end":5855.22,"speaker":"Fr Stephen De Young","text":"From a good."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5855.22,"end":5855.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5856.26,"end":5857.22,"speaker":"Fr Stephen De Young","text":"Okay, we have."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5857.78,"end":5862.02,"speaker":"Fr Andrew Stephen Damick","text":"We have William calling. So, William, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5863.32,"end":5864.84,"speaker":"William","text":"Hello. Thank you. Can you hear me?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5865.08,"end":5867.4,"speaker":"Fr Andrew Stephen Damick","text":"We hear you. So what's on your mind, William?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5868.92,"end":5967.57,"speaker":"William","text":"Unfortunately not. Nothing quite so adorable as the previous caller. I come instead with a question and well inspired by a friend of the show who is not Bart Ehrman. So talking about election in the case of Israel, and the churches were heading towards it, it seems. In the first half of this show, we discussed how the nation of Israel is not one of the 70 nations, but it is still a nation. A 70 First Nation that was called by taking people from the other nations and grafting them into the branch of Abraham. But the church, by contrast, as I understand it, is supernational in that it is not above the nation. I'm sorry, it is above the nations without superseding them. And its existence does not dissolve the component nations. So if I'm following correctly, God chose from the tree of Abraham and grafted some from other nations to build as psionic Israel, and then chosen the tree of Abraham and the nations to build the Pentecostal super national Israel. But also we say that the church is Israel and the Sinaic chosen nation and the Pentecostal chosen super nation seem to be different from each other. So what's going on there?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5969.9,"end":5976.7,"speaker":"Fr Andrew Stephen Damick","text":"I have thoughts, but I'm going to just hand it to you, Father, because I know you have very clear and precise ways of talking about this particular question."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5977.34,"end":5978.94,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5979.18,"end":5979.58,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":5981.5,"end":6268.25,"speaker":"Fr Stephen De Young","text":"We'Ve got to distinguish some things, right? So the word that gets translated and we're, as we keep going in Romans, we're going to get into some more of this. So this will be important to keep in mind. The term that's translated Jew or Jews in most English translation of the Bible is actually Judeans, which is essentially Judahites, meaning descendants of the nation of Judah. Israel can refer to the northern kingdom of Israel, but generally doesn't. Even though historically that kingdom was known sort of in some places as Israel for part of its existence that is referred to generally as Ephraim or Joseph in the Hebrew Bible, the northern kingdom and the southern kingdom, even though it includes Judah and Benjamin and some of the Levites, is referred to as just Judah. And then Israel is the overarching term that includes both of those. So the view that St. Paul is going to take, and we're about to go through the actual passages where he's actually doing this view that St. Paul is going to take, is that Israel has a lot of open space because Israel has a whole bunch of branches that have been cut off, 10 tribes worth, right? Plus not all of Judah, Judea. Right. Have been cut off or were in danger at the time he's writing of being cut off. But if you know anything about grafting, when you make a cutting, you can then graft in a branch from another tree or another plant in at the point of the cut. And so for St. Paul, people of the nations get grafted into that tree, meaning they draw their life from the root of that tree. That's what it means to be grafted in. And they can now be called one people in one tree. That one people is named Israel still. But the branches, right? If you take a branch from one tree and graft it into another tree, the branch doesn't change and become whatever that tree is, right? So that's a fruit bearing Branch, the fruit that it bears could be in an actual tree, could be a different fruit than what the rest of the tree is bearing. Right. It remains a branch of the tree it came from, but the branch draws its life from the root, the same root as the rest of the tree. Right. So. But it remains whatever it was. And so for St. Paul, right. Israel is now constituted post second Pentecost of the remnant of Judah. The remnant of Judah with people from the nations grafted in, who nonetheless remain members of those nations. So they remain Greeks, they remain Syrians, Egyptians. Right. Whatever else they were. Right. But they are now part of Israel, and the people of those nations are essentially, for St. Paul, replacing those tribes who are gone. And he's going to say that more or less explicitly at the end of what we're going to read in this half, even though a lot of people miss it when they read it because they don't know their Old Testament well enough."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6271.37,"end":6272.57,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense, William?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6273.61,"end":6287.22,"speaker":"William","text":"I think so. So if I'm following, that means that for Saints Paul, the Torah is a component of being a member of Joseph or Judah, but not being a member of Israel. Is that true?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6289.22,"end":6294.82,"speaker":"Fr Stephen De Young","text":"Yes. In the sense that there are people who have been grafted into Israel who. Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6294.82,"end":6295.06,"speaker":"Announcer","text":"Who."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6295.06,"end":6296.98,"speaker":"Fr Stephen De Young","text":"The Torah is not directed to them. Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6298.1,"end":6299.86,"speaker":"William","text":"Okay, that makes sense. Thank you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6300.18,"end":6308.1,"speaker":"Fr Andrew Stephen Damick","text":"All right, thanks very much. We're going to take one more call, and then we're going to move on as we roll through parts of Romans. So, Candice, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6308.98,"end":6310.18,"speaker":"Candice","text":"Hey, how are you guys?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6310.58,"end":6311.46,"speaker":"Fr Andrew Stephen Damick","text":"Good. How are you?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6312.34,"end":6360.8,"speaker":"Candice","text":"I'm doing good. Longtime listener. I really mean this when I say it. Y' all changed my life. I'm coming from a Reformed Presbyterian worldview, and I'm no longer in that world, but. Yes. But to explain, I still have a really hard time understanding Romans 9. So my question is, that's where we're going next. Yes. I understand the concept of, like, a. A more broad view of election that is not actually individualistic, but Esau and Jacob are. And Pharaoh, in that passage, are literal individuals. So how do we understand election in that passage where it's actually speaking of individuals?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6361.51,"end":6364.31,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Should we just say just keep listening? I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6366.07,"end":6371.55,"speaker":"Fr Stephen De Young","text":"Well, I'll give you. I'll give you a general thing, and then we're going to get into the nitty gritty of it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6371.55,"end":6371.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6373.03,"end":6398.88,"speaker":"Fr Stephen De Young","text":"As we go through it. So the general. The general thing is. The General thing is St. Paul here is very specifically talking about the promises to Abraham. Right. The promises made To Abraham."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6399.6,"end":6400,"speaker":"Candice","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6400.56,"end":6480.87,"speaker":"Fr Stephen De Young","text":"And there's two parts to those promises. One of those parts is salvation, right? It is theosis. It is becoming like the stars of heaven. Right. But then the other piece, the land, and them being given the land at the end of Joshua. Right? As Joshua says, they were given all the land they were promised at the end of Joshua. Sorry, dispensationalists. See, we're equal opportunity. That land was the symbol then of the bigger promise. And so what St. Paul is going to do in the case of Jacob and Esau is he's going back to Jacob and Esau, and he is going to talk about their relationship with those land promises, and he's going to use the relationship of Jacob and Esau's receiving the land promises to talk about then the receiving of the bigger promises. So St. Paul is in no way saying that Esau went to hell."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6483.03,"end":6484.31,"speaker":"Candice","text":"So he didn't really hate him."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6485.43,"end":6492.15,"speaker":"Fr Stephen De Young","text":"Well, we're going to talk about what that means. Yeah, right. We're going to talk about what that means. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6492.23,"end":6492.59,"speaker":"Candice","text":"Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6492.59,"end":6493.35,"speaker":"Fr Andrew Stephen Damick","text":"But we'll get there."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6493.51,"end":6576.47,"speaker":"Fr Stephen De Young","text":"But, but key to this, key to this, key to everything we're going to do as we're going through these texts is that St. Paul is a person who had literally memorized the Torah in Hebrew, who was intimately acquainted with it, and he's writing to and arguing with and discussing with other people who are deeply, intimately acquainted with the Torah. So when he refers to Esau, these are people who know the whole story of Esau, right? From Genesis in all its detail. Right. And most, I dare say most readers of Romans today are not as intimately acquainted. Right? If you just read Genesis, there's nothing in there that would imply to you that Esau was a bad person, that he didn't worship God. In fact, he looks much more pious, forgiving and loving than his brother. Right? So if St. Paul is all of a sudden coming out of the blue with, oh, by the way, this guy went to hell, right? That's not a very good argument."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6577.99,"end":6578.39,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6578.87,"end":6626.35,"speaker":"Fr Stephen De Young","text":"Like if I was trying to prove election to you, right? And I said, well, listen, right? I'll. I'll show you, right? I'll prove to you that election is real. Right? Like, look at, look at. I don't want to choose to. Too many controversial examples just came into my brain all at once. But anyway, they said, okay, look at Richard Nixon. He died, went to heaven, he was elect, God loved him. James Earl Jones died and went straight to hell because God hated him. Now, if I make that argument to you, what's going to be your response to me."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6627.21,"end":6627.93,"speaker":"Fr Andrew Stephen Damick","text":"How do you know?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6628.97,"end":6631.13,"speaker":"Fr Stephen De Young","text":"How do you know? Right. Like, wait, what?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6634.97,"end":6637.29,"speaker":"Candice","text":"Right, yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6638.17,"end":6645.77,"speaker":"Fr Stephen De Young","text":"And so there's nothing in Genesis that says anything about Jacob going to heaven and Esau going to hell, right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6646.73,"end":6647.21,"speaker":"Candice","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6647.45,"end":6655.22,"speaker":"Fr Stephen De Young","text":"There's nothing in there. The two reconcile at the end. And it's Esau who motivates the reconciliation."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6655.54,"end":6657.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's kind of the bigger person."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6657.86,"end":6678.66,"speaker":"Fr Stephen De Young","text":"He's the good guy in the story. Right. So if St. Paul is just coming in randomly saying, like, oh, yeah, that's not a good argument for that position. If that's really his position. Right. So you get the Calvinist reading of this requires a sort of circular argument."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6681.05,"end":6681.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6681.37,"end":6704.05,"speaker":"Fr Stephen De Young","text":"Where you say, well, wait a minute. Right. St. Paul points out to show election, that Jacob was elect and Esau was reprobate. And I say, well, how do you know Jacob was elected, Esau was reprobate? They say, well, St. Paul says in Romans 9 that Jacob was elected, Esau was reprobate. I'm like, well, that's just a circle."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6704.05,"end":6704.33,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6704.33,"end":6717.29,"speaker":"Fr Stephen De Young","text":"You're just, you're saying he's saying that because he says that. Right? Like, that's not. Yeah, that's not an interpretation. But we're going to go through now and we'll do. Hopefully show you a better way to read that that makes more sense."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6717.93,"end":6718.81,"speaker":"Candice","text":"Okay, awesome."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6718.89,"end":6720.09,"speaker":"Fr Stephen De Young","text":"In the context and everything."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6720.17,"end":6721.01,"speaker":"Fr Andrew Stephen Damick","text":"Stay tuned."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6721.01,"end":6723.05,"speaker":"Candice","text":"All right, awesome. All right, thank you, guys."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6723.21,"end":6724.41,"speaker":"Fr Andrew Stephen Damick","text":"Thanks for calling. Candace."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6724.73,"end":6730.17,"speaker":"Fr Stephen De Young","text":"Although I do have my suspicions about James Earl Jones for reasons that you know and won't be clear to the audience."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6730.25,"end":6744.15,"speaker":"Fr Andrew Stephen Damick","text":"I know it's a great story if you ever tell it to the world. I was shocked. I was like, justified. Blood feud. Justified. Okay, Romans 9."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6744.39,"end":6766.26,"speaker":"Fr Stephen De Young","text":"St. Paul now is entering. He's answering this objection. You've just argued to us that the promises of God don't fail. But when we read the Hebrew Bible and the Old Testament, it sure looks like most of the descendants of Abraham, most of the Israelites, didn't end up receiving those promises. What's up with that?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6766.5,"end":6811.02,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right, right. Okay. So. All right. Romans, chapter nine, starting with verse one, I am speaking the truth in Christ. I am not lying. My conscience bears me witness in the Holy Spirit that I have great sorrow and unceasing anguish in my heart. For I could wish that I myself were accursed and cut off from Christ for the sake of my brothers, my kinsmen. According to the flesh, they are Israelites, and to them belong the adoption, the glory, the covenants, the giving of the law, the worship and the promises. To them belong the patriarchs, and from their race, according to the flesh is the Christ who is God overall blessed forever. Amen. Okay, I was gonna say. Wait a second. I thought the idea that Christ is God was invented in the 4th century."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6811.58,"end":6820.76,"speaker":"Fr Stephen De Young","text":"Yes, clearly. Well, he's God, relatively, you see. Oh, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6820.92,"end":6821.64,"speaker":"Fr Andrew Stephen Damick","text":"Overall."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6822.36,"end":6823.88,"speaker":"Fr Stephen De Young","text":"Overall, you know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6826.12,"end":6826.56,"speaker":"Fr Andrew Stephen Damick","text":"Anyway."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6826.56,"end":6828.4,"speaker":"Fr Stephen De Young","text":"Sorry, sorry, that's not what this episode is about."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6828.4,"end":6830.2,"speaker":"Fr Andrew Stephen Damick","text":"I just had to point that out for everybody."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6830.52,"end":6831,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6831.8,"end":6833.16,"speaker":"Fr Andrew Stephen Damick","text":"Paul certainly thinks he's God."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6833.8,"end":6844.29,"speaker":"Fr Stephen De Young","text":"Right. So St. Paul begins his argument by saying, you know. Yeah, that's a good point. Right. And as a Jewish person, he finds that deeply upsetting."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6844.37,"end":6844.77,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6844.85,"end":6903.65,"speaker":"Fr Stephen De Young","text":"And he has this great display of love that he would be willing to be accursed and cut off from Christ. Right. He would be willing. He's saying he'd be willing to be damned. Right. In order for his. The rest of the Jewish people to find salvation. Yeah, right. And in saying that, he's kind of deliberately paralleling Moses. At the end of Exodus, when God is. Is ready to wipe out the Israelites and start over with Moses, he's like, we'll just do the Abraham thing, but we'll just start again with you, because I'm done with these people. And Moses not only intercedes for them, but he asks God to blot him out of the book of life instead of the Israelites. Right. This sort of monumental display of love by Moses. I mean, these are the people who have been persecuting Moses, too, and threatening to kill him."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6903.65,"end":6904.01,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6905.05,"end":6922.49,"speaker":"Fr Stephen De Young","text":"And he's. He's. He's willing to do that for them. I will note for all you fans of penal substitutionary atonement out there, that God then explains to Moses that that's not how he works, that he does not punish the innocent for the sins of the guilty. He would not."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6922.49,"end":6929.57,"speaker":"Fr Andrew Stephen Damick","text":"But anyway, wow, sorry, psa. You're just, like, kicking the Reformation right in the gut tonight."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6929.57,"end":6930.05,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6932.53,"end":6932.93,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6932.93,"end":6948.14,"speaker":"Fr Stephen De Young","text":"Like God literally says, it doesn't work that way. I will not do that. Anyway, he didn't mean. He didn't say, later, I'll do that. He didn't say, okay, Moses, but you're not the right guy. He said, I don't do that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6948.14,"end":6950.86,"speaker":"Fr Andrew Stephen Damick","text":"Okay, man. Getting right in the soteriology."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6954.38,"end":6969.82,"speaker":"Fr Stephen De Young","text":"But. So St. Paul reflects that same kind of love here. Yeah, Right. And he says. He points out. Right. As he said earlier back in. In beginning of chapter three, he says, the calling of God is irrevoc. Irrevocable."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6970.94,"end":6971.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6971.66,"end":6979.08,"speaker":"Fr Stephen De Young","text":"Right. So the Jewish people, for St. Paul, are still called upon to be a Light to the nations. They're still called upon."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6979.16,"end":6979.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6979.72,"end":6996.6,"speaker":"Fr Stephen De Young","text":"For St. Paul, though, that involves them accepting Jesus as the Messiah. Right? That's part and parcel of how they will fulfill that calling. Right. And he says, you're right. They were. They're given all these things. Right? All those things that he lists."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6999.09,"end":6999.33,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":6999.41,"end":7031.52,"speaker":"Fr Stephen De Young","text":"All of it. They have all of this. Right. And those of you who are Gentiles who now have it have received it from them. Right. The way you worship the Messiah is from the Jews. Right? On and on and on. This is all from them that you've received. And so, yes, it is. This horrible thing. Right? This horrible thing that so many of them have not received and are in danger now of not receiving those promises. Yeah. Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7032.24,"end":7050,"speaker":"Fr Andrew Stephen Damick","text":"All right. Verse 6. Yeah. But it is not as though the word of God has failed. For not all who are descended from Israel belong to Israel, and not all are children of Abraham because they're his offspring. But through Isaac shall your offspring be named."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7050.57,"end":7051.37,"speaker":"Fr Stephen De Young","text":"Let's pause there."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7051.77,"end":7052.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7052.81,"end":7055.17,"speaker":"Fr Stephen De Young","text":"Okay, well, no, go do one more verse. Do one more."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7055.17,"end":7063.77,"speaker":"Fr Andrew Stephen Damick","text":"Okay. This means that it is not the children of the flesh who are the children of God, but the children of the promise are counted as offspring."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7064.41,"end":7071.81,"speaker":"Fr Stephen De Young","text":"Right? Okay, so what's the point here? Abraham had lots of sons. Not just Isaac and Ishmael either."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7071.81,"end":7079.22,"speaker":"Fr Andrew Stephen Damick","text":"He had. That's how the song goes, right? Father Abraham, you sing that when you're in Sunday school back in the day."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7080.18,"end":7089.26,"speaker":"Fr Stephen De Young","text":"I think at some point I know I'm one of them. So are you. Yeah. No, that's not what this is referring to at all. This is referring to literal. He had literal sons."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7089.26,"end":7090.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes, lots of sons."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7090.58,"end":7102.5,"speaker":"Fr Stephen De Young","text":"St. Paul is starting with the literal, right? He starts with the literal meaning of what's in the Torah. Right. And then he's going to go from that, but he says, look, literally, what's in there is he's got all these sons."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7102.85,"end":7103.09,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7103.73,"end":7138.78,"speaker":"Fr Stephen De Young","text":"But they aren't all recipients of the promise in the same way. Right? The line of promise, the line that's going to lead to the Messiah that goes through Isaac. Right, Right. So he's making an argument. This argument is kind of the same argument he makes in Galatians when he talks about how in those promises, the references to Abraham's seed. Because seed, zara, in Hebrew is a collective noun. Yeah, but it could be singular or plural, depending on context."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7139.02,"end":7143.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And in Greek, it's explicit whether it's singular or plural. Either sperma or spermata."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7144.22,"end":7158.2,"speaker":"Fr Stephen De Young","text":"Right. But in Hebrew it could be either like fish or deer. In English, Right, moose. And so St. Paul is saying, there are senses in which it is plural, and there's another sense in which it is singular."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7159.31,"end":7159.47,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7159.47,"end":7186.43,"speaker":"Fr Stephen De Young","text":"And so he's making that same kind of argument here. There's this sense in which it is singular. It's going through Isaac, right? So he's beginning to construct an argument of, well, hey, you know, the way you observe this thing working now with the promises of God is kind of the way it's always worked. It's kind of the way it's always worked. Continuing with verse nine."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7186.67,"end":7216.46,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Verse nine. For this is what the promise said. About this time next year, I will return and Sarah shall have a son. And not only so, but also, when Rebekah had conceived children by one man, our forefather Isaac, though they were not yet born and had done nothing either good or bad, in order that God's purpose of election might continue, not because of works, but because of him who calls. She was told, the older will serve the younger. As it is written, Jacob I loved, but Esau I hated."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7218.7,"end":7219.9,"speaker":"Fr Stephen De Young","text":"Yes. Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7222.06,"end":7222.46,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7225.42,"end":7234.94,"speaker":"Fr Stephen De Young","text":"Abraham has a bunch of sons, but the promises are reckoned through. Isaac. Okay, okay. Isaac and Rebecca then have two sons. You've got Jacob and Esau."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7235.43,"end":7235.67,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7236.47,"end":7251.83,"speaker":"Fr Stephen De Young","text":"And before they're born, right, before they've done anything, God says, the older will serve the younger. Okay. Esau will serve Jacob."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7252.47,"end":7252.87,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7254.15,"end":7256.39,"speaker":"Fr Stephen De Young","text":"Edom will serve Jacob. Edom will serve Israel."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7256.63,"end":7257.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7259.19,"end":7394.02,"speaker":"Fr Stephen De Young","text":"So if you read, then the rest of the Torah, you see that this is what happens. Torah, then the rest of the Hebrew Bible, this is literally what happens. We are told in Deuteronomy chapter 2, that God brought Esau's descendants to the land of Edom, which is part of the land which was promised to Abraham, Esau's grandfather. That God brought them into that land and gave it to them and drove out a bunch of giant clans before them. The same way he was going to do with Israel in the Book of Joshua. Yeah, he did it with Edom first. Okay. And because of that, Israel was not to take a single foot of land. It literally says a foot. It says the length of a foot in the text. Israel was not to take a foot of land from the Edomites, their cousins. Right? Because that land, that piece of Abraham's inheritance, had been given to the Edomites. But then once Israel comes into the land, what happens? Edom became a vassal country throughout most of the Old Testament history. A vassal country to Israel, later to Judah, meaning literally, the older served the younger. And as long as that vassal Relationship, that covenant relationship between the nation of Judah and the nation of Edom pertained. Edom kept that land. They received their share in the promises of God as long as they maintained that relationship with Israel, with Judah, who was the firstborn son. Right. Remember the Torah. It's the firstborn son who inherits everything and then distributes the inheritance with his brothers."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7394.8,"end":7395.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7395.92,"end":7415.28,"speaker":"Fr Stephen De Young","text":"Remember, Jacob got the birthright, the firstborn status, over Esau. Okay. But then what happens later? Well, we get this second quotation. Jacob, I have loved Esau, I have hated. That quote. Right. Is from the time of the exile."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7416.08,"end":7418.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It says as it is written. Written where?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7419.52,"end":7445.63,"speaker":"Fr Stephen De Young","text":"Right. That is a quote from the time of the exile. It is not a quote from before Jacob and Esau were born. Genesis does not say that God loved Jacob and hated Esau. This is said at the time of the exile because Edom had turned on and betrayed and attacked Judah while Judah was going into exile."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7445.95,"end":7455.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So these are about nations now, or tribes or however you want to conceive of it, people groups. Jacob and Esau as individuals are long, long dead."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7455.63,"end":7469.23,"speaker":"Fr Stephen De Young","text":"Right. Because of that betrayal, because they didn't keep faith, because of their faithlessness toward their brother Judah, the Edomites lost that land. They lost their share in the promises."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7473.24,"end":7473.48,"speaker":"Candice","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7475.48,"end":7573.25,"speaker":"Fr Stephen De Young","text":"Knowing where this argument is going, knowing the argument that St. Paul makes the same argument in Galatians, where is he going, the ultimate firstborn, who he calls the firstborn of all creation in Colossians, who inherits everything, who inherits all the promises of Abraham according to Galatians, as Abraham's seed is Christ. Yeah. So if anyone, if anyone, if any descendant of Abraham wants to receive a share of the promises from the firstborn, what do they have to do? They have to remain faithful to their covenant relationship with the firstborn, with the Messiah, with Christ. Right. So the Edomites are no different for St. Paul than a faithless Jewish person. It's faithfulness to the firstborn that gives you a share. Remember, firstborn among many brothers with whom he would share the inheritance. But you have to remain in fellowship with him. Also, I would point out, I say this only because I have seen prominent Calvinists bang up and down on this. Jacob, I have loved. Esau, I have hated. And they specifically bang up and down on the hated part."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7576.14,"end":7576.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7577.42,"end":7614.15,"speaker":"Fr Stephen De Young","text":"It says hated. And hated doesn't mean loved less. Right. The word hated there. The word, the verb mise. In Greek, it means hated. Right. So it's saying God hated Esau. It doesn't mean loved less. It Only means hate if you're one of those Calvinists. Allow me to direct you to Luke 14:26 where Christ uses the same word, the same verb when he says, if anyone comes to me and does not hate his father and mother."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7615.35,"end":7615.75,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7617.43,"end":7618.79,"speaker":"Fr Stephen De Young","text":"He is not worthy of me."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7619.27,"end":7623.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, like you have to have rage against your mom and dad."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7623.27,"end":7628.56,"speaker":"Fr Stephen De Young","text":"Yes. That only means hate. Yeah, our Lord wants us to hate our parents."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7631.2,"end":7632.96,"speaker":"Fr Andrew Stephen Damick","text":"No, it's like turn away from or."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7634.8,"end":7638.72,"speaker":"Fr Stephen De Young","text":"Yeah, well, and it could just mean love less."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7639.36,"end":7641.04,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7641.04,"end":7642.96,"speaker":"Fr Stephen De Young","text":"Which is clearly what Christ means by it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7643.12,"end":7643.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7643.68,"end":7646.44,"speaker":"Fr Stephen De Young","text":"You know you need to love your father and your mother. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7646.44,"end":7648.76,"speaker":"Fr Andrew Stephen Damick","text":"Honor your father and your mother, but hate your father and mother."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7648.76,"end":7651.68,"speaker":"Fr Stephen De Young","text":"But you can't love your father and your mother more than Christ."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7652.36,"end":7654.12,"speaker":"Fr Andrew Stephen Damick","text":"Right? That's exact. Yeah, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7658.2,"end":7677.64,"speaker":"Fr Stephen De Young","text":"So anyway, that's just a side note. If you're a Calvinist, even if you don't agree with me, even if you come out of hearing all this and you're still a die hard Calvinist, stop making that dumb argument. That's about the verb to hate. Okay? Because there are other people who will pull out that verse from Luke on you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7677.99,"end":7678.19,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7678.19,"end":7682.47,"speaker":"Fr Stephen De Young","text":"If it hasn't happened already. All right, verse 14."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7683.03,"end":7712.24,"speaker":"Fr Andrew Stephen Damick","text":"All right, verse 14. What shall we say then? Is there injustice on God's part? By no means. For he says to Moses, I will have mercy on whom I have mercy and I will have compassion on whom I have compassion. So then it depends not on human will or exertion, but on God who has mercy. For the scripture says to Pharaoh, for this very purpose I have raised you up that I might show my power in you and that my name might be proclaimed in all the earth. So then he has mercy on whomever he wills. And he hardens whomever he wills."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7713.12,"end":7751.37,"speaker":"Fr Stephen De Young","text":"Okay, so again, Pharaoh, not a good guy, right? Very bad guy. We still aren't technically told in Exodus. I mean he very clearly is a stand in for the devil, but we're not actually told he goes to hell. Yeah, right. His sort of eternal salvation is not in view. Right. But notice what the scripture St. Paul quotes says about Pharaoh. For this very purpose I have raised you up."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7756.17,"end":7756.53,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7756.53,"end":7766.56,"speaker":"Fr Stephen De Young","text":"So that he could show his power in him and that his name would be proclaimed in all the earth. Okay? That's God saying, I have this purpose for you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7768.4,"end":7768.8,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7769.12,"end":7773.44,"speaker":"Fr Stephen De Young","text":"I have this purpose for you. This is why I made you the Pharaoh."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7774.96,"end":7775.32,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7775.32,"end":7789.75,"speaker":"Fr Stephen De Young","text":"This is why I made you the Pharaoh. The absolute ruler of the most powerful nation on earth, Sir, I put you there so that my name would be proclaimed to all the nations, Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7791.99,"end":7792.39,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7797.27,"end":7799.19,"speaker":"Fr Stephen De Young","text":"This goal is accomplished."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7800.15,"end":7800.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7800.87,"end":7837.97,"speaker":"Fr Stephen De Young","text":"Because again and again, if you read Exodus closely, what you see God saying again and again with the plagues, and when we're talking about hardening Pharaoh, it's hardening Pharaoh so that the plagues can continue. There's actually only one instance where God hardens Pharaoh's heart. The other time Pharaoh does it. But all the other times Pharaoh does it. But the one time God does it, it's so that this cycle of the plagues can be completed. And all through the plagues, it says over and over again that God is doing these plagues to reveal who he is to Israel. To reveal who he is to the Egyptians."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7838.21,"end":7838.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7838.65,"end":7840.45,"speaker":"Fr Stephen De Young","text":"So they'll turn from their idolatry."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7841.13,"end":7842.49,"speaker":"Fr Andrew Stephen Damick","text":"Then they will know that I am Yahweh."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7842.49,"end":7851.77,"speaker":"Fr Stephen De Young","text":"He says, yeah, to reveal who he is to Pharaoh and to reveal himself by what he's doing in Egypt to all the other nations of the world who will hear about it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7854.41,"end":7858.17,"speaker":"Fr Andrew Stephen Damick","text":"Which is pretty merciful and compassionate to everybody involved."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7859.21,"end":7905.32,"speaker":"Fr Stephen De Young","text":"God doesn't say he's judging Pharaoh and condemning Pharaoh. He doesn't say he's judging and condemning the Egyptian people. God says he is judging and condemning on the night of Passover, the gods of Egypt, the spirits, the demons who have controlled them. St. Paul has read this very closely right now. Pharaoh, what happens? What does Pharaoh's purpose end up being? It ends up being this object lesson for the whole world. It ends up being this cautionary tale for the whole world of what happens when someone thinks they're a God and tries to stand up to the true God."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7906.12,"end":7906.52,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7907.56,"end":7959.46,"speaker":"Fr Stephen De Young","text":"Even if he's the absolute ruler of the most powerful nation on earth, this is. This is what happens. He becomes this cautionary tale. Right. What happened to Israel? Again, St. Paul has read the prophets really carefully. What do the prophets keep telling Israel as we're approaching the destruction of the northern kingdom and the exile of the southern kingdom of Judah? God keeps saying to them, through the prophets, I created you and called you to this purpose of being a light to the nations, that through you, I would reveal myself to the nations. My holiness, my purity. You haven't wanted to do that. So what does he say? I'm going to make you an example to the nations of what happens."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7960.1,"end":7960.5,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7961.62,"end":7970.18,"speaker":"Fr Stephen De Young","text":"When someone is faithless to the calling I've given them, I'm going to make them an object lesson. I'm going to make them a cautionary tale."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7970.5,"end":7972.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it just works the same way."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7973.15,"end":7993.71,"speaker":"Fr Stephen De Young","text":"So St. Paul is using Pharaoh here, Right. Because keep in mind, right? Who's he arguing with? Right. He's arguing with people who are going to say, well, St. Paul, you can't be right about Jesus being the Messiah because the rest of the Jews would have all accepted him if he was the Messiah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7995.55,"end":7995.95,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":7998.52,"end":8069.28,"speaker":"Fr Stephen De Young","text":"If God keeps his promises, why hasn't he kept his promises to everybody sending from Abraham? If St. Paul comes and just starts attacking Israel at Israelites and his fellow Jews, that's not going to go anywhere in terms of argumentation. So what does he do? So he says things about Edom, Right? Because any of them who have read the Old Testament, they know about what happened with Edom, right? They go, yeah, yeah, that Edom that happened. Yeah. But he's saying Israel or Judea, right? Has become like Edom. He doesn't start talking about Israel. He talks about Pharaoh. Because they're going to read Exodus. They're like, yeah, Pharaoh. Pharaoh was used by God as this object lesson, the nation, this cautionary tale. St. Paul's going to say, yeah, and now Judea and the destroyed Northern kingdom have, like Pharaoh, they've become this cautionary tale. Right. In the purposes of God, because they refused. Right. And in both cases, it's faithlessness that brought this about."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8070.64,"end":8071.04,"speaker":"William","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8073.92,"end":8074.8,"speaker":"Fr Stephen De Young","text":"So verse 19."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8075.52,"end":8116.92,"speaker":"Fr Andrew Stephen Damick","text":"All right, continuing on through chapter nine of Romans, you'll say to me, then why does he still find fault? For who can resist his will? But who are you, O man, to answer back to God will what is molded say to its molder? Why have you made me like this? Has the potter no right over the clay to make out of the same lump one vessel for honorable use and another for dishonorable use? What if God, desiring to show his wrath and to make known his power, has endured with much patience vessels of wrath prepared for destruction in order to make known the riches of his glory? For vessels of mercy which he has prepared beforehand for glory. Even us, whom he has called not from the Jews only, but also from the Gentiles."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8117.24,"end":8118.72,"speaker":"Fr Stephen De Young","text":"Okay, go ahead and stop there before we get."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8118.72,"end":8119.08,"speaker":"Fr Andrew Stephen Damick","text":"Ok."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8121.32,"end":8129.64,"speaker":"Fr Stephen De Young","text":"So we've got the. The lumps for the two different. The two different kinds of vessels. Yeah, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8129.64,"end":8132.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, people read this and they say, see, this is God making."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8133.12,"end":8133.44,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8133.52,"end":8138.48,"speaker":"Fr Andrew Stephen Damick","text":"You know, there are bad vessels and good vessels, and that's just the way that it is. And you're just clay. Who are you?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8139.44,"end":8176.76,"speaker":"Fr Stephen De Young","text":"So if you go to Jeremiah, if you're familiar with the prophets again, you got to be really familiar with the Old Testament to understand what St. Paul's doing. You go back and Read the Old Testament prophets, especially Jeremiah uses this analogy of the potter and the potter's vessels. Let's talk about nations, not talking about individuals. Number one. Okay. Number two, this. That's translated there as a vessel for dishonorable use. This is a direct reference St. Paul is making to God, saying. It's usually translated English. Moab is my wash pot. It literally means Moab is my toilet."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8180.92,"end":8181.48,"speaker":"Fr Andrew Stephen Damick","text":"Moab."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8182.28,"end":8186.57,"speaker":"Fr Stephen De Young","text":"Right. So he created Israel for one purpose. He created Moab for a different purpose."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8187.69,"end":8188.25,"speaker":"Fr Andrew Stephen Damick","text":"Dang."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8190.89,"end":8219.59,"speaker":"Fr Stephen De Young","text":"Right. But again, what is St. Paul arguing about? Okay, what is St. Paul talking about? St. Paul is talking about all those generations, all those thousands and thousands of people descended from Abraham, who's. Who's ancestors were part of the exodus from Egypt, who came and settled in the land. All those people from those northern tribes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8220.95,"end":8221.35,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8222.71,"end":8232.71,"speaker":"Fr Stephen De Young","text":"Who were there for centuries. God brought them into the land, gave them all these blessings, gave them all these things. And in the end, what happened to them? They're gone. They're wiped out."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8233.27,"end":8234.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Carried off."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8235.03,"end":8236.07,"speaker":"Fr Stephen De Young","text":"They're wiped out."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8237.68,"end":8237.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8240.16,"end":8258.16,"speaker":"Fr Stephen De Young","text":"And what was the point of that? Did God not know? Did God not? Right. And St. Paul is saying, well, what if. What if God knew full well what those people were like?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8258.72,"end":8259.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8260.64,"end":8318.63,"speaker":"Fr Stephen De Young","text":"Knew that they were going to end up suffering his wrath. Right. Knew that full well. But he decided to also bring them out of Egypt to also give them land, to also send rain and give them crops and do all these good things for them, knowing full well that they would continue to be faithless. And eventually he would cut them off and they would serve as this object lesson to the rest of the world of the cost of faithlessness. That's the argument St. Paul's making. Would that make God a bad person? Quite the opposite. Right. God is giving all these blessings to people who don't deserve it at all. He's being patient with them when they don't deserve it at all. But then, because he finally comes to the end of his patience. Oh, now all of a sudden you're going to accuse him of injustice."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8321.75,"end":8324.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. What was coming to them?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8325.19,"end":8325.59,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8325.91,"end":8327.35,"speaker":"Fr Andrew Stephen Damick","text":"God waited a long time."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8329.27,"end":8356.06,"speaker":"Fr Stephen De Young","text":"Again, he's speaking collectively because we know St. Paul's going to quote it here coming up. We know that in the time of Elijah, there were thousands of people who had not bowed the knee to BAAL in the Northern Kingdom. It's not. Every individual in the Northern Kingdom is a reprobate. It's saying nothing about individuals in the Northern Kingdom. Prophet Elijah was from the Northern Kingdom."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8357.66,"end":8358.06,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8359.02,"end":8378.43,"speaker":"Fr Stephen De Young","text":"But it's talking about the kingdom As a whole, those people groups, those tribes, Right. You're coming and saying, oh, God didn't keep his promises to them. And St. Paul's saying, oh, yeah, he did. He went above and beyond with them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8378.99,"end":8379.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8380.03,"end":8395.39,"speaker":"Fr Stephen De Young","text":"Before he ultimately used them for the use that he put them to. But until then, he gave them all kinds of undeserved kindness. Right. That's the argument St. Paul's making. Okay, now we get back to the Hosea."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8395.39,"end":8464.43,"speaker":"Fr Andrew Stephen Damick","text":"All right, rolling on verse 25. As indeed he says in Hosea, those who are not my people, I will call my people, and her who is not beloved, I will call beloved. And in the very place where it was said to them, you are not my people, there they will be called sons of the living God. And Isaiah cries out concerning Israel, though the number of the sons of Israel be as the sand of the sea, only a remnant of them will be saved, for the Lord will carry out his sentence upon the earth fully and without delay. And as Isaiah predicted, if the Lord of hosts had not left us offspring, we would have been like Sodom and become like Gomorrah. What shall we say then? The Gentiles who did not pursue righteousness have attained it. That is a righteousness, that is by faith. But that Israel who pursued a law that would lead to righteousness did not succeed in reaching that law. Why? Because they did not pursue it by faith, but as if it were based on works. They have stumbled over the stumbling stone as it is written, Behold, I am laying in Zion a stone of stumbling and a rock of offense, and whoever believes in him will not be put to shame."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8466.83,"end":8478.55,"speaker":"Fr Stephen De Young","text":"Right. So most of that, I think, is kind of self explanatory until we get to the end. Right. Because then we get this, oh, faith versus works thing."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8478.95,"end":8480.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, faithfulness."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8482.55,"end":8482.95,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8483.35,"end":8483.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8487.11,"end":8503.6,"speaker":"Fr Stephen De Young","text":"So first of all, notice St. Paul does not here contest that the law, the Torah, leads to righteousness. Yeah, he's acknowledging that it does."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8504.32,"end":8504.72,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8506.56,"end":8517.44,"speaker":"Fr Stephen De Young","text":"But he's saying, so then why did. We've got Gentiles, we've got people who. We've got non Jewish people, people from the nations who are receiving these promises."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8518.64,"end":8519.04,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8519.84,"end":8531.19,"speaker":"Fr Stephen De Young","text":"And we've got these Jewish people who had the Torah that leads to righteousness. Right. Who haven't received those promises. How does that work?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8532.15,"end":8532.55,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8533.43,"end":8555.76,"speaker":"Fr Stephen De Young","text":"And this is where he makes this contrast between pursuing it by faithfulness or pursuing it by works, specifically works of the Torah. We'll get into that in a second. But the key is, right, he says they have stumbled over the stumbling block. Right. And then he has the quote, right? Who is the stumbling block?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8556.4,"end":8556.96,"speaker":"Fr Andrew Stephen Damick","text":"It's Christ."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8557.04,"end":8558.4,"speaker":"Fr Stephen De Young","text":"Christ, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8558.72,"end":8559.12,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8559.52,"end":8633.83,"speaker":"Fr Stephen De Young","text":"So the faithfulness he's talking about is faithfulness to the Messiah, right? So the core of what he's saying here is they've rejected the Messiah, right? They rejected the Messiah. And since they've rejected the Messiah and he's the firstborn, then Jacob and Esau think Isaac and his brothers, right? They've cut themselves off from receiving their share of the promises because he's the inheritor of the promises. Right? But what is what they have done in rejecting the Messiah? Right. Rather than receiving and being faithful to the Messiah and his commandments, they have sought it through the works of the Torah. Don't have super time to go into this right now. You can read Matthew, Thomas's published dissertation, Paul and the works of the Law. But the way everyone in the first three centuries of the church, literally everyone reads, thinks St. Paul means by works of the Torah, works of the Law, is Jewish. The commandments that were specifically given to."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8633.83,"end":8637.51,"speaker":"Fr Andrew Stephen Damick","text":"The Jewish people, like circumcision and kosher."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8638.07,"end":8646.55,"speaker":"Fr Stephen De Young","text":"Where did we start in chapter nine? We started in chapter nine with not everyone who's descended from Abraham is really descended from Abraham."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8649.11,"end":8649.51,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8650.31,"end":8701.87,"speaker":"Fr Stephen De Young","text":"He's referring back to arguments he made back in chapters three, four, and five about Abraham and his faithfulness. But not everyone descended from. Descended from Abraham. Right? But Isaac, right? And so everyone else needs to be faithful to Isaac. So the particular works he's talking about, the particular commandment keepings he's talking about is, well, I'm circumcised, I eat the Passover, I do these things. That makes me a child of Abraham. That means I receive a share of the promises, right? By myself, apart from the Messiah, Right. I am a separate inheritor. St. Paul says it doesn't work that way."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8702.35,"end":8702.75,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8703.23,"end":8716.44,"speaker":"Fr Stephen De Young","text":"Esau? It didn't work that way for Esau. Esau couldn't just claim a share of the promises apart from Jacob, because Jacob's the firstborn. He inherits everything. Esau was circumcised."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8721.56,"end":8721.96,"speaker":"Candice","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8722.04,"end":8747.69,"speaker":"Fr Stephen De Young","text":"Esau was circumcised. That didn't get him a share. He had to be in this relationship of faithfulness with his brother who was the firstborn, right? Same thing with them. That's the point he's making. He's come back around to his original point. You have to be in this relationship of faithfulness with the Messiah. Okay, so now a piece of chapter 10. We're not doing all of chapter 10."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8747.69,"end":8748.05,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8748.05,"end":8754.53,"speaker":"Fr Stephen De Young","text":"There's a bunch of things in there about the Gentile. We've talked about them in other episodes, but yeah, this part that sort of pertains to this."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8754.93,"end":8819.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Okay, so chapter 10, starting with verse 5. For Moses writes about the righteousness that is based on the law, that the person who does the commandments shall live by them. But the righteousness based on faith. Let me say faithfulness. The righteousness based on faithfulness says. I'm reading from the esv. Everyone, by the way, do not say in your heart who will ascend into heaven, that is to bring Christ down, or who will descend into the abyss that is to bring Christ up from the dead. But what does it say? The word is near you, in your mouth and in your heart. That is the word of faithfulness that we proclaim. Because if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. For with the heart one believes and is justified, and with the mouth one confesses and is saved. For the scripture says everyone who believes in him will not be put to shame. For there is no distinction between Jew and Greek. For the same Lord is Lord of all, bestowing his riches on all who call on him. For everyone who calls on the name of the Lord will be saved."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8821.59,"end":8864.13,"speaker":"Fr Stephen De Young","text":"Okay, so in verses five and six, or actually five through eight, right. Our 16th century German friend Martin Luther will croak from his grave that. Oh, see, look, St. Paul is contrasting. Moses writes about this. Righteousness is based on the law, based on the Torah, that the person who does the commandments will live by them. But the righteousness based on faith says da da, da, da, da. Right? When St. Paul says in verse 6, but the righteousness based on faith or faithfulness says."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8864.29,"end":8864.69,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8865.13,"end":8890.89,"speaker":"Fr Stephen De Young","text":"And then he quotes. He's quoting Deuteronomy. He's literally quoting Moses. This is not a contrast. Okay, that. But that. But that the English translators put there is confusing you. He says Moses writes about the righteousness that is based on the law that the person who does the commandments shall live by them."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8892.29,"end":8892.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8893.33,"end":8902.53,"speaker":"Fr Stephen De Young","text":"And the righteousness based on faith says. Because he's now going to quote Moses, this is. It's both Moses."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8903.33,"end":8904.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8905.17,"end":8915.89,"speaker":"Fr Stephen De Young","text":"It's Moses and Moses. St. Paul is not contrasting Moses with Moses, I assure you. Be like Moses, not like Moses."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8917.82,"end":8919.9,"speaker":"Fr Andrew Stephen Damick","text":"That would be pretty nutty thing to do as a Pharisee."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8920.38,"end":8923.42,"speaker":"Fr Stephen De Young","text":"Yeah, that doesn't make any sense."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8923.82,"end":8924.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":8927.5,"end":9123.48,"speaker":"Fr Stephen De Young","text":"So person who does the commandments lives by them. Yes, yes, this is true. Right. And you know how I know for sure, that that's true. Because, like, four days ago now. Four or five days ago, Sunday. Is that four days ago? Is that five days ago now? Anyway, time's a flat circle. I read Christ say exactly that. Do these things and you will live about commandments from the Torah. St. Paul is not contradicting Christ. Right? And the righteousness that is based on faithfulness says, do not say in your heart who will ascend into heaven or who will descend into the abyss. The word is near you, in your mouth and in your heart. Deuteronomy. Right? And if you read that section, it could even say, these things are not too hard for you. The whole point of what's being said in Deuteronomy is that being faithful to the commandments of God is not too hard for you. It's something you could do. I know, I know. Martin Luther and generations of Protestants since him have taken this and told you it means the exact opposite of what St. Paul is saying. Literally, the opposite. They've said that he's contrasting Moses with Moses and that the second Moses he is reading to mean exactly the opposite of what it very clearly means in Deuteronomy. But that makes no sense. That is on the face, wrong. There is no rational way to argue that that's what St. Paul is doing. There's isn't. Okay. And when St. Paul adds his interpretive comments, right. Who will ascend into heaven? That is to bring Christ down. Meaning we don't need someone to go up into heaven because Christ has come down from heaven to us. We don't need someone to descend into the abyss, into the depths of the earth, because Christ did descend into the depths of the earth when he died and he rose again. The word is near you, in your mouth and on your heart. The word of faithfulness, the word of Christ, the gospel, right? We have it. And being faithful to it, being obedient to it, is not too hard for you. That's what St. Paul is saying. Right? Salvation is there. Right? And again. They've translated this again. Believe, believe, believe. It's be faithful. Yeah, it's be faithful. It's not just think something is true. Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9129.81,"end":9131.25,"speaker":"Fr Andrew Stephen Damick","text":"All right. We ready for chapter 11?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9132.93,"end":9133.81,"speaker":"Fr Stephen De Young","text":"I think so."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9134.13,"end":9177.59,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Romans 11. I asked then, has God rejected his people? By no means. For I myself am an Israelite, a descendant of Abraham, a member of the tribe of Benjamin. God has not rejected his people whom he foreknew. Do you not know what the Scripture says of Elijah? How he appeals to God against Israel? Lord, they have killed your Prophets, they have demolished your altars and I alone am left. They seek my life. But what is God's reply to him? I have kept for myself 7,000 men who have not bowed the knee to Baal. So too at the present time, there is a remnant chosen by grace. But if it is by grace, it is no longer on the basis of works. Otherwise grace would no longer be grace. Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9179.68,"end":9189.04,"speaker":"Fr Stephen De Young","text":"So what's he saying here? As I mentioned, he refers to this episode, the life of the prophet Elijah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9189.28,"end":9189.68,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9192.16,"end":9230.93,"speaker":"Fr Stephen De Young","text":"So he's saying, right now, look, it's not that all of the Jewish people have fallen away, that none of the Jewish people have accepted the Messiah. Right. St. Paul's like, I mean, I'm an example. But he goes on to say, look, just like in Elijah's day, meaning just again, just like it's always been. This is a core part of his arguments in chapter nine. It's always been this way. It was this way all through the Old Testament, all through the Hebrew Scriptures, it was this way. Right, so it shouldn't surprise you that it's this way now. Right? All through the Hebrew Scriptures, most of Israel was faithless and there was a faithful remnant."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9232.84,"end":9233.08,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9234.04,"end":9246.44,"speaker":"Fr Stephen De Young","text":"And notice that remnant, it says chosen by grace. Right? Chosen, meaning they have this quality, it's capacity. Right? They are chosen and that's by grace, by God's action."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9247.16,"end":9250.04,"speaker":"Fr Andrew Stephen Damick","text":"God's action makes them that way."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9250.52,"end":9286.54,"speaker":"Fr Stephen De Young","text":"Right. Meaning it's not on the basis of works of the Torah. Right. Meaning it's not because. Right. These, these are the Jewish people who got circumcised that the other ones didn't. Right. The dividing line. The dividing line is the Messiah. It's Jesus. It's what God has done in Christ. Right? Him being the Messiah and being faithful to him, that's the dividing line within the Jewish people and within all of the nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9287.18,"end":9288.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9290.54,"end":9291.26,"speaker":"Fr Stephen De Young","text":"Verse seven."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9291.66,"end":9340.12,"speaker":"Fr Andrew Stephen Damick","text":"Okay, what then? Israel failed to obtain what it was seeking. The elect obtained it, but the rest were hardened. As it is written, God gave them a spirit of stupor, eyes that would not see and ears that would not hear down to this very day. And David says, let their table become a snare and a trap, a stumbling block and a retribution for them. Let their eyes be darkened so that they cannot see and bend their backs forever. So I ask, did they stumble in order that they might fall? By no means. Rather, through their trespass, salvation has come to the Gentiles so as to make Israel jealous. Now, if their trespass means riches for the world, and if their failure means riches for the Gentiles and how much more will their full inclusion mean?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9340.76,"end":9386.45,"speaker":"Fr Stephen De Young","text":"Right, so, right. So he's saying Israel, Israel didn't end up receiving the promises, right? He says, well, yeah, right. Those who are elect, those who have this quality, right. Those who have been qualified, they obtained it. And the rest are hardened. Right? So the rest become what the faithless become what? They become an object lesson. Right. They still continue to serve the purposes of God, but it's a different purpose. Okay, and what is that purpose for St. Paul? Right. St. Paul makes clear that purpose is not they're reprobate and they're going to hell."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9387.17,"end":9389.77,"speaker":"Fr Andrew Stephen Damick","text":"No, it's to bring the nations in, Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9389.93,"end":9401.37,"speaker":"Fr Stephen De Young","text":"It's so that, right, the gospel goes out to the nations, and then when the nations come in, right, when."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9406.09,"end":9406.37,"speaker":"Announcer","text":"The."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9406.37,"end":9447.35,"speaker":"Fr Stephen De Young","text":"Rest of the Judeans who haven't accepted the Messiah see the nations coming in to worship the true God, giving up their idols, right? Giving up their immorality, coming to worship the true God, St. Paul says then they'll be provoked to jealousy and then they will turn and accept the Messiah. Right? So that hardening, like Pharaoh's hardening, has nothing to do with salvation. Eschatological salvation has everything to do with this purpose they're fulfilling. Yeah, right. And St. Paul sees this purpose they're fulfilling now as ultimately being part of their eventual salvation. Verse 13."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9447.83,"end":9455.19,"speaker":"Fr Andrew Stephen Damick","text":"Okay, now I am speaking to you Gentiles because, I mean, that's how Romans is working. He talks to Jews and Gentiles. Yeah, because."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9455.19,"end":9457.83,"speaker":"Fr Stephen De Young","text":"Yeah, so now he's talking to the people who are from the nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9457.83,"end":9495.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right. You know, I would just say to everybody, you know, see your lengthy commentary on the whole Book of Romans and the whole Council of God podcast as to why that's an important bit. Okay, now I'm speaking to you Gentiles inasmuch as then I, as I, as I am an apostle to the Gentiles, I magnify my ministry in order somehow to make my fellow Jews jealous and thus save some of them. For if their rejection means the reconciliation of the world, what will their acceptance mean but life from the dead? If the dough offered as fruits for first fruits is holy, so is the whole lump. And if the root is holy, so are the branches, right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9495.13,"end":9519.79,"speaker":"Fr Stephen De Young","text":"So now notice. Notice what he says here, right? St. Paul has been called by Christ, right, to go and bring his message of salvation to all the nations so that they will turn from their idolatry, turn from their wickedness, turn to the come and worship the true God in Jesus. The Messiah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9520.19,"end":9520.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9521.15,"end":9536.24,"speaker":"Fr Stephen De Young","text":"But St. Paul is here saying that he doesn't see that as an end in itself. Right. He thinks that through doing that, he's going to help save his fellow Jews, help them come and find salvation."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9536.24,"end":9539.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, there's definitely hope here for. For Judea."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9539.68,"end":9564.19,"speaker":"Fr Stephen De Young","text":"And if their rejection has meant that the Gospel has gone out, salvation has gone out to the whole world. He says that eventual acceptance, I mean, that'll bring about the resurrection. Now we're talking about the Messianic age. We're talking about Christ's return. That's what St. Paul's saying. Now, he gives this analogy starting in verse 17 that we referred to earlier."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9564.67,"end":9601.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay, but if some of the branches were broken off and you, although a wild olive shoot, were grafted in among the others, and now share in the nourishing root of the olive tree, do not be arrogant toward the branches. If you are, remember it is not you who support the root, but the root that supports you. Then you will say, branches were broken off so that I might be grafted in. That is true. They were broken off because of their unbelief, their unfaithfulness. But you stand fast through faithfulness. So do not become proud, but fear. For if God did not spare the natural branches, neither will he spare you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9602.27,"end":9604.51,"speaker":"Fr Stephen De Young","text":"So much for perseverance of the saints. But continue."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9605.07,"end":9639.29,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Note then, the kindness and the severity of God, severity towards those who have fallen. But God's kindness to you, provided you continue in his kindness, otherwise you too will be cut off. And even they, if they do not continue in their unbelief or their unfaithfulness, will be grafted in. For God has the power to graft them in again. For if you were cut from what is by nature a wild olive tree and grafted contrary to nature, into a cultivated olive tree, how much more will these, the natural branches be grafted back into their own olive tree?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9640.17,"end":9644.57,"speaker":"Fr Stephen De Young","text":"Yeah, we already commented on that analogy a bit with the caller, so we could keep going."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9644.65,"end":9669.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah, okay. Lest you be wise in your own sight, I do not want you to be unaware of this mystery. Brothers. A partial hardening has come upon Israel until the fullness of the Gentiles has come in. And in this way all Israel will be saved. As it is written, the deliverer will come from Zion. He will banish ungodliness from Jacob. And this will be my covenant with them when I take away their sins."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9670.04,"end":9698.56,"speaker":"Fr Stephen De Young","text":"Okay, this is. This section here is very important. So there is this reference that St. Paul makes. Until the fullness of The Gentiles has come in. Right. That again, this partial hardening, meaning those who have rejected Jesus, the Messiah, they've been hardened. Right. But again, he's talking about, well, there'll be this time, right. Where they'll be provoked to jealousy and come back."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9698.88,"end":9699.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9699.84,"end":9708.48,"speaker":"Fr Stephen De Young","text":"In the end. That's part of what St. Paul's working for. And that's going to come after the fullness of the Gentiles have come in."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9708.64,"end":9709.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9709.08,"end":9714.16,"speaker":"Fr Stephen De Young","text":"And once the fullness of the Gentiles have come in, then all Israel will be saved."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9714.73,"end":9718.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, isn't this a reference to the Testament of Jacob?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9718.57,"end":9719.05,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9719.45,"end":9719.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9719.89,"end":9723.13,"speaker":"Fr Stephen De Young","text":"This is a reference to Genesis, chapter 48."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9724.09,"end":9724.45,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9724.45,"end":9729.21,"speaker":"Fr Stephen De Young","text":"Well, this is the Gentiles again. You got to be really familiar with the Torah to understand St. Paul."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9729.69,"end":9737.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. He's using phrases that if you know the Torah super well, you're like, oh, oh, oh, I caught that reference."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9737.29,"end":9737.77,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9738.33,"end":9738.89,"speaker":"Fr Andrew Stephen Damick","text":"You know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9742.29,"end":9758.17,"speaker":"Fr Stephen De Young","text":"In Genesis 48, Joseph brings his two sons, Ephraim and Manasseh, to Jacob his father, for him to bless his sons. And these are going to be the two half tribes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9758.17,"end":9758.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9759.41,"end":9769.98,"speaker":"Fr Stephen De Young","text":"And Ephraim is the younger of the two. Okay. But Ephraim is going to be the numerically largest and most powerful tribe of the northern kingdom."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9770.69,"end":9770.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9770.97,"end":9772.61,"speaker":"Fr Stephen De Young","text":"Throughout Prophets, the Psalms."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9773.33,"end":9776.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So much so that the northern kingdom gets called Ephraim."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9776.21,"end":9816.48,"speaker":"Fr Stephen De Young","text":"Right. In the Psalms and the Prophets, it's referred to as Ephraim. Like we said before, there's Ephraim and there's Judah. Right. That's the way of referring to the two kingdoms. And so, as we see so many times in Genesis, even though Ephraim is the younger, Jacob crosses his left and right hands. So he puts his right hand on Ephraim when he blesses him. Right. It gives him the older brother blessing. Joseph tries to correct him. And Jacob's like, no, no, this is the thing. And what does he say to Ephraim? He says, your offspring will become the fullness of the Gentiles."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9817.68,"end":9818.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9818.4,"end":9819.76,"speaker":"Fr Stephen De Young","text":"The fullness of the nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9819.84,"end":9828.17,"speaker":"Fr Andrew Stephen Damick","text":"A reference to the northern kingdom being carried off, being dissolved and dissolved into the nations."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9828.57,"end":9828.97,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9829.85,"end":9836.49,"speaker":"Fr Andrew Stephen Damick","text":"So the idea then is that when the nations come to worship Israel's God, it's the return of Ephraim."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9836.81,"end":9837.17,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9837.17,"end":9837.85,"speaker":"Fr Andrew Stephen Damick","text":"Effectively."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9838.09,"end":9878.34,"speaker":"Fr Stephen De Young","text":"Because the promise over and over again in the Prophets is that all Israel will be saved. Ephraim and Judah will be bound back together. All the tribes, all Israel will be saved. Right. And so St. Paul, what St. Paul sees, and St. Paul isn't making this up, this is referred to Go back to our episode on the Testaments of the Twelve Patriarchs. This is an idea in Second Temple Judaism before St. Paul gets to it, that through the dissolution of the northern tribes into the nations. Right. The nations would come back in and be grafted in to fill all those spots where those branches were cut off."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9878.9,"end":9879.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9879.46,"end":9897.94,"speaker":"Fr Stephen De Young","text":"So the way all Israel is saved, the way the whole 12 tribes is saved, is by the people of the nations coming in and taking. Taking the place of those tribes. That's exactly what St. Paul is saying here. And it's clear again, if you know the Torah that he's referring to."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9898.42,"end":9898.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9900.19,"end":9901.71,"speaker":"Fr Stephen De Young","text":"All right. Finish us out here."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9901.95,"end":9908.11,"speaker":"Fr Andrew Stephen Damick","text":"Okay. And we'll finally finish the second half. Almost two hours in. Okay. Almost three hours in."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9908.11,"end":9909.71,"speaker":"Fr Stephen De Young","text":"Who endures to the end will be saved."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9909.87,"end":9980.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Thank you very much for that. Okay. As regards the Gospel, they are enemies for your sake, but as regards election, they are beloved for the sake of their forefathers. The they here, by the way, is Israel. Because he's talking to the Gentiles now. Right. As regards election, they are beloved for the sake of their forefathers, for the gifts and the calling of God are irrevocable. For just as you were at one time disobedient to God, but now have received mercy because of their disobedience, so they too have now been disobedient in order that by the mercy shown to you, they also may now receive mercy. Kind of goes around, comes around. For God is consigned all to disobedience that he may have mercy on all. Oh, the depth of the riches and wisdom and knowledge of God. How unsearchable are his judgments and how inscrutable his ways. For who has known the mind of the Lord, or who has been his counselor, or who has given a gift to him that he might be repaid for from him and through him, and to him are all things to him be glory forever. Amen. Do you just want to end the second half there, or do you have anything you want to say about that?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9980.46,"end":9983.98,"speaker":"Fr Stephen De Young","text":"Yeah. You want to step on St. Paul's climax there, I guess."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9983.98,"end":9985.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9985.3,"end":9986.66,"speaker":"Fr Stephen De Young","text":"I mean, good going."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9987.38,"end":9989.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. But I love what he does here."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9989.22,"end":9989.42,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":9989.42,"end":10001.86,"speaker":"Fr Andrew Stephen Damick","text":"He's like saying he's. It's. It's going back and forth. Like, he's like saying, okay, so Israel is in this sorry state so that you Gentiles could be brought in. But when they see. When Israel sees you being brought in, they're going to want to get on board as well."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10002.5,"end":10002.9,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10003.14,"end":10008.85,"speaker":"Fr Andrew Stephen Damick","text":"You know, so it's, there's a lot of falls going on here, but it's, there's going to be a lot of getting up as a result."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10010.21,"end":10010.77,"speaker":"Fr Stephen De Young","text":"Yep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10011.01,"end":10021.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. Well, that wraps up the second half. We have one more half to go on this very special election episode of the Lord of Spirits podcast. So we'll be right back."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10021.81,"end":10038.14,"speaker":"Announcer","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-23. That's 855-AF-RADIO."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10043.02,"end":10112.59,"speaker":"Announcer","text":"How do you explain the sacraments? It's easy to say they're mysteries that we have to take on faith or on the authority of tradition, but that is not how the early Christians understood them. To them and to all ancient people, the idea that physical objects had spiritual power was very intuitive, whereas modern people tend to find this difficult, bizarre or even unchristian. This is because we live in an era shaped by secularism, a way of viewing the world that's incompatible with sacramental thinking. Because secular ideas are at the heart of our culture, modern people tend to think in secular ways without realizing it. Even the most well meaning of us. How then do we live in but not be of a secular culture? We need to understand the enchanted sacramental way that the early Christians viewed the world, but we also need to understand secularism. What is it really? Where did it come from? And how does it influence how we think about religion? Journey to Reality Sacramental Life in a Secular Age breaks down these important issues in accessible, non academic language and is an ideal introduction for young readers, catechumens and seekers, as well as for any Orthodox Christians who want to deepen their understanding of the sacraments."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10112.99,"end":10127.71,"speaker":"Unregistered: Commercial Narrator 2","text":"Journey to Reality Sacramental Life in a Secular Age by Zachary Porcou, now available@store.ancientfaith.com Again, that is store.ancientfaith.com we're back now."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10127.71,"end":10143,"speaker":"Announcer","text":"With the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10143.8,"end":10166.75,"speaker":"Fr Andrew Stephen Damick","text":"So I know the voice of Steve just told you to call everybody, but we're actually closed down the phone lines. So because it has already been a nice beefy episode and we have cowardice. I know, I know, I know it's true. What can I say? But you know, it all comes down to when does Father Andrew get to go to sleep?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10167.47,"end":10170.83,"speaker":"Fr Stephen De Young","text":"So you thought you were gonna Find out the results of the election and not have to stay up late."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10176.35,"end":10179.59,"speaker":"Fr Andrew Stephen Damick","text":"I mean I just keep hoping for 1984 all over again where it was."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10179.59,"end":10182.43,"speaker":"Fr Stephen De Young","text":"Like over at 8pm 49 states."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10183.15,"end":10183.51,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10183.51,"end":10184.11,"speaker":"Fr Stephen De Young","text":"I remember that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10184.11,"end":10188.92,"speaker":"Fr Andrew Stephen Damick","text":"That was the first. That was the first election that I remember staying up for. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10189.16,"end":10194.68,"speaker":"Fr Stephen De Young","text":"You know, I remember as a kid, as a little kid just feeling really bad for Walter Mondale."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10194.76,"end":10195.32,"speaker":"Fr Andrew Stephen Damick","text":"I know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10195.56,"end":10210.84,"speaker":"Fr Stephen De Young","text":"Like, oh man, that's like. I mean, you know, I was nine but it was like that's like getting, you know, pick last for dodgeball 50 times. Well, 49 times. 49 times, yeah, like poor."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10210.92,"end":10215.06,"speaker":"Fr Andrew Stephen Damick","text":"But Minnesota said we want you, Walter Mondale, we want you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10215.22,"end":10220.58,"speaker":"Fr Stephen De Young","text":"He was the second best politician in the country at the time, you know, but no respect."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10225.78,"end":10230.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, okay. Sorry. Calvinists. Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10230.62,"end":10242.94,"speaker":"Fr Stephen De Young","text":"It's the thing that's no connection to Walter Mondale by the way. We're not implying that Walter Mondale was a Calvinist. I don't know what his theology Calvinists are in some way like Walter Mondale or even their many Calvinists in Minnesota. I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10243.58,"end":10254.22,"speaker":"Fr Andrew Stephen Damick","text":"Many have voted. One was chosen. I don't know. But yes, yes. No, this is just the episode where we just have to say that it's required by in our contract to say that at the beginning of each of each half."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10254.38,"end":10258.3,"speaker":"Fr Stephen De Young","text":"So yes, we are. We are being a little pugnacious."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10259.1,"end":10265.58,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So how about in Matthew 22 where it says many are called but fewer chosen."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10265.66,"end":10279.23,"speaker":"Fr Stephen De Young","text":"Yeah. So going to be. Fortunately for Father Andrew, you know, he went and got the early bird dinner at 3pm at the local Bob Evans. He's an elderly man now. He needs drink his hot cocoa and go to sleep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10279.55,"end":10280.83,"speaker":"Fr Andrew Stephen Damick","text":"Slightly younger than you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10280.91,"end":10282.75,"speaker":"Fr Stephen De Young","text":"We're going to try pull all this together."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10283.15,"end":10284.35,"speaker":"Fr Andrew Stephen Damick","text":"You don't ever sleep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10284.43,"end":10347.57,"speaker":"Fr Stephen De Young","text":"So yeah, so I. Wait. So yeah, so yes, Matthew 22, verse 14 says many are called, but few are chosen. And what's interesting and the reason we're bringing this up here now in our third half is that if you go to go back to. And I know it's been a long time since we were at the beginning of the second half but Romans 8:30 where it talks about those whom he predestined, he also called. Those whom he called, he also justified. Those whom he justified, he also glorified. If you look up patristic commentary on Romans 8:30, the church fathers aren't concerned about any golden chains of redemption or any of that kind of stuff or predestinarianism. What they're concerned about is. Wait doesn't this contradict Matthew 20:14, that many are called, but few are chosen. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10347.81,"end":10354.05,"speaker":"Fr Andrew Stephen Damick","text":"By the way, I just have to say, because I just had to look this up. Walter Mondale was, in fact, a Presbyterian."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10355.49,"end":10357.57,"speaker":"Fr Stephen De Young","text":"Wow. So it all comes together."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10358.05,"end":10358.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10359.49,"end":10373.81,"speaker":"Fr Stephen De Young","text":"Sorry. WALTER Mondale, about 1984 and your Calvinism. He's probably PC USA, though. I mean, yeah, I probably had. Are they really Calvinists? Are they really Calvinists?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10374,"end":10375.28,"speaker":"Fr Andrew Stephen Damick","text":"At some point they might have been."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10377.68,"end":10378.32,"speaker":"Fr Stephen De Young","text":"I don't know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10378.32,"end":10379.84,"speaker":"Fr Andrew Stephen Damick","text":"Not anymore, that's for sure."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10381.6,"end":10386.32,"speaker":"Fr Stephen De Young","text":"Or actually, he would have been. He was probably most of his life. He's probably United Presbyterian before they got back together."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10387.2,"end":10390,"speaker":"Fr Andrew Stephen Damick","text":"His dad was a Methodist minister, apparently, so."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10390,"end":10394.56,"speaker":"Fr Stephen De Young","text":"Oh, well, then, yeah, definitely. Yeah, yeah, yeah, definitely."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10394.8,"end":10396.44,"speaker":"Fr Andrew Stephen Damick","text":"Anyway. Okay, sorry, sorry."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10396.44,"end":10397.16,"speaker":"Fr Stephen De Young","text":"I know, I know."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10397.16,"end":10399.68,"speaker":"Fr Andrew Stephen Damick","text":"I just had to look that up. Like, what religion was Walter Mondo."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10400.47,"end":10413.35,"speaker":"Fr Stephen De Young","text":"I wonder if him joining a Calvinist denomination after having a, like, Wesleyan dad was like, youthful rebellion in Minnesota. Oh, son, I'll show you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10414.23,"end":10415.43,"speaker":"Fr Andrew Stephen Damick","text":"I'm gonna become a president."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10416.31,"end":10461.16,"speaker":"Fr Stephen De Young","text":"Dang Armenian. Anyway, okay, so, yeah, the fathers with their Billy Rhodes, 830. Right. Because, of course, as we said, they're reading it, you know, frankly, the way we did at the beginning of chapter two. It's saying, well, St. Paul is saying, if he does one of these things, he does all of these things. Right. And this says, if he calls you, he does all these things. But Matthew 22:14 says, Many are called, but few are chosen. That makes it sound like you could be called by God and he doesn't do those other things. Right. Isn't that a contradiction? But here's what they point out. Matthew 22, verse 14, many are called, but fewer chosen is the end of a parable that Christ tells."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10461.56,"end":10461.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10461.96,"end":10468.44,"speaker":"Fr Stephen De Young","text":"In the preceding verses of Matthew 22, Parable of the wedding banquet with the guy who shows up without a wedding garment."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10468.76,"end":10470.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. Yep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10471.24,"end":10479.16,"speaker":"Fr Stephen De Young","text":"And so, right. Many are called, meaning lots and lots of people were invited to the wedding. This guy shows up without the garment."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10480.09,"end":10480.33,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10480.33,"end":10482.49,"speaker":"Fr Stephen De Young","text":"He's not chosen. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10482.97,"end":10495.69,"speaker":"Fr Andrew Stephen Damick","text":"The parable doesn't go that the king who offers the banquet goes around to all his wedding guests and says, I choose you. I choose you. I choose you. I don't choose you, guy without a wedding garment."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10496.25,"end":10501.69,"speaker":"Fr Stephen De Young","text":"Yeah. No. Or show. Or even show me your invitation. Like, some of you showed up uninvited."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10502.09,"end":10503.69,"speaker":"Fr Andrew Stephen Damick","text":"Right? Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10503.85,"end":10506.37,"speaker":"Fr Stephen De Young","text":"No, I only chose to invite some of you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10506.37,"end":10512.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. It was a. You know, if there's choosing going on, it's the guy who showed up without the garment who made that choice."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10512.72,"end":10521.32,"speaker":"Fr Stephen De Young","text":"Right. But he doesn't have this status of chosen. And chosen here has to do with showing up in the wedding garment. Meaning it's an issue of qualification."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10522.12,"end":10522.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10524.44,"end":10547.89,"speaker":"Fr Stephen De Young","text":"It's an issue of having qualified yourself. Right. In terms of that call. Right. So the call was what? You are invited to a wedding feast. What is the faithful way to answer that call? To go and purchase a wedding garment, put it on, and arrive in a timely manner to the wedding feast."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10548.29,"end":10548.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10549.57,"end":10590.31,"speaker":"Fr Stephen De Young","text":"Right. So he's faithless. He doesn't do what he was supposed to do. Right. And so he doesn't receive the promise that lay behind that call. Right. So in Romans, St. Paul is talking about, look, God is going to follow through. God is going to be faithful. The question is whether we're going to be faithful. Right. To the call, not whether God's going to be faithful to his promises. Right. Another very important passage, second Peter 1, verses 5 through 11."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10591.35,"end":10591.87,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10591.87,"end":10593.51,"speaker":"Fr Stephen De Young","text":"This one's going to sting Calvinists."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10596.31,"end":10650.35,"speaker":"Fr Andrew Stephen Damick","text":"For this very reason. Make every effort to supplement your faith with virtue and virtue with knowledge and knowledge with self control and self control with steadfastness and steadfastness with godliness and godliness with brotherly affection and brotherly affection with love. But if these qualities are yours and are increasing, they keep you from being ineffective or unfruitful in the knowledge of our Lord Jesus Christ. For whoever lacks these qualities is so nearsighted that he is blind, having forgotten that he was cleansed from his former sins. Therefore, brothers, be all the more diligent to confirm your calling and election. Or as it says in the old King James, make your calling and election sure. For if you practice these qualities, you will never fail. For in this way, there will be richly provided for you an entrance into the eternal kingdom of our Lord and Savior, Jesus Christ."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10652.75,"end":10653.15,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10654.03,"end":10658.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's interesting that he says if you do this, that's going to give you the entrance."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10659.15,"end":10659.63,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10659.87,"end":10662.19,"speaker":"Fr Andrew Stephen Damick","text":"This is not about what happens after you're in."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10662.75,"end":10669.8,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. This is about entering into the kingdom. Right. So if you want to enter into the kingdom."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10671.8,"end":10672.2,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10672.28,"end":10697.25,"speaker":"Fr Stephen De Young","text":"That's the promise. Right. You've been called to. That's what you've been called to. You've been called to the kingdom of God. So in order to receive that promise, you have to make your calling and election sure. That means your election isn't sure. Yeah, it isn't certain. This is the Bible. That's what it says."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10697.33,"end":10699.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You got to work out your salvation with fear and sizzling."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10699.97,"end":10701.09,"speaker":"Fr Stephen De Young","text":"It isn't sure."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10702.21,"end":10702.85,"speaker":"Candice","text":"Okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10705.17,"end":10718.21,"speaker":"Fr Stephen De Young","text":"And this is not about, as I'VE heard certain Calvinists and this is a bad argument. So don't make this argument Calvinist. But I've heard some people say this. This is not about making you sure about your salvation."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10718.37,"end":10721.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I just don't feel sure because it doesn't say that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10722.45,"end":10729.33,"speaker":"Fr Stephen De Young","text":"This is not psychology. This is. This is not about psychology. This is making your calling and selection sure."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10730.13,"end":10731.25,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10731.25,"end":10747.04,"speaker":"Fr Stephen De Young","text":"And how do you do that? Back to verse five. You make every effort that's working, that's doing things you can't get around that. Make every effort."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10748.24,"end":10748.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10748.68,"end":10787.29,"speaker":"Fr Stephen De Young","text":"To supplement your faithfulness with virtue and virtue with knowledge. Each of these things. Because if you have those qualities which you. You gain those qualities, those qualifications that constitute your election. And make it sure you gain those qualities through effort. If you have them through that effort. And if they're increasing through that effort, they keep you from being ineffectual or unfruitful. And therefore you're calling an election as made sure. And you gain an entrance into the kingdom of Lord Jesus Christ. That's what St. Peter says there. That's simply what it says."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10789.61,"end":10790.17,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10792.01,"end":10844.35,"speaker":"Fr Stephen De Young","text":"Now I know, right? I know there are some Calvinist folks out there who will come and say that's a really hard passage. It's really unclear. We need to interpret the unclear passages like this based on the clear passages. And I'm going to say the clear passages like What? Like Romans 9. We just went through that. Romans 8, 10, 11, 11. Right. The passages you typically say are clear, don't clearly say what you need them to say. And therefore you can't sort of use them to try and jimmy and squelch what this one clearly says because this text is actually really clear. The difference between clear and difficult is not agrees with me versus disagrees with me."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10846.55,"end":10850.79,"speaker":"Fr Andrew Stephen Damick","text":"Oh man. Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10852.71,"end":10932.25,"speaker":"Fr Stephen De Young","text":"So the issue here, right, is about qualifying or not qualifying through the acquisition of virtue, through the acquisition of the Holy Spirit, which is done through faithfulness, which includes effort. So Israel, historically, the story of the Hebrew Bible, the story of the Old Testament Israel, proved by and large not everyone. Right? Now, again, we're not talking about every individual because there's this remnant always in every generation, great saints of the old covenant. But on the whole, the nation of Israel was unfaithful and failed to live up to its calling to serve as a light to the nations. But St. Paul says that calling remains. The calling is irrevocable, as we heard at the end of Romans 11. Right. The nations have been called to worship the true God. Right. That's a calling that comes out of Israel. Salvation is from the Jews, as Jesus says. Right? But now the church, constituted primarily of Gentiles, has an inverse calling to Israel's original calling. We're now called to provoke the Jewish people to jealousy, to get them to return to God's Messiah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10932.81,"end":10933.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10933.61,"end":10985.4,"speaker":"Fr Stephen De Young","text":"What does that mean? That means Jewish people should look at their Christian friends and neighbors, see the holiness we practice, see the righteousness we practice. So we've given up evil things. See how we follow the true God. And that should inspire them to accept Jesus as their Messiah. Allow me to say that collectively, we're talking about everyone in history who has called themselves a Christian. We haven't done that. Yeah, right. Your average Jewish person, if they go back through history and look at people who have called themselves Christians and the way they've acted not just toward Jewish people, but it just in general, right. Would not be awestruck by our holiness and kindness and gentleness and love."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10987.88,"end":10988.44,"speaker":"Announcer","text":"Okay?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":10989.08,"end":11034.59,"speaker":"Fr Stephen De Young","text":"Now obviously we can only control ourselves in our own communities, right? In our own. Right. But this is. And beyond just the question of the Jewish people, I mean, that's the context in which St. Paul's talking about it in Romans, right? So that's why we refer to it here. But in general, right? This is. I have people all the time who come and join the Orthodox Church and they have family members, sometimes their spouse, right. Sometimes older children of theirs, other family members, right? Who. Sometimes they're antagonistic to the Orthodox Church. Sometimes they're just not interested. Sometimes they have qualms. Whatever their relationship is, they're not ready to join. Likewise. Right? And what I tell all those people when they're joining the Orthodox Churches, all those other people in your life are going to be looking at you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11037.15,"end":11037.43,"speaker":"Candice","text":"And."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11037.43,"end":11149.11,"speaker":"Fr Stephen De Young","text":"They'Re going to see how you live and what you do and if. And how being part of the Orthodox Church changes your life, what kind of holiness, what kind of fruit it brings out in you. And if they see good fruit there, if they see these good things happening for you, that will draw them into the church. Not you arguing with them, not you sending the memes, right? Them seeing you living a Christian life, right? So we're not just talking about Jewish people. We're talking about everyone in the world, right? Should be able to look at us and our lives the way we live them in as a person and collectively as a community. The way we live as a church should be able to look at that and see Christ there and be drawn to it. Right? That's our calling. It's kind of our calling as Israel. And so for St. Paul, the way we find salvation, it's not just St. Paul. This is all of the apostles, all of the New Testament writers. Right. This is really very simple. It's not really that hard. Right. God has given us a calling. He's given us a general calling as Christians. Right. There's a Christian way of life in community. Right. That we believe has been preserved in the Orthodox Church. Right. If nowhere else, it has been preserved in the Orthodox Church. We don't need to comment on where else somebody else might find it, but it's definitely here. That way of life leads to salvation. We're called to live in that way. We find our salvation by being faithful to it. But there's also another layer. There's a very personal layer. It's not all collective. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11149.11,"end":11149.43,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11149.43,"end":11164.33,"speaker":"Fr Stephen De Young","text":"So there's a way every Christian should live. There are things, you know, love one another, there are commandments that are to all of us. Right. But there are also, for St. Paul and for all the other New Testament writers, particular gifts and particular callings that. That God has given to you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11164.73,"end":11174.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Different people have different abilities, different gifts, different talents. You know, we're not all good at everything."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11174.25,"end":11217.5,"speaker":"Fr Stephen De Young","text":"Yeah. And so we're called to fill different roles in our families, in our communities, in our parish communities, church communities. Right. We're called to different roles based on having these different gifts. Right. And spiritual gifts are not about babbling incoherently or jumping up and down or working miracles or predicting the future. Okay. Spiritual gifts are according to the Bible, more about some people being able to paint icons, some people being able to teach, some people being good at cleaning."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11218.3,"end":11219.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Administration."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11219.98,"end":11254.71,"speaker":"Fr Stephen De Young","text":"Some people being good at sewing things for the church, some people being good at baking bread for the Eucharist, some people being good at preparing food for the community to eat and have fellowship. Right. All kinds of things. Right. You know, I'm really blessed in my parish in that I have a bunch of people who have trades who could do things like electric and plumbing and things. Right. That's a spiritual gift too. Right. That you can offer back to God."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11255.27,"end":11255.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11255.59,"end":11283.08,"speaker":"Fr Stephen De Young","text":"In the spirit. And so we find salvation very simply by being faithful to those callings in our life. And we risk salvation. We risk that when we're faithless to that calling, when we abandon that calling that God has given us. It's really. It's really that simple. Yeah."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11283.64,"end":11294.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So I know some of you people in the YouTube chat were cheering for a four hour episode. I don't know who knows? Maybe Father Stephen will give us 45 minutes at the end."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11295.97,"end":11298.05,"speaker":"Fr Stephen De Young","text":"I did used to preach in Protestant churches."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11298.13,"end":11310.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's true. I know. I mean, the sermons I grew up with were 45 to 60 minutes typically and often went longer. Yeah, okay."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11310.53,"end":11310.93,"speaker":"Fr Stephen De Young","text":"So."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11312.93,"end":11523.59,"speaker":"Fr Andrew Stephen Damick","text":"Yes, this episode is a whole lot of, sorry, Calvinists. But its purpose is not actually just an apologetic against Calvinism. Right. There is actual positive content to what it means to be elect, slash, chosen. And I think that a lot of this gets distorted, confused, misunderstood because of the particular currents swirling around at the time of the Reformation, which is when a lot of this stuff gets. Gets, you know, gets the articulation that most of us are now familiar with. And maybe even this is the way we just tend to read the Bible, because this is what we were trained in or whatever. And I think one of the. I mean, it's well known, for instance, that, like, we could talk about the personality and experience and life story of people like Martin Luther and John Calvin, you know, and that's very interesting, but I'm not going to sort of locate everything in that. Although I think that's. That's an interesting trail to walk down and look into it, you know. But also, I mean, there's one of the things going on around the Reformation, and a lot of people don't realize this, is that there was a strong sense that amongst a lot of Christians in Western Europe that the end of the world was coming and soon. Right? There was a lot of millenarianism. There was a sense that they were really living in the end times. And, you know, thus they were able to look at the Roman Catholic Church and they would say, this is the final apostasy. The Pope is the Antichrist. And by that, they didn't just mean that all popes are antichrists, but, like, they actually believe, like, he was the last one. You know, this was it. And so as a result, then, for a lot of people, the Reformation was a sense of this final sort of push of the Gospel, a final cleansing, you know, of Christianity before the return of Christ. Okay. And. And therefore, if you have this sense of, like, imminent return, then the question of how do I know that I'm saved? Has a really heightened character to it, you know, and if you do have a neurotic personality, which I'm gonna go ahead and say that Martin Luther seemed to have one, then, you know, you might do things like go to confession multiple times a day and agonize over whether you truly are saved, which he did. He did. But he's not the only one who, you know, who has those kinds of feelings, you know, with that sense that the world is ending. And then a lot of very, very heightened emotional states can come around, and then that has. Can have theological ramifications, especially if you happen to have a bunch of political rulers willing to give you space to explore other kinds of theology than the ones that had been dominant for centuries in your region. Right. So what does that have to do with us today? Well, I mean, there are a lot of people that feel like we're in the end times."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11524.23,"end":11524.59,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11524.59,"end":11894.77,"speaker":"Fr Andrew Stephen Damick","text":"I mean, we. We did a whole series of episodes on eschatology, you know, if you haven't listened to them, well, spoiler alert. We've been in the end times for 2,000 years. So, you know, I'm not saying this isn't the end of the end. I mean, who knows? I might not wake up tomorrow. It might be the end of the world. It might be just the end of my world. I don't know. You know, eschatology is always, always nearby. We're always participating in that, in the end of the world in one way or another. But I think there is a sense that a lot of people have now that, like, okay, this is. This is really bad, you know, the way that the world is right now. And, and honestly, even though we've made a number of, like, political election jokes in the course of this episode, sometimes the way that politics moves makes people feel like it's the end of the world or at least that it's going to be end of their world. You know, I'm. Now, I mean, we both made reference to the 1984 presidential election. That's the first election that I remember. I was. I was nine years old when that went down. Father Stephen was. Was the same age as I am, but a couple months more. And so I. I remember a lot of elections, and especially I remember a number for a while. There are people that. That feel like, oh, the Antichrist just got elected. Literally. I recall for the last five, five or six presidential elections, people saying that, you know, this sense of the end of the world in one way or another, because they believe that whoever got. Just got elected is the worst possible person that could be elected, you know, and they're going to bring everything down, you know, and there are people who are even I. I've even seen this again just in the last weak people saying that they're going to kill themselves because of the way that an election turned out, because of the sense of the world is Ending. My world is ending, at the very least. And my point in all this is not to make a comment about politics in the Church, by no means. Although, honestly, I think we need to hold all of these things going on in the world a lot more lightly. That doesn't mean they're not serious. They are serious. But what's more serious is the big story, and that's the story of Christ. It's more serious. Right. And so this question of how do I know that I am saved? This is a kind of an. It is kind of a neurotic question, right? I'm not saying it's bad to ask that question, but especially if you. If you keep returning to it and you obsess over and you need to come up with a system for it, then it is kind of a neurotic thing to focus on, you know, to make the definition of your theology. For instance, you know, it would be like a husband and wife, where every day, you know, let's say I go to my wife every day and say, no, King, I need you to tell me again that you're not going to divorce me. And how do I know I'm not going to divorce you? I mean, what does that do to a marriage when that's what it's about? It's not in good shape, that relationship, right? So what does it come down to? It comes down to what St. Paul says it comes down to. It comes down to first, faithfulness. Faithfulness, right? Not absolute mental certainty. Faithfulness. Like this is my life, the life in Christ, right? It is a way of. Of acting, a way of being, a way of thinking, a way of loving. Like all of these things, you know, it's. It's an ing. It's ongoing because it's all of these very active verbs of things that you do. And, you know, day one of when you've chosen to be faithful to Christ, you listen to the call and you're trying to do the thing. Day one, you know, you've just begun. You've just begun. And it's okay if you're worried. It's okay if you're like, I don't know if I'm doing this right. That's all right. It's okay. It's okay. You're going to fall down a gazillion times. Just make sure you get up a gazillion and one. Okay. Just stay loyal, you know? You know, it makes me think of the words of the great philosopher, you know, never going to give you up. Never going to let you down. You know, the point is loyalty and faithfulness and continuing on and on. And so, yeah, it doesn't need to be this neurotic thing. You don't need to have some kind of signed contract. You don't need to if you're just simply living this life together. Right. Like, marriages can become very neurotic as a result of this, but friendships tend to be less. So I'm not saying, no friendships are neurotic, but people tend to expect less from their friends than they do from their spouse. And so as a result, there's a lot more breathing room. You know, a good marriage is one where there's plenty of breathing room and they stay together. Right. And so, you know, we all want a lot of this language in scripture about the, you know, Christ the bridegroom, and we're the bride of Christ, and we want that kind of intimacy in our spiritual life. And that's awesome and good, but you build that intimacy by this mutual freedom and love for one another. Other. Right. And so I think in many cases, we need to start with thinking about what it means that Christ is also our friend and how do we be his friends and. And then that can develop over time. So, yeah, that's what I have to say about that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11896.85,"end":11899.49,"speaker":"Fr Stephen De Young","text":"So is that Rick Roll a reference to your C tier?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11904.47,"end":11906.47,"speaker":"Fr Andrew Stephen Damick","text":"It's true. He's a living Rick Roll."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11906.71,"end":11917.27,"speaker":"Fr Stephen De Young","text":"All right, C tier. Co host confirmed. All right, so, Landsman, you're B tier. Congrats. Anyway, wow."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11917.75,"end":11921.59,"speaker":"Fr Andrew Stephen Damick","text":"So, wow, gauntlets thrown."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11922.55,"end":11940.32,"speaker":"Fr Stephen De Young","text":"So, yeah, so there's. There's a meme that's been going around for a long time. I don't know if I've seen it recently, but I'm sure it's still out there that Orthodoxy is Christianity, only harder."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11940.4,"end":11944.64,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I hate that. I hate that. I'm sorry, I just had to jump."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11944.64,"end":11947.44,"speaker":"Fr Stephen De Young","text":"In and say, well, that's revenge for that Aquinas thing earlier."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11947.68,"end":11952.08,"speaker":"Fr Andrew Stephen Damick","text":"Oh, so."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11955.53,"end":11964.81,"speaker":"Fr Stephen De Young","text":"There is some truth to it in that. Right. Of course. Christ says, you know, broad is the way and easy is the path that leads to destruction."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11965.45,"end":11965.85,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":11966.89,"end":12056.26,"speaker":"Fr Stephen De Young","text":"Narrow is the way and straight is the path that leads to. That leads to life. Right. But I think. I think sometimes rather than taking that or hearing that or hearing that meme about orthodox Christianity and being sort of challenged by it in a way that's sort of invigorating and challenging, and let's rise to the occasion. Let's take our faith seriously. Let's make every effort, as St. Peter says. Right. Let's. Let's get down to Business. I think a lot of the time we just kind of go, man, this is. This is hard. This is too hard, right? And we look at, we put in front of ourselves as examples of faithfulness. You know, even if we're like a married person, especially you married folks with kids. And you put in front of yourself as your. Your image of the. The Christian. You're supposed to be like a sainted monastic who's living a different kind of life than yours, who had a different calling from God than you have. And we look at, because we've chosen that particular model, we compare ourselves to it and just constantly see our deficiency."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12058.35,"end":12058.59,"speaker":"William","text":"Right?"}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12059.79,"end":12306.64,"speaker":"Fr Stephen De Young","text":"And just constantly see, like, how far away we are from where we should be. When that shows us our sins, it's good. But what makes it good is not that we wallow in our sins or feel guilty or feel bad. Guilt is worthless, like most emotions. I know, I'm Gen X. But still, the reason seeing our sins is good is that we can repent of them. We can isolate them, we can go to war with them. We can do better again. We could be spurred on to try and do better, to try to fix what we've broken, to try to be healed and to help with the healing of others. So I want to come back to what St. Paul quoted, which is in Deuteronomy. And in Deuteronomy, it's talking about the whole Torah. The whole Torah, all those commandments, hundreds of commandments. God says what do not say who will go up into heaven, who will go down to the beginning? Piss. It's not far from you. It's in your mouth. It's on your heart. It's not too hard for you. God wants us to find salvation. He loves you. He wants you to find salvation. He does not want you to perish. He is not trying to make it difficult on you. He is not trying to weed you out of the kingdom. He's not trying to make sure you don't make it. He wants you to make it because he wants you to make it, because he loves you. He's given you everything you need to work out your salvation. You have everything you need. We just need to start exerting every effort. We just need to start working toward it. And the reason we're able to do that, the reason we're able to go through whatever suffering and difficulty and hardship we're going through, through and press on and keep making that effort is that we know what St. Paul also told us that we read tonight, right? That regardless of that, God is going to be faithful. God is going to finish what he started in us. If we remain faithful, he is going to bring us home. We remain faithful. He will continue to provide us with what we need. So any view of God or of holiness or of salvation, no matter how dressed up in a cassock with a giant prayer rope it is that causes you to fall into despair, is not an image of God or an image of holiness. It's an image of the devil because it's an image of condemnation directed toward you. It's an image of discouragement directed toward you. It's trying to bring you down into despondency. That's not from God. God is with you. He's on your side. The Holy Spirit is in your mouth and on your heart. He's written the commandments there so that if we're willing to follow him, we can keep them and we can find life. That's what I have to say."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12307.6,"end":12330.57,"speaker":"Fr Andrew Stephen Damick","text":"Amen. That is our show for tonight. Thank you for listening, everyone. If you didn't get through to us live, we'd still like to hear from you. You can email us@lordofspiritsancientfaith.com you can message us at our Facebook page. You can leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help to find a parish, go to orthodoxintro.org Join."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12330.57,"end":12339.77,"speaker":"Fr Stephen De Young","text":"Us for our live broadcast on the 2nd and 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. You could blow with this. You could blow with that. You could blow with this. You could blow with that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12340.09,"end":12351.06,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, you can follow our page, you can join our discussion group, leave reviews and ratings everywhere, but most importantly, share this show with a friend who is going to love it."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12351.78,"end":12361.86,"speaker":"Fr Stephen De Young","text":"Finally, be sure to go to exyourfaith.com support and help make sure we and lots of other AFR podcasters stay on the air. You could blow with this, you could blow with that. You could blow with this. You could blow with that."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12362.34,"end":12365.14,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless you."}
{"episode_id":"LOS - #104 - 2024-11-14 - Israel, I Choose You!","start":12378.91,"end":12415.96,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders, and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
