{"episode_id":"LOS - #041 - 2022-04-20 - The Harrowing of Hell (read by Fr. Andrew Stephen Damick)","start":2.88,"end":1845.71,"speaker":"Fr Andrew Stephen Damick","text":"Hello, everyone. This is father Andrew. In 2021, at the end of our Holy Week and Pascha episode, which was titled the Lord of Spirits Goes to Hell, I read a short excerpt from the Harrowing of Hell section of a text variously referred to as the Gospel of Nicodemus or the Acts of Pilate. This text is generally regarded as an apocryphal New Testament text. What does that mean? It reflects traditions surrounding events of the New Testament that are not actually included in Scripture. So this isn't a text from the Bible and we don't treat it that way. But one of the distinctions from the ancient church that we have mentioned many times on the podcast is between three categories of books read in church, Books read at Home, and books not to be read. The first category is Scripture Books read in Church. The last category, Books not to be Read, is heretical texts that are harmful to one's salvation. This text, the Gospel of Nicodemus, is that second category, Books to be read at home. A number of orthodox liturgical texts make use of this text, giving it an honored place within our tradition of worship. After I read that excerpt, we received a lot of positive feedback, as this was many people's first encounter with this amazing piece of writing that seems to have taken its present form in the 4th or 5th century. Because of that feedback, I wanted to read for you the Harrowing of Hell in its entirety as found in the Gospel of Nicodemus. We begin with St. Joseph of Arimathea speaking to Annas and Caiaphas, two high priests of the temple during the time of Jesus and Joseph arose and said unto Annas and Caiaphas, truly and of right, do ye marvel, because ye have heard that Jesus hath been seen alive after death, and that he hath ascended into heaven. Nevertheless, it is more marvellous that he rose not alone from the dead, but did raise up alive many other dead out of their sepulchres. And they have been seen of many in Jerusalem. And now hearken unto me, for we all know the blessed Simeon, the high priest, which received the child Jesus in his hands in the temple. And this Simeon had two sons, brothers in blood. And we all were at their falling asleep, and at their burial. Go therefore, and look upon their sepulchres, for they are open because they have risen. And behold, they are in the city of Arimathea, dwelling together in prayer. And indeed men hear them crying out, yet they speak with no man, but are silent as dead men. But come, let us go unto them, and with all honour and gentleness bring them unto us. And if we adjure them, perchance they will tell us concerning the mystery of their rising again. When they heard these things, they all rejoiced. And Annas and Caiaphas, Nicodemus and Joseph and Gamaliel went, and found them not in their sepulchre, but they went unto the city of Arimathea, and found them there kneeling on their knees and giving themselves unto prayer. And they kissed them. And with all reverence and in the fear of God, they brought them to Jerusalem, into the synagogue, and they shut the doors and took the law of the Lord and put it into their hands and adjured them by the Lord God and the God of Israel, which spake unto our fathers by the prophets, saying, believe ye that it is Jesus which raised you from the dead. Tell us how ye have arisen from the dead. And when Charinus and Levcheus heard this adjuration, they trembled in their body and groaned. Being troubled in heart and looking up together unto heaven, they made the seal of the cross with their fingers upon their tongues. And forthwith they spake, both of them, saying, give us each a volume of paper, and let us write that which we have seen and heard. And they gave them unto them. And each of them sat down and wrote, o Lord Jesus Christ, the life and resurrection of the dead. Suffer us to speak of the mysteries of thy majesty which thou didst perform after thy death upon the cross, inasmuch as we have been adjured by thy name. For thou didst command us, thy servants, to tell no man the secrets of thy divine majesty which thou wroughtest in hell. Now, when we were set together with all our fathers in the deep, in obscurity of darkness, on a sudden there came a golden heat of the sun and a purple and royal light shining upon us. And immediately the Father of the whole race of men, together with all the patriarchs and prophets, rejoiced. This light is the beginning of everlasting light, which did promise to send unto us his coeternal light. And Isaiah cried out and said, this is the light of the Father, even the Son of God. According as I prophesied when I lived upon the earth, the land of Zebulun and the land of Nephthalim, beyond Jordan, of Galilee, of the Gentiles, the people that walked in darkness have seen a great light. And they that dwell in the land of the shadow of death, upon them did the light shine. And now hath it come and shone upon us that sit in death. And as we all rejoiced in the light which shined upon us there came unto us our Father Simeon. And he, rejoicing, said unto us, glorify ye the Lord Jesus Christ, the Son of God. For I received him in my hands in the temple when he was born a child. And being moved of the Holy Spirit, I made confession and said unto him, now have mine eyes seen thy salvation which thou hast prepared before the face of all people a light to lighten the Gentiles and to be the glory of thy people Israel. And when they heard these things, the whole multitude of the saints rejoiced yet more. And after that there came one, as it were a dweller in the wilderness. And he was inquired of by all, who art thou? And he answered them and said, I am John, the voice and the prophet of the Most High, which came before the face of his advent to prepare his ways, to give knowledge of salvation unto his people for the remission of their sins. And when I saw him coming unto me, being moved of the Holy Spirit, I said, behold the Lamb of God. Behold him that taketh away the sins of the world. And I baptized him in the river of Jordan and saw the Holy Spirit descending upon him in the likeness of a dove and heard a voice out of heaven saying, this is my beloved Son, in whom I am well pleased. And now have I come before his face and come down to declare unto you that he is at hand to visit us, even the Dayspring, the Son of God coming from on high unto us that sit in darkness and in the shadow of death. And when Father Adam that was first created heard this, even the Jesus was baptized in Jordan. He cried out to Seth his son, saying, declare unto thy sons, the patriarchs and the prophets, all that thou didst hear from Michael the Archangel when I sent thee unto the gates of Paradise. Paradise. That thou mightest entreat God to send thee his angel to give thee the oil of the tree of Mercy to anoint my body when I was sick. Then Seth drew near unto the holy patriarchs and prophets and said, when I, Seth, was praying at the gates of paradise, behold Michael, the angel of the Lord appeared unto me, saying, I am sent unto thee from the Lord. It is I that am set over the body of man. And I say unto thee, Seth, vex not thyself with tears, praying and entreating for the oil of the tree of Mercy that thou mayest anoint thy Father Adam for the pain of his body, for thou wilt not be able to receive it, save in the last days and times. Save when 5000 and 500 years are accomplished, then shall the most beloved Son of God come upon the earth to raise up the body of Adam and the bodies of the dead. And he shall come and be baptized in Jordan. And when he is come forth of the water of Jordan, then shall he anoint with the oil of mercy all that believe on him. And that oil of mercy shall be unto all generations of them that shall be born of water and of the Holy Spirit unto life eternal. Then shall the most beloved Son of God, even Christ Jesus, come down upon the earth and shall bring in our Father Adam into paradise unto the tree of mercy. And when they heard all these things of Seth, all the patriarchs and prophets rejoiced with a great rejoicing. And while all the saints were rejoicing, behold Satan, the prince and chief of death, said unto Hel, make thyself ready to receive Jesus, who boasteth himself that he is the Son of God, whereas he is a man that feareth death and saith, my soul is sorrowful even unto death. And he hath been much mine enemy, doing me great hurt and many that I had made. Blind, lame, dumb, leprous and possessed, he hath healed with a word, and some whom I have brought unto thee dead, them hath he taken away from thee hell answered, and said unto Satan, the prince, who is he that is so mighty, if he be a man that feareth death? For all the mighty ones of the earth are held in subjection by my power, even they whom thou hast brought me subdued by thy power. If then thou art mighty, what manner of man is this Jesus, who, though he fear death, resisteth thy power, if he be so mighty in his manhood? Verily I say unto thee, he is almighty in his good Godhead, and no man can withstand his power. And when he saith that he feareth death, he would ensnare thee, and woe shall be unto thee for everlasting ages. But Satan, the prince of Tartarus said, why doubtest thou and fearest to receive this Jesus, which is thine adversary and mine? For I tempted him and have stirred up mine ancient people of the Jews with envy and wrath against him. I have sharpened a spear to thrust him through Gall and vinegar have I mingled to give him to drink. And I have prepared a cross to crucify him and nails to pierce him. And his death is nigh at hand that I may bring him unto thee, to be subject unto thee and me hell answered and said, thou hast told me that it is he that hath taken away dead men from me. For there be many which, while they lived on the earth, have taken dead men from me, yet not by their own power, but by prayer to God and their Almighty God hath taken them from me. Who is this Jesus, which by his own word, without prayer, hath drawn dead men from me? Perchance it is he which by the word of his command, did restore to life Lazarus, which was four days dead and stank and was corrupt, whom I held here dead. Satan, the Prince of death, answered and said, it is that same Jesus, when Hell heard that he said unto him, I adjure thee by thy strength and mine own, that thou bring him not unto me. For at that time I, when I heard the command of his word, did quake and was overwhelmed with fear. And all my ministries with me were troubled. Neither could we keep Lazarus. But he, like an eagle shaking himself, leaped forth with all agility and swiftness and departed from us and the earth also, which held the dead body of Lazarus straightway gave him up alive. Therefore now I know that that man which was able to do these things is a God, strong in command and mighty in manhood, and that he is the saviour of mankind. And if thou bring him unto me, he will set free all that are here shut up in the hard prison and bound in the chains of their sins that cannot be broken, and will bring them unto the life of his Godhead forever. And as Satan, the Prince and Hel spoke this together, suddenly there came a voice as of thunder and a spiritual cry. Remove, O princes, your gates, and be ye lift up, ye everlasting doors, and the King of Glory shall come in. When Hell heard that, he said unto Satan the Prince, depart from me and go out of mine abode. If thou be a mighty man of war, fight thou against the King of Glory. But what hast thou to do with him? And Hell cast Satan forth out of his dwelling. Then said Hell unto his wicked ministers, shut ye the hard gates of brass, and put on them the bars of iron and withstand stoutly, lest we that hold captivity be taken captive. But when all the multitudes of the saints heard it, they spake with a voice of rebuking unto hell. Open thy gates, that the King of Glory may come in. And David cried out, saying, did I not, when I was alive upon earth, foretell unto you? Let them give thanks unto the Lord, even his mercies and his wonders. Unto the children of men who hath broken the gates of brass and smitten the bars of iron and sunder, he hath taken them out of the way of their iniquity. And thereafter, in like manner, Isaiah said, did not I when I was alive upon earth, foretell unto you the dead shall arise, and they that are in the tombs shall rise again and and they that are in the earth shall rejoice, for the dew which cometh of the Lord is their healing. And again I said, o death, where is thy sting? O hell, where is thy victory? When they heard that of Isaiah, all the saints said unto hell, open thy gates. Now shalt thou be overcome and weak and without strength. And there came a great voice as of thunder, saying, remove, O princes, your gates, and be ye lift up ye doors of hell, and the King of glory shall come in. And when Hell saw that, they so cried out twice he said, as if he knew it not, who is the King of glory? And David answered hell, and said the words of this cry, do I know. For by his spirit I prophesied the same. And now I say unto thee that which I said before the Lord strong and mighty, the Lord mighty in battle, he is the King of glory. And the Lord looked down from heaven that he might hear the groanings of them that are in fetters and deliver the children of them that have been slain. And now, O thou most foul and stinking Hell, open thy gates that the King of Glory may come in. And as David spake thus unto hell, the Lord of majesty appeared in the form of a man and lightened the eternal darkness and brake the bonds that could not be loosed. And the succour of his everlasting might visited us that sat in the deep darkness of our transgressions and in the shadow of death of our sins, when hell and death and their wicked ministers saw that they were stricken with fear, they and their cruel officers, at the sight of the brightness of so great light in their own realm, seeing Christ of a sudden in their abode, and they cried out, saying, we are overcome by thee. Who art thou that art sent by the Lord for our confusion? Who art thou that without all damage of corruption, and with the signs of thy majesty unblemished, dost in wrath condemn our power? Who art thou that art so great and so small, both humble and exalted, both soldier and commander, a marvellous warrior in the shape of a bondsman and a king of glory, dead and living, whom the cross bear slain upon it, Thou that didst lie dead in the sepulchre hast come down unto us living. And at thy death all creation quaked, and all the stars Were shaken and thou hast become free among the dead and dost rout our legions? Who art thou that settest free the prisoners that are held bound by sin and restorest them into their former liberty? Who art thou that sheddest thy divine and bright light upon them that were blinded with the darkness of their sins? After the same manner, all the legions of devils were stricken with like fear and cried out all together in the terror of their confusion, saying, whence art thou, Jesus? A man so mighty and bright in majesty, so excellent without spot and clean from sin. For that world of earth which hath been always subject unto us until now, and did pay tribute to our prophet, hath never sent unto us a dead man like thee, nor ever despatched such a gift unto hell. Who then art thou, that so fearlessly enterest our borders and not only fearest not our torments, but besides essayest to bear away all men out of our bonds. Peradventure. Thou art that Jesus, of whom Satan our Prince, said that by thy death of the cross thou shouldst receive the dominion of the whole world. Then did the King of glory and his majesty trample upon death and laid hold on Satan the prince and delivered him unto the power of hell, and drew Adam to him unto his own brightness. Then Hell, receiving Satan the Prince, with sore reproach, said unto him, O Prince of perdition and chief of destruction, Beelzebub. The scorn of the angels and spitting of the righteous. Why wouldst thou do this? Thou? Thou wouldst crucify the King of glory, and at his decease didst promise us great spoils of his death. Like a fool thou knewest not what thou didst. For behold now this Jesus putteth to flight by the brightness of his majesty all the darkness of death. And hath broken the strong depths of the prisons and let out the prisoners and loosed them that were bound. And all that were sighing in our torments do rejoice against us. And at their prayers our dominions are vanquished and and our realms conquered. And now no nation of men feareth us any more. And besides this, the dead, which were never wont to be proud triumph over us. And the captives, which never could be joyful, do threaten us. O Prince Satan, father of all the wicked and ungodly and renegades. Wherefore wouldst thou do this? They that from the beginning until now have despaired of life and salvation. Now is none of their wonted roarings heard. Neither doth any groan from them sound in our ears, nor is There any sign of tears upon the face of any of them. O Prince Satan, holder of the keys of hell. Those thy riches which thou hadst gained by the tree of transgression and the losing of paradise, thou hast lost by the tree of the cross. And all thy gladness hath perished. When thou didst hang up Christ Jesus, the King of glory, thou wroughtest against thyself and against me. Henceforth thou shalt know what eternal torments and infinite pains thou art to suffer in my keeping forever. O Prince Satan, author of death and head of all pride, thou oughtest first to have sought out matter of evil in this Jesus. Wherefore didst thou adventure without cause to crucify him unjustly, against whom thou foundest no blame, and to bring into our realm the innocent and righteous one, and to lose the guilty and the ungodly and unrighteous of the whole world. And when Hell had spoken thus unto Satan, the prince then said the king of glory unto Hell, Satan the prince shall be in thy power unto all ages in the stead of Adam and his children, even those that are my righteous ones. And the Lord, stretching forth his hand, said, come unto me all ye my saints which bear mine image and my likeness, ye that by the tree and the devil and death were condemned. Behold now the devil and death condemned by the tree. And forthwith all the saints were gathered in one under the hand of the Lord. And the Lord, holding the right hand of Adam, said unto him, peace be unto thee with all thy children that are my righteous ones. But Adam, casting himself at the knees of the Lord, entreated him with tears and beseechings and said with a loud voice, I will magnify thee, O Lord, for thou hast set me up and not made my foes to triumph over me. O Lord, my God, I cried unto thee, and thou hast healed me, Lord. Thou hast brought my soul out of hell. Thou hast delivered me from them that go down to the pit. Sing praises unto the Lord, all ye saints of his, and give thanks unto him for the remembrance of his holiness. For there is wrath in his indignation, and life is in his good pleasure. And in like manner all the saints of God kneeled and cast themselves at the feet of the Lord, saying with one, thou art come, O Redeemer of the world. That which thou didst foretell, by the law and by thy prophets thou hast accomplished indeed thou hast redeemed the living by thy cross. And by the death of the cross thou hast come down unto us, and that thou mightest save us out of hell and death through thy majesty, O Lord, like as thou hast set the name of thy glory in the heavens, and set up thy cross for a token of redemption upon the earth, so Lord set thou up the sign of the victory of thy cross in hell, that death may have no more dominion. And the Lord stretched forth his hand and made the sign of the cross over Adam and over all his saints. And he took the right hand of Adam and went up out of hell, and all the saints followed him. Then did holy David cry aloud and sing unto the Lord a new song, for he hath done marvellous things. His right hand hath wrought salvation for him and his holy arm. The Lord hath made known his saving health before the face of all nations hath he revealed his righteousness? And the whole multitude of the saints answered, saying, such honour have all his saints. Amen. Alleluia. And thereafter Habakkuk the prophet cried out and said, thou wentest forth for the salvation of thy people to set free thy chosen. And all the saints answered, saying, blessed is he that cometh in the name of the Lord. God is the Lord, and hath shewed us light. Amen. Alleluia. Likewise after that the prophet Micah also cried, saying, what? God is like thee, O Lord, taking away iniquity and removing sins, and now thou withholdest thy wrath for a testimony that thou art merciful of free will, and thou dost turn away and have mercy on us. Thou forgivest all our iniquities, and hast sunk all our sins in the depths of the sea, as thou swarest unto our fathers in the days of old. And all the saints answered, saying, this is our God forever and ever he shall be our guide, world without end. Amen. Alleluia. And so spake all the prophets, making mention of holy words out of their praises. And all the saints followed the Lord, crying, Amen. Alleluia. But the Lord, holding the hand of Adam, delivered him unto Michael the Archangel. And all the saints followed Michael the Archangel. And he brought them all into the glory and beauty of paradise. And there met with them two men, ancients of days. And when they were asked of the saints, who are ye that have not yet been dead in hell with us, and are set in paradise in the body? Then one of them answering said, I am Enoch, which was translated hither by the word of the Lord, and this that is with me is Elias the Tishbite, and which was taken up in a Chariot of fire. And up to this day we have not tasted death, but we are received unto the coming of Antichrist, to find against him with signs and wonders of God, and to be slain of him in Jerusalem. And after three days and a half, to be taken up again alive on the clouds. And as Enoch and Elias spake thus with the saints, behold, there came another man of vile habit bearing upon his shoulders the sign of the cross, whom, when they beheld all the saints, said unto him, who art thou? For thine appearance is as of a robber. And wherefore is it that thou bearest a sign upon thy shoulders? And he answered them and said, ye have rightly said, for I was a robber, doing all manner of evil upon the earth. And the Jews crucified me with Jesus. And I beheld the wonders in the creation which came to pass through the cross of Jesus when he was crucified. And I believed that he was the maker of all creatures and the Almighty King. And I besought him, saying, remember me, Lord, when thou comest into thy kingdom. And forthwith he received my prayer and said unto me, verily I say unto thee, now this day shalt thou be with me in Paradise. And he gave me the sign of the cross, saying, bear this and go unto Paradise. And if the angel that keepeth paradise suffer thee not to enter in. Shew him the sign of the cross, and thou shalt say unto him, jesus Christ, the Son of God, who now is crucified, hath sent me. And when I had so done, I spake all these things unto the angel that came keepeth Paradise. And when he heard this of me forthwith, he opened the door and brought me in and set me at the right hand of paradise, saying, lo, now tarry a little, and Adam, the Father of all mankind, will enter in with all his children that are holy and righteous after the triumph and glory of the ascending up of Christ the Lord that is crucified. When they heard all these words of the robber, all the holy patriarchs and prophets said with one voice, blessed be the Lord Almighty, the Father of eternal good things, the Father of mercies. Thou that has given such grace unto thy sinners, and hast brought them again into the beauty of paradise and into thy good pastures. For this is the most holy life of the Spirit. Amen. Amen. These are the divine and holy mysteries which we saw and heard, even I, Quirinus and Lefkius. But we were not suffered to relate further the rest of the mysteries of God, according as Michael the Archangel strictly charged Us saying, ye shall go with your brethren unto Jerusalem and remain in prayer, crying out and glorifying the resurrection of the Lord Jesus Christ, who hath raised you from the dead together with him. And ye shall not be speaking with any man, but sit as dumb men until the hour come when the Lord himself suffereth you to declare the mysteries of his Godhead. But unto us, Michael the Archangel gave commandment that we should go over Jordan unto a place rich and fertile, where are many which rose again together with us for a testimony of the resurrection of Christ the Lord. For three days only were allowed unto us who rose from the dead to keep the passover of the Lord in Jerusalem with our kindred that are living for a testimony of the resurrection of Christ the Lord. And we were baptized in the holy river of Jordan and received white rocks robes, every one of us. And after the three days when we had kept the passover of the Lord, all they were caught up in the clouds which had risen again with us. And we were taken over Jordan, and were no more seen of any man. But unto us it was said that we should remain in the city of Arimathea and continue in prayer. These be all things which the Lord bade us declare unto you. Give praise and thanksgiving unto him, and repent that he may have mercy upon you. Peace be unto you from the same Lord Jesus Christ which is the Saviour of us all. Amen. And when they had finished writing all things in the several volumes of paper they arose. And Charinus gave that which he had written into the hands of Annas and Caiaphas and Gamaliel. Likewise Levcius gave that which he had written into the hands of Nicodemus and Joseph. And suddenly they were transfigured and became white exceedingly, and were no more seen. But their writings were found to be the same, neither more nor less, by one letter. And when all the synagogue of the Jews heard all these marvelous sayings of Charinus and Levchius, they said one to another of a truth. All these things were wrought by the Lord, and blessed be the Lord. World without end. Amen. And they went out, all of them in great trouble of mind, smiting their breasts with fear and trembling, and departed every man unto his own home. And all these things which were spoken by the Jews in their synagogue, did Joseph and Nicodemus forthwith declare unto the governor. And Pilate himself wrote all the things that were done and said concerning Jesus by the Jews, and laid up all the words in the public books of his judgment hall. Thanks for listening. Everyone. This has been a listener supported presentation of ancient faith Radio. Christ is risen. He truly is risen. SA."}
