{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":0.24,"end":64.83,"speaker":"Steve","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the Lord of Spirits. The modern world doesn't acknowledge, but is nevertheless haunted by spirits, angels, demons and saints. In our time, many yearn to break free of the of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":64.99,"end":90.51,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, serpent stompers. You are listening to the Lord of Spirits podcast. My co Host, Father Stephen DeYoung is with me from Lafayette, Louisiana and I'm Father Andrew Stephen Damick in Emmaus, Pennsylvania. This is not a live broadcast. It's not Memorex either, but it is nonetheless pre recorded because when this episode releases, I will be across an ocean from where I normally am."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":91.98,"end":95.34,"speaker":"Fr Stephen De Young","text":"Okay, I was going to say because I mean technically you're always across an ocean."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":95.5,"end":99.42,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But from where I. All relative."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":100.14,"end":100.62,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":101.1,"end":172.37,"speaker":"Fr Andrew Stephen Damick","text":"Yes. So many oceans to choose from, really. Yeah. So tonight everybody, we have a hot one. There's probably no subject more subject to pop theology than damnation. Some of you out there were raised with the idea that everyone is born going to hell. Sometimes it's that good people go to heaven forever when they die, but bad people go to hell forever when they die. Sometimes it's a little more complex than that, with some religious involvement being key to heaven forever. And some people think that hell is a temporary problem with forever heaven being everyone's eventual fate. Yet the scriptures speak of eternal condemnation and there is also the resurrection of the body, which is a key Christian dogma. So what is eternal condemnation? What are the biblical images? Is universalism an acceptable orthodox view? It's a hot and spicy episode tonight. So Father Stephen, isn't it true that with really core questions like the nature of damnation, that there are a range of acceptable orthodox views and we could just pick the one that we like best?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":175.09,"end":175.49,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":176.21,"end":179.81,"speaker":"Fr Andrew Stephen Damick","text":"Good night everybody. Haven't done one of those in a while."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":181.33,"end":197.22,"speaker":"Fr Stephen De Young","text":"Yeah, the. I think, you know, I Read your little intro thing. And I think I got the wrong idea because I have, like, this tray of successively spicier hot wings in front of me. I thought we were doing that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":197.22,"end":197.74,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":197.74,"end":199.02,"speaker":"Fr Stephen De Young","text":"When you said it was a hot one."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":199.02,"end":201.9,"speaker":"Fr Andrew Stephen Damick","text":"So you're gonna. As we go, you're gonna taste another wing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":201.9,"end":207.78,"speaker":"Fr Stephen De Young","text":"And that's. That was where I thought we were going. But I'm thinking maybe I read that wrong."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":207.78,"end":212.82,"speaker":"Fr Andrew Stephen Damick","text":"An animated gif of Shaquille o' Neal tasting a spicy hot wing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":216.26,"end":233.41,"speaker":"Fr Stephen De Young","text":"But, yeah, the idea. I mean, we'll get into this more later, obviously, but orthodoxia. Right, right. Or correct opinion or viewpoint or perspective. You can't have multiple ones."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":233.89,"end":245.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's not like the, you know, the details of, like, should you wear high back or low back vestments? Right, right. Where there's variation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":245.49,"end":247.65,"speaker":"Fr Stephen De Young","text":"A matter of orthodoxy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":247.96,"end":249.64,"speaker":"Fr Andrew Stephen Damick","text":"Right, right, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":249.64,"end":271.32,"speaker":"Fr Stephen De Young","text":"That distinction. Right. Like, you could have an infinite number of heterodoxies. Like, by definition, there could be an infinite number of other opinions that are incorrect to varying degrees. But you can't have, like, these two or three conflicting opinions are all correct."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":272.04,"end":273.93,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":273.93,"end":276.05,"speaker":"Fr Stephen De Young","text":"I mean, basic logic."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":276.05,"end":293.09,"speaker":"Fr Andrew Stephen Damick","text":"There can be, as we've pointed out many times, there can be variation in language. You know, like, is man body and soul or is he body, soul and spirit? Well, those are different ways of talking about essentially the same thing. But that's not. That's not what we're talking about here."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":293.17,"end":302.62,"speaker":"Fr Stephen De Young","text":"Yes, but if there is genuine disagreement, where there is genuine disagreement, you could both be wrong. You can't both be right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":302.7,"end":303.1,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":303.42,"end":305.06,"speaker":"Fr Stephen De Young","text":"Equally and in the same sense."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":305.06,"end":309.74,"speaker":"Fr Andrew Stephen Damick","text":"Yes. This is how. Yeah. This is just very, very basic logic."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":309.9,"end":342.2,"speaker":"Fr Stephen De Young","text":"Yes. And this is. This is actually a good way to set the tone for this episode because one of the themes tonight is going to be, this isn't really hard. This isn't really a hard question. This is really simple. You could read scripture, you could read the Father, you could read our hymns. There is no real ambiguity here."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":342.6,"end":343.56,"speaker":"Fr Andrew Stephen Damick","text":"No, there's not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":344.04,"end":345.96,"speaker":"Fr Stephen De Young","text":"There's no real complexity here."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":346.04,"end":354.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Especially like the hypnography. I mean, you really have to work at it to get some kind of ambiguity out of it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":354.84,"end":360.82,"speaker":"Fr Stephen De Young","text":"And that's it. The waters have been muddied by people for various reasons."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":360.82,"end":361.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":361.86,"end":363.7,"speaker":"Fr Stephen De Young","text":"This has been made confusing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":365.62,"end":366.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":366.5,"end":375.86,"speaker":"Fr Stephen De Young","text":"By certain modern theologians deliberately. Not because it's really unclear, but because they don't like what is clear."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":377.38,"end":377.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":378.66,"end":408.24,"speaker":"Fr Stephen De Young","text":"And so things get muddied, people get confused. There are other ambiguities that aren't sort of a result of that kind of deliberate problematizing. Right. There are some that are just the result of a long history of sort of pop theology. Right. As you mentioned, and oversimplifications and that kind of thing. So there are some things that we're going to be disambiguating that are of that nature."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":408.32,"end":424,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And that's basically where we're going to start, because, like, this idea of going to hell when you die, which is, you know, sort of the idea of damnation that a lot of people have in their heads, is actually not Christian teaching. Not really."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":425.12,"end":433.52,"speaker":"Fr Stephen De Young","text":"Right. You know, Christianity does not teach that where bad people go and they die is that they go to a lake of fire and fry."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":434.72,"end":436.8,"speaker":"Fr Andrew Stephen Damick","text":"Wow, that. That rhymed. Very nice."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":437.61,"end":439.69,"speaker":"Fr Stephen De Young","text":"Yes. Well, it might have been a reference to something."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":439.77,"end":444.17,"speaker":"Fr Andrew Stephen Damick","text":"Oh, it also had alliteration, so I really appreciated it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":444.57,"end":468.43,"speaker":"Fr Stephen De Young","text":"Yeah. Yeah. So. Yeah. And what we're trying to do in this episode is not sort of because I'm anticipating certain things. Right. Let's just set them out at the beginning. We're going to be criticized for our tone."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":469.71,"end":470.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":470.59,"end":483.07,"speaker":"Fr Stephen De Young","text":"We're going to be. We're going to be called condescending and flippant. We get the very glib, Matt. Very glib. And we're."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":486.11,"end":488.59,"speaker":"Fr Andrew Stephen Damick","text":"Warning. This podcast includes sarcasm."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":489.15,"end":522.76,"speaker":"Fr Stephen De Young","text":"Yeah. It's so lame, because I know exactly, like, already in advance. No matter what we do, we're going to get accused that we're teaching our own opinion as if it was the teaching of the Orthodox Church, because we're going to disambiguate the teaching of the Orthodox Church, and some people aren't going to like it, and therefore they're going to say, well, that's not the teaching of the Orthodox Church. That's just like your opinion, man. Which it isn't."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":522.76,"end":523.76,"speaker":"Fr Andrew Stephen Damick","text":"I caught that reference."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":525.92,"end":581.21,"speaker":"Fr Stephen De Young","text":"Right. There are these things we're gonna get. There's gonna be appeals to authority with smart people who disagree with this, because we're gonna be. The way we're gonna be presenting it. Call this a trigger warning. Like I said, our goal here is to present the apostolic teaching on this. And so we see people who disagree with that as disagreeing with the apostolic teaching. And so we're gonna get. Yeah, well, so and so disagrees, and he's really smart. You know, whatever. Those are the things to say in advance we're gonna get. And it's not actually gonna be with reference to any argument we make or any data we present or any material we present, if all those things are just based on disagreement."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":581.37,"end":589.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there. There are some, you know, Substantial disagreements that can be made. And we're going to talk about some of that stuff as we go."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":589.85,"end":628.09,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, but, yeah, but, but if you want me to do anything that just kind of like chuckle and treat it as a trophy, your. Your virulent criticism of this episode, you need to actually respond to the content. There we go. Not just take shots at me or talk about how much smarter your guy is in your mind. So. Yeah, so the first big disambiguation we need to make is between Hades and Hell. Sort of."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":628.25,"end":674.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like, on the one hand, these are synonyms in the sense that they both that, like Hades comes out of Greek and Hell comes out of the Germanic languages, and both refer in those pagan contexts to a place, the underworld, you know, where people go when they die, especially, you know, in a pre Christian sense. So in that sense, they really. They are synonyms. And of course, it's why hell is used in the King James Bible, because that is the traditional word for the underworld in Germanic languages like English, you know."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":674.98,"end":725.85,"speaker":"Fr Stephen De Young","text":"Right, right. But in modern English parlance, hell is used to refer to where bad folks go when they die. It's used to refer also to the place where the devil and demons and bad folks go after the Last Judgment. And those two things you, by using the same term, get sort of smushed together. Then you get your. Your added Miltonian notions of the Devil being like the ruler of hell."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":725.85,"end":729.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is, I mean, is frankly kind of pagan."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":730.41,"end":750.26,"speaker":"Fr Stephen De Young","text":"Right. Instead of being confined there. Right. So, yeah, look at the transition. If anybody still doubts me on this Milton thing, look at the difference between the Devil in hell in Milton as romantic figure who'd rather rule in hell than serve in heaven, and the Devil in Dante."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":751.22,"end":753.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":754.02,"end":756.1,"speaker":"Fr Stephen De Young","text":"Who's the prisoner in the deepest pit."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":756.5,"end":759.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's not a lot of time between those two texts."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":762.34,"end":790.1,"speaker":"Fr Stephen De Young","text":"In the grand scheme of things. Yeah, yeah, yeah, yeah. But there's a definite transition there. The way the Devil's viewed and just kind of the popular Christian world, at least in the United States, the Miltonian view is the one that has sort of taken over, despite its sort of ahistoricity of the fact that it's not really reflected in the Bible per se either."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":793.75,"end":793.99,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":796.95,"end":815.11,"speaker":"Fr Stephen De Young","text":"Hades. Right, Hades. And we talked about this in terms of the cosmic geography of the underworld in. I think that was the. That's what we talked about in down to Hades."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":815.11,"end":823.26,"speaker":"Fr Andrew Stephen Damick","text":"Down to Hades. A chthonic. I'm never sure how to pronounce that word. Chthonic odyssey. Yeah, that's Sort of like the geography of the underworld."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":823.82,"end":861.99,"speaker":"Fr Stephen De Young","text":"Right? Yeah. So we talked about the underworld as place with place and scare quotes. Right. Because of course, what do we mean by place? We don't mean like an extension of physical space that you could measure. Right. Like we've gone through this before. This is spatial terms and temporal terms being used sort of analogically. Right. Because of course, the underworld is full of, at least relative to us humans, bodiless beings. Right. That therefore don't have extension in space per se."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":862.07,"end":862.55,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":864.79,"end":890.08,"speaker":"Fr Stephen De Young","text":"We also talked about this a fair amount in our Lord of Spirits Goes to Hell episode where we talked about the harrowing of Hades. We sort of revisited it in some of those places. And so when you look at all of the hymnography surrounding Posca, for example."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":890.08,"end":893.08,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Not one dead remains in the tomb, for instance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":893.08,"end":898.56,"speaker":"Fr Stephen De Young","text":"Right. All the harrowing of Hades language. This is talking about Hades."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":900.13,"end":900.53,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":901.01,"end":921.57,"speaker":"Fr Stephen De Young","text":"Right. This is talking about the place where everyone went with it when. When they died before Christ's harrowing of Hades. And in those episodes, we're not going to go all through it again in detail because we're doing this to disambiguate. This episode is not about Hades. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":921.73,"end":922.13,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":924.94,"end":955.67,"speaker":"Fr Stephen De Young","text":"Remember, for example, that was sort of schematized in the Book of Enoch, that there were these sort of four caves. Right. And one cave was the martyrs and one was the righteous, one was the ignorant, one was the wicked. Right. And the righteous dead sort of had a spring of water in their cave. Right. And that's kind of reflected in the background of the parable of the rich man and Lazarus."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":955.99,"end":956.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":957.59,"end":996.71,"speaker":"Fr Stephen De Young","text":"Where Lazarus is in this place that's very bad. Or the rich man is in a place that's very bad. Lazarus is in Abraham's bosom. He's with Abraham. And since the rich man asks for water, that sort of implies that there's some kind of water where Lazarus is and not where he is. Right. So, and then the idea, of course, the heroic Hades, you could go back to that episode for all the details, is Christ ascends and brings the righteous and the martyrs to paradise."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":997.11,"end":997.51,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1001.03,"end":1004.39,"speaker":"Fr Stephen De Young","text":"And so. Right. Like Hades gets cleared out."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1005.03,"end":1021.7,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, but. But only of the righteous, like, right. The, the wicked and, you know, the, the angels who, you know, left their former estate, they are still changed there, as St. Peter mentions, you know, post resurrection in his epistle."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1022.34,"end":1040.51,"speaker":"Fr Stephen De Young","text":"Right. And part of the no body remains in the grave. Keep in mind there's nothing in the Gospels at least to say that everyone was physically resurrected at that time."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1041.23,"end":1041.63,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1044.35,"end":1044.75,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1045.47,"end":1070.19,"speaker":"Fr Andrew Stephen Damick","text":"I know that's the funny thing is, I've seen some people interpret this as. I mean, we'll get more into this, but as essentially that everybody is saved or whatever based on this. But it's like, well, that's the heroine of Hades. And it does mention that a bunch of people came out of their tombs for a while, but not everybody. And it says it was the saints."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1070.99,"end":1072.43,"speaker":"Fr Stephen De Young","text":"Yeah. And it was only for a while."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1072.51,"end":1079.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it wasn't everybody. I mean, those people all died again. They were essentially resuscitated. They weren't really resurrected in the truest sense."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1080.75,"end":1096.13,"speaker":"Fr Stephen De Young","text":"Right, right. And that's because what that Paschal hymnography is trying to convey, in addition to the harrowing of Hades, is what we talked about last time, about Christ being the firstborn from the dead and the first fruits of the resurrection."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1096.13,"end":1099.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There will be a general resurrection and Pascha participates in that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1100.61,"end":1102.21,"speaker":"Fr Stephen De Young","text":"Right. Is the beginning of it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1102.21,"end":1102.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1103.09,"end":1133.41,"speaker":"Fr Stephen De Young","text":"Right. Is the down payment on it. Right. Christ's resurrection, the sign of it. So. Right. You have that going on. But the problem you just mentioned of how people interpret it is in part because of the idea that Hell or Hades has been sort of equated with the place of ultimate condemnation after the Last judgment."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1133.97,"end":1134.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1135.33,"end":1136.77,"speaker":"Fr Stephen De Young","text":"And these are two different things."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1137.09,"end":1138.33,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1138.33,"end":1179.92,"speaker":"Fr Stephen De Young","text":"Right. So we've done a couple episodes talking about Hades. Tonight's episode is not about Hades. You could also talk about Hades that's sort of Hades as in Scare Quotes place. There's also Hades as sort of experience right after people die. And we've talked about this in terms of what's called the intermediate state. And the reason it's called the intermediate state when you're talking about it theologically is that it's the state of a human soul between their physical death and their bodily resurrection."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1180.32,"end":1196.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We believe in a two stage eschatology, as it's sometimes called. Like, there is an eschatology of what happens to you immediately when you die, and then there's an eschatology of the general resurrection and what happens after that. As long as we're talking in linear temporal terms."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1198.57,"end":1247.46,"speaker":"Fr Stephen De Young","text":"Right. And there is a way in which then paradise and Hades are used as terms to describe that state for different people. For some people, that state is described as paradise. Right. Being in the presence of God, being with Christ, being in Christ, the dead in Christ, our life, being hidden in Christ, and then on the other side as Hades as some kind of negative state. But paradise and Hades as an experience or as a state in which the soul is. And we've talked before on the show about all the problems of how exactly we could imagine that as embodied beings."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1247.86,"end":1248.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1248.82,"end":1280.85,"speaker":"Fr Stephen De Young","text":"Not just accidentally embodied beings, but by nature, embodied beings. Right. What. What that state is like and how one experiences things like time and space when one is no longer embodied. That's not something we could really conceive of. Right. So we use metaphors, but we don't mean that like your force ghost is sitting around somewhere for years and years and years and years and years waiting for Christ's return."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1282.16,"end":1282.72,"speaker":"Fr Andrew Stephen Damick","text":"Right, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1285.04,"end":1323.23,"speaker":"Fr Stephen De Young","text":"That's why I keep using the language of state. Right. State of being, state of existence. Right. Because it's the best sort of vague way to not to help prevent us from over literalizing things in this regard. Really, it isn't even over literalizing, it's over materializing. Right. Thinking of them in material terms. This is. This is a problem too, by the way. And I know because I saw a little bit of feedback on our last episode where we talked about the Ascension, that literal and material are not synonyms."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1324.11,"end":1328.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1328.59,"end":1479.34,"speaker":"Fr Stephen De Young","text":"Like scientific material reality and literal do not mean the same thing. There are lots of things that are literally true that are not statements of scientific materialism. Yeah. So all the things that scripture says about the intermediate state, about paradise and Hades, and how they're experienced by people after the death of the body are all literally true, but none of them are scientific material statements. Those aren't the same thing. And we've talked a little about how in the past about how this relates to the idea of praying for the departed. And I know this has been a sticking point. So a lot of people. For a lot of people too. So we'll spend a little time with it here, and hopefully this will help sort of disambiguate. Right. So what we've said before in a couple of different contexts is following St. John of Damascus, that our bodily life in this material world, Right. In the present age is given to us for repentance. We have mortal bodies so that we can repent. And so beings without mortal bodies, angelic beings, however we want, whatever label we want to use for them, whether they're fallen or unfallen. And humans who. Who have died physically, meaning their souls, were separated from their body, therefore they are not embodied in that state, are not able to repent. And so repentance is sort of confined to this life. And I know this is a hard thing to get your brain around. And I think part of the reason why people have trouble getting their brain around what St. John is saying is the Bad way. We've been taught to think about what repentance is."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1479.9,"end":1511.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. We tend to think of it as how you feel, really. I mean, that's really what it comes down to is. And like, I mean, we've all heard this, right? In confession, people saying, like, I know I'm supposed to forgive, but I just don't. I just can't forgive him. I just can't forgive her. And by that, they don't mean I can't take the 3D world actions not to take revenge, to be reconciled. They mean I can't imagine that I will feel any differently about this."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1512.09,"end":1516.41,"speaker":"Fr Stephen De Young","text":"Right. You know, I can't. There's not a wand I can wave where I don't feel hurt and upset."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1516.65,"end":1517.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1517.37,"end":1518.41,"speaker":"Fr Stephen De Young","text":"About what happened."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1518.41,"end":1518.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1518.89,"end":1521.05,"speaker":"Fr Stephen De Young","text":"It's like, yes, you are right. There is no such."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1521.05,"end":1523.77,"speaker":"Fr Andrew Stephen Damick","text":"Forgiveness is not the opposite of feeling hurt and upset."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1524.49,"end":1712.44,"speaker":"Fr Stephen De Young","text":"Yes, yes. And I'll just go ahead. This is my one. So part of what's happened in our society, and this actually started in evangelical Christianity, and it spread outward to the rest of the. Again, this is where I live, so I have to mainly speak about American culture. But since we export our American culture imperialistically to the rest of the world, it's probably true a lot of other places, too. So obviously, one of the things we've talked about a lot is the difference between the contemporary idea, or even the historic Protestant idea of faith and the idea of faithfulness and how that concept of faith is the direct result of having sort of having set up a dichotomy between it and works. Yeah, right. So when you set up a dichotomy, you can't set up a dichotomy between faithfulness and works. Right. Like it doesn't work. Pardon the pun. But if. When you set up that dichotomy, when you remove works from faith so that faith is a thing, and then works is another thing that is somehow related to it, and then you can argue about how they're related, but it's a separate thing. Then essentially, what. What faith becomes is intellectual ascent plus feelings, plus feelings of love, loyalty, whatever, Right. That grow out of that intellectual ascent as evangelical Christianity, at least here in the United States, has evolved over time, slowly but surely, the actual content of faith, meaning the propositions to which you have to give intellectual assent have dwindled down and dwindled down and dwindled down and dwindled down. Right. You look at, like a historic Calvinist or Lutheran or. Right. Even Methodist Church. Right. And old school Baptist Church. There are A whole list of things that you have to sign on for. Right. That you have to give your intellectual assent to in their minds. Right. But those have dwindled down and down now to the point where a lot of non denominational evangelical churches, it's like you have to believe in Jesus."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1713.24,"end":1713.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1715,"end":1747.63,"speaker":"Fr Stephen De Young","text":"And that he. He died for you. And beyond that, even who Jesus was or is and what it means that he died for you and how that worked are up for grabs. Right. So what happens when you take away. When you have something that's a combination of intellectual ascent and feelings. Right. Essentially. And you take away the propositions to which you have to assent is you're mainly left with feelings."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1750.75,"end":1751.15,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1752.51,"end":1788.34,"speaker":"Fr Stephen De Young","text":"And so faith primarily becomes about these sort of feelings of attachment. And that's been opposed to works. And this plays out in all of these places in society. I've talked before, like, all the woke stuff that people get so mad about online is just atheistic Protestantism. It's just I need to publicly give my ascent to certain propositions. Right. That mark me out, is a good person."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1788.42,"end":1788.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1788.78,"end":1790.5,"speaker":"Fr Stephen De Young","text":"Then you're one of the elect."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1790.66,"end":1791.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1791.3,"end":1811.31,"speaker":"Fr Stephen De Young","text":"Yeah. But one of the ways, one of the ways, one of the horrible ways this has actually worked out in our modern society with the feelings thing is empathy. Yes. Father Steven DeYoung is now going to speak against empathy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1812.43,"end":1814.83,"speaker":"Fr Andrew Stephen Damick","text":"I don't think anyone who knows you would be shocked about this."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1815.07,"end":1840.37,"speaker":"Fr Stephen De Young","text":"Well, this is true. But empathy is mostly worthless. Okay. The person who comes to you and needs food doesn't care if you feel his pain. He doesn't actually want you to sit next to him and be with him in his suffering. Right. He wants you to give him food."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1841.41,"end":1853.18,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think most of the people who want the empathy, their lives in terms of like their needs and their suffering, their lives are probably pretty good most of the time."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1855.34,"end":1895.11,"speaker":"Fr Stephen De Young","text":"Yes. Actually doing things has value. Right. Thoughts and prayers, tweets that you're thinking of someone. Right. Don't help them. Helping them helps them. Calling them and spending time talking to them if that's what they need. Again, actually doing it helps them not just having general good feelings toward them. Right. And so repentance likewise has been sort of reduced to feeling. Well, I feel really bad about it. That's repentance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1895.19,"end":1898.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. No, it needs to be change. You got to make change."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1899.73,"end":1906.37,"speaker":"Fr Stephen De Young","text":"Yes. And our definition of an unrepentant sinner now is someone who doesn't feel bad about it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1906.85,"end":1911.89,"speaker":"Fr Andrew Stephen Damick","text":"Hmm. Yeah. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1912.21,"end":1914.77,"speaker":"Fr Stephen De Young","text":"And gone is actually doing anything."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1917.17,"end":1931.3,"speaker":"Fr Andrew Stephen Damick","text":"I think like one of the. And people. Hijack, stuff from the scripture to kind of back this up. Right. For instance, there's scriptural language about doing things with your whole heart. That doesn't mean that you feel it really big."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1932.66,"end":1933.02,"speaker":"Fr Stephen De Young","text":"No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1933.02,"end":1939.54,"speaker":"Fr Andrew Stephen Damick","text":"That means that you're. If someone observed you, they could see, oh, yes, he's really doing it, you know?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1939.7,"end":1941.7,"speaker":"Fr Stephen De Young","text":"Yes. And you're doing it intentionally."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1941.7,"end":1945.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like if someone's digging a ditch half heartedly, that means they're barely digging."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1946.1,"end":1953.7,"speaker":"Fr Stephen De Young","text":"Yes, yes. If I walk by someone and happen to drop my water bottle, that's not the same as giving them water."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1954.67,"end":1954.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1955.71,"end":1957.39,"speaker":"Fr Stephen De Young","text":"Right. You have to do it intentionally."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1957.95,"end":1958.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":1959.31,"end":2002.92,"speaker":"Fr Stephen De Young","text":"Right. But so, yeah. And, and so repentance is not just about you feeling guilty. It's not about. It's definitely not you feeling bad about the consequences of your actions and wanting to get out of them. But then you have this whole. And this is destructive in the case of repentance because people get lost in this sort of psychoanalytic maze. Right. Of, oh, am I really repentant? I don't know. Is it just because of the consequences?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2003,"end":2004.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2004.08,"end":2007.72,"speaker":"Fr Stephen De Young","text":"Am I trying to. Do I really feel bad about it? Do I feel bad enough about it?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2007.8,"end":2018.08,"speaker":"Fr Andrew Stephen Damick","text":"Right. And then they often think, wow, you know, I'm in danger of hellfire. Related, you know, related to this episode because I don't feel all the right things."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2019.28,"end":2019.68,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2019.76,"end":2106.26,"speaker":"Fr Andrew Stephen Damick","text":"I, you know, as a, as a really interesting anecdote. So, you know, I don't know that I've mentioned on this show, but like, one of the projects that I'm working on is a documentary related to my pilgrimage to Lithuania called the Wolf and the Cross. Couple episodes out, everybody listen to it. But one of the things that will show up in episode three, which as of now has not been released yet, is a poem written by Saint Athanasius of Brest when he was thrown into prison by the uniats. And a friend of mine who's in Lithuania not only dug this up, but translated it for me from what's called Old Chancery Slavonic. And if you read it, there's parts where he's sort of blessing his enemies and then there's parts where he's super mad at his enemies and like condemning them. And, you know, like, you read and it's like, okay, this is a guy who has all kinds of feelings. Some are beautiful and kind and tender. Others are really like, he's not doing well. He seems to be pretty depressed, but it's clear that he's a saint. It's not just because they shot him in the head and dumped him in the ground when he didn't die. Buried alive. Although that did happen. But, you know saints, or Saint David, right. In the Psalms, there's some pretty serious depressed feelings going on in some of the psalms. It doesn't mean he's not repenting."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2107.54,"end":2115.86,"speaker":"Fr Stephen De Young","text":"Right, Right. Yeah. Feelings are epiphenomenal. They have value only if they're related to your actions."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2115.94,"end":2117.1,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2117.1,"end":2185.1,"speaker":"Fr Stephen De Young","text":"Without actions, they're valueless. Right. Someone in your community has a spouse pass away. Right. You sitting in your house and feeling bad for them does nothing for them. You making some food and bringing it to their house does something for them. You actually doing something for them. Right. And you doing that for them and going over there with the food and eating the food with them. There will be feelings and emotions that will come along with that and that you'll share, but those will be valuable because they're accompanying what you're actually doing. Yeah, they aren't valuable, just sort of in abstraction, in and of themselves. Right. So on the one side, yeah, it's not. Repentance is not about how you feel. So when we say that demonstration can't repent, we don't mean demons can't be like, man, this stinks. I'm going to be confined to a lake of fire for all eternity."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2185.1,"end":2190.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Maybe I should change my mind. I mean, right? We don't know what it's like to be a demon."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2191.26,"end":2207.83,"speaker":"Fr Stephen De Young","text":"Right. We've got. I mean, yeah, but I mean, there's the scene right in First Enoch where the watchers are like, hey, Enoch, God likes you. Can you go put in a good word for us? Maybe get us out of this punishment a little early? Right. That's not repentance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2207.83,"end":2216.31,"speaker":"Fr Andrew Stephen Damick","text":"No. And even the rich man and Lazarus, there's not any repentance in any of the things he says. He just doesn't like to suffer."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2216.95,"end":2227.27,"speaker":"Fr Stephen De Young","text":"Yeah. He's just like, yeah, I don't like this suffering. And, hey, I like my family enough that I don't particularly want them to suffer like this. But that's not repentance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2227.65,"end":2227.89,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2230.21,"end":2242.45,"speaker":"Fr Stephen De Young","text":"Right. That's not repentance. So we're not saying that somehow being outside the body means you can't have certain feelings or think certain thoughts. Of course you can."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2242.45,"end":2243.81,"speaker":"Fr Andrew Stephen Damick","text":"We don't know. Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2244.13,"end":2245.57,"speaker":"Fr Stephen De Young","text":"Yeah. That's not repentance, though."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2245.73,"end":2246.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2248.85,"end":2318.03,"speaker":"Fr Stephen De Young","text":"And it's also not about making God not mad at you. Right. Repentance is not something you do. And this is more maybe from another perspective, this may come. Well, this is another thread in Western Theology, let's just say, because there's various Western groups that are more on this side where it's, you have sinned, you have broken one of God's rules. Right. Therefore he's quite irate and he's gonna send you to hell unless you do whatever is required. Right. Usually involving just asking for forgiveness, but sometimes doing that in a context. Right. Then if you do that, then you're off the hook. Right. And God's not mad at you anymore. That also is not repentance. There is nothing that we do in the church that changes God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2319.23,"end":2329.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or in the somewhat amusing to me, but really on point words of Metropolitan Erosios Vlacos, God does not need therapy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2330.19,"end":2382.96,"speaker":"Fr Stephen De Young","text":"Yeah. He does not need to change and doesn't and isn't going to. So this is the difference between liturgy and prayer on one hand and magic on the other. We aren't trying to change God. God doesn't need to change. The Father in the parable of the prodigal Son, always loves his son and is always waiting for him to come home. Even though disrespected by his son pretty abominably and abandoned, etc, etc, he never gets angry at his son and throws him out or puts some barrier in the way of him coming back."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2383.68,"end":2384.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2384.96,"end":2424.46,"speaker":"Fr Stephen De Young","text":"Right. So this has nothing to do with repentance, has nothing to do with changing God. Repentance is about when you sin, you do damage to yourself and to other people and to the world around you. And repentance is you doing everything you can to repair the damage you've done and to heal it, both to yourself, to other people and to the world around you. That's what repentance is. That kind of requires a body."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2425.42,"end":2426.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because you have to do stuff."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2427.74,"end":2428.86,"speaker":"Fr Stephen De Young","text":"You have to do stuff."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2430.62,"end":2431.02,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2431.02,"end":2441.83,"speaker":"Fr Stephen De Young","text":"And demons can't directly do stuff in the world, and humans after the physical death, can't directly do stuff in the world."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2444.63,"end":2445.91,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2446.23,"end":2497.04,"speaker":"Fr Stephen De Young","text":"They can't. Not only can they not roll back the clock and not do the things they did. Right. They can't go and apologize, they can't make amends. They can't anymore. Right. They can't make restitution anymore. That's why we say repentance is impossible, because of what repentance really is. And so as we've mentioned before, in terms of prayers for the departed, they're not able to repent. And so in a sense we repent for them. Right. And so we offer our prayers to God as instruments that God can choose to use to grant forgiveness and Healing to that person."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2497.44,"end":2511.68,"speaker":"Fr Andrew Stephen Damick","text":"Right. And if someone thinks, well, you know, that shouldn't count. Why should your repentance count? You know, God chooses to use it for your salvation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2512.32,"end":2512.72,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2513.12,"end":2514.8,"speaker":"Fr Andrew Stephen Damick","text":"It's all mercy. It's all mercy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2514.8,"end":2545.36,"speaker":"Fr Stephen De Young","text":"And why wouldn't it count? Because again, the problem is not how the departed person feels. The problem is not that God is angry with the departed person. God loves the departed person. So if someone has sinned against me and dies and I pray to God and I say, I have forgiven this person, please forgive this person their sins, please. Why shouldn't that count as repentance?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2545.44,"end":2545.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2548.48,"end":2557.76,"speaker":"Fr Stephen De Young","text":"Or if someone I love has done something I know and I go and in their name try and fix it in the world, why would that not quote, unquote, count?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2559.52,"end":2564.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because it's a legalistic view, you know, or a sort of a financial view."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2564.32,"end":2596.05,"speaker":"Fr Stephen De Young","text":"You know, if you have a correct view of repentance. Right. I find out my departed loved one swindled somebody and I go and I give the money back to that person and make that person whole and apologize on their behalf. Right. And heal that. And I, and the person my loved one swindled pray and ask God to forgive that person. Right. Like, again, I don't understand why this is complicated."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2596.05,"end":2597.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2597.97,"end":2601.21,"speaker":"Fr Stephen De Young","text":"So other than we have a weird messed up view of what? Repentance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2601.21,"end":2601.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2602.29,"end":2603.17,"speaker":"Fr Stephen De Young","text":"Which we do."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2603.73,"end":2613.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah. And so, I mean, so all this is relevant because none of this applies to people who are in internal condemnation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2614.53,"end":2619.33,"speaker":"Fr Stephen De Young","text":"Because all of this is talking about people who are in that intermediate state."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2619.73,"end":2620.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2620.21,"end":2621.25,"speaker":"Fr Stephen De Young","text":"During this age."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2621.33,"end":2621.77,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2621.77,"end":2623.25,"speaker":"Fr Stephen De Young","text":"Because that's when we're doing the praying."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2623.4,"end":2633.32,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. So it's not about quote, unquote, praying people out of hell. If, if, if, if hell is your own, it means eternal condemnation to you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2634.52,"end":2656.85,"speaker":"Fr Stephen De Young","text":"Right. You know, so you could say, well, wait, are, are people who are experiencing eternal life going in the age to come going to pray for those experiencing eternal condemnation in the world to come? I'm going to be like, what? So, like there's literally nothing speaking to that anywhere in scripture or our tradition."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2656.93,"end":2659.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. That's not what it's about."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2660.61,"end":2661.01,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2663.89,"end":2664.25,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2664.25,"end":2666.61,"speaker":"Fr Stephen De Young","text":"And we definitely. This is going to be a cheap shot."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2666.85,"end":2667.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2667.65,"end":2670.61,"speaker":"Fr Stephen De Young","text":"But it's kind of an important cheap shot."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2670.93,"end":2671.89,"speaker":"Fr Andrew Stephen Damick","text":"An important cheap shot."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2671.89,"end":2686.12,"speaker":"Fr Stephen De Young","text":"We don't in the Orthodox Church have Thomas Aquinas thing about how people enjoying eternal life in the world to come are going to be more happy because they're going to watch the people suffering in eternal condemnation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2686.68,"end":2691.08,"speaker":"Fr Andrew Stephen Damick","text":"If I didn't know that was True. I would not imagine that it was true that he actually said that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2691.64,"end":2701.16,"speaker":"Fr Stephen De Young","text":"Well, so we got to give the qualifiers. It's from Tertius Partus, it's based on his notes. He didn't actually write it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2701.9,"end":2702.14,"speaker":"Fr Andrew Stephen Damick","text":"And."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2702.38,"end":2704.42,"speaker":"Fr Stephen De Young","text":"And right at the end, et cetera, et cetera, et cetera."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2704.42,"end":2710.62,"speaker":"Fr Andrew Stephen Damick","text":"And at the end of his life, didn't he say, yeah, I got a lot of stuff wrong, but."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2710.7,"end":2713.74,"speaker":"Fr Stephen De Young","text":"Well, that this was after that. But it was from his note. He didn't finish it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2713.74,"end":2715.26,"speaker":"Fr Andrew Stephen Damick","text":"Oh, I see. Okay. Okay."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2715.42,"end":2728.3,"speaker":"Fr Stephen De Young","text":"Right. So they did it from his notes. Had he lived, he might have edited that out or said something different or framed it somehow or whatever. But Nietzsche and everyone else has been quoting that for a couple hundred years now."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2728.3,"end":2730.33,"speaker":"Fr Andrew Stephen Damick","text":"So it's been received as a thing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2730.89,"end":2734.17,"speaker":"Fr Stephen De Young","text":"That is no part of. I'm just saying that's no part of orthodox tradition."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2734.17,"end":2734.61,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2734.61,"end":2739.49,"speaker":"Fr Stephen De Young","text":"If Roman Catholics want to come to me and say, that's no part of Roman Catholic tradition, I'll be happy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2739.49,"end":2740.21,"speaker":"Fr Andrew Stephen Damick","text":"We rejoice."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2740.21,"end":2741.29,"speaker":"Fr Stephen De Young","text":"I'll say, good."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2741.37,"end":2744.65,"speaker":"Fr Andrew Stephen Damick","text":"Yes, good. This is when we're together on this."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2744.89,"end":2745.37,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2745.37,"end":2754.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So, yeah. So, okay, we've spent this whole half disambiguating what does happen to Hades, you know?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2754.29,"end":2754.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2754.91,"end":2755.39,"speaker":"Fr Andrew Stephen Damick","text":"Long term."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2755.63,"end":2831.89,"speaker":"Fr Stephen De Young","text":"So. So Hades, the underworld, that intermediate state, however we want to talk about it, whether we want to talk about it as the underworld and those kind of quasi spatial terms or the intermediate state and sort of quasi temporal terms, this is part of the present age, the current creation. Right. This world over against the world to come. Right. And so it is something that is destroyed at the last judgment. And actually, actually, though, a lot of people, I don't think, have really thought this through. Both what we call heaven and what we call hell in our common sort of modern American parlance. Right. These intermediate state places, right. Cease to exist because there's going to be a new heavens. Right. It's not just a new earth, but a new heavens. Notice, though, so there's a tripartite division in the Scriptures. There's the heavens, the earth, and under the earth, right? The underworld. Notice there's a new heavens and a new earth. There's no new underworld."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2832.61,"end":2835.2,"speaker":"Fr Andrew Stephen Damick","text":"How about that? No basement."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2836.24,"end":2848.48,"speaker":"Fr Stephen De Young","text":"Right. So there's sort of a contrast here, right? Isaiah 24:21, for example, talks about the purification of the heavens."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2854.08,"end":2867.53,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep. It says on that day the Lord will punish the host of heaven in heaven and the kings of the earth on the earth. So there's a justification going on."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2868.73,"end":2886.97,"speaker":"Fr Stephen De Young","text":"Right. And this is dealing with the spiritual powers, right? The evil spiritual powers. Right. So then there's a new purified heavens. Right. Purified of them and new earth. But then in terms of Hades, you get Revelation 20:14."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2888.56,"end":2895.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which says, then death and Hades were thrown into the lake of fire. This is the second death, the lake of fire."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2898.48,"end":2967.01,"speaker":"Fr Stephen De Young","text":"So Hades gonna be gone. Right. So this is the ultimate disambiguation. Right. We're talking about what comes next tonight. We're talking about after the day of the Lord, after the last judgment, after the resurrection of all the dead, after the glorious appearing of Christ, what comes after that for those who experience condemnation. And even though we're using the eternal condemnation language in the biblical idiom, this is the condemnation of the age to come. Literally, the condemnation of the age, meaning the age to come, not this age. Right. So these are two different things. And as we said back at the beginning of this first half, if you want more on Hades and the underworld and this age and the harrowing thereof, we've done a couple episodes about that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2967.01,"end":2967.57,"speaker":"Fr Andrew Stephen Damick","text":"There we go."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2967.57,"end":2983.01,"speaker":"Fr Stephen De Young","text":"So now the rest of tonight's episode is going to be about that eternal condemnation, that condemnation of the age to come, the people who opt out of eternal life and the new heavens and the new earth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2983.73,"end":2988.93,"speaker":"Fr Andrew Stephen Damick","text":"All right, that said, we'll be right back with the second half of this episode of the Lord of Spirits."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":2990.05,"end":3088.7,"speaker":"Steve","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord, Lord of Spirits. Give them a call at 855-237-2346. That's 8555-AF-RADIO. Hi, this is Father Evan Armitas. Jesus last words to his disciples were, go and make disciples of all the nations. Unfortunately, many parishes are struggling to follow this commandment. In my new book, Reclaiming the Great Commission, I offer a roadmap to help us get back on track. Drawing from my 20 years of par holy scripture and insights from research and visits with churches across the United States, I discuss how you and your community can implement changes that will transform, revitalize, and renew your parish. You'll learn how to diagnose and remove the barriers you face, deal with resistance to change, define what a healthy parish looks like, lead with purpose, and create a parish health plan. Written for clergy, council members, ministry leaders, small groups, and all committed parishioners, this book will help any church in its journey to reclaim the Great Commission. Reclaiming the Great Commission is now available in paperback, ebook, and audiobook@store.ancientfaith.com that's store.ancientfaith.com we're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3091.5,"end":3102.58,"speaker":"Fr Andrew Stephen Damick","text":"Hey, welcome back, everybody. It's the second part of the show. This is a pre recorded one, so don't call. Or if you do call. I mean, who knows what will happen?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3102.58,"end":3104.66,"speaker":"Fr Stephen De Young","text":"But yeah, let us know what happens."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3104.66,"end":3117.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I'm kind of curious. But yes, we will not be taking your calls because again, I am across an ocean from where I normally am. Father Stephen still living in his swamp."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3118.94,"end":3120.7,"speaker":"Fr Stephen De Young","text":"Not one of those low grade oceans."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3120.7,"end":3123.1,"speaker":"Fr Andrew Stephen Damick","text":"That's right. One of the big ones."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3123.5,"end":3125.98,"speaker":"Fr Stephen De Young","text":"One of the big ones, yeah, yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3125.98,"end":3131.02,"speaker":"Fr Andrew Stephen Damick","text":"The one that has Atlantis underneath it somewhere. Okay, so."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3131.18,"end":3132.54,"speaker":"Fr Stephen De Young","text":"Or does it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3132.62,"end":3137.66,"speaker":"Fr Andrew Stephen Damick","text":"Anyway, find out on another episode."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3137.98,"end":3140.17,"speaker":"Fr Stephen De Young","text":"Yeah, on a completely different episode of Lord of Spear."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3140.32,"end":3144.48,"speaker":"Fr Andrew Stephen Damick","text":"That would be, that would be fun actually to do an Atlantis episode."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3144.72,"end":3147.64,"speaker":"Fr Stephen De Young","text":"Well, that would just be a flood episode with an Atlantis section."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3147.64,"end":3192.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, of course, of course. But you know. Yeah, because I read all that stuff, like the stuff that's in Plato and so forth. I read that for a paper that I was working on a number of months back and, and boy, it's fun. And there's. Yeah, there's giants in the Greek version too, so that's great. But that's not what we're talking about in this particular episode. We've just disambiguated where people go when they die in this age with the life or death, as it were, of the age to come. And we're talking about the death of the age to come, in particular the eternal condemnation, the condemnation of that age, the age that has no end."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3193.77,"end":3201.29,"speaker":"Fr Stephen De Young","text":"And so, yeah, so there's. And specifically we're talking about what, the biblical language, what language is the New Testament use?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3201.77,"end":3235.37,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, a lot of people like to think that the Old Testament is the fire and brimstone part of the Bible. But it turns out there's language for eternal condemnation in the New Testament. And it's some pretty frightening imagery. It's images that don't all like work with each other as images. Like you can't really super combine them. I mean, there's some combinations you can make, but it's really about different angles from which to describe an experience that is very difficult to describe."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3236.89,"end":3241.77,"speaker":"Fr Stephen De Young","text":"And you're not supposed to like it or be comfortable with it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3242.41,"end":3243.93,"speaker":"Fr Andrew Stephen Damick","text":"And that's kind of the point."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3244.49,"end":3272.12,"speaker":"Fr Stephen De Young","text":"Yeah. The purpose of the language, Right. Is to present this as a terrifying possibility to motivate you to be avoided. Yeah, right. That's sort of the whole point. And cards on the table. The main reason we're focusing on the New Testament is that most of the people who disagree with the apostolic teaching on this point are at least a little bit Marcionite."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3272.76,"end":3278.28,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're like, oh, that's the Old Testament. And that doesn't really apply now."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3278.28,"end":3280.12,"speaker":"Fr Stephen De Young","text":"Grumpy Old Testament God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3283.4,"end":3288.28,"speaker":"Fr Andrew Stephen Damick","text":"Which, you know, if you think that. Welcome to the Lord of Spirits podcast, because obviously the first episode."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3289.08,"end":3336.41,"speaker":"Fr Stephen De Young","text":"Right. But so just. Just for the sake of laying this out clearly. Right. And laying out that it is the apostolic teaching since, you know, the apostles produced the New Testament where. Focusing on the New Testament in this half. Not to say we won't mention anything from the Old Testament, but we're focusing on the New Testament in this half to show, oh no, it's the good loving New Testament God who everybody claims to. Like, who is saying these things and setting out this terrifying possibility. I was tongue in cheek there about there being a different New Testament God. Just to clarify, sometimes we have to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3336.73,"end":3338.01,"speaker":"Fr Andrew Stephen Damick","text":"Someone's going to clip that out."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3339.93,"end":3346.01,"speaker":"Fr Stephen De Young","text":"Right? Right. No, I am opposed to the Marcianism that results from the other view."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3346.01,"end":3349.13,"speaker":"Fr Andrew Stephen Damick","text":"Wait, what? After 200 hours of the Lord of."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3349.13,"end":3389.02,"speaker":"Fr Stephen De Young","text":"Spirits podcast, I hope that should be moderately. Depending on how salty I feel in the third half, I may express just how much disdain I have for that particular view. But for now, one of the sort of primary images for eternal condemnation is the lake of Fire. And that sort of a hackneyed over materialized version of that stands behind, I think, sort of the. The popular contemporary perception of hell."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3389.02,"end":3402.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You know, like what I like to call, you know, far side eschatology, where depictions of hell are always like people standing in kind of like lava pits, you know, with flames coming out of the ground. And usually there's some kind of getting."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3402.58,"end":3404.46,"speaker":"Fr Stephen De Young","text":"Around in a bunch of fire. Getting poked with pitchforks."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3404.46,"end":3413.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Demon with a pitchfork or a trident. Yeah, yeah. Usually tridents. I've noticed they talk about pitchfork pitchforks, but they always draw tridents."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3414.31,"end":3419.43,"speaker":"Fr Stephen De Young","text":"So go figure. Are they. Is it a. Is it a Neptune thing?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3419.59,"end":3426.47,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. I mean, I own. I own an actual pitchfork, but I do not own a trident."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3428.55,"end":3431.51,"speaker":"Fr Stephen De Young","text":"Now, if it has more than three, it's technically not a trident."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3431.59,"end":3432.31,"speaker":"Fr Andrew Stephen Damick","text":"That's true."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3433.27,"end":3439.95,"speaker":"Fr Stephen De Young","text":"Sometimes you get these things that look kind of like tridents, but have five quadrant by definition. Not a trident."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3439.95,"end":3450.27,"speaker":"Fr Andrew Stephen Damick","text":"Pentadent. Pentadent, I don't know, literally means three teeth. Trident. Three Teeth. There's some etymology for you, everybody. Good night."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3452.43,"end":3453.87,"speaker":"Fr Stephen De Young","text":"Father Andrew's work is done here."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3454.59,"end":3455.23,"speaker":"Fr Andrew Stephen Damick","text":"Exactly."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3457.47,"end":3508.04,"speaker":"Fr Stephen De Young","text":"So, yeah. But the Lake of Fire is not meant to convey that imagery. A lake of fire is. Imagine a lake, a big depression in the earth, and it's full of fire. So this isn't a cave with some fire in it. It's not the fire caves of Bajor. It's not. It's. Right. And so the imagery is of being thrown into a fire, not a place that has some fire in it. The Lake of Fire image isn't found in the Old Testament, per se. Daniel 7, which we've come back to many times with the enthronement of the Son of Man, when it talks about the Judgment, describes a River of fire."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3511.4,"end":3516.44,"speaker":"Fr Andrew Stephen Damick","text":"Which is not at the Judgment, not the Cuyahoga river in Cleveland, much to my surprise."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3518.28,"end":3519.72,"speaker":"Fr Stephen De Young","text":"Although it has been ablaze."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3519.88,"end":3520.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3520.93,"end":3549.82,"speaker":"Fr Stephen De Young","text":"On occasion. So this is a hypothesis, because as we're going to talk about, the Lake of Fire imagery shows up in other Second Temple Jewish literature. Hypothesis that there is a connection between this river of Fire and Daniel and the Lake of Fire. The idea being the river pools into a lake."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3549.98,"end":3550.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3552.38,"end":3556.22,"speaker":"Fr Stephen De Young","text":"It seems odd that river of Fire and Lake of Fire would be completely disconnected."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3556.78,"end":3557.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3557.26,"end":3568.46,"speaker":"Fr Stephen De Young","text":"Especially since the main place where we see the Lake of Fire imagery is the Book of Enoch, which is obviously influenced by daniel7 in a bunch of places."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3568.46,"end":3569.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3569.1,"end":3680.38,"speaker":"Fr Stephen De Young","text":"Related to the Son of Man and other things. Right. So there is likely a relationship there, but we don't have the data to, like, conclusively show. So this is just sort of an Occam's Razor thing, that those are probably related. But we do get this imagery of the Lake of Fire in First Enoch. It's the place where the watchers get chucked for their sin and wickedness. Right. It's Tartarus. It's the abyss. It's the deepest part of the underworld. Right. It's the horrible place of punishment for demonic powers. And so when the Lake of Fire comes up in the New Testament, it's also kind of unsurprising that it's in the two books of the New Testament that are most influenced by the Book of Enoch. Those being the revelation of St. John and St. Matthew's gospel, the Book of Revelation, it comes up, of course, as you might expect, at the end. And just like in. And specifically in Revelation 19, 20, 20, verse 10 and verses 14 and 15 of chapter 20 in that context, much like first Enoch. Right. Death, Hades, as we read in the last half the Beast, the false prophet, the devil. Right. All of those demonic power all get chucked into the. Into the lake of fire also. However, along with them are those who received the mark of the beast, meaning those who. Those humans who joined with the demonic powers, who allied themselves with the demonic powers. Their rebellion against and hatred of God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3680.46,"end":3690.06,"speaker":"Fr Andrew Stephen Damick","text":"Wait, are you saying it's not people who have credit cards or people who get some kind of medical intervention? Same medical intervention that we're not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3692.3,"end":3713.41,"speaker":"Fr Stephen De Young","text":"Just say it. Once again, the mark of the beast. If you read Revelation, the mark of the beast is talked about in tandem with a mark of Yahweh, a mark of the Lord. Whatever you say the mark of the beast is, there has to be a corresponding one for faithful Christians."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3713.57,"end":3714.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3714.53,"end":3725.85,"speaker":"Fr Stephen De Young","text":"So if it's a barcode tattoo, then there's going to be some kind of divine QR code issued by the church on people's foreheads."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3725.85,"end":3730.83,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It turns out, everybody, it's actually about what you do. Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3731.31,"end":3766.53,"speaker":"Fr Stephen De Young","text":"Yeah. So, yeah. So unless your proposal, anybody who proposes X is the mark of the beast to you, you have to say, okay, is there a holy X that stands in contrast to it? Right. So is the church issuing a different vaccine? Is. Right. So otherwise it can't be the mark of the beast. Things can be bad without being the mark of the beast also. Yes, yes. Not everyone you disagree with is Hitler."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3766.69,"end":3779.33,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And my favorite from recent years is there's now something called the forerunner to the mark of the beast, which I'm like, is that a theological category now? Because I don't know."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3782.29,"end":3786.96,"speaker":"Fr Stephen De Young","text":"Yeah. Again, things can be bad without being the mark of the beast."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3786.96,"end":3787.44,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3787.84,"end":3812.32,"speaker":"Fr Stephen De Young","text":"You don't have to. It's not all or nothing. Two things can be bad. But as I mentioned, the lake of fire language is also used in Matthew, specifically Matthew 25:41. And this is the last verse. This is the end of the parable of the sheep and the goats."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3814.07,"end":3831.99,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Where you get, Jesus says. I mean, again, this is Jesus speaking, by the way, everybody. Then he will say to those on his left, depart from me, you cursed, into the eternal fire to prepare it for the devil and his angels."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3834.47,"end":3853.68,"speaker":"Fr Stephen De Young","text":"Now this is important because notice he says that the fire is prepared for the devil and his angels. The devil and his messengers, meaning not for humans."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3856.8,"end":3857.24,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3857.24,"end":3917.01,"speaker":"Fr Stephen De Young","text":"The purpose of the Lake of Fire was not for humans, say humans, that God hated and created to be vessels of his wrath. Sorry, Calvinists. Right. But for the devil and his angels. Right. So as in Revelation. Right. The humans who end up there, it's like, it's because they've decided to sign on with the devil and his angels. The devil and his messengers. That's how they. They end up there. So what is this fire? Right? Well, we're not. We're not talking about, like, obviously material fire, as we mentioned, with the far side thing. Right. This isn't like people are literally. I mean, it is after the bodily resurrection, but it's still not a literal place. Literal material place of literal material fire where people are set on fire."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3917.31,"end":3920.43,"speaker":"Fr Andrew Stephen Damick","text":"Wait, I'm not supposed to get my eschatology from Jack Chick tracts either?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3921.47,"end":3923.87,"speaker":"Fr Stephen De Young","text":"No, because it's funny."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3924.43,"end":3948.57,"speaker":"Fr Andrew Stephen Damick","text":"I now have, thanks to a very kind listener of the Areopagus podcast, I have in my studio a complete set of all the currently in print Jack Chick comics. And whenever he depicts Hal, I mean, that's what it always is. Big flaming space with demons with pitchforks who are really happy to see you and stabbing you in the butt. You know, it's amazing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3949.37,"end":3972.57,"speaker":"Fr Stephen De Young","text":"I mean, that would be. That would be a kind of hell for them, I imagine, because it would have to get boring. But. But yeah, as we mentioned, in the contrast between Dante and Milton, the answer to the question, who's the boss?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3974.33,"end":3976.05,"speaker":"Fr Andrew Stephen Damick","text":"Angela is the boss in hell in."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3976.05,"end":3979.93,"speaker":"Fr Stephen De Young","text":"Eternal condemnation is not Angela or Samantha or Mona."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3979.93,"end":3980.97,"speaker":"Fr Andrew Stephen Damick","text":"Definitely not Tony."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3981.53,"end":3987.53,"speaker":"Fr Stephen De Young","text":"Definitely not him. The answer is nobody. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3987.69,"end":3997.37,"speaker":"Fr Andrew Stephen Damick","text":"Because it says in the scripture that all those who get tossed into. All those who get tossed in the lake of fire are tormented forever and ever."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":3998.17,"end":4040.81,"speaker":"Fr Stephen De Young","text":"Right. And it was prepared specifically for the devil and his angels to be tormented forever and ever there. Right? That's what we're told. That's what it says by scripture. So he's not in charge there. Right. And the reason I'm emphasizing this is not just we have this wrong idea in our head due to Milton, but people have this idea in their head and again, cards at the table. We're going to be going after universalism head on in the third half. Okay, Huzzah. People will act as if, if some person ends up experiencing eternal condemnation, that somehow the devil has won."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4041.85,"end":4042.25,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4042.25,"end":4043.61,"speaker":"Fr Stephen De Young","text":"The devil has claimed this person."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4043.77,"end":4048.33,"speaker":"Fr Andrew Stephen Damick","text":"No, no. The devil is a loser. Again, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4048.57,"end":4048.97,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4049.53,"end":4052.17,"speaker":"Fr Andrew Stephen Damick","text":"This is one of our frequent themes. The devil is a loser."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4053.15,"end":4068.03,"speaker":"Fr Stephen De Young","text":"Right, Right. Dragging someone down with you is not winning. Yeah, right. That's not winning. He doesn't have a kingdom of any kind. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4068.11,"end":4069.63,"speaker":"Fr Andrew Stephen Damick","text":"We are not Greek pagans."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4070.19,"end":4070.67,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4071.71,"end":4074.83,"speaker":"Fr Andrew Stephen Damick","text":"Or actually almost any kind of pagan, honestly."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4075.39,"end":4173.51,"speaker":"Fr Stephen De Young","text":"But yeah, yeah, but so what's going on with this fire imagery is not just, hey, being on fire is an image of horrible, horrible pain, which of course it is of suffering, Right. It's a bad thing that you want to avoid. But this is the fire that comes from God, right? See death by holiness. See Nadab and Abihu, the fire that comes out of the presence of God and consumes them, right? So this is about God's holiness when the wicked come into the presence of God's holiness, Right. It's compared to the scriptures, to fire, because this is pain or suffering, right. Even when, like, think of Isaiah, Isaiah comes into the presence of God's throne and is like tearing his clothes and it's like, I'm undone, right. I'm a man of unclean lips for a people with ugly. Right. Let alone the devil, right. So this is talking about the experience of the presence of God by those who are confirmed in their wickedness, Right? That's the imagery that's going on here. Right. But as we talked about when we've talked about mortality and human death and the ways in which that's a mercy or a grace from God. Right. If you don't have that, right, Nadab and Abihu drop dead."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4174.23,"end":4174.79,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4175.67,"end":4183.11,"speaker":"Fr Stephen De Young","text":"Age to come. No one's going to die, right. In that sense, the sense of physical."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4183.11,"end":4192.33,"speaker":"Fr Andrew Stephen Damick","text":"Death, because the resurrection has happened and everyone was raised incorruptible. Yeah, everyone."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4192.49,"end":4297.46,"speaker":"Fr Stephen De Young","text":"And just a note here before we move off of the fire imagery, because I wanted to just briefly touch on it in a couple of places, the term Gehenna is used, and we talked about this back in the Chthonic Odyssey episode, the way the term Gehenna is used. And in some of the church fathers, they use the term Gehenna as opposed to Hades in order to do what we were disambiguating in the first half, they'll use Gehenna to refer to eternal condemnation, as opposed to Hades to refer to in this age. Right. And we mentioned in that episode how it's a reference to the valley of Hinnom. The reason I'm mentioning it here is that you get the garbage fire explanation, which it seems like maybe isn't true, maybe it burned garbage there, but rather that's connected to the history there of Israel having offered their firstborn to Molech there, the demonic worship that went on there. And it's also a valley next to the mountain of God. So you have the geography. Right. Symbolism there. But. So I thought we should at least comment on that because the word gets. For more on how that word is used in the New Testament, see previous episode. But because some of the church fathers use gehenna as their other word to talk about eternal condemnation, I thought it were at least mentioning that here."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4297.46,"end":4297.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4300.26,"end":4310.98,"speaker":"Fr Stephen De Young","text":"The. It's. It's not clear in its New Testament usage which it's referring to. There are places where you could argue it's being used as a synonym of Hades."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4311.22,"end":4311.94,"speaker":"Fr Andrew Stephen Damick","text":"Gotcha."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4315.86,"end":4328.67,"speaker":"Fr Stephen De Young","text":"But, yeah, so there's that. So the next sort of major image that's used for eternal condemnation is outer darkness."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4330.75,"end":4334.35,"speaker":"Fr Andrew Stephen Damick","text":"This is where the weeping and the gnashing of teeth are happening."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4335.47,"end":4337.07,"speaker":"Fr Stephen De Young","text":"Hello, Mormon friends. No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4338.91,"end":4339.31,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4341.39,"end":4366.12,"speaker":"Fr Stephen De Young","text":"This is a term they use somewhat differently, but we will go into that for our purposes here. This is the term that's used in Matthew 8, verse 12, Matthew 22, verse 13, and 25, verse 30. And in all three of those cases, as Father Andrew mentioned, it's connected with the imagery of weeping and gnashing of teeth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4366.52,"end":4377.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which, I mean, people know what weeping is, but I think gnashing is not something people tend to think too much about these days. Like, it's a Bible word and that's."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4379.1,"end":4380.14,"speaker":"Fr Stephen De Young","text":"The gnashing of teeth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4380.14,"end":4380.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4380.42,"end":4399.02,"speaker":"Fr Stephen De Young","text":"And that's usually. People tend to read that. I think, at least the way I've mostly seen and heard it interpreted in general American Christian circles is that this is an imagery of suffering throughout our darkness."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4399.18,"end":4402.62,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's grinding your teeth is what gnashing your teeth is like."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4403.82,"end":4404.3,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4405.66,"end":4406.38,"speaker":"Fr Andrew Stephen Damick","text":"Like your dog."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4406.38,"end":4407.04,"speaker":"Fr Stephen De Young","text":"That's not what it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4407.27,"end":4408.79,"speaker":"Fr Andrew Stephen Damick","text":"Like when your dog growls at you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4409.59,"end":4428.59,"speaker":"Fr Stephen De Young","text":"Yeah, that's not at all what it is. Biblically. Biblically and even in Greek literature outside the Bible. By the way, that imagery is used to describe madness. Yeah, madness. The way we talked about it in our madness episode."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4428.59,"end":4430.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like foaming at the mouth kind of thing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4431.51,"end":4479.78,"speaker":"Fr Stephen De Young","text":"Yeah. Like think of the Gerasene demoniac out in the tombs naked. Right. Or think of Nebuchadnezzar, as we talked about in that episode, being reduced to sort of this bestial state. And so that's sort of. And you can find this all kinds of places in Job. At one point, Job says that his enemies gnash their teeth at him. Right. Meaning they're sitting there, like, enraged. Right. They're angry. Right. They're. They're descending upon him. Right. Like wolves to destroy him violently. Right. Not that they, you know, grind their teeth at night. Because, man, that joke."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4479.78,"end":4481.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, it shows up."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4481.54,"end":4482.38,"speaker":"Fr Stephen De Young","text":"I care about that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4482.46,"end":4493.01,"speaker":"Fr Andrew Stephen Damick","text":"It shows up a bunch of times in the. In the Psalms. And it's literally, it's every time it's about, you know, the wicked gnashing at. Gnashing their teeth at the righteous, you know?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4493.57,"end":4516.63,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so this is a. This is a good place to point out with this outer darkness, that the different types of language used are not on a woodenly literal level, compatible. Like fire and darkness are strictly speaking opposites."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4516.63,"end":4519.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. How can outer darkness have a lake of fire in it?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4520.59,"end":4586.21,"speaker":"Fr Stephen De Young","text":"Yeah, right. Like, so if you take it at that very literal level. Right. It's contradictory. But of course, as we've already mentioned, that's not how this is to be understood. Right. And so we're getting different imagery for something that we fundamentally can't understand from our embodied human perspective now with our pre resurrection bodies. Right. We can't understand what that's going to be like. And so we're given imagery that pertains to our bodily existence in this age as different metaphors. Yeah, Right. So we can't understand what that would be like. But if you've ever been camping, you know, where there's sort of no ambient light on a dark cloudy night. Right. There's no ambient light from the city or anything around where literally you could put your hand an inch in front of your face and you can't see anything. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4586.69,"end":4604.16,"speaker":"Fr Andrew Stephen Damick","text":"Or, you know, if you visit, if you've taken one of those cave tours where at some point they'll say, okay, everybody turn your flashlights out. I went on one of these when I lived on Guam, because there's a lot of caves on Guam. And we all turn our flashlights out and the tour guide goes, this is what it's like in the heart of an unrepentant sinner."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4606.08,"end":4615.76,"speaker":"Fr Stephen De Young","text":"I'm not kidding. I was like, whoa, wow. But just feel bad and everything will brighten up."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4618.71,"end":4618.95,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4621.99,"end":4627.19,"speaker":"Fr Stephen De Young","text":"Yeah, but that is a traumas here. That is a terrifying experience."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4629.43,"end":4629.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4629.91,"end":4637.75,"speaker":"Fr Stephen De Young","text":"For us at this age to be in that kind of darkness. Right, right. Especially if you hear weeping and gnashing of teeth going on around you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4637.83,"end":4640.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. A little freaky. Not freaky."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4641.99,"end":4690.2,"speaker":"Fr Stephen De Young","text":"Right. So this is an image of terror and madness. This is bad. This is something I want nothing to do, no part of. Right. Being set on fire very clearly. Right. This is. I want no part. I do not want to be thrown into a fire. Right. So this is imagery of terror, madness. Right. Suffering, bad stuff. Right. Stay away from it. Do the other thing. Eternal life is what we want. And then the third sort of major one is references to the second death or eternal death. And eternal death there is like the death of the Age to come."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4691.24,"end":4693.32,"speaker":"Fr Andrew Stephen Damick","text":"The first death being physical death."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4694.28,"end":4707.49,"speaker":"Fr Stephen De Young","text":"Right, right. And this gets used in Revelation 2, verse 11, 20, verses 6 and 14 and 21, verse 8. And the last two of those, the lake of fire, is said to be the second death."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4708.05,"end":4711.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So there's a linkage between these images."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4712.21,"end":4737.87,"speaker":"Fr Stephen De Young","text":"Right. Even though they're not like, directly, you know, the same thing. So what kind of death is this getting talked about? Right. Because there's another group of people who we're only going to pick on here, since the third half will be reserved for a whole other group of people who generally call it annihilationism."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4738.19,"end":4748.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is this teaching that good people in the life of the age to come get to be with God in heaven, but bad people are just erased."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4748.68,"end":4764.92,"speaker":"Fr Stephen De Young","text":"Yeah. Cease to exist. Yeah. So there's a bunch of problems with that. One of them is that there is no sense of the word death in the Bible that refers to annihilation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4765.48,"end":4768.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, even physical death doesn't mean ceasing to exist."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4770.12,"end":4795.73,"speaker":"Fr Stephen De Young","text":"Right. And we've talked about this before, but bears repeating, St. John of Damascus summarizes this. The reason I come back to Saint John of Damascus a lot is that if you read his fount of wisdom, he summarizes, you know, he's in the 8th century, so he summarizes a lot of things from the preceding fathers and from Scripture and synthesizes it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4795.73,"end":4804.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, he's great. He's. He's this. The schoolmaster, you know, he's really just. He's like a catechist, really, in that text."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4805.51,"end":4832.63,"speaker":"Fr Stephen De Young","text":"So if you're looking for good definitional statements. Right. Like, I need to explain, as we're about to, there's physical death and there's spiritual death and how they relate to each other. You go to St. John of Damascus, he's got it pulled together and can give you sort of a definitional statement. Right. To help convey it. Physical death, separation of the soul from the body, spiritual death, separation of the soul from God. So this obviously isn't eternal physical death."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4833.11,"end":4837.59,"speaker":"Fr Andrew Stephen Damick","text":"Right. Because there was a resurrection and everyone was bodily resurrection."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4837.59,"end":4859.99,"speaker":"Fr Stephen De Young","text":"And it's universal as it was incorruptible. Right. So everyone is bodily raised. So it's not eternal physical death that's off the table. Meaning this is eternal spiritual death. This is eternal separation of the soul from God. And again, separation here is not spatial language."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4860.39,"end":4863.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because God is everywhere present."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4863.91,"end":4877.31,"speaker":"Fr Stephen De Young","text":"Yes. It is not implying that there is some place, some material sense in the age to come where God isn't, any more than there is a place now where God isn't."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4877.31,"end":4881.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's sort of like being detached from God or unplugged, so to speak."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4881.47,"end":4922.71,"speaker":"Fr Stephen De Young","text":"But people can experience spiritual death nonetheless. Right? Yeah. And that's what produces physical death. We talked about that in the episode on the soul, for example. So that's the kind of eternal death we're talking about. Let me add this about annihilationism. The biggest problem with it is that there are zero examples. Zero examples in the universe of things that cease to exist in the terms that they mean that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4927.27,"end":4927.99,"speaker":"Fr Andrew Stephen Damick","text":"There you go."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4930.31,"end":4931.63,"speaker":"Fr Stephen De Young","text":"Matter, energy, all that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4931.63,"end":4936.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it's just pure concept. It really is. It's just pure concept."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4937.51,"end":4938.85,"speaker":"Fr Stephen De Young","text":"A pure modern concept."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4939.24,"end":4939.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4940.04,"end":4947.48,"speaker":"Fr Stephen De Young","text":"Relating to, as we've talked about before, the dichotomy, the modern dichotomy between being and nothingness or between fact and fiction."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4947.8,"end":4950.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which we think in mathematical terms, there's a one and there's a zero."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4951.56,"end":4980.85,"speaker":"Fr Stephen De Young","text":"Right, Right. And where to exist means to have bodily, physical, material, corporality. Right. But in ancient terms and in biblical terms, as we've talked about before, the opposite of being is chaos. Right. So, yes, you have seen, and there are plenty of examples of places where there was a tower and now there is not a tower."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4981.25,"end":4983.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It went from being to chaos."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4984.53,"end":4991.21,"speaker":"Fr Stephen De Young","text":"Right. But yeah, the tower did not cease to exist. The matter which made up the tower is all still around. It's just."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4991.37,"end":4991.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":4991.81,"end":5035.7,"speaker":"Fr Stephen De Young","text":"It's not in the form of a tower anymore. Disoriented, organized and set in order as a tower anymore. When an animal dies, it doesn't cease to exist. It dissolves into its component parts and the energy that animated it dissipates. But neither cease to exist in the sense that annihilationists are talking about people ceasing to exist. So there are zero examples of anything God created actually ceasing to exist. So before you could even argue that this is going to happen to some humans, you have to construct an argument that it happens at all."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5035.78,"end":5037.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That it's actually a category."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5037.94,"end":5086.71,"speaker":"Fr Stephen De Young","text":"That it's a thing that can happen. Right. Good luck. Have at it. John Stott's gone, so he can't help you. So we have to point out. So, and we've tried to be clear here when we use the term eternal, because of course, and we've mentioned this many times on the show. Right. Sort of the pop conception of eternity is endless succession of moments in the way that we currently experience time. Right. And go watch the last season of the Good Place if you want to know why that's A problematic. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5087.03,"end":5087.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5087.67,"end":5116.56,"speaker":"Fr Stephen De Young","text":"And that's not. We're talking about. We're talking about what it literally says is the life or the death or the condemnation of the age, which is referring to the age to come. Right. But everywhere where these things are referred to together, these things being eternal life and eternal condemnation, or eternal life and eternal death, or however it's phrased, wherever the two are talked about, they're always spoken of as equally ultimate."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5117.44,"end":5181.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And probably the. The locus classicus for this, maybe, which orthodox Christians should all be familiar with because this is read at our funerals, is from John chapter five, Right. Where the Lord talking about the resurrection. I'm just going to read this. He says, truly, truly, I say to you, an hour is coming. And now, and is now here, when the dead will hear the voice of the Son of God, and those who hear will live. For as the Father has life in himself, so he has granted the Son also to have life in himself, and he has given him authority to execute judgment because he is the Son of Man. Do not marvel at this. For an hour is coming when all who are in the tombs will hear his voice and come out. Those who have done good to the resurrection of life, and those who have done evil to the resurrection of. And that gets translated variously, judgment, damnation, condemnation. But anyway, the point you're making, there's two outcomes. They are both through resurrection. One is life and the other is this condemnation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5182.21,"end":5186.69,"speaker":"Fr Stephen De Young","text":"Right. And there's no proviso on the second one."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5187.73,"end":5190.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It doesn't say, oh, well, one of these is temporary."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5191.49,"end":5201.33,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And of course, Matthew 25:46, again, at the end of the parable of the sheep and the goats."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5201.49,"end":5208.05,"speaker":"Fr Andrew Stephen Damick","text":"Yep. These will go away into eternal punishment, but the righteous into eternal life. Again, perfectly parallel."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5209.01,"end":5209.45,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5209.45,"end":5211.49,"speaker":"Fr Andrew Stephen Damick","text":"Again from the mouth of the Lord himself."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5211.57,"end":5221.57,"speaker":"Fr Stephen De Young","text":"This is Jesus punishment of the age, the life of the age. So if you want to say that one of those ages has an end, then the other one must also. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5222.21,"end":5222.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5225.89,"end":5285.49,"speaker":"Fr Stephen De Young","text":"When the same word is used in the same sentence twice, it becomes really hard to argue that it means two different things. Right. Without a lot of further evidence to point to. And honestly. Right. This is the place where we have to acknowledge, again, this isn't really complicated. This is really simple. This is taught all through the Scriptures. It's so plain and so simple. Right. And yet our ability to confound it is bizarre. And my favorite summary of it, this is where we are going to dip into the Old Testament, because this is my favorite summary of it, because it's so clear is at the end of the book of Deuteronomy, the end of the Torah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5285.57,"end":5286.01,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5286.01,"end":5289.01,"speaker":"Fr Stephen De Young","text":"Deuteronomy 30, verses 15 through 20."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5289.09,"end":5359.12,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So after God tells the whole story of creation and gives all his commandments, everything, he says this. See, I have set before you today life and good, death and evil. If you obey the commandments of the Lord your God, that I command you today by loving the Lord your God, by walking in his ways, and by keeping his commandments and his statutes and his rules, then you shall live and multiply. And the Lord your God will bless you in the land that you are entering to take possession of it. But if your heart turns away and you will not hear, but are drawn away to worship other gods and serve them, I declare to you today that you shall surely perish. You shall not live long in the land that you are going over the Jordan to enter and possess. I call heaven and earth to witness against you today that I have set before you life and death, blessing and curse. Therefore choose life that you and your offspring may live, loving the Lord your God, obeying his voice and holding fast to him, for he is your life and length of days that you may dwell in the land that the Lord swore to your fathers, to Abraham, to Isaac, and to Jacob to give them. What about people who object? Well, that was just for Israel at that particular moment in time."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5362.56,"end":5368.92,"speaker":"Fr Stephen De Young","text":"Well, see, every place where Christ says, not a yod or tumult will pass away from the."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5369.48,"end":5370.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5370.44,"end":5404.21,"speaker":"Fr Stephen De Young","text":"From the law, etc. Etc. Etc. Or read the Book of Hebrews where it talks about how the penalties of the new covenant are much more severe than those of the old covenant. Not the opposite, on and up. But again, this is super clear. Right. Christ says, if you love me, keep my commandments. That sounds an awful lot like what God says here. Right. If you love the Lord your God by walking in his ways and keeping his commandments and his statutes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5406.69,"end":5407.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5407.97,"end":5418.79,"speaker":"Fr Stephen De Young","text":"You know, loving the Lord your God, obeying his voice, holding fast to him, being faithful like this is. This is just so obvious and so clear. And it's a matter of choice."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5419.35,"end":5442.39,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I should say, I mean, you can do just a quick search of the Bible and see how many times loving God and keeping his commandments are paired. And it's at least 25 in those exact words, at least in the ESV. I'm sure we could, you know, come up with other ways of saying it. And it's. And it's old and New Testament. It's everywhere. If you love God, you keep his commandments."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5443.84,"end":5451.36,"speaker":"Fr Stephen De Young","text":"Yes, yes. Because again, love is not feelings. Love is actions."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5451.52,"end":5452.08,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5454.24,"end":5474.24,"speaker":"Fr Stephen De Young","text":"Love is actions. And, you know, the idea that love is feelings is what has brought about the divorce rate in this country. Because divorce, guess what, Feelings come and go. All feelings of all kinds toward everyone."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5474.64,"end":5475.12,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5476.08,"end":5491.6,"speaker":"Fr Stephen De Young","text":"Right. And you either continue to act faithfully when the feelings are gone, just like you did when they were there and they were at their strongest, or you don't, and that's what ends up separating people. So when I say it's a matter of choice, it's not a matter of choice. Like once."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5494.65,"end":5494.81,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5494.81,"end":5500.49,"speaker":"Fr Stephen De Young","text":"Where you just. Oh, yeah, no, yeah. I'll take the blessings in life. Thanks, God. Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5500.57,"end":5501.85,"speaker":"Fr Andrew Stephen Damick","text":"Oh, blessings in life, please."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5502.73,"end":5503.21,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5505.13,"end":5506.01,"speaker":"Fr Andrew Stephen Damick","text":"Cake or death."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5506.81,"end":5577.46,"speaker":"Fr Stephen De Young","text":"Right. Like everyone's gonna take that one. Right. But how do you do. How do you make that choice? You don't make that choice intellectually. You don't make that choice on one day any more than you make the choice to be married to someone intellectually on one day. Right. That choice is a pattern that emerges over your behavior over a lifetime about whether you're a faithful married person or not. Right. About whether you're faithful to Christ or you're not, but whether you actually love the Lord your God, or not. Right. It's a decision constituted by a thousand smaller decisions. And so the person who refuses to repent, who refuses to worship God, who refuses to love God and his neighbor, the person who refuses to do that is making the choice to reject the offer of life that God has extended to that person. And God does not force his love on people. I mean, this is awfully blunt, but God is not a rapist."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5579.54,"end":5581.94,"speaker":"Fr Andrew Stephen Damick","text":"Yep. Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5581.94,"end":5585.06,"speaker":"Fr Stephen De Young","text":"Okay. He's not a kidnapper. He is not a human trafficker."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5588.18,"end":5588.74,"speaker":"Fr Andrew Stephen Damick","text":"That's not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5588.74,"end":5590.5,"speaker":"Fr Stephen De Young","text":"He does not force his love on people."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5590.58,"end":5593.14,"speaker":"Fr Andrew Stephen Damick","text":"That's not love, everybody."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5593.14,"end":5595.3,"speaker":"Fr Stephen De Young","text":"I mean, that is because that wouldn't be love."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5595.54,"end":5595.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5595.98,"end":5596.42,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5597.38,"end":5599.91,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, it seems for it to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5599.91,"end":5602.51,"speaker":"Fr Stephen De Young","text":"Truly be love, someone has to be able to reject it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5602.99,"end":5606.99,"speaker":"Fr Andrew Stephen Damick","text":"Right, right. Love sets the other person free."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5608.83,"end":5643.08,"speaker":"Fr Stephen De Young","text":"And so eternal condemnation becomes a possibility because of the love of God being actually love, and because of his offer of life to everyone, being sincere, that means it's possible for a person to reject it. And so eternal condemnation exists as this future possibility, this horrible possibility, this terrifying possibility, the way it's described in the scriptures."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5643.96,"end":5644.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5645.08,"end":5646.84,"speaker":"Fr Stephen De Young","text":"But a possibility nonetheless."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5649,"end":5661.26,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, that's the second half. There's one more half to go because, as you know, everybody, it's a show and a half. So we'll be right back after this brief break with the third half of the Lord of Spirits."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5661.5,"end":5679.29,"speaker":"Steve","text":"Father Andrew, Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on the second half of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5683.61,"end":5741.32,"speaker":"Fr Andrew Stephen Damick","text":"This is Andrew Williams. Since the advent of the Internet, it has become increasingly obvious that our society suffers from a pornography problem. And orthodox Christians are no exception. While many practical resources are available to help those who struggle with pornography use, these fail to address the problem at its deeper spiritual root and to acknowledge how it affects our whole society. My new book, From Object to Icon, the Struggle for Spiritual Vision in a Pornographic World, shows how all of us can change the way we see, how we can learn to see iconographically rather than pornographically. Whether or not we struggle with pornography use, this book shows us how to stop objectifying others and instead see the spiritual reality in everyone we encounter. From Object to Icon is now available at the end store.ancientfaith.com. that's store.ancient faith.com."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5742.76,"end":5758.68,"speaker":"Steve","text":"We'Re back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF. RA."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5764.6,"end":5781.72,"speaker":"Fr Andrew Stephen Damick","text":"Welcome back. It's the third half of this episode of the Lord of Spirits podcast. And once again, this is pre recorded. So despite what you just heard from the voice of Steve, don't call now or do again. It's up to you. But you probably will not get to talk to us because that's."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5781.72,"end":5783.56,"speaker":"Fr Stephen De Young","text":"We literally can't stop you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5783.72,"end":5795.99,"speaker":"Fr Andrew Stephen Damick","text":"We can't. I mean, right? You could do what you want. Like, it's weird. People can do things like not listen to a podcast that they don't like, and yet so many feel like they have to. I don't know what that's up with."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5795.99,"end":5809.07,"speaker":"Fr Stephen De Young","text":"What's up with that? I love our hate listeners. Well, because I hate listening to their comments. So, like, turnabout's fair play, right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5810.59,"end":5839.52,"speaker":"Fr Andrew Stephen Damick","text":"That's true. But I mean, it's all that giggling that you do while you're listening, while you're reading their comments. Yeah. So, okay, well, in the first half we disambiguated the Hades hell to which the wicked are consigned when they die in this age. And then in the second half we talked about the various biblical images for eternal condemnation. And now in this half, Father Stephen is finally going to get us canceled."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5841.44,"end":5844.2,"speaker":"Fr Stephen De Young","text":"By people who already don't like me, so. Not really."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5844.2,"end":5850.95,"speaker":"Fr Andrew Stephen Damick","text":"There we go. Yeah. Talking about the heresy of universalism."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5851.75,"end":5854.03,"speaker":"Fr Stephen De Young","text":"Yes, the condemned heresy."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5854.03,"end":5855.83,"speaker":"Fr Andrew Stephen Damick","text":"Yes, conciliarly condemned."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5856.31,"end":5890.02,"speaker":"Fr Stephen De Young","text":"The rejection of apostolic teaching known as universalism. Might as well start the triggering now. Right? Like, if you really can't handle sustained, Sustained critique of universalism, if you're, if you are a person who is a universalist for some kind of emotional reasons, Right. Or reasons of sensitivity or something, and you don't want to subject yourself to hearing a sustained critique of it, you should probably not listen to the rest of this podcast."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5890.1,"end":5943.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, that said, like, I know, I know that some people are universalists because they kind of can't bear the idea of eternal condemnation. And in some cases people are universalists because maybe someone they love killed themselves cursing God or something like that and they're like, well, I don't want that person to be eternally condemned. How can that possibly be? I love them so much. You know, which, I mean, I get that. Like, I get that. I get why people would feel that way. But at the same time, I'll at least say the hope of someone else's salvation does not have to be founded on, frankly, heretical teaching."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5944.92,"end":5950.6,"speaker":"Fr Stephen De Young","text":"You know, you're digging in the wrong place for the conciliation you need on that account."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5950.84,"end":5951.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5951.4,"end":5954.65,"speaker":"Fr Stephen De Young","text":"Now if you're a universalist because you're like a pompous know it all."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5956.4,"end":5956.56,"speaker":"Fr Andrew Stephen Damick","text":"Who."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5956.56,"end":5959.6,"speaker":"Fr Stephen De Young","text":"Feels smugly superior to everyone else, go ahead and listen."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5959.76,"end":5962.48,"speaker":"Fr Andrew Stephen Damick","text":"That's right. Because a lot of this will be for you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5963.2,"end":5963.76,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5965.2,"end":5966.32,"speaker":"Fr Andrew Stephen Damick","text":"And we don't feel for you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5966.4,"end":5967.4,"speaker":"Fr Stephen De Young","text":"This is directed at."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5967.4,"end":5982.65,"speaker":"Fr Andrew Stephen Damick","text":"We're not feeling. Because, you know, as you know from the previous half, empathy is dubious in general, or at least it's necessity. But we do not have empathy for people who are pompous, know it alls, and therefore pushing universalism."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5983.77,"end":5988.17,"speaker":"Fr Stephen De Young","text":"Right. Well, yeah, I mean, I don't want to beat up on suffering and grieving people."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5988.49,"end":5989.57,"speaker":"Fr Andrew Stephen Damick","text":"No, of course not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":5989.57,"end":6008.04,"speaker":"Fr Stephen De Young","text":"Not because I have empathy, being a high functioning sociopath. But it's a bad look. Yeah, yeah. But, oh yeah, I will, I will, I will puncture windbags all day. That's, that's, that's good sport."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6008.04,"end":6008.68,"speaker":"Fr Andrew Stephen Damick","text":"Amen."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6010.92,"end":6030.6,"speaker":"Fr Stephen De Young","text":"But more, a little more seriously, right? Holding this up and we're going to go into more detail, but holding to some kind of universalism doesn't do what you think it's going to do."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6031.16,"end":6031.56,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6031.96,"end":6082.14,"speaker":"Fr Stephen De Young","text":"It. People do it to solve a problem. Like some of the problems You've mentioned. Right. And a variety of others. And so it's understandable, right, that you're looking to a solution to that problem. And this presents itself as such a solution, but it has follow on consequences. In your view of God, in your view of sin, in your view of repentance. Yeah, right. That, that cause worse problems and so there are better solutions. But so let's, let's go ahead and get into. Let me just get this out of the way too. Right. Like back at the beginning of the episode I talked about, here's the things we're going to get just to save us some emails."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6083.58,"end":6084.86,"speaker":"Fr Andrew Stephen Damick","text":"Save me some emails."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6085.49,"end":6160.43,"speaker":"Fr Stephen De Young","text":"And so. Well, I didn't say I was going to read them. Right. But bandwidth's bandwidth. I have read that all May be saved. The David Bentley Hart book. Yale sent me a free review copy when it was first released. I read it. I didn't end up doing a review of it. I did do a review. They also sent me a free copy of David Bentley Art's New Testament translation. I did a review of that because I thought while there were portions I disagreed with, obviously there were also things about it that were of value. Right. So I did a review because I could do a review like that. Here are the things I think are of value, despite these places where I disagree. That All May Be Saved is one of the worst books I've ever read, one of the worst theological books I've ever read, and I've read some bad ones. It is a book and that's why I didn't write a review. I didn't have anything constructive to say about it. Over the course of this half, people who have read it will see why it's bad."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6160.59,"end":6160.99,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6163.47,"end":6219.72,"speaker":"Fr Stephen De Young","text":"It'S the kind of book that draws cheers from people who already agree with its premise because it's written from a perspective of this is the truth. I'm going to primarily establish that truth by ridiculing people who disagree with it and knocking down straw men of an opposition position, which if you already agree with it, you know you'll rah rah. If, if you don't, then it's valueless. Right? Like it's not gonna convince anybody. But so yeah, so save your email saying, oh, have you read, you know, this book? Its argument is irrefutable. Save it Reddit. Not only is it irrefutable, it's laughable. Okay, but now getting into the topic at hand, qua topic."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6219.72,"end":6220.68,"speaker":"Fr Andrew Stephen Damick","text":"Okay, Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6222.44,"end":6234.76,"speaker":"Fr Stephen De Young","text":"So what we're talking about, when we're talking about universalism is not like the Unitarian Universalists. That's a whole separate. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6234.76,"end":6235.24,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6235.88,"end":6278.88,"speaker":"Fr Stephen De Young","text":"We're not spending a half of an episode, like, bashing on them. Right. Doesn't take that long, frankly. But we're talking about people who believe, some of whom are within the Orthodox Church to one degree or another, and who believe in some form of apocatastasis, some form of universal reconciliation to God. At minimum, this means the idea that all humans will inevitably be reconciled to God in the age to come."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6280.8,"end":6287.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's various ways people get to that, but. Yes, that's where it ends."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6287.52,"end":6300.32,"speaker":"Fr Stephen De Young","text":"Yes. But so that's defining the term universalism as we're using it. Right. That's the minimal. And sometimes it goes beyond that. Right. So there are forms of apokatasis where it's even the devil, the demons are all going to be reconciled to God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6300.32,"end":6300.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6303.67,"end":6352.81,"speaker":"Fr Stephen De Young","text":"Going way further. But minimally, it's the belief that all humans will receive eternal life in the age to come, inevitably and eventually. And then there's various forms it takes beneath that. The most infamous, despite recent attempts at rehabilitation, the most infamous proponent of this kind of view, who took it to the extreme point was, of course, Origen. I have what is apparently news for some folks. Origen, specifically on the point of apokostasis, was condemned at the Fifth Ecumenical Council."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6352.81,"end":6355.29,"speaker":"Fr Andrew Stephen Damick","text":"What? What?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6356.17,"end":6370.58,"speaker":"Fr Stephen De Young","text":"And I say this not because I have taken a Tardis to 553 AD and walked into said council with a GoPro."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6372.18,"end":6376.18,"speaker":"Fr Andrew Stephen Damick","text":"This is the second episode in a row that you've mentioned GoPros, by the way."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6376.18,"end":6385.14,"speaker":"Fr Stephen De Young","text":"GoPros. Yes. Well, I feel like it's more specific than video camera and who knows? Sponsorship deal."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6388.81,"end":6389.05,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6389.77,"end":6422.03,"speaker":"Fr Stephen De Young","text":"Right. And I don't have to. Right. In fact, if I did that and I brought back the video and we watched the video with people fluent in Greek and everyone agreed. You know what? They didn't even mention origin, not once in the whole video. It would still be a fact that the Fifth Ecumenical Council condemned Origen on apokatastasis. Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6422.27,"end":6422.67,"speaker":"Fr Andrew Stephen Damick","text":"Because."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6426.11,"end":6429.03,"speaker":"Fr Stephen De Young","text":"That'S not how holy tradition in the Orthodox Church works."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6429.03,"end":6463.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It is demonstrably, easily to show that the Church, for century upon century upon century, has not only repeated what it says about the ecumenical Councils, it has enshrined them in hymnography for I don't know exactly how long, but it's centuries at the very least, probably well over a thousand years."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6463.59,"end":6464.55,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6466,"end":6504.2,"speaker":"Fr Andrew Stephen Damick","text":"So, you know, there are some people. And now, for those of you who might be new to this discourse, there are Some people who say that the council did not condemn Origen or that it only said certain kinds of things and not others or whatever. You know, there's all kinds of variations on this and that later Saint Justinian altered it. Right. He pulled a fast one on everybody. And it's been a big mistake for all these 1600 years. It's a big mistake, right, that there are people who say that, but that is not how orthodox tradition works. So if you're going to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6504.2,"end":6506.6,"speaker":"Fr Stephen De Young","text":"You're like an Episcopalian, by all means, make that up."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6506.6,"end":6511.04,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yeah, totally. That's basically Anglican Episcopalian argumentation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6511.28,"end":6514.6,"speaker":"Fr Stephen De Young","text":"Right. You think the Church was wrong about all kinds of things for hundreds of years, right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6514.6,"end":6552.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right, sure. But, you know, to posit this idea, you have to say that the Holy Spirit was not getting through to the Church on something this big for that long and across the entire geographic range of the Church for centuries upon centuries upon centuries, nor even the subsequent ecumenical councils that also confirmed that council, and so on and so forth. It's just. It is a level of wrong that is staggering to imagine for an Orthodox Christian."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6553.68,"end":6554.08,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6556,"end":6581.85,"speaker":"Fr Andrew Stephen Damick","text":"And if you think that that's a thing and there are Orthodox people who think that that's a thing, then on what basis can you say that any of the councils or even the Scripture itself are truly reliable? Because like. Like Nicaea, right? We all have things we say about Nicaea, but we don't have the majority of the texts of the, like the minutes or whatever of everything that was said at Nicaea."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6582.25,"end":6586.01,"speaker":"Fr Stephen De Young","text":"We have less than we do about the fifth Ecumenical Council, for sure."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6586.09,"end":6602.64,"speaker":"Fr Andrew Stephen Damick","text":"Right? So. So, so it is a massive methodological problem. You are dismantling all of orthodox tradition to say that one of the ecumenical councils didn't say what the Church has for centuries upon centuries said that it said."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6603.52,"end":6603.92,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6603.92,"end":6606,"speaker":"Fr Andrew Stephen Damick","text":"That's. That's what's actually at stake, everybody."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6606.48,"end":6636.39,"speaker":"Fr Stephen De Young","text":"And now notice. Notice you said over something this big. And this is something we have to call out too, because of course, when folks who hold to some form of apocatastasis are arguing that their views should be tolerated within the Church, it's always, oh, well, this is eschatology. It's a side thing. It's not a major thing. It's not a big deal. And then when they're arguing further point, they say everyone who disagrees with them, their God is a monster."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6637.51,"end":6637.91,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6638.63,"end":6646.71,"speaker":"Fr Stephen De Young","text":"And it's like, well, you know what? Who God is seems kind of significant to me theologically. I'm just throwing that out there."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6646.79,"end":6647.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6647.27,"end":6675.22,"speaker":"Fr Stephen De Young","text":"So if Both sides admit that this is very key to the whole view of God, that it seems that this is a major issue, in fact, the kind of thing that an ecumenical council weighs in on and did and therefore is obligatory. But what's really going on here is that these folks are making a Protestant argument. And say what you want to our Protestant friends about Protestantism. Protestant arguments are not orthodox arguments."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6675.94,"end":6676.5,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6677.14,"end":6680.22,"speaker":"Fr Stephen De Young","text":"Right. And Orthodox arguments are not Protestant arguments."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6680.22,"end":6706.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In this case, it's a. Now, not all Protestants make this argument about the Scripture, but it is a Protestant argument. The idea that there is an original text of the Bible that is sort of the infallible one. And I've seen this, like, in the inerrant or infallible text, like, I've seen this in statements of faith on church websites, that the Bible is infallible and inerrant in its original manuscripts, which. You got one. I mean."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6706.72,"end":6726.89,"speaker":"Fr Stephen De Young","text":"Yeah, you know, in the autographs. Right? In the autographs. That's the. Yes. And then you use textual criticism and like the Nashville statement of pens. You know, this could be reconstructed with modern computer tools. You know, the rest of history didn't have an inerrant Bible, but now we've got it back."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6726.97,"end":6728.33,"speaker":"Fr Andrew Stephen Damick","text":"Now we do computers."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6730.33,"end":6788.33,"speaker":"Fr Stephen De Young","text":"But the idea there is the authority there is not in the text as it currently exists or has historically existed in the Church. It's not in how it's been received by the Church, it's not in how it's been historically interpreted by the Church, but it's in the original text as it existed historically at the time of its writing. This is why I say the proponents of Apokatastasis are making the same argument. They're saying that the Church Council, the Ecumenical Council does not have authority as it has been received by the Church, does not have authority in the way in which its findings have been promulgated, but that the authority lies in what was actually said and done on the day historically, as they want to reconstruct."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6788.33,"end":6788.65,"speaker":"Fr Andrew Stephen Damick","text":"It."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6790.73,"end":6821.13,"speaker":"Fr Stephen De Young","text":"That reconstruction has no authority in the Orthodox Church, in the Orthodox view of tradition, any more than a modern critical scholar's reconstruction of what really happened behind the Old Testament has any authority in the Church. Right. What has authority? The Scriptures have authority in the Orthodox Church. This is how Orthodox tradition works. They have authority of the Orthodox Church as they've been received and interpreted by the Church historically."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6822.57,"end":6823.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6823.61,"end":6846.17,"speaker":"Fr Stephen De Young","text":"Church councils have authority as they have been received and interpreted by the Church historically. And the Fifth Ecumenical Council has been received as an ecumenical council and historically interpreted as having condemned Origins, specifically about the issue of apocatastasis. And there's no arguing that it is a simple matter of fact."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6846.89,"end":6849.21,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6849.37,"end":6912.28,"speaker":"Fr Stephen De Young","text":"That you have to just deny reality to argue against that. That's how the Orthodox Church works. Now if to our non orthodox listeners you may say, well, I disagree with that, I say, okay, right. So for you maybe as a non orthodox Christian, the condemnation of Origen on universalism isn't authoritative. Right. But as Orthodox Christians, for us it is. But it's also worth noting, and this is one of the problems, even accepting the problem with their argument in the first place, like the structure of their argument that we've just pointed out. Right. Even their reconstruction doesn't make sense. Right. Because the narrative they present is that sort of no one had any problem with Origen except Saint Justinian."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6912.6,"end":6916.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Like it just came out of nowhere. He was a secret nemesis or whatever."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6917.16,"end":6968.35,"speaker":"Fr Stephen De Young","text":"Yeah. Came in after the fact. I mean, there may be a few people who didn't like him, you know, who are usually the people who the given reconstructor doesn't like in church history. But this is all kind of a bamboozle that Saint Justinian polls. Right. Reality is, and again, this is not controvertible, is that Origen was condemned particularly on this issue over and over again at local councils by church fathers for a couple centuries leading up to the fifth Ecumenical Council. The fifth Ecumenical Council was just ratifying what everybody else had already done and making it the binding finding of an ecumenical council."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6968.35,"end":6975.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So even if the council had never happened, an origin never mentioned, it still was the tradition of the Church up to that point."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":6976.29,"end":7047.84,"speaker":"Fr Stephen De Young","text":"Yes, everywhere. And this included, most tellingly, people who were admirers of Origen in other regards or people whose biblical exegesis and whose theology was dependent on Origen who will say, right, there are these good things at origin. But. And they specifically single out the most commonly thing singled out. Sometimes there's some other things too. But the most common thing singled out about origin that they say is wrong is apocatastasis. Right. So these great admirers of his say, well, in that one place at least, he was way off. Right. So beyond origin, Right. There are a couple other figures. These are actually saints, unlike Origen, who."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7047.84,"end":7048.24,"speaker":"Fr Andrew Stephen Damick","text":"Are."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7051.12,"end":7114.23,"speaker":"Fr Stephen De Young","text":"Pointed to and said to be proponents of Apokatastasis. The two primary ones are St. Gregory of Nyssa and St. Isaac the Syrian. And so people who reject the Church's teaching on this will point to them and say, oh well, see, look, there's these two saints who we're going to say held to some kind of apokatastasis. Therefore we can hold to our albeit different form of apocatasis and it's okay. Right. I mean, you see the flaw in that argument there at the end anyway. Right, right. Like you're not even holding to the view you claim that Saint held. Exactly. Just one. That's in the ballpark. Right. And acting like he opens up the ballpark for you to theorize for yourself. But there's an added problem, which is it's not entirely conclusive that either of those figures were universalists."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7114.71,"end":7137.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there's even like with, with St. Gregory of Nyssa, for instance, there's actually, I mean, you can do some really quick googling, just write in like, was St. Gregory of Nyssa a universalist? And there's actually a gazillion articles out there showing in great detail about how he was not and how he taught eternal condemnation and so forth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7138.5,"end":7175.95,"speaker":"Fr Stephen De Young","text":"Right, right. And so. And there's a relative paucity of writings from St. Isaac the Syrian. Yeah, right. We have more from St. Gregory, but. And you know, you get people who quote mine and proof text church fathers who will pull things out that kind of sound. Right. St. Gregory of Nyssa has this done to him all the time. All the time. People online pull out this quote from his life of Moses to say, oh, St. Gregory didn't believe that the, the death of the firstborn actually happened at the Passover."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7177.87,"end":7178.35,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7178.43,"end":7183.87,"speaker":"Fr Stephen De Young","text":"And all you have to do is read the passages immediately before and immediately after the quote to see that he did."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7184.67,"end":7185.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7186.39,"end":7200.43,"speaker":"Fr Stephen De Young","text":"Right. So in the ways not to read church fathers. Right. Looking for quotes, especially having ChatGPT look for quotes because it will make up patristic quotes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7200.43,"end":7208.03,"speaker":"Fr Andrew Stephen Damick","text":"It will, you can literally ask it and it will come up with citations that look great but are completely false."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7208.03,"end":7316.47,"speaker":"Fr Stephen De Young","text":"They're fake. But even using Google. Right. Yes, you could quote mine the church fathers, just like you could proof text the Bible if you pull verses out of context to try and argue for anything. Yeah, but that's disingenuous and doing violent for them. But also there's sort of, there are things that people like to freely interpret, like someone saying that we should pray, a saint saying we should pray for all of creation. There are saints who say we should pray for the demons and the devil and pray for insects and pray for. Right. That doesn't make you a universalist. That doesn't make mean you believe in apocalypses. That doesn't mean you believe that they're all going to be Inevitably reconciled to God. In fact, the fact that you're praying for them kind of argues for the opposite, that it's not inevitable. Right. You could argue from praying for it that it's possible, but that's not even necessarily true. Right. One, one could pray for a demon. If a saint is being tormented by a demon and he prays for the demon, he might do that as a way of expressing love for his enemy without believing it's possible for that demon to repent, for example. Yeah, Right. So it might not even be that they believe it's possible, but. But the act of praying for it means it tends to indicate it's not inevitable. Right. You also have any time a saint reflects hope that all humans would be saved, would find salvation, hope that all humans would be reconciled to God. And that's like, oh, see, look, they believed in apocatasis. It's like, that's hope."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7318.72,"end":7318.96,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7320.08,"end":7344.48,"speaker":"Fr Stephen De Young","text":"All Christians should hope that all people would be reconciled to God and find eternal life. Right? Because the Old Testament says God wills that all men be saved and come to the knowledge of the truth. Right. So, yes, we should want the same thing."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7346.04,"end":7346.28,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7346.36,"end":7444.74,"speaker":"Fr Stephen De Young","text":"But wanting that and desiring that, as we talked about with God at the end of the second half, is not the same thing as believing it's inevitable. Those aren't the same thing. So beyond those historical issues, right? And that's really it for the historical case, the whole historical case is trying in vain to undo the condemnation of origin and trying desperately to identify a couple of Church Fathers who might have held a minority opinion on this. Right? That's the historical case for somebody believing in some kind of apokatastasis. Everyone agrees that all of the rest of the fathers, the reception history of the fifth Ecumenical Council, all condemn apokatastasis, all condemn this idea, all point to the possibility of eternal condemnation. This isn't ambiguous. There is no ambiguity here in reality other than people trying to create it. In the book I mentioned at the beginning of this half, right. The author, in trying to argue for apokatastasis, has to condemn, ridicule the Church."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7444.74,"end":7445.3,"speaker":"Fr Andrew Stephen Damick","text":"Fathers."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7447.15,"end":7509.09,"speaker":"Fr Stephen De Young","text":"He calls them moral pygmies for believing in eternal condemnation. That is the position you have to take to argue for Apocatasis. Yeah, that's not him going too far. That's the position you have to take. You have to reject the Church Fathers and the saints as not knowing what they're talking about morally, theologically and religiously. In order to hold this view, you have to cut yourself off from Holy tradition to hold this view, that's a bad consequence. Remember we said this solves. People see it as solving a problem, but it causes bigger ones. That's a much bigger one than the other problem. Right. So getting past that historical case though, right, Universalism, apocatasis. Right again, is the belief that God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7509.09,"end":7509.49,"speaker":"Fr Andrew Stephen Damick","text":"Must."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7511.33,"end":7571.11,"speaker":"Fr Stephen De Young","text":"Must ultimately grant every human eternal life. He must do it because otherwise he's evil. They will often straight out argue this or that. If he doesn't grant every human eternal life, he is unjust. They will argue. Or they will say, well, if he doesn't do it, he must be incapable of it. Right. And that last incapable one as well as the unjust one may remind people of some other discussions we've had on this show. Right. Because deep down, deep down, and this is the central argument of the book we mentioned at the beginning of this half, this is really a Calvinist argument that they're making."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7572.47,"end":7573.11,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7575.11,"end":7601.96,"speaker":"Fr Stephen De Young","text":"So yes, I am saying right now, David Bentley Hart, his argument in that book, deeply Calvinist. It's Calvin by way of Karl Barth, but it's still Calvinism. Karl Barth famously said, everyone is reprobate in Adam, everyone is elect in Christ. So this is where this is going. It's Calvinism where everyone is elect. It's universal election."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7605.81,"end":7606.05,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7607.01,"end":7625.09,"speaker":"Fr Stephen De Young","text":"And this is based on displaying the justice of God. And as we've said before, when we're talking about penal substitutionary atonement, when we were talking about other related issues, if God has some standard of good and evil that stands above him or some standard of justice that stands above him, why aren't we worshiping that?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7627.09,"end":7631.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Is God subject to necessity? Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7632.49,"end":7717.08,"speaker":"Fr Stephen De Young","text":"This is arguing that God is subject to necessity, that God must do something, namely, he must give eternal life to all of his human creations. And stop. Pause for a minute at how patently absurd that is. Because God created a human, he must share his divine life with that human eternally. He is obligated somehow. So now there is no grace, there is no gift in regard to salvation. It is necessity. There is some old magic. There is some covenant to which God is beholden. Right. This is absurd. Right. This is absurd. And you can make sophistic arguments for it. Right. You make sophisticated arguments for it, but it's absurd on the face if you really think about it from the perspective of biblical theology. I don't want to. I'm not going to digress too far into this. But it has to be said. Okay. It does have to be said. Get ready for a spicy Take."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7719.32,"end":7721,"speaker":"Fr Andrew Stephen Damick","text":"Do you think it's been spicy so far?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7726.84,"end":7750.54,"speaker":"Fr Stephen De Young","text":"So there is a dirty secret in liberal theology. It's a dirty secret. Now, it used to be open. Right. But since the end of World War II, it's been a dirty secret. Okay. All liberal theology is at least vaguely Marcionite, if not outright."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7752.54,"end":7754.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, they don't tend to like the Old Testament."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7755.5,"end":7765.23,"speaker":"Fr Stephen De Young","text":"Right. Old Testament God. New Testament God. David Bentley Hart is exhibit A of this again. Book mentioned at the beginning."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7765.23,"end":7765.51,"speaker":"Fr Andrew Stephen Damick","text":"This."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7765.75,"end":7785.67,"speaker":"Fr Stephen De Young","text":"Read what it says about the God of the Old Testament, calling him a monster, calling him the devil. Okay. When it was pointed out to him, was pointed out to Hart, that this made him a Marcionite, his defense was he doesn't believe the Old Testament God exists. So he's not a Marcionite."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7787.43,"end":7787.91,"speaker":"Fr Andrew Stephen Damick","text":"Wow."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7789.03,"end":7789.59,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7790.75,"end":7790.99,"speaker":"Fr Andrew Stephen Damick","text":"What?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7792.11,"end":7842.85,"speaker":"Fr Stephen De Young","text":"Yes. Okay. Well, where's he getting this? Where is this wild thing? Well, he's beholden to a theological tradition that runs through 18th and 19th century Germany up into the 20th century with guys like Jurgen Moltman. Right. He's depended on this. It is deeply anti Semitic. I know, shocking. 19th century Germans are deeply anti Semitic, but. Right. It is based on the idea that the God of the Jews, the God of the Hebrew Bible, the God of the Old Testament. Right. Is a false God, a pagan God, a deficient God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7844.93,"end":7845.29,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":7845.29,"end":8105.11,"speaker":"Fr Stephen De Young","text":"And not the real God. Right. And what that requires. Right. If you throw out the Old Testament and then want to reinterpret the New Testament. Right. You can't carry over any of those Hebraic notions of who God is into the New Testament. So who is God in liberal theology if we're not going to use the God of the Old Testament? Who is the God in the New Testament? It's Plato's God. It's the God of Greek philosophy because the Greek tradition, a European tradition and not Jewish. And if you read the book we're talking about, David Bentley Hart's argument in that book is deeply anti Semitic and is seeking to replace the God of the Old Testament in Christian theology with Plato's God, the same way that German theological tradition has been doing for a couple hundred years. The anti Semitism is just slightly less overt. You don't have to scratch that deep when you see what he says about the Old Testament God. Right. But that's what's happening. That's what's being put forward in all of this liberal theological trajectory. This is why if you read Nietzsche, Nietzsche was always praising the God of the Old Testament because Nietzsche despised liberal German theology. That's the very form of Christianity he despised. Right. The most. He actually says nice things about Russian Orthodoxy which he encountered through reading Dostoevsky. But this is why he praises the Old Testament God. He's trying to invert what these German liberal Christian theologians were doing. And Hart's book on universalism is just a modern American incarnation of this. This is another reason why this whole thing causes more problems than it solves. Right. We've now entered into this wildly problematic theological view from the perspective of the Church and church history, from the perspective of common decency, from the perspective of intellectual history, right? This is deeply problematic. Okay? This is not where you need to go because someone you love died outside of the Christian faith. You don't need to go to all this over that. Okay? I don't think that's why Hart's there. I think Hart's there because actual Christianity offends his moral sensibilities the same way it did those 19th century Germans. Reasons. It's too gauche for him, right. It's too vulgar, too common. Right. But there are a lot of decent and good people who go down that road for those reasons. And it's not a road you want to go down. There's nothing good down that road that's going to really help you. So that said, right. One of the problems I've personally experienced, I think this is probably true for Father Andrew too. You can say in trying to talk about these issues with people, is that every individual person who believes in some kind of universalism or apokatastasis always has their own nuances."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8106.23,"end":8107.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8108.47,"end":8144.64,"speaker":"Fr Stephen De Young","text":"So I say something critical of Hart in his book, for example. They say, well, I don't agree with him about everything, you know, I, you know, this and that is different and this and the other, right. But here's, here's the thing, right? And it's even suggested sometimes that like, unless someone takes the time to study every conceivable variation and answer each one individually, right? Like, oh, you can't then comment on this issue, of course, that's impossible. That's a way of saying, well, no one can ever really discuss, argue with me."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8144.8,"end":8156.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, relatedly, unless the Fifth Ecumenical Council condemned the specifics of the particular view that I hold of this, then I'm not, you know, my view is not condemned."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8157.37,"end":8218.17,"speaker":"Fr Stephen De Young","text":"Right, right. And that's. That, that's obviously not true, right? Like the, the Council of Nicaea and the Council of Constantinople did not have to like, conceive of every possible minute variant of Arianism and Semi Arianism to condemn Arianism and semi Arianism. Right. They condemned any view which says that the Son is different in substance from the Father. Boom. Done. Right. And so the council condemning the view that all will inevitably be reconciled to God by some necessity means any view that has that feature, regardless of all the other particulars, if it has that feature, it's condemned."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8218.33,"end":8220.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8221.85,"end":8287.88,"speaker":"Fr Stephen De Young","text":"And part of this too plays into this idea that people have received. And I think it's due to this idea of theologumina, which most people who talk about it don't understand in the Orthodox Church. Theologumina is basically like the idea of pious opinion. Right. Something that's not like a teaching of the Church from which you can't. That you can't disagree with and things that are secondary or tertiary or. Right. Or really in other ways. So they've come to this idea that they're sort of on various issues of theology or various topics of doctrine or various things about the way of life within orthodoxy, that there's like a range of acceptable orthodox views, and as long as your view is somewhere in that range, then you're okay. Like, you're allowed to believe it. People will phrase it that way. Am I allowed to believe X?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8288.04,"end":8292.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is just not the right question."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8293.48,"end":8336.18,"speaker":"Fr Stephen De Young","text":"Right. Am I allowed to believe that the sky is purple? Well, like, I mean, I can't stop you. But it's not. Right. Like, am I allowed to believe that two plus two equals five? Well, I mean, if you really want to. Right. This assumes this basically has nested in it post structuralist or postmodern presuppositions that the truth is unknown and. Or unknowable, that there is no substantive teaching in the Church on this topic."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8338.18,"end":8338.38,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8338.38,"end":8358.5,"speaker":"Fr Stephen De Young","text":"Therefore it's just the subject of conjecture. And so various opinions are allowed. But. But then there may. There may be some that are disallowed too. But, you know, and so there are things I want to believe are true and I just need to find out if it's okay."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8358.66,"end":8359.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8359.46,"end":8360.82,"speaker":"Fr Stephen De Young","text":"Can I find true."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8360.9,"end":8364.5,"speaker":"Fr Andrew Stephen Damick","text":"Can I find someone somewhere who said something like this? Aha."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8364.88,"end":8392.89,"speaker":"Fr Stephen De Young","text":"Permission. Yeah. Right. And let me suggest a more radical solution. If it's a theological topic on which there is. There really is no teaching, there is no authoritative teaching within the tradition of the Church on it, you shouldn't have an opinion. Yeah, right. Like, just don't have one."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8392.97,"end":8408.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because. Because. Because everything that is given to us. I'll probably say more about this at the end, I think, but I just want to say it here. Everything that is given to us in the church is for the sake of our salvation, not for the sake of having an opinion about everything."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8411.93,"end":8511.28,"speaker":"Fr Stephen De Young","text":"Yes, yes. This is why, and I know it confounds some people, this is why there are things I'm not interested in talking about. I'm not interested in talking about the date of the Exodus. I literally don't have an opinion. I know about the late date, I know about the early date. I know about the even earlier date. I don't know for sure that any of those three is the accurate date. I believe the Exodus happened, but I have no opinion on the date. There's no church teaching about which date is correct, so just not of concern to me. And you know, hey, if you want to have a really strong opinion about that, and I know people who do, and you want to spend a lot of your life arguing about it, go for it, man. I play like wrestling video games, so I waste time too, but like that, it's the same level of usefulness in terms of salvation. Right. Me playing online matches of Mortal Kombat and you having online arguments about the date of the Exodus are of equivalent value. Right. And if you accept that, fine. That's your hobby, great. But this issue is an important issue, and this issue there is very clear church teaching on. And so it behooves us to accept it, especially if we don't like it. Everybody believes in authority until authority tells you to believe or do something you don't want to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8511.28,"end":8513.44,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8514.56,"end":8517.92,"speaker":"Fr Stephen De Young","text":"Everybody believes in the tradition of the Orthodox Church until it says something they don't like."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8518.16,"end":8537.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, obedience requires, almost requires that there be a difference of opinion and that one person's opinion is going to be the determining opinion. Although in this case it's not about personal opinions, it's about the teaching of."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8537.97,"end":8546.89,"speaker":"Fr Stephen De Young","text":"The Church, which is objective and accessible, not unknown and. Or unknowable."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8547.61,"end":8553.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. You should not have to dig. Yeah, you should not have to dig. Right. To find."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8554.02,"end":8561.78,"speaker":"Fr Stephen De Young","text":"Well, there's this thing right in my face, but I don't like it. So I'm gonna dig. I'm gonna try and find some way under it, around it. Right?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8562.02,"end":8575.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I know. I even saw someone, you know, like there's this made up word, infernalism, which is used by universalists to describe the teaching of the church, frankly."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8575.78,"end":8578.52,"speaker":"Fr Stephen De Young","text":"Yeah. Yes. People who hold the apostolic teaching."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8578.6,"end":8588.92,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And like it's used to describe someone like St. John Chrysostom even. And I'm like, you know, if St. John Chrysostom says Something. And your response is, could I talk to somebody else?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8589.88,"end":8590.44,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8592.44,"end":8598.12,"speaker":"Fr Andrew Stephen Damick","text":"It'S hard for me to believe that you're orthodox. Like, you can't get more mainstream than him."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8599,"end":8600.68,"speaker":"Fr Stephen De Young","text":"Second. Second opinion, please."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8601.16,"end":8601.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8607.98,"end":8644.68,"speaker":"Fr Stephen De Young","text":"Right. And that's not to say. So, for example, before heading off an email, right, like, thank you, somebody out there is going, well, St. John Chrysostom said that the Nephilim were Cain's descendants and Abel's descendants. And you guys say this other thing, right? That's what's coming, right? Go back and listen to that episode where we lay out facts about what the church fathers say, including that one. And our goal there is to reconcile what the fathers say where they apparently disagree."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8644.76,"end":8650.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Not to say, well, I just disagree with this church Father. I want to be with this other one."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8650.68,"end":8667.05,"speaker":"Fr Stephen De Young","text":"And if you do that on this issue, right, so, for example, you go to St. Gregory of Nyssa and you read something, you say, well, that almost sounds like apokatastasis, then using this approach, you would say, but all of the church fathers teach against that, so that can't be what St. Gregory means."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8667.21,"end":8685.54,"speaker":"Fr Andrew Stephen Damick","text":"Which, if I recall correctly, is basically what Saint Photius says at one point. Like, someone's like, yeah, I might be misremembering, but he said. I think he said, well, some say that he taught apokatastasis, but that is a scandalous slur against him. He would never have said such a thing, you know?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8685.54,"end":8705.46,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. So if you use that approach on this issue, right. You don't end up saying, well, I could kind of read these two people to agree with me, therefore I reject everyone else. That's never our approach on anything on this show. Sorry."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8706.74,"end":8710.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's. So it's not orthodox. It's just. It's just not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8710.82,"end":8824.86,"speaker":"Fr Stephen De Young","text":"Yeah. So that's kind of the. If there is a positive argument, right, Made for apokata stasis, it is that kind of positive argument from some kind of divine necessity. And we've just gone through how problematic that is. Most of what you get, though, is not that even, right? The more sophisticated form, like Hart's book, you get that at least, right? Problematic as it is, you at least get that as a positive argument. But most of what you get, including in that book, are a bunch of negative arguments directed at particulars of a Western view of hell, which is also kind of problematic, Right. If most of your arguments for your position are just a bunch of negative arguments against a particular other position, you don't have any strong arguments for your position, right? It's not even negative arguments against all of the other possible positions. It's just one of them. And making these arguments even weaker is the fact that they are arguments against that particular Western view, which is kind of a caricature, that are. That accept the presuppositions of that very view. Don't question those presuppositions. So they're not even like strong undermining arguments to that view. What do I mean by that? Well, so, for example, when they attack this Western view of hell, they presume a certain definition of what sin is."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8827.02,"end":8827.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8827.9,"end":8833.66,"speaker":"Fr Stephen De Young","text":"The person who believes in apocatasis accepts the presupposition that sin is the violation of a statute."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8833.66,"end":8835.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It's breaking a rule."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8836.06,"end":8931.24,"speaker":"Fr Stephen De Young","text":"Right. And that breaking that rule requires punishment. Right. And it even accepts the presupposition that God must punish every sin. Right. Here we have divine necessity. Again, must. Right. So where's the quibble? Sounds like you've accepted almost the whole farm. The quibble is then, oh, but punishment must be proportional to the offense. So it says to that particular Western view, we agree with you that sin is breaking a rule and it makes God angry. And God has to punish sinners. And we agree with you that God must punish every sin to its full extent. We just disagree about the extent. Right. So already, if you've been listening to this show for very long, you know that the Orthodox Church does not actually accept any of those presuppositions, doesn't accept that God must punish every sin to its full extent, does not accept that sin is primarily rule breaking, does not accept that it makes God irate. We already went over that, this episode. Right. But they then argue that. So eternal punishment, punishment that goes on forever, is disproportionate to sins that are committed in time, in this life. And so there's this really interesting passage in Theodore Abukura."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8932.2,"end":8947.36,"speaker":"Fr Andrew Stephen Damick","text":"Yes, Theodore Abukura. Look him up on Wikipedia, everybody. He's a medieval Arabic Orthodox Christian Bishop of Iran and has a massive corpus of writings. Does not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8947.6,"end":8949.08,"speaker":"Fr Stephen De Young","text":"A lot of which is not translated."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8949.08,"end":8964.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, A lot's just still in Arabic. Does not seem to have. Does not seem to be on any Synoxodian, that is to say, like a calendar of saints right now. But he is spoken of as a saint in a lot of medieval Arabic Orthodox Christian writings."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8965.68,"end":8971.12,"speaker":"Fr Stephen De Young","text":"Later Christian writings refer to him as Saint Theodore Abu Qur, but we couldn't find him on a calendar. That's why we didn't call him saint."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8971.12,"end":8972.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8972.23,"end":8974.11,"speaker":"Fr Stephen De Young","text":"Because we're trying to be consistent about that. Too."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8974.11,"end":8974.63,"speaker":"Fr Andrew Stephen Damick","text":"Yep."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":8977.11,"end":9169.61,"speaker":"Fr Stephen De Young","text":"So he has a number of sort of dialogues. They're a little bit Plato's dialogue, ish with frankly, various heretics. And one of those is with an Origenist, because, go figure. The 8th century Theodore Abakura is bishop of Huran in Mesopotamia, thought Origen was a condemned heretic. Go figure. And the discussion with the Origenist is specifically about apokatastasis. So he not only thinks that Origen is a condemned heretic, he thinks he's condemned on this point. And this is that sarcasm they're going to point out that I mentioned earlier. And he basically. So when. When the originist makes this very argument, Right. Says, well, what you're talking about is an eternal punishment for for sins that were committed in time. And that's unjust. Right. This whole justice thing where goddess live up to justice. Because guess what, like we said, they're basing this on Plato's view of God. So we're Origenists, right. So then how does that work out? And Theodore's response is essentially, I'm summarizing a little bit. How are you defining justice? Right. He says, are you defining justice by nature? He says, if you're going by nature, I can think of a lot of examples, like where someone gets wounded and it takes a second. Right. But the consequences of that wound, the pain from that wound, the suffering from that wound as it heals, take a long, long time. And he says, are you talking about justice like the legal system? He says, because I can think of examples of the legal system. Someone murders someone, it might take them a few seconds to murder the person, but we then go and we execute them, and that executing them is kind of permanent, right? That's right. And he says, you know, if someone came and had sexual relations with your wife, would they only be punished for the period of time it took? Right. For the sin to happen, for the crime to happen? Right. He's like, well, no. Right. So Theodore's counterargument is simply, you're using this word justice. I don't think it means what you think it means."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9172.09,"end":9172.49,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9173.69,"end":9177.13,"speaker":"Fr Stephen De Young","text":"That you're declaring something unjust, but on no basis."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9178.49,"end":9179.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's notable."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9179.65,"end":9181.13,"speaker":"Fr Stephen De Young","text":"By the way, other than your own predilection."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9181.13,"end":9205.29,"speaker":"Fr Andrew Stephen Damick","text":"I was going to say it's notable, by the way, that Theodore Abukura was also a monk at Marsaba Monastery, where St. John of Damascus was, and in many ways is kind of like his intellectual successor, but he's really the first church father writing in Arabic, which is pretty interesting all on its own. You know, living in early Islam and so forth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9205.29,"end":9209.39,"speaker":"Fr Stephen De Young","text":"But yeah, a lot of his writings are interacting with Islam."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9209.78,"end":9234.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I like, I like the way that he reasons the way you just described, like, because it's about like, well, let's get this down to brass tacks and stop. You know, appear in the, the rarefied, ephemeral world of, you know, concepts that interact with each other and down to like, okay, what is actually justice on the ground? How does this look? You know, it's not just a theory. Like, this is. This is real, you guys."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9236.38,"end":9252.54,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And there's also another presupposition that is just sort of accepted that we've already kind of dealt with tonight is they accept the presupposition that repentance is basically regret or guilt."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9254.22,"end":9258.22,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Surely everyone would feel bad when faced with eternal damnation."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9259.18,"end":9289.44,"speaker":"Fr Stephen De Young","text":"Yes. If you're under eternal condemnation, you would feel bad. Right. You might even feel regret, like, man, I wish I wasn't here. Right. But you know, first of all, this assumes that, you know, these departed condemned humans, Right. In the state that they're in and demons sort of have feelings the way we do. But more important, as we said earlier, feelings are not repentance."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9289.82,"end":9299.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, there's a difference between Judas and Peter. Judas, it says explicitly in the scripture, felt regret, but Peter actually was reconciled with the Lord."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9299.66,"end":9314.14,"speaker":"Fr Stephen De Young","text":"Right. They both had the same feelings. Judas and St. Peter had the same feelings after they betrayed Christ. They both betrayed Christ. They both had the same feelings. They did different things."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9314.46,"end":9314.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9315.99,"end":9373.54,"speaker":"Fr Stephen De Young","text":"Based on those feelings. Right. So that just assumes feelings. So. And therefore they just assume that at some point in this state they will quote, unquote, repent. They will quote, unquote, have their feelings change. And really related to that, the idea. Well, well, I mean, on a long enough timeline, I mean, wouldn't eventually everybody sort of wise up. Right. You often within these views of apokata stasis to try to make them work. Right. Because generally these folks find like just full on apocatastasis. Everybody dies, everybody goes to heaven, everybody's resurrected, everybody enjoys eternal life in the world to come. Right. They find that somewhat distasteful or at least some of the consequences."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9374.02,"end":9374.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9374.66,"end":9385.46,"speaker":"Fr Stephen De Young","text":"Right. You point out to them. So you're saying Anne Frank and Adolf Hitler. Right. Experience the exact same afterlife of eternal bliss."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9385.7,"end":9387.94,"speaker":"Fr Andrew Stephen Damick","text":"I mean, that's what it comes down to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9388.58,"end":9398.89,"speaker":"Fr Stephen De Young","text":"Right. But saying that it's that from the jump. Right. They recognize the problem. And so what gets inserted is a purgatorial idea of hell."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9399.21,"end":9399.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9400.89,"end":9442.59,"speaker":"Fr Stephen De Young","text":"And I Say, purgatorial deliberately, because basically they're taking the Roman Catholic conception of purgatory and trying to sort of refab that into a stopgap. Right. So you say, well, Hitler's gonna have a real bad time for a long time before he gets to that eternal bless. Right. But this requires a whole bunch, again, of presuppositions that are foreign to at least the orthodox Christian tradition and the Scriptures. Right. Which, for example, they're going to be punished for some period of time. Well, number one, time."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9443.63,"end":9444.03,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9444.75,"end":9446.67,"speaker":"Fr Stephen De Young","text":"This assumes time works at the age of God."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9446.67,"end":9446.91,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9446.91,"end":9461.27,"speaker":"Fr Stephen De Young","text":"There's, like. There's this really caricatured view of the way purgatory works in Roman Catholicism, which, to be fair, a lot of people in the medieval church talk like that's their view."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9461.43,"end":9464.31,"speaker":"Fr Andrew Stephen Damick","text":"Oh, totally. Yeah. I mean, it's not."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9464.55,"end":9466.95,"speaker":"Fr Stephen De Young","text":"But modern Roman Catholics are more sophisticated about it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9466.95,"end":9467.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9468.55,"end":9540.37,"speaker":"Fr Stephen De Young","text":"And the great Roman Catholic theologians of the Middle Ages were also more sophisticated about it. But you get a lot of common stuff of just like, hey, this indulgence is two years off purgatory. That makes it sound like purgatory is a place that experiences a linear succession of moments the same as we do. Right. As I said, that's a caricature of what the Roman Catholic Church authoritatively teaches. Right. But. But that's sort of what this is based on within these folks who believe in apocatasis is that there's some time, and they need that time, like, in order to parcel off an amount of suffering. Because, remember, their whole argument for this is based on proportionality. So there are some sins that are, like, really bad and some that are less bad, and there's a certain amount of suffering, and you kind of need to use time. I suppose you could use intensity. There's a certain amount of suffering that then is the proper punishment for that individual sin based on something."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9541.09,"end":9545.49,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, you can see this is a kind of parody of purgatory."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9546.53,"end":9554.6,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And there's just simply nothing in the Scriptures for which you could derive any idea of this."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9554.75,"end":9562.83,"speaker":"Fr Andrew Stephen Damick","text":"This. No. Yeah. The idea of making satisfaction, especially in terms of like, well, you need to do this much because. For this."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9565.15,"end":9577.55,"speaker":"Fr Stephen De Young","text":"Right. So, like, the. The. The Torah does not parcel out, like, inflicting X amount of pain for X amount of time in response to breaking this commandment."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9577.79,"end":9591.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Nor. Nor is there. I mean, correct me if I'm wrong, nor is there even, like, a sense of, like, okay, well, if you killed someone, this is a sacrifice you have to make. But if you kill two People, then you have to do twice as much. Two bulls or whatever."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9591.2,"end":9603.6,"speaker":"Fr Stephen De Young","text":"Right? No, no, it's based around restitution. Right. It's all based around restitution. Restoring. Right. The way we talked about repentance. Right. Making it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9603.6,"end":9603.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9604.32,"end":9619.93,"speaker":"Fr Stephen De Young","text":"Fixing it, repairing the damage, which. Right. Like, no amount of inflicting pain on Hitler, like, accounts for what Hitler did."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9620.65,"end":9622.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. It does not undo the Holocaust."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9623.53,"end":9721.02,"speaker":"Fr Stephen De Young","text":"Yeah. There's no calculus there. It doesn't repair anything. Right. And allow me to submit that his victims will either forgive him or not. Would either forgive him or not forgive him, but they wouldn't do it based on, like, well, I can't forgive him until he's experienced 1374 days of intense pain. Then I can forgive him. Right. Like, I mean, this. This literally doesn't make sense. Right. This is less sensible, this makes less sense than the Church's teaching on the subject. Right. So sometimes to get away from that. Right. Since that's obviously super problematic and difficult and doesn't make a lot of sense. And this is more or less trying to leave aside this caricature of Roman Catholic purgatory and move more toward a caricature of Protestant sola fide. Again, a parody. Right. And as we were talking about earlier in the episode. Right. This move away from belief in content to feeling. Right. So the idea is that essentially they reject God, they don't believe in God, they don't accept God, they don't want to worship God, they don't want to serve God, and so they're sort of put into this hell and tortured until they change their mind about that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9721.02,"end":9727.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. One day, after a thousand years of torture, they're gonna be like, I think I made a huge mistake."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9728.34,"end":9740.66,"speaker":"Fr Stephen De Young","text":"Yeah, okay, fine, I'll worship God. Right. Again, kind of super problematic."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9740.98,"end":9742.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Torturing people into changing their mind."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9743.85,"end":9753.93,"speaker":"Fr Stephen De Young","text":"Yes. Right. And if this is what God is going to do, then doesn't this justify, like, the Spanish Inquisition?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9758.09,"end":9760.09,"speaker":"Fr Andrew Stephen Damick","text":"Nobody justifies the Spanish Inquisition."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9760.33,"end":9772.96,"speaker":"Fr Stephen De Young","text":"Should we go imitate God and go torture people and use the rule of law and use everything we can to get them to accept Christ so they can have eternal life?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9773.12,"end":9774.56,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So that they can maybe."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9774.64,"end":9776.84,"speaker":"Fr Stephen De Young","text":"I mean, that's what God's going to do, according to these folks."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9776.84,"end":9781.96,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So they can skip it. Skip the eternal, not really eternal economy. Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9781.96,"end":9810.57,"speaker":"Fr Stephen De Young","text":"They should thank us. This is the inquisitor's idea of. Right. This is the Grand Inquisitor's idea of God and evangelism. Right. Being promoted by the apokatastasis, people whose raison debt is that they want to believe in a kinder, gentler God, and now they've become the Grand Inquisitor."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9811.21,"end":9811.57,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9811.57,"end":9826.98,"speaker":"Fr Stephen De Young","text":"These are those consequences we were talking about that are worse than the problem you're trying to solve. Some of them even go a little further and want to say, oh, tortured. Tortured."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9827.86,"end":9828.26,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9830.1,"end":9873.48,"speaker":"Fr Stephen De Young","text":"God isn't inflicting suffering. It's just. That's how they're experiencing God's love. God's just loving on them so hard, and they hate him, so they experience it as pain until they relent and love him back. So this is God is Glenn Close. Right. Like in Fatal Attraction. This is God is Lenny and Of Mice and Men. Like I don't like. Again. Right? These folks are going to say this and then say that the God taught by the apostolic teaching preserved in the Orthodox Church is a monster."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9875.81,"end":9876.25,"speaker":"Fr Andrew Stephen Damick","text":"Yikes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9876.25,"end":9890.97,"speaker":"Fr Stephen De Young","text":"For allowing people to choose eternal condemnation, that makes him a monster, but him aggressively loving people torturously, painfully, until they relent and love him back. Oh, that's cool. That's. That's good."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9890.97,"end":9895.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, and. And knowing full well that it hurts. Yes."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9896.29,"end":9898.21,"speaker":"Fr Stephen De Young","text":"You know, knowing that it's torment."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9902.94,"end":9903.18,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9904.46,"end":9939.29,"speaker":"Fr Stephen De Young","text":"Yeah. Now, just to cover another term, part of what happens, as I mentioned, is there's. There's a lot of. There's a lot of ways. There's a lot of logical fallacies at work here. Right. But one of the big, biggest ones is the construction of a false dilemma. Right. As I said, a lot of the argumentation is just negative argumentation toward a strawman of a particular Western view of hell."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9939.69,"end":9940.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9941.77,"end":9982.62,"speaker":"Fr Stephen De Young","text":"And therefore, because that's all the argument the proponent of apocatasis has, they have to present the false dilemma of either you agree with me about apocatasis in some form, or you hold to this caricature view that I'm attacking. Right. There can be no other views, because if there are any other views, their whole argument falls apart because it's mostly negative arguments toward that one particular caricature. And what they call that caricature, for those of you who have been fortunate enough not to be involved in any of these arguments, is eternal conscious torment."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9983.28,"end":9988.72,"speaker":"Fr Andrew Stephen Damick","text":"Yes. If you Google that exact phrase, you will come up with 33,900 hits."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":9989.76,"end":10014.95,"speaker":"Fr Stephen De Young","text":"Right. And so this is presented as. This is the view of hell held by everyone who doesn't believe in apokatastasis. Right. And to show once again, we've already shown it, but quickly to show once again why this doesn't work. Right. You got three words. Eternal conscious torment. What does eternal Mean, here, before you."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10014.95,"end":10025.31,"speaker":"Fr Andrew Stephen Damick","text":"Get into that, I should. I want to just say, by the way, since I decided to Google up eternal conscious torment, like. Like this, there is actually an essay on the Gospel Coalition website."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10027.63,"end":10028.99,"speaker":"Fr Stephen De Young","text":"Which they've just accepted."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10029.15,"end":10064.36,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, and. And this is not like. I mean, I'm not a fan of the Gospel Coalition website. Just put that out there. But, like, this is not just. This is not just pop theology. This is. These are actually people who have. Do a little bit of theological work and have some. You know, like, this is theoretically some kind of mainstream Calvinism or whatever. I don't know. It starts out this way. This is how the essay begins. Hell is a place of eternal conscious torment for everyone who does not trust in Jesus Christ. Like, that's how it starts out. So, like, you know, this is a real view that they're responding to."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10065.48,"end":10076.76,"speaker":"Fr Stephen De Young","text":"Well, yeah, they tend to respond to caricatures of it. But also, never underestimate the ability of a Calvinist to wholeheartedly believe in a caricature of his own position."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10078.52,"end":10079.32,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10081.56,"end":10140.99,"speaker":"Fr Stephen De Young","text":"That is a Calvinist argument strategy. I've heard this many times. Right. Literally, I know Calvinist professors with PhDs and theologians who, if you try to say, well, that makes God the author of evil, they just say, yeah, so, Right, right. Or if you say, well, that makes human beings just robots, they say, like, yeah, so, right, exactly. Right. So I have a feeling that's coming from an. Okay, sure, eternal conscious torment, but from the perspective of the orthodox view that we've been talking about has nothing to do with this. What does eternal mean here? Does it mean an unending series of moments in the sense that we experience time? Now, how does time work in the age to come?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10140.99,"end":10144.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, we have lots of reasons to believe that that's not the way it works."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10144.64,"end":10160.88,"speaker":"Fr Stephen De Young","text":"Right, right. We're talking about the age to come, which is an age that has no end. Yes. But that is experienced time the same way. So what do you mean by eternal? Right. What does conscious mean here? How does consciousness work of the age to come?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10161.76,"end":10168.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what about the whole weeping and gnashing thing again? The madness? So, like, what kind of consciousness is that?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10168.8,"end":10214.47,"speaker":"Fr Stephen De Young","text":"The loss of humanity? Yeah, yeah. What does that mean in terms of consciousness? What does torment mean here? Torment in the sense that it's unpleasant torment in the sense that God or someone else is actively torturing people. What do you mean by that? Right. Because this isn't. We in our second half repeated the biblical language about this, said, here's the images in Scripture, here's the language about this and this is how it gets picked up in the Orthodox tradition. And this isn't the language. Eternal conscious torment is not the language that's used by the Scriptures, the Fathers or our tradition."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10214.47,"end":10254.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And a lot of universalist critiques of eternal conscious torment will talk frequently about the idea like, you know, well, you guys believe that God is torturing people forever, but that's not what the scripture actually says. It does talk about being in torment forever. Right. That we see that in Revelation in which that language is specifically applied to demons, but it doesn't say, and God will torture them forever. The only way you can connect those dots is again using a Calvinist God where literally everything that happens. God has willed that thing to happen. He's making it all happen. So it's deterministic monergism."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10255.33,"end":10299.01,"speaker":"Fr Stephen De Young","text":"God is the only one who really has activity and activity. Yeah. Everything else in the universe is passive before God. So again, Calvinism. So yeah, to an extent. To an extent. This whole argument between apokatasis and etro conscious torment is an intra Calvinist dispute. It's the same presuppositions. It's the same. Right. And that's all it is. And so where does the Orthodox Church stand on intra Calvinist disputes? Nowhere."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10300.29,"end":10301.41,"speaker":"Fr Andrew Stephen Damick","text":"Let them duke it out."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10302.13,"end":10322.05,"speaker":"Fr Stephen De Young","text":"Right. We don't share those presuppositions or shouldn't at least. But so. Right. So are we saying that some significant number of people are going to be condemned eternally? No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10322.69,"end":10323.33,"speaker":"Fr Andrew Stephen Damick","text":"We don't know."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10323.73,"end":10333.84,"speaker":"Fr Stephen De Young","text":"Right. No. Are we saying anyone in particular is going to be condemned eternally? Even Hitler? No."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10334.32,"end":10340.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I think you might be able to make a decent argument for Judas. As I recall some."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10340.8,"end":10345.44,"speaker":"Fr Stephen De Young","text":"Well, the Bible says Judas went to Hades, but even that. See, we disambiguated that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10345.44,"end":10346.44,"speaker":"Fr Andrew Stephen Damick","text":"There you go. Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10346.44,"end":10385.84,"speaker":"Fr Stephen De Young","text":"Yeah, that's right. So we don't know. And the fact that we don't know means it could be zero. It could turn out in the end, on the Day of Judgment that every human being is reconciled to God. Now doesn't that contradict everything we've just said? No, if you think it does, you haven't been listening clearly. Because the problem, what's condemned about apokatastasis is the idea of necessity and inevitability."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10386.16,"end":10390.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. That as one person put it, that all shall be saved."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10391.28,"end":10433.49,"speaker":"Fr Stephen De Young","text":"Right. So we don't counter the idea that God is required to reconcile everything to himself with the idea that God is required to not reconcile some things to himself. Yeah, we counter it with the idea that God is completely free, meaning God is free to reconcile every human person to himself and grant them eternal life if he so chooses. He is also free to send any of his creations to eternal condemnation. Right. God is free to do these things."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10434.04,"end":10434.28,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10436.92,"end":10459.48,"speaker":"Fr Stephen De Young","text":"So then why is it so important to condemn this idea of necessity? Why does the idea of necessity make it a heresy? Right. And that's because. That's because of the consequences of believing that."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10460.1,"end":10460.5,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10462.82,"end":10554.22,"speaker":"Fr Stephen De Young","text":"We'Ve outlined some of those over the course of this episode, and especially this third half, but also the consequences to repentance. It is critically important that we accept the teaching of Scriptures and the apostolic teaching as it's been preserved within the Orthodox Church about the possibility of eternal condemnation for me, not for other people, not for my enemies in quotation marks. Right. Not for the people I don't like, not for the people I resent. Right. But for me, that I have that possibility in my mind to drive me to repentance, meaning to drive me to actually do things about repentance. Right. To drive me to take my sin seriously, to drive me to be ever more faithful to Christ, to drive me to pursue Christ. Right. So the way I've summarized this in the past is universalism may end up being true in the sense that every person might be, but you can't be a universalist. It is a sin to embrace the heresy of universalism even if it turns out to be true."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10554.94,"end":10555.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10556.38,"end":10628.05,"speaker":"Fr Stephen De Young","text":"Right. And again, this is about yourself. We do not, as Orthodox Christians, and the Church does not teach that you must accept that some particular person whom you loved is going to face eternal condemnation, because the Church hasn't said that that person is under eternal condemnation or will be under eternal condemnation. Even being anathematized, even being condemned like Origen by an ecumenical council doesn't say that he is going to face eternal condemnation. That judgment is up to Christ at the Last Judgment. So you do not have to believe that just because the person you loved died outside of the bounds of the Orthodox Church or Christianity broadly conceived, having committed some sin that they didn't obviously repent of, you are not required to believe that they are going to face eternal condemnation on the last day. In fact, you're called to pray for them."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10629.81,"end":10634.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And what would be the point of praying for them if there was no hope for them?"}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10635.25,"end":10697.57,"speaker":"Fr Stephen De Young","text":"Right. If that's already sealed, you're called to pray for them. Right. You're called to intercede for them. You're called to, as we talked about earlier in the episode, repent on their Behalf. Right. This is the actual solution to that problem that the church gives us that doesn't have all those horrible follow on consequences. The church gives us something to do. We offer memorials, we offer memorial prayers. We gather together as a church and remember the people we've lost and remember the people we love who are departed. Right. We pray for them, we try to make things right. Right. Where they're not able to. We have these concrete things to do to work out those feelings and those fears and those doubts regarding those we love who have passed away. Right. And just flipping the switch and saying, oh, okay, I've got this intellectual argument where I don't need to worry about it anymore. You know, assurance of other people's salvation that comes through apokatastasis."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10698.76,"end":10699,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10701.96,"end":10709.48,"speaker":"Fr Stephen De Young","text":"Like crosses, those wires, short circuits, the whole thing. Because now I don't need to do any of those things."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10712.68,"end":10713.08,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10713.16,"end":10729.18,"speaker":"Fr Stephen De Young","text":"So in this area, accept the recourse that the Church has given you the fix and the healing method that the church has given you, rather than rejecting the Church's teaching and going after apokatastasis."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":10734.7,"end":11470.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So to summarize, I mean, there's a lot of things, a lot of thoughts running around my head, you know, at this point in my life. I've been an Orthodox Christian for 20, a little over 25 years. But I remember immediately before I learned about the Orthodox faith and became Orthodox that I began to have a lot of questions about the faith in which I was raised. And it was not because I encountered arguments against it. Right. I didn't meet some apologist telling me that evangelical Protestantism was wrong. It actually came out of the internal theology of that movement. Certainly we were not universalists, right. But we definitely believed in what is called eternal security, which is another variation on a lot of these things, which is sometimes summarized as, well, once saved, always saved. It's a kind of, you know, truncated version of one of those points on the Calvinist tulip, perseverance of the saints. And so, you know, I was raised with this idea that once you get saved, which is an experience of often praying a particular prayer to God, repenting of your sins, asking him to be the Lord of your life and you trust him forever for your salvation. These kinds of things together. And those of you who are familiar with this tradition, you probably recognize that combination, that once that happens for you, then you have effectively your ticket to heaven. You've got it, you can't lose it, no matter what you do right now. It was generally also believed that if you really did have it that there would be effects in your life, that you wouldn't live an evil life, that the worst that can happen to you is that you would become. And I always love this word. This is very common in Baptist circles, backslidden. You know, still saved, but backslidden. In other words, you're a Christian, you got your ticket to heaven, but you're not living right. Well, one of the questions that I began to have in my late teens and early 20s was, okay, if I really do have my salvation kind of wrapped up, if it's taken care of, if assurance of salvation means absolute mathematical certainty of salvation guaranteed, right, Then what am I doing in church? What am I actually accomplishing here? Also, why should I behave according to moral strictures? Why? Because it's not. Because I just suddenly had this inner impulse, like, I want to do evil things. I want to taste the wild side. But, for instance, the job that I worked, I was paid by the hour. So it was often the case that I would get offered work on Sunday mornings. And since I wasn't making a lot of money, there was good reason to work on Sunday morning. And if I didn't believe that participation in corporate worship actually had any critical effect in my Christian life, then why did I need to prioritize it such that I would do things like make less money, especially at a time in my life when I really could use the money? Since I didn't have a good response to that question, I began to take some work on Sunday mornings. I was on church on other Sunday mornings, but I didn't just sit home, But. But it seemed like a pretty decent balance. I was like, oh, well, I'll work sometimes, and certainly someone's in college. I was in my early 20s. There are definitely moral temptations. There are definitely things that I wanted to do. I didn't really see the harm in them, but I had been told that they were wrong. And so I was like, but I got my salvation nailed down. Why? If I just, you know, if I do it this one time or whatever, even if I have a pattern of doing it, like, there's no actual risk, right? So part of the reason that I became orthodox, one of the motivations that I had was because of this question of, like, well, what am I supposed to be doing as a Christian? Is there something to do, Something more than just recruit more Christians? Which, again, I could just ignore if I wanted to. Not absolutely required. Is there something more to do? And then I encountered the Orthodox Church and encountered the teaching that life is supposed to be about repentance, that the whole life is for repentance. And this was utterly revolutionary for me, utterly revolutionary, because it made everything that I did critical. It made everything that I did important. It made everything that I did have an ultimate effect of permanent importance, right? It did not mean that all of my history, other than that one moment of getting on my knees and praying when I was 6 years old in front of my bed, that all the rest of that history didn't matter. It meant that it all mattered, that it's all going to be carried with me into eternity, that it all becomes permanent, right? And the whole shape of my life is what will be carried forward. The consequence of universalism is that it doesn't matter. Like, no matter what version you want to put on it, whether it's the. Well, it matters temporarily, but not long term. It still ultimately doesn't matter. That's why some critics of universalism have said that it's the erasure of history, because it is right. Saint Paisios famously said, don't believe those who say that all will be saved because it means that we won't struggle. I mean, that's pretty straightforward. Because if there is nothing at risk, if eternal condemnation is not a possibility, then the fire that's going to be lit under a Christian is just simply not there. Now, someone might argue, well, shouldn't you have a better reason to struggle than just being afraid of being punished? Well, again, we talked about all of that, right? The point is that there is something at risk. There is something at risk. Another one of the modern Holy Fathers of the Church, St. Silouan the Athanite. I just saw this again recently. I was reminded of this. He said this. Understand two thoughts and fear them. One says you are a saint, the other, you won't be saved. Both of these thoughts are from the enemy, and there is no truth in them. But think this. I am a great sinner, but the Lord is merciful. He loves people very much, and he will forgive my sins. If you eliminate one side of that right, then you're eliminating the whole Christian life. Repentance ultimately does not matter. It's optional. Like, it's a bonus even for the people who say that, you know, hell is a kind of purgatorial experience that will eventually go away. So it's like, well, you can repent now or you can repent in the next life, Eh? Why shouldn't I? Wait, why shouldn't I? I could have both. I could have my cake and eat it too, you know, so universalism, like the Calvinist arguments on which it depends, eliminates the very character of repentance. And repentance is to change, to become more like our Lord Jesus Christ, right? It's to become more like our Lord Jesus Christ. As we said, it's not about feeling a certain feeling or feeling bad, guilty or whatever, regretful. It's about becoming more like our Lord Jesus Christ. And so being saved is to become like Christ, right? So you can't be saved without repentance. That's like saying, I want to, you know, get wet without any water. Like it's not a thing. It's not a thing. You can't get wet without water. You can't be saved without repentance, because repentance is the process of being saved. Salvation is not a status that you receive at the end. It is becoming more like Christ. It is this elevation to become, as the Lord says, equal to the angels, right? So, you know, as Father Stephen said, we don't know. We don't know how many or if any actually will be eternally condemned. And God forbid, like, I think I find it really reprehensible sometimes when certain people say that if you believe in eternal condemnation as it's laid out in the Scripture and church fathers and so forth, that means you like the idea of people suffering. Excuse me. False. Utterly false, Right? The fact that I believe that frightening things are true does not mean I want them to be true, right? Something is true whether or not I want it to be true. That's part of why it's true, you know? But the whole Christian life, it's not that it's about trying to avoid eternal condemnation, right? But that is one of the things that's included in the broad, comprehensive, complicated, and endlessly fascinating image that the Scriptures and the whole orthodox tradition present in order for us to fix our eyes on Christ and to press forward to the prize of the high calling of God. As the Apostle Paul said, maybe you don't need to think about eternal condemnation in order to do that. But, you know, some of the saints who are the holiest people, like the holiest people who really knew God and really loved him, that was part of their toolkit of salvation. If St. Paisios uses that as part of his toolkit of salvation, then who am I to think that I don't need that? You know, I'm nobody. I'm nothing like him in terms of sanctity. And so if he needs it, then how much more do I need it? It's not because I want to dwell on darkness and gnashing of teeth and lake of fire or whatever, but it's. I need to know that there's this boundary that exists there. There's a boundary, and unless I keep vigilant, I could be potentially tossed over it. Father. So."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":11474.19,"end":12203.21,"speaker":"Fr Stephen De Young","text":"Everything I'm about to say is once again aimed not at good people who are drawn toward some kind of view of apokata, stasis for emotional reasons, out of love for a departed loved one, that kind of thing. There are a lot of people, as we've said several times, who are drawn to it because of that. And honestly. And while we've argued that's a bad solution, what I'm about to say is directed at the other group, because there is this other group that finds it attractive, I think, for other reasons. And what these folks have in common is a certain class identity. To be blunt, right? We're talking about upper middle class intellectuals, college professors, other people in the professional managerial class. There's a reason it's referred to as liberal theology. And it's not just that, like, oh, those people are libs, and therefore they believe liberal theology. It's much deeper than that. Right? So liberalism, property brings about and grows through the bourgeois revolutions of the 18th and 19th centuries, right? Where starting in the US and France, the mercantile class seized political power through violence from the feudal nobility, the king, the lords, right, who had previously possessed political power, the newly expanding mercantile class had money. They seized political power through revolution. They became the new governors and rulers of the territory, and with their newfound political power, were not per se inclined to the same sense of obligation before God that their feudal predecessors had been. Because in addition to not accepting the hierarchical ordering of the world in feudal monarchy, they also didn't accept the hierarchical ordering of the world religiously within the Church. This is why the French Revolution, they go after the Roman Catholic Church. This is why Roman Catholicism was so very unpopular throughout US history. Orthodoxy too, by the way, though to a lesser extent, because we were a smaller presence. But go look at the history of the Greek community in Toronto, in Canada, for examples of how they face the same kinds of persecutions that Roman Catholics did in the United States. That was sort of rejected. And so that class of people wanted authority not only in the realm of politics, but also in the realm of religion. And so you get the creation, for example, in the United States in the colonial period of a pastorate that is in parallel with this mercantile class. You have lawyers, you have physicians, you have pastors and parsons, right? And these are the influencers society. And again, because they now receive this religious authority too, one might expect that in the same way a feudal lord had certain obligations that they viewed as imposed by God on them morally toward the peasants who work their lands, right? You might expect that the new sort of nobility might feel those same obligations, or that because they now had this religious authority, they might feel the same obligations that bishops did to care for the poor and, and those who are under their authority. And frankly, the whole current of philosophy and theology at the time ran in the opposite direction, ran in the direction of justifying why there is no such responsibility, why the person who has worked hard and earned his position of power and authority has no obligation to those beneath him in terms of the class structure. Because those people are beneath him, because they are reprobate, they are less virtuous. And if they are virtuous, they will inevitably arrive at their own station. This is just a constant current in intellectual history. And this grasping of universalism by this university intellectual class among the upper middle and lower upper class in the United States and Europe is part and parcel of this, right? Because what ultimate function does it have for them, right? We talked about the other group of people where this is functioning to give them consolation in the face of someone they've lost. For these other people, for these intellectuals, this is doing something different. This is justifying them not caring about the poor. This is justifying them not caring or doing anything about injustice in the world. This is serving the function of justifying them doing nothing to try to evangelize anyone. This is used to justify them not having any responsibility to investigate their own religious beliefs very deeply and definitely never have to make any sharp distinctions that might make things awkward at a dinner party. This is functionally a sort of neo Pharisaism. It is a belief used to justify oneself, to identify oneself as one of the open minded, right? One of, one of the elite, to represent. I am above those sort of lower class proles who believe in things like hell, who believe all of these fables. And believing in Plato's God helps them a lot because Plato's God is a God of aristocratic rationalism, right? So, and I'm not just saying this as an attack on them, I'm saying this because in the same way that we say to those folks who have grasped onto this because they need it for consolation, the Church provides you with a means of having consolation that doesn't come with all the costs associated with, with latching onto this deviant view. Apocatasis in the same way we need to because we love our brothers and sisters from that other group, from that intellectual group, from that upper class group. We love them too. And that means we need to call them to repentance and faith too. We need to call on them to cease trying to justify themselves, cease trying to justify the way of life they've become addicted to. Call on them to get rid of the false idol of their own self perception as one of the elite, one of the knowledgeable, one of the intelligent to abandon those things and come to repentance. So there are gonna be a bunch of people who listen to what I said in the third half and say, oh there he, he's a hater. He's a DBH hater. He hates David Bentley Hart, he hates these people. I do not. I want David Bentley Hart to repent and draw close to Christ. I want him to repent of a lot of the things he said. Meaning I want him to sort of repair the damage. I want him to draw closer to Christ. I want him to live a Christian life. I want him to become a saint. That's what I want. But that means right now, with what he's doing now and teaching now and promoting now, I have to oppose him. And this is the truth for us all the time in our Christian lives. Because it's not just those folks who are addicted to a certain way of life and to not having things be awkward and not having to make harsh distinctions. It's all of us to one degree or another. There's a small group of us who are like super combative and aggressive. I say us because I'm probably one of those people who need to rein it in a little. But most of us don't like conflict, don't like having to take stands, don't like having to oppose someone. Especially don't like having to oppose someone to their face. But often, not just sometimes, but often that's exactly what we have to do. If we love someone, we have to tell them they're wrong, that they're deeply wrong, that they're wrong for bad reasons and that what they're doing is going to be self destructive. Right? It would be great to honestly believe that everybody can just do anything they want and it'll all turn out great in the end for them and everyone else. I mean, that's kind of ridiculous because some of the things they want to do would be directly hurting other people. But that's not reality. That's not the real world. That's like a child's view of the world. Everybody just goes off and follows their bliss right in the real world. We need to work together to sort these things out and find salvation. And part of that, part of that means that we need to have some uncomfortable clashes, we need to have some uncomfortable discussions, we need to hash some things out. We need to risk hurting feelings so that in the end everybody, myself included, I need people to challenge me often. It's one of the reasons I'm married. My wife is good at it. She calls almost everything I say into question. But we all need that to find salvation and to find eternal life. And our goal has to be what God wills, which is that all men should be saved and come to the knowledge of the truth."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12204.09,"end":12227.32,"speaker":"Fr Andrew Stephen Damick","text":"Amen. Well, that is our show for tonight. Next time I think should be our third anniversary show. That'll be fun. Thank you very much for listening, everyone. We'd like to hear from you. You can email us@lordofspiritscientientfaith.com youm can send us a message or our Facebook page or you can leave us a voicemail@speakpipe.com."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12227.74,"end":12240.79,"speaker":"Fr Stephen De Young","text":"LordOfSpirits and join us for our live broadcasts on the 2nd 4th Thursdays of the month at 7pm Eastern, 4pm Pacific. No stop signs or speed limit. Nothing's gonna slow me down."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12241.35,"end":12253.39,"speaker":"Fr Andrew Stephen Damick","text":"And if you are on Facebook, unlike Father Stephen, who actually lurks through his wife's account, you can follow our page. You can also join our discussion group. You can leave reviews and ratings everywhere. But most importantly, share this show with."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12253.39,"end":12254.83,"speaker":"Fr Stephen De Young","text":"A friend whom you know is going."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12254.83,"end":12257.83,"speaker":"Fr Andrew Stephen Damick","text":"To love it and even those who will hate listen to it."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12259.11,"end":12268.87,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com support and help make sure we and lots of other AFR podcasters stay on the air like a wheel gonna spin it. Nobody's gonna mess me around."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12269.75,"end":12272.71,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and may God bless you all."}
{"episode_id":"LOS - #074 - 2023-08-24 - What in Tarnation -","start":12272.87,"end":12310.12,"speaker":"Steve","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung. A listener supported presentation of Ancient Faith Radio. And I beheld and I heard the voice of many angels round about the throne and the beasts and the elders. And the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
