{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":0.4,"end":65,"speaker":"Announcer","text":"He will be a staff for the righteous with which for them to stand and not to fall. And he will be the light of the nations and the hope of those whose hearts are troubled. All who dwell on the earth will fall down and worship him. And they will praise and bless and celebrate with song the lord of spirits. First Enoch, chapter 48, verses 4 through 5. The modern world doesn't acknowledge, but is nevertheless haunted by spirits and angels, demons and saints. In our time, many yearn to break free of the prison of a flat secular materialism, to see and to know reality as it truly is. What is this spiritual reality like? How do we engage with it? Well, how do we permeate everyday life with spiritual presence? Orthodox Christian priests Father Andrew Stephen Damick and Fr. Stephen DeYoung host this live call in show focused on enchantment in creation, the union of the seen and unseen as made by God and experienced by mankind throughout history. Welcome to the Lord of Spirits."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":66.44,"end":151.62,"speaker":"Fr Andrew Stephen Damick","text":"Good evening giant killers, dragon slayers, goblin cleavers, imp impalers. You are listening to the Lord of Spirits podcast and my co Host, the Very Reverend Dr. Stephen DeYoung is with me from Lafayette, Louisiana and I'm father under Steven Damick in Emmaus, Pennsylvania. And we are live. And if you're listening to us live, you can call us at 855-237-2346, just like the voice of Steve will keep reminding you throughout this program. And you can talk to us and we'll get to your calls in the second half of the show. And our very own Matuska Trudy will be taking those calls. This episode is sponsored by our friends at the Orthodox Studies Institute at St Constantine College which exists to advance the study and application of Orthodox Christianity in faithfulness to holy tradition. OSI is offering online courses this fall, including a five week course on the Book of Enoch. I feel like there should be some kind of reverb for that taught by Father Stephen DeYoung. You can learn about the courses and you can register@orthodoxstudies.com Los and if you register using that link, you'll get a free copy of Father Stephen's book Apocrypha, an ebook of that book from Ancient Faith Publishing. And registration is now open. It's coming up quick everybody. So trigger warning."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":152.02,"end":162.9,"speaker":"Fr Stephen De Young","text":"Yeah, I will continue to pronounce it Enoch. Enoch the sleestack not Sleestick folks will be confounded."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":163.78,"end":165.22,"speaker":"Fr Andrew Stephen Damick","text":"It's true, you do say Enoch."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":165.22,"end":169.93,"speaker":"Fr Stephen De Young","text":"You just got to know going in. I'm going to say first Enoch and you're going to be like, what?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":174.33,"end":211.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, tonight we're not talking about the Book of Enoch, contrary to what you might have heard. Yet that's true. We're talking about the resurrection of the body. This is a central and critical dogma of Christianity that often is strangely overlooked or even forgotten. Yet the scriptures tell us that all of mankind will be raised from the dead at the voice of the Son of God at his second and glorious appearing. But what does it mean that we will be raised? Does the resurrection mean that the same set of atoms that we're carrying around right now will persist into the age to come?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":211.55,"end":213.75,"speaker":"Fr Stephen De Young","text":"No. Oh, sorry."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":213.75,"end":214.51,"speaker":"Fr Andrew Stephen Damick","text":"Good night, everybody."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":214.75,"end":215.67,"speaker":"Fr Stephen De Young","text":"Go ahead, go ahead."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":215.67,"end":218.59,"speaker":"Fr Andrew Stephen Damick","text":"It's all good. Will it even persist into next week?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":220.03,"end":221.83,"speaker":"Fr Stephen De Young","text":"Sorry, who is."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":221.83,"end":242.97,"speaker":"Fr Andrew Stephen Damick","text":"No, it's all good. Who is the you or the I that's going to be raised? I mean. And what does this mean about salvation? Since a lot of people think that the Christian afterlife consists solely. See what I did there? Of what happens to the soul? Shall we start there? If the soul is me, then why does my body even have to be raised? Like, what is even going on with that?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":244.57,"end":246.81,"speaker":"Fr Stephen De Young","text":"Yeah, so that's Plato brain."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":247.53,"end":252.33,"speaker":"Fr Andrew Stephen Damick","text":"Oh, like stuffing your skull full of play. D'oh."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":252.57,"end":261.68,"speaker":"Fr Stephen De Young","text":"Yes, yes. That's what happens when you read too much play. D'oh. Let him ruin your metaphysics. Before we jump into the topic at hand."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":262.32,"end":264.32,"speaker":"Fr Andrew Stephen Damick","text":"Oh, is this a rant or a."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":264.88,"end":269.2,"speaker":"Fr Stephen De Young","text":"This is a mini rant, sort of a follow up on last episode."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":269.28,"end":270.08,"speaker":"Fr Andrew Stephen Damick","text":"Uh oh."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":270.8,"end":279.12,"speaker":"Fr Stephen De Young","text":"Because it has come to my attention that there's some people out there who are unhappy with our brief discussion of open theism."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":280,"end":281.52,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes, it's true."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":282.79,"end":309.59,"speaker":"Fr Stephen De Young","text":"Last time. And so I'm going to briefly discuss it some more. Oh man, those folks are probably gonna be equally unhappy with this or even more. But because, you know, we hadn't really discussed talking that much about open theism. We talked about sort of in passing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":310.1,"end":313.46,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, in passing. It was not really the topic of the show."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":313.86,"end":363.97,"speaker":"Fr Stephen De Young","text":"And some people felt like, you know, maybe I was putting too much process theology into it, too much Hegel on it. That was me trying to steel man the position. Right. That was me trying to present it as better than it actually is. But so since people didn't like that, I'm going to talk about how it actually is. So open theism doesn't make any sense. It literally makes no sense. To even go there, you have to accept a bunch of obviously false presuppositions, like God is a being, like other beings. God exists within time."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":366.7,"end":368.06,"speaker":"Fr Andrew Stephen Damick","text":"That's the Biggest piece there, I think."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":368.06,"end":505.67,"speaker":"Fr Stephen De Young","text":"Yes. Both of which mean God is finite. So already we're dealing with a pagan God, not the true God. But for the sake of argument, right, let's assume that these things were true. The statement God doesn't know the future because the future doesn't exist yet. That is not a coherent sentence. That sentence does not make any sense and it does not communicate anything. The future doesn't exist yet is incoherent because the future is not a thing. The future is the present plus a finite amount of motion, right? It's not like all the things that exist now are going to cease to exist a second from now and be replaced by a whole set of new things. What kind of bizarre ontology is that? Right. So for God not to know the future, since the future is just the present plus a finite amount of motion, despite the fact that God intimately knows everything he's created and knows its complete past history, he has to have no idea in what direction that motion will continue in the next five minutes or 10 minutes or 20 minutes. Let me put a finer point on this, okay? My wife can do a pretty good job of predicting what I'm going to do tomorrow and predicting what I'm going to do in various situations, okay? God knows me far more intimately than my wife as my creator, and you're going to tell me he has no clue what I'm going to do? None. Zero idea. So open theism requires not just that, oh, God is a giant human like the pagans have, but he's a giant human who's particularly dumb. Okay? The God of open theism is inferior to pagan gods because pagan gods could at least figure out what would probably happen the next day."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":506.07,"end":511.11,"speaker":"Fr Andrew Stephen Damick","text":"I mean, do you know how many copies of the Religion of the Apostles are being thrown against the wall right now, Father Stephen?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":511.67,"end":577.17,"speaker":"Fr Stephen De Young","text":"Hopefully none. Because if you got through that book and enjoyed it and you're still an open theist, something was. There was a disconnect, okay? There's a disconnect that makes. It makes no sense, okay? And I know the intent is to preserve free will, okay? That's what you're trying to do. You're trying to preserve free will by saying God doesn't know what I'm going to do. But what kind of free will is that? That's not free will. That's the idea that people act in completely arbitrary ways, in completely nonsensical ways, immune to a chain of cause and effect. So, like, for God to not know what I'm going to do tomorrow. It has to be, like, equally likely that I will spend the day praying and that I will go build a bomb and blow up a Stuckey's. Right. Like, who knows what I'm gonna do tomorrow because I have free will. I could just wake up and, you know, decide to throw dishes around the house for 20 minutes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":577.17,"end":577.53,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":577.53,"end":614.57,"speaker":"Fr Stephen De Young","text":"Like, who knows what. Right. That's absurd. That's not free will. The argument that people behave randomly is not free will. Right. And that's what would be required for open theism to preserve free will. So end of rant about open theism. You guys brought it on yourselves. You could have just let what we said last time pass, but no, you thought we didn't go into it enough. We thought we didn't represent you properly. Well, there you go. So open theism, grave heresy, teaches a different God than the God of Christianity. Hope you're happy."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":614.89,"end":618.09,"speaker":"Fr Andrew Stephen Damick","text":"Friends don't let friends become open theists."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":624.25,"end":626.41,"speaker":"Fr Stephen De Young","text":"So now onto our topic, the bodily resurrection."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":626.73,"end":631.45,"speaker":"Fr Andrew Stephen Damick","text":"Yes, yes, yes. How about that?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":631.45,"end":637.63,"speaker":"Fr Stephen De Young","text":"My apologies to anyone who works at a Stuckey's. That was not a threat. Your date shakes are safe."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":637.63,"end":645.07,"speaker":"Fr Andrew Stephen Damick","text":"They're a bunch of open theistic Stuckies that are anyway calling their managers. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":646.19,"end":666.22,"speaker":"Fr Stephen De Young","text":"Unless you want an excuse to not go to work tomorrow, then feel free to play that clip over the phone or something and get out of work. So. Yeah. So the sort of rhetorical questions, the conversation starters that you gave there before my digression, I felt that they were."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":666.22,"end":668.62,"speaker":"Fr Andrew Stephen Damick","text":"Very well written, wonderfully provocative."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":670.46,"end":674.34,"speaker":"Fr Stephen De Young","text":"I mean, at least one of them I feel like you've used three times before on this show."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":674.34,"end":677.66,"speaker":"Fr Andrew Stephen Damick","text":"But look, we've got 300 hours."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":677.9,"end":679.34,"speaker":"Fr Stephen De Young","text":"It was an okay framing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":679.66,"end":682.46,"speaker":"Fr Andrew Stephen Damick","text":"I'm gonna say a couple things more than once."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":684.3,"end":687.42,"speaker":"Fr Stephen De Young","text":"Okay, but I mean, you're sitting here bragging about how well you wrote them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":687.5,"end":692.13,"speaker":"Fr Andrew Stephen Damick","text":"Like, has anyone actually counted the number of times we've said the word right on the air?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":692.61,"end":693.33,"speaker":"Fr Stephen De Young","text":"Someone should."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":693.57,"end":695.01,"speaker":"Fr Andrew Stephen Damick","text":"Someone will now, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":695.89,"end":703.17,"speaker":"Fr Stephen De Young","text":"Well, they need to tell us privately. And then we'll have a contest. It'll be like guessing how many, like, Jujubes are in the jar."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":703.33,"end":705.57,"speaker":"Fr Andrew Stephen Damick","text":"They'll sit there with a. With a clicker, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":705.89,"end":712.37,"speaker":"Fr Stephen De Young","text":"Yeah. During every episode, we have people guess, you know, closest without going over Price is Right rules. You'll win something."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":712.77,"end":713.41,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":716.45,"end":716.85,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":717.74,"end":718.7,"speaker":"Fr Andrew Stephen Damick","text":"So, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":721.34,"end":776.5,"speaker":"Fr Stephen De Young","text":"You were talking about the tendency people have due to Plato brain to. To associate the soul with identity. And we've talked about this before. We had did an episode called who Stole the Soul? About the soul where we talked about souls and so of course tonight we're talking about the bodily resurrection. So we're going to be talking more about bodies. But we need to revisit the distinction here a little bit because a lot of us have had this Plato idea fed into us that yourself, who you are, the you, is your soul and your body is a husk or a vehicle or something your soul uses to move around that you're the ghost in the machine, as it were."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":776.98,"end":778.42,"speaker":"Fr Andrew Stephen Damick","text":"We're all just big mechs."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":779.62,"end":847.1,"speaker":"Fr Stephen De Young","text":"Yeah, I would have a much cooler machine. Voltron. And so all of that, all of that, that is Plato. That is not Christianity, that is not the Hebrew scriptures. That's not what a soul is. So as we've talked about before, soul efficient Hebrew literally means life, right? It means life. So the soul is the life of an animate. That's where the word animate comes from, anima, which means soul in Latin, of an animate creature. And the soul is the life of a human. The soul is the life of the human body is what makes the human body alive. So it is not the self, it is not the inner person, it is not the person in any sense. It is that element of life that makes your body alive."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":847.66,"end":848.02,"speaker":"Luke","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":848.02,"end":866.28,"speaker":"Fr Stephen De Young","text":"Because your body is made up of otherwise inert elements and compounds. Right. It's a big pile of chemicals, Right. That is made alive by something. And that something is the soul. Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":866.44,"end":876.6,"speaker":"Fr Andrew Stephen Damick","text":"What was the quip in that one episode from, was it the first season of Next Generation? Ugly bags of mostly water. Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":880.53,"end":888.13,"speaker":"Fr Stephen De Young","text":"Yeah. So it's what animates literally, right? The body. But all human souls are essentially the same."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":890.45,"end":893.89,"speaker":"Fr Andrew Stephen Damick","text":"Oh man, you're gonna offend a whole bunch of people with that one."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":894.85,"end":915.26,"speaker":"Fr Stephen De Young","text":"Well, there you go. That's the soul as such. A human soul as such is a human soul. Right. The distinctives of identity do not apply to a human soul. Meaning I'm not alive in a different sense than Father Andrew."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":916.78,"end":917.18,"speaker":"Fr Andrew Stephen Damick","text":"Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":918.54,"end":936.72,"speaker":"Fr Stephen De Young","text":"Right. The animating principle of my body is not different than the animating principle of his body or any of our listeners bodies. It is different than the animating principle of animal bodies. Right. Hence why I said all human souls are essentially the same."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":937.84,"end":938.24,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":938.32,"end":1009.22,"speaker":"Fr Stephen De Young","text":"But it is not different from human person to human person. Right. And when we say that physical death, the physical death of anything really, but including a human is the separation of the soul from the body, we're not talking about like two planks that have been nailed together. Right. Or like your soul is like your emotions and your feelings, whatever those are, and your thoughts and your Mind and then your body is just like tissue. We're talking about the life leaving your body. Your body is still there right now. It's no longer alive. And pretty much immediately after the life leaves your body, all those chemical processes stop. Processes stop and those elements and compounds start to break down into inanimate matter."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1010.24,"end":1010.64,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1012.4,"end":1129.48,"speaker":"Fr Stephen De Young","text":"Right. That's what happens. So soul being separated from the body, though we've jargonized it a little, is a very little literal description for what happens when you watch something die, you watch the life leave it physically, materially, everything that was there before is still there now, but it is no longer alive. And that thing that is now gone, that life that is now gone, is the thing that we call the soul. So this is obviously going to be important when we come around. Eventually, guess what? It's going to be the third half to the bodily resurrection, which is going to involve the soul coming back into the body, that being restored. But the soul itself has nothing of identity. And you can see this, there are obvious examples where you can see this, right? Plato and lots of other pagan folks in different parts of the world believe in sort of direct reincarnation. So someone, something dies, that soul departs from the body because they're looking at the soul as a thing and then it gets another body, right? But even for the completely Plato brained person who believes in reincarnation, that new body, that new person is not the same person as the old person. There's not a persistence of self, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1129.48,"end":1134.92,"speaker":"Fr Andrew Stephen Damick","text":"There's clearly some kind of major alteration at the very least within that paradigm."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1135.4,"end":1231.16,"speaker":"Fr Stephen De Young","text":"So they can believe it's the same soul, it's the same life that passed from one person to another, but the self clearly didn't. They don't have the memories, they don't have the same personality. They might be in a different part of the world. Everything may be different. So this is part of the idea. Even if you believe in reincarnation and that kind of thing, the soul isn't the self, right? So then we have to move now to the body. So if your soul isn't yourself, then that means yourself, your identity, who you are. If it doesn't have anything to do with your soul, because your soul is just like every other human's, then that means that it has something to do with your body. It has something to do with the, the other part of that equation. And this again is something that we as humans instinctively recognize, especially about other humans, but not just about other humans. We recognize that when a person dies and we're looking at their body, that is still them. Right. People don't watch a loved one die and then just turn around and shrug and go, okay, well, they're gone."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1232.04,"end":1233.48,"speaker":"Fr Andrew Stephen Damick","text":"Or, you know, they just leave the."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1233.48,"end":1234.36,"speaker":"Fr Stephen De Young","text":"Body where it lays."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1235.16,"end":1250.63,"speaker":"Fr Andrew Stephen Damick","text":"Like an example that, well, I have children. I have minor children. You know the phrase, he hit me? What are you going to say? He didn't hit you. He hit the fleshly wrapper. That the real you is inside, you know, or is controlling this."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1250.71,"end":1252.71,"speaker":"Fr Stephen De Young","text":"Swinging my arms. And she walked in."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1253.27,"end":1259.59,"speaker":"Fr Andrew Stephen Damick","text":"That's right. No, like, you know, people know if you get hit, you hit me."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1259.99,"end":1262.95,"speaker":"Fr Stephen De Young","text":"Yeah, yeah, yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1263.43,"end":1271.83,"speaker":"Fr Andrew Stephen Damick","text":"And, you know, just to double down. And it's you that hit me, not the shell, you know, not your mech that hit my mech, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1272.07,"end":1277.92,"speaker":"Fr Stephen De Young","text":"Right? Yeah, yeah, yeah. We. We would never look at love. It had just died and say, oh, their body died."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1278.8,"end":1300.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I mean, even. Even, like, think about all the things in. In law as well, in which the body is very much assumed to be the person, you know, Imagine trying to argue in front of a judge, oh, I didn't, you know, I didn't shoot him. I just shot his fleshly form, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1300.24,"end":1300.64,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1300.64,"end":1301.36,"speaker":"Fr Andrew Stephen Damick","text":"Or whatever."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1301.76,"end":1480.98,"speaker":"Fr Stephen De Young","text":"Yes. Yeah, yeah. That's just logical. And this isn't just based on some kind of developed philosophy of the body that we now have in the modern era. Right. And we know this because you can go all the way back to the Neolithic period, as we're want to do on this show, especially in the first half, you go to Catalhoyuk, you can go to these earliest sites of human civilization on earth that we've discovered, and you find, guess what? They're burying their dead. They're not abandoning the bodies of their loved ones. They're not getting rid of them. They're not burning them. They're burying them. And not only were they burying them, in these earliest settlements, a family would bury their departed loved ones in the floor of their house. They would keep those bodies near them and with them. Right. Which shows that even back then, before a word of the Bible was written, before God revealed himself to Abraham, before any of that, right before there was any promise of a bodily resurrection recorded in scripture, people recognized instinctually that the body of their departed loved one was still their loved one was still that person, that that body was not just the person while they were alive, as Father Andrews pointed out, but even after they're dead, it continues to be them. Even when the soul is gone, the life is gone. That's still them. Yeah, right. Is it that them packed up and left and this is their old house? So things like cremation, things like Zoroastrian burial, these are all practices that develop in certain specific pagan cultures mostly after the Axial age, meaning mostly circa 500 BC and later. And those practices, as opposed to burial are practices that are based in sort of developed philosophies and theologies that say that the body is no longer the person or that the body is worthless, or in Plato's case, the body is the prison house of the soul. Yeah, right. It's when you get developed ideas like that that bodies start being disposed of. But that's not the instinctual human practice that we see from the very beginning, even before history was being recorded."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1481.22,"end":1532.68,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I mean, it's interesting to note. Right. Like for instance, the ages you're talking about. Right. That's kind of the development of Plato brain period. Right, yes. But if you look at like the, like among the Greeks, if you look at the stories that they're all still telling, you know, read the Iliad, read the Odyssey, what exactly happens to a person's body has a huge impact on their experience of, you know, pagan Greek afterlife. Right, right. Has a huge, huge impact. Like whether the person is buried or not is a big question in, in those stories. So they still retain that idea and they're at least telling stories that have that in it, even as they're starting to develop some of these dualistic approaches to the body."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1534.2,"end":1604.37,"speaker":"Fr Stephen De Young","text":"Yeah. So for folks who don't know, since I use the term axial age, and I don't know if I've referred to it before on the show, it's, that's used to refer to the period of time in the middle first millennium BC when you get Buddhism for showing up in the east, you get Platonic philosophy showing up in Greece. Well, Greek philosophy showing up in Greece starting with the pre Socratics, you have the classical Hebrew prophets in the Middle East. So that's used as a way of generalizing about that period of religious and philosophical self awareness in the first millennium bc, which we don't have written records of before that. That's not something. That's not to say all those phenomena are the same or even related. Right. It's just that at that time in history, probably based on the progress of technology, writing, etc. Various cultures reach a higher point of self reflection."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1605.01,"end":1613.09,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. They're not doing, not just doing things, they're talking about and writing about and philosophizing about the stuff that they do."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1613.41,"end":1641.03,"speaker":"Fr Stephen De Young","text":"Right, right. Because when when humans are hunting and gathering, that doesn't leave a lot of time to think about, you know, what does it all mean? Yeah, and same thing with, you know, know, subsistence farming. To try to keep your family alive, you have to reach a certain level of social advancement. And then you can have people start to think, you know, what is the correct way to structure a society? Why is our structured the way it is? Right. Et cetera, et cetera. Why do these things happen?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1641.51,"end":1641.91,"speaker":"Luke","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1641.91,"end":1645.15,"speaker":"Fr Stephen De Young","text":"You know, we offered sacrifices to the gods and these bad things still happened."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1645.15,"end":1645.43,"speaker":"Fr Andrew Stephen Damick","text":"Why?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1645.43,"end":1770.06,"speaker":"Fr Stephen De Young","text":"Right. All those kinds of thoughts require a certain, certain level of societal development. And several cultures reach that level of development, different parts of the world, in the middle of the first millennium B.C. so that's what I was talking about when I say previous to that, when we see burials and religious phenomena, those tend to be religious phenomena that are sort of instinctual and built into humanity at some level. Yeah, Right. So sacrificial ritual, everyone does all over the world in similar ways, right? Before that, the offering of incense, burying the dead. There are these sort of sever. They're sort of, therefore, we can say, are kind of built in some sense into what it is to be human. Once you get to the. That period where that reflection starts to happen, you start getting diverging sort of philosophical viewpoints about these things. Because now it's not just a question of what's instinctual to humanity and how humanity is built, but people can build and create things and create ideologies for various reasons, et cetera, et cetera. But so what does it mean or what follows from us saying that, okay, your identity is not related to your soul, your identity is related to your body, right? That your self is a physical self, a physical self that exists in the world. Right. This has some drastic effects in how we have to rethink a whole bunch of things."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1771.1,"end":1794.13,"speaker":"Fr Andrew Stephen Damick","text":"Although, yeah, I was gonna say it's interesting, right? As I'm pondering this again, like, the fact that I'm a body in the world is actually self evident. It requires a whole stack of thinking that that's not true in order for me to conceive of myself in some other way."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1794.45,"end":1796.61,"speaker":"Fr Stephen De Young","text":"Right? But we've been fed that stack."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1796.93,"end":1800.61,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, again, he hit me, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1801.09,"end":1856.58,"speaker":"Fr Stephen De Young","text":"Yeah, right. But we've been taught, right, this. Oh, no, the inner me, the, you know, who I am inside that no one knows. We've all been taught to be Morrissey. And it's weird, right? And speaking of Morrissey as we were, part of what this means is that our identity who we are, if our self is related to our body. Who I am is external to me, not internal. It's not some internal set of internal processes. Right. I have this person who I am deep down inside who's longing to get out. But no, I'm trapped, right? That's not really who I am."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1856.82,"end":1862.74,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we don't need to go there, but we'll just say, with massive implications for a lot of the big debates of our time."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1862.74,"end":1934.39,"speaker":"Fr Stephen De Young","text":"Yes, right. Yeah, that's not right. But it's who I am. It's the body that I am in the world, right? That's who I am. That means external to me. External. So there is a process that all humans go through in adolescence, Right. For some of us it never ends. But that process. And this is a very modern process because adolescence is a very modern concept, right. For most of human history and in much of the world today, 13 years old is an adult. And that's when you get married off in an arranged marriage and start having kids. And you're an adult now. So there is no adolescence. But our modern cultures in the west have created this thing, adolescence, this period where humans are sexually mature but are not considered adults by society. This sort of five year holding pattern. Four or five year holding pattern. And we wonder why there's all these problems."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1935.19,"end":1939.19,"speaker":"Fr Andrew Stephen Damick","text":"At least. At least four or five years."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":1939.43,"end":2044.42,"speaker":"Fr Stephen De Young","text":"Yes. Right. And having created that. Right. Because people aren't sort of let out into the world to become adults as bodies, as people in the world. They're not allowed to sort of become themselves. They tend to spend a lot of time trying to figure out who they are. And what they quickly realize is that especially when they were small children, who they were was an extension of their parents, their family in general. Right. And so they try to define who they are as an individual. Over against their parents, over against their family, over against whatever religious tradition they were brought up in. Over against, over against, over against, Right. And so they sort of push back on all of those things. So they say, I'm not that and not that and not that and not that and not that. And so you strip all those things away, strip away all those relationships, familial relationships, social relationships, cultural relationships, community relationships. Rip all those away. What do you have left? Nothing. You have nothing left. You don't find some inner soul that has an identity inside of you. You find a big hole, you find nothing. And that's why adolescents who go down this road end up being nihilists for at least a couple years."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2044.9,"end":2069.25,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, I Think it's also like, you know, maybe to a lesser extent, although sometimes to a great extent during the height of the pandemic, when a lot of relationships were significantly strained or reduced, big uptick in mental health issues and suicide. Because what it is that defines who we are was muted, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2070.45,"end":2205.44,"speaker":"Fr Stephen De Young","text":"All these things are taken away. There's no identity there. So that's sort of the negative way of seeing it. But the positive way of seeing it is that my identity is a whole series of nested, stacked up relationships. My relationships to my family members, my relationships to my community and the different communities that I'm a part of, my relationships with various movements and thoughts and things that are going on in society, which we've defined as spirits. We've done an episode on what spirits are. You can look at that, the sort of spirits that move me and that I participate in for good or for evil, and of course, my relationship with God. These relationships all taken together, you stack them all up, each one of those pieces. And what you get at the end of the stack when you look at the whole stack, that. That's my identity. That's who Father Stephen DeYoung is. If you want a real picture of who Father Stephen DeYoung is, you have to have all the pieces. The more pieces you have, the more full of a picture you have. I'm the pastor of a parish. I'm an Orthodox priest. I've got a PhD in a particular subject, and I did my research on a particular topic. I'm working on another one. All of these things, right? Here's where I stand on various issues, right? Here are the things I'm involved in. Here are the hobbies I have. Here are the things I enjoy. You know, I'm a husband to my wife, right? I'm an uncle to my nephew. It's on and on and on and on and on and on and on, right? The more of those you pile up, the more of those you're aware of, the more complete a picture you have of who I am, right? And again, our culture has taught us, right, to look at that whole pile of things and say, okay, but there's this but."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2208,"end":2214.32,"speaker":"Fr Andrew Stephen Damick","text":"Some kind of unique, special creature that is not definable by any of those quote unquote labels."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2214.72,"end":2231.7,"speaker":"Fr Stephen De Young","text":"Yes, I am a beautiful and unique snowflake. The whole is greater than the sum of its parts, right? That's the positive way, right? I won't do the, you know, we're all mulching in the same compost heap joke."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2231.7,"end":2232.02,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2234.98,"end":2235.38,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2237.7,"end":2238.18,"speaker":"Fr Andrew Stephen Damick","text":"But that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2238.18,"end":2268.22,"speaker":"Fr Stephen De Young","text":"But is fake. It's false. Right. It's. It's trying to rattle and shake your sense of identity. You may wonder, why would our culture do that? What is it about our culture that would try to make it so that you are insecure in your identity?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2269.26,"end":2270.62,"speaker":"Fr Andrew Stephen Damick","text":"It's to give us something else."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2271.34,"end":2274.94,"speaker":"Fr Stephen De Young","text":"Yeah. There are a number of reasons. Right. One of them is to sell you things."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2275.55,"end":2276.51,"speaker":"Fr Andrew Stephen Damick","text":"Yes. Yes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2278.11,"end":2291.79,"speaker":"Fr Stephen De Young","text":"Right. Identity is now something you express by how you dress. You have to buy things to wear and what kind of car you drive and what kind of how you present."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2291.79,"end":2295.31,"speaker":"Fr Andrew Stephen Damick","text":"Yourself, which accounts you follow on Twitter."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2295.63,"end":2308.07,"speaker":"Fr Stephen De Young","text":"Yes. You're supposed to not see yourself as this interlocking web that's a given, that's an objective thing. Right. And find fulfillment and purpose in all of those relationships and all of those roles."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2308.79,"end":2309.15,"speaker":"Fr Andrew Stephen Damick","text":"No."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2309.15,"end":2312.39,"speaker":"Fr Stephen De Young","text":"You're supposed to craft an identity for yourself."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2313.27,"end":2316.23,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which is expensive and exhausting."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2316.47,"end":2353.26,"speaker":"Fr Stephen De Young","text":"Yes. Because no matter how much of it you do, you're always aware that you're cosplaying. And it's not real. Right. It's not real. And if it goes far enough, you can ruin all the relationships that would have given you identity and meaning, that would have given you a sense of who you are because you've been chasing after these other superficial things. But someone else has been making money off of you while that's been happening. Someone else has been exploiting you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2354.15,"end":2354.39,"speaker":"Luke","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2354.71,"end":2386.72,"speaker":"Fr Stephen De Young","text":"People won't just do this to you to sell you things either. Right. People will do this to exploit you sexually, especially young people. People will do that. But they're always exploiting you. They're always trying to cast doubt on your confidence in who you are and what your purpose is and where you should derive meaning in your life. Because they want to take something from you, not because they want to give you a renewed sense of purpose."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2388.16,"end":2390.8,"speaker":"Fr Andrew Stephen Damick","text":"And that's why the Matrix worked as a concept for a movie."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2391.2,"end":2421.31,"speaker":"Fr Stephen De Young","text":"Yes. So the flip side of that is when we re embed ourselves in those relationships and in that identity and we accept it and we embrace it, and we accept and embrace the purpose and the meaning that that gives us, we become increasingly impervious to that kind of stuff. Right. We don't get suckered in by that kind of thing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2421.63,"end":2435.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. People who have healthy, in person relationships are much less likely to feel lost and stressed out by everything that's going on in quote, unquote, the world."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2436.91,"end":2437.23,"speaker":"Judah","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2441.23,"end":2497.75,"speaker":"Fr Stephen De Young","text":"So another piece, another important piece here in our first half is that another piece of this external identity is our actions. Because our actions are external to us. Right. We act in the world. We act in the world. And so our actions in the world are part of what define who we are. They're part and parcel of those relationships, really, honestly. Right. Our relationship, our actual relationship to God is not made up of feelings we might have about God or feelings that we interpret as being from God at various points in our life. Right. The scriptures are very clear. Our relationship with God is constituted, is made up of our actions."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2498.23,"end":2500.71,"speaker":"Fr Andrew Stephen Damick","text":"Is that works righteousness again, Father Stephen."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2500.95,"end":2503.67,"speaker":"Fr Stephen De Young","text":"Yes, sorry, I mean."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2507.11,"end":2522.14,"speaker":"Fr Andrew Stephen Damick","text":"I need to tally at some point, just so I have the number on hand, of how many times the scripture associates loving God with keeping his commandments. Yes. But even if there weren't a bunch of times, which there totally is, Jesus says, if you love me, you will keep my commandments."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2522.62,"end":2526.54,"speaker":"Fr Stephen De Young","text":"Right. I mean, you can't get clearer than that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2526.86,"end":2527.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2527.66,"end":2552.61,"speaker":"Fr Stephen De Young","text":"You can't tell me there's some other passage of scripture that's clearer than that that you're going to use to reinterpret that one. Right. That dog don't hunt. Right. If you love Christ, you'll keep his commandments. Keeping his commandments is what love is. Right. My love for my wife is not a feeling I have sometimes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2553.97,"end":2600.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. I mean, I think about this, you know, John 3:16. Right. Probably the best known Bible verse, at least in the English speaking world, I think is misunderstood a lot where it begins. For God so loved the world that he gave his only begotten Son. The, The. So there in English is not like he loved us so much. Right. It's not an emphatic. It's. And I looked this up just to make sure I was right about this. I can't remember the exact word. It is in Greek, but the Greek, it's. It's. It means in this manner for God, in this manner. Yeah. Loved the world that he gave his only begotten son. You know that, that even when the love of God is being described by the scriptures, it's by what God does."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2602.31,"end":2617.83,"speaker":"Fr Stephen De Young","text":"Yes. Love is an action of God. Yes. My love for my wife is actions. Okay. My love for my wife is not a feeling I have. Right. It's not warm fuzzies. Right. Those things are nice. If you've got feelings, enjoy them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2618.47,"end":2620.63,"speaker":"Fr Andrew Stephen Damick","text":"Like Boston said, it's more than a feeling."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2622.48,"end":2672.54,"speaker":"Fr Stephen De Young","text":"But, but me loving my wife is when I get up before her, I do a bunch of the things I know she's going to want me to do without her having to ask me to do them that make her life easier. That is loving my wife. It has nothing to do with feelings. It has nothing to do with words. Right. It's what I do. And that's. You know, there are other very clear passages of the New Testament. The person who says he loves God and hates his brother is a liar. You don't get clearer than that. This is the whole concept of hypocrisy, which is all through the prophets and all through Christ's criticism of the Pharisees."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2674.63,"end":2674.87,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2674.87,"end":2762.79,"speaker":"Fr Stephen De Young","text":"What you say is great, but what you do isn't. And what you do is what's real. Right. What you would write down if I gave you a test as the right answer is not important. What you say is not important. What you claim you think or believe is not important. What you do is important because what you do reflects what you actually believe and actually think. And actually value and actually think is important. That is going to naturally express itself in actions, which, again, all through the New Testament, this is why our actions, our works are always described as fruit. Fruit of a tree. A bad tree can't bring forth good fruit, and a good tree won't bring forth bad fruit. The fruit reveals what's inside of us because of that, totally clear in Scripture, no way around it. Right. And so our actions are right, our identity. So back to Father Andrew's rhetorical questions. Why am I answering them if I keep calling them rhetorical questions? Why?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2762.79,"end":2764.67,"speaker":"Fr Andrew Stephen Damick","text":"Did I ask you why?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2764.83,"end":2808.05,"speaker":"Fr Stephen De Young","text":"Why? That's also a rhetorical question. Don't answer that either. But. Right. Talking about our atoms. Okay. Because this is important. This is key here to understand we're talking about bodily resurrection. Because it's not only a question of, you know. Yeah. When I die, my body's gonna decompose and the atoms and molecules of my body will end up being other things. Right. Like boats and trees and later on, other people probably. Right. It's not just that, but even during my life, every seven years, all the matter sort of filters out."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2809.03,"end":2809.27,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2810.31,"end":2830.15,"speaker":"Fr Stephen De Young","text":"So when we say that the bodily resurrection, my body is going to be restored, put back together and have life breathed back into it, we're not saying God's going to take all. Find all of those atoms and molecules because some of those will have also been part of other people."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2831.35,"end":2835.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And like, you know, if you were to gather up all the atoms I've ever had."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2837.06,"end":2837.26,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2837.26,"end":2839.38,"speaker":"Fr Andrew Stephen Damick","text":"Let's just say I would have to go to the gym a lot more."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2839.7,"end":2841.94,"speaker":"Fr Stephen De Young","text":"Who gets custody of which atoms?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2842.42,"end":2843.22,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2843.86,"end":2847.38,"speaker":"Fr Stephen De Young","text":"Right, Right. So that's not what we're talking about."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2847.38,"end":2848.42,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2848.5,"end":2999.05,"speaker":"Fr Stephen De Young","text":"That's not what we're talking about. And that's why, like the church has always understood and Judaism, the segments of Judaism, like Pharisaism that believe in the bodily resurrection before Christianity have always understood that your body gets burnt up in a fire, your body sinks into the bottom of the ocean, your body gets eaten by an animal. That doesn't stop God from being able to raise you from the dead. Right. Because we're not talking about the atoms. We're not talking about the atoms, but what we are talking about is the externalities that we've been talking about. These have to be restored at the resurrection. This system of relationships has to be restored at the resurrection. Our works and the person that that has made us has to be restored at the resurrection. Why? Well, because if it's not, then it's not going to be me who's raised from the dead because my identity is those things. So some pile of atoms being put together and a human soul being breathed into it isn't going to be me, isn't going to be father Steven DeYoung alive again unless these other things are restored that form my identity. And that being the case. Right? That being the case, if we understand that that has to be the case for our identity to continue after death and in the resurrection, then we understand that it's that that we mean when we talk about the bodily resurrection. The restoration of those things is what we mean by the bodily resurrection. And if that's what we mean by the bodily resurrection, we've got to rethink a lot of other things about the resurrection, too. Right. In terms of how we've been taught to either taught to think about it or have sort of lazily thought about it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":2999.05,"end":3000.41,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Just imagined it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3000.65,"end":3035.05,"speaker":"Fr Stephen De Young","text":"Yeah. And so that's what we're going to be talking about the rest of tonight. We'll be starting here with this sense of what a person's identity is, that being external, that being bodily, that being in the world in a system of relationships and constituted by our actions. What does it mean for that to be restored on the last day at the Judgment?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3037.05,"end":3042.81,"speaker":"Fr Andrew Stephen Damick","text":"All right. Well, with that provocative question, we're going to go ahead and take our first break. And we'll be right back on the Lord of Spirits."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3043.29,"end":3061.11,"speaker":"Announcer","text":"Father Andrew Stephen Damick and father Stephen DeYoung will be back in a moment to take your calls on on the second half of the Lord of Spirits. Give them a call at 855-23-7-2346. That's 8-55-AF-ADIO."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3065.03,"end":3134.54,"speaker":"Podcast Advertisement Voice","text":"How do you explain the sacraments. It's easy to say they're mysteries that we have to take on faith or on the authority of tradition, but that is not how the early Christians understood them. To them, and to all ancient people, the idea that physical objects had spiritual power was very intuitive, whereas modern people tend to find this difficult, bizarre, or even unchristian. This is because we live in an era shaped by secularism, a way of viewing a world that's incompatible with sacramental thinking. Because secular ideas are at the heart of our culture, modern people tend to think in secular ways without realizing it. Even the most, most well meaning of us. How then do we live in, but not be of a secular culture? We need to understand the enchanted sacramental way that the early Christians viewed the world. But we also need to understand secularism. What is it really? Where did it come from? And how does it influence how we think about religion? Journey to Reality Sacramental Life in a Secular Age breaks down these important issues in accessible, non academic language and is an ideal introduction for young readers, catechumens and seekers, as well as for any Orthodox Christians who want to deepen their understanding of the sacraments."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3135.02,"end":3138.18,"speaker":"Fr Stephen De Young","text":"Journey to Reality Sacramental Life in a."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3138.18,"end":3144.7,"speaker":"Fr Andrew Stephen Damick","text":"Secular Age by Zachary Porcou, now available@store.ancientfaith.com."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3144.94,"end":3149.54,"speaker":"Fr Stephen De Young","text":"Again, that is store.ancientfaith.com we're back now."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3149.54,"end":3164.8,"speaker":"Announcer","text":"With the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3165.44,"end":3177.12,"speaker":"Fr Andrew Stephen Damick","text":"Thanks, Voice of Steve. So I don't know, do you think people's brains are sufficiently bent yet or do we need to keep bending until they. Somebody snapped?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3177.12,"end":3181.69,"speaker":"Fr Stephen De Young","text":"We are going to keep bending. People. People are being warned."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3181.69,"end":3210.02,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I do want to, I do want to tell everybody, by the way, just for sake of reference, because, you know, by this point we don't expect everyone to have listened to every episode, but really you should listen every episode. But if you really want to know, to have a lot more kind of fleshing out. Fun pun, fully intended. Fun pulling, tended. Make sure you check out some of our early episodes on bodies that we did. I think that was like, that was in the first year, if I recall correctly, wasn't it?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3210.98,"end":3213.1,"speaker":"Fr Stephen De Young","text":"Yeah. The bodies in the bodyless episode."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3213.1,"end":3215.3,"speaker":"Fr Andrew Stephen Damick","text":"I think it was, yeah. And then one called God's Body."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3215.62,"end":3218.82,"speaker":"Fr Stephen De Young","text":"Yeah. And who Stole the Soul. About the soul."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3219.3,"end":3236.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So this one's. This is definitely a hyperlinked episode in a lot of ways, but but, yeah, we're kind of taking it from a different angle in this case. Right. But if you're interested, especially those questions of, like, what about the atoms and all that stuff, you should."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3236.95,"end":3239.79,"speaker":"Fr Stephen De Young","text":"Oh, the Boat of Theseus episode, too."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3239.79,"end":3241.87,"speaker":"Fr Andrew Stephen Damick","text":"Yes, exactly, exactly."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3242.35,"end":3243.79,"speaker":"Fr Stephen De Young","text":"Probably the Relics episode."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3244.11,"end":3246.99,"speaker":"Fr Andrew Stephen Damick","text":"Oh, yes. That one's called can these Bones Live?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3247.23,"end":3249.47,"speaker":"Fr Stephen De Young","text":"This whole thing's derivative. Why are we even doing this?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3249.71,"end":3254.83,"speaker":"Fr Andrew Stephen Damick","text":"I don't know. Good night. Why am I even here?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3257.07,"end":3258.11,"speaker":"Fr Stephen De Young","text":"What does it all mean?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3259.54,"end":3291.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so, yeah. Yeah. So we're talking about the bodily resurrection, and we began in the first half of this episode beginning talking about identity, and we're going to get even deeper into that now. But the main point of the first half, everybody, was that identity is actually external to the. To the human because we're part of a web of relationships and our actions and all that. That kind of stuff. So it's very."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3292.03,"end":3294.03,"speaker":"Fr Stephen De Young","text":"We exist in the body, in the world."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3294.91,"end":3297.55,"speaker":"Fr Andrew Stephen Damick","text":"Exactly, exactly. So."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3298.27,"end":3302.27,"speaker":"Fr Stephen De Young","text":"So I take it from that preamble we haven't gotten a bunch of calls yet because people are like just."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3302.35,"end":3311.35,"speaker":"Fr Andrew Stephen Damick","text":"No, I. No, actually, you know what? It looks like we're. There is a call coming in. It looks like. I don't know. Should we have Trudy just line it up? Just cold and, like."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3311.35,"end":3312.95,"speaker":"Fr Stephen De Young","text":"Just bring it right in. Let's just do it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3312.95,"end":3316.97,"speaker":"Fr Andrew Stephen Damick","text":"Bring it right in. Okay, Trudy, we're just going to. Go ahead. Luke."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3316.97,"end":3317.77,"speaker":"Fr Stephen De Young","text":"Doing it live."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3317.93,"end":3321.53,"speaker":"Fr Andrew Stephen Damick","text":"Luke, your phone says you're from Montana. Are you really calling from Montana?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3322.57,"end":3324.49,"speaker":"Luke","text":"Yep. First time calling."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3324.97,"end":3325.61,"speaker":"Fr Andrew Stephen Damick","text":"All right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3326.01,"end":3328.57,"speaker":"Fr Stephen De Young","text":"What are the three other people in Montana doing right now?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3330.09,"end":3330.81,"speaker":"Luke","text":"I don't know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3331.29,"end":3334.49,"speaker":"Fr Stephen De Young","text":"Oh, you're nowhere near them. That's right. You are from Montana."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3334.97,"end":3343.69,"speaker":"Fr Andrew Stephen Damick","text":"They're eating at Stuckey's, obviously. So, Luke, welcome to the Lord of Spirits podcast. What's on your mind?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3345.02,"end":3371.58,"speaker":"Luke","text":"Yeah, so it's kind of related to the, like, the phenomenology that you guys have been describing, like, that being is a verb, you know? And so I don't. I mean, I guess it's kind of somewhat related to this, but it's more. You know, Jonathan Pageau had this video called There Is no Literal Meaning. And, like, I don't know if you guys have, like, looked into him much, but. Or."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3372.86,"end":3378.54,"speaker":"Fr Stephen De Young","text":"But, like, isn't he Canadian? He's one of my favorite Kanakistanis."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3379.18,"end":3379.66,"speaker":"Luke","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3380.3,"end":3382.62,"speaker":"Fr Stephen De Young","text":"Not my favorite, but he's up there."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3384.62,"end":3389.58,"speaker":"Fr Andrew Stephen Damick","text":"William Shatner is the world's greatest Canadian, as we all know. Sorry, Luke, go ahead."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3390.54,"end":3394.1,"speaker":"Luke","text":"Yeah, so there's the four senses of scripture, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3394.1,"end":3394.94,"speaker":"Judah","text":"There's the literal."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3395.82,"end":3407.18,"speaker":"Luke","text":"There's the anagogical, the moral, and the forgot the other one. But so I'm trying to understand, like, is there a way we can, like."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3407.18,"end":3409.06,"speaker":"Judah","text":"Other senses of the word literal?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3409.06,"end":3443.14,"speaker":"Luke","text":"Because, like, I'm Roman Catholic and like, in our catechism, it says, you know, it describes these four senses and that the literal, all other senses are based on the literal. So there's the literal and the spiritual meaning. Like, do you think this can be reconciled with this other way in which there is no literal meaning in the sense that, as Peugeot describes it, that there's no. You can't give a direct description of something like, dissociated from any perspective, if that makes sense. You, like."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3445.38,"end":3509.09,"speaker":"Fr Andrew Stephen Damick","text":"I, you know, I don't know that I've watched that video by him, by the way. We're not just being kg, we actually do know him. Yeah, yeah, I, you know, so, like, the way that we use the word literal now is different from the way that it was used in many centuries before now when they're especially talking about the four senses of Scripture. Like now when we say literal, we mean. I don't know, I think we tend to mean material, maybe. I think that that's kind of what people mean by literally. Although in my head I hear Rob Lowe saying that on Parks and Rec. But no, I mean, in its most basic sense, historically, it just means the thing as it is written. Right. So sort of the kind of the immediate sense of the words on the page is the literal. The literal meaning, but it doesn't mean materially necessarily."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3511.33,"end":3518.13,"speaker":"Luke","text":"So, Like, I've also heard it described, sorry, the. Like as the words as the author originally intended them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3519.01,"end":3521.01,"speaker":"Fr Andrew Stephen Damick","text":"Well, that's a whole new ball of wax right there."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3521.25,"end":3521.73,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3523.25,"end":3523.81,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3523.89,"end":3647.71,"speaker":"Fr Stephen De Young","text":"So, yeah, I. I think from your description, I haven't watched the. The Pageau video either. And, you know, he doesn't watch mine, so I don't feel bad. But the. That particular. But it sounds like from what you said, right, that I think you may be confusing the idea of ideas of literal and objective. So, like, I would agree with the statement right there. We've said before on the show, right, that. That Thomas Nagel quote, there is no view from nowhere. Right. So every statement I make comes from my perspective, right? So there is no real objectivity. There's only subjectivity. But I don't think that's the same thing as talking about the literal meaning of a text. Right. I think what's meant by census literalis is that you begin with. Right. See this, the place where people run into trouble is they're always jumping to historical text, but let's use a text we've already referred to tonight, right? Christ says, if you love me, you will keep my commandments, right? So the literal sense of that is kind of obvious to us, right? If, if I love Jesus and I want to show that I love Jesus, I should do that by keeping his commandments, by doing the things that he told me to do. Right? That's not objective in the sense that that's clearly there's. There's a whole frame in which those ideas exist. The concept of commandments, the concepts of who Jesus is. Right. And, and all these other things. And, and you can't. Couldn't just generalize from that. That isn't what it means to love everyone. Right. Loving my wife doesn't mean keeping her commandments. She may disagree. Let's get her on the line."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3648.19,"end":3648.99,"speaker":"Fr Andrew Stephen Damick","text":"Where's Trish?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3650.51,"end":3652.51,"speaker":"Fr Stephen De Young","text":"But, oh man, we need to have."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3652.51,"end":3653.79,"speaker":"Fr Andrew Stephen Damick","text":"Her call in someday. I'm just saying."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3657.71,"end":3686.44,"speaker":"Fr Stephen De Young","text":"Actually, me on everything, right? So that isn't an objective thing. That's not like some kind of objective definition of love or something, right? That's, that's very subjective and contextual. It talks about our relationship with Jesus. We have to understand who Jesus is to really understand what that means, etc. Etc. But there's still a literal meaning there of, yes, I love Jesus, I want to express my love for him, so I'm going to do the things that he. That he said I should do."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3687.32,"end":3687.72,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3689.08,"end":3772.05,"speaker":"Fr Stephen De Young","text":"But that also doesn't have to be the end of discussion. Right? And that's what the other meanings are about. Right. And the reason why those other meanings are grounded in the literal sense is you don't sort of dump the literal sense. So we don't keep talking about that passage and other things that it means and say. So forget about keeping Jesus commandments. You don't have to worry about that. Actually, it's more of a metaphor, Right, Right. That's not what we're saying. We say, no, that is true. But then we could also go further than that. Right. We could go deeper into it, right. And say, sort of like we were doing tonight. We could take that to a broader sense and say, oh, look, love isn't a feeling. Love consists of actions. Right? That's not literally what Jesus is saying. Jesus is not trying to communicate as a general principle, love consists of actions. Right. He's saying something more specific than that. But that is something we can reasonably conclude from it. There's the literal meaning, the sort of direct meaning. What is being said to us. And then we can add to that deeper meanings, connections to other parts of scripture, all of those kind of things."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3772.21,"end":3774.3,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Does that make sense, Duke?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3775.18,"end":3779.42,"speaker":"Luke","text":"I think so. So just to like repeat what you said a little bit. Me?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3779.42,"end":3779.9,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3779.9,"end":3796.62,"speaker":"Luke","text":"So is it kind of like literal is like, it's like relative to those other senses, it's kind of lower down and it's something that can be kind of applied. Is it? If that makes sense."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3796.78,"end":3800.82,"speaker":"Fr Stephen De Young","text":"Like, I would say application, I would."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3800.82,"end":3815.96,"speaker":"Fr Andrew Stephen Damick","text":"Say I was to say, I would say that those other senses are relative to the liter, you know, because that's the sort of the first place that you go is the literal. Like, what's the thing that is being said here? You know, it's straightforward."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3817.16,"end":3923.16,"speaker":"Fr Stephen De Young","text":"Let me give another example. Maybe this will help. So this is from. This will tell you the whole Council of God Bible study is actually far in advance of what's being released currently. But so last night, in real time, we were talking about the construction of the table of the shewbread in the tabernacle, right. So the literal sense is that God shows and tells Moses to make an actual table on which there was going to be actual bread so that the priests who were serving in the tabernacle would have bread to eat during their time of service. Right. So that's like the literal sense of what's being said there, right? It's describing this actual table, this actual piece of furniture that was part of the tabernacle, how it was transported and carried, its construction. That's the literal sense of the text. Right. But you can go from there, too. We've talked about this on the show way back when we talked about the tabernacle, that in most pagan temples at that time, you would have tables, but those tables where were. Were where food was brought to feed to the God, to feed to the idol. And so this table, God's table in the tabernacle is sort of an inversion of that, right. That God is feeding his priests. Priests aren't coming and feeding God Right. Now the text in Exodus doesn't make that point that I just made. Doesn't say anything about pagan temples, doesn't make that comparison. Right. So that's another level of meaning by taking what is in Exodus and taking it in context."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3923.96,"end":3924.36,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3924.92,"end":3935.4,"speaker":"Fr Stephen De Young","text":"And then another thing I can point out is I can compare that to, at least in our Orthodox churches and in Eastern rite Roman Catholic churches, you've got a pro thesis table."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3938.37,"end":3938.61,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3938.93,"end":3982.91,"speaker":"Fr Stephen De Young","text":"Usually in the, in the altar area where you have the bread that's going to be used in the Eucharist. Right. And I can make that connection to our current usage and talk about the Eucharist and talk about God feeding us. Right. But so those other two points I just made, I think are valid points, and I think they're valid points to make from the text in Exodus, but they aren't sort of explicitly, literally there in Exodus. Right. But we have to start with what's literally there, this table that existed in the tabernacle, and we understand that. And then once we understand that, we can make these other theological connections and see this greater significance."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3985.79,"end":3986.51,"speaker":"Fr Andrew Stephen Damick","text":"Does that make sense?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":3988.56,"end":4008.64,"speaker":"Luke","text":"Yeah, so I think so. So, like, literal sense is kind of like a launching ground. It's almost like maybe, like it can't just exist by itself, but it can. It's a. It's like a launching point for other. Other levels of interpretation, sort of."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4009.12,"end":4009.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4009.76,"end":4013.12,"speaker":"Fr Stephen De Young","text":"I mean, if it was just the literal sense, it would be an irrelevant detail."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4013.97,"end":4043.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, in many cases. But I mean, but like, like, you know, I'll give an example, like, if I tell one of my kids, okay, go to your room. Okay. The literal thing that needs to happen is that the kid needs to relocate himself and go into the room. Now, he may along the way ask himself, now, why did he send me to my room? Right. That would be another sense. Right, yeah. Asking, what. What does this mean? You know, how can I avoid this in the future? You know, that sort of thing. So, yeah. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4044.16,"end":4045.68,"speaker":"Luke","text":"Okay. Yeah, I think that makes sense."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4045.92,"end":4046.32,"speaker":"Fr Andrew Stephen Damick","text":"Great."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4046.4,"end":4054,"speaker":"Luke","text":"I guess our modern problem is just we just focus too much on the little sense, and we think that, you know, it's sort of an end in itself."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4055.52,"end":4056.48,"speaker":"Fr Stephen De Young","text":"Right, Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4056.48,"end":4056.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4056.76,"end":4066.76,"speaker":"Fr Stephen De Young","text":"But if you. If you get rid of the literal sense. Right. Then the other things, you can go into all kinds of wild speculation that has, you know, go all kinds of weird places. Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4066.76,"end":4067.08,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4067.08,"end":4082.48,"speaker":"Fr Stephen De Young","text":"So you don't get rid of the literal sense because that kind of grounds you. Right. We're still talking about God's table. We're still talking about bread. Right. It has to be. It's connected to something. Right. It's not just whatever wild speculations I want to."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4082.48,"end":4083.84,"speaker":"Fr Andrew Stephen Damick","text":"It's not just images or whatever."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4084,"end":4084.48,"speaker":"Fr Stephen De Young","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4084.8,"end":4102.14,"speaker":"Fr Andrew Stephen Damick","text":"All right, well, Luke, thank you very much for calling. Nice to speak with you. All right, we're going to go ahead and take another caller. We have Charles, who has a question about the bodily resurrection. Charles, welcome to the Lord of Spirits podcast. Father's Bless God bless you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4102.54,"end":4107.02,"speaker":"Fr Stephen De Young","text":"So are you a. Are you a Charlie guy or a Chuck guy or. Neither."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4107.26,"end":4107.9,"speaker":"Fr Andrew Stephen Damick","text":"Chaz."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4108.78,"end":4110.46,"speaker":"Judah","text":"Neither Father. I'm definitely a full out."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4110.46,"end":4110.94,"speaker":"Luke","text":"Charles."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4111.18,"end":4113.26,"speaker":"Fr Stephen De Young","text":"Okay. All right, we'll stick with that then."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4114.86,"end":4118.06,"speaker":"Fr Andrew Stephen Damick","text":"So Charles, what, what's, what's your thought?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4120.54,"end":4131.21,"speaker":"Judah","text":"So in the first half, talking about the resurrection not being, just restoring the atoms that were once there, that, that part I, I'm totally following on."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4134.25,"end":4134.53,"speaker":"Fr Andrew Stephen Damick","text":"But."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4134.53,"end":4175.22,"speaker":"Judah","text":"I like my question, I guess is, I'm trying to ask Father, is, is dormition and our Blessed lady, like they, you know, she, she, her body is assumed, like, and I understand that like Lazarus wasn't resurrected in the same way. Lazarus was more like resuscitated. He still experienced death after. So I'm, I'm, I'm trying to like put my mind together on how, you know, it's only a few things that you, you know, like Enoch or Elijah or our Blessed lady, like, how does that work? Or is that I'm just over stretching my mind. I just need focus on me."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4175.46,"end":4349.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So a couple of things. Number one, she did die, right? The Orthodox church is very explicit about the fact that she died. Now Enoch, it just says he was taken up. Same thing with the prophet Elijah. But St. Paul, when he talks about the relationship of the body in the resurrection to the body as it is in this life, he uses the analogy of a plant to a seed, right? So the seed is, is this life. You know, so the, the human body is going to be significantly altered. And it's not just about the atoms. Ultimately the atoms don't matter that much. Pun intended, I guess because as we mentioned, you know, you trade out your atoms all the time, right? There's atoms you're no longer using that you were using last week. So it's not about that particular set of atoms. But the human body is going to be transformed in a way that is hard for us to understand. But this is part of what it means that when Christ. I'm going to talk about this at the end a little bit more. But when Christ says we will be equal to the angels in the resurrection, it doesn't mean that we become angel kind, right? But we will function more like they do. So there is going to be a change in the human body. The human body will take on other kinds of abilities and characteristics. We will no longer have the mortality that we now have. We will still be material, but exactly what the character of that materiality will be, we don't really understand or even, I would say even partly understand now. Just a little glimpse, maybe. So, yeah, there is going to be this elevation and exaltation to the human body that's going to happen in the resurrection. And so we see that already with the saints. So even though some. There's no remains a handful of them. Right. So the Theotokos, as you mentioned, is definitely one of those. The basic state of the saints in the life of the age to come is essentially the same. They're all participating in the resurrection in one way or another. Some, it seems more than others. But what does it mean for them is going to be different from what it means to us from our vantage point? Like, we're still experiencing it in terms of time, which is why this is actually a sequel to the previous episode where we talked about time, you know? You know, it would be reasonable to say, I think, that they're experiencing the resurrection now, even though from our point of view, most of them have not been resurrected."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4349.96,"end":4350.36,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4350.52,"end":4363,"speaker":"Fr Andrew Stephen Damick","text":"Okay, But. But they are functioning in that angelic way. Again, they're not. They don't turn into angels, but they become equal to the angels, I mean, because that's. That's what Jesus says. So does that make sense?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4363.4,"end":4365.24,"speaker":"Judah","text":"Yes, it does, Father. Thank you very much."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4365.48,"end":4370.32,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. I don't know. Father Stevens, you want to add, subtract, multiply, divide, anything."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4370.48,"end":4382,"speaker":"Fr Stephen De Young","text":"Let me use this opportunity to condition something in terms of our discussion tonight. So we're not going to give you like, okay, here's how the bodily resurrection works. Some kind of."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4382.24,"end":4383.16,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4383.16,"end":4494.05,"speaker":"Fr Stephen De Young","text":"Literal sense. Right. Because the Scriptures don't do that. Because they can't. This isn't something we can fully understand. What the Scriptures give us when they talk about what happens to us after the end of our life in this world. What the Scriptures give us is a whole bunch of metaphors and illusions and images. Right. That give us sort of ways of thinking about it. And so what we're aiming to do tonight and talking about the bodily resurrection is to give a way of thinking about it that. I think ultimately this is where we're going to end up. Spoilers at the end of the third half is talking about why. What we're sort of constructing here as a way of thinking about it helps us understand a lot of things that the Scriptures say, a lot of things that the fathers say, a lot of things that orthodox theologians and spiritual fathers and things say that seem kind of weird and maybe unintelligible because of the way we're used to thinking about these things. But if we look at it from a little different perspective, some of those things they say start to click and make a little more sense, but still they make sense at that level. Of imagery and illusion and a way of thinking about it. Not at the level of. Okay, now I get it. This is exactly how it's going to be. So that's at the core of what we're getting at when we talk about the Theotokos or Moses or Elijah or Enoch or frankly any of the saints, is that they have already experienced the bodily resurrection that we're talking about from their perspective."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4495.49,"end":4495.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4496.29,"end":4504.77,"speaker":"Fr Stephen De Young","text":"Right. And this gets into some timey wimey stuff, but St. Paul is the one who drops on us in Ephesians that we're already seated with Christ in the heavenly places."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4507.98,"end":4513.18,"speaker":"Fr Andrew Stephen Damick","text":"So it's not our fault. Are you all right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4513.18,"end":4514.62,"speaker":"Fr Stephen De Young","text":"We learned it by watching you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4515.58,"end":4520.3,"speaker":"Fr Andrew Stephen Damick","text":"That's right. So thank you very much for calling, Charles. I hope that's helpful."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4520.94,"end":4521.62,"speaker":"Judah","text":"It was, it was."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4521.62,"end":4522.3,"speaker":"Luke","text":"Thank you, Father."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4522.46,"end":4534.54,"speaker":"Fr Andrew Stephen Damick","text":"Cool. All right, we're going to continue on here with the second half. So identity. And since you just mentioned time. Was that a deliberate segue there, Father? Wibbly, wobbly, timey wimey stuff."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4534.62,"end":4535.74,"speaker":"Fr Stephen De Young","text":"We're going to say it is now."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4536.2,"end":4536.52,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4538.2,"end":4553.88,"speaker":"Fr Stephen De Young","text":"The retcon can't prove it wasn't, so. Yeah. So we have to. Not only in the first half, we're talking about identity as being external, but you notice just internal versus external. Right. These are spatial terms we're using."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4554.2,"end":4554.76,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4555.08,"end":4576.11,"speaker":"Fr Stephen De Young","text":"Right. And that our life is in. We're a body in the world. Right. We're talking in spatial terms, relational terms with other people and things in the world. We also have to put this into the context of. Of time. And here's why. Because this is another aspect of our identity."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4577.15,"end":4577.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4577.47,"end":4661.66,"speaker":"Fr Stephen De Young","text":"We concluded the first half by saying the goal of the doctrine of the bodily resurrection is that this is the way to talk about the fact that. That my identity, your identity, is going to survive our physical death in this world. Right. That not just a person is going to live again, but Father Steven Deugh, Father Andrew Damick, Charles, who just called in, is going to live again and be that person, have that same identity. And so that means you have to take time into account because the externalities we were talking about in the first half related to identity, those relationships, for example, those change over time, over the course of our lives. Right. So a young boy becomes a single man, becomes a husband, becomes a widower. Each of those things is a key part of that person's identity in each of those phases of his life. Right. But they're not all true of him at the same time."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4664.86,"end":4665.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4666.7,"end":4671.26,"speaker":"Fr Stephen De Young","text":"A young girl becomes an adult woman becomes an old woman."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4672.62,"end":4672.86,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4673.42,"end":4694.86,"speaker":"Fr Stephen De Young","text":"Those relationships, Relationships change over time. Right. And shift. And so our identity is not just something external to us in relationship to other people and things in the world in spatial terms, but our identity is stretched out or spread out through the time of our, our earthly life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4695.42,"end":4695.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4695.9,"end":4696.62,"speaker":"Fr Stephen De Young","text":"In this world."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4697.03,"end":4744.28,"speaker":"Fr Andrew Stephen Damick","text":"I mean, even just thinking about, like, like listener. Think about your own life. Right. So if, if you've got a decent number of years behind you, you can remember things that you did when you were younger, that you. Now you're like, I can't believe I did that. Right. Well, the reason that you did it is at the time it seemed like a good idea. Now you wouldn't say, well, that wasn't me, it was you. Right. But it's, it's also not who you are now, but you're not something, someone other than that, that younger version of yourself. Right. So it's both what you did then and what you think about it now are part of your identity. Right. So there's a temporal facet to who it is that you are."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4746.04,"end":4753.24,"speaker":"Fr Stephen De Young","text":"Right. Right. And you know, we've all had relationships begin and end."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4753.88,"end":4754.4,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4754.4,"end":4804.3,"speaker":"Fr Stephen De Young","text":"Right. Like first 34 years of my life. Well, not first 34 years from, from, from age 13 to age 34. Right. So for 20 years of my life, I had a best friend. Right. He was the best man at my wedding. I was the best man at his wedding. Right. I don't know what it's like to be him or a bat, but for me, right. His friendship was part of my identity. Right. We've fallen out of contact. I haven't been in contact with him for 10 years. Right. So that relationship isn't constitutive of my identity anymore the way it was. If you go back 15 years or 20 years."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4804.78,"end":4814.54,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And we all, we've all experienced behaving in a certain way with certain people and then not anymore, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4816.54,"end":4854.85,"speaker":"Fr Stephen De Young","text":"Yeah. Being the husband to my wife is a core part of my identity now. There was a couple few decades where I didn't know her. Right. And therefore it wasn't, Lord willing, and odds are I'll die first, so I won't have to experience the other end of that. Right. But so this is just a reality, right. Who you are. Right. These things don't usually. Very rarely. Right. If God blesses us with a long life in this world."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4855.27,"end":4855.47,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4855.47,"end":4968.07,"speaker":"Fr Stephen De Young","text":"The average lifespan now is 74. So if you, if you live in the United States, at least if you live 74 years. Right. Your parents are probably not going to be alive that whole 74 years. Not impossible, but odds are good, Right. That they're not going to be. And obviously, if you have children, they're not going to be alive for the first part of that. Right. So all of these things are true, but what that means is our identity, who I am. Who you are is not a snapshot. Right. It's not a snapshot of any particular action you take or any relationship you have that we talked about in the first half, but it's also not a snapshot of any particular moment in your life. Right. And that is who you are and what happens after, or who you are after or who you were before. Doesn't matter. Yeah, right. Sort of. That snapshot is just it. Right. Like, that's it. So when. When we're saying that your. Your identity is sort of spread out across the whole span of your life in this world, that means your identity is, in a certain sense, the sum total of all of that. The same way it's the sum total of all your relationships stacked up. It's the sum total of your actions. It's the sum total of all of those U's. Right. Across. Across your entire life. And that. That snapshot. Right. We tend to. We tend to hold that a person sort of is one particular version of them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4969.91,"end":4970.31,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4971.75,"end":4976.79,"speaker":"Fr Stephen De Young","text":"Sometimes that's because someone has died and there's a version of them that we want to remember."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4977.99,"end":4978.47,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4978.55,"end":4980.23,"speaker":"Fr Stephen De Young","text":"Maybe. As opposed to other ones."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4981.03,"end":4981.59,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4984.87,"end":4994.73,"speaker":"Fr Stephen De Young","text":"We want to sort of deny certain parts or we want to polish up certain parts, but your identity is. Is not who you are the last second that you're alive."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":4995.69,"end":5003.85,"speaker":"Fr Andrew Stephen Damick","text":"Right, Right. Especially. Right. Like people who maybe suffer dementia at the end of their life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5005.05,"end":5005.45,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5006.33,"end":5013.05,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, and, you know, the family members that experience that with them will often say things like, he's not himself."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5013.93,"end":5014.57,"speaker":"Fr Stephen De Young","text":"Yeah, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5015.13,"end":5042.92,"speaker":"Fr Andrew Stephen Damick","text":"You know, he is that person in front of them, that forgetful person in front of them, but he's also what they remember about him that doesn't go away. And you know, even like, not just temporally, but, you know, between multiple relationships. Like, for instance, we've all had the experience of having some. Something said about someone that we know well and being kind of shocked. Like, wait a minute, that's not the Bob I know. Right. But then maybe you find out that that is him also."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5043.64,"end":5044.28,"speaker":"Fr Stephen De Young","text":"That is Bob."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5044.68,"end":5065.48,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Bob. You know, Bob functions this way in this relationship and this way in another relationship and this way in your relationship with him. You know that. And that's. That's the reality of each of us. Right. Like you're a different person with different people. And you're a different person with multiple people at the same time, depending on which group it is."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5065.8,"end":5072.04,"speaker":"Fr Stephen De Young","text":"Yeah. And even if you maintain your complete mental acuity up to the last moment of your life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5072.72,"end":5072.92,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5072.92,"end":5097.52,"speaker":"Fr Stephen De Young","text":"We've. We've criticized before many times. Right. Many, many times the, the whole 19th century German, you know, all of history has led up to this moment. Right. We now stand at the pinnacle. Right. But that's no more true when it's applied to your own life than it is when it's applied to history in general."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5101.19,"end":5101.43,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5102.31,"end":5105.83,"speaker":"Fr Stephen De Young","text":"Because we don't all just make continual progress our whole life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5106.31,"end":5119.43,"speaker":"Fr Andrew Stephen Damick","text":"I know. Like imagine, you know, when I'm. When I'm first waking up in the morning before coffee and then applying that thought. All of my life has led up to this moment in the way that I feel right now. Please know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5120.15,"end":5125.11,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. But even in the sense that sometimes we regress."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5126.54,"end":5128.78,"speaker":"Fr Andrew Stephen Damick","text":"Oh, sure, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5129.1,"end":5129.5,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5130.62,"end":5131.3,"speaker":"Fr Andrew Stephen Damick","text":"Not me, man."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5131.3,"end":5220.01,"speaker":"Fr Stephen De Young","text":"Morally, ethically, spiritually. Right. We have ups and downs. Not just ups. Right. Not just sort of, you know, the ladder of divine ascent is a great image for what it's an image of. Right. But you should not take from that that the Christian life is just going up one rung after another. Right. Like your whole life. That's if you've actually read the book, you know, that's not what indeed about. Right. But who actually reads books anymore? Come on. Right. So it's, it's not just. And the reason why this is very important. Right. The reason why this is very important is. And we're going to. We're going to. As we keep going in this half, we're going to get to this in terms of the judgment, but we tend to have this view, and there are certain theological constructs, like the idea within Roman Catholicism of a state of grace that lend themselves to this, unfortunately, to this kind of thinking, unfortunately. Where we think that, like, if we happen to die at the wrong time, that's going to make some kind of huge difference in what happens after this life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5220.33,"end":5229.69,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which there are whole theologies built on that idea. Yes, there are. Just look up the phrase state of grace."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5229.85,"end":5230.77,"speaker":"Fr Stephen De Young","text":"Yes, exactly."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5230.77,"end":5231.93,"speaker":"Fr Andrew Stephen Damick","text":"And you. You will see."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5231.93,"end":5233.61,"speaker":"Fr Stephen De Young","text":"Right. It lends itself to that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5233.94,"end":5234.18,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5234.26,"end":5247.34,"speaker":"Fr Stephen De Young","text":"That, you know, Hamlet doesn't want to kill Claudius, doesn't want to kill Zuggle because. Right. He's praying. Yeah. I don't know if I kill him while he's praying."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5247.34,"end":5249.38,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Because. Because he doesn't want to send him to heaven."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5249.54,"end":5254.54,"speaker":"Fr Stephen De Young","text":"Yes. So I'm going to Wait until I catch him sinning and then I'll kill him. So he goes to hell, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5254.54,"end":5255.06,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5255.3,"end":5283.79,"speaker":"Fr Stephen De Young","text":"That's not how this works. That's not how this works. Okay. I mean, I'm sorry, I don't think most Roman Catholics take the kind of legalistic interpretation that can be taken of some of their doctrine in this regard, right. That like someone who's otherwise a saint, skips mass one Sunday, gets hit by a bus and goes to hell. Right. I don't think most Catholics actually believe that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5284.03,"end":5285.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, I don't think so."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5287.44,"end":5314.16,"speaker":"Fr Stephen De Young","text":"That kind of legalistic interpretation. But bits of that work into our thinking, right? And that includes when we think about other people. Right, that includes when you think about other people. So the person who Christ is going to judge on the last day is the whole person, not the person at their last moment. If that last moment was a dark moment or a moment of weakness."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5317.44,"end":5317.68,"speaker":"Podcast Advertisement Voice","text":"It'S."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5317.68,"end":5318.32,"speaker":"Fr Stephen De Young","text":"The whole person."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5320.24,"end":5320.64,"speaker":"Podcast Advertisement Voice","text":"Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5321.28,"end":5333.6,"speaker":"Fr Stephen De Young","text":"Not their worst moment, not just their best moment. No snapshot. It's the whole person. And that whole person is. That whole identity is spread out over to the time of their whole life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5334.24,"end":5424.72,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, I think, for instance about, I mean, to me this is one of the classic examples, the life of Saint Mary of Egypt. Right. I mean, if you talked about only the bit at the end, then, yeah, that would lend you to think, okay, yes, you know, wow, what a saint. Right? And absolutely, absolutely amazing, amazing saint. But the bit at the end is part of a much larger arc which includes all the bits at the beginning too. Right. But they hang together as this single story. And that is who Saint Mary of Egypt is. Right. It's not only this incredible desert dwelling ascetic, it's also the profligate young woman who's just obsessed with lust. And it's not like God is going to say, oh well, you spent so many years doing this, so many years doing this, so let me work out the balance here. That's not what that means. It's rather that, that all together it creates this single arc. So that the arc of a human person is, as you said, more than just a snapshot, more than the bit at the end. And in her case, the stuff at the end is made much more powerful and meaningful for us anyway by all that precedes it, frankly. That's why it's an incredible story."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5425.44,"end":5451.93,"speaker":"Fr Stephen De Young","text":"Right. And that isn't erased, it isn't edited out. Right. This is an important part of right away. The Hebrew scriptures. The Hebrew scriptures do not shy away from showing even the people who are elevated as great iconic saints in the Hebrew scriptures. Like David. Like Abraham. Right. Like Moses."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5452.33,"end":5454.82,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Peter."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5454.9,"end":5477.78,"speaker":"Fr Stephen De Young","text":"The Hebrew scriptures have no qualms about talking about places where they sinned and did wrong and fell short. Right. Talking about Moses having God so angry at him, he's ready to kill him because of his disobedience. Right. Like this is the kind of thing that gets edited out of pagan stories about heroes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5478.1,"end":5484.59,"speaker":"Fr Andrew Stephen Damick","text":"Absolutely, absolutely. Because weakness is worthlessness within the pagan context."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5484.91,"end":5501.95,"speaker":"Fr Stephen De Young","text":"Right, right. But this is part of the story. This is part of the story because this is part of who they are. Part of who David is, is the man who repents. Right. Who sins mightily and repents even more mightily."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5503.07,"end":5510.95,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, Right. I mean, is that what the Lord says about the one sinful man? You know, the one who's forgiven much, loves much."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5511.67,"end":5527.27,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And so. Right. It's the whole. So identity. The identity of a person. My identity, your identity, the identity of the saints we've been talking about."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5527.27,"end":5527.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5527.59,"end":5560.19,"speaker":"Fr Stephen De Young","text":"Anyone's identity is a life. A life. This is why we read the lives of the saints. Right. We don't just read a list. Right. We have lists. Right. So. And so is a martyr. But no, it's their life. When did they live? Where? What are these events that happened? Right. That's who they are. We instinctively know this. That's why people buy biographies."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5562.44,"end":5564.6,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, yeah, Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5565.32,"end":5574.6,"speaker":"Fr Stephen De Young","text":"Like, who cares about Grover Cleveland's elementary school education? What does that have to do with anything?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5574.76,"end":5577.56,"speaker":"Fr Andrew Stephen Damick","text":"You just made someone's PhD dissertation not matter."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5577.56,"end":5589.4,"speaker":"Fr Stephen De Young","text":"Come on, Father. Well, no, but my point is people want to read that. People are drawn to that and want to read that. They want to know. Because part of knowing who this person is is knowing where they came from."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5590.36,"end":5590.88,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5590.88,"end":5620.21,"speaker":"Fr Stephen De Young","text":"And what relationships they had and what experiences they had and what they did and how they responded to. Right. That's who they are. Oh, right. Not just the things Grover Cleveland did as president. Right. In his two non consecutive terms. The. The. It's what? It's his whole life. Right. That's why people want to read biographies."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5624.05,"end":5624.69,"speaker":"Fr Andrew Stephen Damick","text":"A whole."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5625.09,"end":5638.93,"speaker":"Fr Stephen De Young","text":"A whole life is. Right. So your identity, if you're alive, if you're alive right now and listening to this, if you're dead right now and listening to this, I have less to say to you. I don't know what it's like."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5640.29,"end":5641.49,"speaker":"Fr Andrew Stephen Damick","text":"We'd like to hear from you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5641.9,"end":5660.3,"speaker":"Fr Stephen De Young","text":"Yes. But call in. By all means, please call in. This is Art Bell now. We are officially on the Art Bell Show. Right. But if you're alive Right now, right? Then your identity is something that's still being formed."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5661.58,"end":5663.66,"speaker":"Fr Andrew Stephen Damick","text":"Yep, yep."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5663.98,"end":5749.28,"speaker":"Fr Stephen De Young","text":"Right. And this is what is so key in terms of the concept of repentance in the Christian life, right? Is that you may look back at all the selves you've been over the course of your life with disgust, right? And you may even be right to do so. Other people, if they knew everything, might share your disgust, but that doesn't mean that's who you need to be tomorrow or the next day or the day after that or the rest of your life. And whoever you become now, with however much time you have left in your life, in this world is going to shape, is going to conclude, is going to fill out that story. And who you are, right, that's still being formed. That's not something, right? Who you are is not something that, sorry, Calvinists, God decreed at some time in the past and now it's just sort of playing out and you're watching it happen and it's not something you have to dig around and discover. It's something that's being formed in time and space as you relate to people and you live and you act in the world, you do things. Because a life, right, A life which is your identity, is what you're living in and through your body. You can't live a life abstracted from your body. That's why the Internet isn't real."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5751.02,"end":5751.22,"speaker":"Luke","text":"That'S."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5751.22,"end":5775.1,"speaker":"Fr Stephen De Young","text":"Why Twitter isn't real, that's why Facebook isn't real. That's not living. And a life is lived. We talked last time about a world, an age, right? It's meaning it's related to other people in the world and other things in the world, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5776.47,"end":5777.35,"speaker":"Fr Andrew Stephen Damick","text":"Fully embedded."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5777.75,"end":5847.64,"speaker":"Fr Stephen De Young","text":"Yeah. And across a particular span of time, right? If you live the average life expectancy of 74 years, it's a particular 74 years in the world going from one date to another date, right? Your life is lived with other people, right? And as we've talked about on the show before, right, if. If we take you and we pluck you out of your world, right? Your phenomenological world, the world of your experience, we pluck you out of your time, we pluck you out of all your relationships, we pluck you out of your body, right? You have no identity, there's nothing left, right? This is why, as we've said before on the show, we like sometimes to sit around and imagine what would it have been like if I had been born in 13th century France, right? But that's not an intelligible Sentence. Because if I was born in 13th century France, it wouldn't be me."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5849,"end":5850.84,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Your accent would be very different."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5851.24,"end":5853.56,"speaker":"Fr Stephen De Young","text":"Yes. And I'd be shorter."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5854.76,"end":5855.32,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5856.84,"end":5870.69,"speaker":"Fr Stephen De Young","text":"I'd have a different hair color, but. Right. But not just those. That, Yes. I would have a different body. I saw their head. Right. But I would be surrounded by different people and have different kinds of relationships with different people."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5871.73,"end":5872.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5872.37,"end":5883.33,"speaker":"Fr Stephen De Young","text":"I would live across a different span of years in a different culture, with a different religious practice, with a different. In a different community. Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5883.33,"end":5886.86,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There is a different set of opinions about the English."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5887.18,"end":5891.26,"speaker":"Fr Stephen De Young","text":"There's literally nothing about me that would be the same. So it wouldn't be me."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5892.54,"end":5893.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5894.38,"end":5933.51,"speaker":"Fr Stephen De Young","text":"Right. You. You couldn't say it would be me. Right. Because I am, in the sense of identity. All of those things. Right. All of those things. And what this ultimately means is not just, well, it's fun to think about what it would be like to live in another time, but that's impossible. Right. That's just kind of a bummer. What this really means, more importantly, is that the whole idea of individualism that our whole modern society is built upon, it's one of the core principles of modernism is individualism is a lie."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5934.63,"end":5935.11,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5936.47,"end":5942.47,"speaker":"Fr Stephen De Young","text":"There is no such thing as an individual. By definition, the individual is nothing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5943.35,"end":5959.63,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's persons and person means relationship, Right. Yep. Yep. All right. Well, believe it or not, you've wasted two perfectly good halves of your life on the Lord of Spirits podcast."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5959.63,"end":5961.99,"speaker":"Fr Stephen De Young","text":"Well, I hope they haven't wasted two halves of their life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5963.65,"end":5964.85,"speaker":"Fr Andrew Stephen Damick","text":"Well, see, there's. Just like this."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5964.85,"end":5966.37,"speaker":"Fr Stephen De Young","text":"Did they all just drop dead?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5966.53,"end":5974.53,"speaker":"Fr Andrew Stephen Damick","text":"This stow has three halves. A human's life might have more than two halves. Give it 10,000 halves. You never know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5975.65,"end":5977.09,"speaker":"Fr Stephen De Young","text":"Try to kill off our audience."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5980.53,"end":5986.85,"speaker":"Fr Andrew Stephen Damick","text":"Anyway. Right, so we're going to go ahead and take our second break and we'll be right back."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":5987.01,"end":6003.26,"speaker":"Announcer","text":"Father Andrew Steven Damick and father Stephen DeYoung will be back in a moment to take your calls on the next part of the Lord of Spirits. Give them a call at 855-237-2346. That's 855-AF-RADIO."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6008.14,"end":6077.58,"speaker":"Announcer","text":"The top 10 reasons to attend the ancient faith men's retreat fellowship with other orthodox Christian men. Number two, hearing from four speakers, all priests and one hieromunk. Number three, daily matins and vespers, plus acathist on Friday and divine liturgy on Sunday. Four, supplication at the relics of St. Raphael and learning about his life in the Antiochian Village museum. Number five, giving back to Antiochian village through a service project. Number six, enjoying the beautiful grounds of Antiochian Village Village, including the meditation trail and hikes. Number seven, football during free time. Number eight, delicious breakfast, lunch and dinner. Number nine, bonfires and s' mores each night. And number ten, the opportunity to learn and be encouraged in what it means to be a man. August 22, 25th, 2024 at Antioquian Village in Bolivar, Pennsylvania. For more information and to register, just click on the banner on the Ancient Faith website homepage or the lead graphic on the AFM app. We really hope to see you there."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6081.34,"end":6097.51,"speaker":"Announcer","text":"We're back now with the Lord of Spirits with Father Andrew, Stephen Damick and Father Stephen DeYoung. If you have a question, call now at 855-237-2346. That's 855-5-AF radio."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6099.67,"end":6115.75,"speaker":"Fr Andrew Stephen Damick","text":"It's the Lord of Spirits podcast. And may you have many halves of your life. Number 11. May you have many halves of your life. We do have some callers lined up, Father Stephen. People have curiosity about what it means to be bodily raised."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6115.83,"end":6117.35,"speaker":"Fr Stephen De Young","text":"Well, hopefully they are cats."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6120.31,"end":6126.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, the T.S. eliot set of poems was way better than the musical I Will Die on that Hill, everybody."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6127.13,"end":6141.37,"speaker":"Fr Stephen De Young","text":"So I believe the conspiracy theory put forward by the unbreakable Kimmy Schmidt that Cats is not real. It is not a real musical. It is a different set of improv done every night by out of work actors."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6142.73,"end":6143.69,"speaker":"Fr Andrew Stephen Damick","text":"I am on board."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6143.77,"end":6144.81,"speaker":"Fr Stephen De Young","text":"Pretend they have a job."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6147.46,"end":6149.14,"speaker":"Fr Andrew Stephen Damick","text":"That includes the movie, too, isn't it?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6149.3,"end":6149.78,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6150.42,"end":6158.9,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Which no sane human should ever watch. So we do have some callers. First, we're going to take Timothy. So, Timothy, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6160.1,"end":6160.46,"speaker":"Luke","text":"Hi."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6160.46,"end":6161.22,"speaker":"Judah","text":"How are y' all doing?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6161.62,"end":6163.94,"speaker":"Fr Andrew Stephen Damick","text":"Good. How are you? I'm good."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6163.94,"end":6167.14,"speaker":"Judah","text":"I'm down here in Georgia. Hence the Southern accent."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6167.94,"end":6170.58,"speaker":"Fr Andrew Stephen Damick","text":"I'm assuming you don't mean Republic of Georgia. It's that the."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6171.78,"end":6173.7,"speaker":"Judah","text":"Not that my accent would be a little different."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6177.78,"end":6180.26,"speaker":"Fr Andrew Stephen Damick","text":"So, Timothy, what's on your mind down there in Georgia?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6181.06,"end":6232.01,"speaker":"Judah","text":"Well, I'm an Orthodox convert, and before I converted, I converted. When I got married, my mother had passed and her last wishes were to be cremated. She didn't want to put a big burden of expense. She was fully disabled at the end of her life, had no savings, so she didn't want to pass on the cost of the future funeral to her children. And so she wanted us to cremate her, which we did. And upon becoming Orthodox, I discovered that the orthodox cremation is not an option after you die. So my question is, did this affect her salvation and am I Are any of my brothers culpable because we went through with her final wishes? I know this is probably a pretty dark question, but it's, it's been plaguing me and I really would like to get some, some feedback on it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6232.49,"end":6268.02,"speaker":"Fr Andrew Stephen Damick","text":"That's a good question. The short answer is no. Right. In terms of does it affect her salvation, right. It's not like from what you said anyways, it's not like she thought, well, I'm going to be cremated because I don't believe in the bodily resurrection and I want to do everything I can to thwart it. Right. I, I doubt that was her, her deal. And, and my guess is that was, that was not the intention of, of your family either. You know, you didn't, didn't have the context, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6270.66,"end":6272.42,"speaker":"Judah","text":"It's not like from what you said."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6272.42,"end":6273.94,"speaker":"Luke","text":"Anyway. Sorry."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6274.58,"end":6510.6,"speaker":"Fr Andrew Stephen Damick","text":"Oh, kind of cut in and out there a little bit. But, but yeah, so, so absolutely, you know, the fact that she was cremated does not mean that her possibility of salvation is under. In question. The reason why the Orthodox Church does not traditionally do funerals for those who have been cremated is precisely because, number one, it's to emphasize the resurrection of the body. Right? And so if a body is going to be raised and you know that, and you understand that burial is the traditional practice, then you would not do that to a human being. Right. If you, if you have that understanding. So the context in which funerals are refused for those who've been cremated is the context of someone that's deliberately disobeying that right? Now still, probably even if someone was like, I'm trying to think of a context in which someone would, you know, that that would be. It would get done. And I guess maybe people who are out of touch with the church and kind of don't know its teachings or whatever, and then, and then they're dead and they're cremated and then someone calls the priest. I don't know, you know, but in any event, the point is, as I said, to, to underline the practice of burial as being the norm. Now if someone, let's say someone dies in a fire, right? Which is similar in a lot of ways, although it's not quite the same, because cremation, frankly, involves not just the burning of the flesh, but also the crushing of the bones, right? Because bones don't burn up, you know, so someone who dies in a fire, there's still the remains of their bones. Would a funeral be done for them? Yeah, sure. You know, someone who dies in a fire, I mean, Saint Polycarp was killed with fire. That was his martyrdom. And you know, it says explicitly in his life that they collected his bones as, as precious relics. Right. So there was no sense of that something shameful had happened, you know, to him as a result of that. So, yeah, I would say, you know, the thing is like, well, okay, you know better now, right? So make sure you put in your will that your, Your burial is to be done according to the traditions, the Orthodox Church. And since you brought it up, I want to say, by the way, that a lot of people do have this sense that, that cremation is the cheapest option. That is not always true. And a lot of times people don't know that there are other options that can sometimes be less expensive. And let me suggest that a lot more parishes need to do what some parishes have done and take it upon themselves to help take care of people's bodies. Like there are whole parishes where funeral homes are almost never involved in the burial of their people because the people of the parish take care of that person's body. And maybe all you have to do is hire like a grave digger, you know, to, to. To do what's needed in the cemetery. Right. And. But even then, there are some cases where you get. A lot of the men of the parish will get together and dig the grave. So, you know, it's not like we didn't have burials before someone invented the backhoe, right? So, so that's. Those things are all possibilities. Funerals do not need to be big, expensive things that they often can be now. But I think, because a lot of times we function in, frankly, in ignorance, we just don't know that there are other options. That's all we think is like, well, you know, I want to be the least burden, so please have me cremated. And I understand if someone does not. Does not know, but that's part of why I, I'm saying this now. There are other options, you know, so, yeah, that's totally a thing. I don't know. Father, do you want to add anything to any of that? Well, just."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6513.16,"end":6539.17,"speaker":"Fr Stephen De Young","text":"On the larger issue, God loves you and he loves your mom and he's not waiting for you to break a rule that you don't even know about so he can lower the boom on you. Really? That's not who God is. I know we've been taught by cultural stuff that that's who God is. That's not who God is."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6539.17,"end":6541.73,"speaker":"Fr Andrew Stephen Damick","text":"We're actually going to. Damnation."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6542.29,"end":6568.18,"speaker":"Fr Stephen De Young","text":"We're going to get into this a little bit in the Third half. But anybody who experiences the negative side of the Last Judgment, if there is anyone. Right. Anyone who does experience that, it's going to be because they chose and pursued that. Right. Not because they messed up or because God relegated them to it. It's not how God works."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6568.58,"end":6570.98,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6571.7,"end":6573.7,"speaker":"Judah","text":"So thank you very much for your answers."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6574.34,"end":6579.63,"speaker":"Fr Andrew Stephen Damick","text":"You're welcome. And, you know, pray for your mother's soul, because that's what orthodox Christians do."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6580.43,"end":6581.39,"speaker":"Judah","text":"I do do that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6582.11,"end":6589.79,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Good. Good. Well, thanks for calling, Timothy. All right. Well, we now have Bethany calling. So, Bethany, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6591.15,"end":6595.63,"speaker":"Bethany","text":"Hi. I'm also calling from Montana, one of the three people in the state."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6596.03,"end":6600.11,"speaker":"Fr Andrew Stephen Damick","text":"What? We've had two thirds of Montana call us tonight. That's amazing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6600.75,"end":6603.87,"speaker":"Fr Stephen De Young","text":"Can you see out on the horizon, the previous caller?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6605.23,"end":6606.19,"speaker":"Bethany","text":"No, I can't."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6606.35,"end":6606.91,"speaker":"Fr Stephen De Young","text":"Okay."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6606.99,"end":6612.67,"speaker":"Bethany","text":"But I can see mountains and trees. Maybe if I look closely, I might see a grizzly bear."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6612.83,"end":6622.35,"speaker":"Fr Andrew Stephen Damick","text":"Montana stereotypes confirmed. Yeah. Well, Bethany from Montana, what is on your mind this evening?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6623.71,"end":6663.73,"speaker":"Bethany","text":"Yeah, my question has to do with interiority and exteriority regarding our faith. And because you've mentioned, I think, Father Andrew, you mentioned this when you went on Jonathan for Joe, unlike how martyrdom does not wipe out the stain of heresy, however, we have Ethiopian martyrs. And then you've also talked about how, like, you can hear heresy in coffee hour and how some saints did some interesting things, but they're saints because of they lived holy light."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6664.69,"end":6665.25,"speaker":"Fr Stephen De Young","text":"And then."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6667.65,"end":6695.24,"speaker":"Bethany","text":"I read a letter of divine ascent just lent after reading a lay person's guide first. And we get to this one point, let's see if I remember it correctly, where we have this one monk where everyone thought he was, you know, a good, nice, good monk, but then in his final hours, he's like, going over everything he did and they don't know how just what type of good monkey was based on his interior life. So what is the balance?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6697.16,"end":6928.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, so this is a great question because there's at least, at least three things in play here, right? There's the stuff that you say and think as, as one set. Okay. There's the stuff that you do, right. The things that are. That are apparent with your body. Although it should be argued by the way that things you think are also bodily. But, but for the sake of trying to understand these as sort of sets, this is the way I'm going to suss it out. And then there's what you're describing as the interior life. Okay. So someone could be an accidental heretic in the sense that they have an opinion that is wrong. Right. And traditionally, while you could use the word heresy or heretic to refer to that, traditionally, the kind of. The strictest sense of what that means is someone who has rejected the correction of the church. Right. Not just someone who has a wrong opinion. Right. You know, and especially someone who's teaching that thing. Right? So for instance, the anathemas, the ecumenical councils, often make reference to those who teach X, Y and Z anathema, right? Not just those who happen to think this or whatever, but those who are teaching it. So it's a very deliberate, very sustained, very purposeful choice to go against the correction of the church. Okay, so that is different from just what you happen to think. And then also I would say, like, what does the interior life actually consist of? Okay. Is it your opinions? Is it the thoughts that you have by themselves? In terms of the traditional spiritual literature of the church? When talking about the interior life, often the biggest thing that that is talking about is your prayer. You know, the way that you pray, especially privately, and the way that you repent, especially privately. Okay? So that is an action or set of actions, really. Right. And so then that's actually related then to the things that you do. So that's why, for instance, that the three traditional disciplines of the church are prayer, fasting, and almsgiving. These are things that are both interior and exterior in terms of the way that they're aimed at the world. Right? But they are all exterior in the sense that they are all things that you are doing with your body. The interior life is a thing you're doing with your body. So that interiority is a different. It means something different than the interiority that we've been talking about in this episode in general. Right? Because it is something you do with your body. Like when you pray, that is you focusing, focusing your noose on God and, you know, probably praying with words. Unless you're really spiritually advanced and you can kind of get beyond that, which I'm not. Most people are not, you know. So these are all actions that you take, right? So if someone has a wrong opinion and they never encounter correction from the church, and so it never really becomes an issue, does that make that opinion not matter? No, of course it matters. But for them, it probably doesn't matter very much. Right? Because if they're living a faithful life in the church, even if they're kind of mistaken about something, the point is that they were faithful, right? Because again, as I said, there's a thousand heresies Every coffee hour, people say stuff that's just really Screwy."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6930.43,"end":6936.83,"speaker":"Fr Stephen De Young","text":"For me. That's just one parishioner. He knows who he is. ALVIN Heresies, every coffee."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":6939.87,"end":7005.58,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And I mean, probably a lot of sermons have heretical things that are being said because the priest is just mistaken, you know? So. Yeah, it's not a, you know, God's judgment on us is not a gotcha system. Okay. It's not, it's not like I, you know, I have people in my life who do not use language in the way that I do. Like, I try to be very precise with the way that I speak. I still say things offhand. I still have verbal habits, et cetera, But I have people in my life that do not use language in the way that I do. And it drives me insane. And they often say things that are literally wrong. But I also know what they mean, and I know what they're getting at. Right. And if I know what they're getting at through experience, years of experience with these people, how much more does God know what we're getting at, who we really are? That maybe the way that we talk and the way that we think, think is not really expressive of that. So I don't know, does that, does that make some sense?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7005.58,"end":7010.22,"speaker":"Fr Stephen De Young","text":"BETHANY yeah, Father Steve, Because I guess."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7010.22,"end":7019.26,"speaker":"Bethany","text":"We could say that since everything's done with our bodies, because thoughts being aren't like neural synapses, they're still exterior, in a sense."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7019.9,"end":7024.14,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. In fact, I mean, traditionally, the teaching is that thoughts come to us from the outside."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7024.46,"end":7055.58,"speaker":"Fr Stephen De Young","text":"Right. That's the key. Right. That's we think of our mind as our brain, which is in a box, sort of churning. But the noose is like a sensory organ. Our mind is actually like a sensory organ. Thoughts are external to us. So we very easily identify the things that our eyes see and our ears hear, our nose smell. Those are as being external to us. But because of our modern view of the mind, we don't correctly identify thoughts as external to us."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7056.58,"end":7063.78,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. Which is a little mind bending. I know. So, all right, does that help?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7063.78,"end":7066.98,"speaker":"Bethany","text":"BETHANY so what's the interior, then?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7070.66,"end":7073.22,"speaker":"Fr Andrew Stephen Damick","text":"What do you think? Father? How do we describe the interior?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7073.22,"end":7074.38,"speaker":"Fr Stephen De Young","text":"I mean, a big."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7074.38,"end":7076.02,"speaker":"Fr Andrew Stephen Damick","text":"I feel like we've spent a lot of time."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7076.02,"end":7078.18,"speaker":"Fr Stephen De Young","text":"Yeah. A lot of times saying that a whole."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7078.34,"end":7092.47,"speaker":"Fr Andrew Stephen Damick","text":"It's not like what can be said about it, anything you might say about it. Would it be an exterior kind of thing to say, you know? Yeah, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7092.47,"end":7096.51,"speaker":"Fr Stephen De Young","text":"Because, like, your soul doesn't take up space, time. Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7096.51,"end":7103.23,"speaker":"Fr Andrew Stephen Damick","text":"Like, yeah, I think we might say the soul. But remember, the soul is not a."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7103.23,"end":7107.63,"speaker":"Fr Stephen De Young","text":"Not a thing it's not a thing. It's not a thing in the world. Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7108.27,"end":7138.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, it's the life of the thing. So, yeah, that's. That's what we mean by it. It's a little difficult to say, but that's. That's what it is. All right, well, thank you for calling Bethany. Great. Yeah. It's funny, I have to say that there's not a lot of people in the world named Bethany. It's a relatively rare name, but one of them is my sister, and this is not my sister who called, by the way. Everybody, my sister does not live in Montana, as far as I'm aware."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7140.42,"end":7142.34,"speaker":"Fr Stephen De Young","text":"You don't know where she is right now today?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7142.42,"end":7143.26,"speaker":"Fr Andrew Stephen Damick","text":"Like, I don't know where."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7143.26,"end":7144.66,"speaker":"Fr Stephen De Young","text":"She doesn't call me and give me."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7144.74,"end":7166.27,"speaker":"Fr Andrew Stephen Damick","text":"You know, her whereabouts all the time. But, yeah, so it creates a little weird cognitive dissonance in my head, because to me, Bethany is the name attached to my sister, and I don't really actually know anybody currently in my life with that name. So, anyway. All right, we're going to take one more call, and that's Judah. So Judah has a question about the saints who rose from the dead when Jesus was crucified. Right. Judah, welcome to the Lord of Spirits podcast."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7167.23,"end":7167.67,"speaker":"Luke","text":"Hi."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7167.67,"end":7169.15,"speaker":"Judah","text":"Father's blessed. Can you hear me?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7169.39,"end":7170.91,"speaker":"Fr Andrew Stephen Damick","text":"God bless you. Yes, we hear you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7172.11,"end":7172.71,"speaker":"Judah","text":"Awesome."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7172.71,"end":7173.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7173.07,"end":7199.24,"speaker":"Judah","text":"So I was looking through the gospels, and I remembered it might have been something you guys said in a previous episode, but there's this part where after Jesus is crucified, it says that the saints came out of their graves and they went to the holy city and appeared to many. Is there any sort of correlation between this bodily resurrection and the bodily resurrection that awaits the faithful around or after the second coming?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7199.96,"end":7208.72,"speaker":"Fr Andrew Stephen Damick","text":"That's a great question. So, yeah, as I say, Father, I've answered all of the rest of them first. Why don't you go ahead and. Unless you just want to say yes, that was it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7208.72,"end":7227.52,"speaker":"Fr Stephen De Young","text":"I was just going to say yes. Yeah, it's in St. Matthew's gospel. And there's something even more interesting than that, because when Christ dies, they come to life, but they don't emerge from their tombs until he does."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7229.76,"end":7230.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, that's what it says."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7230.96,"end":7250.81,"speaker":"Fr Stephen De Young","text":"So if you want to take it woodenly, literally in St. Matthew's gospel, like they rose, they sat around for two days, and then came out of their tombs and appeared to people. Right. I would suggest that we not take it that woodenly literally. It's weird enough without adding more weird."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7252.57,"end":7253.13,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7253.29,"end":7360.38,"speaker":"Fr Stephen De Young","text":"So the idea behind that detail I think is the idea that the resurrection of Christ is the beginning of the general resurrection. Right. And that's why they come out when. When Christ is raised. And the fact that the phrase is they appeared to many also implies that something about that coming out of the tombs, that it's not like they crawled up out of the ground and like, walked around covered in dirt and. Right. Like the walking dead or something. Right. Because they're appearing to people. That implies they're then sort of disappearing and appearing. Appearing to someone else sort of the way Christ did. Right. So I think what St. Matthew is doing there narratively is what St. Paul is doing in Hebrews when he says in Hebrews 11, that the saints of the Old Covenant, the Old Testament, were not made perfect until with us. Right. So Christ's resurrection is sort of when they, on the whole, minus Moses, Enoch, Elijah. Right. Experience the resurrection. And that's why you get them making appearances similar to the appearances of Christ. Right. And so then, like Christ's appearances after his bodily resurrection, those appearances would then be sort of a glimpse or a taste or the first fruits or a through line to the general resurrection when it comes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7364.3,"end":7388.74,"speaker":"Fr Andrew Stephen Damick","text":"I don't think I've ever heard it put quite that way before because, I mean, like, the sense that I think that it usually gets talked about and correct me if I'm wrong, because I want to be correct on this, is that there's a group of people who come to life, you know, who are resuscitated, like in the way that Lazarus was and that presumably die again at some point."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7389.14,"end":7399.38,"speaker":"Fr Stephen De Young","text":"Right. No, I don't. That's ignoring, I think, what St. Matthew actually says when he talks about them appearing to people."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7400.42,"end":7402.34,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Although there is now this."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7402.34,"end":7412.51,"speaker":"Fr Stephen De Young","text":"There is nothing about them dying again. And it's specifically, you have to take into account that it's talking about the Old Testament, Testament saints. So it's talking about the righteous ones of the Old Testament."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7412.59,"end":7413.15,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7413.39,"end":7429.23,"speaker":"Fr Stephen De Young","text":"Right. And you have to understand that in the Pharisaic tradition, their way of saying somebody was a saint in our modern terminology. Right. One of the very common ways in the second Temple period is that they will be included in the resurrection of the dead."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7430.19,"end":7430.59,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7431.23,"end":7458.48,"speaker":"Fr Stephen De Young","text":"That's what you would say. Daniel will surely be included in the resurrection of the dead. Isaiah will surely be included in the resurrection of the. The dead. Right. And so the idea is, right, remember, remember what Christ says in St. John's Gospel to Martha, right. He says, do you believe in the resurrection of the dead? She says, yeah, I believe on the last Day. And Jesus says, I am the anastasis. Right, yeah, Jesus is the anastasis."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7458.72,"end":7459.2,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7459.28,"end":7465.36,"speaker":"Fr Stephen De Young","text":"So them being part of it is what I think St. Matthew is dramatizing. But you got to take that Jewish context."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7465.75,"end":7508.83,"speaker":"Fr Andrew Stephen Damick","text":"It's interesting. Also, like, as I'm trying to put this together in my head, I think about. Now, obviously this is not a canonical text, but like the Gospel of Nicodemus where the frame narrative is, there's these two sons of Simeon who came out of their graves and are living in some house somewhere and they bring them down to in front of the Sanhedrin to tell what they saw in the underworld, you know, which is then where you get the whole harrowing of Hades narrative, you know. But I think that that still works like, and within the frame that you're describing, even though it's a lot more kind of literalized in the sense of like they live in some house somewhere."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7509.07,"end":7512.35,"speaker":"Fr Stephen De Young","text":"You know, that's also a narrative frame."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7512.35,"end":7513.07,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7513.07,"end":7514.91,"speaker":"Fr Stephen De Young","text":"Like for the Gospel of Nicodemus."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7515.47,"end":7527.73,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. So anyway. Well, that's interesting. We must talk on this more. I will hear more of this at some other time. Yeah. So. All right. Well, Judah, I hope that that's helpful and useful to you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7529.41,"end":7546.61,"speaker":"Judah","text":"Yeah, it certainly was. It's definitely going to be something I'll have to poke around a bit more. I'm going to be doing a semester at Hellenic College in a little bit. But before I go, I did want to briefly mention that my dad is the co host of Bruce Beards and Shipwrecks with Jamie Beditz."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7547.6,"end":7548.48,"speaker":"Fr Andrew Stephen Damick","text":"Oh, all right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7548.48,"end":7560.96,"speaker":"Fr Stephen De Young","text":"It's wise you said that before asking the question. We might have, just not because we have anything against you or your father. Just, we don't want you to start rapping."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7564.72,"end":7565.44,"speaker":"Fr Andrew Stephen Damick","text":"It's true."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7565.76,"end":7568.88,"speaker":"Judah","text":"My dad bosses around the house all the time, actually."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7569.6,"end":7583.75,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I mean, I love Jamie Bennett, but yeah, the rapping thing just bugs me. What can I say? All right, well, thank you for calling Judah and God be with you as you study up there on the holy hill in Brookline, Massachusetts."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7585.03,"end":7585.59,"speaker":"Luke","text":"Welcome."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7585.59,"end":7586.95,"speaker":"Judah","text":"Thank you again. Goodbye."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7587.19,"end":7590.71,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. All right. It's the third half of the Lord of Spirits."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7590.79,"end":7592.39,"speaker":"Fr Stephen De Young","text":"Are there no more callers on the line?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7592.63,"end":7595.91,"speaker":"Fr Andrew Stephen Damick","text":"That's it. We're closing down, man. Yeah, I'm sure."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7596.23,"end":7597.11,"speaker":"Fr Stephen De Young","text":"Not one more."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7597.43,"end":7625.9,"speaker":"Fr Andrew Stephen Damick","text":"Not even one more. Yeah. I mean, do you just want to take. Actually, by the way, this would be a good point to tell everybody the next episode is not going to be in two weeks. It's going to be in three weeks. It's going to be on the 29th of August. And we're going to do an all Q and A episode. So we will take all callers that night. So."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7626.87,"end":7628.07,"speaker":"Fr Stephen De Young","text":"Yeah, all of them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7629.27,"end":7646.39,"speaker":"Fr Andrew Stephen Damick","text":"All. Wipe them out. All. Yeah. Right, so what exactly is eternal life, then? If we're talking about the bodily resurrection, it's not just about bodies coming up, it's eternal life. So what is that? What does that actually mean?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7646.87,"end":7647.27,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7648.47,"end":7648.87,"speaker":"Fr Andrew Stephen Damick","text":"So."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7650.71,"end":7695.08,"speaker":"Fr Stephen De Young","text":"As if what we've already gone through wasn't enough. Right? So let's. Let's. Before we go any further, let's synthesize the first two halves of the episode, not of your life. So in order for the bodily resurrection to be a bodily resurrection, meaning in order for the bodily resurrection to be your Identity, Father Stephen DeYoung, Father Andrew Damick, you, the listener. I wonder if that's somebody's. If your name is Hugh and you're a listener, just know I'm always talking about you and I say Hugh the listener."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7697,"end":7698.76,"speaker":"Fr Andrew Stephen Damick","text":"I might have met that guy in Wales."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7699.48,"end":7755.2,"speaker":"Fr Stephen De Young","text":"Okay, so, yeah, for it to be Hugh the listener, for it to be him who is alive again after having physically died, that not only the web of relationships in which we have lived and our actions need to be resurrected, but the time, the time of our life needs to be resurrected or redeemed, as it were. Yeah, all of that. This life, the life we live in this world, we live a life that needs to be restored."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7758.41,"end":7758.65,"speaker":"Judah","text":"And."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7760.97,"end":7820.99,"speaker":"Fr Stephen De Young","text":"I know this is a little brain straining, but this is actually how at least significant portions of the New Testament talk about eternal life. Because a lot of us hear eternal life, right, or life of the age, if we want to be pedantic or we've read a lot of dbh, right? As we talked about last time, you could have the life of the age to come, and the age to come can have no end. But even when we say that, right, we say that the life of the age has no end. The way you may hear that and the way a lot of times we traditionally think about that is, okay, I'm going to die. There's going to be the intermediate state, right? Then the bodily resurrection will happen. I'll be alive in the body again. And then there will be just an endless succession of moments."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7822.43,"end":7824.35,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, It'll just go on and on, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7824.43,"end":7860.12,"speaker":"Fr Stephen De Young","text":"Time will go on pretty much like it is now, but it'll go on forever. And that's what eternal means, Right. In this case, right. Eternal just means that that one, this one, comes to an end that one won't. Right. And it's Good that this one comes to an end because there's all this bad stuff in the world, but that one, there will just be good stuff in the world. So it'll go on forever with just good stuff. Right. That's sort of problematic for a bunch of reasons. Watch the Good Place if you want to know some of them."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7862.62,"end":7862.86,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7863.1,"end":7904.47,"speaker":"Fr Stephen De Young","text":"But most importantly, that's not how a lot of, as I was just saying, the New Testament scriptures actually talk about it. So the way particularly this is particularly pronounced in the Johannian literature, meaning the stuff written by St. John that's in the New Testament, that eternality is an adjective, is a quality that is applied to our life, not just sort of to our soul or to our life force or something, but to the actual life that we live in this world."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7905.35,"end":7907.75,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. So it's not just something in the future."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7908.71,"end":7948.49,"speaker":"Fr Stephen De Young","text":"Right. The life we live in this world that's already going on, this life already in progress. Right. Has eternality applied to it through the resurrection of Christ, takes on this quality that it didn't previously have, is transformed or transfigured in some way such that it now possesses that quality. Right. And so a good example of eternal life being talked about this way is in first John 5, 11, 13."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7949.45,"end":7972.82,"speaker":"Fr Andrew Stephen Damick","text":"Okay. Yeah. It goes this way. And this is the testimony that God gave us an eternal life. And this life is in his Son. Whoever has the Son has life. Whoever does not have the Son of God does not have life. I write these things to you who believe in the name of the Son of God, that you may know that you have an eternal life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7975.3,"end":7982.94,"speaker":"Fr Stephen De Young","text":"Now, you may have noticed if you're following along in your Bibles because you're really good at sword drills and you were able to look it up that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7982.94,"end":7984.66,"speaker":"Fr Andrew Stephen Damick","text":"Fast sword drills."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":7986.42,"end":8043.88,"speaker":"Fr Stephen De Young","text":"That Father Andrew added an indefinite article at a couple of points, meaning instead of just saying that you may know that you have eternal life, he said you may have an eternal life. There's a reason for that. It's that the adjective eternal, when it's applied to life in the New Testament, especially the Johannian literature, is always an Arthuris and is always indefinite. That's why there's an indefinite article. Right. So it is correct to read it in English in that way that you have been given an eternal life. Right. You live a life, that life has taken on this capacity of eternality. Now again, I know this is kind of brain bending."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8044.27,"end":8044.75,"speaker":"Fr Andrew Stephen Damick","text":"Okay."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8045.87,"end":8146.42,"speaker":"Fr Stephen De Young","text":"How can. Because my life in this world had a beginning and will have an end. Right. So how can this life be transformed and transfigured and become eternal. What we talked about and showed in the first two halves is this life in this world, being transformed and becoming eternal is exactly what our body, being resurrected to eternal life means. Because if it isn't our life in this world that's resurrected and transfigured and made eternal, then it's not us in terms of identity. It's not us in terms of identity. At that point, we'd be talking about becoming someone else who's not us in fundamental ways. We're going to go more into this, right? We're not leaving. Erica Vagar I know this is kind of tricky to understand, but if you've read much in orthodox theology, right, both patristic and sense, especially things talking about theosis, right. You may have run across different authors, both, you know, later theologians, saints, church fathers, using terminology like talking about people in salvation, in theosis, becoming uncreated or becoming unbegotten, which sounds completely weird because."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8146.42,"end":8148.7,"speaker":"Fr Andrew Stephen Damick","text":"Humans are created and were definitely begotten."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8148.94,"end":8152.97,"speaker":"Fr Stephen De Young","text":"Yes, that sounds bizarre. Like we, you know. Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8153.53,"end":8154.65,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8155.05,"end":8530.92,"speaker":"Fr Stephen De Young","text":"But, right. I think if we, if we start to get a handle on this way of thinking about eternal life, those kind of terms make sense, right? That our life in this world, our actual life, our actual identity, that that is transfigured and made eternal, then while it still sounds a little wonky, you could understand what it would mean. Because if something is truly eternal, the way we talked about God's eternity last time, right, which is not just an endless succession of moments, then that makes sense of this unbegotten or uncreated language. That language is somewhat awkward to us. Pointer to the kind of thing that we're talking about right now. But now, right, if you're tracking, if you've kind of got your head around what we're talking about, a question that might be occurring to you is, okay, so again, anybody listening who's able to routinely call in, at least, is still alive. Their life in this world is not done, right. It's, it's in progress. But you're probably already looking back at various points in your life and things that have happened and said, well, I definitely don't want that part to become eternal. Yeah, right. Like they're probably. You can think of moments and times in your life that you would love to be eternal. You would love them if those moments and those times in the relationships you've shared, including your relationship with God. Right. Maybe especially your relationship with God, if those moments and stuff, if those became eternal, that's heaven, right? Totally down with that. But there are probably also moments in your life where you're like, if that became eternal, that would be hell. Yeah, right, that would be hell if that became eternal. And so we have to remember that what we get from the Fathers is that after the end of this life, there is a purification that happens. And the problem is, right, that I think at least us contemporary English speaking folks have kind of lacked the language to really explain what that means in orthodox circles. So again, just like we were talking about with the problematic way of understanding eternal life, I think, frankly, and again, I know this is going to get some of our Roman Catholic listeners mad at me because of course, I will be misrepresenting them, I'm sure for some of them, no matter what I say, I think that the understanding of purgatory is an over literalization of what this purification means. In the same way that thinking of eternal life as an endless succession of positive moments is an oversimplification of what eternal life means. That is, that is the idea of purgatory as purification, right? Is that the individual person, the individual human soul, because this happens while you don't have a body, has to be. Again, this ties identity to the soul, which is already a problem we talked about in the first half, right? That's assumed here, that your identity, including your sinfulness, everything, your actions are all qualities of your soul, not your body. Otherwise purgatory doesn't work prior to the Resurrection, which is where it's set forth. And that there is some kind of process that is consistently described throughout Medieval Roman Catholic literature as temporal, as taking place over time, sometimes very woodenly, literally. People are given literal time off purgatory. I understand that now, modern Roman Catholic doctrine stuff says that purgatory is more of a metaphor, it's not a place, et cetera, et cetera. I am aware of all that. Okay? But I don't see how those dovetail because you still have the prayers to get people, quote, unquote, time off purgatory. So I, I appreciate wanting to understand it in a more analogical way. That's better. But there's big holes in your analogy in that if you're going to say it's not temporal, then how can you get time off? How do indulgences work vis a vis that? I'm not a Roman Catholic. That's not for me to figure out. You guys figure that out. But, but it's on this individual basis and in this at least quasi literalized way. Right, but so, and of course, the orthodox Church has steadfastly, steadfastly rejected purgatory as such, I think, for these reasons, while still continuing to talk about purification after death. And I think that, again, the understanding that we're laying out, the way of thinking we're laying out helps understand it. Because if what is being made eternal, if what is being raised, if what is being transfigured is our actual life across time and space, lived in the world across our life, right. Then what is going to be purified is not our soul, is not the snapshot of who we are at the moment we died, that person. But what's going to have to be purified before it's made eternal is our whole life across time and space."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8531.24,"end":8555.76,"speaker":"Fr Andrew Stephen Damick","text":"Okay, so I have a question, and this is a real question, because there is a lot, like, everything you just said makes sense to me, but there is a lot of language in our hymnography and so forth that talks about the salvation of our souls. Or for instance, you know, like, in fact, The Apolitikian for St. Mary of Egypt, you know, she taught us to attend to the soul since it is immortal."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8556.32,"end":8556.76,"speaker":"Fr Stephen De Young","text":"Yes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8556.76,"end":8562.56,"speaker":"Fr Andrew Stephen Damick","text":"You know, like, you have all of this kind of stuff. So, like, what does that mean in. In this framework?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8562.64,"end":8564.16,"speaker":"Fr Stephen De Young","text":"Yes, it means our life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8564.88,"end":8572.72,"speaker":"Fr Andrew Stephen Damick","text":"Okay, okay, okay. It does not mean the soul in terms of the animating force, because how would."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8572.72,"end":8573.52,"speaker":"Fr Stephen De Young","text":"What would that mean?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8575.69,"end":8580.53,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah. This is the soul in terms of. And Adam became a living soul. Soul."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8580.53,"end":8581.53,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8581.53,"end":8581.89,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8581.89,"end":8587.13,"speaker":"Fr Stephen De Young","text":"Because if we're talking about take care of it as a thing. Right. What. I mean, what does that mean?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8587.69,"end":8594.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, yeah, I. I mean, that's the thing is, like, there's so. There's some ambiguity in the language."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8594.89,"end":8604.46,"speaker":"Fr Stephen De Young","text":"Right. We're so used to hearing soul and thinking of it as a thing. Yeah, right. You have this thing. Take care of it. Well, how do you take care of a soul?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8605.26,"end":8609.66,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. But you can take care of your life, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8610.14,"end":8616.82,"speaker":"Fr Stephen De Young","text":"Yeah, right. You can curate, you can garden, you can write all kinds of different."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8616.82,"end":8641.43,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, well, and actually, you know, it's interesting, I think that life, at least in English, kind of does this covers this semantic range, because we talk about life. Life in terms of, like, well, my whole life. I. Right. And that's the life that we're talking about. That's that. That soul in terms of the. The soul you attend to. Right. But then we also talk about, like, the life, you know, he. He's alive right now. You know, the life in the body."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8642.07,"end":8642.79,"speaker":"Fr Stephen De Young","text":"Right, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8643.03,"end":8647.51,"speaker":"Fr Andrew Stephen Damick","text":"So. So. So yeah, it. It has this semantic range. So this shouldn't be too hard for everybody."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8647.91,"end":8648.31,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8648.39,"end":8650.39,"speaker":"Fr Andrew Stephen Damick","text":"Because we already talked in this way."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8650.63,"end":8671.82,"speaker":"Fr Stephen De Young","text":"What does it profit a man to gain the whole world and lose his soul? Right. If you think your soul is like your spleen, that doesn't make any sense. Right. It's this constituent part of you. Right. Like it's your life. Right. He's making. Chris is making the point that Proverbs makes. Right. You accumulate all this wealth and then you die."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8672.7,"end":8676.06,"speaker":"Fr Andrew Stephen Damick","text":"Right? Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8676.22,"end":8678.74,"speaker":"Fr Stephen De Young","text":"Right. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8678.74,"end":8679.74,"speaker":"Fr Andrew Stephen Damick","text":"Okay. All right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8679.74,"end":8679.98,"speaker":"Fr Stephen De Young","text":"But."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8679.98,"end":8683.5,"speaker":"Fr Andrew Stephen Damick","text":"So I thought that was an important, Important clarification to make here."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8683.5,"end":8705.68,"speaker":"Fr Stephen De Young","text":"Yeah. So the, The. The purification we're talking about, because I've done this, is the purification of your whole life across time, space, relationship. All of this has to be purified. Right? Has to be purified. And I think it's this, that, for example, the famous purification passage in First Corinthians 3:11 through 15 is talking about."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8705.83,"end":8708.23,"speaker":"Fr Andrew Stephen Damick","text":"About. Yeah, yeah. So in case you're."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8708.31,"end":8709.03,"speaker":"Fr Stephen De Young","text":"The whole life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8709.27,"end":8749.55,"speaker":"Fr Andrew Stephen Damick","text":"In case you just can't, you know, quote. In case you don't know which. Which verses these are. It's. It's this one. It should be very familiar to you. You've heard it. For no one can lay a foundation other than that which is laid, which is Jesus Christ. Now, if anyone builds on the foundation with gold, silver, precious stones, wood, hay, straw, each one's work will become manifest for the day will disclose it, because it will be revealed by fire. And the fire will test what sort of work each one has done. If the work that anyone has built on the foundation survives, he will receive a reward. If anyone's work is burned up, he will suffer loss, though he himself will be saved. But only as through fire."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8752.99,"end":8761.15,"speaker":"Fr Stephen De Young","text":"Yes. So this is not talking about, like some kind of merits you've built up in your life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8762.55,"end":8771.51,"speaker":"Fr Andrew Stephen Damick","text":"No. And it should be stated that if someone has the foundation of Jesus Christ, that means he is a Christian. Like, this is about Christians. Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8771.91,"end":8775.99,"speaker":"Fr Stephen De Young","text":"Right. But this is talking about the purification of your life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8777.27,"end":8777.67,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8778.47,"end":8810.88,"speaker":"Fr Stephen De Young","text":"And that is determined by what, as we've been talking about, is determined by what you do that's shaping your identity. So this purification is like the purification of metal. That's what's used mostly in the Hebrew scriptures. Right. St. Paul here is using metal and gems. Right. Because those don't burn either. You subject it to incredible heat. You smelt it, that's unpleasant. But it removes all the impurities."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8813.45,"end":8813.57,"speaker":"Podcast Advertisement Voice","text":"And."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8813.57,"end":8830.81,"speaker":"Fr Stephen De Young","text":"You'Re left with the pure and the good. So apply this to what we're talking about. Right. So this. And again, this is A way of thinking. This is not. I don't even know what it would mean for this to be literal. But this is a way of thinking about it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8831.53,"end":8835.29,"speaker":"Fr Andrew Stephen Damick","text":"And we should say it's a way of thinking. It's not the only way."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8835.53,"end":8892.52,"speaker":"Fr Stephen De Young","text":"It's a way of thinking, a way. And it is a way that I think, as we've already shown and will continue to show in the rest of this half, helps make certain things that the fathers and stuff say intelligible, more intelligible than other ways of thinking about it. And so it's a helpful way of thinking about it, a useful way of thinking about it. So if we think about this as the day will come, I will die physically, my soul will leave my body then, right? And we've talked about the intermediate state before. But then the day with capital D will come, and I will stand before the judgment seat of Christ, and in that judgment, my life, my actual life, the life that I lived in the."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8892.52,"end":8892.8,"speaker":"Judah","text":"World."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8894.86,"end":8939.55,"speaker":"Fr Stephen De Young","text":"Which constitutes who I am, all my actions spread out across time. All of my relationships, all of those things get subjected to fire. And all of the garbage, all of the sin, all of the evil, all of the suffering, all of the pain, all of that gets burned away. And then what is left? Right? What is left? Those parts of my life, however many or few, great or small, that remain after that, right? Those moments where during my life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8941.31,"end":8941.67,"speaker":"Fr Andrew Stephen Damick","text":"Those."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":8941.67,"end":9003.22,"speaker":"Fr Stephen De Young","text":"Times when, during my life, those spaces and relationships and connections which during my life were permeated by the divine energies, the energies of God, by God's love, his joy, his peace, right? Those moments will also be permeated by his eternity, and they will be made eternal, and I will dwell within them eternally. Okay? This is a way of thinking. This is a way of thinking. And so within this way of thinking about it, if someone says, well, what about all those painful moments and those horrible experiences, right? Because some of them, as we've already talked about, right, our repentance may have shaped our identity, and that repentance required sin, right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9007.3,"end":9007.7,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9010.34,"end":9170.65,"speaker":"Fr Stephen De Young","text":"What would happen to those things that are burned away as a way of thinking about it phenomenologically, is that there would be a kind of forgetting rather than an eternal memory that those are things that would be forgotten, right? And you can keep the fruit of those things without keeping those things. A rose. Most roses grow out of thorn bushes, right? But once they've grown, you can pluck them from the thorn bush. You can burn the thorn bush if you want to at that point, right? And just keep the roses Right. So those good things, those aspects of our identity that are good and godly, that came out of suffering, that came out of us needing to find deep repentance for sin after the fact that sin can be burned away, that suffering can fall into forgetfulness, but the good fruit that came out of that can remain as part of our identity and who we are eternally. So this is what we're getting at. We're talking about the love, the joy, the peace, all of these things of this life. Right. Those things becoming eternal, the rest going away. It's not just an ongoing succession into the future of nice moments, but it's inhabiting the sacred moments of our life eternally. And so what that means is. Right. And what St. Paul is getting at in First Corinthians 3 in this understanding is that our goal in living this life and living our Christian life in this world is to multiply and extend those moments and to begin already to burn away and repent of and forget the others. Right. So the life of a saint is a life that was filled with the love of God, the joy that comes from God, the peace of God. And the person who St. Paul describes as being saved but by fire is someone who lived a life that maybe, you know, wasn't so permeated."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9171.61,"end":9173.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And there were bits and pieces."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9174.25,"end":9174.65,"speaker":"Fr Stephen De Young","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9175.93,"end":9189.06,"speaker":"Fr Andrew Stephen Damick","text":"There is the language in the New Testament of the those who are greater and those who are less in the kingdom of heaven. You know, they're in the kingdom, but some are greater and some are lesser."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9190.18,"end":9202.5,"speaker":"Fr Stephen De Young","text":"Right, Right. And so within this. Right. Any eventual hell after the Last Judgment would be a hell of one's own making."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9204.42,"end":9204.94,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9204.94,"end":9206.32,"speaker":"Fr Stephen De Young","text":"As we mentioned to the caller."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9208.23,"end":9208.35,"speaker":"Fr Andrew Stephen Damick","text":"It."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9208.35,"end":9223.67,"speaker":"Fr Stephen De Young","text":"Would come from a persistent and continual rejection. Right. Of the grace of God, which is God's actions, of his love, of his joy, of his peace throughout an entire life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9224.07,"end":9229.27,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And it's not. Again, it's not like, oh, you messed up, so bam, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9229.83,"end":9233.19,"speaker":"Fr Stephen De Young","text":"Right. No. A constant rejection through a whole life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9233.67,"end":9233.91,"speaker":"Podcast Advertisement Voice","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9234.55,"end":9244.95,"speaker":"Fr Stephen De Young","text":"And so now we turn to the Onion story, which is an old Russian folktale, but you can find it in Dostoevsky."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9245.51,"end":9245.99,"speaker":"Fr Andrew Stephen Damick","text":"Yes."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9246.47,"end":9250.31,"speaker":"Fr Stephen De Young","text":"If you could get farther into Brothers Karamazov than Father Andrew did."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9250.55,"end":9255.83,"speaker":"Fr Andrew Stephen Damick","text":"That's right. I always quit after the first 1500 pages or so. I can't, you know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9260.16,"end":9260.4,"speaker":"Luke","text":"So."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9262.88,"end":9411.5,"speaker":"Fr Stephen De Young","text":"This is a story that's recounted of. There's an old woman living in a village who was just a miserable old woman. She was angry, she was bitter. She never had a kind word for anyone. She was rude, lived alone, didn't want anyone near her, right? Completely curmudgeonly said horrible things to people. And the day comes and she dies. And so some of the people in her village, being good Christian people, go to their village priest. They start having memorial services for her. They start praying for her soul. They say, this miserable old woman definitely needs our prayers for her soul. That's how they respond to her wickedness and her attitude. And so God hears their prayers. And this is a folktale, remember? And so he assigns an angel sort of to her case, right? To see sort of what can be, what can be done with this woman who is now in Hades. And the angel sort of reviews her life, the life that she lived, and out of all of it, he only finds this one thing that he thinks maybe he can work with. There was this one time when she was walking home from the market, she saw someone who was hungry and in need, and she gave them an onion, right? So she did this one kind of nice charitable act once in her life, and that's pretty much it. So the angel goes to Hades with the onion, right, that she gave to this person. And he reaches out, he extends the onion toward her. She takes hold of the onion. He begins to pull her up out of Hades by the onion. And then suddenly the old woman yells, give me my onion. And yanks it away from the angel and falls back into Hades. I hope you weren't expecting a happy ending to a Russian folktale, because if so, you're barking up the wrong tree."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9411.5,"end":9419.77,"speaker":"Fr Andrew Stephen Damick","text":"Oh, man. Deacon Nicholas Kotar has entered the chat anyway."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9423.21,"end":9470.53,"speaker":"Fr Stephen De Young","text":"So that's a little dark, right? But this is your hypothetical worst case scenario. But the idea that's reflected in that folktale is the same kind of idea we're getting at tonight. So this woman is sort of your worst case scenario in terms of rejecting the love of God and the love of her neighbor and everything else, right? But there's this one moment, right? And if she sort of had followed through with that one moment, that one moment where she showed love to her neighbor, if she had followed through on that, she could have found salvation, right? And not just salvation in some kind of broad sense, but this is directly in this folktale, the sense of eternal life."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9472.28,"end":9472.52,"speaker":"Luke","text":"Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9473.16,"end":9551.52,"speaker":"Fr Stephen De Young","text":"That one moment of love and kindness could have become an eternal moment that she could dwell in with God for eternity. But she rejected that too. But she rejects that too. So as I said, hopefully from this, you know, you've gotten kind of an idea of this way of thinking about bodily resurrection and eternal life that we've been getting at. And I've been teasing that, and we've already seen some. But a few more here. Ways in which I think this way of thinking about it is helpful. Right. I think. I think this view helps where a lot of our contemporary views are problematic. I mean, the most common contemporary view of this doesn't even talk about the bodily resurrection. Right. You go the average person on the street who's religious or who even identifies as a Christian, and you say, what happens to you when you die? They're going to say, well, probably in the US Christians go to heaven and other people go to hell, Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9551.92,"end":9554.04,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. Or good people go to heaven, or."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9554.04,"end":9563.84,"speaker":"Fr Stephen De Young","text":"Good people go to heaven. If they're. Yeah. Especially if they don't identify as Christian, they'll say, good people go to heaven, bad people go to hell. There's nothing about the bodily resurrection even in there. Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9564.32,"end":9564.8,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9565.6,"end":9638.01,"speaker":"Fr Stephen De Young","text":"So that's obviously problematic. But even a lot of views of the bodily resurrection are like we said, you know, well, we'll be back alive and I guess doing stuff forever, singing or something. It's not totally clear what people think that will be. And I think this, obviously this. This way of thinking about gets past those kind of problems. But I think, more importantly, this explains a lot of the language of scripture, the analogies that are used about the life of the world to come. We've looked at a couple of them. But one of the problems, for example, in the early church, One of the main problems with chiliasm in the early church was that people tended, because we see this getting condemned all over the place. People tended to think of. Of paradise and of the life of the world to come and eternal life as being sort of a garden of earthly delights."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9638.81,"end":9639.29,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9639.53,"end":9653.93,"speaker":"Fr Stephen De Young","text":"You know, you're going to get to drink buckets of wine and eat all this good food and do all this stuff. Right. But let me suggest something here. Why would they go wrong in that particular way?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9658.98,"end":9659.22,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9659.3,"end":9673.94,"speaker":"Fr Stephen De Young","text":"Like there's no danger. Your average American, who you ask and they say, well, you go to heaven or hell when you die, there's no danger of them picturing heaven or hell. Well, definitely not hell, but picturing heaven as sort of a garden of earthly delights where you're eating and drinking and feasting all the time."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9675.22,"end":9675.62,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9676.66,"end":9716.62,"speaker":"Fr Stephen De Young","text":"At all. Right. Well, it seems to me that the way you would go wrong in that way would be if the way people were describing eternal life was in terms of this life becoming eternal. Right. Of the good and sacred moments of this life becoming eternal. If you're talking about it that way, then you could see how someone who's a little confused and say, oh, yeah, all the cool stuff I love in this life is going to become eternal. Right, right. It's gonna be like Baldur's Gate 3, but I'm not gonna finish after 100 hours. Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9717.26,"end":9720.22,"speaker":"Fr Andrew Stephen Damick","text":"Like, and all the bad stuff won't be in there."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9720.46,"end":9762.47,"speaker":"Fr Stephen De Young","text":"Yeah. Frozen yogurt anyway. Right. So you could see someone going wrong in that way. If what's being preached to them has to do with life in this world and this life becoming eternal, then going wrong in that way in the early church makes a lot of sense and needing to be corrected. This explains the eternal life and eternal death language that's used by the scriptures. You know, we'll get the annihilationist folks who will say, like, oh, see, eternal death, that means you cease to exist forever. It's like, wait a minute, wait a minute, wait a minute. Since what does death mean? Ceasing to exist."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9763.21,"end":9763.45,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9766.97,"end":9776.97,"speaker":"Fr Stephen De Young","text":"Right. I mean, if you're going to take eternal death literally, that would mean your soul stays separated from your body forever, not that it ceases to exist."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9779.77,"end":9780.17,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9780.17,"end":9782.49,"speaker":"Fr Stephen De Young","text":"Which in the intermediate state forever."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9783.21,"end":9788.85,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right. Which is explicitly not what the scripture says. There's going to be a body of resurrection."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9788.85,"end":9830.51,"speaker":"Fr Stephen De Young","text":"Yeah, yeah. And not what annihilationists argue for. So that kind of argument, that dog don't hunt, that may be even worse than the open theist thing. But maybe not. I don't know. So you got to bookend things. This also means that talking about, for example, earning eternal life makes absolutely no sense. Right. There's no way to bring earning or merit or any of that. Earning salvation. There's no way to bring any of that in. Right. That, like, that's not a paradigm that fits with this way of thinking at all. Because how could, how could you do that?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9835.07,"end":9836.51,"speaker":"Fr Andrew Stephen Damick","text":"Yeah, right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9836.83,"end":9884.49,"speaker":"Fr Stephen De Young","text":"Like that just. It doesn't make sense. Right. In this way of thinking. It also makes. If you've read much from orthodox sources on this, when orthodox sources talk about eternal condemnation. Because orthodox sources are not universalist when they talk about eternal condemnation. They don't talk about, quote, unquote, eternal conscious torment. We've gone into that before on the show. Why all three of those words don't mean what they think they mean. But that's not ever how the orthodox church expresses what eternal condemnation is. The most common thing that gets talked about in those discussions from orthodox sources is that eternal condemnation has to do with a diminution or loss of humanity."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9885.77,"end":9892.57,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. There's kind of a sub humanness. And you even have the language of becoming truly human to refer to salvation."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9893.13,"end":9927.06,"speaker":"Fr Stephen De Young","text":"Right. That salvation in Christ is to be in Christ is become truly human. And so then the opposite of that is to have your humanity diminished. That language makes a whole lot of sense with this way of thinking about eternal life. Right. If everything about your human life is burned away and you're left with nothing, then the diminution or loss of your humanity as a way of speaking in a metaphor makes a whole lot of sense."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9928.58,"end":9928.98,"speaker":"Fr Andrew Stephen Damick","text":"Right."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9929.06,"end":9938.07,"speaker":"Fr Stephen De Young","text":"Whereas it's just kind of vague otherwise. I'm not saying this is the only way of thinking about it where that makes sense, but this is a way of thinking about it where that makes a lot of sense."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9938.39,"end":9938.87,"speaker":"Fr Andrew Stephen Damick","text":"Yeah."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9939.35,"end":9943.19,"speaker":"Fr Stephen De Young","text":"Where these things kind of fit together around this way of thinking about it."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9943.67,"end":9971.97,"speaker":"Fr Andrew Stephen Damick","text":"Yeah. And you know, it occurs to me like that sense that this is not earnable. Right. I think an analogy that would work or simile is probably the right word. Yes. It's like saying that being in good health is earnable. Like if you work, you know, like if you work out a lot, that that earns you good health. It doesn't. Like you don't not buying it by doing a thing."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9972.29,"end":9974.89,"speaker":"Fr Stephen De Young","text":"You could still die of a heart attack from a heart defect. You don't know."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9974.89,"end":9996.9,"speaker":"Fr Andrew Stephen Damick","text":"That's right. That's right. But you know, it's. It's really about changing and transforming and training, you know, that's. That's where, why it takes you there. You know, it's not, it's not, it's not like, okay, if I spend this amount of time at the gym, then I get this. No, no, that's not how that works."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":9996.9,"end":10016.91,"speaker":"Fr Stephen De Young","text":"Yeah. There's no quid pro quo. Yeah, yeah. But to me, at least the most important part and what set me down this path of thinking this through and thinking this way, aside from Nietzsche. No, I won't go into that any further."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10018.03,"end":10020.19,"speaker":"Fr Andrew Stephen Damick","text":"Well, if Nietzsche couldn't teach you, you."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10020.19,"end":10376.26,"speaker":"Fr Stephen De Young","text":"Had to go to Pageau Fest to know more about that angle. But to me, the most important thing, most important result of thinking about it in this way, and in the six months or so since Pageau Fest, I've been thinking about it more, is that this firmly places the emphasis of the Christian life on this life that we live here in this world. There's a common characterization of Christian belief that to a certain extent is a straw man used by your local Internet atheist, but it's a straw man when you're talking about. So this is this is always one of the problems, right? This is a straw man. If you're talking about sort of the great tradition of Christian theology in terms of what the average person who identifies as a Christian believes, it's probably not a straw man, right? So one way to construct a strawman is to select the worst representatives of your opponent, right? Sort of the ones who have actually thought about it the least. Right. Or the ones that say the least supportable things and use them as an example of the whole. That's one way to construct a strawman argument. And so then you defeat that and claim you've defeated the whole, but that's that. That Christianity, because of this emphasis on a quote unquote afterlife or the life of the world to come, or heaven, or however it's expressed, because of that, it is by nature an otherworldly religion and therefore minimizes the importance of our life in this world and the things we do in this world and taking care of this world or caring for people or caring about injustice in this world, et cetera, et cetera, et cetera. And like I said, in terms of the great tradition of Christian theology, in terms of the Scriptures, in terms of that, that's a straw man. But in terms of a lot of people walking around calling themselves Christians and how they think and act, not really a straw man kind of fits, right? Kind of fits. Um, it's easy to fall into this idea of. Especially when. Especially when there are certain types, especially of Protestant Christianity, that put this enormous stress on the idea of assurance of salvation, right? Make it a linchpin, right? They'll say, like, well, no, I accept this theology and not that that theology, because this theology gives me assurance of salvation. Now, there's a certain irony there, right? In that, well, okay, that theology, if it's true, gives you assurance of salvation, but how do you know it's true? Right, right. Like, because I like it. There's an issue there, right? Because I want to have insurance of my salvation. But placing the emphasis there on your own personal assurance that you are saved has this kind of ripple effect. And that ripple effect is that then in this life, my goal is, okay, whatever the things are, I need to do, what must I do to be saved, right? Whatever those things are, right? Whether it's just believe, whether it's believe and be baptized, whether it's believe and receive the sacraments of the church, whether it's whatever else we want to put in there, right? Believe and accumulate merit through good works. Whatever you want to put in there. If your Focus is on assurance. Then the way you're going to look at life is, okay, I get those things squared away and then do whatever, right? Get wealthy, enjoy good things, do whatever. As long as I got that after I die, things squared away, we're good. That is a temptation into which a lot of people fall. But if we think about eternal life in this way, right? That's precluded. That's precluded. Because the life of the world to come, eternal life, the life that's going to be eternal is this life. And if this life is going to be our eternity, then our whole focus in this life should be transforming our life in this world, transforming who we are, transforming our identity in Christ through repentance, through participating in God's love, his joy, his peace by being a peacemaker. All of these things. That is what the focus of our whole life here will become. Because we want all of those things in our life that we can possibly get, because we want to spend eternity there right in those things. And I think refocusing our Christian lives on our Christian lives in this world, with the people in our world, with the things in our world over the course of the time we have in this world, is the most important thing. And, you know, I think I just kind of gave my final thought, so I will let you give your final thought, Father Andrew, and then we could just wrap up."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10376.66,"end":10381.7,"speaker":"Fr Andrew Stephen Damick","text":"Wow. I don't know what to say about that."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10383.7,"end":10385.54,"speaker":"Fr Stephen De Young","text":"I'm breaking the format. I don't care."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10385.88,"end":10386.92,"speaker":"Fr Andrew Stephen Damick","text":"I know you're just."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10387.16,"end":10388.68,"speaker":"Fr Stephen De Young","text":"Yeah, I'm out of control."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10390.12,"end":10787.78,"speaker":"Fr Andrew Stephen Damick","text":"He's a wild one, folks. Yeah. So I know some people are probably thinking, like, wait a minute, aren't they going to do a transfiguration episode? Won't it be too late to do it later? And although this episode was not aimed at the Feast of the Transfiguration, kind of working through all that, we have in many cases, we have made reference to those events on many occasions. But I do want to talk about the transfiguration a little bit because it shows us some of what's going on here in terms of what the resurrection of the body means, right? So the Lord Jesus Christ standing on Mount Tabor, Peter, James and John going up there with him, and the prophets Moses and Elias appear there with him, and they're speaking with him. And I think the thing that a lot of people come away from the scene with, and this is correct, like this is not wrong, is, you know, when Jesus transfigured, he shines from his body. This shows that he's God, Right? And certainly, like, this is reflected in the hymnography of the feast. In fact, he explicitly says that Peter, James, and John see this so that when he's crucified, they would know it was voluntary. Like, look, he's God, okay? So when he's crucified, it's voluntary. No one did that to him in the sense of they overpowered him. And of course, Christ himself says, no one takes my life from me. I lay it down of my own accord. So that is true. But also what we're seeing there with the two prophets who are with him, one of whom is taken up into heaven even while still living in the body. And that's Elias. And then, of course, the prophet Moses, we get that reference about his. His body being taken up because there's this, you know, fight over his body between the archangel Michael and the devil, as is mentioned in the New Testament, that they're both participating, maybe in different ways. Hard for me to know at this point in this life, but they're both participating in the bodily resurrection. And while we can't say exactly what that's like because not just the bad thing, but, you know, whatever, there's some indications, and we do have, as we've mentioned many, many times in this podcast, Christ saying that the sons of the resurrection, sons of God, equal to the angels, right? So that sense that they function in an angelic way. So clearly there's. Their bodies are less limited than human bodies are. In this life that we're experiencing now, there is more importantly, a communion with Christ, a vision of Christ in glory that they're experiencing. I mean, in the epistle reading, that is for the feast from St. Peter's Second Epistle, when he talks about the transfiguration that he saw, that he. He witnessed himself, he says he opens up that passage by saying that it's about our entrance into the kingdom of God, and he wants to remind us of this so that we can be faithful, so that we can make that entrance into the kingdom of God. Right? And it's interesting that he wouldn't say, make sure you're good so that you can go to heaven when you die, whatever. But instead he says, I want to remind you of this thing that we saw. And it's about the kingdom of God, that Christ, as God, ascended on the mountain, which becomes, as St. Peter says in that passage, the holy mountain. Right? It becomes the holy mountain. This is the life of the age to come. This is another way of understanding the life of the age to Come. And so this vision of Christ in glory is given to Peter, James and John, and he tells us about it. He's an eyewitness. We receive his witness so that we can be faithful, so that we can know what we're moving towards. Because as Father Stephen just said, the life of the age to come is not just an endless series of moments. And it's not just even an endless series of moments in which good things are happening and no bad thing ever happens. No, no, no. It is of a much higher order than even the best possible moments that we can imagine in this life. And that's expressed in what happens in the transfiguration, right? That is what the kingdom of God looks like, or it's one way of understanding the kingdom of God. As we know, Christ gives a number. Christ himself gives a number of different images. For the kingdom of God is like this. The kingdom of God is like this. But also the kingdom of God is very much like this. It's like what happens on Tabor. Right? And that the destiny of mankind in Christ is to be having the experience that Moses and Elias are having there with him, experiencing the resurrection, communing with the glorified Christ in his human body. Right. When he's transfigured, his human body doesn't disappear and then they just see this blinding light. No, they see it coming from his human body. You know, so in a sense, a lot of this is about the transfiguration. Not just that one event that happens that we find in the Gospels, but about what that tells us about the kingdom of God, what that tells us about Christ in glory, what that tells us about the saints in Christ's glory, that they have, as Christ himself prayed for in his great high priestly prayer, that the glory that God the Father gave to him, that he gives them that glory, that's not a metaphor, that's a reality. And the transfiguration shows us what that reality looks like from a particular angle."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10788.58,"end":10788.98,"speaker":"Fr Stephen De Young","text":"Right?"}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10789.78,"end":10959.04,"speaker":"Fr Andrew Stephen Damick","text":"And so what you do with that is you keep that in front of you. Just like St. Paul says, I press towards the mark of the high calling of God. This is the high calling he's talking about. It's no coincidence that he uses the word high to refer to it, that it is this ascent. Again, we made reference to the ladder of divine ascent. It is this ascension. Now, in this life, there's, as we mentioned, some ascension, some stumbling back, but nonetheless, the Christian life is about this ascension up the mountain. And it's not just to reach some point of greatness. But it is that divine counsel of communion with God, of becoming sons of God, of becoming part of his royal family, and that all the good that is our life in this life, all of that doesn't just continue, but becomes elevated and glorified and magnified and has the character of eternality about it. And that should give us a lot of hope, a lot to be grateful for, a lot to keep us steady in times of difficulty. Not just this is in the future sometime, but also this is now. And so every moment of goodness now is eternal. That's really amazing to think about that. Every moment of communion, every moment of love, every moment of faithfulness, all of this participates in Christ and therefore is eternal. It's difficult to understand, but it is, I believe, profoundly comforting. Not just in the sense of okay, everything's going to be okay, but rather that it lifts us up and gives us this high hope so that we can always be pressing forward throughout our lives. So that's what I have to say about all that. Thank you very much everyone for listening. That is our show for tonight. If you didn't happen to get through to us live this time around, we'd still like to hear from you. And you can email us at LordOfSpiritsand Ancient Faith.com you can message our Facebook page. Of course, Facebook isn't real, but you can also leave us a voicemail@speakpipe.com LordOfSpirits and if you have basic questions about Orthodox Christianity or you need help to find a parish, go to orthodoxintro.org and."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10959.04,"end":10969.28,"speaker":"Fr Stephen De Young","text":"Join us for our live broadcast on the second and fourth Thursdays of the month at 7pm Eastern, 4pm Pacific. It's a cool place. They say it gets colder. You're bundled up now. Wait till you get older."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10970.16,"end":10983.37,"speaker":"Fr Andrew Stephen Damick","text":"If you're on Facebook, follow our page, Join our Discussion group Leave a Rating Somewhere Reviews but most importantly, please share this show with your your friends and you know, have a discussion group with them about it at your parish."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10984.09,"end":10994.25,"speaker":"Fr Stephen De Young","text":"And finally, be sure to go to ancientfaith.com stroke support help make sure we and lots of other AFR podcasters stay on the air. The meteor men beg to differ judging by the hole in the satellite picture."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":10995.21,"end":10998.09,"speaker":"Fr Andrew Stephen Damick","text":"Thank you, good night and God bless."}
{"episode_id":"LOS - #098 - 2024-08-08 - Some Body","start":11006.58,"end":11043.63,"speaker":"Announcer","text":"You've been listening to the Lord of Spirits with Orthodox Christian priests, Father Andrew, Stephen Damick and Father Stephen DeYoung, a listener supported presentation of Ancient Faith Radio and I beheld and I heard the voice of many angels round about the throne and the beasts and the elders and the number of them was 10,000 times 10,000 and thousands of thousands, saying with a loud voice, worthy is the Lamb that was slain to receive power and riches and wisdom and strength and honor and glory and Blessing. Revelation, chapter 5, verses 11 through 12."}
